.segment "BANK_1A"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000
; 0x034010-0x03800F



.export loc_0x03404C
.export loc_0x034137
.export loc_0x034508
.export sub_0x0345BC
.export loc_0x034706
.export sub_0x0347F1
.export sub_0x034845
.export sub_0x03489D
.export sub_0x0348B8
.export loc_0x034903
.export sub_0x034B5A
.export loc_0x034BF5
.export sub_0x034CB4
.export sub_0x034E96_катсцена_драйв_оверхеда
.export sub_0x034F82
.export sub_0x03505E
.export sub_0x0355F1_вычисление_счета_пенальти
.export sub_0x036113
.export sub_0x0361FB_отрисовка_чарли_на_фоне



loc_0x03404C:
C D 0 - - - 0x03404C 1A:803C: A9 00     LDA #$00
C - - - - - 0x03404E 1A:803E: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034051 1A:8041: 8D 21 06  STA ram_0621
C - - - - - 0x034054 1A:8044: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034057 1A:8047: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x034059 1A:8049: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03405C 1A:804C: 20 72 8F  JSR sub_8F72
C - - - - - 0x03405F 1A:804F: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034062 1A:8052: D0 06     BNE bra_805A_защитники_есть
C - - - - - 0x034064 1A:8054: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x034067 1A:8057: 4C 27 81  JMP loc_8127_никто_не_напал_на_игрока
bra_805A_защитники_есть:
C - - - - - 0x03406A 1A:805A: 20 23 82  JSR sub_8223_блок_ишизаки_будет_последним_защитным_действием
C - - - - - 0x03406D 1A:805D: A9 00     LDA #$00
C - - - - - 0x03406F 1A:805F: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034072 1A:8062: AD E2 00  LDA ram_random + $01
C - - - - - 0x034075 1A:8065: 29 07     AND #$07
bra_8067_loop:
C - - - - - 0x034077 1A:8067: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x03407A 1A:806A: 90 05     BCC bra_8071
C - - - - - 0x03407C 1A:806C: ED 00 06  SBC ram_колво_защитников
C - - - - - 0x03407F 1A:806F: B0 F6     BCS bra_8067_loop
bra_8071:
C - - - - - 0x034081 1A:8071: 8D 17 06  STA ram_колво_активных_защитников
loc_8074:
C D 0 - - - 0x034084 1A:8074: AE 17 06  LDX ram_колво_активных_защитников
C - - - - - 0x034087 1A:8077: 30 08     BMI bra_8081
C - - - - - 0x034089 1A:8079: EC 16 06  CPX ram_индекс_защитника
C - - - - - 0x03408C 1A:807C: D0 03     BNE bra_8081
C - - - - - 0x03408E 1A:807E: 20 76 81  JSR sub_8176
bra_8081:
C - - - - - 0x034091 1A:8081: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034094 1A:8084: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034097 1A:8087: C9 06     CMP #$06
C - - - - - 0x034099 1A:8089: D0 03     BNE bra_808E
C - - - - - 0x03409B 1A:808B: 4C DC 80  JMP loc_80DC
bra_808E:
C - - - - - 0x03409E 1A:808E: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0340A1 1A:8091: BC 06 06  LDY ram_подтип_действия_защитника,X
C - - - - - 0x0340A4 1A:8094: 8C 3E 04  STY ram_подтип_действия_защиты
C - - - - - 0x0340A7 1A:8097: C9 00     CMP #$00
C - - - - - 0x0340A9 1A:8099: D0 10     BNE bra_80AB
C - - - - - 0x0340AB 1A:809B: C0 01     CPY #$01
C - - - - - 0x0340AD 1A:809D: D0 0C     BNE bra_80AB
C - - - - - 0x0340AF 1A:809F: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0340B4 1A:80A4: F0 05     BEQ bra_80AB
C - - - - - 0x0340B6 1A:80A6: A9 00     LDA #$00
C - - - - - 0x0340B8 1A:80A8: 8D 3E 04  STA ram_подтип_действия_защиты
bra_80AB:
C - - - - - 0x0340BB 1A:80AB: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0340BE 1A:80AE: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0340C1 1A:80B1: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x0340C3 1A:80B3: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x0340C6 1A:80B6: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x0340C9 1A:80B9: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0340CC 1A:80BC: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0340CF 1A:80BF: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0340D2 1A:80C2: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0340D5 1A:80C5: 0A        ASL
C - - - - - 0x0340D6 1A:80C6: 0A        ASL
C - - - - - 0x0340D7 1A:80C7: 6D 3D 04  ADC ram_действие_защиты
C - - - - - 0x0340DA 1A:80CA: AA        TAX
C - - - - - 0x0340DB 1A:80CB: 0A        ASL
C - - - - - 0x0340DC 1A:80CC: 85 3B     STA ram_003B
C - - - - - 0x0340DE 1A:80CE: A9 00     LDA #$00
C - - - - - 0x0340E0 1A:80D0: BC 7C 82  LDY tbl_827C,X
C - - - - - 0x0340E3 1A:80D3: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x0340E6 1A:80D6: 20 32 81  JSR sub_8132
C - - - - - 0x0340E9 1A:80D9: 20 4C 81  JSR sub_814C
loc_80DC:
C D 0 - - - 0x0340EC 1A:80DC: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0340EF 1A:80DF: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0340F2 1A:80E2: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0340F5 1A:80E5: F0 03     BEQ bra_80EA
C - - - - - 0x0340F7 1A:80E7: 4C 74 80  JMP loc_8074
bra_80EA:
C - - - - - 0x0340FA 1A:80EA: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
loc_80ED:
C D 0 - - - 0x0340FD 1A:80ED: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034100 1A:80F0: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034103 1A:80F3: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034106 1A:80F6: FE 80     .word ofs_038_80FE_00
- D 0 - I - 0x034108 1A:80F8: 07 81     .word ofs_038_8107_01
- D 0 - I - 0x03410A 1A:80FA: 18 81     .word ofs_038_8118_02
- D 0 - I - 0x03410C 1A:80FC: 1E 81     .word ofs_038_811E_03



ofs_038_80FE_00:
C - - J - - 0x03410E 1A:80FE: 20 70 81  JSR sub_8170
C - - - - - 0x034111 1A:8101: A2 50     LDX #$50
C - - - - - 0x034113 1A:8103: 9A        TXS
C - - - - - 0x034114 1A:8104: 4C 18 C6  JMP loc_0x03DD0D



ofs_038_8107_01:
C - - J - - 0x034117 1A:8107: 20 1E C6  JSR sub_0x03E069
C - - - - - 0x03411A 1A:810A: A9 0A     LDA #con_bsw_1C_05
C - - - - - 0x03411C 1A:810C: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03411F 1A:810F: 20 70 81  JSR sub_8170
C - - - - - 0x034122 1A:8112: A2 50     LDX #$50
C - - - - - 0x034124 1A:8114: 9A        TXS
C - - - - - 0x034125 1A:8115: 4C 12 C6  JMP loc_0x03DE62



ofs_038_8118_02:
C - - J - - 0x034128 1A:8118: A2 50     LDX #$50
C - - - - - 0x03412A 1A:811A: 9A        TXS
C - - - - - 0x03412B 1A:811B: 4C 0F C6  JMP loc_0x03E0EF



ofs_038_811E_03:
C - - J - - 0x03412E 1A:811E: 20 70 81  JSR sub_8170
C - - - - - 0x034131 1A:8121: A2 50     LDX #$50
C - - - - - 0x034133 1A:8123: 9A        TXS
C - - - - - 0x034134 1A:8124: 4C 21 C6  JMP loc_0x03DFE9



loc_0x034137:
loc_8127_никто_не_напал_на_игрока:
C D 0 - - - 0x034137 1A:8127: 20 DD 90  JSR sub_90DD
C - - - - - 0x03413A 1A:812A: A9 00     LDA #$00
C - - - - - 0x03413C 1A:812C: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x03413F 1A:812F: 4C ED 80  JMP loc_80ED



sub_8132:
loc_8132:
C D 0 - - - 0x034142 1A:8132: 48        PHA
C - - - - - 0x034143 1A:8133: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x034146 1A:8136: 0A        ASL
C - - - - - 0x034147 1A:8137: 0A        ASL
C - - - - - 0x034148 1A:8138: AA        TAX
C - - - - - 0x034149 1A:8139: 68        PLA
C - - - - - 0x03414A 1A:813A: A0 00     LDY #$00
bra_813C_loop:
C - - - - - 0x03414C 1A:813C: DD 8C 82  CMP tbl_828C,X
C - - - - - 0x03414F 1A:813F: B0 04     BCS bra_8145_запись_результата_рандома_пк
C - - - - - 0x034151 1A:8141: C8        INY
C - - - - - 0x034152 1A:8142: E8        INX
C - - - - - 0x034153 1A:8143: D0 F7     BNE bra_813C_loop
bra_8145_запись_результата_рандома_пк:
C - - - - - 0x034155 1A:8145: 4C 48 81  STY ram_результат_защитника
                                        RTS



sub_814C:
C - - - - - 0x03415C 1A:814C: 2C 17 06  BIT ram_колво_активных_защитников
C - - - - - 0x03415F 1A:814F: 30 03     BMI bra_8154
C - - - - - 0x034161 1A:8151: 20 33 8E  JSR sub_8E33
bra_8154:
C - - - - - 0x034164 1A:8154: A9 00     LDA #con_s_id_00
C - - - - - 0x034166 1A:8156: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034169 1A:8159: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03416C 1A:815C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03416F 1A:815F: 69 81     .word ofs_039_8169_00
- D 0 - I - 0x034171 1A:8161: 9C 81     .word ofs_039_819C_01
- D 0 - I - 0x034173 1A:8163: BC 81     .word ofs_039_81BC_02
- D 0 - I - 0x034175 1A:8165: D1 81     .word ofs_039_81D1_03
- D 0 - I - 0x034177 1A:8167: EA 81     .word ofs_039_81EA_04_нарушение



ofs_039_8169_00:
C - - J - - 0x034179 1A:8169: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03417C 1A:816C: 38        SEC
C - - - - - 0x03417D 1A:816D: 4C 95 90  JMP loc_9095



sub_8170:
C - - - - - 0x034180 1A:8170: 2C 17 06  BIT ram_колво_активных_защитников
C - - - - - 0x034183 1A:8173: 10 01     BPL bra_8176
C - - - - - 0x034185 1A:8175: 60        RTS
bra_8176:
sub_8176:
C - - - - - 0x034186 1A:8176: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x034189 1A:8179: E0 02     CPX #$02    ; dribble
C - - - - - 0x03418B 1A:817B: F0 1E     BEQ bra_819B_RTS
C - - - - - 0x03418D 1A:817D: A9 00     LDA #$00
C - - - - - 0x03418F 1A:817F: 8D 2D 06  STA ram_062D
C - - - - - 0x034192 1A:8182: BD 78 82  LDA tbl_8278_сценарий,X
C - - - - - 0x034195 1A:8185: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034198 1A:8188: AD 44 04  LDA ram_спешал_атакующего
C - - - - - 0x03419B 1A:818B: 29 03     AND #$03
C - - - - - 0x03419D 1A:818D: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x0341A0 1A:8190: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x0341A3 1A:8193: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x0341A6 1A:8196: 09 80     ORA #$80
C - - - - - 0x0341A8 1A:8198: 8D 17 06  STA ram_колво_активных_защитников
bra_819B_RTS:
C - - - - - 0x0341AB 1A:819B: 60        RTS



ofs_039_819C_01:
C - - J - - 0x0341AC 1A:819C: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x0341AF 1A:819F: 38        SEC
C - - - - - 0x0341B0 1A:81A0: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x0341B3 1A:81A3: ED 19 06  SBC ram_снижение_силы_действия
C - - - - - 0x0341B6 1A:81A6: AA        TAX
C - - - - - 0x0341B7 1A:81A7: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x0341BA 1A:81AA: E9 00     SBC #$00
C - - - - - 0x0341BC 1A:81AC: 10 04     BPL bra_81B2
- - - - - - 0x0341BE 1A:81AE: A2 00     LDX #$00
- - - - - - 0x0341C0 1A:81B0: A9 00     LDA #$00
bra_81B2:
C - - - - - 0x0341C2 1A:81B2: 8E 1C 06  STX ram_сила_действия_lo
C - - - - - 0x0341C5 1A:81B5: 8D 1D 06  STA ram_сила_действия_hi
C - - - - - 0x0341C8 1A:81B8: 38        SEC
C - - - - - 0x0341C9 1A:81B9: 4C 95 90  JMP loc_9095



loc_81BC:
ofs_039_81BC_02:
C D 0 - - - 0x0341CC 1A:81BC: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0341CF 1A:81BF: 18        CLC
C - - - - - 0x0341D0 1A:81C0: 20 95 90  JSR sub_9095
C - - - - - 0x0341D3 1A:81C3: A9 00     LDA #$00
C - - - - - 0x0341D5 1A:81C5: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x0341D8 1A:81C8: 20 ED 81  JSR sub_81ED_неудачное_действие
C - - - - - 0x0341DB 1A:81CB: A2 50     LDX #$50
C - - - - - 0x0341DD 1A:81CD: 9A        TXS
C - - - - - 0x0341DE 1A:81CE: 4C DF 8B  JMP loc_8BDF



ofs_039_81D1_03:
C - - J - - 0x0341E1 1A:81D1: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0341E4 1A:81D4: 18        CLC
C - - - - - 0x0341E5 1A:81D5: 20 95 90  JSR sub_9095
C - - - - - 0x0341E8 1A:81D8: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x0341EB 1A:81DB: 20 ED 81  JSR sub_81ED_неудачное_действие
loc_81DE:
C D 0 - - - 0x0341EE 1A:81DE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0341F1 1A:81E1: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0341F4 1A:81E4: A2 50     LDX #$50
C - - - - - 0x0341F6 1A:81E6: 9A        TXS
C - - - - - 0x0341F7 1A:81E7: 4C 0F C6  JMP loc_0x03E0EF



sub_81ED_неудачное_действие:
; срабатывает когда защитник отбил твой пас или удар и мяч полетел в сторону
C - - - - - 0x0341FD 1A:81ED: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034202 1A:81F2: D0 2E     BNE bra_8222_RTS        ; не удар
C - - - - - 0x034204 1A:81F4: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x034209 1A:81F9: D0 27     BNE bra_8222_RTS        ; не блок/перехват
C - - - - - 0x03420B 1A:81FB: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - - 0x03420E 1A:81FE: 29 7F     AND #$7F
C - - - - - 0x034210 1A:8200: C9 01     CMP #$01
C - - - - - 0x034212 1A:8202: D0 1E     BNE bra_8222_RTS
C - - - - - 0x034214 1A:8204: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034217 1A:8207: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x03421A 1A:820A: A9 50     LDA #$50
C - - - - - 0x03421C 1A:820C: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x03421F 1A:820F: A9 00     LDA #$00
C - - - - - 0x034221 1A:8211: 8D 40 04  STA ram_затрата_энергии_hi
C - - - - - 0x034224 1A:8214: 20 FB 8F  JSR sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов
C - - - - - 0x034227 1A:8217: A9 00     LDA #$00
C - - - - - 0x034229 1A:8219: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x03422C 1A:821C: A2 50     LDX #$50
C - - - - - 0x03422E 1A:821E: 9A        TXS
C - - - - - 0x03422F 1A:821F: 4C DF 8B  JMP loc_8BDF
bra_8222_RTS:
C - - - - - 0x034232 1A:8222: 60        RTS



sub_8223_блок_ишизаки_будет_последним_защитным_действием:
C - - - - - 0x034233 1A:8223: A2 00     LDX #$00
bra_8225_loop_поиска_ишизаки:
C - - - - - 0x034235 1A:8225: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034238 1A:8228: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x03423B 1A:822B: A0 00     LDY #con_plr_id
C - - - - - 0x03423D 1A:822D: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x03423F 1A:822F: C9 14     CMP #con_p_ishizaki_my
C - - - - - 0x034241 1A:8231: F0 0B     BEQ bra_823E_ишизаки_найден
C - - - - - 0x034243 1A:8233: C9 49     CMP #con_p_ishizaki_japan
C - - - - - 0x034245 1A:8235: F0 07     BEQ bra_823E_ишизаки_найден
C - - - - - 0x034247 1A:8237: E8        INX
C - - - - - 0x034248 1A:8238: EC 00 06  CPX ram_колво_защитников
C - - - - - 0x03424B 1A:823B: D0 E8     BNE bra_8225_loop_поиска_ишизаки
C - - - - - 0x03424D 1A:823D: 60        RTS
bra_823E_ишизаки_найден:
C - - - - - 0x03424E 1A:823E: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034251 1A:8241: D0 34     BNE bra_8277_RTS
C - - - - - 0x034253 1A:8243: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034256 1A:8246: D0 2F     BNE bra_8277_RTS
C - - - - - 0x034258 1A:8248: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x03425B 1A:824B: C9 01     CMP #$01
C - - - - - 0x03425D 1A:824D: D0 28     BNE bra_8277_RTS
C - - - - - 0x03425F 1A:824F: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034262 1A:8252: 48        PHA
C - - - - - 0x034263 1A:8253: AC 00 06  LDY ram_колво_защитников
C - - - - - 0x034266 1A:8256: 88        DEY
C - - - - - 0x034267 1A:8257: B9 01 06  LDA ram_номер_защитника,Y
C - - - - - 0x03426A 1A:825A: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x03426D 1A:825D: B9 0B 06  LDA ram_действие_защитника,Y
C - - - - - 0x034270 1A:8260: 9D 0B 06  STA ram_действие_защитника,X
C - - - - - 0x034273 1A:8263: B9 06 06  LDA ram_подтип_действия_защитника,Y
C - - - - - 0x034276 1A:8266: 9D 06 06  STA ram_подтип_действия_защитника,X
C - - - - - 0x034279 1A:8269: A9 01     LDA #$01
C - - - - - 0x03427B 1A:826B: 99 06 06  STA ram_подтип_действия_защитника,Y
C - - - - - 0x03427E 1A:826E: A9 00     LDA #$00
C - - - - - 0x034280 1A:8270: 99 0B 06  STA ram_действие_защитника,Y
C - - - - - 0x034283 1A:8273: 68        PLA
C - - - - - 0x034284 1A:8274: 99 01 06  STA ram_номер_защитника,Y
bra_8277_RTS:
C - - - - - 0x034287 1A:8277: 60        RTS



tbl_8278_сценарий:
    .byte con_s_id_1D ; 00 shoot
    .byte con_s_id_18 ; 01 pass
    .byte con_s_id_00 ; 02 dribble (placeholder)
    .byte con_s_id_1_2_start ; 03 1-2 pass



tbl_827C:
- D 0 - - - 0x03428C 1A:827C: 80        .byte $80   ; 00 
- D 0 - - - 0x03428D 1A:827D: 00        .byte $00   ; 01 
- D 0 - - - 0x03428E 1A:827E: 00        .byte $00   ; 02 
- - - - - - 0x03428F 1A:827F: 00        .byte $00   ; 03 
- D 0 - - - 0x034290 1A:8280: 00        .byte $00   ; 04 
- D 0 - - - 0x034291 1A:8281: 00        .byte $00   ; 05 
- D 0 - - - 0x034292 1A:8282: 80        .byte $80   ; 06 
- - - - - - 0x034293 1A:8283: 00        .byte $00   ; 07 
- D 0 - - - 0x034294 1A:8284: 00        .byte $00   ; 08 
- D 0 - - - 0x034295 1A:8285: 80        .byte $80   ; 09 
- D 0 - - - 0x034296 1A:8286: 00        .byte $00   ; 0A 
- - - - - - 0x034297 1A:8287: 00        .byte $00   ; 0B 
- D 0 - - - 0x034298 1A:8288: 00        .byte $00   ; 0C 
- D 0 - - - 0x034299 1A:8289: 00        .byte $00   ; 0D 
- D 0 - - - 0x03429A 1A:828A: 80        .byte $80   ; 0E 
- - - - - - 0x03429B 1A:828B: 00        .byte $00   ; 0F 



tbl_828C:
; 00 
- D 0 - - - 0x03429C 1A:828C: 9A        .byte $9A
- D 0 - - - 0x03429D 1A:828D: 60        .byte $60
- D 0 - - - 0x03429E 1A:828E: 30        .byte $30
- D 0 - - - 0x03429F 1A:828F: 00        .byte $00
; 01 
- D 0 - - - 0x0342A0 1A:8290: 9A        .byte $9A
- D 0 - - - 0x0342A1 1A:8291: 60        .byte $60
- D 0 - - - 0x0342A2 1A:8292: 44        .byte $44
- D 0 - - - 0x0342A3 1A:8293: 00        .byte $00
; 02 
- D 0 - - - 0x0342A4 1A:8294: 9A        .byte $9A
- D 0 - - - 0x0342A5 1A:8295: 60        .byte $60
- D 0 - - - 0x0342A6 1A:8296: 44        .byte $44
- D 0 - - - 0x0342A7 1A:8297: 00        .byte $00



loc_8298:
C D 0 - - - 0x0342A8 1A:8298: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x0342AA 1A:829A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x0342AD 1A:829D: 20 72 8F  JSR sub_8F72
C - - - - - 0x0342B0 1A:82A0: A9 01     LDA #con_s_id_01
C - - - - - 0x0342B2 1A:82A2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0342B5 1A:82A5: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x0342B8 1A:82A8: D0 0C     BNE bra_82B6
C - - - - - 0x0342BA 1A:82AA: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0342BD 1A:82AD: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x0342C0 1A:82B0: 20 DD 90  JSR sub_90DD
C - - - - - 0x0342C3 1A:82B3: 4C F5 83  JMP loc_83F5
bra_82B6:
C - - - - - 0x0342C6 1A:82B6: A9 00     LDA #$00
C - - - - - 0x0342C8 1A:82B8: 8D 16 06  STA ram_индекс_защитника
bra_82BB_loop:
C - - - - - 0x0342CB 1A:82BB: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0342CE 1A:82BE: BC 0B 06  LDY ram_действие_защитника,X
C - - - - - 0x0342D1 1A:82C1: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0342D4 1A:82C4: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0342D7 1A:82C7: F0 08     BEQ bra_82D1
C - - - - - 0x0342D9 1A:82C9: C9 0B     CMP #$0B
C - - - - - 0x0342DB 1A:82CB: F0 04     BEQ bra_82D1
C - - - - - 0x0342DD 1A:82CD: C0 06     CPY #$06
C - - - - - 0x0342DF 1A:82CF: F0 13     BEQ bra_82E4
bra_82D1:
C - - - - - 0x0342E1 1A:82D1: 8C 3D 04  STY ram_действие_защиты
C - - - - - 0x0342E4 1A:82D4: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0342E7 1A:82D7: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0342EA 1A:82DA: A9 02     LDA #con_s_id_02
C - - - - - 0x0342EC 1A:82DC: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0342EF 1A:82DF: A9 14     LDA #$14
C - - - - - 0x0342F1 1A:82E1: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_82E4:
C - - - - - 0x0342F4 1A:82E4: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0342F7 1A:82E7: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0342FA 1A:82EA: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0342FD 1A:82ED: D0 CC     BNE bra_82BB_loop
C - - - - - 0x0342FF 1A:82EF: A9 04     LDA #con_s_id_04
C - - - - - 0x034301 1A:82F1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034304 1A:82F4: A9 00     LDA #$00
C - - - - - 0x034306 1A:82F6: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034309 1A:82F9: 8D 17 06  STA ram_колво_активных_защитников
loc_82FC_loop:
C D 0 - - - 0x03430C 1A:82FC: A9 01     LDA #$01
C - - - - - 0x03430E 1A:82FE: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034311 1A:8301: A9 00     LDA #$00
C - - - - - 0x034313 1A:8303: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x034316 1A:8306: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034319 1A:8309: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x03431C 1A:830C: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x03431F 1A:830F: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x034322 1A:8312: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034325 1A:8315: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034328 1A:8318: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x03432B 1A:831B: F0 04     BEQ bra_8321
C - - - - - 0x03432D 1A:831D: C9 0B     CMP #$0B
C - - - - - 0x03432F 1A:831F: D0 12     BNE bra_8333
bra_8321:
C - - - - - 0x034331 1A:8321: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034334 1A:8324: C9 04     CMP #$04
C - - - - - 0x034336 1A:8326: D0 03     BNE bra_832B
C - - - - - 0x034338 1A:8328: 4C A2 83  JMP loc_83A2
bra_832B:
C - - - - - 0x03433B 1A:832B: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x03433D 1A:832D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034340 1A:8330: 4C 49 83  JMP loc_8349
bra_8333:
C - - - - - 0x034343 1A:8333: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034346 1A:8336: C9 06     CMP #$06
C - - - - - 0x034348 1A:8338: D0 03     BNE bra_833D
C - - - - - 0x03434A 1A:833A: 4C A2 83  JMP loc_83A2
bra_833D:
C - - - - - 0x03434D 1A:833D: C9 05     CMP #$05
C - - - - - 0x03434F 1A:833F: D0 03     BNE bra_8344
C - - - - - 0x034351 1A:8341: 4C A2 83  JMP loc_83A2
bra_8344:
C - - - - - 0x034354 1A:8344: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034356 1A:8346: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
loc_8349:
C D 0 - - - 0x034359 1A:8349: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x03435C 1A:834C: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x03435F 1A:834F: BD D7 83  LDA tbl_83D7_offset_attack,X
C - - - - - 0x034362 1A:8352: 0A        ASL
C - - - - - 0x034363 1A:8353: 0A        ASL
C - - - - - 0x034364 1A:8354: 85 3B     STA ram_003B
C - - - - - 0x034366 1A:8356: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034369 1A:8359: A9 02     LDA #$02
C - - - - - 0x03436B 1A:835B: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x03436E 1A:835E: F0 07     BEQ bra_8367
C - - - - - 0x034370 1A:8360: C0 0B     CPY #$0B
C - - - - - 0x034372 1A:8362: F0 03     BEQ bra_8367
C - - - - - 0x034374 1A:8364: BD DD 83  LDA tbl_83DD_offset_defense,X
bra_8367:
C - - - - - 0x034377 1A:8367: 18        CLC
C - - - - - 0x034378 1A:8368: 65 3B     ADC ram_003B
C - - - - - 0x03437A 1A:836A: AA        TAX
C - - - - - 0x03437B 1A:836B: 0A        ASL
C - - - - - 0x03437C 1A:836C: 85 3B     STA ram_003B
C - - - - - 0x03437E 1A:836E: A9 01     LDA #$01
C - - - - - 0x034380 1A:8370: BC E1 83  LDY tbl_83E1,X
C - - - - - 0x034383 1A:8373: 20 E9 8E  JSR sub_8EE9
bra_8376_loop:
C - - - - - 0x034386 1A:8376: DD F1 83  CMP tbl_83F1,X
C - - - - - 0x034389 1A:8379: B0 04     BCS bra_837F
C - - - - - 0x03438B 1A:837B: E8        INX
C - - - - - 0x03438C 1A:837C: C8        INY
C - - - - - 0x03438D 1A:837D: D0 F7     BNE bra_8376_loop
bra_837F:
C - - - - - 0x03438F 1A:837F: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034392 1A:8382: 20 33 8E  JSR sub_8E33
C - - - - - 0x034395 1A:8385: A9 06     LDA #con_s_id_06
C - - - - - 0x034397 1A:8387: A2 01     LDX #$01
C - - - - - 0x034399 1A:8389: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x03439C 1A:838C: C0 02     CPY #$02
C - - - - - 0x03439E 1A:838E: 90 03     BCC bra_8393
C - - - - - 0x0343A0 1A:8390: CA        DEX ; 00
C - - - - - 0x0343A1 1A:8391: A9 05     LDA #con_s_id_05
bra_8393:
C - - - - - 0x0343A3 1A:8393: 48        PHA
C - - - - - 0x0343A4 1A:8394: 8A        TXA
C - - - - - 0x0343A5 1A:8395: 4A        LSR
C - - - - - 0x0343A6 1A:8396: 20 95 90  JSR sub_9095
C - - - - - 0x0343A9 1A:8399: 68        PLA
C - - - - - 0x0343AA 1A:839A: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0343AD 1A:839D: A9 07     LDA #con_s_id_07
C - - - - - 0x0343AF 1A:839F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_83A2:
C D 0 - - - 0x0343B2 1A:83A2: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0343B5 1A:83A5: C9 03     CMP #$03
C - - - - - 0x0343B7 1A:83A7: B0 13     BCS bra_83BC
C - - - - - 0x0343B9 1A:83A9: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0343BC 1A:83AC: F0 04     BEQ bra_83B2
C - - - - - 0x0343BE 1A:83AE: C9 0B     CMP #$0B
C - - - - - 0x0343C0 1A:83B0: D0 0A     BNE bra_83BC
bra_83B2:
C - - - - - 0x0343C2 1A:83B2: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x0343C5 1A:83B5: C9 03     CMP #$03
C - - - - - 0x0343C7 1A:83B7: D0 03     BNE bra_83BC
C - - - - - 0x0343C9 1A:83B9: EE 17 06  INC ram_колво_активных_защитников
bra_83BC:
C - - - - - 0x0343CC 1A:83BC: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0343CF 1A:83BF: C9 02     CMP #$02
C - - - - - 0x0343D1 1A:83C1: B0 11     BCS bra_83D4
C - - - - - 0x0343D3 1A:83C3: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0343D6 1A:83C6: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0343D9 1A:83C9: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0343DC 1A:83CC: F0 03     BEQ bra_83D1
C - - - - - 0x0343DE 1A:83CE: 4C FC 82  JMP loc_82FC_loop
bra_83D1:
C - - - - - 0x0343E1 1A:83D1: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_83D4:
C - - - - - 0x0343E4 1A:83D4: 4C F5 83  JMP loc_83F5



tbl_83D7_offset_attack:
- D 0 - - - 0x0343E7 1A:83D7: 02        .byte $02   ; 00 
- D 0 - - - 0x0343E8 1A:83D8: 00        .byte $00   ; 01 
- - - - - - 0x0343E9 1A:83D9: 00        .byte $00   ; 02 
- - - - - - 0x0343EA 1A:83DA: 00        .byte $00   ; 03 
- D 0 - - - 0x0343EB 1A:83DB: 01        .byte $01   ; 04 
- D 0 - - - 0x0343EC 1A:83DC: 03        .byte $03   ; 05 



tbl_83DD_offset_defense:
- - - - - - 0x0343ED 1A:83DD: 00        .byte $00   ; 00 
- - - - - - 0x0343EE 1A:83DE: 00        .byte $00   ; 01 
- D 0 - - - 0x0343EF 1A:83DF: 00        .byte $00   ; 02 
- D 0 - - - 0x0343F0 1A:83E0: 01        .byte $01   ; 03 



tbl_83E1:
; 00 
- D 0 - - - 0x0343F1 1A:83E1: 80        .byte $80   ; 00 
- D 0 - - - 0x0343F2 1A:83E2: 00        .byte $00   ; 01 
- D 0 - - - 0x0343F3 1A:83E3: 00        .byte $00   ; 02 
- - - - - - 0x0343F4 1A:83E4: 00        .byte $00   ; 03 
; 01 
- D 0 - - - 0x0343F5 1A:83E5: 00        .byte $00   ; 00 
- D 0 - - - 0x0343F6 1A:83E6: 00        .byte $00   ; 01 
- D 0 - - - 0x0343F7 1A:83E7: 80        .byte $80   ; 02 
- - - - - - 0x0343F8 1A:83E8: 00        .byte $00   ; 03 
; 02 
- D 0 - - - 0x0343F9 1A:83E9: 00        .byte $00   ; 00 
- D 0 - - - 0x0343FA 1A:83EA: 80        .byte $80   ; 01 
- D 0 - - - 0x0343FB 1A:83EB: 80        .byte $80   ; 02 
- - - - - - 0x0343FC 1A:83EC: 00        .byte $00   ; 03 
; 03 
- D 0 - - - 0x0343FD 1A:83ED: 00        .byte $00   ; 00 
- D 0 - - - 0x0343FE 1A:83EE: 00        .byte $00   ; 01 
- D 0 - - - 0x0343FF 1A:83EF: 00        .byte $00   ; 02 
- - - - - - 0x034400 1A:83F0: 00        .byte $00   ; 03 



tbl_83F1:
- D 0 - - - 0x034401 1A:83F1: A0        .byte $A0   ; 00 
- D 0 - - - 0x034402 1A:83F2: 60        .byte $60   ; 01 
- D 0 - - - 0x034403 1A:83F3: 40        .byte $40   ; 02 
- D 0 - - - 0x034404 1A:83F4: 00        .byte $00   ; 03 



loc_83F5:
C D 0 - - - 0x034405 1A:83F5: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034408 1A:83F8: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03440B 1A:83FB: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03440E 1A:83FE: 08 84     .word ofs_040_8408_00
- D 0 - I - 0x034410 1A:8400: 08 84     .word ofs_040_8408_01
- D 0 - I - 0x034412 1A:8402: 3F 84     .word ofs_040_843F_02
- D 0 - I - 0x034414 1A:8404: 4B 84     .word ofs_040_844B_03
- D 0 - I - 0x034416 1A:8406: 7C 84     .word ofs_040_847C_04_нарушение



ofs_040_8408_00:
ofs_040_8408_01:
C - - J - - 0x034418 1A:8408: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03441B 1A:840B: A9 08     LDA #con_s_id_08
C - - - - - 0x03441D 1A:840D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034420 1A:8410: 38        SEC
C - - - - - 0x034421 1A:8411: 20 95 90  JSR sub_9095
C - - - - - 0x034424 1A:8414: 20 7F 84  JSR sub_847F
C - - - - - 0x034427 1A:8417: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03442A 1A:841A: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03442D 1A:841D: 29 84     .word ofs_041_8429_00
- D 0 - I - 0x03442F 1A:841F: 12 C6     .word ofs_041_0x03DE62_01
- - - - - - 0x034431 1A:8421: 3C 84     .word $0000 ; 02
- - - - - - 0x034433 1A:8423: 3C 84     .word $0000 ; 03
- D 0 - I - 0x034435 1A:8425: 27 C6     .word ofs_041_0x03E55C_04
- D 0 - I - 0x034437 1A:8427: 2A C6     .word ofs_041_0x03E5A6



ofs_041_8429_00:
C - - J - - 0x034439 1A:8429: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x03443C 1A:842C: D0 08     BNE bra_8436
C - - - - - 0x03443E 1A:842E: A9 00     LDA #$00
C - - - - - 0x034440 1A:8430: 8D 21 06  STA ram_0621
C - - - - - 0x034443 1A:8433: 4C 18 C6  JMP loc_0x03DD0D
bra_8436:
C - - - - - 0x034446 1A:8436: A2 50     LDX #$50
C - - - - - 0x034448 1A:8438: 9A        TXS
C - - - - - 0x034449 1A:8439: 4C F3 88  JMP loc_88F3



ofs_040_843F_02:
C - - J - - 0x03444F 1A:843F: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034452 1A:8442: 20 7F 84  JSR sub_847F
C - - - - - 0x034455 1A:8445: A2 50     LDX #$50
C - - - - - 0x034457 1A:8447: 9A        TXS
C - - - - - 0x034458 1A:8448: 4C DF 8B  JMP loc_8BDF



ofs_040_844B_03:
C - - J - - 0x03445B 1A:844B: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x03445E 1A:844E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034461 1A:8451: F0 1D     BEQ bra_8470
C - - - - - 0x034463 1A:8453: C9 0B     CMP #$0B
C - - - - - 0x034465 1A:8455: F0 19     BEQ bra_8470
; if это не кипер
C - - - - - 0x034467 1A:8457: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x03446A 1A:845A: E0 02     CPX #$02
C - - - - - 0x03446C 1A:845C: D0 0C     BNE bra_846A
C - - - - - 0x03446E 1A:845E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034471 1A:8461: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034474 1A:8464: A2 50     LDX #$50
C - - - - - 0x034476 1A:8466: 9A        TXS
C - - - - - 0x034477 1A:8467: 4C 0F C6  JMP loc_0x03E0EF
bra_846A:
C - - - - - 0x03447A 1A:846A: A2 50     LDX #$50
C - - - - - 0x03447C 1A:846C: 9A        TXS
C - - - - - 0x03447D 1A:846D: 4C 30 C6  JMP loc_0x03E688
bra_8470:
C - - - - - 0x034480 1A:8470: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x034483 1A:8473: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034486 1A:8476: A2 50     LDX #$50
C - - - - - 0x034488 1A:8478: 9A        TXS
C - - - - - 0x034489 1A:8479: 4C 33 C6  JMP loc_0x03DE0D



sub_847F:
C - - - - - 0x03448F 1A:847F: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x034492 1A:8482: D0 01     BNE bra_8485
C - - - - - 0x034494 1A:8484: 60        RTS
bra_8485:
sub_8485:
C - - - - - 0x034495 1A:8485: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x034498 1A:8488: A0 0A     LDY #con_plr_stun
C - - - - - 0x03449A 1A:848A: A9 06     LDA #$06
C - - - - - 0x03449C 1A:848C: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x03449E 1A:848E: 60        RTS



sub_848F:
C - - - - - 0x03449F 1A:848F: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0344A2 1A:8492: A0 0A     LDY #con_plr_stun
C - - - - - 0x0344A4 1A:8494: B1 34     LDA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0344A6 1A:8496: D0 56     BNE bra_84EE_RTS
C - - - - - 0x0344A8 1A:8498: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x0344AB 1A:849B: 10 05     BPL bra_84A2
C - - - - - 0x0344AD 1A:849D: 49 FF     EOR #$FF
C - - - - - 0x0344AF 1A:849F: 18        CLC
C - - - - - 0x0344B0 1A:84A0: 69 01     ADC #$01
bra_84A2:
C - - - - - 0x0344B2 1A:84A2: AA        TAX
C - - - - - 0x0344B3 1A:84A3: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x0344B6 1A:84A6: 10 05     BPL bra_84AD
C - - - - - 0x0344B8 1A:84A8: 49 FF     EOR #$FF
C - - - - - 0x0344BA 1A:84AA: 18        CLC
C - - - - - 0x0344BB 1A:84AB: 69 01     ADC #$01
bra_84AD:
C - - - - - 0x0344BD 1A:84AD: A8        TAY
C - - - - - 0x0344BE 1A:84AE: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x0344C1 1A:84B1: A2 08     LDX #$08
bra_84B3_loop:
C - - - - - 0x0344C3 1A:84B3: DD EF 84  CMP tbl_84EF,X
C - - - - - 0x0344C6 1A:84B6: F0 05     BEQ bra_84BD
C - - - - - 0x0344C8 1A:84B8: CA        DEX
C - - - - - 0x0344C9 1A:84B9: 10 F8     BPL bra_84B3_loop
C - - - - - 0x0344CB 1A:84BB: 30 31     BMI bra_84EE_RTS    ; jmp
bra_84BD:
C - - - - - 0x0344CD 1A:84BD: A9 33     LDA #$33
C - - - - - 0x0344CF 1A:84BF: E0 06     CPX #$06
C - - - - - 0x0344D1 1A:84C1: 90 02     BCC bra_84C5
C - - - - - 0x0344D3 1A:84C3: A9 55     LDA #$55
bra_84C5:
C - - - - - 0x0344D5 1A:84C5: CD E2 00  CMP ram_random + $01
C - - - - - 0x0344D8 1A:84C8: 90 24     BCC bra_84EE_RTS
C - - - - - 0x0344DA 1A:84CA: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x0344DD 1A:84CD: E0 05     CPX #$05
C - - - - - 0x0344DF 1A:84CF: B0 1D     BCS bra_84EE_RTS
C - - - - - 0x0344E1 1A:84D1: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0344E4 1A:84D4: F0 04     BEQ bra_84DA    ; if комада слева
; if мяч у команды справа
C - - - - - 0x0344E6 1A:84D6: E0 04     CPX #$04
C - - - - - 0x0344E8 1A:84D8: B0 14     BCS bra_84EE_RTS
bra_84DA:
bra_84DA_loop:
C - - - - - 0x0344EA 1A:84DA: BD 00 06  LDA ram_колво_защитников,X
C - - - - - 0x0344ED 1A:84DD: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x0344F0 1A:84E0: CA        DEX
C - - - - - 0x0344F1 1A:84E1: 10 F7     BPL bra_84DA_loop
C - - - - - 0x0344F3 1A:84E3: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0344F6 1A:84E6: 49 0B     EOR #$0B
C - - - - - 0x0344F8 1A:84E8: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x0344FB 1A:84EB: EE 00 06  INC ram_колво_защитников
bra_84EE_RTS:
C - - - - - 0x0344FE 1A:84EE: 60        RTS



tbl_84EF:
- D 0 - - - 0x0344FF 1A:84EF: 03        .byte $03   ; 00
- D 0 - - - 0x034500 1A:84F0: 0F        .byte $0F   ; 01
- D 0 - - - 0x034501 1A:84F1: 1B        .byte $1B   ; 02
- D 0 - - - 0x034502 1A:84F2: 10        .byte $10   ; 03
- D 0 - - - 0x034503 1A:84F3: 1C        .byte $1C   ; 04
- D 0 - - - 0x034504 1A:84F4: 1D        .byte $1D   ; 05
- D 0 - - - 0x034505 1A:84F5: 04        .byte $04   ; 06
- D 0 - - - 0x034506 1A:84F6: 05        .byte $05   ; 07
- D 0 - - - 0x034507 1A:84F7: 11        .byte $11   ; 08



loc_0x034508:
C D 0 - - - 0x034508 1A:84F8: A9 01     LDA #$01
C - - - - - 0x03450A 1A:84FA: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x03450D 1A:84FD: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034510 1A:8500: 08        PHP
C - - - - - 0x034511 1A:8501: 49 0B     EOR #$0B
C - - - - - 0x034513 1A:8503: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034516 1A:8506: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034519 1A:8509: 28        PLP
C - - - - - 0x03451A 1A:850A: D0 08     BNE bra_8514_команда_справа
; if комада слева
C - - - - - 0x03451C 1A:850C: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03451E 1A:850E: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034521 1A:8511: 4C 2F 85  JMP loc_852F
bra_8514_команда_справа:
C - - - - - 0x034524 1A:8514: A9 14     LDA #$14
C - - - - - 0x034526 1A:8516: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034529 1A:8519: A9 00     LDA #$00
C - - - - - 0x03452B 1A:851B: 85 11     STA ram_0011
C - - - - - 0x03452D 1A:851D: 85 12     STA ram_0012
C - - - - - 0x03452F 1A:851F: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x034532 1A:8522: A9 32     LDA #con_s_id_32
C - - - - - 0x034534 1A:8524: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034537 1A:8527: A9 04     LDA #$04
C - - - - - 0x034539 1A:8529: 8D 21 06  STA ram_0621
C - - - - - 0x03453C 1A:852C: 20 00 C6  JSR sub_0x03D575
loc_852F:
C D 0 - - - 0x03453F 1A:852F: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x034541 1A:8531: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034544 1A:8534: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x034547 1A:8537: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x03454A 1A:853A: A2 F3     LDX #$F3      ; шанс крита обычного кипера
C - - - - - 0x03454C 1A:853C: A0 00     LDY #con_plr_id
C - - - - - 0x03454E 1A:853E: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034550 1A:8540: C9 21     CMP #con_p_wakabayashi_my
C - - - - - 0x034552 1A:8542: F0 04     BEQ bra_8548_это_вакабаяши
C - - - - - 0x034554 1A:8544: C9 40     CMP #con_p_wakabayashi_hamburger_sv
C - - - - - 0x034556 1A:8546: D0 02     BNE bra_854A_это_не_вакабаяши
bra_8548_это_вакабаяши:
C - - - - - 0x034558 1A:8548: A2 CD     LDX #$CD      ; шанс крита кабаяши
bra_854A_это_не_вакабаяши:
C - - - - - 0x03455A 1A:854A: A9 00     LDA #$00
C - - - - - 0x03455C 1A:854C: EC E2 00  CPX ram_random + $01
C - - - - - 0x03455F 1A:854F: B0 02     BCS bra_8553_это_крит
C - - - - - 0x034561 1A:8551: A9 80     LDA #$80
bra_8553_это_крит:
C - - - - - 0x034563 1A:8553: A2 00     LDX #$00
C - - - - - 0x034565 1A:8555: 86 3B     STX ram_003B
C - - - - - 0x034567 1A:8557: AA        TAX
C - - - - - 0x034568 1A:8558: 08        PHP
C - - - - - 0x034569 1A:8559: A9 03     LDA #$03
C - - - - - 0x03456B 1A:855B: 28        PLP
C - - - - - 0x03456C 1A:855C: 20 1F 8F  JSR sub_8F1F
C - - - - - 0x03456F 1A:855F: A0 00     LDY #$00
bra_8561_loop:
C - - - - - 0x034571 1A:8561: D9 B9 86  CMP tbl_86B9,Y
C - - - - - 0x034574 1A:8564: B0 05     BCS bra_856B
C - - - - - 0x034576 1A:8566: F0 03     BEQ bra_856B
C - - - - - 0x034578 1A:8568: C8        INY
C - - - - - 0x034579 1A:8569: D0 F6     BNE bra_8561_loop   ; jmp
bra_856B:
C - - - - - 0x03457B 1A:856B: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x03457E 1A:856E: D0 21     BNE bra_8591    ; if комада справа
; if мяч у команды слева
C - - - - - 0x034580 1A:8570: AE 2B 00  LDX ram_команда_соперника
C - - - - - 0x034583 1A:8573: E0 05     CPX #$05
C - - - - - 0x034585 1A:8575: D0 1A     BNE bra_8591
C - - - - - 0x034587 1A:8577: AE 46 04  LDX ram_флаг_драйв_оверхеда
C - - - - - 0x03458A 1A:857A: F0 15     BEQ bra_8591
C - - - - - 0x03458C 1A:857C: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x03458F 1A:857F: F0 10     BEQ bra_8591
C - - - - - 0x034591 1A:8581: C9 03     CMP #$03
C - - - - - 0x034593 1A:8583: F0 04     BEQ bra_8589
C - - - - - 0x034595 1A:8585: E0 04     CPX #$04
C - - - - - 0x034597 1A:8587: B0 08     BCS bra_8591
bra_8589:
C - - - - - 0x034599 1A:8589: A0 02     LDY #$02
C - - - - - 0x03459B 1A:858B: 2C E2 00  BIT ram_random + $01
C - - - - - 0x03459E 1A:858E: 10 01     BPL bra_8591
C - - - - - 0x0345A0 1A:8590: C8        INY
bra_8591:
C - - - - - 0x0345A1 1A:8591: 20 48 81  STY ram_результат_защитника
C - - - - - 0x0345A4 1A:8594: A9 00     LDA #$00
C - - - - - 0x0345A6 1A:8596: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x0345A9 1A:8599: A9 09     LDA #con_s_id_09
C - - - - - 0x0345AB 1A:859B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0345AE 1A:859E: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0345B1 1A:85A1: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x0345B4 1A:85A4: AC 85     .word ofs_064_85AC_00
- D 0 - I - 0x0345B6 1A:85A6: 05 86     .word ofs_064_8605_01
- D 0 - I - 0x0345B8 1A:85A8: 1C 86     .word ofs_064_861C_02
- D 0 - I - 0x0345BA 1A:85AA: 46 86     .word ofs_064_8646_03



loc_85AC:
sub_0x0345BC:
ofs_042_85AC_00:
ofs_063_85AC_00:
ofs_064_85AC_00:
C D 0 J - - 0x0345BC 1A:85AC: A2 00     LDX #$00
C - - - - - 0x0345BE 1A:85AE: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0345C1 1A:85B1: 20 D4 8B  JSR sub_8BD4_начислить_опыт
C - - - - - 0x0345C4 1A:85B4: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - - 0x0345C7 1A:85B7: A9 30     LDA #con_s_id_30
C - - - - - 0x0345C9 1A:85B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_85BC:
C D 0 - - - 0x0345CC 1A:85BC: 20 7B 98  JSR sub_987B
C - - - - - 0x0345CF 1A:85BF: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0345D2 1A:85C2: 49 0B     EOR #$0B
C - - - - - 0x0345D4 1A:85C4: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x0345D7 1A:85C7: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0345DA 1A:85CA: A9 00     LDA #$00
C - - - - - 0x0345DC 1A:85CC: A0 05     LDY #con_таймер_наебки
C - - - - - 0x0345DE 1A:85CE: 91 34     STA (ram_plr_data),Y    ; con_таймер_наебки
C - - - - - 0x0345E0 1A:85D0: A0 07     LDY #con_величина_наебки
C - - - - - 0x0345E2 1A:85D2: 91 34     STA (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x0345E4 1A:85D4: A0 0A     LDY #con_plr_stun
C - - - - - 0x0345E6 1A:85D6: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0345E8 1A:85D8: A9 04     LDA #$04
C - - - - - 0x0345EA 1A:85DA: 8D 29 06  STA ram_флаг_разводки
C - - - - - 0x0345ED 1A:85DD: A2 50     LDX #$50
C - - - - - 0x0345EF 1A:85DF: 9A        TXS
C - - - - - 0x0345F0 1A:85E0: 4C 36 C6  JMP loc_0x03DABA



sub_85E3_увеличить_счетчик_голов:
C - - - - - 0x0345F3 1A:85E3: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x0345F6 1A:85E6: F0 05     BEQ bra_85ED_команда_слева
; if мяч у команды справа
C - - - - - 0x0345F8 1A:85E8: 20 4E 90  JSR sub_904E
C - - - - - 0x0345FB 1A:85EB: A2 01     LDX #$01
bra_85ED_команда_слева:     ; X = 00, bzk optimize, небезопасно
C - - - - - 0x0345FD 1A:85ED: FE 28 00  INC ram_голы,X
C - - - - - 0x034600 1A:85F0: A9 01     LDA #con_B3CF_01
C - - - - - 0x034602 1A:85F2: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x034605 1A:85F5: 60        RTS



sub_85F6_выбор_мелодии_команды:
C - - - - - 0x034606 1A:85F6: 2C 3E 06  BIT ram_флаг_loss
C - - - - - 0x034609 1A:85F9: 10 06     BPL bra_8601_сейчас_не_loss
; музыка добавочного времени
C - - - - - 0x03460B 1A:85FB: A9 32     LDA #$32
C - - - - - 0x03460D 1A:85FD: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - - 0x034610 1A:8600: 60        RTS
bra_8601_сейчас_не_loss:
C - - - - - 0x034611 1A:8601: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
C - - - - - 0x034614 1A:8604: 60        RTS



ofs_042_8605_01:
ofs_064_8605_01:
C - - J - - 0x034615 1A:8605: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x034618 1A:8608: 29 3F     AND #$3F
C - - - - - 0x03461A 1A:860A: C9 03     CMP #$03
C - - - - - 0x03461C 1A:860C: 90 9E     BCC bra_85AC_это_не_спешал
C - - - - - 0x03461E 1A:860E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034621 1A:8611: 49 0B     EOR #$0B
C - - - - - 0x034623 1A:8613: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x034626 1A:8616: A2 50     LDX #$50
C - - - - - 0x034628 1A:8618: 9A        TXS
C - - - - - 0x034629 1A:8619: 4C 33 C6  JMP loc_0x03DE0D
bra_85AC_это_не_спешал:
                                        JMP loc_85AC



ofs_042_861C_02:
ofs_063_861C_02:
ofs_064_861C_02:
C - - J - - 0x03462C 1A:861C: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x03462F 1A:861F: A9 00     LDA #$00
C - - - - - 0x034631 1A:8621: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034634 1A:8624: 20 D3 86  JSR sub_86D3_запись_наебки_кипера_после_отбивания_удара
C - - - - - 0x034637 1A:8627: 20 BD 86  JSR sub_86BD_увеличить_таймер_наебки_кипера
C - - - - - 0x03463A 1A:862A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03463D 1A:862D: F0 11     BEQ bra_8640
C - - - - - 0x03463F 1A:862F: A9 B0     LDA #$B0
C - - - - - 0x034641 1A:8631: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x034644 1A:8634: F0 02     BEQ bra_8638_команда_слева
; if мяч у команды справа
C - - - - - 0x034646 1A:8636: A9 50     LDA #$50
bra_8638_команда_слева:
C - - - - - 0x034648 1A:8638: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x03464B 1A:863B: A9 80     LDA #$80
C - - - - - 0x03464D 1A:863D: 8D 37 06  STA ram_ball_pos_Y_hi
bra_8640:
C - - - - - 0x034650 1A:8640: A2 50     LDX #$50
C - - - - - 0x034652 1A:8642: 9A        TXS
C - - - - - 0x034653 1A:8643: 4C DF 8B  JMP loc_8BDF



ofs_064_8646_03:
C - - J - - 0x034656 1A:8646: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034659 1A:8649: 20 BD 86  JSR sub_86BD_увеличить_таймер_наебки_кипера
C - - - - - 0x03465C 1A:864C: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x03465F 1A:864F: C9 01     CMP #$01
C - - - - - 0x034661 1A:8651: F0 0E     BEQ bra_8661
C - - - - - 0x034663 1A:8653: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034666 1A:8656: 49 0B     EOR #$0B
C - - - - - 0x034668 1A:8658: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x03466B 1A:865B: A2 50     LDX #$50
C - - - - - 0x03466D 1A:865D: 9A        TXS
C - - - - - 0x03466E 1A:865E: 4C 33 C6  JMP loc_0x03DE0D
bra_8661:
C - - - - - 0x034671 1A:8661: AD E2 00  LDA ram_random + $01
C - - - - - 0x034674 1A:8664: 29 07     AND #$07
C - - - - - 0x034676 1A:8666: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x034679 1A:8669: D0 02     BNE bra_866D_команда_справа
; if мяч у команды слева
C - - - - - 0x03467B 1A:866B: 49 07     EOR #$07
bra_866D_команда_справа:
C - - - - - 0x03467D 1A:866D: AA        TAX
C - - - - - 0x03467E 1A:866E: 0A        ASL
C - - - - - 0x03467F 1A:866F: 0A        ASL
C - - - - - 0x034680 1A:8670: 0A        ASL
C - - - - - 0x034681 1A:8671: 85 3A     STA ram_003A
C - - - - - 0x034683 1A:8673: A9 30     LDA #$30
C - - - - - 0x034685 1A:8675: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x034688 1A:8678: D0 02     BNE bra_867C_команда_справа
; if мяч у команды слева
C - - - - - 0x03468A 1A:867A: A9 90     LDA #$90
bra_867C_команда_справа:
C - - - - - 0x03468C 1A:867C: 18        CLC
C - - - - - 0x03468D 1A:867D: 65 3A     ADC ram_003A
C - - - - - 0x03468F 1A:867F: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x034692 1A:8682: AD E3 00  LDA ram_random + $02
C - - - - - 0x034695 1A:8685: 29 0F     AND #$0F
loc_8687_loop:
C D 0 - - - 0x034697 1A:8687: DD B1 86  CMP tbl_86B1,X
C - - - - - 0x03469A 1A:868A: 90 06     BCC bra_8692_закончить
C - - - - - 0x03469C 1A:868C: FD B1 86  SBC tbl_86B1,X
C - - - - - 0x03469F 1A:868F: 4C 87 86  JMP loc_8687_loop
bra_8692_закончить:
C - - - - - 0x0346A2 1A:8692: 0A        ASL
C - - - - - 0x0346A3 1A:8693: 0A        ASL
C - - - - - 0x0346A4 1A:8694: 0A        ASL
C - - - - - 0x0346A5 1A:8695: 69 50     ADC #$50
C - - - - - 0x0346A7 1A:8697: 2C E3 00  BIT ram_random + $02
C - - - - - 0x0346AA 1A:869A: 10 02     BPL bra_869E
C - - - - - 0x0346AC 1A:869C: 49 FF     EOR #$FF
bra_869E:
C - - - - - 0x0346AE 1A:869E: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0346B1 1A:86A1: A9 01     LDA #$01
C - - - - - 0x0346B3 1A:86A3: 8D FF 05  STA ram_05FF
C - - - - - 0x0346B6 1A:86A6: A9 00     LDA #$00
C - - - - - 0x0346B8 1A:86A8: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x0346BB 1A:86AB: 20 D3 86  JSR sub_86D3_запись_наебки_кипера_после_отбивания_удара
C - - - - - 0x0346BE 1A:86AE: 4C E5 8B  JMP loc_8BE5



tbl_86B1:
- D 0 - - - 0x0346C1 1A:86B1: 03        .byte $03   ; 00 
- D 0 - - - 0x0346C2 1A:86B2: 03        .byte $03   ; 01 
- D 0 - - - 0x0346C3 1A:86B3: 03        .byte $03   ; 02 
- D 0 - - - 0x0346C4 1A:86B4: 06        .byte $06   ; 03 
- D 0 - - - 0x0346C5 1A:86B5: 06        .byte $06   ; 04 
- D 0 - - - 0x0346C6 1A:86B6: 06        .byte $06   ; 05 
- D 0 - - - 0x0346C7 1A:86B7: 06        .byte $06   ; 06 
- D 0 - - - 0x0346C8 1A:86B8: 06        .byte $06   ; 07 



tbl_86B9:
- D 0 - - - 0x0346C9 1A:86B9: BF        .byte $BF   ; 00 
- D 0 - - - 0x0346CA 1A:86BA: BB        .byte $BB   ; 01 
- D 0 - - - 0x0346CB 1A:86BB: 87        .byte $87   ; 02 
- D 0 - - - 0x0346CC 1A:86BC: 00        .byte $00   ; 03 



sub_86BD_увеличить_таймер_наебки_кипера:
C - - - - - 0x0346CD 1A:86BD: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0346D0 1A:86C0: A9 07     LDA #$07
C - - - - - 0x0346D2 1A:86C2: AE 43 04  LDX ram_0443
C - - - - - 0x0346D5 1A:86C5: E0 02     CPX #$02
C - - - - - 0x0346D7 1A:86C7: 90 02     BCC bra_86CB
C - - - - - 0x0346D9 1A:86C9: A9 0B     LDA #$0B
bra_86CB:
; судя по новому логу, только для кипера соперника?
C - - - - - 0x0346DB 1A:86CB: A0 05     LDY #con_таймер_наебки
C - - - - - 0x0346DD 1A:86CD: 18        CLC
C - - - - - 0x0346DE 1A:86CE: 71 34     ADC (ram_plr_data),Y    ; con_таймер_наебки
C - - - - - 0x0346E0 1A:86D0: 91 34     STA (ram_plr_data),Y    ; con_таймер_наебки
C - - - - - 0x0346E2 1A:86D2: 60        RTS



sub_86D3_запись_наебки_кипера_после_отбивания_удара:
C - - - - - 0x0346E3 1A:86D3: AD E2 00  LDA ram_random + $01
C - - - - - 0x0346E6 1A:86D6: C9 40     CMP #$40
C - - - - - 0x0346E8 1A:86D8: B0 1B     BCS bra_86F5_RTS
C - - - - - 0x0346EA 1A:86DA: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0346ED 1A:86DD: A0 07     LDY #con_величина_наебки
C - - - - - 0x0346EF 1A:86DF: B1 34     LDA (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x0346F1 1A:86E1: C9 50     CMP #$50
C - - - - - 0x0346F3 1A:86E3: B0 10     BCS bra_86F5_RTS
C - - - - - 0x0346F5 1A:86E5: 69 4F     ADC #$4F
C - - - - - 0x0346F7 1A:86E7: C9 80     CMP #$80
C - - - - - 0x0346F9 1A:86E9: 90 02     BCC bra_86ED_not_overflow
C - - - - - 0x0346FB 1A:86EB: A9 7F     LDA #$7F
bra_86ED_not_overflow:
C - - - - - 0x0346FD 1A:86ED: 91 34     STA (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x0346FF 1A:86EF: A0 06     LDY #con_кипер_параметр_06
C - - - - - 0x034701 1A:86F1: A9 04     LDA #$04
C - - - - - 0x034703 1A:86F3: 91 34     STA (ram_plr_data),Y    ; con_кипер_параметр_06
bra_86F5_RTS:
C - - - - - 0x034705 1A:86F5: 60        RTS



loc_0x034706:
C D 0 - - - 0x034706 1A:86F6: A9 03     LDA #$03
C - - - - - 0x034708 1A:86F8: 8D 21 06  STA ram_0621
C - - - - - 0x03470B 1A:86FB: A9 01     LDA #$01
C - - - - - 0x03470D 1A:86FD: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034710 1A:8700: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034713 1A:8703: 49 0B     EOR #$0B
C - - - - - 0x034715 1A:8705: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034718 1A:8708: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x03471B 1A:870B: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03471D 1A:870D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034720 1A:8710: A9 31     LDA #con_s_id_gk_vs_attacker
C - - - - - 0x034722 1A:8712: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034725 1A:8715: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034728 1A:8718: 20 72 8F  JSR sub_8F72
C - - - - - 0x03472B 1A:871B: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03472E 1A:871E: C9 01     CMP #$01
C - - - - - 0x034730 1A:8720: D0 10     BNE bra_8732
C - - - - - 0x034732 1A:8722: A9 00     LDA #$00
C - - - - - 0x034734 1A:8724: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034737 1A:8727: A9 18     LDA #con_s_id_18
C - - - - - 0x034739 1A:8729: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03473C 1A:872C: A2 50     LDX #$50
C - - - - - 0x03473E 1A:872E: 9A        TXS
C - - - - - 0x03473F 1A:872F: 4C 12 C6  JMP loc_0x03DE62
bra_8732:
C - - - - - 0x034742 1A:8732: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x034744 1A:8734: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034747 1A:8737: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x03474A 1A:873A: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x03474D 1A:873D: 38        SEC
C - - - - - 0x03474E 1A:873E: E9 05     SBC #$05
C - - - - - 0x034750 1A:8740: 85 3B     STA ram_003B
C - - - - - 0x034752 1A:8742: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034755 1A:8745: 0A        ASL
C - - - - - 0x034756 1A:8746: 65 3B     ADC ram_003B
C - - - - - 0x034758 1A:8748: AA        TAX
C - - - - - 0x034759 1A:8749: 0A        ASL
C - - - - - 0x03475A 1A:874A: 85 3B     STA ram_003B
C - - - - - 0x03475C 1A:874C: A9 04     LDA #$04
C - - - - - 0x03475E 1A:874E: BC D7 87  LDY tbl_87D7,X
C - - - - - 0x034761 1A:8751: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x034764 1A:8754: 85 3A     STA ram_003A
C - - - - - 0x034766 1A:8756: 20 59 8F  JSR sub_8F59
C - - - - - 0x034769 1A:8759: 4A        LSR
C - - - - - 0x03476A 1A:875A: 4A        LSR
C - - - - - 0x03476B 1A:875B: 18        CLC
C - - - - - 0x03476C 1A:875C: 65 3A     ADC ram_003A
C - - - - - 0x03476E 1A:875E: 90 02     BCC bra_8762_not_overflow
C - - - - - 0x034770 1A:8760: A9 FF     LDA #$FF
bra_8762_not_overflow:
C - - - - - 0x034772 1A:8762: A0 00     LDY #$00
bra_8764_loop:
C - - - - - 0x034774 1A:8764: D9 DD 87  CMP tbl_87DD,Y
C - - - - - 0x034777 1A:8767: B0 05     BCS bra_876E
C - - - - - 0x034779 1A:8769: F0 03     BEQ bra_876E
C - - - - - 0x03477B 1A:876B: C8        INY
C - - - - - 0x03477C 1A:876C: D0 F6     BNE bra_8764_loop   ; jmp
bra_876E:
C - - - - - 0x03477E 1A:876E: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034781 1A:8771: 20 33 8E  JSR sub_8E33
C - - - - - 0x034784 1A:8774: A9 0A     LDA #con_s_id_result_gk_vs_attacker
C - - - - - 0x034786 1A:8776: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034789 1A:8779: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03478C 1A:877C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03478F 1A:877F: 89 87     .word ofs_043_8789_00_кипер_промахнется
- D 0 - I - 0x034791 1A:8781: 9F 87     .word ofs_043_879F_01_кипер_отобъет_ладонью
- D 0 - I - 0x034793 1A:8783: B7 87     .word ofs_043_87B7_02_кипер_отобъет_кулаком
- D 0 - I - 0x034795 1A:8785: C3 87     .word ofs_043_87C3_03_кипер_словит
- D 0 - I - 0x034797 1A:8787: D4 87     .word ofs_043_87D4_04_нарушение



ofs_043_8789_00_кипер_промахнется:
C - - J - - 0x034799 1A:8789: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03479C 1A:878C: 20 85 84  JSR sub_8485
C - - - - - 0x03479F 1A:878F: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0347A4 1A:8794: D0 03     BNE bra_8799
C - - - - - 0x0347A6 1A:8796: 4C F3 88  JMP loc_88F3
bra_8799:
C - - - - - 0x0347A9 1A:8799: A2 50     LDX #$50
C - - - - - 0x0347AB 1A:879B: 9A        TXS
C - - - - - 0x0347AC 1A:879C: 4C 2A 89  JMP loc_892A



ofs_043_879F_01_кипер_отобъет_ладонью:
C - - J - - 0x0347AF 1A:879F: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x0347B2 1A:87A2: 20 85 84  JSR sub_8485
C - - - - - 0x0347B5 1A:87A5: AD E2 00  LDA ram_random + $01
C - - - - - 0x0347B8 1A:87A8: C9 40     CMP #$40
C - - - - - 0x0347BA 1A:87AA: B0 05     BCS bra_87B1
C - - - - - 0x0347BE 1A:87AE: 20 F5 8C  JSR sub_8CF5
bra_87B1:
C - - - - - 0x0347C1 1A:87B1: A2 50     LDX #$50
C - - - - - 0x0347C3 1A:87B3: 9A        TXS
C - - - - - 0x0347C4 1A:87B4: 4C DF 8B  JMP loc_8BDF



ofs_043_87B7_02_кипер_отобъет_кулаком:
C - - J - - 0x0347C7 1A:87B7: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0347CA 1A:87BA: 20 85 84  JSR sub_8485
C - - - - - 0x0347CD 1A:87BD: A2 50     LDX #$50
C - - - - - 0x0347CF 1A:87BF: 9A        TXS
C - - - - - 0x0347D0 1A:87C0: 4C DF 8B  JMP loc_8BDF



ofs_043_87C3_03_кипер_словит:
C - - J - - 0x0347D3 1A:87C3: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0347D6 1A:87C6: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0347D9 1A:87C9: 49 0B     EOR #$0B
C - - - - - 0x0347DB 1A:87CB: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0347DE 1A:87CE: A2 50     LDX #$50
C - - - - - 0x0347E0 1A:87D0: 9A        TXS
C - - - - - 0x0347E1 1A:87D1: 4C 33 C6  JMP loc_0x03DE0D



tbl_87D7:
; 00 
- D 0 - - - 0x0347E7 1A:87D7: 00        .byte $00
- D 0 - - - 0x0347E8 1A:87D8: 80        .byte $80
; 01 
- - - - - - 0x0347E9 1A:87D9: 00        .byte $00
- - - - - - 0x0347EA 1A:87DA: 00        .byte $00
; 02 
- D 0 - - - 0x0347EB 1A:87DB: 80        .byte $80
- D 0 - - - 0x0347EC 1A:87DC: 00        .byte $00



tbl_87DD:
- D 0 - - - 0x0347ED 1A:87DD: A8        .byte $A8   ; 00 
- D 0 - - - 0x0347EE 1A:87DE: 5A        .byte $5A   ; 01 
- D 0 - - - 0x0347EF 1A:87DF: 52        .byte $52   ; 02 
- D 0 - - - 0x0347F0 1A:87E0: 00        .byte $00   ; 03 



sub_87E1:
sub_0x0347F1:
C D 0 - - - 0x0347F1 1A:87E1: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0347F4 1A:87E4: 49 0B     EOR #$0B
C - - - - - 0x0347F6 1A:87E6: 85 41     STA ram_0041
C - - - - - 0x0347F8 1A:87E8: E6 41     INC ram_0041
C - - - - - 0x0347FA 1A:87EA: A9 0A     LDA #$0A
C - - - - - 0x0347FC 1A:87EC: 85 3B     STA ram_003B
bra_87EE_loop:
C - - - - - 0x0347FE 1A:87EE: A5 41     LDA ram_0041
C - - - - - 0x034800 1A:87F0: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034803 1A:87F3: A0 0A     LDY #con_plr_stun
C - - - - - 0x034805 1A:87F5: B1 34     LDA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x034807 1A:87F7: D0 35     BNE bra_882E
C - - - - - 0x034809 1A:87F9: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x03480B 1A:87FB: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x03480D 1A:87FD: AA        TAX
C - - - - - 0x03480E 1A:87FE: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x034810 1A:8800: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x034812 1A:8802: A8        TAY
C - - - - - 0x034813 1A:8803: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x034816 1A:8806: CD FE 05  CMP ram_05FE
C - - - - - 0x034819 1A:8809: D0 23     BNE bra_882E
C - - - - - 0x03481B 1A:880B: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x03481E 1A:880E: E0 05     CPX #$05
C - - - - - 0x034820 1A:8810: B0 1C     BCS bra_882E
C - - - - - 0x034822 1A:8812: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034825 1A:8815: F0 04     BEQ bra_881B_команда_слева
; if мяч у команды справа
C - - - - - 0x034827 1A:8817: E0 04     CPX #$04
C - - - - - 0x034829 1A:8819: B0 13     BCS bra_882E
bra_881B_команда_слева:
C - - - - - 0x03482B 1A:881B: AD E2 00  LDA ram_random + $01
C - - - - - 0x03482E 1A:881E: ED E3 00  SBC ram_random + $02
C - - - - - 0x034831 1A:8821: CD 1A 06  CMP ram_061A
C - - - - - 0x034834 1A:8824: B0 08     BCS bra_882E
C - - - - - 0x034836 1A:8826: A5 41     LDA ram_0041
C - - - - - 0x034838 1A:8828: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x03483B 1A:882B: EE 00 06  INC ram_колво_защитников
bra_882E:
C - - - - - 0x03483E 1A:882E: E6 41     INC ram_0041
C - - - - - 0x034840 1A:8830: C6 3B     DEC ram_003B
C - - - - - 0x034842 1A:8832: D0 BA     BNE bra_87EE_loop
C - - - - - 0x034844 1A:8834: 60        RTS



sub_0x034845:
C D 0 - - - 0x034845 1A:8835: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034848 1A:8838: D0 01     BEQ bra_888A_RTS
C - - - - - 0x03484B 1A:883B: A9 00     LDA #$00
C - - - - - 0x03484D 1A:883D: 8D 16 06  STA ram_индекс_защитника
bra_8840_loop:
C - - - - - 0x034850 1A:8840: A9 01     LDA #$01
C - - - - - 0x034852 1A:8842: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034855 1A:8845: AD 4E 04  LDA ram_высота_мяча
C - - - - - 0x034858 1A:8848: 48        PHA
C - - - - - 0x034859 1A:8849: A9 00     LDA #$00
C - - - - - 0x03485B 1A:884B: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x03485E 1A:884E: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034861 1A:8851: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034864 1A:8854: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034867 1A:8857: AE 1B 06  LDX ram_061B
; bzk optimize, загрузка 00 или 02 из таблицы
; в 061B может быть 00 или 01, сделать LDA + ASL + STA
C - - - - - 0x03486A 1A:885A: BD 8B 88  LDA tbl_888B,X
C - - - - - 0x03486D 1A:885D: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x034870 1A:8860: A9 00     LDA #$00
C - - - - - 0x034872 1A:8862: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034878 1A:8868: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x03487A 1A:886A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03487D 1A:886D: 20 8D 88  JSR sub_888D
C - - - - - 0x034880 1A:8870: 68        PLA
C - - - - - 0x034881 1A:8871: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034884 1A:8874: 20 A8 88  JSR sub_88A8
C - - - - - 0x034887 1A:8877: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x03488A 1A:887A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03488D 1A:887D: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x034890 1A:8880: D0 BE     BNE bra_8840_loop
C - - - - - 0x034892 1A:8882: A9 00     LDA #$00
C - - - - - 0x034894 1A:8884: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034897 1A:8887: 8D FF 05  STA ram_05FF
bra_888A_RTS:
C - - - - - 0x03489A 1A:888A: 60        RTS



tbl_888B:
- D 0 - - - 0x03489B 1A:888B: 00        .byte $00
- D 0 - - - 0x03489C 1A:888C: 02        .byte $02



sub_888D:
sub_0x03489D:
C D 0 - - - 0x03489D 1A:888D: A9 00     LDA #$00
C - - - - - 0x03489F 1A:888F: 85 3A     STA ram_003A
C - - - - - 0x0348A1 1A:8891: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0348A4 1A:8894: 0A        ASL
C - - - - - 0x0348A5 1A:8895: 0A        ASL
C - - - - - 0x0348A6 1A:8896: 6D 3D 04  ADC ram_действие_защиты
C - - - - - 0x0348A9 1A:8899: AA        TAX
C - - - - - 0x0348AA 1A:889A: 0A        ASL
C - - - - - 0x0348AB 1A:889B: 85 3B     STA ram_003B
C - - - - - 0x0348AD 1A:889D: A9 05     LDA #$05
C - - - - - 0x0348AF 1A:889F: BC EB 88  LDY tbl_88EB,X
C - - - - - 0x0348B2 1A:88A2: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x0348B5 1A:88A5: 4C 32 81  JMP loc_8132



sub_88A8:
sub_0x0348B8:
C D 0 - - - 0x0348B8 1A:88A8: A9 0B     LDA #con_s_id_0B
C - - - - - 0x0348BA 1A:88AA: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0348BD 1A:88AD: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0348C0 1A:88B0: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x0348C3 1A:88B3: 69 81     .word ofs_039_8169_00
- D 0 - I - 0x0348C5 1A:88B5: 9C 81     .word ofs_039_819C_01
- D 0 - I - 0x0348C7 1A:88B7: BB 88     .word ofs_039_88BB_02
- D 0 - I - 0x0348C9 1A:88B9: D5 88     .word ofs_039_88D5_03



ofs_039_88BB_02:
C - - J - - 0x0348CB 1A:88BB: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0348CE 1A:88BE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0348D1 1A:88C1: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0348D4 1A:88C4: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0348D6 1A:88C6: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0348D8 1A:88C8: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x0348DB 1A:88CB: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0348DD 1A:88CD: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0348DF 1A:88CF: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0348E2 1A:88D2: 4C BC 81  JMP loc_81BC



ofs_039_88D5_03:
C - - J - - 0x0348E5 1A:88D5: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0348E8 1A:88D8: 18        CLC
C - - - - - 0x0348E9 1A:88D9: 20 95 90  JSR sub_9095
C - - - - - 0x0348EC 1A:88DC: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0348EF 1A:88DF: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0348F2 1A:88E2: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x0348F5 1A:88E5: A2 50     LDX #$50
C - - - - - 0x0348F7 1A:88E7: 9A        TXS
C - - - - - 0x0348F8 1A:88E8: 4C 0F C6  JMP loc_0x03E0EF



tbl_88EB:
; 00 
- D 0 - - - 0x0348FB 1A:88EB: 80        .byte $80   ; 00 
- - - - - - 0x0348FC 1A:88EC: 00        .byte $00   ; 01 
- - - - - - 0x0348FD 1A:88ED: 00        .byte $00   ; 02 
- - - - - - 0x0348FE 1A:88EE: 00        .byte $00   ; 03 
; 01 
- - - - - - 0x0348FF 1A:88EF: 00        .byte $00   ; 00 
- - - - - - 0x034900 1A:88F0: 00        .byte $00   ; 01 
- D 0 - - - 0x034901 1A:88F1: 80        .byte $80   ; 02 
- - - - - - 0x034902 1A:88F2: 00        .byte $00   ; 03 



loc_88F3:
loc_0x034903:
C D 0 - - - 0x034903 1A:88F3: A9 00     LDA #$00
C - - - - - 0x034905 1A:88F5: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034908 1A:88F8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03490B 1A:88FB: 49 0B     EOR #$0B
C - - - - - 0x03490D 1A:88FD: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034910 1A:8900: AD E2 00  LDA ram_random + $01
C - - - - - 0x034913 1A:8903: A0 00     LDY #$00
bra_8905_loop:
C - - - - - 0x034915 1A:8905: D9 28 89  CMP tbl_8928,Y
C - - - - - 0x034918 1A:8908: B0 05     BCS bra_890F
C - - - - - 0x03491A 1A:890A: F0 03     BEQ bra_890F
C - - - - - 0x03491C 1A:890C: C8        INY
C - - - - - 0x03491D 1A:890D: D0 F6     BNE bra_8905_loop   ; jmp
bra_890F:
C - - - - - 0x03491F 1A:890F: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034922 1A:8912: A9 00     LDA #$00
C - - - - - 0x034924 1A:8914: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034927 1A:8917: A9 0C     LDA #con_s_id_0C
C - - - - - 0x034929 1A:8919: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03492C 1A:891C: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03492F 1A:891F: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034932 1A:8922: AC 85     .word ofs_042_85AC_00
- D 0 - I - 0x034934 1A:8924: 05 86     .word ofs_042_8605_01
- D 0 - I - 0x034936 1A:8926: 1C 86     .word ofs_042_861C_02



tbl_8928:
- D 0 - - - 0x034938 1A:8928: 10        .byte $10
- D 0 - - - 0x034939 1A:8929: 00        .byte $00



loc_892A:
C D 0 - - - 0x03493A 1A:892A: A0 00     LDY #$00
C - - - - - 0x03493C 1A:892C: A9 00     LDA #$00
C - - - - - 0x03493E 1A:892E: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034941 1A:8931: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034944 1A:8934: AD E2 00  LDA ram_random + $01
bra_8937_loop:
C - - - - - 0x034947 1A:8937: D9 75 89  CMP tbl_8975_сценарий_после_обводки_кипера,Y
C - - - - - 0x03494A 1A:893A: B0 05     BCS bra_8941_сценарий_выбран
C - - - - - 0x03494C 1A:893C: F0 03     BEQ bra_8941_сценарий_выбран
C - - - - - 0x03494E 1A:893E: C8        INY
C - - - - - 0x03494F 1A:893F: D0 F6     BNE bra_8937_loop
bra_8941_сценарий_выбран:
C - - - - - 0x034951 1A:8941: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034954 1A:8944: A9 0D     LDA #con_s_id_0D
C - - - - - 0x034956 1A:8946: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034959 1A:8949: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03495C 1A:894C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03495F 1A:894F: 55 89     .word ofs_044_8955_00
- D 0 - I - 0x034961 1A:8951: 55 89     .word ofs_044_8955_01
- D 0 - I - 0x034963 1A:8953: 72 89     .word ofs_044_8972_02



ofs_044_8955_00:
ofs_044_8955_01:
C - - J - - 0x034965 1A:8955: 2C 4C 04  BIT ram_044C
C - - - - - 0x034968 1A:8958: 10 15     BPL bra_896F
C - - - - - 0x03496A 1A:895A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x03496D 1A:895D: C9 14     CMP #$14      ; проверка на номера 10 соперника
C - - - - - 0x03496F 1A:895F: D0 0E     BNE bra_896F
C - - - - - 0x034971 1A:8961: 20 70 90  JSR sub_9070
C - - - - - 0x034974 1A:8964: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - - 0x034977 1A:8967: A9 47     LDA #con_s_id_47
C - - - - - 0x034979 1A:8969: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03497C 1A:896C: 4C BC 85  JMP loc_85BC
bra_896F:
C - - - - - 0x03497F 1A:896F: 4C AC 85  JMP loc_85AC



tbl_8975_сценарий_после_обводки_кипера:
- D 0 - - - 0x034985 1A:8975: 56        .byte $56     ; защитник отобъет удар
- D 0 - - - 0x034986 1A:8976: 45        .byte $45     ; защитник промахнется
- D 0 - - - 0x034987 1A:8977: 00        .byte $00     ; гол (последний вариант)



loc_8978:
C D 0 - - - 0x034988 1A:8978: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03498A 1A:897A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03498D 1A:897D: 20 72 8F  JSR sub_8F72
C - - - - - 0x034990 1A:8980: A9 0E     LDA #con_s_id_0E
C - - - - - 0x034992 1A:8982: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034995 1A:8985: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034998 1A:8988: D0 09     BNE bra_8993
C - - - - - 0x03499A 1A:898A: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x03499D 1A:898D: 20 DD 90  JSR sub_90DD
C - - - - - 0x0349A0 1A:8990: 4C 6F 8A  JMP loc_8A6F
bra_8993:
C - - - - - 0x0349A3 1A:8993: A9 00     LDA #$00
C - - - - - 0x0349A5 1A:8995: 8D 16 06  STA ram_индекс_защитника
bra_8998_loop:
C - - - - - 0x0349A8 1A:8998: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0349AB 1A:899B: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x0349AE 1A:899E: C9 06     CMP #$06
C - - - - - 0x0349B0 1A:89A0: F0 19     BEQ bra_89BB
C - - - - - 0x0349B2 1A:89A2: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0349B5 1A:89A5: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0349B8 1A:89A8: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0349BB 1A:89AB: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0349BE 1A:89AE: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0349C1 1A:89B1: A9 0F     LDA #con_s_id_0F
C - - - - - 0x0349C3 1A:89B3: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0349C6 1A:89B6: A9 14     LDA #$14
C - - - - - 0x0349C8 1A:89B8: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_89BB:
C - - - - - 0x0349CB 1A:89BB: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0349CE 1A:89BE: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0349D1 1A:89C1: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0349D4 1A:89C4: D0 D2     BNE bra_8998_loop
C - - - - - 0x0349D6 1A:89C6: A9 04     LDA #con_s_id_04
C - - - - - 0x0349D8 1A:89C8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0349DB 1A:89CB: A9 00     LDA #$00
C - - - - - 0x0349DD 1A:89CD: 8D 16 06  STA ram_индекс_защитника
loc_89D0_loop:
C D 0 - - - 0x0349E0 1A:89D0: A9 01     LDA #$01
C - - - - - 0x0349E2 1A:89D2: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0349E5 1A:89D5: A9 00     LDA #$00
C - - - - - 0x0349E7 1A:89D7: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0349EA 1A:89DA: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0349ED 1A:89DD: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0349F0 1A:89E0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0349F3 1A:89E3: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0349F6 1A:89E6: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0349F9 1A:89E9: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x0349FC 1A:89EC: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0349FF 1A:89EF: C9 06     CMP #$06
C - - - - - 0x034A01 1A:89F1: D0 03     BNE bra_89F6
C - - - - - 0x034A03 1A:89F3: 4C 4F 8A  JMP loc_8A4F
bra_89F6:
C - - - - - 0x034A06 1A:89F6: C9 05     CMP #$05
C - - - - - 0x034A08 1A:89F8: D0 03     BNE bra_89FD
C - - - - - 0x034A0A 1A:89FA: 4C 4F 8A  JMP loc_8A4F
bra_89FD:
C - - - - - 0x034A0D 1A:89FD: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034A0F 1A:89FF: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034A12 1A:8A02: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x034A15 1A:8A05: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x034A18 1A:8A08: BD 63 8A  LDA tbl_8A63_offset_attack,X
C - - - - - 0x034A1B 1A:8A0B: 0A        ASL
C - - - - - 0x034A1C 1A:8A0C: 0A        ASL
C - - - - - 0x034A1D 1A:8A0D: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034A20 1A:8A10: 7D 6A 8A  ADC tbl_8A6A_offset_defense,X
C - - - - - 0x034A23 1A:8A13: AA        TAX
C - - - - - 0x034A24 1A:8A14: 0A        ASL
C - - - - - 0x034A25 1A:8A15: 85 3B     STA ram_003B
C - - - - - 0x034A27 1A:8A17: A9 08     LDA #$08
C - - - - - 0x034A29 1A:8A19: BC E1 83  LDY tbl_83E1,X
C - - - - - 0x034A2C 1A:8A1C: 20 E9 8E  JSR sub_8EE9
bra_8A1F_loop:
C - - - - - 0x034A2F 1A:8A1F: DD AC 8A  CMP tbl_8AAC,X
C - - - - - 0x034A32 1A:8A22: B0 04     BCS bra_8A28
C - - - - - 0x034A34 1A:8A24: E8        INX
C - - - - - 0x034A35 1A:8A25: C8        INY
C - - - - - 0x034A36 1A:8A26: D0 F7     BNE bra_8A1F_loop
bra_8A28:
C - - - - - 0x034A38 1A:8A28: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034A3B 1A:8A2B: A9 11     LDA #con_s_id_11
C - - - - - 0x034A3D 1A:8A2D: A2 01     LDX #$01
C - - - - - 0x034A3F 1A:8A2F: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x034A42 1A:8A32: C0 02     CPY #$02
C - - - - - 0x034A44 1A:8A34: 90 03     BCC bra_8A39
C - - - - - 0x034A46 1A:8A36: CA        DEX ; 00
C - - - - - 0x034A47 1A:8A37: A9 10     LDA #con_s_id_10
bra_8A39:
C - - - - - 0x034A49 1A:8A39: 48        PHA
C - - - - - 0x034A4A 1A:8A3A: 8A        TXA
C - - - - - 0x034A4B 1A:8A3B: 4A        LSR
C - - - - - 0x034A4C 1A:8A3C: 20 95 90  JSR sub_9095
C - - - - - 0x034A4F 1A:8A3F: 68        PLA
C - - - - - 0x034A50 1A:8A40: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A53 1A:8A43: A9 12     LDA #con_s_id_12
C - - - - - 0x034A55 1A:8A45: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A58 1A:8A48: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x034A5B 1A:8A4B: C0 02     CPY #$02
C - - - - - 0x034A5D 1A:8A4D: B0 11     BCS bra_8A60
loc_8A4F:
C D 0 - - - 0x034A5F 1A:8A4F: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x034A62 1A:8A52: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x034A65 1A:8A55: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x034A68 1A:8A58: F0 03     BEQ bra_8A5D
C - - - - - 0x034A6A 1A:8A5A: 4C D0 89  JMP loc_89D0_loop
bra_8A5D:
C - - - - - 0x034A6D 1A:8A5D: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_8A60:
C - - - - - 0x034A70 1A:8A60: 4C 6F 8A  JMP loc_8A6F



tbl_8A63_offset_attack:
- - - - - - 0x034A73 1A:8A63: 00        .byte $00   ; 00 
- D 0 - - - 0x034A74 1A:8A64: 00        .byte $00   ; 01 
- - - - - - 0x034A75 1A:8A65: 00        .byte $00   ; 02 
- - - - - - 0x034A76 1A:8A66: 00        .byte $00   ; 03 
- D 0 - - - 0x034A77 1A:8A67: 01        .byte $01   ; 04 
- - - - - - 0x034A78 1A:8A68: 00        .byte $00   ; 05 
- D 0 - - - 0x034A79 1A:8A69: 02        .byte $02   ; 06 



tbl_8A6A_offset_defense:
- - - - - - 0x034A7A 1A:8A6A: 00        .byte $00   ; 00 
- - - - - - 0x034A7B 1A:8A6B: 00        .byte $00   ; 01 
- D 0 - - - 0x034A7C 1A:8A6C: 00        .byte $00   ; 02 
- - - - - - 0x034A7D 1A:8A6D: 00        .byte $00   ; 03 
- D 0 - - - 0x034A7E 1A:8A6E: 01        .byte $01   ; 04 



loc_8A6F:
C D 0 - - - 0x034A7F 1A:8A6F: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034A82 1A:8A72: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034A85 1A:8A75: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034A88 1A:8A78: 80 8A     .word ofs_045_8A80_00
- D 0 - I - 0x034A8A 1A:8A7A: 80 8A     .word ofs_045_8A80_01
- D 0 - I - 0x034A8C 1A:8A7C: DF 8B     .word ofs_045_8BDF_02
- D 0 - I - 0x034A8E 1A:8A7E: 9C 8A     .word ofs_045_8A9C_03



ofs_045_8A80_00:
ofs_045_8A80_01:
C - - J - - 0x034A90 1A:8A80: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x034A93 1A:8A83: A9 13     LDA #con_s_id_13
C - - - - - 0x034A95 1A:8A85: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A98 1A:8A88: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034A9B 1A:8A8B: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- - - - - - 0x034A9E 1A:8A8E: 00        .word $0000 ; 00
- D 0 - I - 0x034AA0 1A:8A90: 12 C6     .word ofs_041_0x03DE62_01
- - - - - - 0x034AA2 1A:8A92: 00        .word $0000 ; 02
- - - - - - 0x034AA4 1A:8A94: 00        .word $0000 ; 03
- D 0 - I - 0x034AA6 1A:8A96: 27 C6     .word ofs_041_0x03E55C_04
- - - - - - 0x034AA8 1A:8A98: 00        .word $0000 ; 05
- D 0 - I - 0x034AAA 1A:8A9A: 2D C6     .word ofs_041_0x03E698_06



ofs_045_8A9C_03:
C - - J - - 0x034AAC 1A:8A9C: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034AAF 1A:8A9F: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x034AB2 1A:8AA2: C9 02     CMP #$02
C - - - - - 0x034AB4 1A:8AA4: D0 03     BNE bra_8AA9
C - - - - - 0x034AB6 1A:8AA6: 4C DE 81  JMP loc_81DE
bra_8AA9:
C - - - - - 0x034AB9 1A:8AA9: 4C DF 8B  JMP loc_8BDF



tbl_8AAC:
- D 0 - - - 0x034ABC 1A:8AAC: A0        .byte $A0
- D 0 - - - 0x034ABD 1A:8AAD: 60        .byte $60
- D 0 - - - 0x034ABE 1A:8AAE: 40        .byte $40
- D 0 - - - 0x034ABF 1A:8AAF: 00        .byte $00



loc_8AB0:
C D 0 - - - 0x034AC0 1A:8AB0: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034AC3 1A:8AB3: A2 02     LDX #$02
C - - - - - 0x034AC5 1A:8AB5: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034AC8 1A:8AB8: AD E2 00  LDA ram_random + $01
C - - - - - 0x034ACB 1A:8ABB: 29 03     AND #$03
C - - - - - 0x034ACD 1A:8ABD: C9 03     CMP #$03
C - - - - - 0x034ACF 1A:8ABF: D0 02     BNE bra_8AC3
C - - - - - 0x034AD1 1A:8AC1: A9 00     LDA #$00
bra_8AC3:
C - - - - - 0x034AD3 1A:8AC3: 18        CLC
C - - - - - 0x034AD4 1A:8AC4: 69 03     ADC #$03
C - - - - - 0x034AD6 1A:8AC6: 85 3A     STA ram_003A
C - - - - - 0x034AD8 1A:8AC8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034ADB 1A:8ACB: 49 0B     EOR #$0B
C - - - - - 0x034ADD 1A:8ACD: 18        CLC
C - - - - - 0x034ADE 1A:8ACE: 65 3A     ADC ram_003A
C - - - - - 0x034AE0 1A:8AD0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034AE3 1A:8AD3: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034AE6 1A:8AD6: A2 03     LDX #$03
C - - - - - 0x034AE8 1A:8AD8: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034AEB 1A:8ADB: A9 00     LDA #$00
C - - - - - 0x034AED 1A:8ADD: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x034AF0 1A:8AE0: A9 00     LDA #$00
C - - - - - 0x034AF2 1A:8AE2: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034AF5 1A:8AE5: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034AF8 1A:8AE8: 20 72 8F  JSR sub_8F72
C - - - - - 0x034AFB 1A:8AEB: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034AFD 1A:8AED: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034B00 1A:8AF0: A9 0A     LDA #$0A
C - - - - - 0x034B02 1A:8AF2: A2 00     LDX #$00
C - - - - - 0x034B04 1A:8AF4: 86 3B     STX ram_003B
C - - - - - 0x034B06 1A:8AF6: A2 80     LDX #$80
C - - - - - 0x034B08 1A:8AF8: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x034B0B 1A:8AFB: A0 00     LDY #$00
C - - - - - 0x034B0D 1A:8AFD: AE 12 06  LDX ram_результат_защитника
C - - - - - 0x034B10 1A:8B00: D0 08     BNE bra_8B0A
bra_8B02_loop:
C - - - - - 0x034B12 1A:8B02: D9 46 8B  CMP tbl_8B46,Y
C - - - - - 0x034B15 1A:8B05: B0 03     BCS bra_8B0A
C - - - - - 0x034B17 1A:8B07: C8        INY
C - - - - - 0x034B18 1A:8B08: D0 F8     BNE bra_8B02_loop
bra_8B0A:
C - - - - - 0x034B1A 1A:8B0A: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034B1D 1A:8B0D: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034B20 1A:8B10: A2 FE     LDX #$FE
C - - - - - 0x034B22 1A:8B12: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034B25 1A:8B15: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034B28 1A:8B18: A2 FD     LDX #$FD
C - - - - - 0x034B2A 1A:8B1A: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034B2D 1A:8B1D: A9 14     LDA #con_s_id_14
C - - - - - 0x034B2F 1A:8B1F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034B32 1A:8B22: A9 00     LDA #$00
C - - - - - 0x034B34 1A:8B24: 8D 1A 06  STA ram_061A
C - - - - - 0x034B37 1A:8B27: A9 02     LDA #$02
C - - - - - 0x034B39 1A:8B29: 8D FF 05  STA ram_05FF
C - - - - - 0x034B3C 1A:8B2C: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034B3F 1A:8B2F: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034B42 1A:8B32: 1B C6     .word ofs_039_0x03DD12_00
- D 0 - I - 0x034B44 1A:8B34: 1B C6     .word ofs_039_0x03DD12_01
- D 0 - I - 0x034B46 1A:8B36: DF 8B     .word ofs_039_8BDF_02
- D 0 - I - 0x034B48 1A:8B38: D5 88     .word ofs_039_88D5_03



sub_8B3A_изменить_уровень_игрока:
; может как повышаться, так и понижаться
C - - - - - 0x034B4A 1A:8B3A: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034B4D 1A:8B3D: A0 03     LDY #con_plr_lvl
C - - - - - 0x034B4F 1A:8B3F: 8A        TXA
C - - - - - 0x034B50 1A:8B40: 18        CLC
C - - - - - 0x034B51 1A:8B41: 71 34     ADC (ram_plr_data),Y    ; con_plr_lvl
C - - - - - 0x034B53 1A:8B43: 91 34     STA (ram_plr_data),Y    ; con_plr_lvl
C - - - - - 0x034B55 1A:8B45: 60        RTS



tbl_8B46:
- D 0 - - - 0x034B56 1A:8B46: A0        .byte $A0
- D 0 - - - 0x034B57 1A:8B47: 60        .byte $60
- D 0 - - - 0x034B58 1A:8B48: 40        .byte $40
- D 0 - - - 0x034B59 1A:8B49: 00        .byte $00



sub_8B4A:
sub_0x034B5A:
C D 0 - - - 0x034B5A 1A:8B4A: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x034B5D 1A:8B4D: B0 01     BCS bra_8B50
C - - - - - 0x034B5F 1A:8B4F: 60        RTS
bra_8B50:
C - - - - - 0x034B60 1A:8B50: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x034B63 1A:8B53: A9 00     LDA #$00
C - - - - - 0x034B65 1A:8B55: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034B68 1A:8B58: 8A        TXA
C - - - - - 0x034B69 1A:8B59: A2 02     LDX #$02
C - - - - - 0x034B6B 1A:8B5B: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x034B6E 1A:8B5E: F0 02     BEQ bra_8B62_команда_справа
; if мяч у команды слева (да, комменты по идее правильные)
C - - - - - 0x034B70 1A:8B60: A2 01     LDX #$01
bra_8B62_команда_справа:
C - - - - - 0x034B72 1A:8B62: 8E 21 06  STX ram_0621
C - - - - - 0x034B75 1A:8B65: A9 FF     LDA #$FF
C - - - - - 0x034B77 1A:8B67: 8D 1A 06  STA ram_061A
C - - - - - 0x034B7A 1A:8B6A: 20 E1 87  JSR sub_87E1
C - - - - - 0x034B7D 1A:8B6D: A2 50     LDX #$50
C - - - - - 0x034B7F 1A:8B6F: 9A        TXS
C - - - - - 0x034B80 1A:8B70: 4C 73 8B  JMP loc_8B73    ; bzk optimize, бесполезный JMP



loc_8B73:
C D 0 - - - 0x034B83 1A:8B73: A9 0A     LDA #$0A
C - - - - - 0x034B85 1A:8B75: 20 09 C6  JSR sub_0x03E4E7
C - - - - - 0x034B88 1A:8B78: A9 3F     LDA #con_s_id_3F
C - - - - - 0x034B8A 1A:8B7A: AE 21 06  LDX ram_0621
C - - - - - 0x034B8D 1A:8B7D: E0 02     CPX #$02
C - - - - - 0x034B8F 1A:8B7F: F0 05     BEQ bra_8B86
C - - - - - 0x034B91 1A:8B81: 20 8F 84  JSR sub_848F
C - - - - - 0x034B94 1A:8B84: A9 2F     LDA #con_s_id_2F
bra_8B86:
C - - - - - 0x034B96 1A:8B86: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034B99 1A:8B89: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - - 0x034B9C 1A:8B8C: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034B9F 1A:8B8F: AD 21 06  LDA ram_0621
C - - - - - 0x034BA2 1A:8B92: C9 01     CMP #$01
C - - - - - 0x034BA4 1A:8B94: D0 03     BNE bra_8B99
C - - - - - 0x034BA6 1A:8B96: 4C 98 82  JMP loc_8298
bra_8B99:
C - - - - - 0x034BA9 1A:8B99: 4C 78 89  JMP loc_8978



sub_8B9C:
C - - - - - 0x034BAC 1A:8B9C: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034BAF 1A:8B9F: C9 60     CMP #$60
C - - - - - 0x034BB1 1A:8BA1: 90 13     BCC bra_8BB6
C - - - - - 0x034BB3 1A:8BA3: C9 A0     CMP #$A0
C - - - - - 0x034BB5 1A:8BA5: B0 0F     BCS bra_8BB6
C - - - - - 0x034BB7 1A:8BA7: A2 00     LDX #$00
C - - - - - 0x034BB9 1A:8BA9: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034BBC 1A:8BAC: C9 50     CMP #$50
C - - - - - 0x034BBE 1A:8BAE: 90 08     BCC bra_8BB8
C - - - - - 0x034BC0 1A:8BB0: A2 0B     LDX #$0B
C - - - - - 0x034BC2 1A:8BB2: C9 B0     CMP #$B0
C - - - - - 0x034BC4 1A:8BB4: B0 02     BCS bra_8BB8
bra_8BB6:
C - - - - - 0x034BC6 1A:8BB6: 18        CLC
C - - - - - 0x034BC7 1A:8BB7: 60        RTS
bra_8BB8:
C - - - - - 0x034BC8 1A:8BB8: 38        SEC
C - - - - - 0x034BC9 1A:8BB9: 60        RTS



sub_8BBA:
C - - - - - 0x034BCA 1A:8BBA: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034BCD 1A:8BBD: F0 08     BEQ bra_8BC7_RTS
C - - - - - 0x034BCF 1A:8BBF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034BD2 1A:8BC2: A2 01     LDX #$01
C - - - - - 0x034BD4 1A:8BC4: 4C D4 8B  JMP loc_8BD4_начислить_опыт
bra_8BC7_RTS:
C - - - - - 0x034BD7 1A:8BC7: 60        RTS



sub_8BC8_начислить_опыт:
C - - - - - 0x034BD8 1A:8BC8: A2 03     LDX #$03
C - - - - - 0x034BDA 1A:8BCA: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034BDD 1A:8BCD: F0 05     BEQ bra_8BD4_это_кипер
C - - - - - 0x034BDF 1A:8BCF: C9 0B     CMP #$0B
C - - - - - 0x034BE1 1A:8BD1: F0 01     BEQ bra_8BD4_это_кипер
C - - - - - 0x034BE3 1A:8BD3: CA        DEX ; 02
bra_8BD4_это_кипер:
sub_8BD4_начислить_опыт:
loc_8BD4_начислить_опыт:
C D 0 - - - 0x034BE4 1A:8BD4: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034BE7 1A:8BD7: A0 00     LDY #con_plr_id
C - - - - - 0x034BE9 1A:8BD9: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
                                        BEQ bra_8BDE_RTS    ; if con_p_clone
                                        CMP #$23
                                        BCS bra_8BDE_RTS    ; if игрок команды соперника
; if игрок из нашей команды
C - - - - - 0x034BEB 1A:8BDB: 20 C8 C4  JSR sub_0x03C4D8_начислить_опыт
bra_8BDE_RTS:
C - - - - - 0x034BEE 1A:8BDE: 60        RTS



loc_8BDF:
ofs_039_8BDF_02:
ofs_044_8972_02:
ofs_045_8BDF_02:
ofs_063_8BDF_01:
C D 0 - - - 0x034BEF 1A:8BDF: 20 70 90  JSR sub_9070
C - - - - - 0x034BF2 1A:8BE2: 20 6D 8C  JSR sub_8C6D
loc_8BE5:
loc_0x034BF5:
C D 0 - - - 0x034BF5 1A:8BE5: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034BF8 1A:8BE8: 20 42 8C  JSR sub_8C42
C - - - - - 0x034BFB 1A:8BEB: B0 25     BCS bra_8C12
C - - - - - 0x034BFD 1A:8BED: A9 00     LDA #$00
C - - - - - 0x034BFF 1A:8BEF: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - - 0x034C02 1A:8BF2: 85 3A     STA ram_003A
C - - - - - 0x034C04 1A:8BF4: A5 47     LDA ram_0047
C - - - - - 0x034C06 1A:8BF6: 48        PHA
C - - - - - 0x034C07 1A:8BF7: A9 0B     LDA #$0B
C - - - - - 0x034C09 1A:8BF9: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - - 0x034C0C 1A:8BFC: AA        TAX
C - - - - - 0x034C0D 1A:8BFD: 68        PLA
C - - - - - 0x034C0E 1A:8BFE: C5 47     CMP ram_0047
C - - - - - 0x034C10 1A:8C00: 90 0E     BCC bra_8C10
C - - - - - 0x034C12 1A:8C02: F0 05     BEQ bra_8C09
C - - - - - 0x034C14 1A:8C04: 86 3A     STX ram_003A
C - - - - - 0x034C16 1A:8C06: 4C 10 8C  JMP loc_8C10
bra_8C09:
C - - - - - 0x034C19 1A:8C09: 2C E2 00  BIT ram_random + $01
C - - - - - 0x034C1C 1A:8C0C: 10 02     BPL bra_8C10
C - - - - - 0x034C1E 1A:8C0E: 86 3A     STX ram_003A
bra_8C10:
loc_8C10:
C D 0 - - - 0x034C20 1A:8C10: A5 3A     LDA ram_003A
bra_8C12:
C - - - - - 0x034C22 1A:8C12: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034C25 1A:8C15: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034C28 1A:8C18: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034C2B 1A:8C1B: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x034C2D 1A:8C1D: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034C30 1A:8C20: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x034C32 1A:8C22: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x034C34 1A:8C24: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034C37 1A:8C27: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x034C39 1A:8C29: A9 00     LDA #$00
C - - - - - 0x034C3B 1A:8C2B: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034C3E 1A:8C2E: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x034C41 1A:8C31: 20 4A 8B  JSR sub_8B4A
C - - - - - 0x034C44 1A:8C34: A9 2C     LDA #con_s_id_2C
C - - - - - 0x034C46 1A:8C36: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034C49 1A:8C39: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - - 0x034C4C 1A:8C3C: A2 50     LDX #$50
C - - - - - 0x034C4E 1A:8C3E: 9A        TXS
C - - - - - 0x034C4F 1A:8C3F: 4C 0F C6  JMP loc_0x03E0EF



sub_8C42:
C - - - - - 0x034C52 1A:8C42: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034C55 1A:8C45: F0 18     BEQ bra_8C5F
C - - - - - 0x034C57 1A:8C47: A2 00     LDX #$00
bra_8C49_loop:
C - - - - - 0x034C59 1A:8C49: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034C5C 1A:8C4C: F0 0B     BEQ bra_8C59
C - - - - - 0x034C5E 1A:8C4E: C9 0B     CMP #$0B
C - - - - - 0x034C60 1A:8C50: F0 07     BEQ bra_8C59
C - - - - - 0x034C62 1A:8C52: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034C65 1A:8C55: C9 05     CMP #$05
C - - - - - 0x034C67 1A:8C57: F0 08     BEQ bra_8C61
bra_8C59:
C - - - - - 0x034C69 1A:8C59: E8        INX
C - - - - - 0x034C6A 1A:8C5A: EC 00 06  CPX ram_колво_защитников
C - - - - - 0x034C6D 1A:8C5D: D0 EA     BNE bra_8C49_loop
bra_8C5F:
C - - - - - 0x034C6F 1A:8C5F: 18        CLC
C - - - - - 0x034C70 1A:8C60: 60        RTS
bra_8C61:
C - - - - - 0x034C71 1A:8C61: AD E2 00  LDA ram_random + $01
C - - - - - 0x034C74 1A:8C64: C9 40     CMP #$40
C - - - - - 0x034C76 1A:8C66: B0 F7     BCS bra_8C5F
C - - - - - 0x034C78 1A:8C68: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034C7B 1A:8C6B: 38        SEC
C - - - - - 0x034C7C 1A:8C6C: 60        RTS



sub_8C6D:
C - - - - - 0x034C7D 1A:8C6D: AD E2 00  LDA ram_random + $01
C - - - - - 0x034C80 1A:8C70: 29 83     AND #$83
C - - - - - 0x034C82 1A:8C72: AE 37 06  LDX ram_ball_pos_Y_hi
C - - - - - 0x034C85 1A:8C75: 20 92 8C  JSR sub_8C92
C - - - - - 0x034C88 1A:8C78: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x034C8B 1A:8C7B: AD E3 00  LDA ram_random + $02
C - - - - - 0x034C8E 1A:8C7E: 29 83     AND #$83
C - - - - - 0x034C90 1A:8C80: 8D 2C 06  STA ram_062C
C - - - - - 0x034C93 1A:8C83: AE 35 06  LDX ram_ball_pos_X_hi
C - - - - - 0x034C96 1A:8C86: 20 92 8C  JSR sub_8C92
C - - - - - 0x034C99 1A:8C89: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x034C9C 1A:8C8C: A9 00     LDA #$00
C - - - - - 0x034C9E 1A:8C8E: 20 A4 8C  JSR sub_8CA4
C - - - - - 0x034CA1 1A:8C91: 60        RTS



sub_8C92:
C - - - - - 0x034CA2 1A:8C92: 0A        ASL
C - - - - - 0x034CA3 1A:8C93: 08        PHP
C - - - - - 0x034CA4 1A:8C94: 0A        ASL
C - - - - - 0x034CA5 1A:8C95: 0A        ASL
C - - - - - 0x034CA6 1A:8C96: 28        PLP
C - - - - - 0x034CA7 1A:8C97: 90 04     BCC bra_8C9D
C - - - - - 0x034CA9 1A:8C99: 49 FF     EOR #$FF
C - - - - - 0x034CAB 1A:8C9B: 69 00     ADC #$00
bra_8C9D:
C - - - - - 0x034CAD 1A:8C9D: 85 3A     STA ram_003A
C - - - - - 0x034CAF 1A:8C9F: 8A        TXA
C - - - - - 0x034CB0 1A:8CA0: 18        CLC
C - - - - - 0x034CB1 1A:8CA1: 65 3A     ADC ram_003A
C - - - - - 0x034CB3 1A:8CA3: 60        RTS



sub_8CA4:
sub_0x034CB4:
C D 0 - - - 0x034CB4 1A:8CA4: 4A        LSR
C - - - - - 0x034CB5 1A:8CA5: 08        PHP
C - - - - - 0x034CB6 1A:8CA6: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034CB9 1A:8CA9: C9 30     CMP #$30
C - - - - - 0x034CBB 1A:8CAB: 90 1E     BCC bra_8CCB
C - - - - - 0x034CBD 1A:8CAD: C9 D0     CMP #$D0
C - - - - - 0x034CBF 1A:8CAF: B0 1A     BCS bra_8CCB
C - - - - - 0x034CC1 1A:8CB1: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034CC4 1A:8CB4: C9 50     CMP #$50
C - - - - - 0x034CC6 1A:8CB6: 90 06     BCC bra_8CBE
C - - - - - 0x034CC8 1A:8CB8: C9 B0     CMP #$B0
C - - - - - 0x034CCA 1A:8CBA: B0 02     BCS bra_8CBE
C - - - - - 0x034CCC 1A:8CBC: 28        PLP
C - - - - - 0x034CCD 1A:8CBD: 60        RTS
bra_8CBE:
C - - - - - 0x034CCE 1A:8CBE: 28        PLP
C - - - - - 0x034CCF 1A:8CBF: 20 EA 8C  JSR sub_8CEA
C - - - - - 0x034CD2 1A:8CC2: 20 5A C5  JSR sub_0x03CF5F
C - - - - - 0x034CD5 1A:8CC5: A2 50     LDX #$50
C - - - - - 0x034CD7 1A:8CC7: 9A        TXS
C - - - - - 0x034CD8 1A:8CC8: 4C 1C 91  JMP loc_911C
bra_8CCB:
C - - - - - 0x034CDB 1A:8CCB: 28        PLP
C - - - - - 0x034CDC 1A:8CCC: 20 EA 8C  JSR sub_8CEA
C - - - - - 0x034CDF 1A:8CCF: 20 5A C5  JSR sub_0x03CF5F
C - - - - - 0x034CE2 1A:8CD2: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034CE5 1A:8CD5: F0 02     BEQ bra_8CD9_команда_слева
; if мяч у команды справа
C - - - - - 0x034CE7 1A:8CD7: A9 80     LDA #$80
bra_8CD9_команда_слева:
C - - - - - 0x034CE9 1A:8CD9: 4D 35 06  EOR ram_ball_pos_X_hi    ; A = 00, bzk optimize, небезопасно
C - - - - - 0x034CEC 1A:8CDC: 10 06     BPL bra_8CE4
C - - - - - 0x034CEE 1A:8CDE: A2 50     LDX #$50
C - - - - - 0x034CF0 1A:8CE0: 9A        TXS
C - - - - - 0x034CF1 1A:8CE1: 4C EE 92  JMP loc_92EE
bra_8CE4:
C - - - - - 0x034CF4 1A:8CE4: A2 50     LDX #$50
C - - - - - 0x034CF6 1A:8CE6: 9A        TXS
C - - - - - 0x034CF7 1A:8CE7: 4C 5E 95  JMP loc_955E_очистить_stun_кипера_команды



sub_8CEA:
C - - - - - 0x034CFA 1A:8CEA: 90 08     BCC bra_8CF4_RTS
C - - - - - 0x034CFC 1A:8CEC: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034CFF 1A:8CEF: 49 0B     EOR #$0B
C - - - - - 0x034D01 1A:8CF1: 8D FB 05  STA ram_команда_с_мячом
bra_8CF4_RTS:
C - - - - - 0x034D04 1A:8CF4: 60        RTS



sub_8CF5:
C - - - - - 0x034D06 1A:8CF6: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
; судя по новому логу, только для кипера соперника?
C - - - - - 0x034D0A 1A:8CFA: A0 07     LDY #con_величина_наебки
                                        LDA (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x034D0C 1A:8CFC: 18        CLC
C - - - - - 0x034D0D 1A:8CFD: 71 34     ADC #$24
C - - - - - 0x034D0F 1A:8CFF: 10 02     BPL bra_8D03_not_overflow
- - - - - - 0x034D11 1A:8D01: A9 7F     LDA #$7F
bra_8D03_not_overflow:
; судя по новому логу, только для кипера соперника?
C - - - - - 0x034D13 1A:8D03: 91 34     STA (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x034D15 1A:8D05: 60        RTS



sub_8D06:
; бряк срабатывает при вычислении шанса успеха отбора мяча при каком-то соперничестве?
C - - - - - 0x034D16 1A:8D06: 08        PHP
C - - - - - 0x034D17 1A:8D07: 0A        ASL
C - - - - - 0x034D18 1A:8D08: AA        TAX
C - - - - - 0x034D19 1A:8D09: BD 93 8D  LDA tbl_8D93,X
C - - - - - 0x034D1C 1A:8D0C: 85 3C     STA ram_003C
C - - - - - 0x034D1E 1A:8D0E: BD 94 8D  LDA tbl_8D93 + $01,X
C - - - - - 0x034D21 1A:8D11: 85 3D     STA ram_003D
C - - - - - 0x034D23 1A:8D13: AD E2 00  LDA ram_random + $01
C - - - - - 0x034D26 1A:8D16: 6D E3 00  ADC ram_random + $02
C - - - - - 0x034D29 1A:8D19: 6A        ROR
C - - - - - 0x034D2A 1A:8D1A: A2 00     LDX #$00
C - - - - - 0x034D2C 1A:8D1C: 28        PLP
C - - - - - 0x034D2D 1A:8D1D: 10 2B     BPL bra_8D4A
C - - - - - 0x034D2F 1A:8D1F: 24 3A     BIT ram_003A
C - - - - - 0x034D31 1A:8D21: 30 27     BMI bra_8D4A
C - - - - - 0x034D33 1A:8D23: AC 21 06  LDY ram_0621
C - - - - - 0x034D36 1A:8D26: C0 04     CPY #$04
C - - - - - 0x034D38 1A:8D28: D0 09     BNE bra_8D33
C - - - - - 0x034D3A 1A:8D2A: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x034D3D 1A:8D2D: F0 0B     BEQ bra_8D3A_это_кипер
C - - - - - 0x034D3F 1A:8D2F: C0 0B     CPY #$0B
C - - - - - 0x034D41 1A:8D31: F0 07     BEQ bra_8D3A_это_кипер
bra_8D33:
C - - - - - 0x034D43 1A:8D33: AC E3 00  LDY ram_random + $02
C - - - - - 0x034D46 1A:8D36: C0 F8     CPY #$F8      ; шанс крита (kurae)
C - - - - - 0x034D48 1A:8D38: 90 10     BCC bra_8D4A
bra_8D3A_это_кипер:
C - - - - - 0x034D4A 1A:8D3A: E8        INX
C - - - - - 0x034D4B 1A:8D3B: A8        TAY
C - - - - - 0x034D4C 1A:8D3C: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - - 0x034D4F 1A:8D3F: 09 80     ORA #$80
C - - - - - 0x034D51 1A:8D41: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034D54 1A:8D44: 98        TYA
C - - - - - 0x034D55 1A:8D45: 29 7F     AND #$7F
C - - - - - 0x034D57 1A:8D47: 4C 60 8D  JMP loc_8D60
bra_8D4A:
C - - - - - 0x034D5A 1A:8D4A: A4 3B     LDY ram_003B
loc_8D4C_loop:
C D 0 - - - 0x034D5C 1A:8D4C: D1 3C     CMP (ram_003C),Y
C - - - - - 0x034D5E 1A:8D4E: 90 07     BCC bra_8D57
C - - - - - 0x034D60 1A:8D50: F0 05     BEQ bra_8D57
C - - - - - 0x034D62 1A:8D52: F1 3C     SBC (ram_003C),Y
C - - - - - 0x034D64 1A:8D54: 4C 4C 8D  JMP loc_8D4C_loop
bra_8D57:
C - - - - - 0x034D67 1A:8D57: A2 00     LDX #$00
C - - - - - 0x034D69 1A:8D59: C8        INY
C - - - - - 0x034D6A 1A:8D5A: 18        CLC
C - - - - - 0x034D6B 1A:8D5B: 71 3C     ADC (ram_003C),Y
C - - - - - 0x034D6D 1A:8D5D: 90 01     BCC bra_8D60
C - - - - - 0x034D6F 1A:8D5F: E8        INX
bra_8D60:
loc_8D60:
C D 0 - - - 0x034D70 1A:8D60: 24 3A     BIT ram_003A
C - - - - - 0x034D72 1A:8D62: 10 10     BPL bra_8D74
C - - - - - 0x034D74 1A:8D64: 46 33     LSR ram_0033
C - - - - - 0x034D76 1A:8D66: 66 32     ROR ram_0032
C - - - - - 0x034D78 1A:8D68: 46 33     LSR ram_0033
C - - - - - 0x034D7A 1A:8D6A: 66 32     ROR ram_0032
C - - - - - 0x034D7C 1A:8D6C: 46 33     LSR ram_0033
C - - - - - 0x034D7E 1A:8D6E: 66 32     ROR ram_0032
C - - - - - 0x034D80 1A:8D70: 46 33     LSR ram_0033
C - - - - - 0x034D82 1A:8D72: 66 32     ROR ram_0032
bra_8D74:
C - - - - - 0x034D84 1A:8D74: 85 67     STA ram_0067
C - - - - - 0x034D86 1A:8D76: 86 68     STX ram_0068
C - - - - - 0x034D88 1A:8D78: A5 32     LDA ram_0032
C - - - - - 0x034D8A 1A:8D7A: 85 69     STA ram_0069
C - - - - - 0x034D8C 1A:8D7C: A5 33     LDA ram_0033
C - - - - - 0x034D8E 1A:8D7E: 85 6A     STA ram_006A
C - - - - - 0x034D90 1A:8D80: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034D93 1A:8D83: A9 00     LDA #$00
C - - - - - 0x034D95 1A:8D85: 8D 74 00  STA ram_0074
C - - - - - 0x034D98 1A:8D88: A5 6C     LDA ram_006C
C - - - - - 0x034D9A 1A:8D8A: A4 6D     LDY ram_006D
C - - - - - 0x034D9C 1A:8D8C: F0 02     BEQ bra_8D90
C - - - - - 0x034D9E 1A:8D8E: A9 FF     LDA #$FF
bra_8D90:
C - - - - - 0x034DA0 1A:8D90: 85 71     STA ram_0071
C - - - - - 0x034DA2 1A:8D92: 60        RTS



tbl_8D93:
- D 0 - - - 0x034DA3 1A:8D93: A9 8D     .word off_8DA9_00
- D 0 - - - 0x034DA5 1A:8D95: C9 8D     .word off_8DC9_01
- - - - - - 0x034DA7 1A:8D97: C9 8D     .word off_8DC9_02
- D 0 - - - 0x034DA9 1A:8D99: E9 8D     .word off_8DE9_03
- D 0 - - - 0x034DAB 1A:8D9B: EB 8D     .word off_8DEB_04
- D 0 - - - 0x034DAD 1A:8D9D: F7 8D     .word off_8DF7_05
- - - - - - 0x034DAF 1A:8D9F: 17 8E     .word off_8E17_06
- - - - - - 0x034DB1 1A:8DA1: 17 8E     .word off_8E17_07
- D 0 - - - 0x034DB3 1A:8DA3: 17 8E     .word off_8E17_08
- D 0 - - - 0x034DB5 1A:8DA5: 31 8E     .word off_8E31_09
- D 0 - - - 0x034DB7 1A:8DA7: 2F 8E     .word off_8E2F_0A



off_8DA9_00:
- D 0 - I - 0x034DB9 1A:8DA9: C0        .byte $C0
- D 0 - I - 0x034DBA 1A:8DAA: 40        .byte $40
- D 0 - I - 0x034DBB 1A:8DAB: 99        .byte $99
- D 0 - I - 0x034DBC 1A:8DAC: 00        .byte $00
- D 0 - I - 0x034DBD 1A:8DAD: 99        .byte $99
- D 0 - I - 0x034DBE 1A:8DAE: 00        .byte $00
- - - - - - 0x034DBF 1A:8DAF: 00        .byte $00
- - - - - - 0x034DC0 1A:8DB0: 00        .byte $00
- D 0 - I - 0x034DC1 1A:8DB1: 99        .byte $99
- D 0 - I - 0x034DC2 1A:8DB2: 00        .byte $00
- D 0 - I - 0x034DC3 1A:8DB3: 99        .byte $99
- D 0 - I - 0x034DC4 1A:8DB4: 00        .byte $00
- D 0 - I - 0x034DC5 1A:8DB5: C0        .byte $C0
- D 0 - I - 0x034DC6 1A:8DB6: 40        .byte $40
- - - - - - 0x034DC7 1A:8DB7: 00        .byte $00
- - - - - - 0x034DC8 1A:8DB8: 00        .byte $00
- D 0 - I - 0x034DC9 1A:8DB9: 99        .byte $99
- D 0 - I - 0x034DCA 1A:8DBA: 00        .byte $00
- D 0 - I - 0x034DCB 1A:8DBB: C0        .byte $C0
- D 0 - I - 0x034DCC 1A:8DBC: 40        .byte $40
- D 0 - I - 0x034DCD 1A:8DBD: 99        .byte $99
- D 0 - I - 0x034DCE 1A:8DBE: 00        .byte $00
- - - - - - 0x034DCF 1A:8DBF: 00        .byte $00
- - - - - - 0x034DD0 1A:8DC0: 00        .byte $00
- D 0 - I - 0x034DD1 1A:8DC1: 99        .byte $99
- D 0 - I - 0x034DD2 1A:8DC2: 00        .byte $00
- D 0 - I - 0x034DD3 1A:8DC3: 99        .byte $99
- D 0 - I - 0x034DD4 1A:8DC4: 00        .byte $00
- D 0 - I - 0x034DD5 1A:8DC5: C0        .byte $C0
- D 0 - I - 0x034DD6 1A:8DC6: 40        .byte $40
- - - - - - 0x034DD7 1A:8DC7: 00        .byte $00
- - - - - - 0x034DD8 1A:8DC8: 00        .byte $00



off_8DC9_01:
off_8DC9_02:
- D 0 - I - 0x034DD9 1A:8DC9: 80        .byte $80
- D 0 - I - 0x034DDA 1A:8DCA: 80        .byte $80
- D 0 - I - 0x034DDB 1A:8DCB: C0        .byte $C0
- D 0 - I - 0x034DDC 1A:8DCC: 40        .byte $40
- D 0 - I - 0x034DDD 1A:8DCD: C0        .byte $C0
- D 0 - I - 0x034DDE 1A:8DCE: 40        .byte $40
- - - - - - 0x034DDF 1A:8DCF: 00        .byte $00
- - - - - - 0x034DE0 1A:8DD0: 00        .byte $00
- D 0 - I - 0x034DE1 1A:8DD1: 99        .byte $99
- D 0 - I - 0x034DE2 1A:8DD2: 00        .byte $00
- D 0 - I - 0x034DE3 1A:8DD3: 80        .byte $80
- D 0 - I - 0x034DE4 1A:8DD4: 80        .byte $80
- D 0 - I - 0x034DE5 1A:8DD5: 80        .byte $80
- D 0 - I - 0x034DE6 1A:8DD6: 80        .byte $80
- - - - - - 0x034DE7 1A:8DD7: 00        .byte $00
- - - - - - 0x034DE8 1A:8DD8: 00        .byte $00
- D 0 - I - 0x034DE9 1A:8DD9: 99        .byte $99
- D 0 - I - 0x034DEA 1A:8DDA: 00        .byte $00
- D 0 - I - 0x034DEB 1A:8DDB: C0        .byte $C0
- D 0 - I - 0x034DEC 1A:8DDC: 40        .byte $40
- D 0 - I - 0x034DED 1A:8DDD: 80        .byte $80
- D 0 - I - 0x034DEE 1A:8DDE: 80        .byte $80
- - - - - - 0x034DEF 1A:8DDF: 00        .byte $00
- - - - - - 0x034DF0 1A:8DE0: 00        .byte $00
- D 0 - I - 0x034DF1 1A:8DE1: C0        .byte $C0
- D 0 - I - 0x034DF2 1A:8DE2: 40        .byte $40
- D 0 - I - 0x034DF3 1A:8DE3: 99        .byte $99
- D 0 - I - 0x034DF4 1A:8DE4: 00        .byte $00
- D 0 - I - 0x034DF5 1A:8DE5: 99        .byte $99
- D 0 - I - 0x034DF6 1A:8DE6: 00        .byte $00
- - - - - - 0x034DF7 1A:8DE7: 00        .byte $00
- - - - - - 0x034DF8 1A:8DE8: 00        .byte $00



off_8DE9_03:
- D 0 - I - 0x034DF9 1A:8DE9: 80        .byte $80
- D 0 - I - 0x034DFA 1A:8DEA: 80        .byte $80



off_8DEB_04:
- D 0 - I - 0x034DFB 1A:8DEB: B3        .byte $B3
- D 0 - I - 0x034DFC 1A:8DEC: 00        .byte $00
- D 0 - I - 0x034DFD 1A:8DED: DA        .byte $DA
- D 0 - I - 0x034DFE 1A:8DEE: 25        .byte $25
- - - - - - 0x034DFF 1A:8DEF: 00        .byte $00
- - - - - - 0x034E00 1A:8DF0: 00        .byte $00
- - - - - - 0x034E01 1A:8DF1: 00        .byte $00
- - - - - - 0x034E02 1A:8DF2: 00        .byte $00
- D 0 - I - 0x034E03 1A:8DF3: CD        .byte $CD
- D 0 - I - 0x034E04 1A:8DF4: 32        .byte $32
- D 0 - I - 0x034E05 1A:8DF5: BF        .byte $BF
- D 0 - I - 0x034E06 1A:8DF6: 00        .byte $00



off_8DF7_05:
- D 0 - I - 0x034E07 1A:8DF7: C0        .byte $C0
- D 0 - I - 0x034E08 1A:8DF8: 40        .byte $40
- - - - - - 0x034E09 1A:8DF9: 00        .byte $00
- - - - - - 0x034E0A 1A:8DFA: 00        .byte $00
- - - - - - 0x034E0B 1A:8DFB: 00        .byte $00
- - - - - - 0x034E0C 1A:8DFC: 00        .byte $00
- - - - - - 0x034E0D 1A:8DFD: 00        .byte $00
- - - - - - 0x034E0E 1A:8DFE: 00        .byte $00
- - - - - - 0x034E0F 1A:8DFF: 00        .byte $00
- - - - - - 0x034E10 1A:8E00: 00        .byte $00
- - - - - - 0x034E11 1A:8E01: 00        .byte $00
- - - - - - 0x034E12 1A:8E02: 00        .byte $00
- D 0 - I - 0x034E13 1A:8E03: E6        .byte $E6
- D 0 - I - 0x034E14 1A:8E04: 00        .byte $00
- - - - - - 0x034E15 1A:8E05: 00        .byte $00
- - - - - - 0x034E16 1A:8E06: 00        .byte $00
- - - - - - 0x034E17 1A:8E07: 00        .byte $00
- - - - - - 0x034E18 1A:8E08: 00        .byte $00
- - - - - - 0x034E19 1A:8E09: 00        .byte $00
- - - - - - 0x034E1A 1A:8E0A: 00        .byte $00
- - - - - - 0x034E1B 1A:8E0B: 00        .byte $00
- - - - - - 0x034E1C 1A:8E0C: 00        .byte $00
- - - - - - 0x034E1D 1A:8E0D: 00        .byte $00
- - - - - - 0x034E1E 1A:8E0E: 00        .byte $00
- - - - - - 0x034E1F 1A:8E0F: 00        .byte $00
- - - - - - 0x034E20 1A:8E10: 00        .byte $00
- - - - - - 0x034E21 1A:8E11: 00        .byte $00
- - - - - - 0x034E22 1A:8E12: 00        .byte $00
- D 0 - I - 0x034E23 1A:8E13: 80        .byte $80
- D 0 - I - 0x034E24 1A:8E14: 80        .byte $80
- - - - - - 0x034E25 1A:8E15: 00        .byte $00
- - - - - - 0x034E26 1A:8E16: 00        .byte $00



off_8E17_06:
off_8E17_07:
off_8E17_08:
- D 0 - I - 0x034E27 1A:8E17: 80        .byte $80
- D 0 - I - 0x034E28 1A:8E18: 80        .byte $80
- D 0 - I - 0x034E29 1A:8E19: 80        .byte $80
- D 0 - I - 0x034E2A 1A:8E1A: 80        .byte $80
- - - - - - 0x034E2B 1A:8E1B: 00        .byte $00
- - - - - - 0x034E2C 1A:8E1C: 00        .byte $00
- - - - - - 0x034E2D 1A:8E1D: 00        .byte $00
- - - - - - 0x034E2E 1A:8E1E: 00        .byte $00
- D 0 - I - 0x034E2F 1A:8E1F: C0        .byte $C0
- D 0 - I - 0x034E30 1A:8E20: 40        .byte $40
- D 0 - I - 0x034E31 1A:8E21: 80        .byte $80
- D 0 - I - 0x034E32 1A:8E22: 80        .byte $80
- - - - - - 0x034E33 1A:8E23: 00        .byte $00
- - - - - - 0x034E34 1A:8E24: 00        .byte $00
- - - - - - 0x034E35 1A:8E25: 00        .byte $00
- - - - - - 0x034E36 1A:8E26: 00        .byte $00
- D 0 - I - 0x034E37 1A:8E27: 99        .byte $99
- D 0 - I - 0x034E38 1A:8E28: 00        .byte $00
- D 0 - I - 0x034E39 1A:8E29: C0        .byte $C0
- D 0 - I - 0x034E3A 1A:8E2A: 40        .byte $40
- - - - - - 0x034E3B 1A:8E2B: 00        .byte $00
- - - - - - 0x034E3C 1A:8E2C: 00        .byte $00
- - - - - - 0x034E3D 1A:8E2D: 00        .byte $00
- - - - - - 0x034E3E 1A:8E2E: 00        .byte $00



off_8E2F_0A:
- D 0 - I - 0x034E3F 1A:8E2F: 80        .byte $80
- D 0 - I - 0x034E40 1A:8E30: 80        .byte $80



off_8E31_09:
- D 0 - I - 0x034E41 1A:8E31: 80        .byte $80
- D 0 - I - 0x034E42 1A:8E32: 80        .byte $80



sub_8E33:
C - - - - - 0x034E43 1A:8E33: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034E46 1A:8E36: F0 35     BEQ bra_8E6D_RTS
C - - - - - 0x034E48 1A:8E38: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034E4B 1A:8E3B: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034E4E 1A:8E3E: F0 04     BEQ bra_8E44
C - - - - - 0x034E50 1A:8E40: C9 0B     CMP #$0B
C - - - - - 0x034E52 1A:8E42: D0 06     BNE bra_8E4A
bra_8E44:
C - - - - - 0x034E54 1A:8E44: E0 04     CPX #$04
C - - - - - 0x034E56 1A:8E46: F0 25     BEQ bra_8E6D_RTS
C - - - - - 0x034E58 1A:8E48: D0 08     BNE bra_8E52    ; jmp
bra_8E4A:
C - - - - - 0x034E5A 1A:8E4A: E0 05     CPX #$05
C - - - - - 0x034E5C 1A:8E4C: F0 1F     BEQ bra_8E6D_RTS
C - - - - - 0x034E5E 1A:8E4E: E0 06     CPX #$06
C - - - - - 0x034E60 1A:8E50: F0 1B     BEQ bra_8E6D_RTS
bra_8E52:
C - - - - - 0x034E62 1A:8E52: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x034E65 1A:8E55: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034E68 1A:8E58: D0 13     BNE bra_8E6D_RTS
C - - - - - 0x034E6A 1A:8E5A: A9 0F     LDA #$0F
C - - - - - 0x034E6C 1A:8E5C: B0 02     BCS bra_8E60
C - - - - - 0x034E6E 1A:8E5E: A9 3F     LDA #$3F
bra_8E60:
C - - - - - 0x034E70 1A:8E60: CD E2 00  CMP ram_random + $01
C - - - - - 0x034E73 1A:8E63: 90 08     BCC bra_8E6D_RTS
C - - - - - 0x034E75 1A:8E65: A9 04     LDA #$04
C - - - - - 0x034E77 1A:8E67: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x034E7A 1A:8E6A: 20 5A C5  JSR sub_0x03CF5F
bra_8E6D_RTS:
C - - - - - 0x034E7D 1A:8E6D: 60        RTS



sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды:
C - - - - - 0x034E7E 1A:8E6E: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x034E81 1A:8E71: A2 00     LDX #$00    ; индекс команды слева
C - - - - - 0x034E83 1A:8E73: C9 0B     CMP #$0B
C - - - - - 0x034E85 1A:8E75: 90 02     BCC bra_8E79_команда_слева
; if комада справа
C - - - - - 0x034E87 1A:8E77: A2 0B     LDX #$0B    ; индекс команды справа
bra_8E79_команда_слева:
C - - - - - 0x034E89 1A:8E79: 8A        TXA
C - - - - - 0x034E8A 1A:8E7A: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x034E8D 1A:8E7D: 8E FB 05  STX ram_команда_с_мячом
C - - - - - 0x034E90 1A:8E80: F0 03     BEQ bra_8E85_RTS
C - - - - - 0x034E92 1A:8E82: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
bra_8E85_RTS:
C - - - - - 0x034E95 1A:8E85: 60        RTS



sub_8E86_катсцена_драйв_оверхеда:
sub_0x034E96_катсцена_драйв_оверхеда:
; попытка активировать катсцену, бряк периодически регулярно срабатывает во время матча
C D 0 - - - 0x034E96 1A:8E86: AD 46 04  LDA ram_флаг_драйв_оверхеда
C - - - - - 0x034E99 1A:8E89: C9 05     CMP #$05
C - - - - - 0x034E9B 1A:8E8B: F0 5B     BEQ bra_8EE8_RTS        ; if drive overhead уже в наличии
C - - - - - 0x034E9D 1A:8E8D: C9 04     CMP #$04
C - - - - - 0x034E9F 1A:8E8F: D0 57     BNE bra_8EE8_RTS        ; if еще не набралось 2 удара по meon
C - - - - - 0x034EA1 1A:8E91: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034EA4 1A:8E94: D0 52     BNE bra_8EE8_RTS        ; if мячом владеет соперник
; if мяч у команды слева
C - - - - - 0x034EA6 1A:8E96: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034EA9 1A:8E99: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034EAC 1A:8E9C: A0 00     LDY #con_plr_id
C - - - - - 0x034EAE 1A:8E9E: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034EB0 1A:8EA0: C9 01     CMP #con_p_tsubasa_my
C - - - - - 0x034EB2 1A:8EA2: F0 44     BEQ bra_8EE8_RTS        ; if мячом владеет tsubasa
C - - - - - 0x034EB4 1A:8EA4: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x034EB6 1A:8EA6: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
; выход если игрок с мячом на своей половине поля, типа недостаточно близко к воротам соперника
C - - - - - 0x034EB8 1A:8EA8: 10 3E     BPL bra_8EE8_RTS
C - - - - - 0x034EBA 1A:8EAA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034EBD 1A:8EAD: 8D FC 05  STA ram_принимающий
C - - - - - 0x034EC0 1A:8EB0: A9 01     LDA #$01
bra_8EB2_найти_цубасу_в_команде:
C - - - - - 0x034EC2 1A:8EB2: 48        PHA
C - - - - - 0x034EC3 1A:8EB3: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034EC6 1A:8EB6: A0 00     LDY #con_plr_id
C - - - - - 0x034EC8 1A:8EB8: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034ECA 1A:8EBA: C9 01     CMP #con_p_tsubasa_my
C - - - - - 0x034ECC 1A:8EBC: F0 06     BEQ bra_8EC4_цубаса_найден
C - - - - - 0x034ECE 1A:8EBE: 68        PLA
C - - - - - 0x034ECF 1A:8EBF: 18        CLC
C - - - - - 0x034ED0 1A:8EC0: 69 01     ADC #$01
C - - - - - 0x034ED2 1A:8EC2: D0 EE     BNE bra_8EB2_найти_цубасу_в_команде
bra_8EC4_цубаса_найден:
C - - - - - 0x034ED4 1A:8EC4: 68        PLA
C - - - - - 0x034ED5 1A:8EC5: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x034ED8 1A:8EC8: EE 46 04  INC ram_флаг_драйв_оверхеда
C - - - - - 0x034EDB 1A:8ECB: A9 00     LDA #$00
C - - - - - 0x034EDD 1A:8ECD: 8D 15 06  STA ram_0615
C - - - - - 0x034EE0 1A:8ED0: 8D 2D 06  STA ram_062D
C - - - - - 0x034EE3 1A:8ED3: A9 17     LDA #con_s_id_17
C - - - - - 0x034EE5 1A:8ED5: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034EE8 1A:8ED8: A9 00     LDA #$00
C - - - - - 0x034EEA 1A:8EDA: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034EED 1A:8EDD: A9 04     LDA #$04
C - - - - - 0x034EEF 1A:8EDF: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034EF2 1A:8EE2: A2 50     LDX #$50
C - - - - - 0x034EF4 1A:8EE4: 9A        TXS
C - - - - - 0x034EF5 1A:8EE5: 4C AC 85  JMP loc_85AC
bra_8EE8_RTS:
C - - - - - 0x034EF8 1A:8EE8: 60        RTS



sub_8EE9:
C - - - - - 0x034EF9 1A:8EE9: 20 06 8D  JSR sub_8D06
C - - - - - 0x034EFC 1A:8EEC: A5 71     LDA ram_0071
C - - - - - 0x034EFE 1A:8EEE: 4A        LSR
C - - - - - 0x034EFF 1A:8EEF: 4A        LSR
C - - - - - 0x034F00 1A:8EF0: 8D 19 06  STA ram_снижение_силы_действия
C - - - - - 0x034F03 1A:8EF3: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x034F06 1A:8EF6: 85 70     STA ram_0070
C - - - - - 0x034F08 1A:8EF8: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x034F0B 1A:8EFB: 0A        ASL
C - - - - - 0x034F0C 1A:8EFC: 26 70     ROL ram_0070
C - - - - - 0x034F0E 1A:8EFE: 0A        ASL
C - - - - - 0x034F0F 1A:8EFF: 26 70     ROL ram_0070
C - - - - - 0x034F11 1A:8F01: 0A        ASL
C - - - - - 0x034F12 1A:8F02: 26 70     ROL ram_0070
C - - - - - 0x034F14 1A:8F04: 0A        ASL
C - - - - - 0x034F15 1A:8F05: 26 70     ROL ram_0070
C - - - - - 0x034F17 1A:8F07: 0A        ASL
C - - - - - 0x034F18 1A:8F08: 26 70     ROL ram_0070
C - - - - - 0x034F1A 1A:8F0A: 0A        ASL
C - - - - - 0x034F1B 1A:8F0B: 26 70     ROL ram_0070
C - - - - - 0x034F1D 1A:8F0D: 85 6F     STA ram_006F
C - - - - - 0x034F1F 1A:8F0F: 20 1E C5  JSR sub_0x03CD4C_получить_младший_разряд_числа
C - - - - - 0x034F22 1A:8F12: A5 6F     LDA ram_006F
C - - - - - 0x034F24 1A:8F14: A4 70     LDY ram_0070
C - - - - - 0x034F26 1A:8F16: F0 02     BEQ bra_8F1A
C - - - - - 0x034F28 1A:8F18: A9 FF     LDA #$FF
bra_8F1A:
C - - - - - 0x034F2A 1A:8F1A: A2 00     LDX #$00
C - - - - - 0x034F2C 1A:8F1C: A0 00     LDY #$00
C - - - - - 0x034F2E 1A:8F1E: 60        RTS



sub_8F1F:
C - - - - - 0x034F2F 1A:8F1F: 20 06 8D  JSR sub_8D06
C - - - - - 0x034F32 1A:8F22: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x034F35 1A:8F25: 85 67     STA ram_0067
C - - - - - 0x034F37 1A:8F27: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x034F3A 1A:8F2A: 85 68     STA ram_0068
C - - - - - 0x034F3C 1A:8F2C: A9 C0     LDA #$C0
C - - - - - 0x034F3E 1A:8F2E: 85 69     STA ram_0069
C - - - - - 0x034F40 1A:8F30: A9 00     LDA #$00
C - - - - - 0x034F42 1A:8F32: 85 6A     STA ram_006A
C - - - - - 0x034F44 1A:8F34: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034F47 1A:8F37: A5 6B     LDA ram_006B
C - - - - - 0x034F49 1A:8F39: 85 6F     STA ram_006F
C - - - - - 0x034F4B 1A:8F3B: A5 6C     LDA ram_006C
C - - - - - 0x034F4D 1A:8F3D: 85 70     STA ram_0070
C - - - - - 0x034F4F 1A:8F3F: 20 1E C5  JSR sub_0x03CD4C_получить_младший_разряд_числа
C - - - - - 0x034F52 1A:8F42: A5 6F     LDA ram_006F
C - - - - - 0x034F54 1A:8F44: A4 70     LDY ram_0070
C - - - - - 0x034F56 1A:8F46: F0 02     BEQ bra_8F4A
C - - - - - 0x034F58 1A:8F48: A9 FF     LDA #$FF
bra_8F4A:
C - - - - - 0x034F5A 1A:8F4A: 85 3A     STA ram_003A
C - - - - - 0x034F5C 1A:8F4C: 20 59 8F  JSR sub_8F59
C - - - - - 0x034F5F 1A:8F4F: 18        CLC
C - - - - - 0x034F60 1A:8F50: 65 3A     ADC ram_003A
C - - - - - 0x034F62 1A:8F52: 90 02     BCC bra_8F56_not_overflow
C - - - - - 0x034F64 1A:8F54: A9 FF     LDA #$FF
bra_8F56_not_overflow:
C - - - - - 0x034F66 1A:8F56: A0 00     LDY #$00
C - - - - - 0x034F68 1A:8F58: 60        RTS



sub_8F59:
C - - - - - 0x034F69 1A:8F59: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x034F6C 1A:8F5C: A0 05     LDY #con_таймер_наебки
C - - - - - 0x034F6E 1A:8F5E: B1 34     LDA (ram_plr_data),Y    ; con_таймер_наебки
C - - - - - 0x034F70 1A:8F60: 38        SEC
C - - - - - 0x034F71 1A:8F61: ED 2B 06  SBC ram_062B
C - - - - - 0x034F74 1A:8F64: B0 02     BCS bra_8F68
C - - - - - 0x034F76 1A:8F66: A9 00     LDA #$00
bra_8F68:
C - - - - - 0x034F78 1A:8F68: A0 07     LDY #con_величина_наебки
C - - - - - 0x034F7A 1A:8F6A: 18        CLC
C - - - - - 0x034F7B 1A:8F6B: 71 34     ADC (ram_plr_data),Y    ; con_величина_наебки
C - - - - - 0x034F7D 1A:8F6D: 90 02     BCC bra_8F71_RTS    ; if not overflow
; if overflow
- - - - - - 0x034F7F 1A:8F6F: A9 FF     LDA #$FF
bra_8F71_RTS:
C - - - - - 0x034F81 1A:8F71: 60        RTS



sub_8F72:
sub_0x034F82:
C - - - - - 0x034F85 1A:8F75: A9 06     LDA #con_bsw_1C_01
C - - - - - 0x034F87 1A:8F77: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034F8A 1A:8F7A: A9 00     LDA #$00
C - - - - - 0x034F8C 1A:8F7C: 85 3A     STA ram_003A
C - - - - - 0x034F8E 1A:8F7E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034F91 1A:8F81: D0 17     BNE bra_8F9A_команда_справа
; if мяч у команды слева
C - - - - - 0x034F93 1A:8F83: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034F96 1A:8F86: C9 02     CMP #$02      ; dribble
C - - - - - 0x034F98 1A:8F88: D0 0D     BNE bra_8F97
C - - - - - 0x034F9A 1A:8F8A: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034F9D 1A:8F8D: D0 08     BNE bra_8F97
C - - - - - 0x034F9F 1A:8F8F: A9 00     LDA #$00
C - - - - - 0x034FA1 1A:8F91: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x034FA4 1A:8F94: 8D 40 04  STA ram_затрата_энергии_hi
bra_8F97:
C - - - - - 0x034FA7 1A:8F97: 20 FB 8F  JSR sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов
bra_8F9A_команда_справа:
C - - - - - 0x034FAA 1A:8F9A: 24 3A     BIT ram_003A
C - - - - - 0x034FAC 1A:8F9C: 30 0F     BMI bra_8FAD
C - - - - - 0x034FAE 1A:8F9E: AD E2 00  LDA ram_random + $01
C - - - - - 0x034FB1 1A:8FA1: C9 08     CMP #$08      ; шанс крита
C - - - - - 0x034FB3 1A:8FA3: B0 08     BCS bra_8FAD
C - - - - - 0x034FB5 1A:8FA5: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x034FB8 1A:8FA8: 09 80     ORA #$80
C - - - - - 0x034FBA 1A:8FAA: 8D 3C 04  STA ram_подтип_действия_атаки
bra_8FAD:
C - - - - - 0x034FBD 1A:8FAD: A2 00     LDX #$00
C - - - - - 0x034FBF 1A:8FAF: AD E2 00  LDA ram_random + $01
C - - - - - 0x034FC2 1A:8FB2: 6D E3 00  ADC ram_random + $02
C - - - - - 0x034FC5 1A:8FB5: 6A        ROR
C - - - - - 0x034FC6 1A:8FB6: 09 80     ORA #$80
C - - - - - 0x034FC8 1A:8FB8: 2C 3C 04  BIT ram_подтип_действия_атаки
C - - - - - 0x034FCB 1A:8FBB: 10 03     BPL bra_8FC0
C - - - - - 0x034FCD 1A:8FBD: E8        INX
C - - - - - 0x034FCE 1A:8FBE: 29 7F     AND #$7F
bra_8FC0:
C - - - - - 0x034FD0 1A:8FC0: 69 00     ADC #$00
C - - - - - 0x034FD2 1A:8FC2: 90 01     BCC bra_8FC5
C - - - - - 0x034FD4 1A:8FC4: E8        INX
bra_8FC5:
C - - - - - 0x034FD5 1A:8FC5: 85 67     STA ram_0067
C - - - - - 0x034FD7 1A:8FC7: 86 68     STX ram_0068
C - - - - - 0x034FD9 1A:8FC9: 24 3A     BIT ram_003A
C - - - - - 0x034FDB 1A:8FCB: 10 10     BPL bra_8FDD
C - - - - - 0x034FDD 1A:8FCD: 46 33     LSR ram_0033
C - - - - - 0x034FDF 1A:8FCF: 66 32     ROR ram_0032
C - - - - - 0x034FE1 1A:8FD1: 46 33     LSR ram_0033
C - - - - - 0x034FE3 1A:8FD3: 66 32     ROR ram_0032
C - - - - - 0x034FE5 1A:8FD5: 46 33     LSR ram_0033
C - - - - - 0x034FE7 1A:8FD7: 66 32     ROR ram_0032
C - - - - - 0x034FE9 1A:8FD9: 46 33     LSR ram_0033
C - - - - - 0x034FEB 1A:8FDB: 66 32     ROR ram_0032
bra_8FDD:
C - - - - - 0x034FED 1A:8FDD: A5 32     LDA ram_0032
C - - - - - 0x034FEF 1A:8FDF: 85 69     STA ram_0069
C - - - - - 0x034FF1 1A:8FE1: A5 33     LDA ram_0033
C - - - - - 0x034FF3 1A:8FE3: 85 6A     STA ram_006A
C - - - - - 0x034FF5 1A:8FE5: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034FF8 1A:8FE8: A5 6C     LDA ram_006C
C - - - - - 0x034FFA 1A:8FEA: 8D 1C 06  STA ram_сила_действия_lo
C - - - - - 0x034FFD 1A:8FED: A5 6D     LDA ram_006D
C - - - - - 0x034FFF 1A:8FEF: 8D 1D 06  STA ram_сила_действия_hi
C - - - - - 0x035002 1A:8FF2: 60        RTS



sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов:
C - - - - - 0x035003 1A:8FF3: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035006 1A:8FF6: D0 03     BNE bra_8FFB_команда_справа
; if мяч у команды слева
C - - - - - 0x035008 1A:8FF8: 85 3A     STA ram_003A    ; A = 00, bzk optimize, небезопасно
C - - - - - 0x03500A 1A:8FFA: 60        RTS
bra_8FFB_команда_справа:
sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов:
C - - - - - 0x03500B 1A:8FFB: A9 00     LDA #$00
C - - - - - 0x03500D 1A:8FFD: 85 3A     STA ram_003A
C - - - - - 0x03500F 1A:8FFF: A0 00     LDY #con_plr_id
C - - - - - 0x035011 1A:9001: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x035013 1A:9003: C9 20     CMP #con_p_misugi_my
C - - - - - 0x035015 1A:9005: D0 28     BNE bra_902F    ; if not мисуги
C - - - - - 0x035017 1A:9007: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03501A 1A:900A: D0 0C     BNE bra_9018    ; if комада справа
; if мяч у команды слева
C - - - - - 0x03501C 1A:900C: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03501F 1A:900F: D0 07     BNE bra_9018
C - - - - - 0x035021 1A:9011: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x035024 1A:9014: C9 03     CMP #$03
C - - - - - 0x035026 1A:9016: B0 17     BCS bra_902F
bra_9018:
C - - - - - 0x035028 1A:9018: AD 40 04  LDA ram_затрата_энергии_hi
C - - - - - 0x03502B 1A:901B: 4A        LSR
C - - - - - 0x03502C 1A:901C: AA        TAX
C - - - - - 0x03502D 1A:901D: AD 3F 04  LDA ram_затрата_энергии_lo
C - - - - - 0x035030 1A:9020: 6A        ROR
C - - - - - 0x035031 1A:9021: 18        CLC
C - - - - - 0x035032 1A:9022: 6D 3F 04  ADC ram_затрата_энергии_lo
C - - - - - 0x035035 1A:9025: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x035038 1A:9028: 8A        TXA
C - - - - - 0x035039 1A:9029: 6D 40 04  ADC ram_затрата_энергии_hi
C - - - - - 0x03503C 1A:902C: 8D 40 04  STA ram_затрата_энергии_hi
bra_902F:
C - - - - - 0x03503F 1A:902F: A0 01     LDY #con_plr_guts_lo
C - - - - - 0x035041 1A:9031: 38        SEC
C - - - - - 0x035042 1A:9032: B1 34     LDA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x035044 1A:9034: ED 3F 04  SBC ram_затрата_энергии_lo
C - - - - - 0x035047 1A:9037: AA        TAX
C - - - - - 0x035048 1A:9038: C8        INY ; con_plr_guts_hi
C - - - - - 0x035049 1A:9039: B1 34     LDA (ram_plr_data),Y    ; con_plr_guts_hi
C - - - - - 0x03504B 1A:903B: ED 40 04  SBC ram_затрата_энергии_hi
C - - - - - 0x03504E 1A:903E: 10 07     BPL bra_9047
C - - - - - 0x035050 1A:9040: A2 00     LDX #$00
C - - - - - 0x035052 1A:9042: A9 00     LDA #$00
C - - - - - 0x035054 1A:9044: 38        SEC
C - - - - - 0x035055 1A:9045: 66 3A     ROR ram_003A
bra_9047:
C - - - - - 0x035057 1A:9047: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_hi
C - - - - - 0x035059 1A:9049: 88        DEY ; con_plr_guts_lo
C - - - - - 0x03505A 1A:904A: 8A        TXA
C - - - - - 0x03505B 1A:904B: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x03505D 1A:904D: 60        RTS



sub_904E:
sub_0x03505E:
; очистить защиту и энергию соперников
C D 0 - - - 0x03505E 1A:904E: 2C 4B 04  BIT ram_044B
C - - - - - 0x035061 1A:9051: 10 1C     BPL bra_906F_RTS
C - - - - - 0x035063 1A:9053: A9 00     LDA #$00
C - - - - - 0x035065 1A:9055: 8D 4B 04  STA ram_044B
C - - - - - 0x035068 1A:9058: 8D 2F 00  STA ram_защита_справа
C - - - - - 0x03506B 1A:905B: A9 0C     LDA #$0C
bra_905D_loop:
C - - - - - 0x03506D 1A:905D: 48        PHA
C - - - - - 0x03506E 1A:905E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035071 1A:9061: A0 01     LDY #con_plr_guts_lo
C - - - - - 0x035073 1A:9063: A9 00     LDA #$00
C - - - - - 0x035075 1A:9065: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x035077 1A:9067: 68        PLA
C - - - - - 0x035078 1A:9068: 18        CLC
C - - - - - 0x035079 1A:9069: 69 01     ADC #$01
C - - - - - 0x03507B 1A:906B: C9 16     CMP #$16
C - - - - - 0x03507D 1A:906D: D0 EE     BNE bra_905D_loop
bra_906F_RTS:
C - - - - - 0x03507F 1A:906F: 60        RTS



sub_9070:
C - - - - - 0x035080 1A:9070: 2C 4C 04  BIT ram_044C
C - - - - - 0x035083 1A:9073: 10 0F     BPL bra_9084_RTS
C - - - - - 0x035085 1A:9075: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x035088 1A:9078: C9 14     CMP #$14
C - - - - - 0x03508A 1A:907A: D0 08     BNE bra_9084_RTS
C - - - - - 0x03508C 1A:907C: A9 00     LDA #$00
C - - - - - 0x03508E 1A:907E: 8D 4C 04  STA ram_044C
C - - - - - 0x035091 1A:9081: 8D F1 03  STA ram_03F1
bra_9084_RTS:
C - - - - - 0x035094 1A:9084: 60        RTS



sub_9085_клон_ссыт_напороться_на_мяч:
; сработал когда оставшиеся клоны ссут подстраиваться на мяч
; сработало во время драйв удара и драйв паса
; хз на что этот код влияет
C - - - - - 0x035095 1A:9085: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x035098 1A:9088: BD 8E 90  LDA tbl_908E_затраченное_время,X
C - - - - - 0x03509B 1A:908B: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



tbl_908E_затраченное_время:
- D 0 - - - 0x03509E 1A:908E: 02        .byte $02   ; 00 
- D 0 - - - 0x03509F 1A:908F: 01        .byte $01   ; 01 
- D 0 - - - 0x0350A0 1A:9090: 01        .byte $01   ; 02 
- D 0 - - - 0x0350A1 1A:9091: 04        .byte $04   ; 03 
- D 0 - - - 0x0350A2 1A:9092: 04        .byte $04   ; 04 
- D 0 - - - 0x0350A3 1A:9093: 01        .byte $01   ; 05 
- D 0 - - - 0x0350A4 1A:9094: 02        .byte $02   ; 06 



loc_9095:
sub_9095:
C D 0 - - - 0x0350A5 1A:9095: 08        PHP
C - - - - - 0x0350A6 1A:9096: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x0350A9 1A:9099: 0A        ASL
C - - - - - 0x0350AA 1A:909A: AA        TAX
C - - - - - 0x0350AB 1A:909B: 28        PLP
C - - - - - 0x0350AC 1A:909C: 90 01     BCC bra_909F
C - - - - - 0x0350AE 1A:909E: E8        INX
bra_909F:
C - - - - - 0x0350AF 1A:909F: BD F4 90  LDA tbl_90F4,X
C - - - - - 0x0350B2 1A:90A2: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x0350B5 1A:90A5: F0 33     BEQ bra_90DA
C - - - - - 0x0350B7 1A:90A7: C0 0B     CPY #$0B
C - - - - - 0x0350B9 1A:90A9: F0 2F     BEQ bra_90DA
C - - - - - 0x0350BB 1A:90AB: 8A        TXA
C - - - - - 0x0350BC 1A:90AC: 48        PHA
C - - - - - 0x0350BD 1A:90AD: 4A        LSR
C - - - - - 0x0350BE 1A:90AE: 90 13     BCC bra_90C3
C - - - - - 0x0350C0 1A:90B0: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0350C3 1A:90B3: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0350C6 1A:90B6: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x0350C9 1A:90B9: BD 02 91  LDA tbl_9102,X
C - - - - - 0x0350CC 1A:90BC: A0 0A     LDY #con_plr_stun
C - - - - - 0x0350CE 1A:90BE: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0350D0 1A:90C0: 4C D5 90  JMP loc_90D5
bra_90C3:
C - - - - - 0x0350D3 1A:90C3: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0350D6 1A:90C6: F0 0D     BEQ bra_90D5
C - - - - - 0x0350D8 1A:90C8: C9 0B     CMP #$0B
C - - - - - 0x0350DA 1A:90CA: F0 09     BEQ bra_90D5
C - - - - - 0x0350DC 1A:90CC: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0350DF 1A:90CF: A0 0A     LDY #con_plr_stun
C - - - - - 0x0350E1 1A:90D1: A9 05     LDA #$05
C - - - - - 0x0350E3 1A:90D3: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
bra_90D5:
loc_90D5:
C D 0 - - - 0x0350E5 1A:90D5: 68        PLA
C - - - - - 0x0350E6 1A:90D6: AA        TAX
C - - - - - 0x0350E7 1A:90D7: BD E6 90  LDA tbl_90E6_затраченное_время,X
bra_90DA:
C - - - - - 0x0350EA 1A:90DA: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



sub_90DD:
C - - - - - 0x0350ED 1A:90DD: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x0350F0 1A:90E0: BD 09 91  LDA tbl_9109_затраченное_время,X
C - - - - - 0x0350F3 1A:90E3: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



tbl_90E6_затраченное_время:
- D 0 - - - 0x0350F6 1A:90E6: 02        .byte $02   ; 00 
- D 0 - - - 0x0350F7 1A:90E7: 01        .byte $01   ; 01 
- D 0 - - - 0x0350F8 1A:90E8: 01        .byte $01   ; 02 
- D 0 - - - 0x0350F9 1A:90E9: 01        .byte $01   ; 03 
- D 0 - - - 0x0350FA 1A:90EA: 02        .byte $02   ; 04 
- D 0 - - - 0x0350FB 1A:90EB: 01        .byte $01   ; 05 
- D 0 - - - 0x0350FC 1A:90EC: 01        .byte $01   ; 06 
- D 0 - - - 0x0350FD 1A:90ED: 00        .byte $00   ; 07 
- D 0 - - - 0x0350FE 1A:90EE: 01        .byte $01   ; 08 
- D 0 - - - 0x0350FF 1A:90EF: 00        .byte $00   ; 09 
- - - - - - 0x035100 1A:90F0: 00        .byte $00   ; 0A 
- D 0 - - - 0x035101 1A:90F1: 00        .byte $00   ; 0B 
- - - - - - 0x035102 1A:90F2: 00        .byte $00   ; 0C 
- D 0 - - - 0x035103 1A:90F3: 00        .byte $00   ; 0D 



tbl_90F4:
; 00 block / catch
- D 0 - - - 0x035104 1A:90F4: 00        .byte $00
- D 0 - - - 0x035105 1A:90F5: 00        .byte $00
; 01 tackle / punch
- D 0 - - - 0x035106 1A:90F6: 00        .byte $00
- D 0 - - - 0x035107 1A:90F7: 00        .byte $00
; 02 pass cut / triangle jump
- D 0 - - - 0x035108 1A:90F8: 00        .byte $00
- D 0 - - - 0x035109 1A:90F9: 00        .byte $00
; 03 interfere / dive
- D 0 - - - 0x03510A 1A:90FA: 02        .byte $02
- D 0 - - - 0x03510B 1A:90FB: 00        .byte $00
; 04 clearing / wait (gk)
- D 0 - - - 0x03510C 1A:90FC: 00        .byte $00
- D 0 - - - 0x03510D 1A:90FD: 00        .byte $00
; 05 mark / through
- - - - - - 0x03510E 1A:90FE: 00        .byte $00
- D 0 - - - 0x03510F 1A:90FF: 00        .byte $00
; 06 wait (для полевых)
- - - - - - 0x035110 1A:9100: 00        .byte $00
- D 0 - - - 0x035111 1A:9101: 00        .byte $00



tbl_9102:
- D 0 - - - 0x035112 1A:9102: 06        .byte $06   ; 00 
- D 0 - - - 0x035113 1A:9103: 06        .byte $06   ; 01 
- D 0 - - - 0x035114 1A:9104: 06        .byte $06   ; 02 
- D 0 - - - 0x035115 1A:9105: 06        .byte $06   ; 03 
- D 0 - - - 0x035116 1A:9106: 06        .byte $06   ; 04 
- D 0 - - - 0x035117 1A:9107: 00        .byte $00   ; 05 
- D 0 - - - 0x035118 1A:9108: 00        .byte $00   ; 06 



tbl_9109_затраченное_время:
- D 0 - - - 0x035119 1A:9109: 01        .byte $01   ; 00 
- D 0 - - - 0x03511A 1A:910A: 00        .byte $00   ; 01 
- D 0 - - - 0x03511B 1A:910B: 00        .byte $00   ; 02 
- D 0 - - - 0x03511C 1A:910C: 01        .byte $01   ; 03 
- D 0 - - - 0x03511D 1A:910D: 02        .byte $02   ; 04 
- D 0 - - - 0x03511E 1A:910E: 00        .byte $00   ; 05 
- D 0 - - - 0x03511F 1A:910F: 01        .byte $01   ; 06 



sub_9110:
C - - - - - 0x035120 1A:9110: 18        CLC
C - - - - - 0x035121 1A:9111: 6D F9 05  ADC ram_loss
C - - - - - 0x035124 1A:9114: 8D F9 05  STA ram_loss
C - - - - - 0x035127 1A:9117: 8A        TXA
C - - - - - 0x035128 1A:9118: 20 03 C6  JSR sub_0x03D1A3_уменьшить_таймер_времени_тайма
C - - - - - 0x03512B 1A:911B: 60        RTS



loc_911C:
C D 0 - - - 0x03512C 1A:911C: A9 29     LDA #con_s_id_29
C - - - - - 0x03512E 1A:911E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035131 1A:9121: 20 7B 98  JSR sub_987B
C - - - - - 0x035134 1A:9124: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035137 1A:9127: 29 F8     AND #$F8
C - - - - - 0x035139 1A:9129: 18        CLC
C - - - - - 0x03513A 1A:912A: 69 04     ADC #$04
C - - - - - 0x03513C 1A:912C: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x03513F 1A:912F: A9 4C     LDA #$4C
C - - - - - 0x035141 1A:9131: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035144 1A:9134: 10 02     BPL bra_9138
C - - - - - 0x035146 1A:9136: A9 B4     LDA #$B4
bra_9138:
C - - - - - 0x035148 1A:9138: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x03514B 1A:913B: A2 00     LDX #$00
C - - - - - 0x03514D 1A:913D: 2C 35 06  BIT ram_ball_pos_X_hi
C - - - - - 0x035150 1A:9140: 10 01     BPL bra_9143
C - - - - - 0x035152 1A:9142: E8        INX ; 01
bra_9143:
C - - - - - 0x035153 1A:9143: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035156 1A:9146: 10 02     BPL bra_914A
C - - - - - 0x035158 1A:9148: E8        INX ; 02
C - - - - - 0x035159 1A:9149: E8        INX ; 03
bra_914A:
C - - - - - 0x03515A 1A:914A: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03515D 1A:914D: F0 04     BEQ bra_9153_команда_слева
; if мяч у команды справа
C - - - - - 0x03515F 1A:914F: 8A        TXA
C - - - - - 0x035160 1A:9150: 49 03     EOR #$03
C - - - - - 0x035162 1A:9152: AA        TAX
bra_9153_команда_слева:
C - - - - - 0x035163 1A:9153: BD EA 92  LDA tbl_92EA,X
C - - - - - 0x035166 1A:9156: 18        CLC
C - - - - - 0x035167 1A:9157: 6D FB 05  ADC ram_команда_с_мячом
C - - - - - 0x03516A 1A:915A: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x03516D 1A:915D: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035170 1A:9160: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035172 1A:9162: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035175 1A:9165: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035177 1A:9167: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035179 1A:9169: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x03517C 1A:916C: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x03517E 1A:916E: AE 35 06  LDX ram_ball_pos_X_hi
C - - - - - 0x035181 1A:9171: A9 08     LDA #$08
C - - - - - 0x035183 1A:9173: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035186 1A:9176: 10 02     BPL bra_917A
C - - - - - 0x035188 1A:9178: A9 F8     LDA #$F8
bra_917A:
C - - - - - 0x03518A 1A:917A: 18        CLC
C - - - - - 0x03518B 1A:917B: 6D 37 06  ADC ram_ball_pos_Y_hi
C - - - - - 0x03518E 1A:917E: A8        TAY
C - - - - - 0x03518F 1A:917F: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035192 1A:9182: 8D 24 06  STA ram_0624
C - - - - - 0x035195 1A:9185: 8D 1E 06  STA ram_061E
C - - - - - 0x035198 1A:9188: 20 D2 91  JSR sub_91D2
C - - - - - 0x03519B 1A:918B: A9 2A     LDA #con_s_id_2A
C - - - - - 0x03519D 1A:918D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0351A0 1A:9190: A9 02     LDA #$02
C - - - - - 0x0351A2 1A:9192: A2 0A     LDX #$0A
C - - - - - 0x0351A4 1A:9194: 20 10 91  JSR sub_9110
C - - - - - 0x0351A7 1A:9197: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x0351AA 1A:919A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0351AD 1A:919D: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0351B0 1A:91A0: AD 1E 06  LDA ram_061E
C - - - - - 0x0351B3 1A:91A3: 8D FE 05  STA ram_05FE
C - - - - - 0x0351B6 1A:91A6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x0351B9 1A:91A9: 98        TYA
C - - - - - 0x0351BA 1A:91AA: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0351BC 1A:91AC: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0351BE 1A:91AE: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0351C1 1A:91B1: 8A        TXA
C - - - - - 0x0351C2 1A:91B2: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0351C4 1A:91B4: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0351C6 1A:91B6: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x0351C9 1A:91B9: AD 24 06  LDA ram_0624
C - - - - - 0x0351CC 1A:91BC: 8D 38 06  STA ram_0638
C - - - - - 0x0351CF 1A:91BF: A9 00     LDA #$00
C - - - - - 0x0351D1 1A:91C1: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0351D4 1A:91C4: 8D 1A 06  STA ram_061A
C - - - - - 0x0351D7 1A:91C7: A9 01     LDA #$01
C - - - - - 0x0351D9 1A:91C9: 8D 1B 06  STA ram_061B
C - - - - - 0x0351DC 1A:91CC: 20 0C C6  JSR sub_0x03E74E
C - - - - - 0x0351DF 1A:91CF: 4C 3C C6  JMP loc_0x03DE7C



sub_91D2:
C - - - - - 0x0351E2 1A:91D2: A9 00     LDA #$00
C - - - - - 0x0351E4 1A:91D4: 85 11     STA ram_0011
C - - - - - 0x0351E6 1A:91D6: 85 12     STA ram_0012
C - - - - - 0x0351E8 1A:91D8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0351EB 1A:91DB: F0 03     BEQ bra_91E0_команда_слева
; if мяч у команды справа
C - - - - - 0x0351ED 1A:91DD: 4C 98 92  JMP loc_9298
bra_91E0_команда_слева:
C - - - - - 0x0351F0 1A:91E0: A9 38     LDA #con_s_id_38
C - - - - - 0x0351F2 1A:91E2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0351F5 1A:91E5: A9 81     LDA #$81
C - - - - - 0x0351F7 1A:91E7: 8D 2D 06  STA ram_062D
C - - - - - 0x0351FA 1A:91EA: A9 1F     LDA #$1F
C - - - - - 0x0351FC 1A:91EC: 8D 94 04  STA ram_chr_bank + $04
C - - - - - 0x0351FF 1A:91EF: A9 0F     LDA #con_B3CF_0F
C - - - - - 0x035201 1A:91F1: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035204 1A:91F4: A9 00     LDA #$00
C - - - - - 0x035206 1A:91F6: 8D 26 06  STA ram_0626
C - - - - - 0x035209 1A:91F9: 8D 27 06  STA ram_0627
loc_91FC_loop:
C D 0 - - - 0x03520C 1A:91FC: A9 01     LDA #$01
C - - - - - 0x03520E 1A:91FE: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035211 1A:9201: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035214 1A:9204: 29 03     AND #con_btn_Right + con_btn_Left
C - - - - - 0x035216 1A:9206: F0 2C     BEQ bra_9234
C - - - - - 0x035218 1A:9208: 4A        LSR
C - - - - - 0x035219 1A:9209: A9 0C     LDA #$0C
C - - - - - 0x03521B 1A:920B: B0 02     BCS bra_920F
C - - - - - 0x03521D 1A:920D: A9 F4     LDA #$F4
bra_920F:
C - - - - - 0x03521F 1A:920F: 18        CLC
C - - - - - 0x035220 1A:9210: 6D 26 06  ADC ram_0626
C - - - - - 0x035223 1A:9213: AA        TAX
C - - - - - 0x035224 1A:9214: 10 05     BPL bra_921B
C - - - - - 0x035226 1A:9216: 49 FF     EOR #$FF
C - - - - - 0x035228 1A:9218: 18        CLC
C - - - - - 0x035229 1A:9219: 69 01     ADC #$01
bra_921B:
C - - - - - 0x03522B 1A:921B: C9 3C     CMP #$3C
C - - - - - 0x03522D 1A:921D: 90 03     BCC bra_9222
C - - - - - 0x03522F 1A:921F: AE 26 06  LDX ram_0626
bra_9222:
C - - - - - 0x035232 1A:9222: 8A        TXA
C - - - - - 0x035233 1A:9223: 18        CLC
C - - - - - 0x035234 1A:9224: 6D 1E 06  ADC ram_061E
C - - - - - 0x035237 1A:9227: C9 F0     CMP #$F0
C - - - - - 0x035239 1A:9229: 90 03     BCC bra_922E
C - - - - - 0x03523B 1A:922B: AE 26 06  LDX ram_0626
bra_922E:
C - - - - - 0x03523E 1A:922E: 8E 26 06  STX ram_0626
C - - - - - 0x035241 1A:9231: 4C 5F 92  JMP loc_925F
bra_9234:
C - - - - - 0x035244 1A:9234: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035247 1A:9237: 29 0C     AND #con_btn_Down + con_btn_Up
C - - - - - 0x035249 1A:9239: F0 45     BEQ bra_9280
C - - - - - 0x03524B 1A:923B: 4A        LSR
C - - - - - 0x03524C 1A:923C: 4A        LSR
C - - - - - 0x03524D 1A:923D: 4A        LSR
C - - - - - 0x03524E 1A:923E: A9 01     LDA #$01
C - - - - - 0x035250 1A:9240: B0 02     BCS bra_9244
C - - - - - 0x035252 1A:9242: A9 FF     LDA #$FF
bra_9244:
C - - - - - 0x035254 1A:9244: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035257 1A:9247: 10 05     BPL bra_924E
C - - - - - 0x035259 1A:9249: 49 FF     EOR #$FF
C - - - - - 0x03525B 1A:924B: 18        CLC
C - - - - - 0x03525C 1A:924C: 69 01     ADC #$01
bra_924E:
C - - - - - 0x03525E 1A:924E: 18        CLC
C - - - - - 0x03525F 1A:924F: 6D 27 06  ADC ram_0627
C - - - - - 0x035262 1A:9252: 10 02     BPL bra_9256
C - - - - - 0x035264 1A:9254: A9 00     LDA #$00
bra_9256:
C - - - - - 0x035266 1A:9256: C9 05     CMP #$05
C - - - - - 0x035268 1A:9258: 90 02     BCC bra_925C
C - - - - - 0x03526A 1A:925A: A9 04     LDA #$04
bra_925C:
C - - - - - 0x03526C 1A:925C: 8D 27 06  STA ram_0627
loc_925F:
C D 0 - - - 0x03526F 1A:925F: AD 1E 06  LDA ram_061E
C - - - - - 0x035272 1A:9262: 18        CLC
C - - - - - 0x035273 1A:9263: 6D 26 06  ADC ram_0626
C - - - - - 0x035276 1A:9266: 8D 24 06  STA ram_0624
C - - - - - 0x035279 1A:9269: AD 27 06  LDA ram_0627
C - - - - - 0x03527C 1A:926C: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x03527F 1A:926F: 10 05     BPL bra_9276
C - - - - - 0x035281 1A:9271: 49 FF     EOR #$FF
C - - - - - 0x035283 1A:9273: 18        CLC
C - - - - - 0x035284 1A:9274: 69 01     ADC #$01
bra_9276:
C - - - - - 0x035286 1A:9276: 18        CLC
C - - - - - 0x035287 1A:9277: 6D 24 06  ADC ram_0624
C - - - - - 0x03528A 1A:927A: 8D 24 06  STA ram_0624
C - - - - - 0x03528D 1A:927D: 20 3F C6  JSR loc_0x03D907
bra_9280:
C - - - - - 0x035290 1A:9280: A9 80     LDA #con_btn_A
C - - - - - 0x035292 1A:9282: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035295 1A:9285: D0 03     BNE bra_928A
C - - - - - 0x035297 1A:9287: 4C FC 91  JMP loc_91FC_loop
bra_928A:
C - - - - - 0x03529A 1A:928A: 20 42 C6  JSR loc_0x03D862
C - - - - - 0x03529D 1A:928D: B0 03     BCS bra_9292
- - - - - - 0x03529F 1A:928F: 4C FC 91  JMP loc_91FC_loop
bra_9292:
C - - - - - 0x0352A2 1A:9292: A9 00     LDA #$00
C - - - - - 0x0352A4 1A:9294: 8D 2D 06  STA ram_062D
C - - - - - 0x0352A7 1A:9297: 60        RTS



loc_9298:
C D 0 - - - 0x0352A8 1A:9298: A9 0C     LDA #$0C
C - - - - - 0x0352AA 1A:929A: 85 3A     STA ram_003A
bra_929C_loop:
C - - - - - 0x0352AC 1A:929C: A5 3A     LDA ram_003A
C - - - - - 0x0352AE 1A:929E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0352B1 1A:92A1: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0352B3 1A:92A3: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0352B5 1A:92A5: 38        SEC
C - - - - - 0x0352B6 1A:92A6: ED 35 06  SBC ram_ball_pos_X_hi
C - - - - - 0x0352B9 1A:92A9: B0 04     BCS bra_92AF
C - - - - - 0x0352BB 1A:92AB: 49 FF     EOR #$FF
C - - - - - 0x0352BD 1A:92AD: 69 01     ADC #$01
bra_92AF:
C - - - - - 0x0352BF 1A:92AF: C9 20     CMP #$20
C - - - - - 0x0352C1 1A:92B1: B0 12     BCS bra_92C5
C - - - - - 0x0352C3 1A:92B3: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0352C5 1A:92B5: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0352C7 1A:92B7: 38        SEC
C - - - - - 0x0352C8 1A:92B8: ED 37 06  SBC ram_ball_pos_Y_hi
C - - - - - 0x0352CB 1A:92BB: B0 04     BCS bra_92C1
C - - - - - 0x0352CD 1A:92BD: 49 FF     EOR #$FF
C - - - - - 0x0352CF 1A:92BF: 69 01     ADC #$01
bra_92C1:
C - - - - - 0x0352D1 1A:92C1: C9 20     CMP #$20
C - - - - - 0x0352D3 1A:92C3: 90 1F     BCC bra_92E4
bra_92C5:
C - - - - - 0x0352D5 1A:92C5: E6 3A     INC ram_003A
C - - - - - 0x0352D7 1A:92C7: A5 3A     LDA ram_003A
C - - - - - 0x0352D9 1A:92C9: C9 16     CMP #$16
C - - - - - 0x0352DB 1A:92CB: D0 CF     BNE bra_929C_loop



; bzk garbage?
- - - - - - 0x0352DD 1A:92CD: A9 14     LDA #$14
- - - - - - 0x0352DF 1A:92CF: 85 3A     STA ram_003A
- - - - - - 0x0352E1 1A:92D1: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
- - - - - - 0x0352E4 1A:92D4: AD 1E 06  LDA ram_061E
- - - - - - 0x0352E7 1A:92D7: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
- - - - - - 0x0352EA 1A:92DA: 98        TYA
- - - - - - 0x0352EB 1A:92DB: A0 08     LDY #con_plr_pos_Y_hi
- - - - - - 0x0352ED 1A:92DD: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
- - - - - - 0x0352EF 1A:92DF: 8A        TXA
- - - - - - 0x0352F0 1A:92E0: A0 06     LDY #con_plr_pos_X_hi
- - - - - - 0x0352F2 1A:92E2: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi



bra_92E4:
C - - - - - 0x0352F4 1A:92E4: A5 3A     LDA ram_003A
C - - - - - 0x0352F6 1A:92E6: 8D FC 05  STA ram_принимающий
C - - - - - 0x0352F9 1A:92E9: 60        RTS



tbl_92EA:
- D 0 - - - 0x0352FA 1A:92EA: 01        .byte $01   ; 00 
- D 0 - - - 0x0352FB 1A:92EB: 05        .byte $05   ; 01 
- - - - - - 0x0352FC 1A:92EC: 02        .byte $02   ; 02 
- D 0 - - - 0x0352FD 1A:92ED: 07        .byte $07   ; 03 



loc_92EE:
C D 0 - - - 0x0352FE 1A:92EE: A9 24     LDA #con_s_id_24
C - - - - - 0x035300 1A:92F0: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035303 1A:92F3: A9 00     LDA #$00
C - - - - - 0x035305 1A:92F5: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x035308 1A:92F8: 20 7B 98  JSR sub_987B
C - - - - - 0x03530B 1A:92FB: A2 06     LDX #$06
C - - - - - 0x03530D 1A:92FD: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035310 1A:9300: 10 01     BPL bra_9303
C - - - - - 0x035312 1A:9302: E8        INX
bra_9303:
C - - - - - 0x035313 1A:9303: 8E 1E 06  STX ram_061E
C - - - - - 0x035316 1A:9306: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035319 1A:9309: F0 08     BEQ bra_9313_команда_слева
; if мяч у команды справа
C - - - - - 0x03531B 1A:930B: A9 09     LDA #con_bsw_1C_04
C - - - - - 0x03531D 1A:930D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035320 1A:9310: 4C 18 93  JMP loc_9318
bra_9313_команда_слева:
bra_9313_loop:
C - - - - - 0x035323 1A:9313: A9 2E     LDA #con_B3CF_2E
C - - - - - 0x035325 1A:9315: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
loc_9318:
C D 0 - - - 0x035328 1A:9318: AD 1E 06  LDA ram_061E
C - - - - - 0x03532B 1A:931B: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03532E 1A:931E: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - - 0x035331 1A:9321: B0 05     BCS bra_9328
C - - - - - 0x035333 1A:9323: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035336 1A:9326: F0 EB     BEQ bra_9313_loop
; if мяч у команды справа
bra_9328:
C - - - - - 0x035338 1A:9328: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03533B 1A:932B: D0 08     BNE bra_9335_команда_справа
; if мяч у команды слева
C - - - - - 0x03533D 1A:932D: A9 04     LDA #$04
C - - - - - 0x03533F 1A:932F: 8D 21 06  STA ram_0621
C - - - - - 0x035342 1A:9332: 20 00 C6  JSR sub_0x03D575
bra_9335_команда_справа:
C - - - - - 0x035345 1A:9335: 20 72 8F  JSR sub_8F72
C - - - - - 0x035348 1A:9338: A9 01     LDA #$01
C - - - - - 0x03534A 1A:933A: A2 12     LDX #$12
C - - - - - 0x03534C 1A:933C: 20 10 91  JSR sub_9110
C - - - - - 0x03534F 1A:933F: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x035352 1A:9342: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x035355 1A:9345: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035358 1A:9348: 4C 93     .word ofs_046_934C_00
- D 0 - I - 0x03535A 1A:934A: 59 93     .word ofs_046_9359_01




ofs_046_934C_00:
C - - J - - 0x03535C 1A:934C: A9 25     LDA #con_s_id_25
C - - - - - 0x03535E 1A:934E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035361 1A:9351: A9 66     LDA #$66
C - - - - - 0x035363 1A:9353: 8D 1A 06  STA ram_061A
C - - - - - 0x035366 1A:9356: 4C 1B C6  JMP loc_0x03DD12




ofs_046_9359_01:
C - - J - - 0x035369 1A:9359: A9 26     LDA #con_s_id_26
C - - - - - 0x03536B 1A:935B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03536E 1A:935E: A9 4D     LDA #$4D
C - - - - - 0x035370 1A:9360: 8D 1A 06  STA ram_061A
C - - - - - 0x035373 1A:9363: 4C 15 C6  JMP loc_0x03DE6E




ofs_039_81EA_04_нарушение:
ofs_040_847C_04_нарушение:
ofs_043_87D4_04_нарушение:
C D 0 - - - 0x035376 1A:9366: A9 00     LDA #$00
C - - - - - 0x035378 1A:9368: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x03537B 1A:936B: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x03537E 1A:936E: 90 09     BCC bra_9379
C - - - - - 0x035380 1A:9370: 8A        TXA
C - - - - - 0x035381 1A:9371: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x035384 1A:9374: F0 03     BEQ bra_9379    ; if комада слева
; if мяч у команды справа
C - - - - - 0x035386 1A:9376: 4C CF 94  JMP loc_94CF
bra_9379:
C - - - - - 0x035389 1A:9379: A9 2B     LDA #con_s_id_2B
C - - - - - 0x03538B 1A:937B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03538E 1A:937E: 20 7B 98  JSR sub_987B
C - - - - - 0x035391 1A:9381: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035394 1A:9384: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035397 1A:9387: F0 05     BEQ bra_938E_команда_слева
; if мяч у команды справа
C - - - - - 0x035399 1A:9389: 49 FF     EOR #$FF
C - - - - - 0x03539B 1A:938B: 18        CLC
C - - - - - 0x03539C 1A:938C: 69 01     ADC #$01
bra_938E_команда_слева:
C - - - - - 0x03539E 1A:938E: C9 A0     CMP #$A0
C - - - - - 0x0353A0 1A:9390: 90 03     BCC bra_9395
C - - - - - 0x0353A2 1A:9392: 4C E4 93  JMP loc_93E4
bra_9395:
loc_9395:
C D 0 - - - 0x0353A5 1A:9395: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0353A8 1A:9398: F0 22     BEQ bra_93BC_команда_слева
; if мяч у команды справа
C - - - - - 0x0353AA 1A:939A: AD E2 00  LDA ram_random + $01
C - - - - - 0x0353AD 1A:939D: 29 0F     AND #$0F
C - - - - - 0x0353AF 1A:939F: C9 0A     CMP #$0A
C - - - - - 0x0353B1 1A:93A1: 90 03     BCC bra_93A6
C - - - - - 0x0353B3 1A:93A3: 38        SEC
C - - - - - 0x0353B4 1A:93A4: E9 0A     SBC #$0A
bra_93A6:
C - - - - - 0x0353B6 1A:93A6: 38        SEC
C - - - - - 0x0353B7 1A:93A7: 69 0B     ADC #$0B
C - - - - - 0x0353B9 1A:93A9: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x0353BC 1A:93AC: D0 09     BNE bra_93B7
C - - - - - 0x0353BE 1A:93AE: 18        CLC
C - - - - - 0x0353BF 1A:93AF: 69 01     ADC #$01
C - - - - - 0x0353C1 1A:93B1: C9 16     CMP #$16
C - - - - - 0x0353C3 1A:93B3: 90 02     BCC bra_93B7
- - - - - - 0x0353C5 1A:93B5: A9 0C     LDA #$0C
bra_93B7:
C - - - - - 0x0353C7 1A:93B7: 8D FC 05  STA ram_принимающий
C - - - - - 0x0353CA 1A:93BA: D0 03     BNE bra_93BF    ; jmp?
bra_93BC_команда_слева:
C - - - - - 0x0353CC 1A:93BC: 20 DE 93  JSR sub_93DE
bra_93BF:
C - - - - - 0x0353CF 1A:93BF: A9 01     LDA #$01
C - - - - - 0x0353D1 1A:93C1: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x0353D4 1A:93C4: A9 00     LDA #$00
C - - - - - 0x0353D6 1A:93C6: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0353D9 1A:93C9: A9 18     LDA #con_s_id_18
C - - - - - 0x0353DB 1A:93CB: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0353DE 1A:93CE: A9 04     LDA #$04
C - - - - - 0x0353E0 1A:93D0: A2 12     LDX #$12
C - - - - - 0x0353E2 1A:93D2: 20 10 91  JSR sub_9110
C - - - - - 0x0353E5 1A:93D5: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x0353E8 1A:93D8: A2 50     LDX #$50
C - - - - - 0x0353EA 1A:93DA: 9A        TXS
C - - - - - 0x0353EB 1A:93DB: 4C 12 C6  JMP loc_0x03DE62



sub_93DE:
loc_93DE_infinite_loop:
C D 0 - - - 0x0353EE 1A:93DE: 20 48 C6  JSR sub_0x03D7F8    ; возможен PLA PLA
C - - - - - 0x0353F1 1A:93E1: 4C DE 93  JMP loc_93DE_infinite_loop



loc_93E4:
C D 0 - - - 0x0353F4 1A:93E4: AA        TAX
C - - - - - 0x0353F5 1A:93E5: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x0353F8 1A:93E8: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x0353FB 1A:93EB: F0 02     BEQ bra_93EF_команда_слева
; if мяч у команды справа
C - - - - - 0x0353FD 1A:93ED: 49 FF     EOR #$FF
bra_93EF_команда_слева:
C - - - - - 0x0353FF 1A:93EF: A8        TAY
C - - - - - 0x035400 1A:93F0: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035403 1A:93F3: 85 3B     STA ram_003B
C - - - - - 0x035405 1A:93F5: A9 00     LDA #$00
bra_93F7_loop:
C - - - - - 0x035407 1A:93F7: 48        PHA
C - - - - - 0x035408 1A:93F8: 0A        ASL
C - - - - - 0x035409 1A:93F9: AA        TAX
C - - - - - 0x03540A 1A:93FA: BD B9 9F  LDA tbl_9FB9,X
C - - - - - 0x03540D 1A:93FD: 85 3C     STA ram_003C
C - - - - - 0x03540F 1A:93FF: BD BA 9F  LDA tbl_9FB9 + $01,X
C - - - - - 0x035412 1A:9402: 85 3D     STA ram_003D
C - - - - - 0x035414 1A:9404: A0 00     LDY #$00
bra_9406_loop:
C - - - - - 0x035416 1A:9406: B1 3C     LDA (ram_003C),Y
C - - - - - 0x035418 1A:9408: C9 FF     CMP #$FF
C - - - - - 0x03541A 1A:940A: F0 07     BEQ bra_9413
C - - - - - 0x03541C 1A:940C: C5 3B     CMP ram_003B
C - - - - - 0x03541E 1A:940E: F0 10     BEQ bra_9420
C - - - - - 0x035420 1A:9410: C8        INY
C - - - - - 0x035421 1A:9411: D0 F3     BNE bra_9406_loop
bra_9413:
C - - - - - 0x035423 1A:9413: 68        PLA
C - - - - - 0x035424 1A:9414: 18        CLC
C - - - - - 0x035425 1A:9415: 69 01     ADC #$01
C - - - - - 0x035427 1A:9417: C9 05     CMP #$05
C - - - - - 0x035429 1A:9419: D0 03     BNE bra_93F7_loop
C - - - - - 0x03542B 1A:941B: 4C 95 93  JMP loc_9395
bra_9420:
C - - - - - 0x035430 1A:9420: 68        PLA
C - - - - - 0x035431 1A:9421: 8D 12 06  STA ram_результат_защитника
bra_9424_loop:
C - - - - - 0x035434 1A:9424: A9 27     LDA #con_B3CF_27
C - - - - - 0x035436 1A:9426: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - - 0x035439 1A:9429: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03543C 1A:942C: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03543F 1A:942F: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - - 0x035442 1A:9432: 90 F0     BCC bra_9424_loop
bra_9434_loop:
C - - - - - 0x035444 1A:9434: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035447 1A:9437: D0 08     BNE bra_9441_команда_справа
; if мяч у команды слева
C - - - - - 0x035449 1A:9439: A9 04     LDA #$04
C - - - - - 0x03544B 1A:943B: 8D 21 06  STA ram_0621
C - - - - - 0x03544E 1A:943E: 20 00 C6  JSR sub_0x03D575
bra_9441_команда_справа:
C - - - - - 0x035451 1A:9441: 20 70 94  JSR sub_9470
C - - - - - 0x035454 1A:9444: 90 EE     BCC bra_9434_loop
C - - - - - 0x035456 1A:9446: A9 0E     LDA #con_bsw_1C_07
C - - - - - 0x035458 1A:9448: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03545B 1A:944B: A9 18     LDA #con_s_id_18
C - - - - - 0x03545D 1A:944D: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x035460 1A:9450: E0 01     CPX #$01
C - - - - - 0x035462 1A:9452: F0 02     BEQ bra_9456
C - - - - - 0x035464 1A:9454: A9 1D     LDA #con_s_id_1D
bra_9456:
C - - - - - 0x035466 1A:9456: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035469 1A:9459: A9 04     LDA #$04
C - - - - - 0x03546B 1A:945B: A2 12     LDX #$12
C - - - - - 0x03546D 1A:945D: 20 10 91  JSR sub_9110
C - - - - - 0x035470 1A:9460: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x035473 1A:9463: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x035476 1A:9466: C9 01     CMP #$01
C - - - - - 0x035478 1A:9468: D0 03     BNE bra_946D
C - - - - - 0x03547A 1A:946A: 4C 12 C6  JMP loc_0x03DE62
bra_946D:
C - - - - - 0x03547D 1A:946D: 4C B0 8A  JMP loc_8AB0



sub_9470:
C - - - - - 0x035480 1A:9470: A2 03     LDX #$03
C - - - - - 0x035482 1A:9472: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035485 1A:9475: D0 0A     BNE bra_9481    ; if комада справа
; if мяч у команды слева
C - - - - - 0x035487 1A:9477: CA        DEX ; 02
C - - - - - 0x035488 1A:9478: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03548D 1A:947D: F0 02     BEQ bra_9481
C - - - - - 0x03548F 1A:947F: 38        SEC
C - - - - - 0x035490 1A:9480: 60        RTS
bra_9481:
C - - - - - 0x035491 1A:9481: 8E 12 06  STX ram_результат_защитника
C - - - - - 0x035494 1A:9484: 8A        TXA
C - - - - - 0x035495 1A:9485: 18        CLC
C - - - - - 0x035496 1A:9486: 69 28     ADC #$28
; con_B3CF_2A
; con_B3CF_2B
C - - - - - 0x035498 1A:9488: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03549B 1A:948B: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03549E 1A:948E: D0 05     BNE bra_9495_команда_справа
; if комада слева
C - - - - - 0x0354A0 1A:9490: A9 03     LDA #con_B3CF_03
C - - - - - 0x0354A2 1A:9492: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9495_команда_справа:
C - - - - - 0x0354A5 1A:9495: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0354A8 1A:9498: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_949B_loop:
C - - - - - 0x0354AB 1A:949B: A9 01     LDA #$01
C - - - - - 0x0354AD 1A:949D: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0354B0 1A:94A0: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - - 0x0354B2 1A:94A2: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354B5 1A:94A5: F0 0B     BEQ bra_94B2
C - - - - - 0x0354B7 1A:94A7: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0354BA 1A:94AA: 49 40     EOR #$40
C - - - - - 0x0354BC 1A:94AC: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0354BF 1A:94AF: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_94B2:
C - - - - - 0x0354C2 1A:94B2: A9 40     LDA #con_btn_B
C - - - - - 0x0354C4 1A:94B4: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354C7 1A:94B7: F0 02     BEQ bra_94BB
- - - - - - 0x0354C9 1A:94B9: 18        CLC
- - - - - - 0x0354CA 1A:94BA: 60        RTS
bra_94BB:
C - - - - - 0x0354CB 1A:94BB: A9 80     LDA #con_btn_A
C - - - - - 0x0354CD 1A:94BD: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354D0 1A:94C0: F0 D9     BEQ bra_949B_loop
C - - - - - 0x0354D2 1A:94C2: A2 00     LDX #$00
C - - - - - 0x0354D4 1A:94C4: 2C 12 06  BIT ram_результат_защитника
C - - - - - 0x0354D7 1A:94C7: 50 01     BVC bra_94CA
C - - - - - 0x0354D9 1A:94C9: E8        INX
bra_94CA:
C - - - - - 0x0354DA 1A:94CA: 8E 12 06  STX ram_результат_защитника
C - - - - - 0x0354DD 1A:94CD: 38        SEC
C - - - - - 0x0354DE 1A:94CE: 60        RTS



loc_94CF:
C D 0 - - - 0x0354DF 1A:94CF: A9 1F     LDA #con_s_id_1F
C - - - - - 0x0354E1 1A:94D1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0354E4 1A:94D4: 20 7B 98  JSR sub_987B
C - - - - - 0x0354E7 1A:94D7: A9 2F     LDA #con_B3CF_2F
C - - - - - 0x0354E9 1A:94D9: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - - 0x0354EC 1A:94DC: A9 20     LDA #con_s_id_20
C - - - - - 0x0354EE 1A:94DE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0354F1 1A:94E1: A9 05     LDA #$05
C - - - - - 0x0354F3 1A:94E3: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x0354F6 1A:94E6: 20 45 C6  JSR sub_0x03E6FC
C - - - - - 0x0354F9 1A:94E9: 20 09 95  JSR sub_9509
C - - - - - 0x0354FC 1A:94EC: A9 21     LDA #con_s_id_21
C - - - - - 0x0354FE 1A:94EE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035501 1A:94F1: A9 05     LDA #$05
C - - - - - 0x035503 1A:94F3: A2 00     LDX #$00
C - - - - - 0x035505 1A:94F5: 20 10 91  JSR sub_9110
C - - - - - 0x035508 1A:94F8: A9 01     LDA #$01
C - - - - - 0x03550A 1A:94FA: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x03550D 1A:94FD: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x035510 1A:9500: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035513 1A:9503: AC 85     .word ofs_063_85AC_00
- D 0 - I - 0x035515 1A:9505: DF 8B     .word ofs_063_8BDF_01
- D 0 - I - 0x035517 1A:9507: 1C 86     .word ofs_063_861C_02



sub_9509:
C - - - - - 0x035519 1A:9509: A9 00     LDA #$00
C - - - - - 0x03551B 1A:950B: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x03551E 1A:950E: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x035521 1A:9511: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x035524 1A:9514: A9 05     LDA #$05
C - - - - - 0x035526 1A:9516: 8D 21 06  STA ram_0621
C - - - - - 0x035529 1A:9519: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x03552C 1A:951C: A9 0D     LDA #con_bsw_1C_рандом_стороны_кипера_в_пк
C - - - - - 0x03552E 1A:951E: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035531 1A:9521: 20 72 8F  JSR sub_8F72
C - - - - - 0x035534 1A:9524: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x035536 1A:9526: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035539 1A:9529: A9 00     LDA #$00
C - - - - - 0x03553B 1A:952B: 85 3A     STA ram_003A
C - - - - - 0x03553D 1A:952D: 85 3B     STA ram_003B
C - - - - - 0x03553F 1A:952F: A9 09     LDA #$09
C - - - - - 0x035541 1A:9531: A2 80     LDX #$80
C - - - - - 0x035543 1A:9533: 20 1F 8F  JSR sub_8F1F
C - - - - - 0x035546 1A:9536: 48        PHA
C - - - - - 0x035547 1A:9537: A0 00     LDY #$00
C - - - - - 0x035549 1A:9539: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x03554C 1A:953C: EC 3D 04  CPX ram_действие_защиты
C - - - - - 0x03554F 1A:953F: D0 05     BNE bra_9546
C - - - - - 0x035551 1A:9541: C9 C8     CMP #$C8
C - - - - - 0x035553 1A:9543: B0 01     BCS bra_9546
C - - - - - 0x035555 1A:9545: C8        INY
bra_9546:
C - - - - - 0x035556 1A:9546: 98        TYA
C - - - - - 0x035557 1A:9547: D0 10     BNE bra_9559
C - - - - - 0x035559 1A:9549: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03555C 1A:954C: C9 08     CMP #$08
C - - - - - 0x03555E 1A:954E: F0 09     BEQ bra_9559
C - - - - - 0x035560 1A:9550: AD E2 00  LDA ram_random + $01
C - - - - - 0x035563 1A:9553: C9 1F     CMP #$1F
C - - - - - 0x035565 1A:9555: B0 02     BCS bra_9559
C - - - - - 0x035567 1A:9557: A0 02     LDY #$02
bra_9559:
C - - - - - 0x035569 1A:9559: 68        PLA
C - - - - - 0x03556A 1A:955A: 20 48 81  STY ram_результат_защитника
C - - - - - 0x03556D 1A:955D: 60        RTS



loc_955E_очистить_stun_кипера_команды:
C D 0 - - - 0x03556E 1A:955E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035571 1A:9561: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035574 1A:9564: A0 0A     LDY #con_plr_stun
C - - - - - 0x035576 1A:9566: A9 00     LDA #$00
C - - - - - 0x035578 1A:9568: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x03557A 1A:956A: A9 05     LDA #$05
C - - - - - 0x03557C 1A:956C: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x03557F 1A:956F: 8E 41 04  STX ram_игрок_с_мячом   ; запись номера кипера 00/0B
C - - - - - 0x035582 1A:9572: F0 02     BEQ bra_9576_команда_слева
; if комада справа
C - - - - - 0x035584 1A:9574: A9 E9     LDA #$E9
bra_9576_команда_слева:
C - - - - - 0x035586 1A:9576: 8D FE 05  STA ram_05FE
C - - - - - 0x035589 1A:9579: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x03558C 1A:957C: 8E 35 06  STX ram_ball_pos_X_hi
C - - - - - 0x03558F 1A:957F: 8C 37 06  STY ram_ball_pos_Y_hi
C - - - - - 0x035592 1A:9582: A9 27     LDA #con_s_id_27
C - - - - - 0x035594 1A:9584: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035597 1A:9587: 20 7B 98  JSR sub_987B
C - - - - - 0x03559A 1A:958A: A9 0A     LDA #$0A
C - - - - - 0x03559C 1A:958C: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03559F 1A:958F: AD E2 00  LDA ram_random + $01
C - - - - - 0x0355A2 1A:9592: 29 0F     AND #$0F
C - - - - - 0x0355A4 1A:9594: C9 0A     CMP #$0A
C - - - - - 0x0355A6 1A:9596: 90 02     BCC bra_959A
C - - - - - 0x0355A8 1A:9598: E9 0A     SBC #$0A
bra_959A:
C - - - - - 0x0355AA 1A:959A: 38        SEC
C - - - - - 0x0355AB 1A:959B: 6D FB 05  ADC ram_команда_с_мячом
C - - - - - 0x0355AE 1A:959E: 8D FC 05  STA ram_принимающий
C - - - - - 0x0355B1 1A:95A1: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
C - - - - - 0x0355B4 1A:95A4: 20 1E C6  JSR sub_0x03E069
C - - - - - 0x0355B7 1A:95A7: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0355BA 1A:95AA: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0355BD 1A:95AD: A9 01     LDA #$01
C - - - - - 0x0355BF 1A:95AF: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x0355C2 1A:95B2: A9 00     LDA #$00
C - - - - - 0x0355C4 1A:95B4: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0355C7 1A:95B7: A9 28     LDA #con_s_id_28
C - - - - - 0x0355C9 1A:95B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0355CC 1A:95BC: A9 02     LDA #$02
C - - - - - 0x0355CE 1A:95BE: A2 0C     LDX #$0C
C - - - - - 0x0355D0 1A:95C0: 20 10 91  JSR sub_9110
C - - - - - 0x0355D3 1A:95C3: A9 1A     LDA #$1A
C - - - - - 0x0355D5 1A:95C5: 8D 1A 06  STA ram_061A
C - - - - - 0x0355D8 1A:95C8: A9 01     LDA #$01
C - - - - - 0x0355DA 1A:95CA: 8D 1B 06  STA ram_061B
C - - - - - 0x0355DD 1A:95CD: 20 0C C6  JSR sub_0x03E74E
C - - - - - 0x0355E0 1A:95D0: AD FC 05  LDA ram_принимающий
C - - - - - 0x0355E3 1A:95D3: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x0355E6 1A:95D6: A9 1C     LDA #con_s_id_1C
C - - - - - 0x0355E8 1A:95D8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0355EB 1A:95DB: A2 50     LDX #$50
C - - - - - 0x0355ED 1A:95DD: 9A        TXS
C - - - - - 0x0355EE 1A:95DE: 4C 0F C6  JMP loc_0x03E0EF



sub_0x0355F1_вычисление_счета_пенальти:
; 003A что-то типа максимального количества ударов, чтобы не нужно было пробивать лишний раз если все уже проебано
; голы хранятся в 0610 и 0611
; бряк срабатывает перед появлением экрана с выбором пробивающих игроковв
C D 0 - - - 0x0355F1 1A:95E1: 20 CC 96  JSR sub_96CC
C - - - - - 0x0355F4 1A:95E4: A9 00     LDA #$00    ; индекс команды слева
C - - - - - 0x0355F6 1A:95E6: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x0355F9 1A:95E9: 8D 8E 03  STA ram_038E
C - - - - - 0x0355FC 1A:95EC: 8D 8B 03  STA ram_038B
C - - - - - 0x0355FF 1A:95EF: 8D 0A 03  STA ram_030A
C - - - - - 0x035602 1A:95F2: 8D 07 03  STA ram_0307
C - - - - - 0x035605 1A:95F5: 2C E2 00  BIT ram_random + $01
C - - - - - 0x035608 1A:95F8: 10 02     BPL bra_95FC
C - - - - - 0x03560A 1A:95FA: A9 0B     LDA #$0B    ; индекс команды справа
bra_95FC:
C - - - - - 0x03560C 1A:95FC: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x03560F 1A:95FF: 8D 19 06  STA ram_снижение_силы_действия
                                        LDA #con_B3CF_43
                                        JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035612 1A:9602: A9 41     LDA #con_B3CF_41
C - - - - - 0x035614 1A:9604: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035617 1A:9607: A9 33     LDA #$33
C - - - - - 0x035619 1A:9609: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - - 0x03561C 1A:960C: A9 39     LDA #con_s_id_39
C - - - - - 0x03561E 1A:960E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_9611:
; бряк срабатывает перед объявлением имени пробивающего
C D 0 - - - 0x035621 1A:9611: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x035624 1A:9614: 4A        LSR
C - - - - - 0x035625 1A:9615: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x035628 1A:9618: B0 09     BCS bra_9623
C - - - - - 0x03562A 1A:961A: C9 05     CMP #$05
C - - - - - 0x03562C 1A:961C: D0 05     BNE bra_9623
C - - - - - 0x03562E 1A:961E: A9 45     LDA #con_s_id_45
C - - - - - 0x035630 1A:9620: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
bra_9623:
C - - - - - 0x035633 1A:9623: AD 17 06  LDA ram_колво_активных_защитников
bra_9626_loop:
C - - - - - 0x035636 1A:9626: C9 0A     CMP #$0A
C - - - - - 0x035638 1A:9628: 90 04     BCC bra_962E
- - - - - - 0x03563A 1A:962A: E9 0A     SBC #$0A
- - - - - - 0x03563C 1A:962C: B0 F8     BCS bra_9626_loop
bra_962E:
C - - - - - 0x03563E 1A:962E: AA        TAX
C - - - - - 0x03563F 1A:962F: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035642 1A:9632: F0 08     BEQ bra_963C_команда_слева
; if мяч у команды справа
C - - - - - 0x035644 1A:9634: 86 3A     STX ram_003A
C - - - - - 0x035646 1A:9636: A9 09     LDA #$09
C - - - - - 0x035648 1A:9638: 38        SEC
C - - - - - 0x035649 1A:9639: E5 3A     SBC ram_003A
C - - - - - 0x03564B 1A:963B: AA        TAX
bra_963C_команда_слева:
C - - - - - 0x03564C 1A:963C: BD 31 04  LDA ram_список_спешалов + $01,X
C - - - - - 0x03564F 1A:963F: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035652 1A:9642: F0 03     BEQ bra_9647_команда_слева
; if мяч у команды справа
C - - - - - 0x035654 1A:9644: 18        CLC
C - - - - - 0x035655 1A:9645: 69 0B     ADC #$0B
bra_9647_команда_слева:
C - - - - - 0x035657 1A:9647: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x03565A 1A:964A: A9 22     LDA #con_s_id_22
C - - - - - 0x03565C 1A:964C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03565F 1A:964F: 20 09 95  JSR sub_9509
C - - - - - 0x035662 1A:9652: A9 23     LDA #con_s_id_23
C - - - - - 0x035664 1A:9654: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035667 1A:9657: 20 AE 96  JSR sub_96AE
C - - - - - 0x03566A 1A:965A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03566D 1A:965D: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x035670 1A:9660: 4A        LSR
C - - - - - 0x035671 1A:9661: 08        PHP
C - - - - - 0x035672 1A:9662: 85 3A     STA ram_003A
C - - - - - 0x035674 1A:9664: 38        SEC
C - - - - - 0x035675 1A:9665: A9 03     LDA #$03
C - - - - - 0x035677 1A:9667: E5 3A     SBC ram_003A
C - - - - - 0x035679 1A:9669: AA        TAX
C - - - - - 0x03567A 1A:966A: B0 02     BCS bra_966E
C - - - - - 0x03567C 1A:966C: A2 FF     LDX #$FF
bra_966E:
C - - - - - 0x03567E 1A:966E: E8        INX
C - - - - - 0x03567F 1A:966F: E8        INX
C - - - - - 0x035680 1A:9670: 28        PLP
C - - - - - 0x035681 1A:9671: B0 01     BCS bra_9674
C - - - - - 0x035683 1A:9673: E8        INX
bra_9674:
C - - - - - 0x035684 1A:9674: 86 3A     STX ram_003A
C - - - - - 0x035686 1A:9676: AD 10 06  LDA ram_пк_голы
C - - - - - 0x035689 1A:9679: 38        SEC
C - - - - - 0x03568A 1A:967A: ED 11 06  SBC ram_пк_голы + $01
C - - - - - 0x03568D 1A:967D: B0 04     BCS bra_9683
C - - - - - 0x03568F 1A:967F: 49 FF     EOR #$FF
C - - - - - 0x035691 1A:9681: 69 01     ADC #$01
bra_9683:
C - - - - - 0x035693 1A:9683: C5 3A     CMP ram_003A
C - - - - - 0x035695 1A:9685: B0 0B     BCS bra_9692
C - - - - - 0x035697 1A:9687: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03569A 1A:968A: 49 0B     EOR #$0B
C - - - - - 0x03569C 1A:968C: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x03569F 1A:968F: 4C 11 96  JMP loc_9611
bra_9692:
C - - - - - 0x0356A2 1A:9692: A2 00     LDX #$00
C - - - - - 0x0356A4 1A:9694: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - - 0x0356A7 1A:9697: E8        INX
C - - - - - 0x0356A8 1A:9698: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - - 0x0356AB 1A:969B: A9 33     LDA #con_s_id_33
C - - - - - 0x0356AD 1A:969D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0356B0 1A:96A0: 4C 54 C5  JMP loc_0x03CF0E



sub_96A3_сложение_голов_матча_и_пк:
; bzk optimize, нахрена это вообще надо? может для сценария
C - - - - - 0x0356B3 1A:96A3: BD 10 06  LDA ram_пк_голы,X
C - - - - - 0x0356B6 1A:96A6: 18        CLC
C - - - - - 0x0356B7 1A:96A7: 7D 28 00  ADC ram_голы,X
C - - - - - 0x0356BA 1A:96AA: 9D 28 00  STA ram_голы,X
C - - - - - 0x0356BD 1A:96AD: 60        RTS



sub_96AE:
C - - - - - 0x0356BE 1A:96AE: AD 12 06  LDA ram_результат_защитника
                                        BNE bra_96C9_RTS
; увеличить счетчик голов если кто-то забил
; включает в себя когда кипер не угадал, и когда не смог отбить даже если угадал
C - - J - - 0x0356CA 1A:96BA: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x0356CD 1A:96BD: F0 02     BEQ bra_96C1_команда_слева
; if мяч у команды справа
C - - - - - 0x0356CF 1A:96BF: A2 01     LDX #$01
bra_96C1_команда_слева: ; X = 00, bzk optimize, небезопасно
C - - - - - 0x0356D1 1A:96C1: FE 10 06  INC ram_пк_голы,X
C - - - - - 0x0356D4 1A:96C4: A9 41     LDA #con_B3CF_41
C - - - - - 0x0356D6 1A:96C6: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_96C9_RTS:
C - - - - - 0x0356D9 1A:96C9: 60        RTS



sub_96CC:
C - - - - - 0x0356DC 1A:96CC: A9 01     LDA #$01
C - - - - - 0x0356DE 1A:96CE: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - - 0x0356E1 1A:96D1: A9 00     LDA #$00
C - - - - - 0x0356E3 1A:96D3: 85 11     STA ram_0011
C - - - - - 0x0356E5 1A:96D5: 85 12     STA ram_0012
C - - - - - 0x0356E9 1A:96D9: 8D 30 04  STA ram_список_спешалов
C - - - - - 0x0356EC 1A:96DC: 8D 3C 05  STA ram_номер_анимации
C - - - - - 0x0356EF 1A:96DF: A9 80     LDA #$80
C - - - - - 0x0356F1 1A:96E1: 8D 3A 05  STA ram_053A
C - - - - - 0x0356F4 1A:96E4: A2 00     LDX #$00    ; палитра фона
C - - - - - 0x0356F6 1A:96E6: A9 12     LDA #con_FBCC_12
C - - - - - 0x0356F8 1A:96E8: 20 30 C5  JSR sub_0x03CC12_запись_палитры_во_время_матча
C - - - - - 0x0356FB 1A:96EB: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x035701 1A:96F1: A9 02     LDA #$02
C - - - - - 0x035703 1A:96F3: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035718 1A:9708: A9 2E     LDA #$2E
C - - - - - 0x03571A 1A:970A: 8D 91 04  STA ram_chr_bank + $01
                                        LDA ram_матч
                                        ASL
                                        ADC #$80
                                        STA ram_chr_bank
C - - - - - 0x035706 1A:96F6: A9 00     LDA #$00
C - - - - - 0x03571F 1A:970F: 8D CE 05  STA ram_05CE
C - - - - - 0x035722 1A:9712: 85 4A     STA ram_004A
C - - - - - 0x035724 1A:9714: 85 4B     STA ram_004B
C - - - - - 0x035708 1A:96F8: 8D 69 04  STA ram_0469
C - - - - - 0x035710 1A:9700: 8D 00 E0  STA $5204
C - - - - - 0x035726 1A:9716: A5 20     LDA ram_0020
C - - - - - 0x035728 1A:9718: 29 FC     AND #$FC
C - - - - - 0x03572A 1A:971A: 85 20     STA ram_0020
C - - - - - 0x03572C 1A:971C: A9 3E     LDA #con_B3CF_3E
C - - - - - 0x03572E 1A:971E: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035731 1A:9721: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
C - - - - - 0x035734 1A:9724: A2 00     LDX #$00    ; палитра фона
C - - - - - 0x035736 1A:9726: A9 13     LDA #con_FBCC_13
C - - - - - 0x035738 1A:9728: 20 30 C5  JSR sub_0x03CC12_запись_палитры_во_время_матча
C - - - - - 0x03573B 1A:972B: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x035741 1A:9731: A9 00     LDA #$00
C - - - - - 0x035743 1A:9733: 8D 24 06  STA ram_0624
C - - - - - 0x035746 1A:9736: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9739_loop:
C D 0 - - - 0x035749 1A:9739: A9 01     LDA #$01
C - - - - - 0x03574B 1A:973B: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03574E 1A:973E: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - - 0x035750 1A:9740: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035753 1A:9743: F0 32     BEQ bra_9777
C - - - - - 0x035755 1A:9745: 48        PHA
C - - - - - 0x035756 1A:9746: A9 09     LDA #$09
C - - - - - 0x035758 1A:9748: 38        SEC
C - - - - - 0x035759 1A:9749: ED 30 04  SBC ram_список_спешалов
C - - - - - 0x03575C 1A:974C: 85 3A     STA ram_003A
C - - - - - 0x03575E 1A:974E: 68        PLA
C - - - - - 0x03575F 1A:974F: A2 01     LDX #$01
C - - - - - 0x035761 1A:9751: 29 04     AND #$04
C - - - - - 0x035763 1A:9753: D0 02     BNE bra_9757_было_нажато_вниз
C - - - - - 0x035765 1A:9755: A2 FF     LDX #$FF
bra_9757_было_нажато_вниз:
C - - - - - 0x035767 1A:9757: 8A        TXA
C - - - - - 0x035768 1A:9758: 18        CLC
C - - - - - 0x035769 1A:9759: 6D 24 06  ADC ram_0624
C - - - - - 0x03576C 1A:975C: 30 19     BPL bra_975E
                                        LDA ram_003A      ; нажато вверх
                                        JMP loc_9769_обновить_курсор
bra_975E:
C - - - - - 0x03576E 1A:975E: C5 3A     CMP ram_003A
C - - - - - 0x035770 1A:9760: 90 02     BCC bra_9764
C - - - - - 0x035772 1A:9762: A5 3A     LDA ram_003A
bra_9764:
C - - - - - 0x035774 1A:9764: CD 24 06  CMP ram_0624
C - - - - - 0x035777 1A:9767: F0 0E     BNE bra_9769_обновить_курсор
                                        LDA #$00          ; нажато вниз
loc_9769_обновить_курсор:
bra_9769_обновить_курсор:
C - - - - - 0x035779 1A:9769: 48        PHA
C - - - - - 0x03577A 1A:976A: AD 24 06  LDA ram_0624
C - - - - - 0x03577D 1A:976D: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - - 0x035780 1A:9770: 68        PLA
C - - - - - 0x035781 1A:9771: 8D 24 06  STA ram_0624
C - - - - - 0x035784 1A:9774: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9777:
bra_9777:
C - - - - - 0x035787 1A:9777: A9 40     LDA #con_btn_B
C - - - - - 0x035789 1A:9779: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03578C 1A:977C: F0 0B     BEQ bra_9789
C - - - - - 0x03578E 1A:977E: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x035791 1A:9781: F0 06     BEQ bra_9789
C - - - - - 0x035793 1A:9783: CE 30 04  DEC ram_список_спешалов
C - - - - - 0x035796 1A:9786: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_9789:
C - - - - - 0x035799 1A:9789: A9 80     LDA #con_btn_A
C - - - - - 0x03579B 1A:978B: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03579E 1A:978E: F0 66     BEQ bra_97F6
C - - - - - 0x0357A0 1A:9790: AD 30 04  LDA ram_список_спешалов
C - - - - - 0x0357A3 1A:9793: C9 05     CMP #$05
C - - - - - 0x0357A5 1A:9795: D0 03     BNE bra_979A
C - - - - - 0x0357A7 1A:9797: 4C F9 97  JMP loc_97F9
bra_979A:
C - - - - - 0x0357AA 1A:979A: AD 24 06  LDA ram_0624
C - - - - - 0x0357AD 1A:979D: 85 3A     STA ram_003A
C - - - - - 0x0357AF 1A:979F: A9 01     LDA #$01
C - - - - - 0x0357B1 1A:97A1: 85 3B     STA ram_003B
C - - - - - 0x0357B3 1A:97A3: A9 00     LDA #$00
C - - - - - 0x0357B5 1A:97A5: 85 3C     STA ram_003C
bra_97A7_loop:
C - - - - - 0x0357B7 1A:97A7: A5 3B     LDA ram_003B
C - - - - - 0x0357B9 1A:97A9: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x0357BC 1A:97AC: F0 0E     BEQ bra_97BC
bra_97AE_loop:
C - - - - - 0x0357BE 1A:97AE: DD 30 04  CMP ram_список_спешалов,X
C - - - - - 0x0357C1 1A:97B1: F0 05     BEQ bra_97B8
C - - - - - 0x0357C3 1A:97B3: CA        DEX
C - - - - - 0x0357C4 1A:97B4: D0 F8     BNE bra_97AE_loop
C - - - - - 0x0357C6 1A:97B6: F0 04     BEQ bra_97BC    ; jmp
bra_97B8:
C - - - - - 0x0357C8 1A:97B8: E6 3B     INC ram_003B
C - - - - - 0x0357CA 1A:97BA: D0 EB     BNE bra_97A7_loop
bra_97BC:
C - - - - - 0x0357CC 1A:97BC: A5 3C     LDA ram_003C
C - - - - - 0x0357CE 1A:97BE: E6 3C     INC ram_003C
C - - - - - 0x0357D0 1A:97C0: C5 3A     CMP ram_003A
C - - - - - 0x0357D2 1A:97C2: F0 04     BEQ bra_97C8
C - - - - - 0x0357D4 1A:97C4: E6 3B     INC ram_003B
C - - - - - 0x0357D6 1A:97C6: D0 DF     BNE bra_97A7_loop
bra_97C8:
C - - - - - 0x0357D8 1A:97C8: A5 3B     LDA ram_003B
C - - - - - 0x0357DA 1A:97CA: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x0357DD 1A:97CD: 9D 31 04  STA ram_список_спешалов + $01,X
C - - - - - 0x0357E0 1A:97D0: EE 30 04  INC ram_список_спешалов
C - - - - - 0x0357E3 1A:97D3: A9 09     LDA #$09
C - - - - - 0x0357E5 1A:97D5: 38        SEC
C - - - - - 0x0357E6 1A:97D6: ED 30 04  SBC ram_список_спешалов
C - - - - - 0x0357E9 1A:97D9: 85 3A     STA ram_003A
C - - - - - 0x0357EB 1A:97DB: AD 24 06  LDA ram_0624
C - - - - - 0x0357EE 1A:97DE: E5 3A     SBC ram_003A
C - - - - - 0x0357F0 1A:97E0: 90 11     BCC bra_97F3
C - - - - - 0x0357F2 1A:97E2: AD 24 06  LDA ram_0624
C - - - - - 0x0357F5 1A:97E5: A6 3A     LDX ram_003A
C - - - - - 0x0357F7 1A:97E7: 8E 24 06  STX ram_0624
C - - - - - 0x0357FA 1A:97EA: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - - 0x0357FD 1A:97ED: AD 24 06  LDA ram_0624
C - - - - - 0x035800 1A:97F0: 20 28 98  JSR sub_9828_нарисовать_курсор
bra_97F3:
C - - - - - 0x035803 1A:97F3: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_97F6:
C - - - - - 0x035806 1A:97F6: 4C 39 97  JMP loc_9739_loop



loc_97F9:
C D 0 - - - 0x035809 1A:97F9: A9 01     LDA #$01
C - - - - - 0x03580B 1A:97FB: 85 3A     STA ram_003A
C - - - - - 0x03580D 1A:97FD: A0 0A     LDY #$0A
bra_97FF_loop:
C - - - - - 0x03580F 1A:97FF: A2 00     LDX #$00
C - - - - - 0x035811 1A:9801: A5 3A     LDA ram_003A
bra_9803_loop:
C - - - - - 0x035813 1A:9803: DD 31 04  CMP ram_список_спешалов + $01,X
C - - - - - 0x035816 1A:9806: F0 0E     BEQ bra_9816
C - - - - - 0x035818 1A:9808: E8        INX
C - - - - - 0x035819 1A:9809: E0 05     CPX #$05
C - - - - - 0x03581B 1A:980B: D0 F6     BNE bra_9803_loop
C - - - - - 0x03581D 1A:980D: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x035820 1A:9810: 9D 31 04  STA ram_список_спешалов + $01,X
C - - - - - 0x035823 1A:9813: EE 30 04  INC ram_список_спешалов
bra_9816:
C - - - - - 0x035826 1A:9816: E6 3A     INC ram_003A
C - - - - - 0x035828 1A:9818: 88        DEY
C - - - - - 0x035829 1A:9819: D0 E4     BNE bra_97FF_loop
C - - - - - 0x03582B 1A:981B: 20 69 C5  JSR sub_0x03CB45_очистить_nametable
C - - - - - 0x03582E 1A:981E: A9 00     LDA #con_chr_bank + $00
C - - - - - 0x035830 1A:9820: 85 8E     STA ram_008E
C - - - - - 0x035832 1A:9822: A9 01     LDA #$80
C - - - - - 0x035834 1A:9824: 8D 69 04  STA ram_0469
C - - - - - 0x035837 1A:9827: 60        RTS



sub_9828_нарисовать_курсор:
C - - - - - 0x035838 1A:9828: A2 B1     LDX #$B1
C - - - - - 0x03583A 1A:982A: D0 02     BNE bra_982E    ; jmp



sub_982C_удалить_курсор:
C - - - - - 0x03583C 1A:982C: A2 00     LDX #$00
bra_982E:
C - - - - - 0x03583E 1A:982E: 48        PHA
bra_982F_ожидание_освобождения_буфера:
C - - - - - 0x03583F 1A:982F: A9 01     LDA #$01
C - - - - - 0x035841 1A:9831: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035844 1A:9834: AD 15 05  LDA ram_0515
C - - - - - 0x035847 1A:9837: D0 F6     BNE bra_982F_ожидание_освобождения_буфера
C - - - - - 0x035849 1A:9839: A9 01     LDA #$01
C - - - - - 0x03584B 1A:983B: 8D 15 05  STA ram_0515
C - - - - - 0x03584E 1A:983E: A0 01     LDY #$01
C - - - - - 0x035850 1A:9840: 8C A5 04  STY ram_04A5
C - - - - - 0x035853 1A:9843: 88        DEY
C - - - - - 0x035854 1A:9844: 8C A9 04  STY ram_04A9
C - - - - - 0x035857 1A:9847: 8E A8 04  STX ram_04A8
C - - - - - 0x03585A 1A:984A: 68        PLA
C - - - - - 0x03585B 1A:984B: 8C A6 04  STY ram_04A6
C - - - - - 0x03585E 1A:984E: 4A        LSR
C - - - - - 0x03585F 1A:984F: 6E A6 04  ROR ram_04A6
C - - - - - 0x035862 1A:9852: 4A        LSR
C - - - - - 0x035863 1A:9853: 6E A6 04  ROR ram_04A6
C - - - - - 0x035866 1A:9856: 48        PHA
C - - - - - 0x035867 1A:9857: AD A6 04  LDA ram_04A6
C - - - - - 0x03586A 1A:985A: 69 02     ADC #$02
C - - - - - 0x03586C 1A:985C: 8D A6 04  STA ram_04A6
C - - - - - 0x03586F 1A:985F: 68        PLA
C - - - - - 0x035870 1A:9860: 69 21     ADC #$21
C - - - - - 0x035872 1A:9862: 8D A7 04  STA ram_04A7
C - - - - - 0x035875 1A:9865: A9 80     LDA #$80
C - - - - - 0x035877 1A:9867: 8D 15 05  STA ram_0515
C - - - - - 0x03587A 1A:986A: 60        RTS



sub_986B_обновить_список_игроков_пенальти:
C - - - - - 0x03587B 1A:986B: A9 01     LDA #$01
C - - - - - 0x03587D 1A:986D: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035880 1A:9870: A9 3F     LDA #con_B3CF_3F
C - - - - - 0x035882 1A:9872: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035885 1A:9875: A9 40     LDA #con_B3CF_40
C - - - - - 0x035887 1A:9877: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03588A 1A:987A: 60        RTS



sub_987B:
C - - - - - 0x03588B 1A:987B: A9 37     LDA #con_s_id_37
C - - - - - 0x03588D 1A:987D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035890 1A:9880: A9 00     LDA #$00
C - - - - - 0x035892 1A:9882: 85 11     STA ram_0011
C - - - - - 0x035894 1A:9884: 85 12     STA ram_0012
C - - - - - 0x035896 1A:9886: A9 01     LDA #$01
C - - - - - 0x035898 1A:9888: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_9892_loop:
C - - - - - 0x0358A2 1A:9892: A9 00     LDA #$00
C - - - - - 0x0358A4 1A:9894: 8D 2D 06  STA ram_062D
C - - - - - 0x0358A7 1A:9897: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x03589E 1A:988E: A9 2E     LDA #$2E
C - - - - - 0x0358A0 1A:9890: 85 87     STA ram_0087
C - - - - - 0x0358AA 1A:989A: A9 33     LDA #con_B3CF_33
C - - - - - 0x0358AC 1A:989C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0358AF 1A:989F: A9 04     LDA #$04
C - - - - - 0x0358B1 1A:98A1: 8D 24 06  STA ram_0624
C - - - - - 0x0358B4 1A:98A4: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98A7_loop:
C - - - - - 0x0358B7 1A:98A7: A9 01     LDA #$01
C - - - - - 0x0358B9 1A:98A9: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0358BC 1A:98AC: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - - 0x0358BE 1A:98AE: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0358C1 1A:98B1: F0 0B     BEQ bra_98BE
C - - - - - 0x0358C3 1A:98B3: AD 24 06  LDA ram_0624
C - - - - - 0x0358C6 1A:98B6: 49 40     EOR #$40
C - - - - - 0x0358C8 1A:98B8: 8D 24 06  STA ram_0624
C - - - - - 0x0358CB 1A:98BB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98BE:
C - - - - - 0x0358CE 1A:98BE: 2C 1C 00  BIT ram_btn_hold
; con_btn_A
C - - - - - 0x0358D1 1A:98C1: 10 E4     BPL bra_98A7_loop
C - - - - - 0x0358D3 1A:98C3: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x0358D6 1A:98C6: 2C 24 06  BIT ram_0624
C - - - - - 0x0358D9 1A:98C9: 70 05     BVS bra_98D0
C - - - - - 0x0358DB 1A:98CB: A9 02     LDA #$02
C - - - - - 0x0358DD 1A:98CD: 85 87     STA ram_0087
C - - - - - 0x0358DF 1A:98CF: 60        RTS
bra_98D0:
C - - - - - 0x0358E0 1A:98D0: A9 00     LDA #$00
C - - - - - 0x0358E2 1A:98D2: 8D 24 06  STA ram_0624
loc_98D5:
C D 0 - - - 0x0358E5 1A:98D5: A9 34     LDA #con_B3CF_34
C - - - - - 0x0358E7 1A:98D7: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0358EA 1A:98DA: A9 03     LDA #$03
C - - - - - 0x0358EC 1A:98DC: 8D 3D 06  STA ram_положение_миникарты
C - - - - - 0x0358EF 1A:98DF: 20 66 C5  JSR sub_0x03F023_отрисовка_миникарты
C - - - - - 0x0358F2 1A:98E2: A9 85     LDA #$85
C - - - - - 0x0358F4 1A:98E4: 8D 2D 06  STA ram_062D
C - - - - - 0x0358F7 1A:98E7: AD 24 06  LDA ram_0624
C - - - - - 0x0358FA 1A:98EA: 8D 22 06  STA ram_номер_опции
C - - - - - 0x0358FD 1A:98ED: A9 04     LDA #$04
C - - - - - 0x0358FF 1A:98EF: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035902 1A:98F2: 90 9E     BCC bra_9892_loop
C - - - - - 0x035904 1A:98F4: C9 04     CMP #$04
C - - - - - 0x035906 1A:98F6: F0 9A     BEQ bra_9892_loop
C - - - - - 0x035908 1A:98F8: 8D 24 06  STA ram_0624
C - - - - - 0x03590B 1A:98FB: 20 01 99  JSR sub_9901
C - - - - - 0x03590E 1A:98FE: 4C D5 98  JMP loc_98D5



sub_9901:
C - - - - - 0x035911 1A:9901: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035914 1A:9904: 1A 99     .word ofs_047_991A_00
- D 0 - I - 0x035916 1A:9906: 3A 99     .word ofs_047_993A_01
- D 0 - I - 0x035918 1A:9908: 50 99     .word ofs_047_9950_02
- D 0 - I - 0x03591A 1A:990A: AD 9B     .word ofs_047_9BAD_03



loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
sub_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC55_полностью_очистить_нижнюю_половину_экрана
    JMP loc_990D_нарисовать_будку



sub_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
loc_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
loc_990D_нарисовать_будку:
    LDA #con_B3CF_42
    JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
    RTS



ofs_047_991A_00:
C - - J - - 0x03592A 1A:991A: A9 35     LDA #con_B3CF_35
C - - - - - 0x03592C 1A:991C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03592F 1A:991F: AD 2C 00  LDA ram_расстановка_слева
C - - - - - 0x035932 1A:9922: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035935 1A:9925: AD 2C 00  LDA ram_расстановка_слева
C - - - - - 0x035938 1A:9928: 8D 27 06  STA ram_0627
C - - - - - 0x03593B 1A:992B: A9 05     LDA #$05
C - - - - - 0x03593D 1A:992D: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035940 1A:9930: AE 27 06  LDX ram_0627
C - - - - - 0x035943 1A:9933: 90 01     BCC bra_9936
C - - - - - 0x035945 1A:9935: AA        TAX
bra_9936:
C - - - - - 0x035946 1A:9936: 8E 2C 00  STX ram_расстановка_слева
C - - - - - 0x035949 1A:9939: 60        RTS



ofs_047_993A_01:
C - - J - - 0x03594A 1A:993A: A9 36     LDA #con_B3CF_36
C - - - - - 0x03594C 1A:993C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03594F 1A:993F: AD 2D 00  LDA ram_защита_слева
C - - - - - 0x035952 1A:9942: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035955 1A:9945: A9 06     LDA #$06
C - - - - - 0x035957 1A:9947: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x03595A 1A:994A: 90 03     BCC bra_994F_RTS
C - - - - - 0x03595C 1A:994C: 8D 2D 00  STA ram_защита_слева
bra_994F_RTS:
C - - - - - 0x03595F 1A:994F: 60        RTS



ofs_047_9950_02:
C - - J - - 0x035960 1A:9950: AD 2A 00  LDA ram_твоя_команда
C - - - - - 0x035963 1A:9953: C9 02     CMP #$02
C - - - - - 0x035965 1A:9955: F0 03     BEQ bra_995A
C - - - - - 0x035967 1A:9957: 4C C7 9A  JMP loc_9AC7_swap_positions
bra_995A:
C - - - - - 0x03596A 1A:995A: A9 37     LDA #con_B3CF_37
C - - - - - 0x03596C 1A:995C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03596F 1A:995F: A9 00     LDA #$00
C - - - - - 0x035971 1A:9961: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035974 1A:9964: A9 07     LDA #$07
C - - - - - 0x035976 1A:9966: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035979 1A:9969: B0 01     BCS bra_996C
C - - - - - 0x03597B 1A:996B: 60        RTS
bra_996C:
C - - - - - 0x03597C 1A:996C: 20 72 99  JSR sub_9972
C - - - - - 0x03597F 1A:996F: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой



sub_9972:
C - - - - - 0x035982 1A:9972: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035985 1A:9975: 79 99     .word ofs_048_9979_00_swap_players
- D 0 - I - 0x035987 1A:9977: C7 9A     .word ofs_048_9AC7_01_swap_positions



loc_9979_swap_players:
ofs_048_9979_00_swap_players:
C D 0 J - - 0x035989 1A:9979: AD 50 04  LDA ram_счетчик_замен
C - - - - - 0x03598C 1A:997C: C9 03     CMP #$03
C - - - - - 0x03598E 1A:997E: 90 12     BCC bra_9992_лимит_замен_еще_не_исчерпан
C - - - - - 0x035990 1A:9980: A9 38     LDA #con_B3CF_38
C - - - - - 0x035992 1A:9982: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9985_loop:
C - - - - - 0x035995 1A:9985: A9 01     LDA #$01
C - - - - - 0x035997 1A:9987: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03599A 1A:998A: A9 C0     LDA #con_btn_B + con_btn_A
C - - - - - 0x03599C 1A:998C: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03599F 1A:998F: F0 F4     BEQ bra_9985_loop
C - - - - - 0x0359A1 1A:9991: 60        RTS
bra_9992_лимит_замен_еще_не_исчерпан:
C - - - - - 0x0359A2 1A:9992: A9 00     LDA #$00
C - - - - - 0x0359A4 1A:9994: 8D 2D 06  STA ram_062D
C - - - - - 0x0359A7 1A:9997: A9 3A     LDA #con_B3CF_3A
C - - - - - 0x0359A9 1A:9999: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0359AC 1A:999C: A9 00     LDA #$00
bra_999E_loop:
C - - - - - 0x0359AE 1A:999E: 48        PHA
C - - - - - 0x0359AF 1A:999F: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359B2 1A:99A2: 90 09     BCC bra_99AD
C - - - - - 0x0359B4 1A:99A4: 68        PLA
C - - - - - 0x0359B5 1A:99A5: 48        PHA
C - - - - - 0x0359B6 1A:99A6: A0 2C     LDY #$2C
C - - - - - 0x0359B8 1A:99A8: A2 B2     LDX #$B2
C - - - - - 0x0359BA 1A:99AA: 20 41 9F  JSR sub_9F41_позиция_курсора_при_замене_основного_состава
bra_99AD:
C - - - - - 0x0359BD 1A:99AD: 68        PLA
C - - - - - 0x0359BE 1A:99AE: 18        CLC
C - - - - - 0x0359BF 1A:99AF: 69 01     ADC #$01
C - - - - - 0x0359C1 1A:99B1: C9 0A     CMP #$0A
C - - - - - 0x0359C3 1A:99B3: D0 E9     BNE bra_999E_loop
C - - - - - 0x0359C5 1A:99B5: A9 00     LDA #$00
bra_99B7_loop:
C - - - - - 0x0359C7 1A:99B7: 48        PHA
C - - - - - 0x0359C8 1A:99B8: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359CB 1A:99BB: 68        PLA
C - - - - - 0x0359CC 1A:99BC: 90 07     BCC bra_99C5
C - - - - - 0x0359CE 1A:99BE: 18        CLC
C - - - - - 0x0359CF 1A:99BF: 69 01     ADC #$01
C - - - - - 0x0359D1 1A:99C1: C9 0A     CMP #$0A
C - - - - - 0x0359D3 1A:99C3: D0 F2     BNE bra_99B7_loop
bra_99C5:
C - - - - - 0x0359D5 1A:99C5: 8D 25 06  STA ram_0625
C - - - - - 0x0359D8 1A:99C8: A0 2C     LDY #$2C
C - - - - - 0x0359DA 1A:99CA: 20 37 9F  JSR sub_9F37
bra_99CD_loop:
C - - - - - 0x0359DD 1A:99CD: A9 01     LDA #$01
C - - - - - 0x0359DF 1A:99CF: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0359E2 1A:99D2: AD 25 06  LDA ram_0625
C - - - - - 0x0359E5 1A:99D5: 20 90 9B  JSR sub_9B90
C - - - - - 0x0359E8 1A:99D8: 90 24     BCC bra_99FE
loc_99DA:
C - - - - - 0x0359EA 1A:99DA: BD 0F 9F  LDA tbl_9F0F_изменение_позиции_курсора_запасных_игроков,X
C - - - - - 0x0359ED 1A:99DD: 48        PHA
C - - - - - 0x0359EE 1A:99DE: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359F1 1A:99E1: 68        PLA
C - - - - - 0x0359F2 1A:99E2: 90 08     BCC bra_99EC
- - - - - - 0x0359F4 1A:99E4: A6 3A     LDX ram_003A
- - - - - - 0x0359F6 1A:99E6: 20 A4 9B  JSR sub_9BA4
- - - - - - 0x0359F9 1A:99E9: 4C DA 99  JMP loc_99DA
bra_99EC:
C - - - - - 0x0359FC 1A:99EC: 48        PHA
C - - - - - 0x0359FD 1A:99ED: AD 25 06  LDA ram_0625
C - - - - - 0x035A00 1A:99F0: A0 2C     LDY #$2C
C - - - - - 0x035A02 1A:99F2: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035A05 1A:99F5: 68        PLA
C - - - - - 0x035A06 1A:99F6: 8D 25 06  STA ram_0625
C - - - - - 0x035A09 1A:99F9: A0 2C     LDY #$2C
C - - - - - 0x035A0B 1A:99FB: 20 37 9F  JSR sub_9F37
bra_99FE:
C - - - - - 0x035A0E 1A:99FE: A9 80     LDA #con_btn_A
C - - - - - 0x035A10 1A:9A00: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A13 1A:9A03: D0 08     BNE bra_9A0D
C - - - - - 0x035A15 1A:9A05: A9 40     LDA #con_btn_B
C - - - - - 0x035A17 1A:9A07: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A1A 1A:9A0A: F0 C1     BEQ bra_99CD_loop
C - - - - - 0x035A1C 1A:9A0C: 60        RTS
bra_9A0D:
C - - - - - 0x035A1D 1A:9A0D: A9 3B     LDA #con_B3CF_3B
C - - - - - 0x035A1F 1A:9A0F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035A22 1A:9A12: A9 01     LDA #$01
C - - - - - 0x035A24 1A:9A14: AE 25 06  LDX ram_0625
C - - - - - 0x035A27 1A:9A17: E0 08     CPX #$08
C - - - - - 0x035A29 1A:9A19: 90 02     BCC bra_9A1D
C - - - - - 0x035A2B 1A:9A1B: A9 00     LDA #$00
bra_9A1D:
C - - - - - 0x035A2D 1A:9A1D: 8D 26 06  STA ram_0626
C - - - - - 0x035A30 1A:9A20: A0 16     LDY #$16
C - - - - - 0x035A32 1A:9A22: 20 37 9F  JSR sub_9F37
bra_9A25_loop:
C - - - - - 0x035A35 1A:9A25: A9 01     LDA #$01
C - - - - - 0x035A37 1A:9A27: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035A3A 1A:9A2A: AD 26 06  LDA ram_0626
C - - - - - 0x035A3D 1A:9A2D: F0 1A     BEQ bra_9A49
C - - - - - 0x035A3F 1A:9A2F: 20 90 9B  JSR sub_9B90
C - - - - - 0x035A42 1A:9A32: 90 15     BCC bra_9A49
C - - - - - 0x035A44 1A:9A34: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035A47 1A:9A37: 48        PHA
C - - - - - 0x035A48 1A:9A38: AD 26 06  LDA ram_0626
C - - - - - 0x035A4B 1A:9A3B: A0 16     LDY #$16
C - - - - - 0x035A4D 1A:9A3D: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035A50 1A:9A40: 68        PLA
C - - - - - 0x035A51 1A:9A41: 8D 26 06  STA ram_0626
C - - - - - 0x035A54 1A:9A44: A0 16     LDY #$16
C - - - - - 0x035A56 1A:9A46: 20 37 9F  JSR sub_9F37
bra_9A49:
C - - - - - 0x035A59 1A:9A49: A9 40     LDA #con_btn_B
C - - - - - 0x035A5B 1A:9A4B: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A5E 1A:9A4E: F0 03     BEQ bra_9A53
C - - - - - 0x035A60 1A:9A50: 4C 79 99  JMP loc_9979_swap_players
bra_9A53:
C - - - - - 0x035A63 1A:9A53: A9 80     LDA #con_btn_A
C - - - - - 0x035A65 1A:9A55: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A68 1A:9A58: F0 CB     BEQ bra_9A25_loop
C - - - - - 0x035A6A 1A:9A5A: AD 25 06  LDA ram_0625
C - - - - - 0x035A6D 1A:9A5D: 18        CLC
C - - - - - 0x035A6E 1A:9A5E: 69 16     ADC #$16
C - - - - - 0x035A70 1A:9A60: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035A73 1A:9A63: A5 34     LDA ram_plr_data
C - - - - - 0x035A75 1A:9A65: 85 3A     STA ram_003A
C - - - - - 0x035A77 1A:9A67: A5 35     LDA ram_plr_data + $01
C - - - - - 0x035A79 1A:9A69: 85 3B     STA ram_003B
C - - - - - 0x035A7B 1A:9A6B: AD 26 06  LDA ram_0626
C - - - - - 0x035A7E 1A:9A6E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035A81 1A:9A71: A0 00     LDY #$00
; con_plr_id
; con_plr_guts_lo
; con_plr_guts_hi
; con_plr_lvl
bra_9A73_копирование_между_адресами:
C - - - - - 0x035A83 1A:9A73: B1 3A     LDA (ram_003A),Y
C - - - - - 0x035A85 1A:9A75: AA        TAX
C - - - - - 0x035A86 1A:9A76: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x035A88 1A:9A78: 91 3A     STA (ram_003A),Y
C - - - - - 0x035A8A 1A:9A7A: 8A        TXA
C - - - - - 0x035A8B 1A:9A7B: 91 34     STA (ram_plr_data),Y
C - - - - - 0x035A8D 1A:9A7D: C8        INY
C - - - - - 0x035A8E 1A:9A7E: C0 04     CPY #$04
C - - - - - 0x035A90 1A:9A80: D0 F1     BNE bra_9A73_копирование_между_адресами
C - - - - - 0x035A92 1A:9A82: A0 00     LDY #$00
C - - - - - 0x035A94 1A:9A84: B1 3A     LDA (ram_003A),Y
C - - - - - 0x035A96 1A:9A86: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035A99 1A:9A89: 9D 51 04  STA ram_забаненный_игрок,X
C - - - - - 0x035A9C 1A:9A8C: E8        INX
C - - - - - 0x035A9D 1A:9A8D: 8E 50 04  STX ram_счетчик_замен
C - - - - - 0x035AA0 1A:9A90: A9 3B     LDA #con_B3CF_3B
C - - - - - 0x035AA2 1A:9A92: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9A95_loop:
C - - - - - 0x035AA5 1A:9A95: A9 01     LDA #$01
C - - - - - 0x035AA7 1A:9A97: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035AAA 1A:9A9A: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035AAD 1A:9A9D: 29 C0     AND #con_btn_B + con_btn_A
C - - - - - 0x035AAF 1A:9A9F: F0 F4     BEQ bra_9A95_loop
C - - - - - 0x035AB1 1A:9AA1: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035AB4 1A:9AA4: E0 03     CPX #$03
C - - - - - 0x035AB6 1A:9AA6: B0 03     BCS bra_9AAB_RTS
C - - - - - 0x035AB8 1A:9AA8: 4C 79 99  JMP loc_9979_swap_players
bra_9AAB_RTS:
C - - - - - 0x035ABB 1A:9AAB: 60        RTS



sub_9AAC:
C - - - - - 0x035ABC 1A:9AAC: 18        CLC
C - - - - - 0x035ABD 1A:9AAD: 69 16     ADC #$16
C - - - - - 0x035ABF 1A:9AAF: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035AC2 1A:9AB2: A0 00     LDY #con_plr_id
C - - - - - 0x035AC4 1A:9AB4: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x035AC6 1A:9AB6: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035AC9 1A:9AB9: F0 0A     BEQ bra_9AC5
bra_9ABB_loop:
C - - - - - 0x035ACB 1A:9ABB: DD 50 04  CMP ram_забаненный_игрок - $01,X
C - - - - - 0x035ACE 1A:9ABE: D0 02     BNE bra_9AC2
C - - - - - 0x035AD0 1A:9AC0: 38        SEC
C - - - - - 0x035AD1 1A:9AC1: 60        RTS
bra_9AC2:
C - - - - - 0x035AD2 1A:9AC2: CA        DEX
C - - - - - 0x035AD3 1A:9AC3: D0 F6     BNE bra_9ABB_loop
bra_9AC5:
C - - - - - 0x035AD5 1A:9AC5: 18        CLC
C - - - - - 0x035AD6 1A:9AC6: 60        RTS



loc_9AC7_swap_positions:
ofs_048_9AC7_01_swap_positions:
C D 0 - - - 0x035AD7 1A:9AC7: A9 00     LDA #$00
C - - - - - 0x035AD9 1A:9AC9: 8D 2D 06  STA ram_062D
C - - - - - 0x035ADC 1A:9ACC: A9 39     LDA #con_B3CF_39
C - - - - - 0x035ADE 1A:9ACE: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035AE1 1A:9AD1: A9 01     LDA #$01
C - - - - - 0x035AE3 1A:9AD3: 8D 25 06  STA ram_0625
C - - - - - 0x035AE6 1A:9AD6: A0 16     LDY #$16
C - - - - - 0x035AE8 1A:9AD8: 20 37 9F  JSR sub_9F37
loc_9ADB:
bra_9ADB_B_не_нажата:
C D 0 - - - 0x035AEB 1A:9ADB: A9 01     LDA #$01
C - - - - - 0x035AED 1A:9ADD: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035AF0 1A:9AE0: AD 25 06  LDA ram_0625
C - - - - - 0x035AF3 1A:9AE3: 20 90 9B  JSR sub_9B90
C - - - - - 0x035AF6 1A:9AE6: 90 15     BCC bra_9AFD
C - - - - - 0x035AF8 1A:9AE8: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035AFB 1A:9AEB: 48        PHA
C - - - - - 0x035AFC 1A:9AEC: AD 25 06  LDA ram_0625
C - - - - - 0x035AFF 1A:9AEF: A0 16     LDY #$16
C - - - - - 0x035B01 1A:9AF1: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B04 1A:9AF4: 68        PLA
C - - - - - 0x035B05 1A:9AF5: 8D 25 06  STA ram_0625
C - - - - - 0x035B08 1A:9AF8: A0 16     LDY #$16
C - - - - - 0x035B0A 1A:9AFA: 20 37 9F  JSR sub_9F37
bra_9AFD:
C - - - - - 0x035B0D 1A:9AFD: A9 80     LDA #con_btn_A
C - - - - - 0x035B0F 1A:9AFF: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B12 1A:9B02: D0 0B     BNE bra_9B0F_нажата_A
C - - - - - 0x035B14 1A:9B04: A9 40     LDA #con_btn_B
C - - - - - 0x035B16 1A:9B06: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B19 1A:9B09: F0 D0     BEQ bra_9ADB_B_не_нажата
                                        LDA ram_твоя_команда
                                        CMP #$02
                                        BEQ @пропустить_затирание     ; иначе потом повторно будет затирание
C - - - - - 0x035B1B 1A:9B0B: 20 0C 99  JSR sub_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой
@пропустить_затирание:
C - - - - - 0x035B1E 1A:9B0E: 60        RTS
bra_9B0F_нажата_A:
C - - - - - 0x035B1F 1A:9B0F: A9 01     LDA #$01
C - - - - - 0x035B21 1A:9B11: CD 25 06  CMP ram_0625
C - - - - - 0x035B24 1A:9B14: D0 02     BNE bra_9B18
C - - - - - 0x035B26 1A:9B16: A9 02     LDA #$02
bra_9B18:
C - - - - - 0x035B28 1A:9B18: 8D 26 06  STA ram_0626
C - - - - - 0x035B2B 1A:9B1B: A0 16     LDY #$16
C - - - - - 0x035B2D 1A:9B1D: 20 37 9F  JSR sub_9F37
bra_9B20_loop:
C - - - - - 0x035B30 1A:9B20: A9 01     LDA #$01
C - - - - - 0x035B32 1A:9B22: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035B35 1A:9B25: AD 26 06  LDA ram_0626
C - - - - - 0x035B38 1A:9B28: 20 90 9B  JSR sub_9B90
C - - - - - 0x035B3B 1A:9B2B: 90 22     BCC bra_9B4F
C - - - - - 0x035B3D 1A:9B2D: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035B40 1A:9B30: CD 25 06  CMP ram_0625
C - - - - - 0x035B43 1A:9B33: D0 08     BNE bra_9B3D
C - - - - - 0x035B45 1A:9B35: A6 3A     LDX ram_003A
C - - - - - 0x035B47 1A:9B37: 20 A4 9B  JSR sub_9BA4
C - - - - - 0x035B4A 1A:9B3A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
bra_9B3D:
C - - - - - 0x035B4D 1A:9B3D: 48        PHA
C - - - - - 0x035B4E 1A:9B3E: AD 26 06  LDA ram_0626
C - - - - - 0x035B51 1A:9B41: A0 16     LDY #$16
C - - - - - 0x035B53 1A:9B43: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B56 1A:9B46: 68        PLA
C - - - - - 0x035B57 1A:9B47: 8D 26 06  STA ram_0626
C - - - - - 0x035B5A 1A:9B4A: A0 16     LDY #$16
C - - - - - 0x035B5C 1A:9B4C: 20 37 9F  JSR sub_9F37
bra_9B4F:
C - - - - - 0x035B5F 1A:9B4F: A9 80     LDA #con_btn_A
C - - - - - 0x035B61 1A:9B51: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B64 1A:9B54: D0 12     BNE bra_9B68
C - - - - - 0x035B66 1A:9B56: A9 40     LDA #con_btn_B
C - - - - - 0x035B68 1A:9B58: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B6B 1A:9B5B: F0 C3     BEQ bra_9B20_loop
C - - - - - 0x035B6D 1A:9B5D: AD 26 06  LDA ram_0626
C - - - - - 0x035B70 1A:9B60: A0 16     LDY #$16
C - - - - - 0x035B72 1A:9B62: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B75 1A:9B65: 4C DB 9A  JMP loc_9ADB
bra_9B68:
C - - - - - 0x035B78 1A:9B68: AD 25 06  LDA ram_0625
C - - - - - 0x035B7B 1A:9B6B: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035B7E 1A:9B6E: A5 34     LDA ram_plr_data
C - - - - - 0x035B80 1A:9B70: 85 3A     STA ram_003A
C - - - - - 0x035B82 1A:9B72: A5 35     LDA ram_plr_data + $01
C - - - - - 0x035B84 1A:9B74: 85 3B     STA ram_003B
C - - - - - 0x035B86 1A:9B76: AD 26 06  LDA ram_0626
C - - - - - 0x035B89 1A:9B79: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035B8C 1A:9B7C: A0 00     LDY #$00
; con_plr_id
; con_plr_guts_lo
; con_plr_guts_hi
; con_plr_lvl
bra_9B7E_копирование_между_адресами:
C - - - - - 0x035B8E 1A:9B7E: B1 3A     LDA (ram_003A),Y
C - - - - - 0x035B90 1A:9B80: AA        TAX
C - - - - - 0x035B91 1A:9B81: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x035B93 1A:9B83: 91 3A     STA (ram_003A),Y
C - - - - - 0x035B95 1A:9B85: 8A        TXA
C - - - - - 0x035B96 1A:9B86: 91 34     STA (ram_plr_data),Y
C - - - - - 0x035B98 1A:9B88: C8        INY
C - - - - - 0x035B99 1A:9B89: C0 04     CPY #$04
C - - - - - 0x035B9B 1A:9B8B: D0 F1     BNE bra_9B7E_копирование_между_адресами
C - - - - - 0x035B9D 1A:9B8D: 4C C7 9A  JMP loc_9AC7_swap_positions



sub_9B90:
C - - - - - 0x035BA0 1A:9B90: 48        PHA
C - - - - - 0x035BA1 1A:9B91: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035BA3 1A:9B93: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BA6 1A:9B96: D0 03     BNE bra_9B9B
C - - - - - 0x035BA8 1A:9B98: 68        PLA
C - - - - - 0x035BA9 1A:9B99: 18        CLC
C - - - - - 0x035BAA 1A:9B9A: 60        RTS
bra_9B9B:
C - - - - - 0x035BAB 1A:9B9B: A2 00     LDX #$00
bra_9B9D_loop:
C - - - - - 0x035BAD 1A:9B9D: 4A        LSR
C - - - - - 0x035BAE 1A:9B9E: B0 03     BCS bra_9BA3
C - - - - - 0x035BB0 1A:9BA0: E8        INX
C - - - - - 0x035BB1 1A:9BA1: D0 FA     BNE bra_9B9D_loop
bra_9BA3:
C - - - - - 0x035BB3 1A:9BA3: 68        PLA
sub_9BA4:
C - - - - - 0x035BB4 1A:9BA4: 86 3A     STX ram_003A
C - - - - - 0x035BB6 1A:9BA6: 0A        ASL
C - - - - - 0x035BB7 1A:9BA7: 0A        ASL
C - - - - - 0x035BB8 1A:9BA8: 65 3A     ADC ram_003A
C - - - - - 0x035BBA 1A:9BAA: AA        TAX
C - - - - - 0x035BBB 1A:9BAB: 38        SEC
C - - - - - 0x035BBC 1A:9BAC: 60        RTS



ofs_047_9BAD_03:
bra_9BAD_loop:
C - - J - - 0x035BBD 1A:9BAD: A9 00     LDA #$00
C - - - - - 0x035BBF 1A:9BAF: 8D 2D 06  STA ram_062D
C - - - - - 0x035BC2 1A:9BB2: A9 3C     LDA #con_B3CF_3C
C - - - - - 0x035BC4 1A:9BB4: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BB7_loop:
C - - - - - 0x035BC7 1A:9BB7: A9 01     LDA #$01
C - - - - - 0x035BC9 1A:9BB9: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035BCC 1A:9BBC: A9 80     LDA #con_btn_A
C - - - - - 0x035BCE 1A:9BBE: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BD1 1A:9BC1: D0 09     BNE bra_9BCC
C - - - - - 0x035BD3 1A:9BC3: A9 40     LDA #con_btn_B
C - - - - - 0x035BD5 1A:9BC5: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BD8 1A:9BC8: D0 21     BNE bra_9BEB
C - - - - - 0x035BDA 1A:9BCA: F0 EB     BEQ bra_9BB7_loop    ; jmp
bra_9BCC:
C - - - - - 0x035BDC 1A:9BCC: AD 2A 00  LDA ram_твоя_команда
C - - - - - 0x035BDF 1A:9BCF: C9 02     CMP #$02
C - - - - - 0x035BE1 1A:9BD1: D0 18     BNE bra_9BEB
C - - - - - 0x035BE3 1A:9BD3: A9 3D     LDA #con_B3CF_3D
C - - - - - 0x035BE5 1A:9BD5: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BD8_loop:
C - - - - - 0x035BE8 1A:9BD8: A9 01     LDA #$01
C - - - - - 0x035BEA 1A:9BDA: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035BED 1A:9BDD: A9 40     LDA #con_btn_B
C - - - - - 0x035BEF 1A:9BDF: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BF2 1A:9BE2: D0 C9     BNE bra_9BAD_loop
C - - - - - 0x035BF4 1A:9BE4: A9 80     LDA #con_btn_A
C - - - - - 0x035BF6 1A:9BE6: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BF9 1A:9BE9: F0 ED     BEQ bra_9BD8_loop
bra_9BEB:
C - - - - - 0x035BFB 1A:9BEB: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой



sub_9BEE:
; предположительно связано с ограничением/фиксированной записью координат игрока
; в зависимости от его позиции или типа того
C - - - - - 0x035BFE 1A:9BEE: C9 FF     CMP #$FF
C - - - - - 0x035C00 1A:9BF0: F0 1C     BEQ bra_9C0E_RTS
; 00-FE
C - - - - - 0x035C02 1A:9BF2: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x035C05 1A:9BF5: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035C08 1A:9BF8: F0 0A     BEQ bra_9C04_мяч_у_команды_слева
; if мяч у комады справа
C - - - - - 0x035C0A 1A:9BFA: 98        TYA
C - - - - - 0x035C0B 1A:9BFB: 49 FF     EOR #$FF
C - - - - - 0x035C0D 1A:9BFD: A8        TAY
C - - - - - 0x035C0E 1A:9BFE: 8A        TXA
C - - - - - 0x035C0F 1A:9BFF: 49 FF     EOR #$FF
C - - - - - 0x035C11 1A:9C01: AA        TAX
C - - - - - 0x035C12 1A:9C02: C8        INY
C - - - - - 0x035C13 1A:9C03: E8        INX
bra_9C04_мяч_у_команды_слева:
C - - - - - 0x035C14 1A:9C04: 98        TYA
C - - - - - 0x035C15 1A:9C05: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035C17 1A:9C07: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035C19 1A:9C09: 8A        TXA
C - - - - - 0x035C1A 1A:9C0A: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035C1C 1A:9C0C: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
bra_9C0E_RTS:
C - - - - - 0x035C1E 1A:9C0E: 60        RTS



sub_9C0F_перемещение_игроков:
C - - - - - 0x035C1F 1A:9C0F: AD FC 05  LDA ram_принимающий
C - - - - - 0x035C22 1A:9C12: 8D 26 06  STA ram_0626
C - - - - - 0x035C25 1A:9C15: 20 1F 9C  JSR sub_9C1F_перемещение_игроков
C - - - - - 0x035C28 1A:9C18: AD 26 06  LDA ram_0626
C - - - - - 0x035C2B 1A:9C1B: 8D FC 05  STA ram_принимающий
C - - - - - 0x035C2E 1A:9C1E: 60        RTS



sub_9C1F_перемещение_игроков:
C - - - - - 0x035C2F 1A:9C1F: A9 28     LDA #con_B3CF_28
C - - - - - 0x035C31 1A:9C21: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035C34 1A:9C24: A9 00     LDA #$00
C - - - - - 0x035C36 1A:9C26: 8D 24 06  STA ram_0624
C - - - - - 0x035C39 1A:9C29: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C2C_ожидание_нажатия_A:
C - - - - - 0x035C3C 1A:9C2C: A9 01     LDA #$01
C - - - - - 0x035C3E 1A:9C2E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035C41 1A:9C31: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - - 0x035C43 1A:9C33: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C46 1A:9C36: F0 0B     BEQ bra_9C43_кнопки_не_нажаты
C - - - - - 0x035C48 1A:9C38: AD 24 06  LDA ram_0624
C - - - - - 0x035C4B 1A:9C3B: 49 40     EOR #$40
C - - - - - 0x035C4D 1A:9C3D: 8D 24 06  STA ram_0624
C - - - - - 0x035C50 1A:9C40: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C43_кнопки_не_нажаты:
C - - - - - 0x035C53 1A:9C43: A9 40     LDA #con_btn_B
C - - - - - 0x035C55 1A:9C45: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C58 1A:9C48: F0 02     BEQ bra_9C4C_B_не_нажата
C - - - - - 0x035C5A 1A:9C4A: 18        CLC
C - - - - - 0x035C5B 1A:9C4B: 60        RTS
bra_9C4C_B_не_нажата:
C - - - - - 0x035C5C 1A:9C4C: A9 80     LDA #con_btn_A
C - - - - - 0x035C5E 1A:9C4E: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C61 1A:9C51: F0 D9     BEQ bra_9C2C_ожидание_нажатия_A
C - - - - - 0x035C63 1A:9C53: 2C 24 06  BIT ram_0624
C - - - - - 0x035C66 1A:9C56: 70 02     BVS bra_9C5A
C - - - - - 0x035C68 1A:9C58: 38        SEC
C - - - - - 0x035C69 1A:9C59: 60        RTS
bra_9C5A:
C - - - - - 0x035C6A 1A:9C5A: A9 38     LDA #con_s_id_38
C - - - - - 0x035C6C 1A:9C5C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035C6F 1A:9C5F: A9 29     LDA #con_B3CF_29
C - - - - - 0x035C71 1A:9C61: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035C74 1A:9C64: A9 01     LDA #$01
C - - - - - 0x035C76 1A:9C66: 8D 25 06  STA ram_0625
C - - - - - 0x035C79 1A:9C69: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035C7C 1A:9C6C: AD FE 05  LDA ram_05FE
C - - - - - 0x035C7F 1A:9C6F: 8D 24 06  STA ram_0624
loc_9C72_loop:
bra_9C72_ожидание_нажатия_A:
C D 0 - - - 0x035C82 1A:9C72: A9 01     LDA #$01
C - - - - - 0x035C84 1A:9C74: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035C87 1A:9C77: A9 84     LDA #$84
C - - - - - 0x035C89 1A:9C79: 8D 2D 06  STA ram_062D
C - - - - - 0x035C8C 1A:9C7C: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - - 0x035C8E 1A:9C7E: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C91 1A:9C81: F0 0B     BEQ bra_9C8E
C - - - - - 0x035C93 1A:9C83: AD 25 06  LDA ram_0625
C - - - - - 0x035C96 1A:9C86: 49 40     EOR #$40
C - - - - - 0x035C98 1A:9C88: 8D 25 06  STA ram_0625
C - - - - - 0x035C9B 1A:9C8B: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C8E:
C - - - - - 0x035C9E 1A:9C8E: A9 80     LDA #con_btn_A
C - - - - - 0x035CA0 1A:9C90: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CA3 1A:9C93: F0 DD     BEQ bra_9C72_ожидание_нажатия_A
C - - - - - 0x035CA5 1A:9C95: 2C 25 06  BIT ram_0625
C - - - - - 0x035CA8 1A:9C98: 50 07     BVC bra_9CA1
C - - - - - 0x035CAA 1A:9C9A: A9 00     LDA #$00
C - - - - - 0x035CAC 1A:9C9C: 8D 2D 06  STA ram_062D
C - - - - - 0x035CAF 1A:9C9F: 38        SEC
C - - - - - 0x035CB0 1A:9CA0: 60        RTS
bra_9CA1:
C - - - - - 0x035CB1 1A:9CA1: A9 81     LDA #$81
C - - - - - 0x035CB3 1A:9CA3: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035CB6 1A:9CA6: A9 81     LDA #$81
C - - - - - 0x035CB8 1A:9CA8: 8D 2D 06  STA ram_062D
C - - - - - 0x035CBB 1A:9CAB: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
loc_9CAE_loop:
bra_9CAE_loop:
C D 0 - - - 0x035CBE 1A:9CAE: A9 01     LDA #$01
C - - - - - 0x035CC0 1A:9CB0: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035CC3 1A:9CB3: 20 9B 9D  JSR sub_9D9B
C - - - - - 0x035CC6 1A:9CB6: CD 24 06  CMP ram_0624
C - - - - - 0x035CC9 1A:9CB9: 8D 24 06  STA ram_0624
C - - - - - 0x035CCC 1A:9CBC: F0 03     BEQ bra_9CC1
C - - - - - 0x035CCE 1A:9CBE: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
bra_9CC1:
C - - - - - 0x035CD1 1A:9CC1: A9 40     LDA #con_btn_B
C - - - - - 0x035CD3 1A:9CC3: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CD6 1A:9CC6: F0 09     BEQ bra_9CD1_B_не_нажата
C - - - - - 0x035CD8 1A:9CC8: AD 25 06  LDA ram_0625
C - - - - - 0x035CDB 1A:9CCB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035CDE 1A:9CCE: 4C 72 9C  JMP loc_9C72_loop
bra_9CD1_B_не_нажата:
C - - - - - 0x035CE1 1A:9CD1: A9 80     LDA #con_btn_A
C - - - - - 0x035CE3 1A:9CD3: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CE6 1A:9CD6: F0 D6     BEQ bra_9CAE_loop
C - - - - - 0x035CE8 1A:9CD8: AD FC 05  LDA ram_принимающий
C - - - - - 0x035CEB 1A:9CDB: C9 FF     CMP #$FF
C - - - - - 0x035CED 1A:9CDD: F0 CF     BEQ bra_9CAE_loop
C - - - - - 0x035CEF 1A:9CDF: AD 24 06  LDA ram_0624
C - - - - - 0x035CF2 1A:9CE2: 8D 16 06  STA ram_индекс_защитника
bra_9CE5_ожидание_нажатия_A:
C - - - - - 0x035CF5 1A:9CE5: A9 01     LDA #$01
C - - - - - 0x035CF7 1A:9CE7: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035CFA 1A:9CEA: 20 9B 9D  JSR sub_9D9B
C - - - - - 0x035CFD 1A:9CED: CD 24 06  CMP ram_0624
C - - - - - 0x035D00 1A:9CF0: 8D 24 06  STA ram_0624
C - - - - - 0x035D03 1A:9CF3: F0 03     BEQ bra_9CF8
C - - - - - 0x035D05 1A:9CF5: 20 BD 9D  JSR sub_9DBD
bra_9CF8:
C - - - - - 0x035D08 1A:9CF8: A9 40     LDA #con_btn_B
C - - - - - 0x035D0A 1A:9CFA: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035D0D 1A:9CFD: F0 0C     BEQ bra_9D0B_B_не_нажата
C - - - - - 0x035D0F 1A:9CFF: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x035D12 1A:9D02: 8D 24 06  STA ram_0624
C - - - - - 0x035D15 1A:9D05: 20 BD 9D  JSR sub_9DBD
C - - - - - 0x035D18 1A:9D08: 4C AE 9C  JMP loc_9CAE_loop
bra_9D0B_B_не_нажата:
C - - - - - 0x035D1B 1A:9D0B: A9 80     LDA #con_btn_A
C - - - - - 0x035D1D 1A:9D0D: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035D20 1A:9D10: F0 D3     BEQ bra_9CE5_ожидание_нажатия_A
C - - - - - 0x035D22 1A:9D12: AD 25 06  LDA ram_0625
C - - - - - 0x035D25 1A:9D15: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035D28 1A:9D18: 4C 72 9C  JMP loc_9C72_loop



sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча:
C - - - - - 0x035D2B 1A:9D1B: 48        PHA
bra_9D1C_ожидание_освобождения_буфера:
C - - - - - 0x035D2C 1A:9D1C: A9 01     LDA #$01
C - - - - - 0x035D2E 1A:9D1E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035D31 1A:9D21: AD 15 05  LDA ram_0515
C - - - - - 0x035D34 1A:9D24: D0 F6     BNE bra_9D1C_ожидание_освобождения_буфера
C - - - - - 0x035D36 1A:9D26: A9 01     LDA #$01
C - - - - - 0x035D38 1A:9D28: 8D 15 05  STA ram_0515
C - - - - - 0x035D3B 1A:9D2B: 68        PLA
C - - - - - 0x035D3C 1A:9D2C: 8D A5 04  STA ram_04A5
C - - - - - 0x035D3F 1A:9D2F: 29 0F     AND #$0F
C - - - - - 0x035D41 1A:9D31: 0A        ASL
C - - - - - 0x035D42 1A:9D32: 0A        ASL
C - - - - - 0x035D43 1A:9D33: AA        TAX
C - - - - - 0x035D44 1A:9D34: BD 82 9D  LDA tbl_9D82_адрес_ppu_курсора,X
C - - - - - 0x035D47 1A:9D37: 8D A6 04  STA ram_04A6
C - - - - - 0x035D4A 1A:9D3A: BD 83 9D  LDA tbl_9D82_адрес_ppu_курсора + $01,X
C - - - - - 0x035D4D 1A:9D3D: 8D A7 04  STA ram_04A7
C - - - - - 0x035D50 1A:9D40: BD 84 9D  LDA tbl_9D82_адрес_ppu_курсора + $02,X
C - - - - - 0x035D53 1A:9D43: 8D AA 04  STA ram_04AA
C - - - - - 0x035D56 1A:9D46: BD 85 9D  LDA tbl_9D82_адрес_ppu_курсора + $03,X
C - - - - - 0x035D59 1A:9D49: 8D AB 04  STA ram_04AB
C - - - - - 0x035D5C 1A:9D4C: AD A5 04  LDA ram_04A5
C - - - - - 0x035D5F 1A:9D4F: 29 0F     AND #$0F
C - - - - - 0x035D61 1A:9D51: AA        TAX
C - - - - - 0x035D62 1A:9D52: A9 00     LDA #$00
C - - - - - 0x035D64 1A:9D54: 2C A5 04  BIT ram_04A5
C - - - - - 0x035D67 1A:9D57: 30 05     BMI bra_9D5E
C - - - - - 0x035D69 1A:9D59: 70 03     BVS bra_9D5E
C - - - - - 0x035D6B 1A:9D5B: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D5E:
C - - - - - 0x035D6E 1A:9D5E: 8D A8 04  STA ram_04A8
C - - - - - 0x035D71 1A:9D61: A9 00     LDA #$00
C - - - - - 0x035D73 1A:9D63: 2C A5 04  BIT ram_04A5
C - - - - - 0x035D76 1A:9D66: 30 05     BMI bra_9D6D
C - - - - - 0x035D78 1A:9D68: 50 03     BVC bra_9D6D
C - - - - - 0x035D7A 1A:9D6A: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D6D:
C - - - - - 0x035D7D 1A:9D6D: 8D AC 04  STA ram_04AC
C - - - - - 0x035D80 1A:9D70: A2 01     LDX #$01
C - - - - - 0x035D82 1A:9D72: 8E A5 04  STX ram_04A5
C - - - - - 0x035D85 1A:9D75: 8E A9 04  STX ram_04A9
C - - - - - 0x035D88 1A:9D78: CA        DEX ; 00
C - - - - - 0x035D89 1A:9D79: 8E AD 04  STX ram_04AD
C - - - - - 0x035D8C 1A:9D7C: A9 80     LDA #$80
C - - - - - 0x035D8E 1A:9D7E: 8D 15 05  STA ram_0515
C - - - - - 0x035D91 1A:9D81: 60        RTS



tbl_9D82_адрес_ppu_курсора:
    .word $22ED, $232D      ; rearrange players no/yes
    .word $2288, $22C8      ; rearrange select/done
    .word $2288, $22C8      ; aim left/right
    .word $228A, $22CA      ; wall left/right
    .word $2289, $22C9      ; resume/edit team data

tbl_9D96_тайл_курсора:
    .byte $F6
    .byte $F6
    .byte $F6
    .byte $F6
    .byte $B1



sub_9D9B:
C - - - - - 0x035DAB 1A:9D9B: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035DAD 1A:9D9D: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035DB0 1A:9DA0: F0 13     BEQ bra_9DB5
C - - - - - 0x035DB2 1A:9DA2: A2 00     LDX #$00
bra_9DA4_loop:
C - - - - - 0x035DB4 1A:9DA4: 4A        LSR
C - - - - - 0x035DB5 1A:9DA5: B0 03     BCS bra_9DAA
C - - - - - 0x035DB7 1A:9DA7: E8        INX
C - - - - - 0x035DB8 1A:9DA8: D0 FA     BNE bra_9DA4_loop    ; jmp
bra_9DAA:
C - - - - - 0x035DBA 1A:9DAA: BD B9 9D  LDA tbl_9DB9,X
C - - - - - 0x035DBD 1A:9DAD: 18        CLC
C - - - - - 0x035DBE 1A:9DAE: 6D 24 06  ADC ram_0624
C - - - - - 0x035DC1 1A:9DB1: C9 F0     CMP #$F0
C - - - - - 0x035DC3 1A:9DB3: 90 03     BCC bra_9DB8_RTS
bra_9DB5:
C - - - - - 0x035DC5 1A:9DB5: AD 24 06  LDA ram_0624
bra_9DB8_RTS:
C - - - - - 0x035DC8 1A:9DB8: 60        RTS



tbl_9DB9:
- D 0 - - - 0x035DC9 1A:9DB9: 0C        .byte $0C   ; right
- D 0 - - - 0x035DCA 1A:9DBA: F4        .byte $F4   ; left
- D 0 - - - 0x035DCB 1A:9DBB: 01        .byte $01   ; down
- D 0 - - - 0x035DCC 1A:9DBC: FF        .byte $FF   ; up



sub_9DBD:
C - - - - - 0x035DCD 1A:9DBD: AD FC 05  LDA ram_принимающий
C - - - - - 0x035DD0 1A:9DC0: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035DD3 1A:9DC3: AD 24 06  LDA ram_0624
C - - - - - 0x035DD6 1A:9DC6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x035DD9 1A:9DC9: 98        TYA
C - - - - - 0x035DDA 1A:9DCA: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035DDC 1A:9DCC: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035DDE 1A:9DCE: 8A        TXA
C - - - - - 0x035DDF 1A:9DCF: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035DE1 1A:9DD1: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035DE3 1A:9DD3: 60        RTS



sub_9DD4_отобразить_или_затереть_статы_принимающего:
C - - - - - 0x035DE4 1A:9DD4: A9 01     LDA #$01      ; не начинать поиск с кипера
C - - - - - 0x035DE6 1A:9DD6: 85 3A     STA ram_003A
bra_9DD8_loop:
C - - - - - 0x035DE8 1A:9DD8: A5 3A     LDA ram_003A
C - - - - - 0x035DEA 1A:9DDA: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x035DED 1A:9DDD: F0 15     BEQ bra_9DF4_игнорировать_игрока_с_мячом_при_поиске
C - - - - - 0x035DEF 1A:9DDF: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035DF2 1A:9DE2: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035DF4 1A:9DE4: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035DF6 1A:9DE6: AA        TAX
C - - - - - 0x035DF7 1A:9DE7: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035DF9 1A:9DE9: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035DFB 1A:9DEB: A8        TAY
C - - - - - 0x035DFC 1A:9DEC: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035DFF 1A:9DEF: CD 24 06  CMP ram_0624
C - - - - - 0x035E02 1A:9DF2: F0 0E     BEQ bra_9E02_игрок_найден
bra_9DF4_игнорировать_игрока_с_мячом_при_поиске:
C - - - - - 0x035E04 1A:9DF4: E6 3A     INC ram_003A
C - - - - - 0x035E06 1A:9DF6: A5 3A     LDA ram_003A
C - - - - - 0x035E08 1A:9DF8: C9 0B     CMP #$0B
C - - - - - 0x035E0A 1A:9DFA: D0 DC     BNE bra_9DD8_loop
C - - - - - 0x035E0C 1A:9DFC: A2 FF     LDX #$FF
C - - - - - 0x035E0E 1A:9DFE: A9 1C     LDA #con_B3CF_1C
C - - - - - 0x035E10 1A:9E00: D0 04     BNE bra_9E06_очистить_экран_справа    ; jmp
bra_9E02_игрок_найден:
C - - - - - 0x035E12 1A:9E02: A9 1D     LDA #con_B3CF_1D
C - - - - - 0x035E14 1A:9E04: A6 3A     LDX ram_003A
bra_9E06_очистить_экран_справа:
C - - - - - 0x035E16 1A:9E06: 8E FC 05  STX ram_принимающий
C - - - - - 0x035E19 1A:9E09: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035E1C 1A:9E0C: 60        RTS



sub_9E0D:
; предположительно связано с ограничением/фиксированной записью координат игрока
; в зависимости от его позиции или типа того
C - - - - - 0x035E1D 1A:9E0D: 85 3A     STA ram_003A
C - - - - - 0x035E1F 1A:9E0F: 0A        ASL
C - - - - - 0x035E20 1A:9E10: AA        TAX
C - - - - - 0x035E21 1A:9E11: BD F0 9F  LDA tbl_9FF0,X
C - - - - - 0x035E24 1A:9E14: 85 3C     STA ram_003C
C - - - - - 0x035E26 1A:9E16: BD F1 9F  LDA tbl_9FF0 + $01,X
C - - - - - 0x035E29 1A:9E19: 85 3D     STA ram_003D
C - - - - - 0x035E2B 1A:9E1B: A9 00     LDA #$00
C - - - - - 0x035E2D 1A:9E1D: 85 3B     STA ram_003B    ; индекс игрока
bra_9E1F_loop:
C - - - - - 0x035E2F 1A:9E1F: A5 3B     LDA ram_003B    ; индекс игрока
C - - - - - 0x035E31 1A:9E21: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035E34 1A:9E24: A6 3B     LDX ram_003B    ; индекс игрока
C - - - - - 0x035E36 1A:9E26: EC 41 04  CPX ram_игрок_с_мячом
C - - - - - 0x035E39 1A:9E29: F0 1B     BEQ bra_9E46_этот_игрок_с_мячом
C - - - - - 0x035E3B 1A:9E2B: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x035E3E 1A:9E2E: E0 0B     CPX #$0B
C - - - - - 0x035E40 1A:9E30: 90 08     BCC bra_9E3A_команда_слева
; if команда справа
C - - - - - 0x035E42 1A:9E32: 8A        TXA
C - - - - - 0x035E43 1A:9E33: E9 0B     SBC #$0B
C - - - - - 0x035E45 1A:9E35: AA        TAX
C - - - - - 0x035E46 1A:9E36: 98        TYA
C - - - - - 0x035E47 1A:9E37: 49 0B     EOR #$0B
C - - - - - 0x035E49 1A:9E39: A8        TAY
bra_9E3A_команда_слева:
C - - - - - 0x035E4A 1A:9E3A: 86 3E     STX ram_003E
C - - - - - 0x035E4C 1A:9E3C: 98        TYA
C - - - - - 0x035E4D 1A:9E3D: 18        CLC
C - - - - - 0x035E4E 1A:9E3E: 65 3E     ADC ram_003E
C - - - - - 0x035E50 1A:9E40: A8        TAY
C - - - - - 0x035E51 1A:9E41: B1 3C     LDA (ram_003C),Y
C - - - - - 0x035E53 1A:9E43: 4C 4B 9E  JMP loc_9E4B
bra_9E46_этот_игрок_с_мячом:
C - - - - - 0x035E56 1A:9E46: A6 3A     LDX ram_003A
C - - - - - 0x035E58 1A:9E48: BD F8 A0  LDA tbl_A0F8_для_игрока_с_мячом,X
loc_9E4B:
C D 0 - - - 0x035E5B 1A:9E4B: 20 EE 9B  JSR sub_9BEE
C - - - - - 0x035E5E 1A:9E4E: E6 3B     INC ram_003B    ; индекс игрока
C - - - - - 0x035E60 1A:9E50: A5 3B     LDA ram_003B    ; индекс игрока
C - - - - - 0x035E62 1A:9E52: C9 16     CMP #$16
C - - - - - 0x035E64 1A:9E54: D0 C9     BNE bra_9E1F_loop
C - - - - - 0x035E66 1A:9E56: 20 45 C6  JSR sub_0x03E6FC
C - - - - - 0x035E69 1A:9E59: 60        RTS



sub_9E5A_отрисовка_меню_во_время_матча:
C - - - - - 0x035E6A 1A:9E5A: 48        PHA
C - - - - - 0x035E6B 1A:9E5B: A9 01     LDA #$01
C - - - - - 0x035E6D 1A:9E5D: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035E70 1A:9E60: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x035E73 1A:9E63: 68        PLA
C - - - - - 0x035E74 1A:9E64: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035E77 1A:9E67: F0 06     BEQ bra_9E6F_команда_слева
; if мяч у команды справа
C - - - - - 0x035E79 1A:9E69: A9 14     LDA #$14      ; у компа всегда пробивает 10й номер
C - - - - - 0x035E7B 1A:9E6B: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035E7E 1A:9E6E: 60        RTS
bra_9E6F_команда_слева:
C - - - - - 0x035E7F 1A:9E6F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035E82 1A:9E72: A9 01     LDA #$01
C - - - - - 0x035E84 1A:9E74: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035E87 1A:9E77: A0 00     LDY #$00
C - - - - - 0x035E89 1A:9E79: 20 3B 9F  JSR sub_9F3B
bra_9E7C_loop:
C - - - - - 0x035E8C 1A:9E7C: A9 01     LDA #$01
C - - - - - 0x035E8E 1A:9E7E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035E91 1A:9E81: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035E93 1A:9E83: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035E96 1A:9E86: F0 27     BEQ bra_9EAF
C - - - - - 0x035E98 1A:9E88: A2 00     LDX #$00
bra_9E8A_loop:
C - - - - - 0x035E9A 1A:9E8A: 4A        LSR
C - - - - - 0x035E9B 1A:9E8B: B0 03     BCS bra_9E90
C - - - - - 0x035E9D 1A:9E8D: E8        INX
C - - - - - 0x035E9E 1A:9E8E: D0 FA     BNE bra_9E8A_loop
bra_9E90:
C - - - - - 0x035EA0 1A:9E90: 86 3A     STX ram_003A
C - - - - - 0x035EA2 1A:9E92: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x035EA5 1A:9E95: 0A        ASL
C - - - - - 0x035EA6 1A:9E96: 0A        ASL
C - - - - - 0x035EA7 1A:9E97: 65 3A     ADC ram_003A
C - - - - - 0x035EA9 1A:9E99: AA        TAX
C - - - - - 0x035EAA 1A:9E9A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035EAD 1A:9E9D: 48        PHA
C - - - - - 0x035EAE 1A:9E9E: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x035EB1 1A:9EA1: A0 00     LDY #$00
C - - - - - 0x035EB3 1A:9EA3: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035EB6 1A:9EA6: 68        PLA
C - - - - - 0x035EB7 1A:9EA7: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035EBA 1A:9EAA: A0 00     LDY #$00
C - - - - - 0x035EBC 1A:9EAC: 20 3B 9F  JSR sub_9F3B
bra_9EAF:
C - - - - - 0x035EBF 1A:9EAF: A9 80     LDA #con_btn_A
C - - - - - 0x035EC1 1A:9EB1: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035EC4 1A:9EB4: F0 C6     BEQ bra_9E7C_loop
C - - - - - 0x035EC6 1A:9EB6: 60        RTS



tbl_9EB7_изменение_позиции_курсора_основных_игроков:
; также используется для выбора игрока на пенальти
    ; GK (unused)
    .byte $FF   ; right
    .byte $FF   ; left
    .byte $FF   ; down
    .byte $FF   ; up
    ; 2
    .byte $06   ; right
    .byte $06   ; left
    .byte $02   ; down
    .byte $05   ; up
    ; 3
    .byte $07   ; right
    .byte $07   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $05   ; down
    .byte $03   ; up
    ; 6
    .byte $0A   ; right
    .byte $0A   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 7
    .byte $01   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $0A   ; up
    ; 8
    .byte $02   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; 9
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; 10
    .byte $04   ; right
    .byte $04   ; left
    .byte $0A   ; down
    .byte $08   ; up
    ; 11
    .byte $05   ; right
    .byte $05   ; left
    .byte $06   ; down
    .byte $09   ; up



tbl_9F0F_изменение_позиции_курсора_запасных_игроков:
    ; 1
    .byte $05   ; right
    .byte $08   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 2
    .byte $06   ; right
    .byte $08   ; left
    .byte $02   ; down
    .byte $00   ; up
    ; 3
    .byte $07   ; right
    .byte $08   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $00   ; down
    .byte $03   ; up
    ; 6
    .byte $08   ; right
    .byte $00   ; left
    .byte $06   ; down
    .byte $09   ; up
    ; 7
    .byte $08   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $05   ; up
    ; 8
    .byte $09   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; GK1
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; GK2
    .byte $04   ; right
    .byte $04   ; left
    .byte $05   ; down
    .byte $08   ; up



sub_9F37:
C - - - - - 0x035F47 1A:9F37: A2 B1     LDX #$B1
C - - - - - 0x035F49 1A:9F39: D0 06     BNE bra_9F41    ; jmp



sub_9F3B:
C - - - - - 0x035F4B 1A:9F3B: A2 F6     LDX #$F6
C - - - - - 0x035F4D 1A:9F3D: D0 02     BNE bra_9F41    ; jmp



sub_9F3F:
C - - - - - 0x035F4F 1A:9F3F: A2 00     LDX #$00
bra_9F41:
sub_9F41_позиция_курсора_при_замене_основного_состава:
C - - - - - 0x035F51 1A:9F41: 48        PHA
bra_9F42_ожидание_освобождения_буфера:
C - - - - - 0x035F52 1A:9F42: A9 01     LDA #$01
C - - - - - 0x035F54 1A:9F44: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035F57 1A:9F47: AD 15 05  LDA ram_0515
C - - - - - 0x035F5A 1A:9F4A: D0 F6     BNE bra_9F42_ожидание_освобождения_буфера
C - - - - - 0x035F5C 1A:9F4C: A9 01     LDA #$01
C - - - - - 0x035F5E 1A:9F4E: 8D 15 05  STA ram_0515
C - - - - - 0x035F61 1A:9F51: 8E A8 04  STX ram_04A8
C - - - - - 0x035F64 1A:9F54: 8C A5 04  STY ram_04A5
C - - - - - 0x035F67 1A:9F57: 68        PLA
C - - - - - 0x035F68 1A:9F58: 0A        ASL
C - - - - - 0x035F69 1A:9F59: 6D A5 04  ADC ram_04A5
C - - - - - 0x035F6C 1A:9F5C: AA        TAX
C - - - - - 0x035F6D 1A:9F5D: A9 01     LDA #$01
C - - - - - 0x035F6F 1A:9F5F: 8D A5 04  STA ram_04A5
C - - - - - 0x035F72 1A:9F62: BD 79 9F  LDA tbl_9F79_позиция_ppu_курсора,X
C - - - - - 0x035F75 1A:9F65: 8D A6 04  STA ram_04A6
C - - - - - 0x035F78 1A:9F68: BD 7A 9F  LDA tbl_9F79_позиция_ppu_курсора + $01,X
C - - - - - 0x035F7B 1A:9F6B: 8D A7 04  STA ram_04A7
C - - - - - 0x035F7E 1A:9F6E: A9 00     LDA #$00
C - - - - - 0x035F80 1A:9F70: 8D A9 04  STA ram_04A9
C - - - - - 0x035F83 1A:9F73: A9 80     LDA #$80
C - - - - - 0x035F85 1A:9F75: 8D 15 05  STA ram_0515
C - - - - - 0x035F88 1A:9F78: 60        RTS



tbl_9F79_позиция_ppu_курсора:
; выбор пробивающего нарушение
    .word $0000     ; unused
    .word $226A     ; 2
    .word $22AA     ; 3
    .word $22EA     ; 4
    .word $232A     ; 5
    .word $236A     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена между основными игроками
    .word $238D
    .word $2264     ; 2
    .word $22A4     ; 3
    .word $22E4     ; 4
    .word $2324     ; 5
    .word $2364     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена запасных игроков
    .word $2262     ; 1
    .word $22A2     ; 2
    .word $22E2     ; 3
    .word $2322     ; 4
    .word $2362     ; 5
    .word $226C     ; 6
    .word $22AC     ; 7
    .word $22EC     ; 8
    .word $2334     ; GK1
    .word $2374     ; GK2



tbl_9FB9:
- D 0 - - - 0x035FC9 1A:9FB9: C3 9F     .word off_9FC3_00
- D 0 - - - 0x035FCB 1A:9FBB: CD 9F     .word off_9FCD_01
- D 0 - - - 0x035FCD 1A:9FBD: D5 9F     .word off_9FD5_02
- D 0 - - - 0x035FCF 1A:9FBF: DE 9F     .word off_9FDE_03
- D 0 - - - 0x035FD1 1A:9FC1: E6 9F     .word off_9FE6_04



off_9FC3_00:
- D 0 - I - 0x035FD3 1A:9FC3: B4        .byte $B4   ; <ガ>
- D 0 - I - 0x035FD4 1A:9FC4: C0        .byte $C0   ; <ヅ>
- D 0 - I - 0x035FD5 1A:9FC5: C1        .byte $C1   ; <デ>
- D 0 - I - 0x035FD6 1A:9FC6: CC        .byte $CC   ; <ぽ>
- D 0 - I - 0x035FD7 1A:9FC7: CD        .byte $CD   ; <パ>
- D 0 - I - 0x035FD8 1A:9FC8: D8        .byte $D8
- D 0 - I - 0x035FD9 1A:9FC9: D9        .byte $D9
- D 0 - I - 0x035FDA 1A:9FCA: E4        .byte $E4
- D 0 - I - 0x035FDB 1A:9FCB: E5        .byte $E5
- D 0 - I - 0x035FDC 1A:9FCC: FF        .byte $FF   ; end token

off_9FCD_01:
- D 0 - I - 0x035FDD 1A:9FCD: A8        .byte $A8   ; <ぜ>
- D 0 - I - 0x035FDE 1A:9FCE: A9        .byte $A9   ; <ぞ>
- D 0 - I - 0x035FDF 1A:9FCF: AA        .byte $AA   ; <だ>
- D 0 - I - 0x035FE0 1A:9FD0: AB        .byte $AB   ; <ぢ>
- D 0 - I - 0x035FE1 1A:9FD1: B5        .byte $B5   ; <ギ>
- D 0 - I - 0x035FE2 1A:9FD2: B6        .byte $B6   ; <グ>
- D 0 - I - 0x035FE3 1A:9FD3: B7        .byte $B7   ; <ゲ>
- D 0 - I - 0x035FE4 1A:9FD4: FF        .byte $FF   ; end token

off_9FD5_02:
- D 0 - I - 0x035FE5 1A:9FD5: AC        .byte $AC   ; <づ>
- D 0 - I - 0x035FE6 1A:9FD6: AD        .byte $AD   ; <で>
- D 0 - I - 0x035FE7 1A:9FD7: AE        .byte $AE   ; <ど>
- D 0 - I - 0x035FE8 1A:9FD8: AF        .byte $AF   ; <ば>
- D 0 - I - 0x035FE9 1A:9FD9: B8        .byte $B8   ; <ゴ>
- D 0 - I - 0x035FEA 1A:9FDA: B9        .byte $B9   ; <ザ>
- D 0 - I - 0x035FEB 1A:9FDB: BA        .byte $BA   ; <ジ>
- D 0 - I - 0x035FEC 1A:9FDC: BB        .byte $BB   ; <ズ>
- D 0 - I - 0x035FED 1A:9FDD: FF        .byte $FF   ; end token

off_9FDE_03:
- D 0 - I - 0x035FEE 1A:9FDE: B0        .byte $B0   ; <び>
- D 0 - I - 0x035FEF 1A:9FDF: B1        .byte $B1   ; <ぶ>
- D 0 - I - 0x035FF0 1A:9FE0: B2        .byte $B2   ; <べ>
- D 0 - I - 0x035FF1 1A:9FE1: B3        .byte $B3   ; <ぼ>
- D 0 - I - 0x035FF2 1A:9FE2: BC        .byte $BC   ; <ゼ>
- D 0 - I - 0x035FF3 1A:9FE3: BD        .byte $BD   ; <ゾ>
- D 0 - I - 0x035FF4 1A:9FE4: BE        .byte $BE   ; <ダ>
- D 0 - I - 0x035FF5 1A:9FE5: FF        .byte $FF   ; end token

off_9FE6_04:
- D 0 - I - 0x035FF6 1A:9FE6: BF        .byte $BF   ; <ヂ>
- D 0 - I - 0x035FF7 1A:9FE7: CA        .byte $CA   ; <ぷ>
- D 0 - I - 0x035FF8 1A:9FE8: CB        .byte $CB   ; <ぺ>
- D 0 - I - 0x035FF9 1A:9FE9: D6        .byte $D6
- D 0 - I - 0x035FFA 1A:9FEA: D7        .byte $D7
- D 0 - I - 0x035FFB 1A:9FEB: E2        .byte $E2
- D 0 - I - 0x035FFC 1A:9FEC: E3        .byte $E3
- D 0 - I - 0x035FFD 1A:9FED: EE        .byte $EE
- D 0 - I - 0x035FFE 1A:9FEE: EF        .byte $EF
- D 0 - I - 0x035FFF 1A:9FEF: FF        .byte $FF   ; end token



tbl_9FF0:
- - - - - - 0x036000 1A:9FF0: 06 A0     .word off_A006_00
- - - - - - 0x036002 1A:9FF2: 1C A0     .word off_A01C_01
- D 0 - - - 0x036004 1A:9FF4: 32 A0     .word off_A032_02
- D 0 - - - 0x036006 1A:9FF6: 48 A0     .word off_A048_03
- D 0 - - - 0x036008 1A:9FF8: 5E A0     .word off_A05E_04
- D 0 - - - 0x03600A 1A:9FFA: 74 A0     .word off_A074_05
- D 0 - - - 0x03600C 1A:9FFC: 8A A0     .word off_A08A_06
- D 0 - - - 0x03600E 1A:9FFE: A0 A0     .word off_A0A0_07
- D 1 - - - 0x036010 1A:A000: B6 A0     .word off_A0B6_08
- D 1 - - - 0x036012 1A:A002: CC A0     .word off_A0CC_09
- D 1 - - - 0x036014 1A:A004: E2 A0     .word off_A0E2_0A



off_A006_00:
- - - - - - 0x036016 1A:A006: FF        .byte $FF   ; 00
- - - - - - 0x036017 1A:A007: 9D        .byte $9D   ; 01
- - - - - - 0x036018 1A:A008: B2        .byte $B2   ; 02
- - - - - - 0x036019 1A:A009: 95        .byte $95   ; 03
- - - - - - 0x03601A 1A:A00A: 7E        .byte $7E   ; 04
- - - - - - 0x03601B 1A:A00B: C4        .byte $C4   ; 05
- - - - - - 0x03601C 1A:A00C: E4        .byte $E4   ; 06
- - - - - - 0x03601D 1A:A00D: DF        .byte $DF   ; 07
- - - - - - 0x03601E 1A:A00E: E9        .byte $E9   ; 08
- - - - - - 0x03601F 1A:A00F: DE        .byte $DE   ; 09
- - - - - - 0x036020 1A:A010: E1        .byte $E1   ; 0A

- - - - - - 0x036021 1A:A011: FF        .byte $FF   ; 00
- - - - - - 0x036022 1A:A012: EA        .byte $EA   ; 01
- - - - - - 0x036023 1A:A013: E5        .byte $E5   ; 02
- - - - - - 0x036024 1A:A014: E7        .byte $E7   ; 03
- - - - - - 0x036025 1A:A015: DB        .byte $DB   ; 04
- - - - - - 0x036026 1A:A016: CF        .byte $CF   ; 05
- - - - - - 0x036027 1A:A017: 84        .byte $84   ; 06
- - - - - - 0x036028 1A:A018: D3        .byte $D3   ; 07
- - - - - - 0x036029 1A:A019: 7D        .byte $7D   ; 08
- - - - - - 0x03602A 1A:A01A: D1        .byte $D1   ; 09
- - - - - - 0x03602B 1A:A01B: A5        .byte $A5   ; 0A



off_A01C_01:
- - - - - - 0x03602C 1A:A01C: FF        .byte $FF   ; 00
- - - - - - 0x03602D 1A:A01D: 91        .byte $91   ; 01
- - - - - - 0x03602E 1A:A01E: A5        .byte $A5   ; 02
- - - - - - 0x03602F 1A:A01F: 95        .byte $95   ; 03
- - - - - - 0x036030 1A:A020: 7E        .byte $7E   ; 04
- - - - - - 0x036031 1A:A021: B4        .byte $B4   ; 05
- - - - - - 0x036032 1A:A022: E1        .byte $E1   ; 06
- - - - - - 0x036033 1A:A023: D4        .byte $D4   ; 07
- - - - - - 0x036034 1A:A024: D2        .byte $D2   ; 08
- - - - - - 0x036035 1A:A025: BB        .byte $BB   ; 09
- - - - - - 0x036036 1A:A026: CD        .byte $CD   ; 0A

- - - - - - 0x036037 1A:A027: FF        .byte $FF   ; 00
- - - - - - 0x036038 1A:A028: E0        .byte $E0   ; 01
- - - - - - 0x036039 1A:A029: D9        .byte $D9   ; 02
- - - - - - 0x03603A 1A:A02A: DB        .byte $DB   ; 03
- - - - - - 0x03603B 1A:A02B: D0        .byte $D0   ; 04
- - - - - - 0x03603C 1A:A02C: C5        .byte $C5   ; 05
- - - - - - 0x03603D 1A:A02D: 90        .byte $90   ; 06
- - - - - - 0x03603E 1A:A02E: A0        .byte $A0   ; 07
- - - - - - 0x03603F 1A:A02F: 7D        .byte $7D   ; 08
- - - - - - 0x036040 1A:A030: BC        .byte $BC   ; 09
- - - - - - 0x036041 1A:A031: 9A        .byte $9A   ; 0A



off_A032_02:
- D 1 - I - 0x036042 1A:A032: FF        .byte $FF   ; 00
- D 1 - I - 0x036043 1A:A033: 92        .byte $92   ; 01
- D 1 - I - 0x036044 1A:A034: A5        .byte $A5   ; 02
- D 1 - I - 0x036045 1A:A035: 95        .byte $95   ; 03
- D 1 - I - 0x036046 1A:A036: 7E        .byte $7E   ; 04
- D 1 - I - 0x036047 1A:A037: AB        .byte $AB   ; 05
- D 1 - I - 0x036048 1A:A038: E1        .byte $E1   ; 06
- D 1 - I - 0x036049 1A:A039: C8        .byte $C8   ; 07
- D 1 - I - 0x03604A 1A:A03A: CF        .byte $CF   ; 08
- D 1 - I - 0x03604B 1A:A03B: AF        .byte $AF   ; 09
- D 1 - I - 0x03604C 1A:A03C: C1        .byte $C1   ; 0A

- D 1 - I - 0x03604D 1A:A03D: FF        .byte $FF   ; 00
- D 1 - I - 0x03604E 1A:A03E: E0        .byte $E0   ; 01
- D 1 - I - 0x03604F 1A:A03F: CD        .byte $CD   ; 02
- D 1 - I - 0x036050 1A:A040: D0        .byte $D0   ; 03
- D 1 - I - 0x036051 1A:A041: D1        .byte $D1   ; 04
- D 1 - I - 0x036052 1A:A042: D2        .byte $D2   ; 05
- D 1 - I - 0x036053 1A:A043: 91        .byte $91   ; 06
- D 1 - I - 0x036054 1A:A044: B7        .byte $B7   ; 07
- D 1 - I - 0x036055 1A:A045: 7D        .byte $7D   ; 08
- D 1 - I - 0x036056 1A:A046: BC        .byte $BC   ; 09
- D 1 - I - 0x036057 1A:A047: 9A        .byte $9A   ; 0A



off_A048_03:
- D 1 - I - 0x036058 1A:A048: FF        .byte $FF   ; 00
- D 1 - I - 0x036059 1A:A049: 91        .byte $91   ; 01
- D 1 - I - 0x03605A 1A:A04A: 9A        .byte $9A   ; 02
- D 1 - I - 0x03605B 1A:A04B: 95        .byte $95   ; 03
- D 1 - I - 0x03605C 1A:A04C: 7E        .byte $7E   ; 04
- D 1 - I - 0x03605D 1A:A04D: BF        .byte $BF   ; 05
- D 1 - I - 0x03605E 1A:A04E: D6        .byte $D6   ; 06
- D 1 - I - 0x03605F 1A:A04F: CF        .byte $CF   ; 07
- D 1 - I - 0x036060 1A:A050: D1        .byte $D1   ; 08
- D 1 - I - 0x036061 1A:A051: B8        .byte $B8   ; 09
- D 1 - I - 0x036062 1A:A052: DA        .byte $DA   ; 0A

- D 1 - I - 0x036063 1A:A053: FF        .byte $FF   ; 00
- D 1 - I - 0x036064 1A:A054: E2        .byte $E2   ; 01
- D 1 - I - 0x036065 1A:A055: DB        .byte $DB   ; 02
- D 1 - I - 0x036066 1A:A056: C6        .byte $C6   ; 03
- D 1 - I - 0x036067 1A:A057: D3        .byte $D3   ; 04
- D 1 - I - 0x036068 1A:A058: E0        .byte $E0   ; 05
- D 1 - I - 0x036069 1A:A059: 90        .byte $90   ; 06
- D 1 - I - 0x03606A 1A:A05A: A2        .byte $A2   ; 07
- D 1 - I - 0x03606B 1A:A05B: 7D        .byte $7D   ; 08
- D 1 - I - 0x03606C 1A:A05C: B7        .byte $B7   ; 09
- D 1 - I - 0x03606D 1A:A05D: 9B        .byte $9B   ; 0A



off_A05E_04:
- D 1 - I - 0x03606E 1A:A05E: FF        .byte $FF   ; 00
- D 1 - I - 0x03606F 1A:A05F: 9D        .byte $9D   ; 01
- D 1 - I - 0x036070 1A:A060: A6        .byte $A6   ; 02
- D 1 - I - 0x036071 1A:A061: 95        .byte $95   ; 03
- D 1 - I - 0x036072 1A:A062: 7E        .byte $7E   ; 04
- - - - - - 0x036073 1A:A063: DC        .byte $DC   ; 05
- D 1 - I - 0x036074 1A:A064: DA        .byte $DA   ; 06
- D 1 - I - 0x036075 1A:A065: C7        .byte $C7   ; 07
- D 1 - I - 0x036076 1A:A066: EA        .byte $EA   ; 08
- D 1 - I - 0x036077 1A:A067: DD        .byte $DD   ; 09
- D 1 - I - 0x036078 1A:A068: EF        .byte $EF   ; 0A

- D 1 - I - 0x036079 1A:A069: FF        .byte $FF   ; 00
- D 1 - I - 0x03607A 1A:A06A: EE        .byte $EE   ; 01
- D 1 - I - 0x03607B 1A:A06B: E9        .byte $E9   ; 02
- D 1 - I - 0x03607C 1A:A06C: D4        .byte $D4   ; 03
- D 1 - I - 0x03607D 1A:A06D: E0        .byte $E0   ; 04
- D 1 - I - 0x03607E 1A:A06E: EC        .byte $EC   ; 05
- D 1 - I - 0x03607F 1A:A06F: 90        .byte $90   ; 06
- D 1 - I - 0x036080 1A:A070: D2        .byte $D2   ; 07
- D 1 - I - 0x036081 1A:A071: 7D        .byte $7D   ; 08
- D 1 - I - 0x036082 1A:A072: D0        .byte $D0   ; 09
- D 1 - I - 0x036083 1A:A073: 99        .byte $99   ; 0A



off_A074_05:
- D 1 - I - 0x036084 1A:A074: FF        .byte $FF   ; 00
- D 1 - I - 0x036085 1A:A075: 91        .byte $91   ; 01
- D 1 - I - 0x036086 1A:A076: 9A        .byte $9A   ; 02
- D 1 - I - 0x036087 1A:A077: 95        .byte $95   ; 03
- D 1 - I - 0x036088 1A:A078: 7E        .byte $7E   ; 04
- D 1 - I - 0x036089 1A:A079: B7        .byte $B7   ; 05
- D 1 - I - 0x03608A 1A:A07A: D6        .byte $D6   ; 06
- D 1 - I - 0x03608B 1A:A07B: AE        .byte $AE   ; 07
- D 1 - I - 0x03608C 1A:A07C: BC        .byte $BC   ; 08
- D 1 - I - 0x03608D 1A:A07D: B9        .byte $B9   ; 09
- D 1 - I - 0x03608E 1A:A07E: CD        .byte $CD   ; 0A

- D 1 - I - 0x03608F 1A:A07F: FF        .byte $FF   ; 00
- D 1 - I - 0x036090 1A:A080: E2        .byte $E2   ; 01
- D 1 - I - 0x036091 1A:A081: D9        .byte $D9   ; 02
- D 1 - I - 0x036092 1A:A082: BB        .byte $BB   ; 03
- D 1 - I - 0x036093 1A:A083: B8        .byte $B8   ; 04
- D 1 - I - 0x036094 1A:A084: BD        .byte $BD   ; 05
- D 1 - I - 0x036095 1A:A085: 9C        .byte $9C   ; 06
- D 1 - I - 0x036096 1A:A086: C1        .byte $C1   ; 07
- D 1 - I - 0x036097 1A:A087: 7D        .byte $7D   ; 08
- D 1 - I - 0x036098 1A:A088: B6        .byte $B6   ; 09
- D 1 - I - 0x036099 1A:A089: A7        .byte $A7   ; 0A



off_A08A_06:
- D 1 - I - 0x03609A 1A:A08A: FF        .byte $FF   ; 00
- D 1 - I - 0x03609B 1A:A08B: A9        .byte $A9   ; 01
- D 1 - I - 0x03609C 1A:A08C: A5        .byte $A5   ; 02
- D 1 - I - 0x03609D 1A:A08D: A1        .byte $A1   ; 03
- D 1 - I - 0x03609E 1A:A08E: 7E        .byte $7E   ; 04
- D 1 - I - 0x03609F 1A:A08F: CF        .byte $CF   ; 05
- D 1 - I - 0x0360A0 1A:A090: D4        .byte $D4   ; 06
- D 1 - I - 0x0360A1 1A:A091: D1        .byte $D1   ; 07
- D 1 - I - 0x0360A2 1A:A092: E9        .byte $E9   ; 08
- D 1 - I - 0x0360A3 1A:A093: DE        .byte $DE   ; 09
- D 1 - I - 0x0360A4 1A:A094: D9        .byte $D9   ; 0A

- D 1 - I - 0x0360A5 1A:A095: FF        .byte $FF   ; 00
- D 1 - I - 0x0360A6 1A:A096: DF        .byte $DF   ; 01
- D 1 - I - 0x0360A7 1A:A097: E6        .byte $E6   ; 02
- D 1 - I - 0x0360A8 1A:A098: E8        .byte $E8   ; 03
- D 1 - I - 0x0360A9 1A:A099: EA        .byte $EA   ; 04
- D 1 - I - 0x0360AA 1A:A09A: DD        .byte $DD   ; 05
- D 1 - I - 0x0360AB 1A:A09B: C0        .byte $C0   ; 06
- D 1 - I - 0x0360AC 1A:A09C: DB        .byte $DB   ; 07
- D 1 - I - 0x0360AD 1A:A09D: 89        .byte $89   ; 08
- D 1 - I - 0x0360AE 1A:A09E: D2        .byte $D2   ; 09
- D 1 - I - 0x0360AF 1A:A09F: C8        .byte $C8   ; 0A



off_A0A0_07:
- D 1 - I - 0x0360B0 1A:A0A0: FF        .byte $FF   ; 00
- D 1 - I - 0x0360B1 1A:A0A1: 9D        .byte $9D   ; 01
- D 1 - I - 0x0360B2 1A:A0A2: B2        .byte $B2   ; 02
- D 1 - I - 0x0360B3 1A:A0A3: A2        .byte $A2   ; 03
- D 1 - I - 0x0360B4 1A:A0A4: 7D        .byte $7D   ; 04
- D 1 - I - 0x0360B5 1A:A0A5: D2        .byte $D2   ; 05
- D 1 - I - 0x0360B6 1A:A0A6: E2        .byte $E2   ; 06
- D 1 - I - 0x0360B7 1A:A0A7: D4        .byte $D4   ; 07
- D 1 - I - 0x0360B8 1A:A0A8: EA        .byte $EA   ; 08
- D 1 - I - 0x0360B9 1A:A0A9: DD        .byte $DD   ; 09
- D 1 - I - 0x0360BA 1A:A0AA: CF        .byte $CF   ; 0A

- D 1 - I - 0x0360BB 1A:A0AB: FF        .byte $FF   ; 00
- D 1 - I - 0x0360BC 1A:A0AC: ED        .byte $ED   ; 01
- D 1 - I - 0x0360BD 1A:A0AD: DC        .byte $DC   ; 02
- D 1 - I - 0x0360BE 1A:A0AE: EB        .byte $EB   ; 03
- D 1 - I - 0x0360BF 1A:A0AF: E9        .byte $E9   ; 04
- D 1 - I - 0x0360C0 1A:A0B0: E0        .byte $E0   ; 05
- D 1 - I - 0x0360C1 1A:A0B1: C3        .byte $C3   ; 06
- D 1 - I - 0x0360C2 1A:A0B2: DE        .byte $DE   ; 07
- D 1 - I - 0x0360C3 1A:A0B3: 8A        .byte $8A   ; 08
- D 1 - I - 0x0360C4 1A:A0B4: D1        .byte $D1   ; 09
- D 1 - I - 0x0360C5 1A:A0B5: CB        .byte $CB   ; 0A



off_A0B6_08:
- D 1 - I - 0x0360C6 1A:A0B6: FF        .byte $FF   ; 00
- D 1 - I - 0x0360C7 1A:A0B7: 7E        .byte $7E   ; 01
- D 1 - I - 0x0360C8 1A:A0B8: 87        .byte $87   ; 02
- D 1 - I - 0x0360C9 1A:A0B9: DC        .byte $DC   ; 03
- D 1 - I - 0x0360CA 1A:A0BA: DE        .byte $DE   ; 04
- D 1 - I - 0x0360CB 1A:A0BB: CF        .byte $CF   ; 05
- D 1 - I - 0x0360CC 1A:A0BC: B1        .byte $B1   ; 06
- D 1 - I - 0x0360CD 1A:A0BD: C6        .byte $C6   ; 07
- D 1 - I - 0x0360CE 1A:A0BE: E9        .byte $E9   ; 08
- D 1 - I - 0x0360CF 1A:A0BF: D1        .byte $D1   ; 09
- D 1 - I - 0x0360D0 1A:A0C0: AA        .byte $AA   ; 0A

- D 1 - I - 0x0360D1 1A:A0C1: FF        .byte $FF   ; 00
- D 1 - I - 0x0360D2 1A:A0C2: DF        .byte $DF   ; 01
- D 1 - I - 0x0360D3 1A:A0C3: E6        .byte $E6   ; 02
- D 1 - I - 0x0360D4 1A:A0C4: E8        .byte $E8   ; 03
- D 1 - I - 0x0360D5 1A:A0C5: EA        .byte $EA   ; 04
- D 1 - I - 0x0360D6 1A:A0C6: DD        .byte $DD   ; 05
- D 1 - I - 0x0360D7 1A:A0C7: C0        .byte $C0   ; 06
- D 1 - I - 0x0360D8 1A:A0C8: DB        .byte $DB   ; 07
- D 1 - I - 0x0360D9 1A:A0C9: 89        .byte $89   ; 08
- D 1 - I - 0x0360DA 1A:A0CA: D2        .byte $D2   ; 09
- D 1 - I - 0x0360DB 1A:A0CB: C8        .byte $C8   ; 0A



off_A0CC_09:
- D 1 - I - 0x0360DC 1A:A0CC: FF        .byte $FF   ; 00
- D 1 - I - 0x0360DD 1A:A0CD: 7D        .byte $7D   ; 01
- D 1 - I - 0x0360DE 1A:A0CE: A2        .byte $A2   ; 02
- D 1 - I - 0x0360DF 1A:A0CF: DF        .byte $DF   ; 03
- D 1 - I - 0x0360E0 1A:A0D0: DD        .byte $DD   ; 04
- D 1 - I - 0x0360E1 1A:A0D1: C5        .byte $C5   ; 05
- D 1 - I - 0x0360E2 1A:A0D2: B1        .byte $B1   ; 06
- D 1 - I - 0x0360E3 1A:A0D3: D4        .byte $D4   ; 07
- D 1 - I - 0x0360E4 1A:A0D4: EA        .byte $EA   ; 08
- D 1 - I - 0x0360E5 1A:A0D5: D2        .byte $D2   ; 09
- D 1 - I - 0x0360E6 1A:A0D6: AA        .byte $AA   ; 0A

- D 1 - I - 0x0360E7 1A:A0D7: FF        .byte $FF   ; 00
- D 1 - I - 0x0360E8 1A:A0D8: ED        .byte $ED   ; 01
- D 1 - I - 0x0360E9 1A:A0D9: DC        .byte $DC   ; 02
- D 1 - I - 0x0360EA 1A:A0DA: EB        .byte $EB   ; 03
- D 1 - I - 0x0360EB 1A:A0DB: E9        .byte $E9   ; 04
- D 1 - I - 0x0360EC 1A:A0DC: E0        .byte $E0   ; 05
- D 1 - I - 0x0360ED 1A:A0DD: C3        .byte $C3   ; 06
- D 1 - I - 0x0360EE 1A:A0DE: DE        .byte $DE   ; 07
- D 1 - I - 0x0360EF 1A:A0DF: 8A        .byte $8A   ; 08
- D 1 - I - 0x0360F0 1A:A0E0: D1        .byte $D1   ; 09
- D 1 - I - 0x0360F1 1A:A0E1: CB        .byte $CB   ; 0A



off_A0E2_0A:
- - - - - - 0x0360F2 1A:A0E2: FF        .byte $FF   ; 00
- D 1 - I - 0x0360F3 1A:A0E3: 19        .byte $19   ; 01
- D 1 - I - 0x0360F4 1A:A0E4: 22        .byte $22   ; 02
- D 1 - I - 0x0360F5 1A:A0E5: 34        .byte $34   ; 03
- D 1 - I - 0x0360F6 1A:A0E6: 37        .byte $37   ; 04
- D 1 - I - 0x0360F7 1A:A0E7: 4A        .byte $4A   ; 05
- D 1 - I - 0x0360F8 1A:A0E8: 6B        .byte $6B   ; 06
- D 1 - I - 0x0360F9 1A:A0E9: 51        .byte $51   ; 07
- D 1 - I - 0x0360FA 1A:A0EA: 71        .byte $71   ; 08
- D 1 - I - 0x0360FB 1A:A0EB: 5A        .byte $5A   ; 09
- D 1 - I - 0x0360FC 1A:A0EC: 60        .byte $60   ; 0A

- D 1 - I - 0x0360FD 1A:A0ED: FF        .byte $FF   ; 00
- D 1 - I - 0x0360FE 1A:A0EE: 9A        .byte $9A   ; 01
- D 1 - I - 0x0360FF 1A:A0EF: 91        .byte $91   ; 02
- D 1 - I - 0x036100 1A:A0F0: 96        .byte $96   ; 03
- D 1 - I - 0x036101 1A:A0F1: A0        .byte $A0   ; 04
- D 1 - I - 0x036102 1A:A0F2: 74        .byte $74   ; 05
- D 1 - I - 0x036103 1A:A0F3: 55        .byte $55   ; 06
- D 1 - I - 0x036104 1A:A0F4: 6F        .byte $6F   ; 07
- D 1 - I - 0x036105 1A:A0F5: 4D        .byte $4D   ; 08
- D 1 - I - 0x036106 1A:A0F6: 7E        .byte $7E   ; 09
- D 1 - I - 0x036107 1A:A0F7: 5D        .byte $5D   ; 0A



tbl_A0F8_для_игрока_с_мячом:
- - - - - - 0x036108 1A:A0F8: CD        .byte $CD   ; 00
- - - - - - 0x036109 1A:A0F9: AA        .byte $AA   ; 01
- D 1 - - - 0x03610A 1A:A0FA: AD        .byte $AD   ; 02
- D 1 - - - 0x03610B 1A:A0FB: B1        .byte $B1   ; 03
- D 1 - - - 0x03610C 1A:A0FC: D6        .byte $D6   ; 04
- D 1 - - - 0x03610D 1A:A0FD: D1        .byte $D1   ; 05
- D 1 - - - 0x03610E 1A:A0FE: E4        .byte $E4   ; 06
- D 1 - - - 0x03610F 1A:A0FF: EF        .byte $EF   ; 07
- D 1 - - - 0x036110 1A:A100: E4        .byte $E4   ; 08
- D 1 - - - 0x036111 1A:A101: EF        .byte $EF   ; 09
- D 1 - - - 0x036112 1A:A102: FF        .byte $FF   ; 0A



sub_0x036113:
C D 1 - - - 0x036113 1A:A103: 48        PHA
C - - - - - 0x036114 1A:A104: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x036117 1A:A107: A2 00     LDX #$00
C - - - - - 0x036119 1A:A109: 86 3D     STX ram_003D
C - - - - - 0x03611B 1A:A10B: AD 2A 06  LDA ram_062A
C - - - - - 0x03611E 1A:A10E: 29 7F     AND #$7F
C - - - - - 0x036120 1A:A110: A8        TAY
C - - - - - 0x036121 1A:A111: 68        PLA
C - - - - - 0x036122 1A:A112: 48        PHA
C - - - - - 0x036123 1A:A113: C9 0B     CMP #$0B
C - - - - - 0x036125 1A:A115: 08        PHP
C - - - - - 0x036126 1A:A116: 90 0A     BCC bra_A122
C - - - - - 0x036128 1A:A118: E9 0B     SBC #$0B
C - - - - - 0x03612A 1A:A11A: 48        PHA
C - - - - - 0x03612B 1A:A11B: B9 DC A1  LDA tbl_A1DC,Y
C - - - - - 0x03612E 1A:A11E: A8        TAY
C - - - - - 0x03612F 1A:A11F: E8        INX
C - - - - - 0x036130 1A:A120: E8        INX
C - - - - - 0x036131 1A:A121: 68        PLA
bra_A122:
C - - - - - 0x036132 1A:A122: 48        PHA
C - - - - - 0x036133 1A:A123: 98        TYA
C - - - - - 0x036134 1A:A124: 0A        ASL
C - - - - - 0x036135 1A:A125: 0A        ASL
C - - - - - 0x036136 1A:A126: 85 3C     STA ram_003C
C - - - - - 0x036138 1A:A128: 0A        ASL
C - - - - - 0x036139 1A:A129: 0A        ASL
C - - - - - 0x03613A 1A:A12A: 65 3C     ADC ram_003C
C - - - - - 0x03613C 1A:A12C: 85 3C     STA ram_003C
C - - - - - 0x03613E 1A:A12E: 26 3D     ROL ram_003D
C - - - - - 0x036140 1A:A130: 68        PLA
C - - - - - 0x036141 1A:A131: 38        SEC
C - - - - - 0x036142 1A:A132: E9 01     SBC #$01
C - - - - - 0x036144 1A:A134: 4E E2 00  LSR ram_random + $01
C - - - - - 0x036147 1A:A137: 2A        ROL
C - - - - - 0x036148 1A:A138: 85 3E     STA ram_003E
C - - - - - 0x03614A 1A:A13A: 28        PLP
C - - - - - 0x03614B 1A:A13B: 08        PHP
C - - - - - 0x03614C 1A:A13C: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03614F 1A:A13F: F0 06     BEQ bra_A147_команда_слева
; if мяч у команды справа
C - - - - - 0x036151 1A:A141: 08        PHP
C - - - - - 0x036152 1A:A142: 68        PLA
C - - - - - 0x036153 1A:A143: 49 01     EOR #$01
C - - - - - 0x036155 1A:A145: 48        PHA
C - - - - - 0x036156 1A:A146: 28        PLP
bra_A147_команда_слева:
C - - - - - 0x036157 1A:A147: B0 13     BCS bra_A15C
C - - - - - 0x036159 1A:A149: A9 25     LDA #con_skill_25
C - - - - - 0x03615B 1A:A14B: 85 3F     STA ram_003F
C - - - - - 0x03615D 1A:A14D: BD 2C 00  LDA ram_расстановка_слева,X
C - - - - - 0x036160 1A:A150: 0A        ASL
C - - - - - 0x036161 1A:A151: AA        TAX
C - - - - - 0x036162 1A:A152: BD AE A6  LDA tbl_A6AD + $01,X
C - - - - - 0x036165 1A:A155: A8        TAY
C - - - - - 0x036166 1A:A156: BD AD A6  LDA tbl_A6AD,X
C - - - - - 0x036169 1A:A159: 4C 79 A1  JMP loc_A179
bra_A15C:
C - - - - - 0x03616C 1A:A15C: A9 26     LDA #con_skill_26
C - - - - - 0x03616E 1A:A15E: 85 3F     STA ram_003F
C - - - - - 0x036170 1A:A160: BD 2C 00  LDA ram_расстановка_слева,X
; расстановка * 06 + защита * 02
C - - - - - 0x036173 1A:A163: 0A        ASL
C - - - - - 0x036174 1A:A164: 85 3A     STA ram_003A
C - - - - - 0x036176 1A:A166: 0A        ASL
C - - - - - 0x036177 1A:A167: 65 3A     ADC ram_003A
C - - - - - 0x036179 1A:A169: 85 3A     STA ram_003A
C - - - - - 0x03617B 1A:A16B: BD 2D 00  LDA ram_защита_слева,X
C - - - - - 0x03617E 1A:A16E: 0A        ASL
C - - - - - 0x03617F 1A:A16F: 65 3A     ADC ram_003A
C - - - - - 0x036181 1A:A171: AA        TAX
C - - - - - 0x036182 1A:A172: BD 66 AB  LDA tbl_AB65 + $01,X
C - - - - - 0x036185 1A:A175: A8        TAY
C - - - - - 0x036186 1A:A176: BD 65 AB  LDA tbl_AB65,X
loc_A179:
C D 1 - - - 0x036189 1A:A179: 18        CLC
C - - - - - 0x03618A 1A:A17A: 65 3C     ADC ram_003C
C - - - - - 0x03618C 1A:A17C: 85 3A     STA ram_003A
C - - - - - 0x03618E 1A:A17E: 98        TYA
C - - - - - 0x03618F 1A:A17F: 65 3D     ADC ram_003D
C - - - - - 0x036191 1A:A181: 85 3B     STA ram_003B
C - - - - - 0x036193 1A:A183: A4 3E     LDY ram_003E
C - - - - - 0x036195 1A:A185: B1 3A     LDA (ram_003A),Y
C - - - - - 0x036197 1A:A187: 28        PLP
C - - - - - 0x036198 1A:A188: 90 14     BCC bra_A19E
C - - - - - 0x03619A 1A:A18A: C9 F0     CMP #$F0
C - - - - - 0x03619C 1A:A18C: F0 10     BEQ bra_A19E
C - - - - - 0x03619E 1A:A18E: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x0361A1 1A:A191: 8A        TXA
C - - - - - 0x0361A2 1A:A192: 49 FF     EOR #$FF
C - - - - - 0x0361A4 1A:A194: AA        TAX
C - - - - - 0x0361A5 1A:A195: 98        TYA
C - - - - - 0x0361A6 1A:A196: 49 FF     EOR #$FF
C - - - - - 0x0361A8 1A:A198: A8        TAY
C - - - - - 0x0361A9 1A:A199: E8        INX
C - - - - - 0x0361AA 1A:A19A: C8        INY
C - - - - - 0x0361AB 1A:A19B: 20 39 C5  JSR sub_0x03CDF2
bra_A19E:
C - - - - - 0x0361AE 1A:A19E: A0 09     LDY #con_plr_09
C - - - - - 0x0361B0 1A:A1A0: 91 34     STA (ram_plr_data),Y    ; con_plr_09
C - - - - - 0x0361B2 1A:A1A2: 68        PLA
C - - - - - 0x0361B3 1A:A1A3: 48        PHA
C - - - - - 0x0361B4 1A:A1A4: A6 3F     LDX ram_003F
C - - - - - 0x0361B6 1A:A1A6: 20 27 C5  JSR sub_0x03CE18_вычислить_числовой_стат_скилла
C - - - - - 0x0361B9 1A:A1A9: 68        PLA
C - - - - - 0x0361BA 1A:A1AA: A6 32     LDX ram_0032
C - - - - - 0x0361BC 1A:A1AC: EC E2 00  CPX ram_random + $01
C - - - - - 0x0361BF 1A:A1AF: B0 01     BCS bra_A1B2
C - - - - - 0x0361C1 1A:A1B1: 60        RTS
bra_A1B2:
C - - - - - 0x0361C2 1A:A1B2: A6 3F     LDX ram_003F
C - - - - - 0x0361C4 1A:A1B4: E0 25     CPX #con_skill_25
C - - - - - 0x0361C6 1A:A1B6: F0 04     BEQ bra_A1BC
C - - - - - 0x0361C8 1A:A1B8: A9 F0     LDA #$F0
C - - - - - 0x0361CA 1A:A1BA: D0 1B     BNE bra_A1D7    ; jmp
bra_A1BC:
C - - - - - 0x0361CC 1A:A1BC: C9 0B     CMP #$0B
C - - - - - 0x0361CE 1A:A1BE: 90 02     BCC bra_A1C2
C - - - - - 0x0361D0 1A:A1C0: E9 0B     SBC #$0B
bra_A1C2:
C - - - - - 0x0361D2 1A:A1C2: C9 05     CMP #$05
C - - - - - 0x0361D4 1A:A1C4: B0 15     BCS bra_A1DB_RTS
C - - - - - 0x0361D6 1A:A1C6: A2 C8     LDX #$C8
C - - - - - 0x0361D8 1A:A1C8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0361DB 1A:A1CB: F0 02     BEQ bra_A1CF_команда_слева
; if мяч у команды справа
C - - - - - 0x0361DD 1A:A1CD: A2 38     LDX #$38
bra_A1CF_команда_слева:
C - - - - - 0x0361DF 1A:A1CF: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0361E1 1A:A1D1: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0361E3 1A:A1D3: A8        TAY
C - - - - - 0x0361E4 1A:A1D4: 20 39 C5  JSR sub_0x03CDF2
bra_A1D7:
C - - - - - 0x0361E7 1A:A1D7: A0 09     LDY #con_plr_09
C - - - - - 0x0361E9 1A:A1D9: 91 34     STA (ram_plr_data),Y    ; con_plr_09
bra_A1DB_RTS:
C - - - - - 0x0361EB 1A:A1DB: 60        RTS



tbl_A1DC:
; bzk optimize, байты в убывающем порядке
; возможно достаточно будет делать EOR 0F
- D 1 - - - 0x0361EC 1A:A1DC: 0E        .byte $0E   ; 00
- D 1 - - - 0x0361ED 1A:A1DD: 0D        .byte $0D   ; 01
- D 1 - - - 0x0361EE 1A:A1DE: 0C        .byte $0C   ; 02
- D 1 - - - 0x0361EF 1A:A1DF: 0B        .byte $0B   ; 03
- D 1 - - - 0x0361F0 1A:A1E0: 0A        .byte $0A   ; 04
- D 1 - - - 0x0361F1 1A:A1E1: 09        .byte $09   ; 05
- D 1 - - - 0x0361F2 1A:A1E2: 08        .byte $08   ; 06
- D 1 - - - 0x0361F3 1A:A1E3: 07        .byte $07   ; 07
- D 1 - - - 0x0361F4 1A:A1E4: 06        .byte $06   ; 08
- D 1 - - - 0x0361F5 1A:A1E5: 05        .byte $05   ; 09
- D 1 - - - 0x0361F6 1A:A1E6: 04        .byte $04   ; 0A
- D 1 - - - 0x0361F7 1A:A1E7: 03        .byte $03   ; 0B
- D 1 - - - 0x0361F8 1A:A1E8: 02        .byte $02   ; 0C
- D 1 - - - 0x0361F9 1A:A1E9: 01        .byte $01   ; 0D
- D 1 - - - 0x0361FA 1A:A1EA: 00        .byte $00   ; 0E



sub_0x0361FB_отрисовка_чарли_на_фоне:
C D 1 - - - 0x0361FB 1A:A1EB: AD F4 05  LDA ram_05F4
C - - - - - 0x0361FE 1A:A1EE: D0 01     BNE bra_A1F1
C - - - - - 0x036200 1A:A1F0: 60        RTS
bra_A1F1:
C - - - - - 0x036201 1A:A1F1: 10 19     BPL bra_A20C
C - - - - - 0x036203 1A:A1F3: A9 01     LDA #$01
C - - - - - 0x036205 1A:A1F5: 8D F4 05  STA ram_05F4
C - - - - - 0x036208 1A:A1F8: AD F3 05  LDA ram_05F3
C - - - - - 0x03620B 1A:A1FB: 0A        ASL
C - - - - - 0x03620C 1A:A1FC: AA        TAX
C - - - - - 0x03620D 1A:A1FD: BD 92 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли,X
C - - - - - 0x036210 1A:A200: 85 63     STA ram_0063
C - - - - - 0x036212 1A:A202: BD 93 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли + $01,X
C - - - - - 0x036215 1A:A205: 85 64     STA ram_0064
C - - - - - 0x036217 1A:A207: A9 00     LDA #$00
C - - - - - 0x036219 1A:A209: 8D F5 05  STA ram_05F5
bra_A20C:
C - - - - - 0x03621C 1A:A20C: AD F5 05  LDA ram_05F5
C - - - - - 0x03621F 1A:A20F: F0 04     BEQ bra_A215_ожидание_освобождения_буфера
C - - - - - 0x036221 1A:A211: CE F5 05  DEC ram_05F5
C - - - - - 0x036224 1A:A214: 60        RTS
bra_A215_ожидание_освобождения_буфера:
C - - - - - 0x036225 1A:A215: A9 01     LDA #$01
C - - - - - 0x036227 1A:A217: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03622A 1A:A21A: AD 15 05  LDA ram_0515
C - - - - - 0x03622D 1A:A21D: D0 F6     BNE bra_A215_ожидание_освобождения_буфера
C - - - - - 0x03622F 1A:A21F: A9 01     LDA #$01
C - - - - - 0x036231 1A:A221: 8D 15 05  STA ram_0515
bra_A224_loop:
loc_A224_loop:
C D 1 - - - 0x036234 1A:A224: A0 00     LDY #$00
C - - - - - 0x036236 1A:A226: B1 63     LDA (ram_0063),Y
C - - - - - 0x036238 1A:A228: C9 FF     CMP #$FF
C - - - - - 0x03623A 1A:A22A: D0 16     BNE bra_A242_байты_еще_есть
; FF прочитать поинтеры и повторить цикл
C - - - - - 0x03623C 1A:A22C: C8        INY
C - - - - - 0x03623D 1A:A22D: B1 63     LDA (ram_0063),Y
C - - - - - 0x03623F 1A:A22F: AA        TAX
C - - - - - 0x036240 1A:A230: C8        INY
C - - - - - 0x036241 1A:A231: B1 63     LDA (ram_0063),Y
C - - - - - 0x036243 1A:A233: 85 64     STA ram_0064
C - - - - - 0x036245 1A:A235: 86 63     STX ram_0063
C - - - - - 0x036247 1A:A237: AD E3 05  LDA ram_05E3
C - - - - - 0x03624A 1A:A23A: D0 E8     BNE bra_A224_loop
; A = 00
C - - - - - 0x03624C 1A:A23C: 8D F4 05  STA ram_05F4
C - - - - - 0x03624F 1A:A23F: 4C 24 A2  JMP loc_A224_loop
bra_A242_байты_еще_есть:
C - - - - - 0x036252 1A:A242: 8D F5 05  STA ram_05F5
C - - - - - 0x036255 1A:A245: C8        INY
C - - - - - 0x036256 1A:A246: B1 63     LDA (ram_0063),Y
C - - - - - 0x036258 1A:A248: 0A        ASL
C - - - - - 0x036259 1A:A249: AA        TAX
C - - - - - 0x03625A 1A:A24A: BD 2A A4  LDA tbl_A42A_ppu_байты_анимаций_чарли,X
C - - - - - 0x03625D 1A:A24D: 85 3A     STA ram_003A
C - - - - - 0x03625F 1A:A24F: BD 2B A4  LDA tbl_A42A_ppu_байты_анимаций_чарли + $01,X
C - - - - - 0x036262 1A:A252: 85 3B     STA ram_003B
C - - - - - 0x036264 1A:A254: A0 00     LDY #$00
C - - - - - 0x036266 1A:A256: A2 00     LDX #$00
bra_A258_loop:
C - - - - - 0x036268 1A:A258: B1 3A     LDA (ram_003A),Y
C - - - - - 0x03626A 1A:A25A: F0 22     BEQ bra_A27E_закончить_чтение_атрибутов
C - - - - - 0x03626C 1A:A25C: 9D A5 04  STA ram_04A5,X
C - - - - - 0x03626F 1A:A25F: 85 3C     STA ram_003C
C - - - - - 0x036271 1A:A261: C8        INY
C - - - - - 0x036272 1A:A262: B1 3A     LDA (ram_003A),Y
C - - - - - 0x036274 1A:A264: 9D A6 04  STA ram_04A6,X
C - - - - - 0x036277 1A:A267: C8        INY
C - - - - - 0x036278 1A:A268: B1 3A     LDA (ram_003A),Y
C - - - - - 0x03627A 1A:A26A: 9D A7 04  STA ram_04A7,X
C - - - - - 0x03627D 1A:A26D: C8        INY
C - - - - - 0x03627E 1A:A26E: E8        INX
C - - - - - 0x03627F 1A:A26F: E8        INX
C - - - - - 0x036280 1A:A270: E8        INX
bra_A271_loop:
C - - - - - 0x036281 1A:A271: B1 3A     LDA (ram_003A),Y
C - - - - - 0x036283 1A:A273: 9D A5 04  STA ram_04A5,X
C - - - - - 0x036286 1A:A276: E8        INX
C - - - - - 0x036287 1A:A277: C8        INY
C - - - - - 0x036288 1A:A278: C6 3C     DEC ram_003C
C - - - - - 0x03628A 1A:A27A: D0 F5     BNE bra_A271_loop
C - - - - - 0x03628C 1A:A27C: F0 DA     BEQ bra_A258_loop   ; jmp
bra_A27E_закончить_чтение_атрибутов:
C - - - - - 0x03628E 1A:A27E: 9D A5 04  STA ram_04A5,X
C - - - - - 0x036291 1A:A281: A9 80     LDA #$80
C - - - - - 0x036293 1A:A283: 8D 15 05  STA ram_0515
C - - - - - 0x036296 1A:A286: A5 63     LDA ram_0063
C - - - - - 0x036298 1A:A288: 18        CLC
C - - - - - 0x036299 1A:A289: 69 02     ADC #$02
C - - - - - 0x03629B 1A:A28B: 85 63     STA ram_0063
C - - - - - 0x03629D 1A:A28D: 90 02     BCC bra_A291_RTS
C - - - - - 0x03629F 1A:A28F: E6 64     INC ram_0064
bra_A291_RTS:
C - - - - - 0x0362A1 1A:A291: 60        RTS



tbl_A292_номера_ppu_байтов_для_анимаций_чарли:
- D 1 - - - 0x0362A2 1A:A292: AE A2     .word off_A2AE_00
- D 1 - - - 0x0362A4 1A:A294: CB A2     .word off_A2CB_01
- D 1 - - - 0x0362A6 1A:A296: E8 A2     .word off_A2E8_02
- D 1 - - - 0x0362A8 1A:A298: FD A2     .word off_A2FD_03
- D 1 - - - 0x0362AA 1A:A29A: 1A A3     .word off_A31A_04
- D 1 - - - 0x0362AC 1A:A29C: 3F A3     .word off_A33F_05
- D 1 - - - 0x0362AE 1A:A29E: 5E A3     .word off_A35E_06
- D 1 - - - 0x0362B0 1A:A2A0: 6B A3     .word off_A36B_07
- D 1 - - - 0x0362B2 1A:A2A2: 72 A3     .word off_A372_08
- D 1 - - - 0x0362B4 1A:A2A4: 77 A3     .word off_A377_09
- D 1 - - - 0x0362B6 1A:A2A6: 92 A3     .word off_A392_0A
- D 1 - - - 0x0362B8 1A:A2A8: CB A3     .word off_A3CB_0B
- D 1 - - - 0x0362BA 1A:A2AA: F4 A3     .word off_A3F4_0C
- D 1 - - - 0x0362BC 1A:A2AC: 25 A4     .word off_A425_0D



off_A2AE_00:
- D 1 - I - 0x0362BE 1A:A2AE: 05        .byte $05, $00   ; таймер + индекс
- D 1 - I - 0x0362C0 1A:A2B0: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362C2 1A:A2B2: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362C4 1A:A2B4: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362C6 1A:A2B6: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362C8 1A:A2B8: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362CA 1A:A2BA: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362CC 1A:A2BC: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362CE 1A:A2BE: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362D0 1A:A2C0: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362D2 1A:A2C2: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362D4 1A:A2C4: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362D6 1A:A2C6: 05        .byte $05, $00   ; 
- D 1 - I - 0x0362D8 1A:A2C8: FF        .byte $FF   ; loop
- D 1 - I - 0x0362D9 1A:A2C9: AE A2     .word off_A2AE_00



off_A2CB_01:
- D 1 - I - 0x0362DB 1A:A2CB: 05        .byte $05, $04   ; таймер + индекс
- D 1 - I - 0x0362DD 1A:A2CD: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362DF 1A:A2CF: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E1 1A:A2D1: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362E3 1A:A2D3: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E5 1A:A2D5: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362E7 1A:A2D7: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E9 1A:A2D9: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362EB 1A:A2DB: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362ED 1A:A2DD: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362EF 1A:A2DF: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362F1 1A:A2E1: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362F3 1A:A2E3: 05        .byte $05, $04   ; 
- D 1 - I - 0x0362F5 1A:A2E5: FF        .byte $FF   ; loop
- D 1 - I - 0x0362F6 1A:A2E6: CB A2     .word off_A2CB_01



off_A2E8_02:
- D 1 - I - 0x0362F8 1A:A2E8: 04        .byte $04, $05   ; таймер + индекс
- D 1 - I - 0x0362FA 1A:A2EA: 04        .byte $04, $06   ; 
- D 1 - I - 0x0362FC 1A:A2EC: 04        .byte $04, $07   ; 
- D 1 - I - 0x0362FE 1A:A2EE: 04        .byte $04, $06   ; 
- D 1 - I - 0x036300 1A:A2F0: 04        .byte $04, $07   ; 
- D 1 - I - 0x036302 1A:A2F2: 04        .byte $04, $06   ; 
- D 1 - I - 0x036304 1A:A2F4: 04        .byte $04, $07   ; 
- D 1 - I - 0x036306 1A:A2F6: 04        .byte $04, $06   ; 
- D 1 - I - 0x036308 1A:A2F8: 04        .byte $04, $05   ; 
- D 1 - I - 0x03630A 1A:A2FA: FF        .byte $FF   ; loop
- D 1 - I - 0x03630B 1A:A2FB: E8 A2     .word off_A2E8_02



off_A2FD_03:
- D 1 - I - 0x03630D 1A:A2FD: 05        .byte $05, $08   ; таймер + индекс
- D 1 - I - 0x03630F 1A:A2FF: 05        .byte $05, $09   ; 
- D 1 - I - 0x036311 1A:A301: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036313 1A:A303: 05        .byte $05, $09   ; 
- D 1 - I - 0x036315 1A:A305: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036317 1A:A307: 05        .byte $05, $09   ; 
- D 1 - I - 0x036319 1A:A309: 05        .byte $05, $08   ; 
- D 1 - I - 0x03631B 1A:A30B: 05        .byte $05, $09   ; 
- D 1 - I - 0x03631D 1A:A30D: 05        .byte $05, $0A   ; 
- D 1 - I - 0x03631F 1A:A30F: 05        .byte $05, $09   ; 
- D 1 - I - 0x036321 1A:A311: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036323 1A:A313: 05        .byte $05, $09   ; 
- D 1 - I - 0x036325 1A:A315: 05        .byte $05, $08   ; 
- D 1 - I - 0x036327 1A:A317: FF        .byte $FF   ; loop
- D 1 - I - 0x036328 1A:A318: FD A2     .word off_A2FD_03



off_A31A_04:
- D 1 - I - 0x03632A 1A:A31A: 08        .byte $08, $0B   ; таймер + индекс
- D 1 - I - 0x03632C 1A:A31C: 04        .byte $04, $02   ; 
- D 1 - I - 0x03632E 1A:A31E: 04        .byte $04, $03   ; 
- D 1 - I - 0x036330 1A:A320: 04        .byte $04, $02   ; 
- D 1 - I - 0x036332 1A:A322: 04        .byte $04, $03   ; 
- D 1 - I - 0x036334 1A:A324: 04        .byte $04, $02   ; 
- D 1 - I - 0x036336 1A:A326: 04        .byte $04, $03   ; 
- D 1 - I - 0x036338 1A:A328: 08        .byte $08, $0C   ; 
- D 1 - I - 0x03633A 1A:A32A: 04        .byte $04, $02   ; 
- D 1 - I - 0x03633C 1A:A32C: 04        .byte $04, $03   ; 
- D 1 - I - 0x03633E 1A:A32E: 04        .byte $04, $02   ; 
- D 1 - I - 0x036340 1A:A330: 04        .byte $04, $0B   ; 
- D 1 - I - 0x036342 1A:A332: 04        .byte $04, $02   ; 
- D 1 - I - 0x036344 1A:A334: 08        .byte $08, $0C   ; 
- D 1 - I - 0x036346 1A:A336: 04        .byte $04, $02   ; 
- D 1 - I - 0x036348 1A:A338: 04        .byte $04, $03   ; 
- D 1 - I - 0x03634A 1A:A33A: 04        .byte $04, $02   ; 
- D 1 - I - 0x03634C 1A:A33C: FF        .byte $FF   ; loop
- D 1 - I - 0x03634D 1A:A33D: 1A A3     .word off_A31A_04



off_A33F_05:
- D 1 - I - 0x03634F 1A:A33F: 05        .byte $05, $0F   ; таймер + индекс
- D 1 - I - 0x036351 1A:A341: 05        .byte $05, $10   ; 
- D 1 - I - 0x036353 1A:A343: 05        .byte $05, $11   ; 
- D 1 - I - 0x036355 1A:A345: 05        .byte $05, $10   ; 
- D 1 - I - 0x036357 1A:A347: 05        .byte $05, $11   ; 
- D 1 - I - 0x036359 1A:A349: 05        .byte $05, $10   ; 
- D 1 - I - 0x03635B 1A:A34B: 05        .byte $05, $0F   ; 
- D 1 - I - 0x03635D 1A:A34D: 05        .byte $05, $10   ; 
- D 1 - I - 0x03635F 1A:A34F: 05        .byte $05, $11   ; 
- D 1 - I - 0x036361 1A:A351: 05        .byte $05, $10   ; 
- D 1 - I - 0x036363 1A:A353: 05        .byte $05, $11   ; 
- D 1 - I - 0x036365 1A:A355: 05        .byte $05, $10   ; 
- D 1 - I - 0x036367 1A:A357: 05        .byte $05, $11   ; 
- D 1 - I - 0x036369 1A:A359: 05        .byte $05, $10   ; 
- D 1 - I - 0x03636B 1A:A35B: FF        .byte $FF   ; loop
- D 1 - I - 0x03636C 1A:A35C: 3F A3     .word off_A33F_05



off_A35E_06:
- D 1 - I - 0x03636E 1A:A35E: 0A        .byte $0A, $05   ; таймер + индекс
- D 1 - I - 0x036370 1A:A360: 0A        .byte $0A, $06   ; 
- D 1 - I - 0x036372 1A:A362: 0F        .byte $0F, $07   ; 
off_A364:
- D 1 - I - 0x036374 1A:A364: 05        .byte $05, $12   ; 
- D 1 - I - 0x036376 1A:A366: 05        .byte $05, $13   ; 
- D 1 - I - 0x036378 1A:A368: FF        .byte $FF   ; loop
- D 1 - I - 0x036379 1A:A369: 64 A3     .word off_A364



off_A36B_07:
- D 1 - I - 0x03637B 1A:A36B: 08        .byte $08, $14   ; таймер + индекс
- D 1 - I - 0x03637D 1A:A36D: 08        .byte $08, $15   ; 
- D 1 - I - 0x03637F 1A:A36F: FF        .byte $FF   ; loop
- D 1 - I - 0x036380 1A:A370: 6B A3     .word off_A36B_07



off_A372_08:
- D 1 - I - 0x036382 1A:A372: 80        .byte $80, $00   ; таймер + индекс
- D 1 - I - 0x036384 1A:A374: FF        .byte $FF   ; loop
- D 1 - I - 0x036385 1A:A375: 72 A3     .word off_A372_08



off_A377_09:
- D 1 - I - 0x036387 1A:A377: 03        .byte $03, $16   ; таймер + индекс
- D 1 - I - 0x036389 1A:A379: 03        .byte $03, $17   ; 
- D 1 - I - 0x03638B 1A:A37B: 03        .byte $03, $19   ; 
- D 1 - I - 0x03638D 1A:A37D: 03        .byte $03, $18   ; 
- D 1 - I - 0x03638F 1A:A37F: 05        .byte $05, $16   ; 
- D 1 - I - 0x036391 1A:A381: 05        .byte $05, $17   ; 
- D 1 - I - 0x036393 1A:A383: 05        .byte $05, $19   ; 
- D 1 - I - 0x036395 1A:A385: 05        .byte $05, $18   ; 
- D 1 - I - 0x036397 1A:A387: 03        .byte $03, $16   ; 
- D 1 - I - 0x036399 1A:A389: 03        .byte $03, $17   ; 
- D 1 - I - 0x03639B 1A:A38B: 03        .byte $03, $19   ; 
- D 1 - I - 0x03639D 1A:A38D: 03        .byte $03, $18   ; 
- D 1 - I - 0x03639F 1A:A38F: FF        .byte $FF   ; loop
- D 1 - I - 0x0363A0 1A:A390: 77 A3     .word off_A377_09



off_A392_0A:
- D 1 - I - 0x0363A2 1A:A392: 07        .byte $07, $1A   ; таймер + индекс
- D 1 - I - 0x0363A4 1A:A394: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363A6 1A:A396: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363A8 1A:A398: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363AA 1A:A39A: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363AC 1A:A39C: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363AE 1A:A39E: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363B0 1A:A3A0: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363B2 1A:A3A2: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363B4 1A:A3A4: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363B6 1A:A3A6: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363B8 1A:A3A8: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363BA 1A:A3AA: 07        .byte $07, $1A   ; 
- D 1 - I - 0x0363BC 1A:A3AC: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363BE 1A:A3AE: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C0 1A:A3B0: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363C2 1A:A3B2: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C4 1A:A3B4: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363C6 1A:A3B6: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C8 1A:A3B8: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363CA 1A:A3BA: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363CC 1A:A3BC: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363CE 1A:A3BE: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363D0 1A:A3C0: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363D2 1A:A3C2: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363D4 1A:A3C4: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363D6 1A:A3C6: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363D8 1A:A3C8: FF        .byte $FF   ; loop
- D 1 - I - 0x0363D9 1A:A3C9: 92 A3     .word off_A392_0A



off_A3CB_0B:
- D 1 - I - 0x0363DB 1A:A3CB: 07        .byte $07, $1E   ; таймер + индекс
- D 1 - I - 0x0363DD 1A:A3CD: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363DF 1A:A3CF: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363E1 1A:A3D1: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363E3 1A:A3D3: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363E5 1A:A3D5: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363E7 1A:A3D7: 07        .byte $07, $1E   ; 
- D 1 - I - 0x0363E9 1A:A3D9: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363EB 1A:A3DB: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363ED 1A:A3DD: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363EF 1A:A3DF: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363F1 1A:A3E1: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363F3 1A:A3E3: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363F5 1A:A3E5: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363F7 1A:A3E7: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363F9 1A:A3E9: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363FB 1A:A3EB: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363FD 1A:A3ED: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363FF 1A:A3EF: 07        .byte $07, $1B   ; 
- D 1 - I - 0x036401 1A:A3F1: FF        .byte $FF   ; loop
- D 1 - I - 0x036402 1A:A3F2: CB A3     .word off_A3CB_0B



off_A3F4_0C:
- D 1 - I - 0x036404 1A:A3F4: 07        .byte $07, $1F   ; таймер + индекс
- D 1 - I - 0x036406 1A:A3F6: 05        .byte $05, $02   ; 
- D 1 - I - 0x036408 1A:A3F8: 05        .byte $05, $03   ; 
- D 1 - I - 0x03640A 1A:A3FA: 05        .byte $05, $02   ; 
- D 1 - I - 0x03640C 1A:A3FC: 05        .byte $05, $03   ; 
- D 1 - I - 0x03640E 1A:A3FE: 05        .byte $05, $02   ; 
- D 1 - I - 0x036410 1A:A400: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036412 1A:A402: 05        .byte $05, $03   ; 
- D 1 - I - 0x036414 1A:A404: 05        .byte $05, $0C   ; 
- D 1 - I - 0x036416 1A:A406: 07        .byte $07, $03   ; 
- D 1 - I - 0x036418 1A:A408: 05        .byte $05, $02   ; 
- D 1 - I - 0x03641A 1A:A40A: 07        .byte $07, $1F   ; 
- D 1 - I - 0x03641C 1A:A40C: 05        .byte $05, $02   ; 
- D 1 - I - 0x03641E 1A:A40E: 07        .byte $07, $03   ; 
- D 1 - I - 0x036420 1A:A410: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036422 1A:A412: 05        .byte $05, $03   ; 
- D 1 - I - 0x036424 1A:A414: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036426 1A:A416: 05        .byte $05, $03   ; 
- D 1 - I - 0x036428 1A:A418: 07        .byte $07, $0C   ; 
- D 1 - I - 0x03642A 1A:A41A: 05        .byte $05, $03   ; 
- D 1 - I - 0x03642C 1A:A41C: 07        .byte $07, $0C   ; 
- D 1 - I - 0x03642E 1A:A41E: 05        .byte $05, $03   ; 
- D 1 - I - 0x036430 1A:A420: 05        .byte $05, $02   ; 
- D 1 - I - 0x036432 1A:A422: FF        .byte $FF   ; loop
- D 1 - I - 0x036433 1A:A423: F4 A3     .word off_A3F4_0C



off_A425_0D:
- D 1 - I - 0x036435 1A:A425: EF        .byte $EF, $00   ; таймер + индекс
- - - - - - 0x036437 1A:A427: FF        .byte $FF   ; loop
- - - - - - 0x036438 1A:A428: 25 A4     .word off_A425_0D



tbl_A42A_ppu_байты_анимаций_чарли:
; 0x03643A
    .word off_A46A_00
    .word off_A48F_01
    .word off_A494_02
    .word off_A499_03
    .word off_A49E_04
    .word off_A4C3_05
    .word off_A4E8_06
    .word off_A4ED_07
    .word off_A4F2_08
    .word off_A517_09
    .word off_A51C_0A
    .word off_A521_0B
    .word off_A546_0C
    .word $0000  ; 0D unused
    .word $0000  ; 0E unused
    .word off_A54B_0F
    .word off_A570_10
    .word off_A57A_11
    .word off_A584_12
    .word off_A5A9_13
    .word off_A5B8_14
    .word off_A5DD_15
    .word off_A5E6_16
    .word off_A60B_17
    .word off_A615_18
    .word off_A61F_19
    .word off_A629_1A
    .word off_A64E_1B
    .word off_A655_1C
    .word off_A65C_1D
    .word off_A663_1E
    .word off_A688_1F



off_A46A_00:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $B6, $B7, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A48F_01:
    .byte $01
    .word $2323
    .byte $DA
    
    .byte $00   ; end token



off_A494_02:
    .byte $01
    .word $2323
    .byte $F1
    
    .byte $00   ; end token



off_A499_03:
    .byte $01
    .word $2323
    .byte $D8
    
    .byte $00   ; end token



off_A49E_04:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $B7, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A4C3_05:
    .byte $03
    .word $2302
    .byte $B4, $E4, $E5
    
    .byte $03
    .word $2322
    .byte $B6, $E6, $E7
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A4E8_06:
    .byte $01
    .word $2323
    .byte $D9
    
    .byte $00   ; end token



off_A4ED_07:
    .byte $01
    .word $2323
    .byte $F2
    
    .byte $00   ; end token



off_A4F2_08:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A517_09:
    .byte $01
    .word $2323
    .byte $DB
    
    .byte $00   ; end token



off_A51C_0A:
    .byte $01
    .word $2323
    .byte $F0
    
    .byte $00   ; end token



off_A521_0B:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $DA, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A546_0C:
    .byte $01
    .word $2323
    .byte $F3
    
    .byte $00   ; end token



off_A54B_0F:
    .byte $03
    .word $2302
    .byte $F4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $F5, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $B0, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A570_10:
    .byte $01
    .word $2302
    .byte $E1
    
    .byte $02
    .word $2322
    .byte $E3, $DB
    
    .byte $00   ; end token



off_A57A_11:
    .byte $01
    .word $2302
    .byte $F4
    
    .byte $02
    .word $2322
    .byte $F5, $F0
    
    .byte $00   ; end token



off_A584_12:
    .byte $03
    .word $2302
    .byte $00, $00, $00
    
    .byte $03
    .word $2322
    .byte $00, $B2, $B3
    
    .byte $03
    .word $2342
    .byte $AD, $B8, $B9
    
    .byte $03
    .word $2362
    .byte $AF, $BA, $BB
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A5A9_13:
    .byte $03
    .word $2322
    .byte $A6, $A7, $00
    
    .byte $01
    .word $2342
    .byte $AC
    
    .byte $01
    .word $2362
    .byte $AE
    
    .byte $00   ; end token



off_A5B8_14:
    .byte $03
    .word $2302
    .byte $00, $00, $F8
    
    .byte $03
    .word $2322
    .byte $00, $00, $FA
    
    .byte $03
    .word $2342
    .byte $AD, $B8, $B9
    
    .byte $03
    .word $2362
    .byte $AF, $BA, $BB
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A5DD_15:
    .byte $01
    .word $2304
    .byte $F9
    
    .byte $01
    .word $2324
    .byte $FB
    
    .byte $00   ; end token



off_A5E6_16:
    .byte $03
    .word $2302
    .byte $DC, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $DF, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $B0, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A60B_17:
    .byte $01
    .word $2302
    .byte $DD
    
    .byte $02
    .word $2322
    .byte $DF, $DB
    
    .byte $00   ; end token



off_A615_18:
    .byte $01
    .word $2302
    .byte $DD
    
    .byte $02
    .word $2322
    .byte $F5, $DB
    
    .byte $00   ; end token



off_A61F_19:
    .byte $01
    .word $2302
    .byte $DE
    
    .byte $02
    .word $2322
    .byte $F5, $F0
    
    .byte $00   ; end token



off_A629_1A:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $D6, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $D3, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A64E_1B:
    .byte $03
    .word $2322
    .byte $E9, $F7, $ED
    
    .byte $00   ; end token



off_A655_1C:
    .byte $03
    .word $2322
    .byte $D1, $D4, $D5
    
    .byte $00   ; end token



off_A65C_1D:
    .byte $03
    .word $2322
    .byte $D1, $D7, $D5
    
    .byte $00   ; end token



off_A663_1E:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



off_A688_1F:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $DA, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $D6, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $D3, $EA
    
    .byte $02
    .word $23F0
    .byte $44, $11
    
    .byte $00   ; end token



tbl_A6AD:
; везде по 300 байтов
- D 1 - - - 0x0366BD 1A:A6AD: B5 A6     .word off_A6B5_00_4_3_3
- D 1 - - - 0x0366BF 1A:A6AF: E1 A7     .word off_A7E1_01_4_4_2
- D 1 - - - 0x0366C1 1A:A6B1: 0D A9     .word off_A90D_02_3_5_2
- D 1 - - - 0x0366C3 1A:A6B3: 39 AA     .word off_AA39_03_brazil_tactics



off_A6B5_00_4_3_3:
- D 1 - I - 0x0366C5 1A:A6B5: 00        .byte $00
- D 1 - I - 0x0366C6 1A:A6B6: 24        .byte $24
- D 1 - I - 0x0366C7 1A:A6B7: 1E        .byte $1E
- D 1 - I - 0x0366C8 1A:A6B8: 1E        .byte $1E
- D 1 - I - 0x0366C9 1A:A6B9: 26        .byte $26
- D 1 - I - 0x0366CA 1A:A6BA: 28        .byte $28
- D 1 - I - 0x0366CB 1A:A6BB: 03        .byte $03
- D 1 - I - 0x0366CC 1A:A6BC: 03        .byte $03
- D 1 - I - 0x0366CD 1A:A6BD: 4A        .byte $4A
- D 1 - I - 0x0366CE 1A:A6BE: 4A        .byte $4A
- D 1 - I - 0x0366CF 1A:A6BF: 6B        .byte $6B
- D 1 - I - 0x0366D0 1A:A6C0: 6B        .byte $6B
- D 1 - I - 0x0366D1 1A:A6C1: 28        .byte $28
- D 1 - I - 0x0366D2 1A:A6C2: 44        .byte $44
- D 1 - I - 0x0366D3 1A:A6C3: 79        .byte $79
- D 1 - I - 0x0366D4 1A:A6C4: 7D        .byte $7D
- D 1 - I - 0x0366D5 1A:A6C5: 40        .byte $40
- D 1 - I - 0x0366D6 1A:A6C6: 66        .byte $66
- D 1 - I - 0x0366D7 1A:A6C7: 6C        .byte $6C
- D 1 - I - 0x0366D8 1A:A6C8: 6C        .byte $6C
- D 1 - I - 0x0366D9 1A:A6C9: 3C        .byte $3C
- D 1 - I - 0x0366DA 1A:A6CA: 3C        .byte $3C
- D 1 - I - 0x0366DB 1A:A6CB: 50        .byte $50
- D 1 - I - 0x0366DC 1A:A6CC: 50        .byte $50
- D 1 - I - 0x0366DD 1A:A6CD: 4C        .byte $4C
- D 1 - I - 0x0366DE 1A:A6CE: 3F        .byte $3F
- D 1 - I - 0x0366DF 1A:A6CF: 28        .byte $28
- D 1 - I - 0x0366E0 1A:A6D0: 35        .byte $35
- D 1 - I - 0x0366E1 1A:A6D1: 62        .byte $62
- D 1 - I - 0x0366E2 1A:A6D2: 7A        .byte $7A
- D 1 - I - 0x0366E3 1A:A6D3: 83        .byte $83
- D 1 - I - 0x0366E4 1A:A6D4: A7        .byte $A7
- D 1 - I - 0x0366E5 1A:A6D5: 67        .byte $67
- D 1 - I - 0x0366E6 1A:A6D6: 67        .byte $67
- D 1 - I - 0x0366E7 1A:A6D7: A8        .byte $A8
- D 1 - I - 0x0366E8 1A:A6D8: 95        .byte $95
- D 1 - I - 0x0366E9 1A:A6D9: 70        .byte $70
- D 1 - I - 0x0366EA 1A:A6DA: 98        .byte $98
- D 1 - I - 0x0366EB 1A:A6DB: 84        .byte $84
- D 1 - I - 0x0366EC 1A:A6DC: 87        .byte $87
- D 1 - I - 0x0366ED 1A:A6DD: 54        .byte $54
- D 1 - I - 0x0366EE 1A:A6DE: 6C        .byte $6C
- D 1 - I - 0x0366EF 1A:A6DF: 80        .byte $80
- D 1 - I - 0x0366F0 1A:A6E0: 80        .byte $80
- D 1 - I - 0x0366F1 1A:A6E1: 6F        .byte $6F
- D 1 - I - 0x0366F2 1A:A6E2: 7C        .byte $7C
- D 1 - I - 0x0366F3 1A:A6E3: 4B        .byte $4B
- D 1 - I - 0x0366F4 1A:A6E4: 65        .byte $65
- D 1 - I - 0x0366F5 1A:A6E5: 9D        .byte $9D
- D 1 - I - 0x0366F6 1A:A6E6: AC        .byte $AC
- D 1 - I - 0x0366F7 1A:A6E7: BF        .byte $BF
- D 1 - I - 0x0366F8 1A:A6E8: BF        .byte $BF
- D 1 - I - 0x0366F9 1A:A6E9: AE        .byte $AE
- D 1 - I - 0x0366FA 1A:A6EA: C7        .byte $C7
- D 1 - I - 0x0366FB 1A:A6EB: C4        .byte $C4
- D 1 - I - 0x0366FC 1A:A6EC: C4        .byte $C4
- D 1 - I - 0x0366FD 1A:A6ED: 95        .byte $95
- D 1 - I - 0x0366FE 1A:A6EE: B6        .byte $B6
- D 1 - I - 0x0366FF 1A:A6EF: B4        .byte $B4
- D 1 - I - 0x036700 1A:A6F0: C0        .byte $C0
- D 1 - I - 0x036701 1A:A6F1: 90        .byte $90
- D 1 - I - 0x036702 1A:A6F2: 90        .byte $90
- D 1 - I - 0x036703 1A:A6F3: A5        .byte $A5
- D 1 - I - 0x036704 1A:A6F4: A5        .byte $A5
- D 1 - I - 0x036705 1A:A6F5: 94        .byte $94
- D 1 - I - 0x036706 1A:A6F6: 94        .byte $94
- D 1 - I - 0x036707 1A:A6F7: 7E        .byte $7E
- D 1 - I - 0x036708 1A:A6F8: 7E        .byte $7E
- D 1 - I - 0x036709 1A:A6F9: C3        .byte $C3
- D 1 - I - 0x03670A 1A:A6FA: C3        .byte $C3
- D 1 - I - 0x03670B 1A:A6FB: DF        .byte $DF
- D 1 - I - 0x03670C 1A:A6FC: DF        .byte $DF
- D 1 - I - 0x03670D 1A:A6FD: AD        .byte $AD
- D 1 - I - 0x03670E 1A:A6FE: C6        .byte $C6
- D 1 - I - 0x03670F 1A:A6FF: DC        .byte $DC
- D 1 - I - 0x036710 1A:A700: DC        .byte $DC
- D 1 - I - 0x036711 1A:A701: D1        .byte $D1
- D 1 - I - 0x036712 1A:A702: D1        .byte $D1
- D 1 - I - 0x036713 1A:A703: D8        .byte $D8
- D 1 - I - 0x036714 1A:A704: D8        .byte $D8
- D 1 - I - 0x036715 1A:A705: A8        .byte $A8
- D 1 - I - 0x036716 1A:A706: A8        .byte $A8
- D 1 - I - 0x036717 1A:A707: B1        .byte $B1
- D 1 - I - 0x036718 1A:A708: B1        .byte $B1
- D 1 - I - 0x036719 1A:A709: 95        .byte $95
- D 1 - I - 0x03671A 1A:A70A: 95        .byte $95
- D 1 - I - 0x03671B 1A:A70B: 7E        .byte $7E
- D 1 - I - 0x03671C 1A:A70C: 7E        .byte $7E
- D 1 - I - 0x03671D 1A:A70D: D1        .byte $D1
- D 1 - I - 0x03671E 1A:A70E: D1        .byte $D1
- D 1 - I - 0x03671F 1A:A70F: E0        .byte $E0
- D 1 - I - 0x036720 1A:A710: E0        .byte $E0
- D 1 - I - 0x036721 1A:A711: D3        .byte $D3
- D 1 - I - 0x036722 1A:A712: D3        .byte $D3
- D 1 - I - 0x036723 1A:A713: E9        .byte $E9
- D 1 - I - 0x036724 1A:A714: E9        .byte $E9
- D 1 - I - 0x036725 1A:A715: DE        .byte $DE
- D 1 - I - 0x036726 1A:A716: DE        .byte $DE
- D 1 - I - 0x036727 1A:A717: DC        .byte $DC
- D 1 - I - 0x036728 1A:A718: DC        .byte $DC
- D 1 - I - 0x036729 1A:A719: 03        .byte $03
- D 1 - I - 0x03672A 1A:A71A: 1B        .byte $1B
- D 1 - I - 0x03672B 1A:A71B: 08        .byte $08
- D 1 - I - 0x03672C 1A:A71C: 20        .byte $20
- D 1 - I - 0x03672D 1A:A71D: 1C        .byte $1C
- D 1 - I - 0x03672E 1A:A71E: 1D        .byte $1D
- D 1 - I - 0x03672F 1A:A71F: 06        .byte $06
- D 1 - I - 0x036730 1A:A720: 11        .byte $11
- D 1 - I - 0x036731 1A:A721: 25        .byte $25
- D 1 - I - 0x036732 1A:A722: 33        .byte $33
- D 1 - I - 0x036733 1A:A723: 5F        .byte $5F
- D 1 - I - 0x036734 1A:A724: 5F        .byte $5F
- D 1 - I - 0x036735 1A:A725: 2B        .byte $2B
- D 1 - I - 0x036736 1A:A726: 44        .byte $44
- D 1 - I - 0x036737 1A:A727: 72        .byte $72
- D 1 - I - 0x036738 1A:A728: 72        .byte $72
- D 1 - I - 0x036739 1A:A729: 35        .byte $35
- D 1 - I - 0x03673A 1A:A72A: 4E        .byte $4E
- D 1 - I - 0x03673B 1A:A72B: 54        .byte $54
- D 1 - I - 0x03673C 1A:A72C: 54        .byte $54
- D 1 - I - 0x03673D 1A:A72D: 3C        .byte $3C
- D 1 - I - 0x03673E 1A:A72E: 48        .byte $48
- D 1 - I - 0x03673F 1A:A72F: 47        .byte $47
- D 1 - I - 0x036740 1A:A730: 53        .byte $53
- D 1 - I - 0x036741 1A:A731: 41        .byte $41
- D 1 - I - 0x036742 1A:A732: 41        .byte $41
- D 1 - I - 0x036743 1A:A733: 37        .byte $37
- D 1 - I - 0x036744 1A:A734: 37        .byte $37
- D 1 - I - 0x036745 1A:A735: 57        .byte $57
- D 1 - I - 0x036746 1A:A736: 7B        .byte $7B
- D 1 - I - 0x036747 1A:A737: 83        .byte $83
- D 1 - I - 0x036748 1A:A738: 8F        .byte $8F
- D 1 - I - 0x036749 1A:A739: 5C        .byte $5C
- D 1 - I - 0x03674A 1A:A73A: 80        .byte $80
- D 1 - I - 0x03674B 1A:A73B: 8A        .byte $8A
- D 1 - I - 0x03674C 1A:A73C: A3        .byte $A3
- D 1 - I - 0x03674D 1A:A73D: 71        .byte $71
- D 1 - I - 0x03674E 1A:A73E: 94        .byte $94
- D 1 - I - 0x03674F 1A:A73F: 78        .byte $78
- D 1 - I - 0x036750 1A:A740: 84        .byte $84
- D 1 - I - 0x036751 1A:A741: 6C        .byte $6C
- D 1 - I - 0x036752 1A:A742: 6C        .byte $6C
- D 1 - I - 0x036753 1A:A743: 77        .byte $77
- D 1 - I - 0x036754 1A:A744: 77        .byte $77
- D 1 - I - 0x036755 1A:A745: 71        .byte $71
- D 1 - I - 0x036756 1A:A746: 71        .byte $71
- D 1 - I - 0x036757 1A:A747: 66        .byte $66
- D 1 - I - 0x036758 1A:A748: 66        .byte $66
- D 1 - I - 0x036759 1A:A749: AA        .byte $AA
- D 1 - I - 0x03675A 1A:A74A: 93        .byte $93
- D 1 - I - 0x03675B 1A:A74B: CB        .byte $CB
- D 1 - I - 0x03675C 1A:A74C: B3        .byte $B3
- D 1 - I - 0x03675D 1A:A74D: B0        .byte $B0
- D 1 - I - 0x03675E 1A:A74E: 98        .byte $98
- D 1 - I - 0x03675F 1A:A74F: B8        .byte $B8
- D 1 - I - 0x036760 1A:A750: C7        .byte $C7
- D 1 - I - 0x036761 1A:A751: 95        .byte $95
- D 1 - I - 0x036762 1A:A752: AE        .byte $AE
- D 1 - I - 0x036763 1A:A753: A8        .byte $A8
- D 1 - I - 0x036764 1A:A754: C0        .byte $C0
- D 1 - I - 0x036765 1A:A755: 9C        .byte $9C
- D 1 - I - 0x036766 1A:A756: 9C        .byte $9C
- D 1 - I - 0x036767 1A:A757: A7        .byte $A7
- D 1 - I - 0x036768 1A:A758: A7        .byte $A7
- D 1 - I - 0x036769 1A:A759: 96        .byte $96
- D 1 - I - 0x03676A 1A:A75A: 96        .byte $96
- D 1 - I - 0x03676B 1A:A75B: 7D        .byte $7D
- D 1 - I - 0x03676C 1A:A75C: 7D        .byte $7D
- D 1 - I - 0x03676D 1A:A75D: B7        .byte $B7
- D 1 - I - 0x03676E 1A:A75E: D0        .byte $D0
- D 1 - I - 0x03676F 1A:A75F: E3        .byte $E3
- D 1 - I - 0x036770 1A:A760: E3        .byte $E3
- D 1 - I - 0x036771 1A:A761: BC        .byte $BC
- D 1 - I - 0x036772 1A:A762: D3        .byte $D3
- D 1 - I - 0x036773 1A:A763: DD        .byte $DD
- D 1 - I - 0x036774 1A:A764: DD        .byte $DD
- D 1 - I - 0x036775 1A:A765: C5        .byte $C5
- D 1 - I - 0x036776 1A:A766: DE        .byte $DE
- D 1 - I - 0x036777 1A:A767: D8        .byte $D8
- D 1 - I - 0x036778 1A:A768: D8        .byte $D8
- D 1 - I - 0x036779 1A:A769: 9C        .byte $9C
- D 1 - I - 0x03677A 1A:A76A: 9C        .byte $9C
- D 1 - I - 0x03677B 1A:A76B: A7        .byte $A7
- D 1 - I - 0x03677C 1A:A76C: A7        .byte $A7
- D 1 - I - 0x03677D 1A:A76D: AD        .byte $AD
- D 1 - I - 0x03677E 1A:A76E: AD        .byte $AD
- D 1 - I - 0x03677F 1A:A76F: 8A        .byte $8A
- D 1 - I - 0x036780 1A:A770: 8A        .byte $8A
- D 1 - I - 0x036781 1A:A771: CF        .byte $CF
- D 1 - I - 0x036782 1A:A772: DC        .byte $DC
- D 1 - I - 0x036783 1A:A773: EF        .byte $EF
- D 1 - I - 0x036784 1A:A774: EF        .byte $EF
- D 1 - I - 0x036785 1A:A775: D4        .byte $D4
- D 1 - I - 0x036786 1A:A776: DF        .byte $DF
- D 1 - I - 0x036787 1A:A777: E9        .byte $E9
- D 1 - I - 0x036788 1A:A778: E9        .byte $E9
- D 1 - I - 0x036789 1A:A779: DE        .byte $DE
- D 1 - I - 0x03678A 1A:A77A: EA        .byte $EA
- D 1 - I - 0x03678B 1A:A77B: E4        .byte $E4
- D 1 - I - 0x03678C 1A:A77C: E4        .byte $E4
- D 1 - I - 0x03678D 1A:A77D: 1D        .byte $1D
- D 1 - I - 0x03678E 1A:A77E: 1D        .byte $1D
- D 1 - I - 0x03678F 1A:A77F: 0B        .byte $0B
- D 1 - I - 0x036790 1A:A780: 2F        .byte $2F
- D 1 - I - 0x036791 1A:A781: 2D        .byte $2D
- D 1 - I - 0x036792 1A:A782: 39        .byte $39
- D 1 - I - 0x036793 1A:A783: 08        .byte $08
- D 1 - I - 0x036794 1A:A784: 08        .byte $08
- D 1 - I - 0x036795 1A:A785: 2B        .byte $2B
- D 1 - I - 0x036796 1A:A786: 3F        .byte $3F
- D 1 - I - 0x036797 1A:A787: 77        .byte $77
- D 1 - I - 0x036798 1A:A788: 77        .byte $77
- D 1 - I - 0x036799 1A:A789: 51        .byte $51
- D 1 - I - 0x03679A 1A:A78A: 51        .byte $51
- D 1 - I - 0x03679B 1A:A78B: 7E        .byte $7E
- D 1 - I - 0x03679C 1A:A78C: 82        .byte $82
- D 1 - I - 0x03679D 1A:A78D: 43        .byte $43
- D 1 - I - 0x03679E 1A:A78E: 65        .byte $65
- D 1 - I - 0x03679F 1A:A78F: 60        .byte $60
- D 1 - I - 0x0367A0 1A:A790: 60        .byte $60
- D 1 - I - 0x0367A1 1A:A791: 4B        .byte $4B
- D 1 - I - 0x0367A2 1A:A792: 4B        .byte $4B
- D 1 - I - 0x0367A3 1A:A793: 47        .byte $47
- D 1 - I - 0x0367A4 1A:A794: 47        .byte $47
- D 1 - I - 0x0367A5 1A:A795: 4F        .byte $4F
- D 1 - I - 0x0367A6 1A:A796: 44        .byte $44
- D 1 - I - 0x0367A7 1A:A797: 2B        .byte $2B
- D 1 - I - 0x0367A8 1A:A798: 36        .byte $36
- D 1 - I - 0x0367A9 1A:A799: 64        .byte $64
- D 1 - I - 0x0367AA 1A:A79A: 64        .byte $64
- D 1 - I - 0x0367AB 1A:A79B: 80        .byte $80
- D 1 - I - 0x0367AC 1A:A79C: 9B        .byte $9B
- D 1 - I - 0x0367AD 1A:A79D: 69        .byte $69
- D 1 - I - 0x0367AE 1A:A79E: 82        .byte $82
- D 1 - I - 0x0367AF 1A:A79F: 97        .byte $97
- D 1 - I - 0x0367B0 1A:A7A0: B3        .byte $B3
- D 1 - I - 0x0367B1 1A:A7A1: 73        .byte $73
- D 1 - I - 0x0367B2 1A:A7A2: 94        .byte $94
- D 1 - I - 0x0367B3 1A:A7A3: 78        .byte $78
- D 1 - I - 0x0367B4 1A:A7A4: 9C        .byte $9C
- D 1 - I - 0x0367B5 1A:A7A5: 7B        .byte $7B
- D 1 - I - 0x0367B6 1A:A7A6: 7B        .byte $7B
- D 1 - I - 0x0367B7 1A:A7A7: 5F        .byte $5F
- D 1 - I - 0x0367B8 1A:A7A8: 77        .byte $77
- D 1 - I - 0x0367B9 1A:A7A9: 74        .byte $74
- D 1 - I - 0x0367BA 1A:A7AA: 7F        .byte $7F
- D 1 - I - 0x0367BB 1A:A7AB: 50        .byte $50
- D 1 - I - 0x0367BC 1A:A7AC: 66        .byte $66
- D 1 - I - 0x0367BD 1A:A7AD: AD        .byte $AD
- D 1 - I - 0x0367BE 1A:A7AE: C4        .byte $C4
- D 1 - I - 0x0367BF 1A:A7AF: BF        .byte $BF
- D 1 - I - 0x0367C0 1A:A7B0: CB        .byte $CB
- D 1 - I - 0x0367C1 1A:A7B1: A6        .byte $A6
- D 1 - I - 0x0367C2 1A:A7B2: AF        .byte $AF
- D 1 - I - 0x0367C3 1A:A7B3: C7        .byte $C7
- D 1 - I - 0x0367C4 1A:A7B4: C7        .byte $C7
- D 1 - I - 0x0367C5 1A:A7B5: 96        .byte $96
- D 1 - I - 0x0367C6 1A:A7B6: BD        .byte $BD
- D 1 - I - 0x0367C7 1A:A7B7: B4        .byte $B4
- D 1 - I - 0x0367C8 1A:A7B8: B4        .byte $B4
- D 1 - I - 0x0367C9 1A:A7B9: 9E        .byte $9E
- D 1 - I - 0x0367CA 1A:A7BA: 9E        .byte $9E
- D 1 - I - 0x0367CB 1A:A7BB: 9B        .byte $9B
- D 1 - I - 0x0367CC 1A:A7BC: 9B        .byte $9B
- D 1 - I - 0x0367CD 1A:A7BD: 97        .byte $97
- D 1 - I - 0x0367CE 1A:A7BE: 97        .byte $97
- D 1 - I - 0x0367CF 1A:A7BF: 7D        .byte $7D
- D 1 - I - 0x0367D0 1A:A7C0: 7D        .byte $7D
- D 1 - I - 0x0367D1 1A:A7C1: AE        .byte $AE
- D 1 - I - 0x0367D2 1A:A7C2: C5        .byte $C5
- D 1 - I - 0x0367D3 1A:A7C3: E3        .byte $E3
- D 1 - I - 0x0367D4 1A:A7C4: E3        .byte $E3
- D 1 - I - 0x0367D5 1A:A7C5: C8        .byte $C8
- D 1 - I - 0x0367D6 1A:A7C6: C8        .byte $C8
- D 1 - I - 0x0367D7 1A:A7C7: DF        .byte $DF
- D 1 - I - 0x0367D8 1A:A7C8: DF        .byte $DF
- D 1 - I - 0x0367D9 1A:A7C9: D2        .byte $D2
- D 1 - I - 0x0367DA 1A:A7CA: D2        .byte $D2
- D 1 - I - 0x0367DB 1A:A7CB: DC        .byte $DC
- D 1 - I - 0x0367DC 1A:A7CC: DC        .byte $DC
- D 1 - I - 0x0367DD 1A:A7CD: AA        .byte $AA
- D 1 - I - 0x0367DE 1A:A7CE: AA        .byte $AA
- D 1 - I - 0x0367DF 1A:A7CF: B3        .byte $B3
- D 1 - I - 0x0367E0 1A:A7D0: B3        .byte $B3
- D 1 - I - 0x0367E1 1A:A7D1: A2        .byte $A2
- D 1 - I - 0x0367E2 1A:A7D2: A2        .byte $A2
- D 1 - I - 0x0367E3 1A:A7D3: 7D        .byte $7D
- D 1 - I - 0x0367E4 1A:A7D4: 7D        .byte $7D
- D 1 - I - 0x0367E5 1A:A7D5: D0        .byte $D0
- D 1 - I - 0x0367E6 1A:A7D6: D0        .byte $D0
- D 1 - I - 0x0367E7 1A:A7D7: DF        .byte $DF
- D 1 - I - 0x0367E8 1A:A7D8: DF        .byte $DF
- D 1 - I - 0x0367E9 1A:A7D9: D2        .byte $D2
- D 1 - I - 0x0367EA 1A:A7DA: D2        .byte $D2
- D 1 - I - 0x0367EB 1A:A7DB: EA        .byte $EA
- D 1 - I - 0x0367EC 1A:A7DC: EA        .byte $EA
- D 1 - I - 0x0367ED 1A:A7DD: DD        .byte $DD
- D 1 - I - 0x0367EE 1A:A7DE: DD        .byte $DD
- D 1 - I - 0x0367EF 1A:A7DF: DB        .byte $DB
- D 1 - I - 0x0367F0 1A:A7E0: DB        .byte $DB



off_A7E1_01_4_4_2:
- D 1 - I - 0x0367F1 1A:A7E1: 00        .byte $00
- D 1 - I - 0x0367F2 1A:A7E2: 24        .byte $24
- D 1 - I - 0x0367F3 1A:A7E3: 12        .byte $12
- D 1 - I - 0x0367F4 1A:A7E4: 12        .byte $12
- D 1 - I - 0x0367F5 1A:A7E5: 26        .byte $26
- D 1 - I - 0x0367F6 1A:A7E6: 32        .byte $32
- D 1 - I - 0x0367F7 1A:A7E7: 03        .byte $03
- D 1 - I - 0x0367F8 1A:A7E8: 03        .byte $03
- D 1 - I - 0x0367F9 1A:A7E9: 49        .byte $49
- D 1 - I - 0x0367FA 1A:A7EA: 54        .byte $54
- D 1 - I - 0x0367FB 1A:A7EB: 51        .byte $51
- D 1 - I - 0x0367FC 1A:A7EC: 51        .byte $51
- D 1 - I - 0x0367FD 1A:A7ED: 1D        .byte $1D
- D 1 - I - 0x0367FE 1A:A7EE: 36        .byte $36
- D 1 - I - 0x0367FF 1A:A7EF: 7F        .byte $7F
- D 1 - I - 0x036800 1A:A7F0: 7F        .byte $7F
- D 1 - I - 0x036801 1A:A7F1: 40        .byte $40
- D 1 - I - 0x036802 1A:A7F2: 5A        .byte $5A
- D 1 - I - 0x036803 1A:A7F3: 6C        .byte $6C
- D 1 - I - 0x036804 1A:A7F4: 70        .byte $70
- D 1 - I - 0x036805 1A:A7F5: 30        .byte $30
- D 1 - I - 0x036806 1A:A7F6: 6C        .byte $6C
- D 1 - I - 0x036807 1A:A7F7: 44        .byte $44
- D 1 - I - 0x036808 1A:A7F8: 52        .byte $52
- D 1 - I - 0x036809 1A:A7F9: 26        .byte $26
- D 1 - I - 0x03680A 1A:A7FA: 26        .byte $26
- D 1 - I - 0x03680B 1A:A7FB: 29        .byte $29
- D 1 - I - 0x03680C 1A:A7FC: 29        .byte $29
- D 1 - I - 0x03680D 1A:A7FD: 84        .byte $84
- D 1 - I - 0x03680E 1A:A7FE: 79        .byte $79
- D 1 - I - 0x03680F 1A:A7FF: 75        .byte $75
- D 1 - I - 0x036810 1A:A800: 8E        .byte $8E
- D 1 - I - 0x036811 1A:A801: 67        .byte $67
- D 1 - I - 0x036812 1A:A802: 4D        .byte $4D
- D 1 - I - 0x036813 1A:A803: 97        .byte $97
- D 1 - I - 0x036814 1A:A804: 97        .byte $97
- D 1 - I - 0x036815 1A:A805: 64        .byte $64
- D 1 - I - 0x036816 1A:A806: 89        .byte $89
- D 1 - I - 0x036817 1A:A807: 9C        .byte $9C
- D 1 - I - 0x036818 1A:A808: 93        .byte $93
- D 1 - I - 0x036819 1A:A809: 54        .byte $54
- D 1 - I - 0x03681A 1A:A80A: 9C        .byte $9C
- D 1 - I - 0x03681B 1A:A80B: 68        .byte $68
- D 1 - I - 0x03681C 1A:A80C: 82        .byte $82
- D 1 - I - 0x03681D 1A:A80D: 57        .byte $57
- D 1 - I - 0x03681E 1A:A80E: 57        .byte $57
- D 1 - I - 0x03681F 1A:A80F: 4D        .byte $4D
- D 1 - I - 0x036820 1A:A810: 4D        .byte $4D
- D 1 - I - 0x036821 1A:A811: B4        .byte $B4
- D 1 - I - 0x036822 1A:A812: A9        .byte $A9
- D 1 - I - 0x036823 1A:A813: B2        .byte $B2
- D 1 - I - 0x036824 1A:A814: B2        .byte $B2
- D 1 - I - 0x036825 1A:A815: 89        .byte $89
- D 1 - I - 0x036826 1A:A816: A3        .byte $A3
- D 1 - I - 0x036827 1A:A817: BB        .byte $BB
- D 1 - I - 0x036828 1A:A818: C6        .byte $C6
- D 1 - I - 0x036829 1A:A819: 9F        .byte $9F
- D 1 - I - 0x03682A 1A:A81A: AD        .byte $AD
- D 1 - I - 0x03682B 1A:A81B: CC        .byte $CC
- D 1 - I - 0x03682C 1A:A81C: C4        .byte $C4
- D 1 - I - 0x03682D 1A:A81D: 79        .byte $79
- D 1 - I - 0x03682E 1A:A81E: CC        .byte $CC
- D 1 - I - 0x03682F 1A:A81F: 8D        .byte $8D
- D 1 - I - 0x036830 1A:A820: B2        .byte $B2
- D 1 - I - 0x036831 1A:A821: 7C        .byte $7C
- D 1 - I - 0x036832 1A:A822: 7C        .byte $7C
- D 1 - I - 0x036833 1A:A823: 71        .byte $71
- D 1 - I - 0x036834 1A:A824: 71        .byte $71
- D 1 - I - 0x036835 1A:A825: C3        .byte $C3
- D 1 - I - 0x036836 1A:A826: E4        .byte $E4
- D 1 - I - 0x036837 1A:A827: C8        .byte $C8
- D 1 - I - 0x036838 1A:A828: C8        .byte $C8
- D 1 - I - 0x036839 1A:A829: A1        .byte $A1
- D 1 - I - 0x03683A 1A:A82A: C6        .byte $C6
- D 1 - I - 0x03683B 1A:A82B: DE        .byte $DE
- D 1 - I - 0x03683C 1A:A82C: DE        .byte $DE
- D 1 - I - 0x03683D 1A:A82D: D1        .byte $D1
- D 1 - I - 0x03683E 1A:A82E: D1        .byte $D1
- D 1 - I - 0x03683F 1A:A82F: CE        .byte $CE
- D 1 - I - 0x036840 1A:A830: DC        .byte $DC
- D 1 - I - 0x036841 1A:A831: 9C        .byte $9C
- D 1 - I - 0x036842 1A:A832: 9C        .byte $9C
- D 1 - I - 0x036843 1A:A833: 99        .byte $99
- D 1 - I - 0x036844 1A:A834: 99        .byte $99
- D 1 - I - 0x036845 1A:A835: 88        .byte $88
- D 1 - I - 0x036846 1A:A836: 88        .byte $88
- D 1 - I - 0x036847 1A:A837: 71        .byte $71
- D 1 - I - 0x036848 1A:A838: 71        .byte $71
- D 1 - I - 0x036849 1A:A839: DC        .byte $DC
- D 1 - I - 0x03684A 1A:A83A: DC        .byte $DC
- D 1 - I - 0x03684B 1A:A83B: D4        .byte $D4
- D 1 - I - 0x03684C 1A:A83C: D4        .byte $D4
- D 1 - I - 0x03684D 1A:A83D: D1        .byte $D1
- D 1 - I - 0x03684E 1A:A83E: D1        .byte $D1
- D 1 - I - 0x03684F 1A:A83F: EA        .byte $EA
- D 1 - I - 0x036850 1A:A840: EA        .byte $EA
- D 1 - I - 0x036851 1A:A841: DE        .byte $DE
- D 1 - I - 0x036852 1A:A842: DE        .byte $DE
- D 1 - I - 0x036853 1A:A843: E9        .byte $E9
- D 1 - I - 0x036854 1A:A844: E9        .byte $E9
- D 1 - I - 0x036855 1A:A845: 0E        .byte $0E
- D 1 - I - 0x036856 1A:A846: 0E        .byte $0E
- D 1 - I - 0x036857 1A:A847: 15        .byte $15
- D 1 - I - 0x036858 1A:A848: 15        .byte $15
- D 1 - I - 0x036859 1A:A849: 10        .byte $10
- D 1 - I - 0x03685A 1A:A84A: 10        .byte $10
- D 1 - I - 0x03685B 1A:A84B: 06        .byte $06
- D 1 - I - 0x03685C 1A:A84C: 06        .byte $06
- D 1 - I - 0x03685D 1A:A84D: 60        .byte $60
- D 1 - I - 0x03685E 1A:A84E: 4A        .byte $4A
- D 1 - I - 0x03685F 1A:A84F: 51        .byte $51
- D 1 - I - 0x036860 1A:A850: 6B        .byte $6B
- D 1 - I - 0x036861 1A:A851: 37        .byte $37
- D 1 - I - 0x036862 1A:A852: 41        .byte $41
- D 1 - I - 0x036863 1A:A853: 73        .byte $73
- D 1 - I - 0x036864 1A:A854: 83        .byte $83
- D 1 - I - 0x036865 1A:A855: 34        .byte $34
- D 1 - I - 0x036866 1A:A856: 65        .byte $65
- D 1 - I - 0x036867 1A:A857: 70        .byte $70
- D 1 - I - 0x036868 1A:A858: 78        .byte $78
- D 1 - I - 0x036869 1A:A859: 3C        .byte $3C
- D 1 - I - 0x03686A 1A:A85A: 6C        .byte $6C
- D 1 - I - 0x03686B 1A:A85B: 47        .byte $47
- D 1 - I - 0x03686C 1A:A85C: 77        .byte $77
- D 1 - I - 0x03686D 1A:A85D: 35        .byte $35
- D 1 - I - 0x03686E 1A:A85E: 35        .byte $35
- D 1 - I - 0x03686F 1A:A85F: 2B        .byte $2B
- D 1 - I - 0x036870 1A:A860: 2B        .byte $2B
- D 1 - I - 0x036871 1A:A861: 56        .byte $56
- D 1 - I - 0x036872 1A:A862: 84        .byte $84
- D 1 - I - 0x036873 1A:A863: 5D        .byte $5D
- D 1 - I - 0x036874 1A:A864: 8F        .byte $8F
- D 1 - I - 0x036875 1A:A865: 80        .byte $80
- D 1 - I - 0x036876 1A:A866: 67        .byte $67
- D 1 - I - 0x036877 1A:A867: 8A        .byte $8A
- D 1 - I - 0x036878 1A:A868: A7        .byte $A7
- D 1 - I - 0x036879 1A:A869: 7B        .byte $7B
- D 1 - I - 0x03687A 1A:A86A: 71        .byte $71
- D 1 - I - 0x03687B 1A:A86B: 94        .byte $94
- D 1 - I - 0x03687C 1A:A86C: 9C        .byte $9C
- D 1 - I - 0x03687D 1A:A86D: 61        .byte $61
- D 1 - I - 0x03687E 1A:A86E: 90        .byte $90
- D 1 - I - 0x03687F 1A:A86F: 6A        .byte $6A
- D 1 - I - 0x036880 1A:A870: 9B        .byte $9B
- D 1 - I - 0x036881 1A:A871: 59        .byte $59
- D 1 - I - 0x036882 1A:A872: 6F        .byte $6F
- D 1 - I - 0x036883 1A:A873: 5B        .byte $5B
- D 1 - I - 0x036884 1A:A874: 74        .byte $74
- D 1 - I - 0x036885 1A:A875: 9D        .byte $9D
- D 1 - I - 0x036886 1A:A876: C0        .byte $C0
- D 1 - I - 0x036887 1A:A877: A6        .byte $A6
- D 1 - I - 0x036888 1A:A878: CB        .byte $CB
- D 1 - I - 0x036889 1A:A879: 93        .byte $93
- D 1 - I - 0x03688A 1A:A87A: 98        .byte $98
- D 1 - I - 0x03688B 1A:A87B: BC        .byte $BC
- D 1 - I - 0x03688C 1A:A87C: BB        .byte $BB
- D 1 - I - 0x03688D 1A:A87D: A3        .byte $A3
- D 1 - I - 0x03688E 1A:A87E: AD        .byte $AD
- D 1 - I - 0x03688F 1A:A87F: B7        .byte $B7
- D 1 - I - 0x036890 1A:A880: B8        .byte $B8
- D 1 - I - 0x036891 1A:A881: 85        .byte $85
- D 1 - I - 0x036892 1A:A882: CC        .byte $CC
- D 1 - I - 0x036893 1A:A883: 8E        .byte $8E
- D 1 - I - 0x036894 1A:A884: D7        .byte $D7
- D 1 - I - 0x036895 1A:A885: 7D        .byte $7D
- D 1 - I - 0x036896 1A:A886: 7D        .byte $7D
- D 1 - I - 0x036897 1A:A887: 72        .byte $72
- D 1 - I - 0x036898 1A:A888: 72        .byte $72
- D 1 - I - 0x036899 1A:A889: D0        .byte $D0
- D 1 - I - 0x03689A 1A:A88A: E4        .byte $E4
- D 1 - I - 0x03689B 1A:A88B: D3        .byte $D3
- D 1 - I - 0x03689C 1A:A88C: EF        .byte $EF
- D 1 - I - 0x03689D 1A:A88D: C3        .byte $C3
- D 1 - I - 0x03689E 1A:A88E: C8        .byte $C8
- D 1 - I - 0x03689F 1A:A88F: DE        .byte $DE
- D 1 - I - 0x0368A0 1A:A890: E2        .byte $E2
- D 1 - I - 0x0368A1 1A:A891: D2        .byte $D2
- D 1 - I - 0x0368A2 1A:A892: E9        .byte $E9
- D 1 - I - 0x0368A3 1A:A893: D9        .byte $D9
- D 1 - I - 0x0368A4 1A:A894: DD        .byte $DD
- D 1 - I - 0x0368A5 1A:A895: 85        .byte $85
- D 1 - I - 0x0368A6 1A:A896: 85        .byte $85
- D 1 - I - 0x0368A7 1A:A897: 8E        .byte $8E
- D 1 - I - 0x0368A8 1A:A898: 8E        .byte $8E
- D 1 - I - 0x0368A9 1A:A899: 95        .byte $95
- D 1 - I - 0x0368AA 1A:A89A: 95        .byte $95
- D 1 - I - 0x0368AB 1A:A89B: 72        .byte $72
- D 1 - I - 0x0368AC 1A:A89C: 72        .byte $72
- D 1 - I - 0x0368AD 1A:A89D: DB        .byte $DB
- D 1 - I - 0x0368AE 1A:A89E: DB        .byte $DB
- D 1 - I - 0x0368AF 1A:A89F: E0        .byte $E0
- D 1 - I - 0x0368B0 1A:A8A0: E0        .byte $E0
- D 1 - I - 0x0368B1 1A:A8A1: C5        .byte $C5
- D 1 - I - 0x0368B2 1A:A8A2: C5        .byte $C5
- D 1 - I - 0x0368B3 1A:A8A3: EA        .byte $EA
- D 1 - I - 0x0368B4 1A:A8A4: EA        .byte $EA
- D 1 - I - 0x0368B5 1A:A8A5: DE        .byte $DE
- D 1 - I - 0x0368B6 1A:A8A6: DE        .byte $DE
- D 1 - I - 0x0368B7 1A:A8A7: E9        .byte $E9
- D 1 - I - 0x0368B8 1A:A8A8: E9        .byte $E9
- D 1 - I - 0x0368B9 1A:A8A9: 11        .byte $11
- D 1 - I - 0x0368BA 1A:A8AA: 11        .byte $11
- D 1 - I - 0x0368BB 1A:A8AB: 0B        .byte $0B
- D 1 - I - 0x0368BC 1A:A8AC: 2F        .byte $2F
- D 1 - I - 0x0368BD 1A:A8AD: 2D        .byte $2D
- D 1 - I - 0x0368BE 1A:A8AE: 39        .byte $39
- D 1 - I - 0x0368BF 1A:A8AF: 08        .byte $08
- D 1 - I - 0x0368C0 1A:A8B0: 08        .byte $08
- D 1 - I - 0x0368C1 1A:A8B1: 4A        .byte $4A
- D 1 - I - 0x0368C2 1A:A8B2: 4A        .byte $4A
- D 1 - I - 0x0368C3 1A:A8B3: 52        .byte $52
- D 1 - I - 0x0368C4 1A:A8B4: 5F        .byte $5F
- D 1 - I - 0x0368C5 1A:A8B5: 1E        .byte $1E
- D 1 - I - 0x0368C6 1A:A8B6: 35        .byte $35
- D 1 - I - 0x0368C7 1A:A8B7: 73        .byte $73
- D 1 - I - 0x0368C8 1A:A8B8: 77        .byte $77
- D 1 - I - 0x0368C9 1A:A8B9: 43        .byte $43
- D 1 - I - 0x0368CA 1A:A8BA: 59        .byte $59
- D 1 - I - 0x0368CB 1A:A8BB: 7C        .byte $7C
- D 1 - I - 0x0368CC 1A:A8BC: 7C        .byte $7C
- D 1 - I - 0x0368CD 1A:A8BD: 3F        .byte $3F
- D 1 - I - 0x0368CE 1A:A8BE: 4A        .byte $4A
- D 1 - I - 0x0368CF 1A:A8BF: 3B        .byte $3B
- D 1 - I - 0x0368D0 1A:A8C0: 77        .byte $77
- D 1 - I - 0x0368D1 1A:A8C1: 2D        .byte $2D
- D 1 - I - 0x0368D2 1A:A8C2: 2D        .byte $2D
- D 1 - I - 0x0368D3 1A:A8C3: 2A        .byte $2A
- D 1 - I - 0x0368D4 1A:A8C4: 2A        .byte $2A
- D 1 - I - 0x0368D5 1A:A8C5: 6E        .byte $6E
- D 1 - I - 0x0368D6 1A:A8C6: 85        .byte $85
- D 1 - I - 0x0368D7 1A:A8C7: 82        .byte $82
- D 1 - I - 0x0368D8 1A:A8C8: 8F        .byte $8F
- D 1 - I - 0x0368D9 1A:A8C9: 64        .byte $64
- D 1 - I - 0x0368DA 1A:A8CA: 4E        .byte $4E
- D 1 - I - 0x0368DB 1A:A8CB: 98        .byte $98
- D 1 - I - 0x0368DC 1A:A8CC: A7        .byte $A7
- D 1 - I - 0x0368DD 1A:A8CD: 67        .byte $67
- D 1 - I - 0x0368DE 1A:A8CE: 8A        .byte $8A
- D 1 - I - 0x0368DF 1A:A8CF: 94        .byte $94
- D 1 - I - 0x0368E0 1A:A8D0: A1        .byte $A1
- D 1 - I - 0x0368E1 1A:A8D1: 79        .byte $79
- D 1 - I - 0x0368E2 1A:A8D2: 63        .byte $63
- D 1 - I - 0x0368E3 1A:A8D3: 5F        .byte $5F
- D 1 - I - 0x0368E4 1A:A8D4: A7        .byte $A7
- D 1 - I - 0x0368E5 1A:A8D5: 5C        .byte $5C
- D 1 - I - 0x0368E6 1A:A8D6: 5C        .byte $5C
- D 1 - I - 0x0368E7 1A:A8D7: 4E        .byte $4E
- D 1 - I - 0x0368E8 1A:A8D8: 4E        .byte $4E
- D 1 - I - 0x0368E9 1A:A8D9: A9        .byte $A9
- D 1 - I - 0x0368EA 1A:A8DA: A9        .byte $A9
- D 1 - I - 0x0368EB 1A:A8DB: B2        .byte $B2
- D 1 - I - 0x0368EC 1A:A8DC: BF        .byte $BF
- D 1 - I - 0x0368ED 1A:A8DD: A0        .byte $A0
- D 1 - I - 0x0368EE 1A:A8DE: 8A        .byte $8A
- D 1 - I - 0x0368EF 1A:A8DF: C7        .byte $C7
- D 1 - I - 0x0368F0 1A:A8E0: D7        .byte $D7
- D 1 - I - 0x0368F1 1A:A8E1: AE        .byte $AE
- D 1 - I - 0x0368F2 1A:A8E2: A4        .byte $A4
- D 1 - I - 0x0368F3 1A:A8E3: B8        .byte $B8
- D 1 - I - 0x0368F4 1A:A8E4: C5        .byte $C5
- D 1 - I - 0x0368F5 1A:A8E5: 86        .byte $86
- D 1 - I - 0x0368F6 1A:A8E6: B5        .byte $B5
- D 1 - I - 0x0368F7 1A:A8E7: 82        .byte $82
- D 1 - I - 0x0368F8 1A:A8E8: D7        .byte $D7
- D 1 - I - 0x0368F9 1A:A8E9: 7F        .byte $7F
- D 1 - I - 0x0368FA 1A:A8EA: 7F        .byte $7F
- D 1 - I - 0x0368FB 1A:A8EB: 72        .byte $72
- D 1 - I - 0x0368FC 1A:A8EC: 72        .byte $72
- D 1 - I - 0x0368FD 1A:A8ED: C3        .byte $C3
- D 1 - I - 0x0368FE 1A:A8EE: C3        .byte $C3
- D 1 - I - 0x0368FF 1A:A8EF: C8        .byte $C8
- D 1 - I - 0x036900 1A:A8F0: EF        .byte $EF
- D 1 - I - 0x036901 1A:A8F1: C5        .byte $C5
- D 1 - I - 0x036902 1A:A8F2: A2        .byte $A2
- D 1 - I - 0x036903 1A:A8F3: D5        .byte $D5
- D 1 - I - 0x036904 1A:A8F4: DF        .byte $DF
- D 1 - I - 0x036905 1A:A8F5: D2        .byte $D2
- D 1 - I - 0x036906 1A:A8F6: D2        .byte $D2
- D 1 - I - 0x036907 1A:A8F7: DD        .byte $DD
- D 1 - I - 0x036908 1A:A8F8: DD        .byte $DD
- D 1 - I - 0x036909 1A:A8F9: 92        .byte $92
- D 1 - I - 0x03690A 1A:A8FA: 92        .byte $92
- D 1 - I - 0x03690B 1A:A8FB: A7        .byte $A7
- D 1 - I - 0x03690C 1A:A8FC: A7        .byte $A7
- D 1 - I - 0x03690D 1A:A8FD: 8B        .byte $8B
- D 1 - I - 0x03690E 1A:A8FE: 8B        .byte $8B
- D 1 - I - 0x03690F 1A:A8FF: 72        .byte $72
- D 1 - I - 0x036910 1A:A900: 72        .byte $72
- D 1 - I - 0x036911 1A:A901: CF        .byte $CF
- D 1 - I - 0x036912 1A:A902: CF        .byte $CF
- D 1 - I - 0x036913 1A:A903: DF        .byte $DF
- D 1 - I - 0x036914 1A:A904: DF        .byte $DF
- D 1 - I - 0x036915 1A:A905: D2        .byte $D2
- D 1 - I - 0x036916 1A:A906: D2        .byte $D2
- D 1 - I - 0x036917 1A:A907: EA        .byte $EA
- D 1 - I - 0x036918 1A:A908: EA        .byte $EA
- D 1 - I - 0x036919 1A:A909: DD        .byte $DD
- D 1 - I - 0x03691A 1A:A90A: DD        .byte $DD
- D 1 - I - 0x03691B 1A:A90B: E9        .byte $E9
- D 1 - I - 0x03691C 1A:A90C: E9        .byte $E9



off_A90D_02_3_5_2:
- D 1 - I - 0x03691D 1A:A90D: 0C        .byte $0C
- D 1 - I - 0x03691E 1A:A90E: 30        .byte $30
- D 1 - I - 0x03691F 1A:A90F: 14        .byte $14
- D 1 - I - 0x036920 1A:A910: 14        .byte $14
- D 1 - I - 0x036921 1A:A911: 05        .byte $05
- D 1 - I - 0x036922 1A:A912: 05        .byte $05
- D 1 - I - 0x036923 1A:A913: 49        .byte $49
- D 1 - I - 0x036924 1A:A914: 27        .byte $27
- D 1 - I - 0x036925 1A:A915: 54        .byte $54
- D 1 - I - 0x036926 1A:A916: 56        .byte $56
- D 1 - I - 0x036927 1A:A917: 44        .byte $44
- D 1 - I - 0x036928 1A:A918: 53        .byte $53
- D 1 - I - 0x036929 1A:A919: 2A        .byte $2A
- D 1 - I - 0x03692A 1A:A91A: 35        .byte $35
- D 1 - I - 0x03692B 1A:A91B: 73        .byte $73
- D 1 - I - 0x03692C 1A:A91C: 7F        .byte $7F
- D 1 - I - 0x03692D 1A:A91D: 3F        .byte $3F
- D 1 - I - 0x03692E 1A:A91E: 5B        .byte $5B
- D 1 - I - 0x03692F 1A:A91F: 6C        .byte $6C
- D 1 - I - 0x036930 1A:A920: 70        .byte $70
- D 1 - I - 0x036931 1A:A921: 25        .byte $25
- D 1 - I - 0x036932 1A:A922: 25        .byte $25
- D 1 - I - 0x036933 1A:A923: 38        .byte $38
- D 1 - I - 0x036934 1A:A924: 38        .byte $38
- D 1 - I - 0x036935 1A:A925: 28        .byte $28
- D 1 - I - 0x036936 1A:A926: 28        .byte $28
- D 1 - I - 0x036937 1A:A927: 78        .byte $78
- D 1 - I - 0x036938 1A:A928: 4C        .byte $4C
- D 1 - I - 0x036939 1A:A929: 84        .byte $84
- D 1 - I - 0x03693A 1A:A92A: 62        .byte $62
- D 1 - I - 0x03693B 1A:A92B: 5C        .byte $5C
- D 1 - I - 0x03693C 1A:A92C: 83        .byte $83
- D 1 - I - 0x03693D 1A:A92D: 41        .byte $41
- D 1 - I - 0x03693E 1A:A92E: 66        .byte $66
- D 1 - I - 0x03693F 1A:A92F: 8B        .byte $8B
- D 1 - I - 0x036940 1A:A930: A2        .byte $A2
- D 1 - I - 0x036941 1A:A931: 70        .byte $70
- D 1 - I - 0x036942 1A:A932: A0        .byte $A0
- D 1 - I - 0x036943 1A:A933: 87        .byte $87
- D 1 - I - 0x036944 1A:A934: 9C        .byte $9C
- D 1 - I - 0x036945 1A:A935: 55        .byte $55
- D 1 - I - 0x036946 1A:A936: 55        .byte $55
- D 1 - I - 0x036947 1A:A937: 69        .byte $69
- D 1 - I - 0x036948 1A:A938: 69        .byte $69
- D 1 - I - 0x036949 1A:A939: 4D        .byte $4D
- D 1 - I - 0x03694A 1A:A93A: 4D        .byte $4D
- D 1 - I - 0x03694B 1A:A93B: B4        .byte $B4
- D 1 - I - 0x03694C 1A:A93C: 88        .byte $88
- D 1 - I - 0x03694D 1A:A93D: 9D        .byte $9D
- D 1 - I - 0x03694E 1A:A93E: CC        .byte $CC
- D 1 - I - 0x03694F 1A:A93F: B1        .byte $B1
- D 1 - I - 0x036950 1A:A940: BF        .byte $BF
- D 1 - I - 0x036951 1A:A941: C6        .byte $C6
- D 1 - I - 0x036952 1A:A942: BB        .byte $BB
- D 1 - I - 0x036953 1A:A943: C7        .byte $C7
- D 1 - I - 0x036954 1A:A944: D2        .byte $D2
- D 1 - I - 0x036955 1A:A945: B6        .byte $B6
- D 1 - I - 0x036956 1A:A946: AD        .byte $AD
- D 1 - I - 0x036957 1A:A947: C4        .byte $C4
- D 1 - I - 0x036958 1A:A948: C4        .byte $C4
- D 1 - I - 0x036959 1A:A949: 79        .byte $79
- D 1 - I - 0x03695A 1A:A94A: 79        .byte $79
- D 1 - I - 0x03695B 1A:A94B: 8D        .byte $8D
- D 1 - I - 0x03695C 1A:A94C: 8D        .byte $8D
- D 1 - I - 0x03695D 1A:A94D: 71        .byte $71
- D 1 - I - 0x03695E 1A:A94E: 71        .byte $71
- D 1 - I - 0x03695F 1A:A94F: D8        .byte $D8
- D 1 - I - 0x036960 1A:A950: AC        .byte $AC
- D 1 - I - 0x036961 1A:A951: C3        .byte $C3
- D 1 - I - 0x036962 1A:A952: E4        .byte $E4
- D 1 - I - 0x036963 1A:A953: D4        .byte $D4
- D 1 - I - 0x036964 1A:A954: D4        .byte $D4
- D 1 - I - 0x036965 1A:A955: A2        .byte $A2
- D 1 - I - 0x036966 1A:A956: C6        .byte $C6
- D 1 - I - 0x036967 1A:A957: DE        .byte $DE
- D 1 - I - 0x036968 1A:A958: DE        .byte $DE
- D 1 - I - 0x036969 1A:A959: D1        .byte $D1
- D 1 - I - 0x03696A 1A:A95A: D1        .byte $D1
- D 1 - I - 0x03696B 1A:A95B: DC        .byte $DC
- D 1 - I - 0x03696C 1A:A95C: DC        .byte $DC
- D 1 - I - 0x03696D 1A:A95D: 91        .byte $91
- D 1 - I - 0x03696E 1A:A95E: 91        .byte $91
- D 1 - I - 0x03696F 1A:A95F: 9A        .byte $9A
- D 1 - I - 0x036970 1A:A960: 9A        .byte $9A
- D 1 - I - 0x036971 1A:A961: 7E        .byte $7E
- D 1 - I - 0x036972 1A:A962: 7E        .byte $7E
- D 1 - I - 0x036973 1A:A963: AD        .byte $AD
- D 1 - I - 0x036974 1A:A964: C7        .byte $C7
- D 1 - I - 0x036975 1A:A965: D1        .byte $D1
- D 1 - I - 0x036976 1A:A966: D1        .byte $D1
- D 1 - I - 0x036977 1A:A967: E0        .byte $E0
- D 1 - I - 0x036978 1A:A968: E0        .byte $E0
- D 1 - I - 0x036979 1A:A969: DE        .byte $DE
- D 1 - I - 0x03697A 1A:A96A: DE        .byte $DE
- D 1 - I - 0x03697B 1A:A96B: E9        .byte $E9
- D 1 - I - 0x03697C 1A:A96C: E9        .byte $E9
- D 1 - I - 0x03697D 1A:A96D: EA        .byte $EA
- D 1 - I - 0x03697E 1A:A96E: EA        .byte $EA
- D 1 - I - 0x03697F 1A:A96F: DC        .byte $DC
- D 1 - I - 0x036980 1A:A970: DC        .byte $DC
- D 1 - I - 0x036981 1A:A971: 0F        .byte $0F
- D 1 - I - 0x036982 1A:A972: 0F        .byte $0F
- D 1 - I - 0x036983 1A:A973: 14        .byte $14
- D 1 - I - 0x036984 1A:A974: 14        .byte $14
- D 1 - I - 0x036985 1A:A975: 05        .byte $05
- D 1 - I - 0x036986 1A:A976: 05        .byte $05
- D 1 - I - 0x036987 1A:A977: 24        .byte $24
- D 1 - I - 0x036988 1A:A978: 33        .byte $33
- D 1 - I - 0x036989 1A:A979: 60        .byte $60
- D 1 - I - 0x03698A 1A:A97A: 4B        .byte $4B
- D 1 - I - 0x03698B 1A:A97B: 51        .byte $51
- D 1 - I - 0x03698C 1A:A97C: 43        .byte $43
- D 1 - I - 0x03698D 1A:A97D: 38        .byte $38
- D 1 - I - 0x03698E 1A:A97E: 2F        .byte $2F
- D 1 - I - 0x03698F 1A:A97F: 73        .byte $73
- D 1 - I - 0x036990 1A:A980: 83        .byte $83
- D 1 - I - 0x036991 1A:A981: 41        .byte $41
- D 1 - I - 0x036992 1A:A982: 59        .byte $59
- D 1 - I - 0x036993 1A:A983: 70        .byte $70
- D 1 - I - 0x036994 1A:A984: 78        .byte $78
- D 1 - I - 0x036995 1A:A985: 32        .byte $32
- D 1 - I - 0x036996 1A:A986: 32        .byte $32
- D 1 - I - 0x036997 1A:A987: 39        .byte $39
- D 1 - I - 0x036998 1A:A988: 39        .byte $39
- D 1 - I - 0x036999 1A:A989: 29        .byte $29
- D 1 - I - 0x03699A 1A:A98A: 29        .byte $29
- D 1 - I - 0x03699B 1A:A98B: 49        .byte $49
- D 1 - I - 0x03699C 1A:A98C: 7A        .byte $7A
- D 1 - I - 0x03699D 1A:A98D: 63        .byte $63
- D 1 - I - 0x03699E 1A:A98E: 84        .byte $84
- D 1 - I - 0x03699F 1A:A98F: 68        .byte $68
- D 1 - I - 0x0369A0 1A:A990: 8F        .byte $8F
- D 1 - I - 0x0369A1 1A:A991: 52        .byte $52
- D 1 - I - 0x0369A2 1A:A992: 81        .byte $81
- D 1 - I - 0x0369A3 1A:A993: 8B        .byte $8B
- D 1 - I - 0x0369A4 1A:A994: A7        .byte $A7
- D 1 - I - 0x0369A5 1A:A995: 71        .byte $71
- D 1 - I - 0x0369A6 1A:A996: A1        .byte $A1
- D 1 - I - 0x0369A7 1A:A997: 88        .byte $88
- D 1 - I - 0x0369A8 1A:A998: 9C        .byte $9C
- D 1 - I - 0x0369A9 1A:A999: 62        .byte $62
- D 1 - I - 0x0369AA 1A:A99A: 90        .byte $90
- D 1 - I - 0x0369AB 1A:A99B: 69        .byte $69
- D 1 - I - 0x0369AC 1A:A99C: 9B        .byte $9B
- D 1 - I - 0x0369AD 1A:A99D: 59        .byte $59
- D 1 - I - 0x0369AE 1A:A99E: 59        .byte $59
- D 1 - I - 0x0369AF 1A:A99F: B4        .byte $B4
- D 1 - I - 0x0369B0 1A:A9A0: 7A        .byte $7A
- D 1 - I - 0x0369B1 1A:A9A1: 93        .byte $93
- D 1 - I - 0x0369B2 1A:A9A2: C0        .byte $C0
- D 1 - I - 0x0369B3 1A:A9A3: 98        .byte $98
- D 1 - I - 0x0369B4 1A:A9A4: CB        .byte $CB
- D 1 - I - 0x0369B5 1A:A9A5: 81        .byte $81
- D 1 - I - 0x0369B6 1A:A9A6: BF        .byte $BF
- D 1 - I - 0x0369B7 1A:A9A7: B0        .byte $B0
- D 1 - I - 0x0369B8 1A:A9A8: BC        .byte $BC
- D 1 - I - 0x0369B9 1A:A9A9: A2        .byte $A2
- D 1 - I - 0x0369BA 1A:A9AA: C5        .byte $C5
- D 1 - I - 0x0369BB 1A:A9AB: AB        .byte $AB
- D 1 - I - 0x0369BC 1A:A9AC: B7        .byte $B7
- D 1 - I - 0x0369BD 1A:A9AD: 79        .byte $79
- D 1 - I - 0x0369BE 1A:A9AE: 90        .byte $90
- D 1 - I - 0x0369BF 1A:A9AF: 82        .byte $82
- D 1 - I - 0x0369C0 1A:A9B0: 9B        .byte $9B
- D 1 - I - 0x0369C1 1A:A9B1: 71        .byte $71
- D 1 - I - 0x0369C2 1A:A9B2: 71        .byte $71
- D 1 - I - 0x0369C3 1A:A9B3: D0        .byte $D0
- D 1 - I - 0x0369C4 1A:A9B4: B6        .byte $B6
- D 1 - I - 0x0369C5 1A:A9B5: C0        .byte $C0
- D 1 - I - 0x0369C6 1A:A9B6: E4        .byte $E4
- D 1 - I - 0x0369C7 1A:A9B7: CB        .byte $CB
- D 1 - I - 0x0369C8 1A:A9B8: EF        .byte $EF
- D 1 - I - 0x0369C9 1A:A9B9: D4        .byte $D4
- D 1 - I - 0x0369CA 1A:A9BA: BD        .byte $BD
- D 1 - I - 0x0369CB 1A:A9BB: E0        .byte $E0
- D 1 - I - 0x0369CC 1A:A9BC: DE        .byte $DE
- D 1 - I - 0x0369CD 1A:A9BD: E9        .byte $E9
- D 1 - I - 0x0369CE 1A:A9BE: D2        .byte $D2
- D 1 - I - 0x0369CF 1A:A9BF: DB        .byte $DB
- D 1 - I - 0x0369D0 1A:A9C0: DD        .byte $DD
- D 1 - I - 0x0369D1 1A:A9C1: 9D        .byte $9D
- D 1 - I - 0x0369D2 1A:A9C2: 9D        .byte $9D
- D 1 - I - 0x0369D3 1A:A9C3: A6        .byte $A6
- D 1 - I - 0x0369D4 1A:A9C4: A6        .byte $A6
- D 1 - I - 0x0369D5 1A:A9C5: 7D        .byte $7D
- D 1 - I - 0x0369D6 1A:A9C6: 7D        .byte $7D
- D 1 - I - 0x0369D7 1A:A9C7: D0        .byte $D0
- D 1 - I - 0x0369D8 1A:A9C8: D0        .byte $D0
- D 1 - I - 0x0369D9 1A:A9C9: DB        .byte $DB
- D 1 - I - 0x0369DA 1A:A9CA: DB        .byte $DB
- D 1 - I - 0x0369DB 1A:A9CB: E0        .byte $E0
- D 1 - I - 0x0369DC 1A:A9CC: E0        .byte $E0
- D 1 - I - 0x0369DD 1A:A9CD: D3        .byte $D3
- D 1 - I - 0x0369DE 1A:A9CE: D3        .byte $D3
- D 1 - I - 0x0369DF 1A:A9CF: EA        .byte $EA
- D 1 - I - 0x0369E0 1A:A9D0: EA        .byte $EA
- D 1 - I - 0x0369E1 1A:A9D1: DE        .byte $DE
- D 1 - I - 0x0369E2 1A:A9D2: DE        .byte $DE
- D 1 - I - 0x0369E3 1A:A9D3: E9        .byte $E9
- D 1 - I - 0x0369E4 1A:A9D4: E9        .byte $E9
- D 1 - I - 0x0369E5 1A:A9D5: 0F        .byte $0F
- D 1 - I - 0x0369E6 1A:A9D6: 0F        .byte $0F
- D 1 - I - 0x0369E7 1A:A9D7: 17        .byte $17
- D 1 - I - 0x0369E8 1A:A9D8: 3B        .byte $3B
- D 1 - I - 0x0369E9 1A:A9D9: 06        .byte $06
- D 1 - I - 0x0369EA 1A:A9DA: 06        .byte $06
- D 1 - I - 0x0369EB 1A:A9DB: 29        .byte $29
- D 1 - I - 0x0369EC 1A:A9DC: 36        .byte $36
- D 1 - I - 0x0369ED 1A:A9DD: 3F        .byte $3F
- D 1 - I - 0x0369EE 1A:A9DE: 48        .byte $48
- D 1 - I - 0x0369EF 1A:A9DF: 5F        .byte $5F
- D 1 - I - 0x0369F0 1A:A9E0: 5D        .byte $5D
- D 1 - I - 0x0369F1 1A:A9E1: 2C        .byte $2C
- D 1 - I - 0x0369F2 1A:A9E2: 52        .byte $52
- D 1 - I - 0x0369F3 1A:A9E3: 73        .byte $73
- D 1 - I - 0x0369F4 1A:A9E4: 77        .byte $77
- D 1 - I - 0x0369F5 1A:A9E5: 59        .byte $59
- D 1 - I - 0x0369F6 1A:A9E6: 44        .byte $44
- D 1 - I - 0x0369F7 1A:A9E7: 7C        .byte $7C
- D 1 - I - 0x0369F8 1A:A9E8: 7C        .byte $7C
- D 1 - I - 0x0369F9 1A:A9E9: 33        .byte $33
- D 1 - I - 0x0369FA 1A:A9EA: 33        .byte $33
- D 1 - I - 0x0369FB 1A:A9EB: 2E        .byte $2E
- D 1 - I - 0x0369FC 1A:A9EC: 2E        .byte $2E
- D 1 - I - 0x0369FD 1A:A9ED: 2B        .byte $2B
- D 1 - I - 0x0369FE 1A:A9EE: 2B        .byte $2B
- D 1 - I - 0x0369FF 1A:A9EF: 58        .byte $58
- D 1 - I - 0x036A00 1A:A9F0: 42        .byte $42
- D 1 - I - 0x036A01 1A:A9F1: 78        .byte $78
- D 1 - I - 0x036A02 1A:A9F2: 62        .byte $62
- D 1 - I - 0x036A03 1A:A9F3: 69        .byte $69
- D 1 - I - 0x036A04 1A:A9F4: 8F        .byte $8F
- D 1 - I - 0x036A05 1A:A9F5: 4F        .byte $4F
- D 1 - I - 0x036A06 1A:A9F6: 83        .byte $83
- D 1 - I - 0x036A07 1A:A9F7: 8C        .byte $8C
- D 1 - I - 0x036A08 1A:A9F8: A7        .byte $A7
- D 1 - I - 0x036A09 1A:A9F9: 67        .byte $67
- D 1 - I - 0x036A0A 1A:A9FA: A3        .byte $A3
- D 1 - I - 0x036A0B 1A:A9FB: 88        .byte $88
- D 1 - I - 0x036A0C 1A:A9FC: A1        .byte $A1
- D 1 - I - 0x036A0D 1A:A9FD: 62        .byte $62
- D 1 - I - 0x036A0E 1A:A9FE: 62        .byte $62
- D 1 - I - 0x036A0F 1A:A9FF: 5E        .byte $5E
- D 1 - I - 0x036A10 1A:AA00: 5E        .byte $5E
- D 1 - I - 0x036A11 1A:AA01: 4E        .byte $4E
- D 1 - I - 0x036A12 1A:AA02: 4E        .byte $4E
- D 1 - I - 0x036A13 1A:AA03: 7D        .byte $7D
- D 1 - I - 0x036A14 1A:AA04: 94        .byte $94
- D 1 - I - 0x036A15 1A:AA05: B4        .byte $B4
- D 1 - I - 0x036A16 1A:AA06: AA        .byte $AA
- D 1 - I - 0x036A17 1A:AA07: A6        .byte $A6
- D 1 - I - 0x036A18 1A:AA08: D7        .byte $D7
- D 1 - I - 0x036A19 1A:AA09: BF        .byte $BF
- D 1 - I - 0x036A1A 1A:AA0A: 8B        .byte $8B
- D 1 - I - 0x036A1B 1A:AA0B: C7        .byte $C7
- D 1 - I - 0x036A1C 1A:AA0C: C7        .byte $C7
- D 1 - I - 0x036A1D 1A:AA0D: AE        .byte $AE
- D 1 - I - 0x036A1E 1A:AA0E: BD        .byte $BD
- D 1 - I - 0x036A1F 1A:AA0F: B8        .byte $B8
- D 1 - I - 0x036A20 1A:AA10: C5        .byte $C5
- D 1 - I - 0x036A21 1A:AA11: 86        .byte $86
- D 1 - I - 0x036A22 1A:AA12: 86        .byte $86
- D 1 - I - 0x036A23 1A:AA13: 82        .byte $82
- D 1 - I - 0x036A24 1A:AA14: 82        .byte $82
- D 1 - I - 0x036A25 1A:AA15: 72        .byte $72
- D 1 - I - 0x036A26 1A:AA16: 72        .byte $72
- D 1 - I - 0x036A27 1A:AA17: A1        .byte $A1
- D 1 - I - 0x036A28 1A:AA18: C5        .byte $C5
- D 1 - I - 0x036A29 1A:AA19: CF        .byte $CF
- D 1 - I - 0x036A2A 1A:AA1A: CF        .byte $CF
- D 1 - I - 0x036A2B 1A:AA1B: C8        .byte $C8
- D 1 - I - 0x036A2C 1A:AA1C: EF        .byte $EF
- D 1 - I - 0x036A2D 1A:AA1D: AF        .byte $AF
- D 1 - I - 0x036A2E 1A:AA1E: E3        .byte $E3
- D 1 - I - 0x036A2F 1A:AA1F: DF        .byte $DF
- D 1 - I - 0x036A30 1A:AA20: DF        .byte $DF
- D 1 - I - 0x036A31 1A:AA21: D2        .byte $D2
- D 1 - I - 0x036A32 1A:AA22: D2        .byte $D2
- D 1 - I - 0x036A33 1A:AA23: DD        .byte $DD
- D 1 - I - 0x036A34 1A:AA24: DD        .byte $DD
- D 1 - I - 0x036A35 1A:AA25: 91        .byte $91
- D 1 - I - 0x036A36 1A:AA26: 91        .byte $91
- D 1 - I - 0x036A37 1A:AA27: 9A        .byte $9A
- D 1 - I - 0x036A38 1A:AA28: 9A        .byte $9A
- D 1 - I - 0x036A39 1A:AA29: 7D        .byte $7D
- D 1 - I - 0x036A3A 1A:AA2A: 7D        .byte $7D
- D 1 - I - 0x036A3B 1A:AA2B: DD        .byte $DD
- D 1 - I - 0x036A3C 1A:AA2C: DD        .byte $DD
- D 1 - I - 0x036A3D 1A:AA2D: DB        .byte $DB
- D 1 - I - 0x036A3E 1A:AA2E: DB        .byte $DB
- D 1 - I - 0x036A3F 1A:AA2F: D2        .byte $D2
- D 1 - I - 0x036A40 1A:AA30: D2        .byte $D2
- D 1 - I - 0x036A41 1A:AA31: AE        .byte $AE
- D 1 - I - 0x036A42 1A:AA32: C4        .byte $C4
- D 1 - I - 0x036A43 1A:AA33: DF        .byte $DF
- D 1 - I - 0x036A44 1A:AA34: DF        .byte $DF
- D 1 - I - 0x036A45 1A:AA35: E9        .byte $E9
- D 1 - I - 0x036A46 1A:AA36: E9        .byte $E9
- D 1 - I - 0x036A47 1A:AA37: EA        .byte $EA
- D 1 - I - 0x036A48 1A:AA38: EA        .byte $EA



off_AA39_03_brazil_tactics:
- D 1 - I - 0x036A49 1A:AA39: 0C        .byte $0C
- D 1 - I - 0x036A4A 1A:AA3A: 48        .byte $48
- D 1 - I - 0x036A4B 1A:AA3B: 20        .byte $20
- D 1 - I - 0x036A4C 1A:AA3C: 20        .byte $20
- D 1 - I - 0x036A4D 1A:AA3D: 1B        .byte $1B
- D 1 - I - 0x036A4E 1A:AA3E: 1B        .byte $1B
- D 1 - I - 0x036A4F 1A:AA3F: 11        .byte $11
- D 1 - I - 0x036A50 1A:AA40: 11        .byte $11
- D 1 - I - 0x036A51 1A:AA41: 40        .byte $40
- D 1 - I - 0x036A52 1A:AA42: 4D        .byte $4D
- D 1 - I - 0x036A53 1A:AA43: 6B        .byte $6B
- D 1 - I - 0x036A54 1A:AA44: 6B        .byte $6B
- D 1 - I - 0x036A55 1A:AA45: 36        .byte $36
- D 1 - I - 0x036A56 1A:AA46: 36        .byte $36
- D 1 - I - 0x036A57 1A:AA47: 7E        .byte $7E
- D 1 - I - 0x036A58 1A:AA48: 7E        .byte $7E
- D 1 - I - 0x036A59 1A:AA49: 63        .byte $63
- D 1 - I - 0x036A5A 1A:AA4A: 85        .byte $85
- D 1 - I - 0x036A5B 1A:AA4B: 3E        .byte $3E
- D 1 - I - 0x036A5C 1A:AA4C: 6C        .byte $6C
- D 1 - I - 0x036A5D 1A:AA4D: 30        .byte $30
- D 1 - I - 0x036A5E 1A:AA4E: 90        .byte $90
- D 1 - I - 0x036A5F 1A:AA4F: 45        .byte $45
- D 1 - I - 0x036A60 1A:AA50: 52        .byte $52
- D 1 - I - 0x036A61 1A:AA51: 33        .byte $33
- D 1 - I - 0x036A62 1A:AA52: 33        .byte $33
- D 1 - I - 0x036A63 1A:AA53: 36        .byte $36
- D 1 - I - 0x036A64 1A:AA54: 41        .byte $41
- D 1 - I - 0x036A65 1A:AA55: 58        .byte $58
- D 1 - I - 0x036A66 1A:AA56: 7C        .byte $7C
- D 1 - I - 0x036A67 1A:AA57: 83        .byte $83
- D 1 - I - 0x036A68 1A:AA58: 83        .byte $83
- D 1 - I - 0x036A69 1A:AA59: 5A        .byte $5A
- D 1 - I - 0x036A6A 1A:AA5A: 67        .byte $67
- D 1 - I - 0x036A6B 1A:AA5B: A2        .byte $A2
- D 1 - I - 0x036A6C 1A:AA5C: A2        .byte $A2
- D 1 - I - 0x036A6D 1A:AA5D: 86        .byte $86
- D 1 - I - 0x036A6E 1A:AA5E: AB        .byte $AB
- D 1 - I - 0x036A6F 1A:AA5F: 6D        .byte $6D
- D 1 - I - 0x036A70 1A:AA60: A8        .byte $A8
- D 1 - I - 0x036A71 1A:AA61: 60        .byte $60
- D 1 - I - 0x036A72 1A:AA62: B4        .byte $B4
- D 1 - I - 0x036A73 1A:AA63: 69        .byte $69
- D 1 - I - 0x036A74 1A:AA64: 69        .byte $69
- D 1 - I - 0x036A75 1A:AA65: 63        .byte $63
- D 1 - I - 0x036A76 1A:AA66: 63        .byte $63
- D 1 - I - 0x036A77 1A:AA67: 59        .byte $59
- D 1 - I - 0x036A78 1A:AA68: 7D        .byte $7D
- D 1 - I - 0x036A79 1A:AA69: 94        .byte $94
- D 1 - I - 0x036A7A 1A:AA6A: A1        .byte $A1
- D 1 - I - 0x036A7B 1A:AA6B: CB        .byte $CB
- D 1 - I - 0x036A7C 1A:AA6C: CB        .byte $CB
- D 1 - I - 0x036A7D 1A:AA6D: 8B        .byte $8B
- D 1 - I - 0x036A7E 1A:AA6E: A5        .byte $A5
- D 1 - I - 0x036A7F 1A:AA6F: C6        .byte $C6
- D 1 - I - 0x036A80 1A:AA70: C6        .byte $C6
- D 1 - I - 0x036A81 1A:AA71: B7        .byte $B7
- D 1 - I - 0x036A82 1A:AA72: C3        .byte $C3
- D 1 - I - 0x036A83 1A:AA73: 9D        .byte $9D
- D 1 - I - 0x036A84 1A:AA74: CC        .byte $CC
- D 1 - I - 0x036A85 1A:AA75: A8        .byte $A8
- D 1 - I - 0x036A86 1A:AA76: CC        .byte $CC
- D 1 - I - 0x036A87 1A:AA77: B1        .byte $B1
- D 1 - I - 0x036A88 1A:AA78: B1        .byte $B1
- D 1 - I - 0x036A89 1A:AA79: 88        .byte $88
- D 1 - I - 0x036A8A 1A:AA7A: 88        .byte $88
- D 1 - I - 0x036A8B 1A:AA7B: 96        .byte $96
- D 1 - I - 0x036A8C 1A:AA7C: 96        .byte $96
- D 1 - I - 0x036A8D 1A:AA7D: AC        .byte $AC
- D 1 - I - 0x036A8E 1A:AA7E: AC        .byte $AC
- D 1 - I - 0x036A8F 1A:AA7F: DF        .byte $DF
- D 1 - I - 0x036A90 1A:AA80: DF        .byte $DF
- D 1 - I - 0x036A91 1A:AA81: BA        .byte $BA
- D 1 - I - 0x036A92 1A:AA82: C6        .byte $C6
- D 1 - I - 0x036A93 1A:AA83: DC        .byte $DC
- D 1 - I - 0x036A94 1A:AA84: DC        .byte $DC
- D 1 - I - 0x036A95 1A:AA85: D1        .byte $D1
- D 1 - I - 0x036A96 1A:AA86: D1        .byte $D1
- D 1 - I - 0x036A97 1A:AA87: C2        .byte $C2
- D 1 - I - 0x036A98 1A:AA88: E4        .byte $E4
- D 1 - I - 0x036A99 1A:AA89: B4        .byte $B4
- D 1 - I - 0x036A9A 1A:AA8A: E4        .byte $E4
- D 1 - I - 0x036A9B 1A:AA8B: BE        .byte $BE
- D 1 - I - 0x036A9C 1A:AA8C: BE        .byte $BE
- D 1 - I - 0x036A9D 1A:AA8D: A0        .byte $A0
- D 1 - I - 0x036A9E 1A:AA8E: A0        .byte $A0
- D 1 - I - 0x036A9F 1A:AA8F: 97        .byte $97
- D 1 - I - 0x036AA0 1A:AA90: 97        .byte $97
- D 1 - I - 0x036AA1 1A:AA91: D1        .byte $D1
- D 1 - I - 0x036AA2 1A:AA92: D1        .byte $D1
- D 1 - I - 0x036AA3 1A:AA93: E0        .byte $E0
- D 1 - I - 0x036AA4 1A:AA94: E0        .byte $E0
- D 1 - I - 0x036AA5 1A:AA95: D3        .byte $D3
- D 1 - I - 0x036AA6 1A:AA96: D3        .byte $D3
- D 1 - I - 0x036AA7 1A:AA97: E9        .byte $E9
- D 1 - I - 0x036AA8 1A:AA98: E9        .byte $E9
- D 1 - I - 0x036AA9 1A:AA99: DE        .byte $DE
- D 1 - I - 0x036AAA 1A:AA9A: DE        .byte $DE
- D 1 - I - 0x036AAB 1A:AA9B: DC        .byte $DC
- D 1 - I - 0x036AAC 1A:AA9C: DC        .byte $DC
- D 1 - I - 0x036AAD 1A:AA9D: 0D        .byte $0D
- D 1 - I - 0x036AAE 1A:AA9E: 24        .byte $24
- D 1 - I - 0x036AAF 1A:AA9F: 16        .byte $16
- D 1 - I - 0x036AB0 1A:AAA0: 2F        .byte $2F
- D 1 - I - 0x036AB1 1A:AAA1: 05        .byte $05
- D 1 - I - 0x036AB2 1A:AAA2: 0F        .byte $0F
- D 1 - I - 0x036AB3 1A:AAA3: 06        .byte $06
- D 1 - I - 0x036AB4 1A:AAA4: 14        .byte $14
- D 1 - I - 0x036AB5 1A:AAA5: 35        .byte $35
- D 1 - I - 0x036AB6 1A:AAA6: 42        .byte $42
- D 1 - I - 0x036AB7 1A:AAA7: 77        .byte $77
- D 1 - I - 0x036AB8 1A:AAA8: 77        .byte $77
- D 1 - I - 0x036AB9 1A:AAA9: 2C        .byte $2C
- D 1 - I - 0x036ABA 1A:AAAA: 5C        .byte $5C
- D 1 - I - 0x036ABB 1A:AAAB: 72        .byte $72
- D 1 - I - 0x036ABC 1A:AAAC: 8B        .byte $8B
- D 1 - I - 0x036ABD 1A:AAAD: 58        .byte $58
- D 1 - I - 0x036ABE 1A:AAAE: 86        .byte $86
- D 1 - I - 0x036ABF 1A:AAAF: 33        .byte $33
- D 1 - I - 0x036AC0 1A:AAB0: 6C        .byte $6C
- D 1 - I - 0x036AC1 1A:AAB1: 3C        .byte $3C
- D 1 - I - 0x036AC2 1A:AAB2: 6C        .byte $6C
- D 1 - I - 0x036AC3 1A:AAB3: 47        .byte $47
- D 1 - I - 0x036AC4 1A:AAB4: 52        .byte $52
- D 1 - I - 0x036AC5 1A:AAB5: 28        .byte $28
- D 1 - I - 0x036AC6 1A:AAB6: 32        .byte $32
- D 1 - I - 0x036AC7 1A:AAB7: 2B        .byte $2B
- D 1 - I - 0x036AC8 1A:AAB8: 38        .byte $38
- D 1 - I - 0x036AC9 1A:AAB9: 7A        .byte $7A
- D 1 - I - 0x036ACA 1A:AABA: 72        .byte $72
- D 1 - I - 0x036ACB 1A:AABB: 8F        .byte $8F
- D 1 - I - 0x036ACC 1A:AABC: 8F        .byte $8F
- D 1 - I - 0x036ACD 1A:AABD: 5C        .byte $5C
- D 1 - I - 0x036ACE 1A:AABE: 80        .byte $80
- D 1 - I - 0x036ACF 1A:AABF: A2        .byte $A2
- D 1 - I - 0x036AD0 1A:AAC0: A2        .byte $A2
- D 1 - I - 0x036AD1 1A:AAC1: 9E        .byte $9E
- D 1 - I - 0x036AD2 1A:AAC2: 88        .byte $88
- D 1 - I - 0x036AD3 1A:AAC3: 4B        .byte $4B
- D 1 - I - 0x036AD4 1A:AAC4: 57        .byte $57
- D 1 - I - 0x036AD5 1A:AAC5: 78        .byte $78
- D 1 - I - 0x036AD6 1A:AAC6: C2        .byte $C2
- D 1 - I - 0x036AD7 1A:AAC7: 77        .byte $77
- D 1 - I - 0x036AD8 1A:AAC8: 5E        .byte $5E
- D 1 - I - 0x036AD9 1A:AAC9: 58        .byte $58
- D 1 - I - 0x036ADA 1A:AACA: 6F        .byte $6F
- D 1 - I - 0x036ADB 1A:AACB: 5B        .byte $5B
- D 1 - I - 0x036ADC 1A:AACC: 81        .byte $81
- D 1 - I - 0x036ADD 1A:AACD: A1        .byte $A1
- D 1 - I - 0x036ADE 1A:AACE: AF        .byte $AF
- D 1 - I - 0x036ADF 1A:AACF: CB        .byte $CB
- D 1 - I - 0x036AE0 1A:AAD0: CB        .byte $CB
- D 1 - I - 0x036AE1 1A:AAD1: 98        .byte $98
- D 1 - I - 0x036AE2 1A:AAD2: BD        .byte $BD
- D 1 - I - 0x036AE3 1A:AAD3: C6        .byte $C6
- D 1 - I - 0x036AE4 1A:AAD4: C6        .byte $C6
- D 1 - I - 0x036AE5 1A:AAD5: AB        .byte $AB
- D 1 - I - 0x036AE6 1A:AAD6: D0        .byte $D0
- D 1 - I - 0x036AE7 1A:AAD7: 92        .byte $92
- D 1 - I - 0x036AE8 1A:AAD8: CC        .byte $CC
- D 1 - I - 0x036AE9 1A:AAD9: A8        .byte $A8
- D 1 - I - 0x036AEA 1A:AADA: D8        .byte $D8
- D 1 - I - 0x036AEB 1A:AADB: B3        .byte $B3
- D 1 - I - 0x036AEC 1A:AADC: B3        .byte $B3
- D 1 - I - 0x036AED 1A:AADD: 7D        .byte $7D
- D 1 - I - 0x036AEE 1A:AADE: 7D        .byte $7D
- D 1 - I - 0x036AEF 1A:AADF: 7F        .byte $7F
- D 1 - I - 0x036AF0 1A:AAE0: 7F        .byte $7F
- D 1 - I - 0x036AF1 1A:AAE1: C6        .byte $C6
- D 1 - I - 0x036AF2 1A:AAE2: C6        .byte $C6
- D 1 - I - 0x036AF3 1A:AAE3: E3        .byte $E3
- D 1 - I - 0x036AF4 1A:AAE4: E3        .byte $E3
- D 1 - I - 0x036AF5 1A:AAE5: BC        .byte $BC
- D 1 - I - 0x036AF6 1A:AAE6: D4        .byte $D4
- D 1 - I - 0x036AF7 1A:AAE7: DE        .byte $DE
- D 1 - I - 0x036AF8 1A:AAE8: DE        .byte $DE
- D 1 - I - 0x036AF9 1A:AAE9: D0        .byte $D0
- D 1 - I - 0x036AFA 1A:AAEA: DD        .byte $DD
- D 1 - I - 0x036AFB 1A:AAEB: C3        .byte $C3
- D 1 - I - 0x036AFC 1A:AAEC: E4        .byte $E4
- D 1 - I - 0x036AFD 1A:AAED: A8        .byte $A8
- D 1 - I - 0x036AFE 1A:AAEE: D8        .byte $D8
- D 1 - I - 0x036AFF 1A:AAEF: B3        .byte $B3
- D 1 - I - 0x036B00 1A:AAF0: B3        .byte $B3
- D 1 - I - 0x036B01 1A:AAF1: 88        .byte $88
- D 1 - I - 0x036B02 1A:AAF2: 88        .byte $88
- D 1 - I - 0x036B03 1A:AAF3: 8A        .byte $8A
- D 1 - I - 0x036B04 1A:AAF4: 8A        .byte $8A
- D 1 - I - 0x036B05 1A:AAF5: C4        .byte $C4
- D 1 - I - 0x036B06 1A:AAF6: C4        .byte $C4
- D 1 - I - 0x036B07 1A:AAF7: E2        .byte $E2
- D 1 - I - 0x036B08 1A:AAF8: E2        .byte $E2
- D 1 - I - 0x036B09 1A:AAF9: DE        .byte $DE
- D 1 - I - 0x036B0A 1A:AAFA: DE        .byte $DE
- D 1 - I - 0x036B0B 1A:AAFB: EA        .byte $EA
- D 1 - I - 0x036B0C 1A:AAFC: EA        .byte $EA
- D 1 - I - 0x036B0D 1A:AAFD: E9        .byte $E9
- D 1 - I - 0x036B0E 1A:AAFE: E9        .byte $E9
- D 1 - I - 0x036B0F 1A:AAFF: D0        .byte $D0
- D 1 - I - 0x036B10 1A:AB00: D0        .byte $D0
- D 1 - I - 0x036B11 1A:AB01: 3C        .byte $3C
- D 1 - I - 0x036B12 1A:AB02: 1C        .byte $1C
- D 1 - I - 0x036B13 1A:AB03: 0B        .byte $0B
- D 1 - I - 0x036B14 1A:AB04: 2F        .byte $2F
- D 1 - I - 0x036B15 1A:AB05: 12        .byte $12
- D 1 - I - 0x036B16 1A:AB06: 12        .byte $12
- D 1 - I - 0x036B17 1A:AB07: 08        .byte $08
- D 1 - I - 0x036B18 1A:AB08: 20        .byte $20
- D 1 - I - 0x036B19 1A:AB09: 37        .byte $37
- D 1 - I - 0x036B1A 1A:AB0A: 44        .byte $44
- D 1 - I - 0x036B1B 1A:AB0B: 77        .byte $77
- D 1 - I - 0x036B1C 1A:AB0C: 5F        .byte $5F
- D 1 - I - 0x036B1D 1A:AB0D: 46        .byte $46
- D 1 - I - 0x036B1E 1A:AB0E: 69        .byte $69
- D 1 - I - 0x036B1F 1A:AB0F: 7E        .byte $7E
- D 1 - I - 0x036B20 1A:AB10: 82        .byte $82
- D 1 - I - 0x036B21 1A:AB11: 61        .byte $61
- D 1 - I - 0x036B22 1A:AB12: 70        .byte $70
- D 1 - I - 0x036B23 1A:AB13: 41        .byte $41
- D 1 - I - 0x036B24 1A:AB14: 5B        .byte $5B
- D 1 - I - 0x036B25 1A:AB15: 30        .byte $30
- D 1 - I - 0x036B26 1A:AB16: 90        .byte $90
- D 1 - I - 0x036B27 1A:AB17: 3B        .byte $3B
- D 1 - I - 0x036B28 1A:AB18: 6B        .byte $6B
- D 1 - I - 0x036B29 1A:AB19: 29        .byte $29
- D 1 - I - 0x036B2A 1A:AB1A: 3F        .byte $3F
- D 1 - I - 0x036B2B 1A:AB1B: 2B        .byte $2B
- D 1 - I - 0x036B2C 1A:AB1C: 43        .byte $43
- D 1 - I - 0x036B2D 1A:AB1D: 65        .byte $65
- D 1 - I - 0x036B2E 1A:AB1E: 5C        .byte $5C
- D 1 - I - 0x036B2F 1A:AB1F: 9B        .byte $9B
- D 1 - I - 0x036B30 1A:AB20: B3        .byte $B3
- D 1 - I - 0x036B31 1A:AB21: 8D        .byte $8D
- D 1 - I - 0x036B32 1A:AB22: 82        .byte $82
- D 1 - I - 0x036B33 1A:AB23: 8A        .byte $8A
- D 1 - I - 0x036B34 1A:AB24: B0        .byte $B0
- D 1 - I - 0x036B35 1A:AB25: 73        .byte $73
- D 1 - I - 0x036B36 1A:AB26: 9F        .byte $9F
- D 1 - I - 0x036B37 1A:AB27: 4D        .byte $4D
- D 1 - I - 0x036B38 1A:AB28: 60        .byte $60
- D 1 - I - 0x036B39 1A:AB29: 6C        .byte $6C
- D 1 - I - 0x036B3A 1A:AB2A: C0        .byte $C0
- D 1 - I - 0x036B3B 1A:AB2B: 6B        .byte $6B
- D 1 - I - 0x036B3C 1A:AB2C: A7        .byte $A7
- D 1 - I - 0x036B3D 1A:AB2D: 58        .byte $58
- D 1 - I - 0x036B3E 1A:AB2E: 63        .byte $63
- D 1 - I - 0x036B3F 1A:AB2F: 4F        .byte $4F
- D 1 - I - 0x036B40 1A:AB30: 73        .byte $73
- D 1 - I - 0x036B41 1A:AB31: A2        .byte $A2
- D 1 - I - 0x036B42 1A:AB32: 95        .byte $95
- D 1 - I - 0x036B43 1A:AB33: CB        .byte $CB
- D 1 - I - 0x036B44 1A:AB34: CB        .byte $CB
- D 1 - I - 0x036B45 1A:AB35: A5        .byte $A5
- D 1 - I - 0x036B46 1A:AB36: B0        .byte $B0
- D 1 - I - 0x036B47 1A:AB37: C6        .byte $C6
- D 1 - I - 0x036B48 1A:AB38: C9        .byte $C9
- D 1 - I - 0x036B49 1A:AB39: B8        .byte $B8
- D 1 - I - 0x036B4A 1A:AB3A: C3        .byte $C3
- D 1 - I - 0x036B4B 1A:AB3B: 7D        .byte $7D
- D 1 - I - 0x036B4C 1A:AB3C: 9D        .byte $9D
- D 1 - I - 0x036B4D 1A:AB3D: 85        .byte $85
- D 1 - I - 0x036B4E 1A:AB3E: CF        .byte $CF
- D 1 - I - 0x036B4F 1A:AB3F: 9B        .byte $9B
- D 1 - I - 0x036B50 1A:AB40: 9B        .byte $9B
- D 1 - I - 0x036B51 1A:AB41: 7C        .byte $7C
- D 1 - I - 0x036B52 1A:AB42: 93        .byte $93
- D 1 - I - 0x036B53 1A:AB43: 74        .byte $74
- D 1 - I - 0x036B54 1A:AB44: A4        .byte $A4
- D 1 - I - 0x036B55 1A:AB45: AE        .byte $AE
- D 1 - I - 0x036B56 1A:AB46: C7        .byte $C7
- D 1 - I - 0x036B57 1A:AB47: EF        .byte $EF
- D 1 - I - 0x036B58 1A:AB48: EF        .byte $EF
- D 1 - I - 0x036B59 1A:AB49: D5        .byte $D5
- D 1 - I - 0x036B5A 1A:AB4A: D5        .byte $D5
- D 1 - I - 0x036B5B 1A:AB4B: DE        .byte $DE
- D 1 - I - 0x036B5C 1A:AB4C: DE        .byte $DE
- D 1 - I - 0x036B5D 1A:AB4D: D1        .byte $D1
- D 1 - I - 0x036B5E 1A:AB4E: D1        .byte $D1
- D 1 - I - 0x036B5F 1A:AB4F: B8        .byte $B8
- D 1 - I - 0x036B60 1A:AB50: CC        .byte $CC
- D 1 - I - 0x036B61 1A:AB51: 9D        .byte $9D
- D 1 - I - 0x036B62 1A:AB52: DB        .byte $DB
- D 1 - I - 0x036B63 1A:AB53: B3        .byte $B3
- D 1 - I - 0x036B64 1A:AB54: B3        .byte $B3
- D 1 - I - 0x036B65 1A:AB55: 88        .byte $88
- D 1 - I - 0x036B66 1A:AB56: 88        .byte $88
- D 1 - I - 0x036B67 1A:AB57: 7F        .byte $7F
- D 1 - I - 0x036B68 1A:AB58: 7F        .byte $7F
- D 1 - I - 0x036B69 1A:AB59: D0        .byte $D0
- D 1 - I - 0x036B6A 1A:AB5A: D0        .byte $D0
- D 1 - I - 0x036B6B 1A:AB5B: DF        .byte $DF
- D 1 - I - 0x036B6C 1A:AB5C: DF        .byte $DF
- D 1 - I - 0x036B6D 1A:AB5D: D2        .byte $D2
- D 1 - I - 0x036B6E 1A:AB5E: D2        .byte $D2
- D 1 - I - 0x036B6F 1A:AB5F: EA        .byte $EA
- D 1 - I - 0x036B70 1A:AB60: EA        .byte $EA
- D 1 - I - 0x036B71 1A:AB61: DD        .byte $DD
- D 1 - I - 0x036B72 1A:AB62: DD        .byte $DD
- D 1 - I - 0x036B73 1A:AB63: E9        .byte $E9
- D 1 - I - 0x036B74 1A:AB64: E9        .byte $E9



tbl_AB65:
; везде по 300 байтов
- D 1 - - - 0x036B75 1A:AB65: 7D AB     .word off_AB7D_00
- D 1 - - - 0x036B77 1A:AB67: A9 AC     .word off_ACA9_01
- D 1 - - - 0x036B79 1A:AB69: D5 AD     .word off_ADD5_02
- D 1 - - - 0x036B7B 1A:AB6B: 01 AF     .word off_AF01_03
- D 1 - - - 0x036B7D 1A:AB6D: 2D B0     .word off_B02D_04
- D 1 - - - 0x036B7F 1A:AB6F: 59 B1     .word off_B159_05
- D 1 - - - 0x036B81 1A:AB71: 85 B2     .word off_B285_06
- D 1 - - - 0x036B83 1A:AB73: B1 B3     .word off_B3B1_07
- D 1 - - - 0x036B85 1A:AB75: DD B4     .word off_B4DD_08
- D 1 - - - 0x036B87 1A:AB77: 09 B6     .word off_B609_09
- D 1 - - - 0x036B89 1A:AB79: 35 B7     .word off_B735_0A
- D 1 - - - 0x036B8B 1A:AB7B: 61 B8     .word off_B861_0B



off_AB7D_00:
- D 1 - I - 0x036B8D 1A:AB7D: F0        .byte $F0
- D 1 - I - 0x036B8E 1A:AB7E: F0        .byte $F0
- D 1 - I - 0x036B8F 1A:AB7F: 07        .byte $07
- D 1 - I - 0x036B90 1A:AB80: 07        .byte $07
- D 1 - I - 0x036B91 1A:AB81: 04        .byte $04
- D 1 - I - 0x036B92 1A:AB82: 04        .byte $04
- D 1 - I - 0x036B93 1A:AB83: F0        .byte $F0
- D 1 - I - 0x036B94 1A:AB84: F0        .byte $F0
- D 1 - I - 0x036B95 1A:AB85: F0        .byte $F0
- D 1 - I - 0x036B96 1A:AB86: 1C        .byte $1C
- D 1 - I - 0x036B97 1A:AB87: 39        .byte $39
- D 1 - I - 0x036B98 1A:AB88: 6A        .byte $6A
- D 1 - I - 0x036B99 1A:AB89: 11        .byte $11
- D 1 - I - 0x036B9A 1A:AB8A: 11        .byte $11
- D 1 - I - 0x036B9B 1A:AB8B: 71        .byte $71
- D 1 - I - 0x036B9C 1A:AB8C: 5A        .byte $5A
- D 1 - I - 0x036B9D 1A:AB8D: 1E        .byte $1E
- D 1 - I - 0x036B9E 1A:AB8E: 1E        .byte $1E
- D 1 - I - 0x036B9F 1A:AB8F: F0        .byte $F0
- D 1 - I - 0x036BA0 1A:AB90: 60        .byte $60
- D 1 - I - 0x036BA1 1A:AB91: F0        .byte $F0
- D 1 - I - 0x036BA2 1A:AB92: F0        .byte $F0
- D 1 - I - 0x036BA3 1A:AB93: 06        .byte $06
- D 1 - I - 0x036BA4 1A:AB94: 1F        .byte $1F
- D 1 - I - 0x036BA5 1A:AB95: 04        .byte $04
- D 1 - I - 0x036BA6 1A:AB96: 1C        .byte $1C
- D 1 - I - 0x036BA7 1A:AB97: 0F        .byte $0F
- D 1 - I - 0x036BA8 1A:AB98: 24        .byte $24
- D 1 - I - 0x036BA9 1A:AB99: F0        .byte $F0
- D 1 - I - 0x036BAA 1A:AB9A: 33        .byte $33
- D 1 - I - 0x036BAB 1A:AB9B: 76        .byte $76
- D 1 - I - 0x036BAC 1A:AB9C: 5D        .byte $5D
- D 1 - I - 0x036BAD 1A:AB9D: 29        .byte $29
- D 1 - I - 0x036BAE 1A:AB9E: 36        .byte $36
- D 1 - I - 0x036BAF 1A:AB9F: 7C        .byte $7C
- D 1 - I - 0x036BB0 1A:ABA0: 62        .byte $62
- D 1 - I - 0x036BB1 1A:ABA1: 4C        .byte $4C
- D 1 - I - 0x036BB2 1A:ABA2: 66        .byte $66
- D 1 - I - 0x036BB3 1A:ABA3: F0        .byte $F0
- D 1 - I - 0x036BB4 1A:ABA4: F0        .byte $F0
- D 1 - I - 0x036BB5 1A:ABA5: 3E        .byte $3E
- D 1 - I - 0x036BB6 1A:ABA6: 3C        .byte $3C
- D 1 - I - 0x036BB7 1A:ABA7: 1F        .byte $1F
- D 1 - I - 0x036BB8 1A:ABA8: 3A        .byte $3A
- D 1 - I - 0x036BB9 1A:ABA9: 35        .byte $35
- D 1 - I - 0x036BBA 1A:ABAA: 34        .byte $34
- D 1 - I - 0x036BBB 1A:ABAB: 1B        .byte $1B
- D 1 - I - 0x036BBC 1A:ABAC: 11        .byte $11
- D 1 - I - 0x036BBD 1A:ABAD: F0        .byte $F0
- D 1 - I - 0x036BBE 1A:ABAE: 4C        .byte $4C
- D 1 - I - 0x036BBF 1A:ABAF: 69        .byte $69
- D 1 - I - 0x036BC0 1A:ABB0: 8E        .byte $8E
- D 1 - I - 0x036BC1 1A:ABB1: 4E        .byte $4E
- D 1 - I - 0x036BC2 1A:ABB2: 8B        .byte $8B
- D 1 - I - 0x036BC3 1A:ABB3: 88        .byte $88
- D 1 - I - 0x036BC4 1A:ABB4: A2        .byte $A2
- D 1 - I - 0x036BC5 1A:ABB5: 63        .byte $63
- D 1 - I - 0x036BC6 1A:ABB6: 71        .byte $71
- D 1 - I - 0x036BC7 1A:ABB7: F0        .byte $F0
- D 1 - I - 0x036BC8 1A:ABB8: F0        .byte $F0
- D 1 - I - 0x036BC9 1A:ABB9: 6C        .byte $6C
- D 1 - I - 0x036BCA 1A:ABBA: 6E        .byte $6E
- D 1 - I - 0x036BCB 1A:ABBB: 36        .byte $36
- D 1 - I - 0x036BCC 1A:ABBC: 75        .byte $75
- D 1 - I - 0x036BCD 1A:ABBD: 4D        .byte $4D
- D 1 - I - 0x036BCE 1A:ABBE: 57        .byte $57
- D 1 - I - 0x036BCF 1A:ABBF: 32        .byte $32
- D 1 - I - 0x036BD0 1A:ABC0: 28        .byte $28
- D 1 - I - 0x036BD1 1A:ABC1: 64        .byte $64
- D 1 - I - 0x036BD2 1A:ABC2: 90        .byte $90
- D 1 - I - 0x036BD3 1A:ABC3: BD        .byte $BD
- D 1 - I - 0x036BD4 1A:ABC4: BD        .byte $BD
- D 1 - I - 0x036BD5 1A:ABC5: 7E        .byte $7E
- D 1 - I - 0x036BD6 1A:ABC6: AE        .byte $AE
- D 1 - I - 0x036BD7 1A:ABC7: C6        .byte $C6
- D 1 - I - 0x036BD8 1A:ABC8: C6        .byte $C6
- D 1 - I - 0x036BD9 1A:ABC9: 94        .byte $94
- D 1 - I - 0x036BDA 1A:ABCA: B7        .byte $B7
- D 1 - I - 0x036BDB 1A:ABCB: F0        .byte $F0
- D 1 - I - 0x036BDC 1A:ABCC: F0        .byte $F0
- D 1 - I - 0x036BDD 1A:ABCD: 84        .byte $84
- D 1 - I - 0x036BDE 1A:ABCE: 6E        .byte $6E
- D 1 - I - 0x036BDF 1A:ABCF: 8B        .byte $8B
- D 1 - I - 0x036BE0 1A:ABD0: 74        .byte $74
- D 1 - I - 0x036BE1 1A:ABD1: 7E        .byte $7E
- D 1 - I - 0x036BE2 1A:ABD2: 88        .byte $88
- D 1 - I - 0x036BE3 1A:ABD3: 4D        .byte $4D
- D 1 - I - 0x036BE4 1A:ABD4: 65        .byte $65
- D 1 - I - 0x036BE5 1A:ABD5: F0        .byte $F0
- D 1 - I - 0x036BE6 1A:ABD6: F0        .byte $F0
- D 1 - I - 0x036BE7 1A:ABD7: D6        .byte $D6
- D 1 - I - 0x036BE8 1A:ABD8: D6        .byte $D6
- D 1 - I - 0x036BE9 1A:ABD9: C7        .byte $C7
- D 1 - I - 0x036BEA 1A:ABDA: D4        .byte $D4
- D 1 - I - 0x036BEB 1A:ABDB: F0        .byte $F0
- D 1 - I - 0x036BEC 1A:ABDC: EA        .byte $EA
- D 1 - I - 0x036BED 1A:ABDD: B7        .byte $B7
- D 1 - I - 0x036BEE 1A:ABDE: DC        .byte $DC
- D 1 - I - 0x036BEF 1A:ABDF: F0        .byte $F0
- D 1 - I - 0x036BF0 1A:ABE0: F0        .byte $F0
- D 1 - I - 0x036BF1 1A:ABE1: F0        .byte $F0
- D 1 - I - 0x036BF2 1A:ABE2: 04        .byte $04
- D 1 - I - 0x036BF3 1A:ABE3: F0        .byte $F0
- D 1 - I - 0x036BF4 1A:ABE4: 07        .byte $07
- D 1 - I - 0x036BF5 1A:ABE5: F0        .byte $F0
- D 1 - I - 0x036BF6 1A:ABE6: F0        .byte $F0
- D 1 - I - 0x036BF7 1A:ABE7: F0        .byte $F0
- D 1 - I - 0x036BF8 1A:ABE8: F0        .byte $F0
- D 1 - I - 0x036BF9 1A:ABE9: F0        .byte $F0
- D 1 - I - 0x036BFA 1A:ABEA: 1D        .byte $1D
- D 1 - I - 0x036BFB 1A:ABEB: 2E        .byte $2E
- D 1 - I - 0x036BFC 1A:ABEC: 6B        .byte $6B
- D 1 - I - 0x036BFD 1A:ABED: F0        .byte $F0
- D 1 - I - 0x036BFE 1A:ABEE: 12        .byte $12
- D 1 - I - 0x036BFF 1A:ABEF: 4D        .byte $4D
- D 1 - I - 0x036C00 1A:ABF0: 71        .byte $71
- D 1 - I - 0x036C01 1A:ABF1: F0        .byte $F0
- D 1 - I - 0x036C02 1A:ABF2: F0        .byte $F0
- D 1 - I - 0x036C03 1A:ABF3: 25        .byte $25
- D 1 - I - 0x036C04 1A:ABF4: 60        .byte $60
- D 1 - I - 0x036C05 1A:ABF5: 03        .byte $03
- D 1 - I - 0x036C06 1A:ABF6: 10        .byte $10
- D 1 - I - 0x036C07 1A:ABF7: 13        .byte $13
- D 1 - I - 0x036C08 1A:ABF8: 08        .byte $08
- D 1 - I - 0x036C09 1A:ABF9: F0        .byte $F0
- D 1 - I - 0x036C0A 1A:ABFA: 1E        .byte $1E
- D 1 - I - 0x036C0B 1A:ABFB: F0        .byte $F0
- D 1 - I - 0x036C0C 1A:ABFC: 05        .byte $05
- D 1 - I - 0x036C0D 1A:ABFD: F0        .byte $F0
- D 1 - I - 0x036C0E 1A:ABFE: 28        .byte $28
- D 1 - I - 0x036C0F 1A:ABFF: 45        .byte $45
- D 1 - I - 0x036C10 1A:AC00: 77        .byte $77
- D 1 - I - 0x036C11 1A:AC01: F0        .byte $F0
- D 1 - I - 0x036C12 1A:AC02: 2B        .byte $2B
- D 1 - I - 0x036C13 1A:AC03: 71        .byte $71
- D 1 - I - 0x036C14 1A:AC04: 71        .byte $71
- D 1 - I - 0x036C15 1A:AC05: F0        .byte $F0
- D 1 - I - 0x036C16 1A:AC06: F0        .byte $F0
- D 1 - I - 0x036C17 1A:AC07: 3E        .byte $3E
- D 1 - I - 0x036C18 1A:AC08: 6C        .byte $6C
- D 1 - I - 0x036C19 1A:AC09: 1B        .byte $1B
- D 1 - I - 0x036C1A 1A:AC0A: 55        .byte $55
- D 1 - I - 0x036C1B 1A:AC0B: 20        .byte $20
- D 1 - I - 0x036C1C 1A:AC0C: 5E        .byte $5E
- D 1 - I - 0x036C1D 1A:AC0D: 1D        .byte $1D
- D 1 - I - 0x036C1E 1A:AC0E: 35        .byte $35
- D 1 - I - 0x036C1F 1A:AC0F: 12        .byte $12
- D 1 - I - 0x036C20 1A:AC10: 12        .byte $12
- D 1 - I - 0x036C21 1A:AC11: F0        .byte $F0
- D 1 - I - 0x036C22 1A:AC12: 58        .byte $58
- D 1 - I - 0x036C23 1A:AC13: 68        .byte $68
- D 1 - I - 0x036C24 1A:AC14: 82        .byte $82
- D 1 - I - 0x036C25 1A:AC15: 36        .byte $36
- D 1 - I - 0x036C26 1A:AC16: 4F        .byte $4F
- D 1 - I - 0x036C27 1A:AC17: F0        .byte $F0
- D 1 - I - 0x036C28 1A:AC18: F0        .byte $F0
- D 1 - I - 0x036C29 1A:AC19: F0        .byte $F0
- D 1 - I - 0x036C2A 1A:AC1A: F0        .byte $F0
- D 1 - I - 0x036C2B 1A:AC1B: 63        .byte $63
- D 1 - I - 0x036C2C 1A:AC1C: 79        .byte $79
- D 1 - I - 0x036C2D 1A:AC1D: 58        .byte $58
- D 1 - I - 0x036C2E 1A:AC1E: 79        .byte $79
- D 1 - I - 0x036C2F 1A:AC1F: 50        .byte $50
- D 1 - I - 0x036C30 1A:AC20: 82        .byte $82
- D 1 - I - 0x036C31 1A:AC21: 41        .byte $41
- D 1 - I - 0x036C32 1A:AC22: 5A        .byte $5A
- D 1 - I - 0x036C33 1A:AC23: 1E        .byte $1E
- D 1 - I - 0x036C34 1A:AC24: 37        .byte $37
- D 1 - I - 0x036C35 1A:AC25: 71        .byte $71
- D 1 - I - 0x036C36 1A:AC26: 7B        .byte $7B
- D 1 - I - 0x036C37 1A:AC27: A5        .byte $A5
- D 1 - I - 0x036C38 1A:AC28: BE        .byte $BE
- D 1 - I - 0x036C39 1A:AC29: 73        .byte $73
- D 1 - I - 0x036C3A 1A:AC2A: 80        .byte $80
- D 1 - I - 0x036C3B 1A:AC2B: F0        .byte $F0
- D 1 - I - 0x036C3C 1A:AC2C: F0        .byte $F0
- D 1 - I - 0x036C3D 1A:AC2D: 96        .byte $96
- D 1 - I - 0x036C3E 1A:AC2E: 96        .byte $96
- D 1 - I - 0x036C3F 1A:AC2F: 9E        .byte $9E
- D 1 - I - 0x036C40 1A:AC30: B5        .byte $B5
- D 1 - I - 0x036C41 1A:AC31: 9D        .byte $9D
- D 1 - I - 0x036C42 1A:AC32: 6E        .byte $6E
- D 1 - I - 0x036C43 1A:AC33: 75        .byte $75
- D 1 - I - 0x036C44 1A:AC34: A6        .byte $A6
- D 1 - I - 0x036C45 1A:AC35: 70        .byte $70
- D 1 - I - 0x036C46 1A:AC36: 89        .byte $89
- D 1 - I - 0x036C47 1A:AC37: 4F        .byte $4F
- D 1 - I - 0x036C48 1A:AC38: 66        .byte $66
- D 1 - I - 0x036C49 1A:AC39: 94        .byte $94
- D 1 - I - 0x036C4A 1A:AC3A: B6        .byte $B6
- D 1 - I - 0x036C4B 1A:AC3B: D6        .byte $D6
- D 1 - I - 0x036C4C 1A:AC3C: ED        .byte $ED
- D 1 - I - 0x036C4D 1A:AC3D: A2        .byte $A2
- D 1 - I - 0x036C4E 1A:AC3E: 8B        .byte $8B
- D 1 - I - 0x036C4F 1A:AC3F: F0        .byte $F0
- D 1 - I - 0x036C50 1A:AC40: F0        .byte $F0
- D 1 - I - 0x036C51 1A:AC41: F0        .byte $F0
- D 1 - I - 0x036C52 1A:AC42: F0        .byte $F0
- D 1 - I - 0x036C53 1A:AC43: E6        .byte $E6
- D 1 - I - 0x036C54 1A:AC44: CD        .byte $CD
- D 1 - I - 0x036C55 1A:AC45: 04        .byte $04
- D 1 - I - 0x036C56 1A:AC46: 04        .byte $04
- D 1 - I - 0x036C57 1A:AC47: F0        .byte $F0
- D 1 - I - 0x036C58 1A:AC48: F0        .byte $F0
- D 1 - I - 0x036C59 1A:AC49: 07        .byte $07
- D 1 - I - 0x036C5A 1A:AC4A: 07        .byte $07
- D 1 - I - 0x036C5B 1A:AC4B: F0        .byte $F0
- D 1 - I - 0x036C5C 1A:AC4C: F0        .byte $F0
- D 1 - I - 0x036C5D 1A:AC4D: 12        .byte $12
- D 1 - I - 0x036C5E 1A:AC4E: 12        .byte $12
- D 1 - I - 0x036C5F 1A:AC4F: F0        .byte $F0
- D 1 - I - 0x036C60 1A:AC50: 6B        .byte $6B
- D 1 - I - 0x036C61 1A:AC51: F0        .byte $F0
- D 1 - I - 0x036C62 1A:AC52: 1F        .byte $1F
- D 1 - I - 0x036C63 1A:AC53: 59        .byte $59
- D 1 - I - 0x036C64 1A:AC54: 72        .byte $72
- D 1 - I - 0x036C65 1A:AC55: 1D        .byte $1D
- D 1 - I - 0x036C66 1A:AC56: 1D        .byte $1D
- D 1 - I - 0x036C67 1A:AC57: 32        .byte $32
- D 1 - I - 0x036C68 1A:AC58: 61        .byte $61
- D 1 - I - 0x036C69 1A:AC59: 3C        .byte $3C
- D 1 - I - 0x036C6A 1A:AC5A: 1C        .byte $1C
- D 1 - I - 0x036C6B 1A:AC5B: F0        .byte $F0
- D 1 - I - 0x036C6C 1A:AC5C: F0        .byte $F0
- D 1 - I - 0x036C6D 1A:AC5D: 07        .byte $07
- D 1 - I - 0x036C6E 1A:AC5E: 1F        .byte $1F
- D 1 - I - 0x036C6F 1A:AC5F: 14        .byte $14
- D 1 - I - 0x036C70 1A:AC60: 2F        .byte $2F
- D 1 - I - 0x036C71 1A:AC61: 2A        .byte $2A
- D 1 - I - 0x036C72 1A:AC62: 34        .byte $34
- D 1 - I - 0x036C73 1A:AC63: F0        .byte $F0
- D 1 - I - 0x036C74 1A:AC64: F0        .byte $F0
- D 1 - I - 0x036C75 1A:AC65: F0        .byte $F0
- D 1 - I - 0x036C76 1A:AC66: 38        .byte $38
- D 1 - I - 0x036C77 1A:AC67: 7F        .byte $7F
- D 1 - I - 0x036C78 1A:AC68: 69        .byte $69
- D 1 - I - 0x036C79 1A:AC69: 4F        .byte $4F
- D 1 - I - 0x036C7A 1A:AC6A: 66        .byte $66
- D 1 - I - 0x036C7B 1A:AC6B: 6D        .byte $6D
- D 1 - I - 0x036C7C 1A:AC6C: 56        .byte $56
- D 1 - I - 0x036C7D 1A:AC6D: 1C        .byte $1C
- D 1 - I - 0x036C7E 1A:AC6E: 31        .byte $31
- D 1 - I - 0x036C7F 1A:AC6F: 45        .byte $45
- D 1 - I - 0x036C80 1A:AC70: 47        .byte $47
- D 1 - I - 0x036C81 1A:AC71: 2A        .byte $2A
- D 1 - I - 0x036C82 1A:AC72: 37        .byte $37
- D 1 - I - 0x036C83 1A:AC73: 12        .byte $12
- D 1 - I - 0x036C84 1A:AC74: 20        .byte $20
- D 1 - I - 0x036C85 1A:AC75: 4D        .byte $4D
- D 1 - I - 0x036C86 1A:AC76: 88        .byte $88
- D 1 - I - 0x036C87 1A:AC77: F0        .byte $F0
- D 1 - I - 0x036C88 1A:AC78: F0        .byte $F0
- D 1 - I - 0x036C89 1A:AC79: F0        .byte $F0
- D 1 - I - 0x036C8A 1A:AC7A: 5D        .byte $5D
- D 1 - I - 0x036C8B 1A:AC7B: 8B        .byte $8B
- D 1 - I - 0x036C8C 1A:AC7C: A1        .byte $A1
- D 1 - I - 0x036C8D 1A:AC7D: 4F        .byte $4F
- D 1 - I - 0x036C8E 1A:AC7E: 68        .byte $68
- D 1 - I - 0x036C8F 1A:AC7F: 62        .byte $62
- D 1 - I - 0x036C90 1A:AC80: 85        .byte $85
- D 1 - I - 0x036C91 1A:AC81: 35        .byte $35
- D 1 - I - 0x036C92 1A:AC82: 6E        .byte $6E
- D 1 - I - 0x036C93 1A:AC83: 5D        .byte $5D
- D 1 - I - 0x036C94 1A:AC84: 8F        .byte $8F
- D 1 - I - 0x036C95 1A:AC85: 4E        .byte $4E
- D 1 - I - 0x036C96 1A:AC86: 5B        .byte $5B
- D 1 - I - 0x036C97 1A:AC87: 2B        .byte $2B
- D 1 - I - 0x036C98 1A:AC88: 38        .byte $38
- D 1 - I - 0x036C99 1A:AC89: 65        .byte $65
- D 1 - I - 0x036C9A 1A:AC8A: AD        .byte $AD
- D 1 - I - 0x036C9B 1A:AC8B: F0        .byte $F0
- D 1 - I - 0x036C9C 1A:AC8C: F0        .byte $F0
- D 1 - I - 0x036C9D 1A:AC8D: 8C        .byte $8C
- D 1 - I - 0x036C9E 1A:AC8E: 81        .byte $81
- D 1 - I - 0x036C9F 1A:AC8F: C4        .byte $C4
- D 1 - I - 0x036CA0 1A:AC90: C4        .byte $C4
- D 1 - I - 0x036CA1 1A:AC91: AF        .byte $AF
- D 1 - I - 0x036CA2 1A:AC92: C8        .byte $C8
- D 1 - I - 0x036CA3 1A:AC93: 91        .byte $91
- D 1 - I - 0x036CA4 1A:AC94: B6        .byte $B6
- D 1 - I - 0x036CA5 1A:AC95: 6F        .byte $6F
- D 1 - I - 0x036CA6 1A:AC96: 91        .byte $91
- D 1 - I - 0x036CA7 1A:AC97: 75        .byte $75
- D 1 - I - 0x036CA8 1A:AC98: 8F        .byte $8F
- D 1 - I - 0x036CA9 1A:AC99: 7D        .byte $7D
- D 1 - I - 0x036CAA 1A:AC9A: 8B        .byte $8B
- D 1 - I - 0x036CAB 1A:AC9B: 5A        .byte $5A
- D 1 - I - 0x036CAC 1A:AC9C: 50        .byte $50
- D 1 - I - 0x036CAD 1A:AC9D: C4        .byte $C4
- D 1 - I - 0x036CAE 1A:AC9E: D0        .byte $D0
- D 1 - I - 0x036CAF 1A:AC9F: F0        .byte $F0
- D 1 - I - 0x036CB0 1A:ACA0: F0        .byte $F0
- D 1 - I - 0x036CB1 1A:ACA1: F0        .byte $F0
- D 1 - I - 0x036CB2 1A:ACA2: F0        .byte $F0
- D 1 - I - 0x036CB3 1A:ACA3: F0        .byte $F0
- D 1 - I - 0x036CB4 1A:ACA4: E9        .byte $E9
- D 1 - I - 0x036CB5 1A:ACA5: BC        .byte $BC
- D 1 - I - 0x036CB6 1A:ACA6: DF        .byte $DF
- D 1 - I - 0x036CB7 1A:ACA7: CD        .byte $CD
- D 1 - I - 0x036CB8 1A:ACA8: CD        .byte $CD



off_ACA9_01:
- D 1 - I - 0x036CB9 1A:ACA9: F0        .byte $F0
- D 1 - I - 0x036CBA 1A:ACAA: F0        .byte $F0
- D 1 - I - 0x036CBB 1A:ACAB: 07        .byte $07
- D 1 - I - 0x036CBC 1A:ACAC: 07        .byte $07
- D 1 - I - 0x036CBD 1A:ACAD: 04        .byte $04
- D 1 - I - 0x036CBE 1A:ACAE: 04        .byte $04
- D 1 - I - 0x036CBF 1A:ACAF: F0        .byte $F0
- D 1 - I - 0x036CC0 1A:ACB0: F0        .byte $F0
- D 1 - I - 0x036CC1 1A:ACB1: F0        .byte $F0
- D 1 - I - 0x036CC2 1A:ACB2: 1C        .byte $1C
- D 1 - I - 0x036CC3 1A:ACB3: 21        .byte $21
- D 1 - I - 0x036CC4 1A:ACB4: 16        .byte $16
- D 1 - I - 0x036CC5 1A:ACB5: 11        .byte $11
- D 1 - I - 0x036CC6 1A:ACB6: 11        .byte $11
- D 1 - I - 0x036CC7 1A:ACB7: 40        .byte $40
- D 1 - I - 0x036CC8 1A:ACB8: 65        .byte $65
- D 1 - I - 0x036CC9 1A:ACB9: 1E        .byte $1E
- D 1 - I - 0x036CCA 1A:ACBA: 1E        .byte $1E
- D 1 - I - 0x036CCB 1A:ACBB: F0        .byte $F0
- D 1 - I - 0x036CCC 1A:ACBC: F0        .byte $F0
- D 1 - I - 0x036CCD 1A:ACBD: F0        .byte $F0
- D 1 - I - 0x036CCE 1A:ACBE: F0        .byte $F0
- D 1 - I - 0x036CCF 1A:ACBF: 06        .byte $06
- D 1 - I - 0x036CD0 1A:ACC0: 1F        .byte $1F
- D 1 - I - 0x036CD1 1A:ACC1: 1C        .byte $1C
- D 1 - I - 0x036CD2 1A:ACC2: 05        .byte $05
- D 1 - I - 0x036CD3 1A:ACC3: F0        .byte $F0
- D 1 - I - 0x036CD4 1A:ACC4: 0F        .byte $0F
- D 1 - I - 0x036CD5 1A:ACC5: F0        .byte $F0
- D 1 - I - 0x036CD6 1A:ACC6: 26        .byte $26
- D 1 - I - 0x036CD7 1A:ACC7: 45        .byte $45
- D 1 - I - 0x036CD8 1A:ACC8: 76        .byte $76
- D 1 - I - 0x036CD9 1A:ACC9: F0        .byte $F0
- D 1 - I - 0x036CDA 1A:ACCA: 29        .byte $29
- D 1 - I - 0x036CDB 1A:ACCB: F0        .byte $F0
- D 1 - I - 0x036CDC 1A:ACCC: F0        .byte $F0
- D 1 - I - 0x036CDD 1A:ACCD: F0        .byte $F0
- D 1 - I - 0x036CDE 1A:ACCE: 33        .byte $33
- D 1 - I - 0x036CDF 1A:ACCF: F0        .byte $F0
- D 1 - I - 0x036CE0 1A:ACD0: F0        .byte $F0
- D 1 - I - 0x036CE1 1A:ACD1: F0        .byte $F0
- D 1 - I - 0x036CE2 1A:ACD2: 3C        .byte $3C
- D 1 - I - 0x036CE3 1A:ACD3: 1D        .byte $1D
- D 1 - I - 0x036CE4 1A:ACD4: 4E        .byte $4E
- D 1 - I - 0x036CE5 1A:ACD5: 34        .byte $34
- D 1 - I - 0x036CE6 1A:ACD6: 35        .byte $35
- D 1 - I - 0x036CE7 1A:ACD7: 25        .byte $25
- D 1 - I - 0x036CE8 1A:ACD8: 1B        .byte $1B
- D 1 - I - 0x036CE9 1A:ACD9: F0        .byte $F0
- D 1 - I - 0x036CEA 1A:ACDA: 3E        .byte $3E
- D 1 - I - 0x036CEB 1A:ACDB: 51        .byte $51
- D 1 - I - 0x036CEC 1A:ACDC: 8E        .byte $8E
- D 1 - I - 0x036CED 1A:ACDD: F0        .byte $F0
- D 1 - I - 0x036CEE 1A:ACDE: 4C        .byte $4C
- D 1 - I - 0x036CEF 1A:ACDF: F0        .byte $F0
- D 1 - I - 0x036CF0 1A:ACE0: F0        .byte $F0
- D 1 - I - 0x036CF1 1A:ACE1: F0        .byte $F0
- D 1 - I - 0x036CF2 1A:ACE2: 63        .byte $63
- D 1 - I - 0x036CF3 1A:ACE3: F0        .byte $F0
- D 1 - I - 0x036CF4 1A:ACE4: F0        .byte $F0
- D 1 - I - 0x036CF5 1A:ACE5: 6C        .byte $6C
- D 1 - I - 0x036CF6 1A:ACE6: 6E        .byte $6E
- D 1 - I - 0x036CF7 1A:ACE7: 72        .byte $72
- D 1 - I - 0x036CF8 1A:ACE8: 36        .byte $36
- D 1 - I - 0x036CF9 1A:ACE9: 57        .byte $57
- D 1 - I - 0x036CFA 1A:ACEA: 4D        .byte $4D
- D 1 - I - 0x036CFB 1A:ACEB: 3E        .byte $3E
- D 1 - I - 0x036CFC 1A:ACEC: 28        .byte $28
- D 1 - I - 0x036CFD 1A:ACED: F0        .byte $F0
- D 1 - I - 0x036CFE 1A:ACEE: F0        .byte $F0
- D 1 - I - 0x036CFF 1A:ACEF: 80        .byte $80
- D 1 - I - 0x036D00 1A:ACF0: BD        .byte $BD
- D 1 - I - 0x036D01 1A:ACF1: 70        .byte $70
- D 1 - I - 0x036D02 1A:ACF2: 7D        .byte $7D
- D 1 - I - 0x036D03 1A:ACF3: F0        .byte $F0
- D 1 - I - 0x036D04 1A:ACF4: 79        .byte $79
- D 1 - I - 0x036D05 1A:ACF5: F0        .byte $F0
- D 1 - I - 0x036D06 1A:ACF6: 87        .byte $87
- D 1 - I - 0x036D07 1A:ACF7: F0        .byte $F0
- D 1 - I - 0x036D08 1A:ACF8: F0        .byte $F0
- D 1 - I - 0x036D09 1A:ACF9: 84        .byte $84
- D 1 - I - 0x036D0A 1A:ACFA: 6E        .byte $6E
- D 1 - I - 0x036D0B 1A:ACFB: 66        .byte $66
- D 1 - I - 0x036D0C 1A:ACFC: A3        .byte $A3
- D 1 - I - 0x036D0D 1A:ACFD: 87        .byte $87
- D 1 - I - 0x036D0E 1A:ACFE: 70        .byte $70
- D 1 - I - 0x036D0F 1A:ACFF: 57        .byte $57
- D 1 - I - 0x036D10 1A:AD00: 4D        .byte $4D
- D 1 - I - 0x036D11 1A:AD01: F0        .byte $F0
- D 1 - I - 0x036D12 1A:AD02: 91        .byte $91
- D 1 - I - 0x036D13 1A:AD03: 81        .byte $81
- D 1 - I - 0x036D14 1A:AD04: D6        .byte $D6
- D 1 - I - 0x036D15 1A:AD05: A0        .byte $A0
- D 1 - I - 0x036D16 1A:AD06: C5        .byte $C5
- D 1 - I - 0x036D17 1A:AD07: F0        .byte $F0
- D 1 - I - 0x036D18 1A:AD08: F0        .byte $F0
- D 1 - I - 0x036D19 1A:AD09: F0        .byte $F0
- D 1 - I - 0x036D1A 1A:AD0A: AA        .byte $AA
- D 1 - I - 0x036D1B 1A:AD0B: F0        .byte $F0
- D 1 - I - 0x036D1C 1A:AD0C: F0        .byte $F0
- D 1 - I - 0x036D1D 1A:AD0D: F0        .byte $F0
- D 1 - I - 0x036D1E 1A:AD0E: 04        .byte $04
- D 1 - I - 0x036D1F 1A:AD0F: F0        .byte $F0
- D 1 - I - 0x036D20 1A:AD10: 07        .byte $07
- D 1 - I - 0x036D21 1A:AD11: F0        .byte $F0
- D 1 - I - 0x036D22 1A:AD12: F0        .byte $F0
- D 1 - I - 0x036D23 1A:AD13: F0        .byte $F0
- D 1 - I - 0x036D24 1A:AD14: F0        .byte $F0
- D 1 - I - 0x036D25 1A:AD15: F0        .byte $F0
- D 1 - I - 0x036D26 1A:AD16: 1D        .byte $1D
- D 1 - I - 0x036D27 1A:AD17: 2D        .byte $2D
- D 1 - I - 0x036D28 1A:AD18: 5E        .byte $5E
- D 1 - I - 0x036D29 1A:AD19: F0        .byte $F0
- D 1 - I - 0x036D2A 1A:AD1A: 12        .byte $12
- D 1 - I - 0x036D2B 1A:AD1B: 41        .byte $41
- D 1 - I - 0x036D2C 1A:AD1C: 71        .byte $71
- D 1 - I - 0x036D2D 1A:AD1D: F0        .byte $F0
- D 1 - I - 0x036D2E 1A:AD1E: 1E        .byte $1E
- D 1 - I - 0x036D2F 1A:AD1F: 26        .byte $26
- D 1 - I - 0x036D30 1A:AD20: 55        .byte $55
- D 1 - I - 0x036D31 1A:AD21: 10        .byte $10
- D 1 - I - 0x036D32 1A:AD22: 03        .byte $03
- D 1 - I - 0x036D33 1A:AD23: 13        .byte $13
- D 1 - I - 0x036D34 1A:AD24: 08        .byte $08
- D 1 - I - 0x036D35 1A:AD25: F0        .byte $F0
- D 1 - I - 0x036D36 1A:AD26: F0        .byte $F0
- D 1 - I - 0x036D37 1A:AD27: F0        .byte $F0
- D 1 - I - 0x036D38 1A:AD28: 05        .byte $05
- D 1 - I - 0x036D39 1A:AD29: F0        .byte $F0
- D 1 - I - 0x036D3A 1A:AD2A: 28        .byte $28
- D 1 - I - 0x036D3B 1A:AD2B: F0        .byte $F0
- D 1 - I - 0x036D3C 1A:AD2C: 5E        .byte $5E
- D 1 - I - 0x036D3D 1A:AD2D: F0        .byte $F0
- D 1 - I - 0x036D3E 1A:AD2E: 1E        .byte $1E
- D 1 - I - 0x036D3F 1A:AD2F: F0        .byte $F0
- D 1 - I - 0x036D40 1A:AD30: 65        .byte $65
- D 1 - I - 0x036D41 1A:AD31: F0        .byte $F0
- D 1 - I - 0x036D42 1A:AD32: F0        .byte $F0
- D 1 - I - 0x036D43 1A:AD33: F0        .byte $F0
- D 1 - I - 0x036D44 1A:AD34: 55        .byte $55
- D 1 - I - 0x036D45 1A:AD35: 1B        .byte $1B
- D 1 - I - 0x036D46 1A:AD36: 55        .byte $55
- D 1 - I - 0x036D47 1A:AD37: 2B        .byte $2B
- D 1 - I - 0x036D48 1A:AD38: 5E        .byte $5E
- D 1 - I - 0x036D49 1A:AD39: F0        .byte $F0
- D 1 - I - 0x036D4A 1A:AD3A: 36        .byte $36
- D 1 - I - 0x036D4B 1A:AD3B: 1D        .byte $1D
- D 1 - I - 0x036D4C 1A:AD3C: 12        .byte $12
- D 1 - I - 0x036D4D 1A:AD3D: 35        .byte $35
- D 1 - I - 0x036D4E 1A:AD3E: 4B        .byte $4B
- D 1 - I - 0x036D4F 1A:AD3F: F0        .byte $F0
- D 1 - I - 0x036D50 1A:AD40: 68        .byte $68
- D 1 - I - 0x036D51 1A:AD41: 4F        .byte $4F
- D 1 - I - 0x036D52 1A:AD42: 59        .byte $59
- D 1 - I - 0x036D53 1A:AD43: F0        .byte $F0
- D 1 - I - 0x036D54 1A:AD44: 8A        .byte $8A
- D 1 - I - 0x036D55 1A:AD45: F0        .byte $F0
- D 1 - I - 0x036D56 1A:AD46: F0        .byte $F0
- D 1 - I - 0x036D57 1A:AD47: F0        .byte $F0
- D 1 - I - 0x036D58 1A:AD48: 63        .byte $63
- D 1 - I - 0x036D59 1A:AD49: 57        .byte $57
- D 1 - I - 0x036D5A 1A:AD4A: 85        .byte $85
- D 1 - I - 0x036D5B 1A:AD4B: 50        .byte $50
- D 1 - I - 0x036D5C 1A:AD4C: 82        .byte $82
- D 1 - I - 0x036D5D 1A:AD4D: 40        .byte $40
- D 1 - I - 0x036D5E 1A:AD4E: 59        .byte $59
- D 1 - I - 0x036D5F 1A:AD4F: 36        .byte $36
- D 1 - I - 0x036D60 1A:AD50: 2A        .byte $2A
- D 1 - I - 0x036D61 1A:AD51: 70        .byte $70
- D 1 - I - 0x036D62 1A:AD52: 73        .byte $73
- D 1 - I - 0x036D63 1A:AD53: F0        .byte $F0
- D 1 - I - 0x036D64 1A:AD54: A4        .byte $A4
- D 1 - I - 0x036D65 1A:AD55: F0        .byte $F0
- D 1 - I - 0x036D66 1A:AD56: 8B        .byte $8B
- D 1 - I - 0x036D67 1A:AD57: F0        .byte $F0
- D 1 - I - 0x036D68 1A:AD58: F0        .byte $F0
- D 1 - I - 0x036D69 1A:AD59: F0        .byte $F0
- D 1 - I - 0x036D6A 1A:AD5A: 89        .byte $89
- D 1 - I - 0x036D6B 1A:AD5B: F0        .byte $F0
- D 1 - I - 0x036D6C 1A:AD5C: 9F        .byte $9F
- D 1 - I - 0x036D6D 1A:AD5D: 91        .byte $91
- D 1 - I - 0x036D6E 1A:AD5E: 6E        .byte $6E
- D 1 - I - 0x036D6F 1A:AD5F: 74        .byte $74
- D 1 - I - 0x036D70 1A:AD60: 9A        .byte $9A
- D 1 - I - 0x036D71 1A:AD61: 70        .byte $70
- D 1 - I - 0x036D72 1A:AD62: 89        .byte $89
- D 1 - I - 0x036D73 1A:AD63: 5B        .byte $5B
- D 1 - I - 0x036D74 1A:AD64: 66        .byte $66
- D 1 - I - 0x036D75 1A:AD65: 87        .byte $87
- D 1 - I - 0x036D76 1A:AD66: 8B        .byte $8B
- D 1 - I - 0x036D77 1A:AD67: F0        .byte $F0
- D 1 - I - 0x036D78 1A:AD68: B1        .byte $B1
- D 1 - I - 0x036D79 1A:AD69: F0        .byte $F0
- D 1 - I - 0x036D7A 1A:AD6A: A2        .byte $A2
- D 1 - I - 0x036D7B 1A:AD6B: F0        .byte $F0
- D 1 - I - 0x036D7C 1A:AD6C: F0        .byte $F0
- D 1 - I - 0x036D7D 1A:AD6D: F0        .byte $F0
- D 1 - I - 0x036D7E 1A:AD6E: F0        .byte $F0
- D 1 - I - 0x036D7F 1A:AD6F: F0        .byte $F0
- D 1 - I - 0x036D80 1A:AD70: AA        .byte $AA
- D 1 - I - 0x036D81 1A:AD71: 04        .byte $04
- D 1 - I - 0x036D82 1A:AD72: 04        .byte $04
- D 1 - I - 0x036D83 1A:AD73: F0        .byte $F0
- D 1 - I - 0x036D84 1A:AD74: F0        .byte $F0
- D 1 - I - 0x036D85 1A:AD75: 07        .byte $07
- D 1 - I - 0x036D86 1A:AD76: 07        .byte $07
- D 1 - I - 0x036D87 1A:AD77: F0        .byte $F0
- D 1 - I - 0x036D88 1A:AD78: F0        .byte $F0
- D 1 - I - 0x036D89 1A:AD79: 12        .byte $12
- D 1 - I - 0x036D8A 1A:AD7A: 12        .byte $12
- D 1 - I - 0x036D8B 1A:AD7B: F0        .byte $F0
- D 1 - I - 0x036D8C 1A:AD7C: F0        .byte $F0
- D 1 - I - 0x036D8D 1A:AD7D: F0        .byte $F0
- D 1 - I - 0x036D8E 1A:AD7E: 1F        .byte $1F
- D 1 - I - 0x036D8F 1A:AD7F: 66        .byte $66
- D 1 - I - 0x036D90 1A:AD80: 43        .byte $43
- D 1 - I - 0x036D91 1A:AD81: 1D        .byte $1D
- D 1 - I - 0x036D92 1A:AD82: 1D        .byte $1D
- D 1 - I - 0x036D93 1A:AD83: 0D        .byte $0D
- D 1 - I - 0x036D94 1A:AD84: 1A        .byte $1A
- D 1 - I - 0x036D95 1A:AD85: 1C        .byte $1C
- D 1 - I - 0x036D96 1A:AD86: 05        .byte $05
- D 1 - I - 0x036D97 1A:AD87: F0        .byte $F0
- D 1 - I - 0x036D98 1A:AD88: F0        .byte $F0
- D 1 - I - 0x036D99 1A:AD89: 06        .byte $06
- D 1 - I - 0x036D9A 1A:AD8A: 1F        .byte $1F
- D 1 - I - 0x036D9B 1A:AD8B: F0        .byte $F0
- D 1 - I - 0x036D9C 1A:AD8C: 14        .byte $14
- D 1 - I - 0x036D9D 1A:AD8D: F0        .byte $F0
- D 1 - I - 0x036D9E 1A:AD8E: 2A        .byte $2A
- D 1 - I - 0x036D9F 1A:AD8F: F0        .byte $F0
- D 1 - I - 0x036DA0 1A:AD90: F0        .byte $F0
- D 1 - I - 0x036DA1 1A:AD91: F0        .byte $F0
- D 1 - I - 0x036DA2 1A:AD92: 38        .byte $38
- D 1 - I - 0x036DA3 1A:AD93: F0        .byte $F0
- D 1 - I - 0x036DA4 1A:AD94: F0        .byte $F0
- D 1 - I - 0x036DA5 1A:AD95: F0        .byte $F0
- D 1 - I - 0x036DA6 1A:AD96: 2B        .byte $2B
- D 1 - I - 0x036DA7 1A:AD97: 3F        .byte $3F
- D 1 - I - 0x036DA8 1A:AD98: 6D        .byte $6D
- D 1 - I - 0x036DA9 1A:AD99: 4D        .byte $4D
- D 1 - I - 0x036DAA 1A:AD9A: 1E        .byte $1E
- D 1 - I - 0x036DAB 1A:AD9B: F0        .byte $F0
- D 1 - I - 0x036DAC 1A:AD9C: 47        .byte $47
- D 1 - I - 0x036DAD 1A:AD9D: 37        .byte $37
- D 1 - I - 0x036DAE 1A:AD9E: 36        .byte $36
- D 1 - I - 0x036DAF 1A:AD9F: 20        .byte $20
- D 1 - I - 0x036DB0 1A:ADA0: 2E        .byte $2E
- D 1 - I - 0x036DB1 1A:ADA1: F0        .byte $F0
- D 1 - I - 0x036DB2 1A:ADA2: 4F        .byte $4F
- D 1 - I - 0x036DB3 1A:ADA3: F0        .byte $F0
- D 1 - I - 0x036DB4 1A:ADA4: 45        .byte $45
- D 1 - I - 0x036DB5 1A:ADA5: F0        .byte $F0
- D 1 - I - 0x036DB6 1A:ADA6: 44        .byte $44
- D 1 - I - 0x036DB7 1A:ADA7: F0        .byte $F0
- D 1 - I - 0x036DB8 1A:ADA8: F0        .byte $F0
- D 1 - I - 0x036DB9 1A:ADA9: F0        .byte $F0
- D 1 - I - 0x036DBA 1A:ADAA: F0        .byte $F0
- D 1 - I - 0x036DBB 1A:ADAB: 85        .byte $85
- D 1 - I - 0x036DBC 1A:ADAC: 4A        .byte $4A
- D 1 - I - 0x036DBD 1A:ADAD: 34        .byte $34
- D 1 - I - 0x036DBE 1A:ADAE: 65        .byte $65
- D 1 - I - 0x036DBF 1A:ADAF: 5D        .byte $5D
- D 1 - I - 0x036DC0 1A:ADB0: 8F        .byte $8F
- D 1 - I - 0x036DC1 1A:ADB1: 5B        .byte $5B
- D 1 - I - 0x036DC2 1A:ADB2: 42        .byte $42
- D 1 - I - 0x036DC3 1A:ADB3: 2A        .byte $2A
- D 1 - I - 0x036DC4 1A:ADB4: 46        .byte $46
- D 1 - I - 0x036DC5 1A:ADB5: 7E        .byte $7E
- D 1 - I - 0x036DC6 1A:ADB6: 72        .byte $72
- D 1 - I - 0x036DC7 1A:ADB7: F0        .byte $F0
- D 1 - I - 0x036DC8 1A:ADB8: F0        .byte $F0
- D 1 - I - 0x036DC9 1A:ADB9: F0        .byte $F0
- D 1 - I - 0x036DCA 1A:ADBA: 6A        .byte $6A
- D 1 - I - 0x036DCB 1A:ADBB: F0        .byte $F0
- D 1 - I - 0x036DCC 1A:ADBC: F0        .byte $F0
- D 1 - I - 0x036DCD 1A:ADBD: F0        .byte $F0
- D 1 - I - 0x036DCE 1A:ADBE: 74        .byte $74
- D 1 - I - 0x036DCF 1A:ADBF: 7B        .byte $7B
- D 1 - I - 0x036DD0 1A:ADC0: B6        .byte $B6
- D 1 - I - 0x036DD1 1A:ADC1: 65        .byte $65
- D 1 - I - 0x036DD2 1A:ADC2: 88        .byte $88
- D 1 - I - 0x036DD3 1A:ADC3: 75        .byte $75
- D 1 - I - 0x036DD4 1A:ADC4: 8F        .byte $8F
- D 1 - I - 0x036DD5 1A:ADC5: 8B        .byte $8B
- D 1 - I - 0x036DD6 1A:ADC6: 73        .byte $73
- D 1 - I - 0x036DD7 1A:ADC7: 4E        .byte $4E
- D 1 - I - 0x036DD8 1A:ADC8: 5C        .byte $5C
- D 1 - I - 0x036DD9 1A:ADC9: C6        .byte $C6
- D 1 - I - 0x036DDA 1A:ADCA: 96        .byte $96
- D 1 - I - 0x036DDB 1A:ADCB: F0        .byte $F0
- D 1 - I - 0x036DDC 1A:ADCC: F0        .byte $F0
- D 1 - I - 0x036DDD 1A:ADCD: F0        .byte $F0
- D 1 - I - 0x036DDE 1A:ADCE: 9A        .byte $9A
- D 1 - I - 0x036DDF 1A:ADCF: F0        .byte $F0
- D 1 - I - 0x036DE0 1A:ADD0: F0        .byte $F0
- D 1 - I - 0x036DE1 1A:ADD1: F0        .byte $F0
- D 1 - I - 0x036DE2 1A:ADD2: A4        .byte $A4
- D 1 - I - 0x036DE3 1A:ADD3: 7A        .byte $7A
- D 1 - I - 0x036DE4 1A:ADD4: CD        .byte $CD



off_ADD5_02:
- D 1 - I - 0x036DE5 1A:ADD5: F0        .byte $F0
- D 1 - I - 0x036DE6 1A:ADD6: F0        .byte $F0
- D 1 - I - 0x036DE7 1A:ADD7: 07        .byte $07
- D 1 - I - 0x036DE8 1A:ADD8: 07        .byte $07
- D 1 - I - 0x036DE9 1A:ADD9: 04        .byte $04
- D 1 - I - 0x036DEA 1A:ADDA: 04        .byte $04
- D 1 - I - 0x036DEB 1A:ADDB: F0        .byte $F0
- D 1 - I - 0x036DEC 1A:ADDC: F0        .byte $F0
- D 1 - I - 0x036DED 1A:ADDD: F0        .byte $F0
- D 1 - I - 0x036DEE 1A:ADDE: 1C        .byte $1C
- D 1 - I - 0x036DEF 1A:ADDF: 51        .byte $51
- D 1 - I - 0x036DF0 1A:ADE0: 77        .byte $77
- D 1 - I - 0x036DF1 1A:ADE1: 11        .byte $11
- D 1 - I - 0x036DF2 1A:ADE2: 11        .byte $11
- D 1 - I - 0x036DF3 1A:ADE3: 71        .byte $71
- D 1 - I - 0x036DF4 1A:ADE4: 73        .byte $73
- D 1 - I - 0x036DF5 1A:ADE5: 1E        .byte $1E
- D 1 - I - 0x036DF6 1A:ADE6: 1E        .byte $1E
- D 1 - I - 0x036DF7 1A:ADE7: 54        .byte $54
- D 1 - I - 0x036DF8 1A:ADE8: 6C        .byte $6C
- D 1 - I - 0x036DF9 1A:ADE9: F0        .byte $F0
- D 1 - I - 0x036DFA 1A:ADEA: 24        .byte $24
- D 1 - I - 0x036DFB 1A:ADEB: 1F        .byte $1F
- D 1 - I - 0x036DFC 1A:ADEC: 06        .byte $06
- D 1 - I - 0x036DFD 1A:ADED: 04        .byte $04
- D 1 - I - 0x036DFE 1A:ADEE: 04        .byte $04
- D 1 - I - 0x036DFF 1A:ADEF: 0F        .byte $0F
- D 1 - I - 0x036E00 1A:ADF0: 1B        .byte $1B
- D 1 - I - 0x036E01 1A:ADF1: F0        .byte $F0
- D 1 - I - 0x036E02 1A:ADF2: F0        .byte $F0
- D 1 - I - 0x036E03 1A:ADF3: 46        .byte $46
- D 1 - I - 0x036E04 1A:ADF4: 76        .byte $76
- D 1 - I - 0x036E05 1A:ADF5: 29        .byte $29
- D 1 - I - 0x036E06 1A:ADF6: 36        .byte $36
- D 1 - I - 0x036E07 1A:ADF7: 7C        .byte $7C
- D 1 - I - 0x036E08 1A:ADF8: 7E        .byte $7E
- D 1 - I - 0x036E09 1A:ADF9: F0        .byte $F0
- D 1 - I - 0x036E0A 1A:ADFA: 1C        .byte $1C
- D 1 - I - 0x036E0B 1A:ADFB: F0        .byte $F0
- D 1 - I - 0x036E0C 1A:ADFC: F0        .byte $F0
- D 1 - I - 0x036E0D 1A:ADFD: 3C        .byte $3C
- D 1 - I - 0x036E0E 1A:ADFE: 19        .byte $19
- D 1 - I - 0x036E0F 1A:ADFF: 13        .byte $13
- D 1 - I - 0x036E10 1A:AE00: 39        .byte $39
- D 1 - I - 0x036E11 1A:AE01: 1C        .byte $1C
- D 1 - I - 0x036E12 1A:AE02: 33        .byte $33
- D 1 - I - 0x036E13 1A:AE03: 0F        .byte $0F
- D 1 - I - 0x036E14 1A:AE04: 11        .byte $11
- D 1 - I - 0x036E15 1A:AE05: F0        .byte $F0
- D 1 - I - 0x036E16 1A:AE06: 3E        .byte $3E
- D 1 - I - 0x036E17 1A:AE07: 5E        .byte $5E
- D 1 - I - 0x036E18 1A:AE08: 9B        .byte $9B
- D 1 - I - 0x036E19 1A:AE09: 36        .byte $36
- D 1 - I - 0x036E1A 1A:AE0A: 4F        .byte $4F
- D 1 - I - 0x036E1B 1A:AE0B: 9E        .byte $9E
- D 1 - I - 0x036E1C 1A:AE0C: A2        .byte $A2
- D 1 - I - 0x036E1D 1A:AE0D: 4C        .byte $4C
- D 1 - I - 0x036E1E 1A:AE0E: 1E        .byte $1E
- D 1 - I - 0x036E1F 1A:AE0F: F0        .byte $F0
- D 1 - I - 0x036E20 1A:AE10: F0        .byte $F0
- D 1 - I - 0x036E21 1A:AE11: 30        .byte $30
- D 1 - I - 0x036E22 1A:AE12: 49        .byte $49
- D 1 - I - 0x036E23 1A:AE13: 37        .byte $37
- D 1 - I - 0x036E24 1A:AE14: 51        .byte $51
- D 1 - I - 0x036E25 1A:AE15: 58        .byte $58
- D 1 - I - 0x036E26 1A:AE16: 35        .byte $35
- D 1 - I - 0x036E27 1A:AE17: 32        .byte $32
- D 1 - I - 0x036E28 1A:AE18: 1C        .byte $1C
- D 1 - I - 0x036E29 1A:AE19: 6C        .byte $6C
- D 1 - I - 0x036E2A 1A:AE1A: 6E        .byte $6E
- D 1 - I - 0x036E2B 1A:AE1B: 8E        .byte $8E
- D 1 - I - 0x036E2C 1A:AE1C: BE        .byte $BE
- D 1 - I - 0x036E2D 1A:AE1D: 4F        .byte $4F
- D 1 - I - 0x036E2E 1A:AE1E: 7F        .byte $7F
- D 1 - I - 0x036E2F 1A:AE1F: F0        .byte $F0
- D 1 - I - 0x036E30 1A:AE20: B8        .byte $B8
- D 1 - I - 0x036E31 1A:AE21: 7C        .byte $7C
- D 1 - I - 0x036E32 1A:AE22: 59        .byte $59
- D 1 - I - 0x036E33 1A:AE23: F0        .byte $F0
- D 1 - I - 0x036E34 1A:AE24: F0        .byte $F0
- D 1 - I - 0x036E35 1A:AE25: 6C        .byte $6C
- D 1 - I - 0x036E36 1A:AE26: 55        .byte $55
- D 1 - I - 0x036E37 1A:AE27: 5D        .byte $5D
- D 1 - I - 0x036E38 1A:AE28: 82        .byte $82
- D 1 - I - 0x036E39 1A:AE29: 6F        .byte $6F
- D 1 - I - 0x036E3A 1A:AE2A: 65        .byte $65
- D 1 - I - 0x036E3B 1A:AE2B: 4C        .byte $4C
- D 1 - I - 0x036E3C 1A:AE2C: 4E        .byte $4E
- D 1 - I - 0x036E3D 1A:AE2D: F0        .byte $F0
- D 1 - I - 0x036E3E 1A:AE2E: 91        .byte $91
- D 1 - I - 0x036E3F 1A:AE2F: A6        .byte $A6
- D 1 - I - 0x036E40 1A:AE30: D6        .byte $D6
- D 1 - I - 0x036E41 1A:AE31: 7E        .byte $7E
- D 1 - I - 0x036E42 1A:AE32: 98        .byte $98
- D 1 - I - 0x036E43 1A:AE33: F0        .byte $F0
- D 1 - I - 0x036E44 1A:AE34: DC        .byte $DC
- D 1 - I - 0x036E45 1A:AE35: 88        .byte $88
- D 1 - I - 0x036E46 1A:AE36: A0        .byte $A0
- D 1 - I - 0x036E47 1A:AE37: F0        .byte $F0
- D 1 - I - 0x036E48 1A:AE38: F0        .byte $F0
- D 1 - I - 0x036E49 1A:AE39: F0        .byte $F0
- D 1 - I - 0x036E4A 1A:AE3A: 04        .byte $04
- D 1 - I - 0x036E4B 1A:AE3B: F0        .byte $F0
- D 1 - I - 0x036E4C 1A:AE3C: 07        .byte $07
- D 1 - I - 0x036E4D 1A:AE3D: F0        .byte $F0
- D 1 - I - 0x036E4E 1A:AE3E: F0        .byte $F0
- D 1 - I - 0x036E4F 1A:AE3F: F0        .byte $F0
- D 1 - I - 0x036E50 1A:AE40: F0        .byte $F0
- D 1 - I - 0x036E51 1A:AE41: F0        .byte $F0
- D 1 - I - 0x036E52 1A:AE42: 1D        .byte $1D
- D 1 - I - 0x036E53 1A:AE43: 46        .byte $46
- D 1 - I - 0x036E54 1A:AE44: 77        .byte $77
- D 1 - I - 0x036E55 1A:AE45: F0        .byte $F0
- D 1 - I - 0x036E56 1A:AE46: 12        .byte $12
- D 1 - I - 0x036E57 1A:AE47: 71        .byte $71
- D 1 - I - 0x036E58 1A:AE48: 66        .byte $66
- D 1 - I - 0x036E59 1A:AE49: F0        .byte $F0
- D 1 - I - 0x036E5A 1A:AE4A: F0        .byte $F0
- D 1 - I - 0x036E5B 1A:AE4B: 3D        .byte $3D
- D 1 - I - 0x036E5C 1A:AE4C: 6C        .byte $6C
- D 1 - I - 0x036E5D 1A:AE4D: 03        .byte $03
- D 1 - I - 0x036E5E 1A:AE4E: 10        .byte $10
- D 1 - I - 0x036E5F 1A:AE4F: 13        .byte $13
- D 1 - I - 0x036E60 1A:AE50: 08        .byte $08
- D 1 - I - 0x036E61 1A:AE51: F0        .byte $F0
- D 1 - I - 0x036E62 1A:AE52: 1E        .byte $1E
- D 1 - I - 0x036E63 1A:AE53: F0        .byte $F0
- D 1 - I - 0x036E64 1A:AE54: 05        .byte $05
- D 1 - I - 0x036E65 1A:AE55: F0        .byte $F0
- D 1 - I - 0x036E66 1A:AE56: 28        .byte $28
- D 1 - I - 0x036E67 1A:AE57: 2E        .byte $2E
- D 1 - I - 0x036E68 1A:AE58: 77        .byte $77
- D 1 - I - 0x036E69 1A:AE59: F0        .byte $F0
- D 1 - I - 0x036E6A 1A:AE5A: 2B        .byte $2B
- D 1 - I - 0x036E6B 1A:AE5B: 6F        .byte $6F
- D 1 - I - 0x036E6C 1A:AE5C: 73        .byte $73
- D 1 - I - 0x036E6D 1A:AE5D: F0        .byte $F0
- D 1 - I - 0x036E6E 1A:AE5E: F0        .byte $F0
- D 1 - I - 0x036E6F 1A:AE5F: 25        .byte $25
- D 1 - I - 0x036E70 1A:AE60: 6C        .byte $6C
- D 1 - I - 0x036E71 1A:AE61: 55        .byte $55
- D 1 - I - 0x036E72 1A:AE62: 0F        .byte $0F
- D 1 - I - 0x036E73 1A:AE63: 14        .byte $14
- D 1 - I - 0x036E74 1A:AE64: 5E        .byte $5E
- D 1 - I - 0x036E75 1A:AE65: 35        .byte $35
- D 1 - I - 0x036E76 1A:AE66: 1D        .byte $1D
- D 1 - I - 0x036E77 1A:AE67: 12        .byte $12
- D 1 - I - 0x036E78 1A:AE68: 05        .byte $05
- D 1 - I - 0x036E79 1A:AE69: 27        .byte $27
- D 1 - I - 0x036E7A 1A:AE6A: 4B        .byte $4B
- D 1 - I - 0x036E7B 1A:AE6B: 39        .byte $39
- D 1 - I - 0x036E7C 1A:AE6C: 8F        .byte $8F
- D 1 - I - 0x036E7D 1A:AE6D: 2B        .byte $2B
- D 1 - I - 0x036E7E 1A:AE6E: 36        .byte $36
- D 1 - I - 0x036E7F 1A:AE6F: F0        .byte $F0
- D 1 - I - 0x036E80 1A:AE70: F0        .byte $F0
- D 1 - I - 0x036E81 1A:AE71: F0        .byte $F0
- D 1 - I - 0x036E82 1A:AE72: F0        .byte $F0
- D 1 - I - 0x036E83 1A:AE73: 3E        .byte $3E
- D 1 - I - 0x036E84 1A:AE74: 84        .byte $84
- D 1 - I - 0x036E85 1A:AE75: 31        .byte $31
- D 1 - I - 0x036E86 1A:AE76: 61        .byte $61
- D 1 - I - 0x036E87 1A:AE77: 3A        .byte $3A
- D 1 - I - 0x036E88 1A:AE78: 6A        .byte $6A
- D 1 - I - 0x036E89 1A:AE79: 3F        .byte $3F
- D 1 - I - 0x036E8A 1A:AE7A: 44        .byte $44
- D 1 - I - 0x036E8B 1A:AE7B: 28        .byte $28
- D 1 - I - 0x036E8C 1A:AE7C: 2B        .byte $2B
- D 1 - I - 0x036E8D 1A:AE7D: 57        .byte $57
- D 1 - I - 0x036E8E 1A:AE7E: 7B        .byte $7B
- D 1 - I - 0x036E8F 1A:AE7F: A5        .byte $A5
- D 1 - I - 0x036E90 1A:AE80: CA        .byte $CA
- D 1 - I - 0x036E91 1A:AE81: 73        .byte $73
- D 1 - I - 0x036E92 1A:AE82: 5C        .byte $5C
- D 1 - I - 0x036E93 1A:AE83: F0        .byte $F0
- D 1 - I - 0x036E94 1A:AE84: F0        .byte $F0
- D 1 - I - 0x036E95 1A:AE85: 59        .byte $59
- D 1 - I - 0x036E96 1A:AE86: 71        .byte $71
- D 1 - I - 0x036E97 1A:AE87: 9E        .byte $9E
- D 1 - I - 0x036E98 1A:AE88: C0        .byte $C0
- D 1 - I - 0x036E99 1A:AE89: 79        .byte $79
- D 1 - I - 0x036E9A 1A:AE8A: 56        .byte $56
- D 1 - I - 0x036E9B 1A:AE8B: 5D        .byte $5D
- D 1 - I - 0x036E9C 1A:AE8C: 82        .byte $82
- D 1 - I - 0x036E9D 1A:AE8D: 70        .byte $70
- D 1 - I - 0x036E9E 1A:AE8E: 66        .byte $66
- D 1 - I - 0x036E9F 1A:AE8F: 41        .byte $41
- D 1 - I - 0x036EA0 1A:AE90: 4E        .byte $4E
- D 1 - I - 0x036EA1 1A:AE91: 9D        .byte $9D
- D 1 - I - 0x036EA2 1A:AE92: 88        .byte $88
- D 1 - I - 0x036EA3 1A:AE93: B0        .byte $B0
- D 1 - I - 0x036EA4 1A:AE94: D6        .byte $D6
- D 1 - I - 0x036EA5 1A:AE95: 8B        .byte $8B
- D 1 - I - 0x036EA6 1A:AE96: A6        .byte $A6
- D 1 - I - 0x036EA7 1A:AE97: F0        .byte $F0
- D 1 - I - 0x036EA8 1A:AE98: F0        .byte $F0
- D 1 - I - 0x036EA9 1A:AE99: F0        .byte $F0
- D 1 - I - 0x036EAA 1A:AE9A: 89        .byte $89
- D 1 - I - 0x036EAB 1A:AE9B: 9F        .byte $9F
- D 1 - I - 0x036EAC 1A:AE9C: CD        .byte $CD
- D 1 - I - 0x036EAD 1A:AE9D: 04        .byte $04
- D 1 - I - 0x036EAE 1A:AE9E: 04        .byte $04
- D 1 - I - 0x036EAF 1A:AE9F: F0        .byte $F0
- D 1 - I - 0x036EB0 1A:AEA0: F0        .byte $F0
- D 1 - I - 0x036EB1 1A:AEA1: 07        .byte $07
- D 1 - I - 0x036EB2 1A:AEA2: 07        .byte $07
- D 1 - I - 0x036EB3 1A:AEA3: F0        .byte $F0
- D 1 - I - 0x036EB4 1A:AEA4: F0        .byte $F0
- D 1 - I - 0x036EB5 1A:AEA5: 12        .byte $12
- D 1 - I - 0x036EB6 1A:AEA6: 12        .byte $12
- D 1 - I - 0x036EB7 1A:AEA7: 5F        .byte $5F
- D 1 - I - 0x036EB8 1A:AEA8: 77        .byte $77
- D 1 - I - 0x036EB9 1A:AEA9: F0        .byte $F0
- D 1 - I - 0x036EBA 1A:AEAA: 1F        .byte $1F
- D 1 - I - 0x036EBB 1A:AEAB: 70        .byte $70
- D 1 - I - 0x036EBC 1A:AEAC: 73        .byte $73
- D 1 - I - 0x036EBD 1A:AEAD: 1D        .byte $1D
- D 1 - I - 0x036EBE 1A:AEAE: 1D        .byte $1D
- D 1 - I - 0x036EBF 1A:AEAF: 6C        .byte $6C
- D 1 - I - 0x036EC0 1A:AEB0: 4A        .byte $4A
- D 1 - I - 0x036EC1 1A:AEB1: 1C        .byte $1C
- D 1 - I - 0x036EC2 1A:AEB2: 05        .byte $05
- D 1 - I - 0x036EC3 1A:AEB3: F0        .byte $F0
- D 1 - I - 0x036EC4 1A:AEB4: 2F        .byte $2F
- D 1 - I - 0x036EC5 1A:AEB5: 07        .byte $07
- D 1 - I - 0x036EC6 1A:AEB6: 07        .byte $07
- D 1 - I - 0x036EC7 1A:AEB7: 14        .byte $14
- D 1 - I - 0x036EC8 1A:AEB8: 20        .byte $20
- D 1 - I - 0x036EC9 1A:AEB9: 2A        .byte $2A
- D 1 - I - 0x036ECA 1A:AEBA: 36        .byte $36
- D 1 - I - 0x036ECB 1A:AEBB: F0        .byte $F0
- D 1 - I - 0x036ECC 1A:AEBC: F0        .byte $F0
- D 1 - I - 0x036ECD 1A:AEBD: F0        .byte $F0
- D 1 - I - 0x036ECE 1A:AEBE: F0        .byte $F0
- D 1 - I - 0x036ECF 1A:AEBF: 7D        .byte $7D
- D 1 - I - 0x036ED0 1A:AEC0: 7F        .byte $7F
- D 1 - I - 0x036ED1 1A:AEC1: F0        .byte $F0
- D 1 - I - 0x036ED2 1A:AEC2: 1F        .byte $1F
- D 1 - I - 0x036ED3 1A:AEC3: 49        .byte $49
- D 1 - I - 0x036ED4 1A:AEC4: 6D        .byte $6D
- D 1 - I - 0x036ED5 1A:AEC5: 10        .byte $10
- D 1 - I - 0x036ED6 1A:AEC6: 32        .byte $32
- D 1 - I - 0x036ED7 1A:AEC7: 22        .byte $22
- D 1 - I - 0x036ED8 1A:AEC8: 47        .byte $47
- D 1 - I - 0x036ED9 1A:AEC9: 1F        .byte $1F
- D 1 - I - 0x036EDA 1A:AECA: 37        .byte $37
- D 1 - I - 0x036EDB 1A:AECB: 12        .byte $12
- D 1 - I - 0x036EDC 1A:AECC: 14        .byte $14
- D 1 - I - 0x036EDD 1A:AECD: 40        .byte $40
- D 1 - I - 0x036EDE 1A:AECE: 35        .byte $35
- D 1 - I - 0x036EDF 1A:AECF: F0        .byte $F0
- D 1 - I - 0x036EE0 1A:AED0: F0        .byte $F0
- D 1 - I - 0x036EE1 1A:AED1: F0        .byte $F0
- D 1 - I - 0x036EE2 1A:AED2: 45        .byte $45
- D 1 - I - 0x036EE3 1A:AED3: A1        .byte $A1
- D 1 - I - 0x036EE4 1A:AED4: A5        .byte $A5
- D 1 - I - 0x036EE5 1A:AED5: 1D        .byte $1D
- D 1 - I - 0x036EE6 1A:AED6: 4F        .byte $4F
- D 1 - I - 0x036EE7 1A:AED7: 90        .byte $90
- D 1 - I - 0x036EE8 1A:AED8: 55        .byte $55
- D 1 - I - 0x036EE9 1A:AED9: 4A        .byte $4A
- D 1 - I - 0x036EEA 1A:AEDA: 34        .byte $34
- D 1 - I - 0x036EEB 1A:AEDB: 3B        .byte $3B
- D 1 - I - 0x036EEC 1A:AEDC: 3B        .byte $3B
- D 1 - I - 0x036EED 1A:AEDD: 36        .byte $36
- D 1 - I - 0x036EEE 1A:AEDE: 5B        .byte $5B
- D 1 - I - 0x036EEF 1A:AEDF: 1F        .byte $1F
- D 1 - I - 0x036EF0 1A:AEE0: 39        .byte $39
- D 1 - I - 0x036EF1 1A:AEE1: 4C        .byte $4C
- D 1 - I - 0x036EF2 1A:AEE2: 70        .byte $70
- D 1 - I - 0x036EF3 1A:AEE3: F0        .byte $F0
- D 1 - I - 0x036EF4 1A:AEE4: F0        .byte $F0
- D 1 - I - 0x036EF5 1A:AEE5: 50        .byte $50
- D 1 - I - 0x036EF6 1A:AEE6: 6A        .byte $6A
- D 1 - I - 0x036EF7 1A:AEE7: F0        .byte $F0
- D 1 - I - 0x036EF8 1A:AEE8: BB        .byte $BB
- D 1 - I - 0x036EF9 1A:AEE9: 59        .byte $59
- D 1 - I - 0x036EFA 1A:AEEA: 80        .byte $80
- D 1 - I - 0x036EFB 1A:AEEB: 85        .byte $85
- D 1 - I - 0x036EFC 1A:AEEC: B5        .byte $B5
- D 1 - I - 0x036EFD 1A:AEED: 79        .byte $79
- D 1 - I - 0x036EFE 1A:AEEE: 55        .byte $55
- D 1 - I - 0x036EFF 1A:AEEF: 5E        .byte $5E
- D 1 - I - 0x036F00 1A:AEF0: 77        .byte $77
- D 1 - I - 0x036F01 1A:AEF1: 66        .byte $66
- D 1 - I - 0x036F02 1A:AEF2: 74        .byte $74
- D 1 - I - 0x036F03 1A:AEF3: 4D        .byte $4D
- D 1 - I - 0x036F04 1A:AEF4: 4F        .byte $4F
- D 1 - I - 0x036F05 1A:AEF5: F0        .byte $F0
- D 1 - I - 0x036F06 1A:AEF6: 8D        .byte $8D
- D 1 - I - 0x036F07 1A:AEF7: F0        .byte $F0
- D 1 - I - 0x036F08 1A:AEF8: F0        .byte $F0
- D 1 - I - 0x036F09 1A:AEF9: 93        .byte $93
- D 1 - I - 0x036F0A 1A:AEFA: 7C        .byte $7C
- D 1 - I - 0x036F0B 1A:AEFB: F0        .byte $F0
- D 1 - I - 0x036F0C 1A:AEFC: DF        .byte $DF
- D 1 - I - 0x036F0D 1A:AEFD: 7E        .byte $7E
- D 1 - I - 0x036F0E 1A:AEFE: A3        .byte $A3
- D 1 - I - 0x036F0F 1A:AEFF: 9D        .byte $9D
- D 1 - I - 0x036F10 1A:AF00: CD        .byte $CD



off_AF01_03:
- D 1 - I - 0x036F11 1A:AF01: F0        .byte $F0
- D 1 - I - 0x036F12 1A:AF02: F0        .byte $F0
- D 1 - I - 0x036F13 1A:AF03: 07        .byte $07
- D 1 - I - 0x036F14 1A:AF04: 07        .byte $07
- D 1 - I - 0x036F15 1A:AF05: 04        .byte $04
- D 1 - I - 0x036F16 1A:AF06: 04        .byte $04
- D 1 - I - 0x036F17 1A:AF07: F0        .byte $F0
- D 1 - I - 0x036F18 1A:AF08: F0        .byte $F0
- D 1 - I - 0x036F19 1A:AF09: F0        .byte $F0
- D 1 - I - 0x036F1A 1A:AF0A: 1C        .byte $1C
- D 1 - I - 0x036F1B 1A:AF0B: 13        .byte $13
- D 1 - I - 0x036F1C 1A:AF0C: 13        .byte $13
- D 1 - I - 0x036F1D 1A:AF0D: 1E        .byte $1E
- D 1 - I - 0x036F1E 1A:AF0E: 1E        .byte $1E
- D 1 - I - 0x036F1F 1A:AF0F: 4E        .byte $4E
- D 1 - I - 0x036F20 1A:AF10: 73        .byte $73
- D 1 - I - 0x036F21 1A:AF11: 11        .byte $11
- D 1 - I - 0x036F22 1A:AF12: 11        .byte $11
- D 1 - I - 0x036F23 1A:AF13: 7B        .byte $7B
- D 1 - I - 0x036F24 1A:AF14: 3E        .byte $3E
- D 1 - I - 0x036F25 1A:AF15: F0        .byte $F0
- D 1 - I - 0x036F26 1A:AF16: F0        .byte $F0
- D 1 - I - 0x036F27 1A:AF17: 05        .byte $05
- D 1 - I - 0x036F28 1A:AF18: 05        .byte $05
- D 1 - I - 0x036F29 1A:AF19: 1C        .byte $1C
- D 1 - I - 0x036F2A 1A:AF1A: 04        .byte $04
- D 1 - I - 0x036F2B 1A:AF1B: 0F        .byte $0F
- D 1 - I - 0x036F2C 1A:AF1C: 24        .byte $24
- D 1 - I - 0x036F2D 1A:AF1D: F0        .byte $F0
- D 1 - I - 0x036F2E 1A:AF1E: 33        .byte $33
- D 1 - I - 0x036F2F 1A:AF1F: 1F        .byte $1F
- D 1 - I - 0x036F30 1A:AF20: 36        .byte $36
- D 1 - I - 0x036F31 1A:AF21: 29        .byte $29
- D 1 - I - 0x036F32 1A:AF22: 29        .byte $29
- D 1 - I - 0x036F33 1A:AF23: 7C        .byte $7C
- D 1 - I - 0x036F34 1A:AF24: 75        .byte $75
- D 1 - I - 0x036F35 1A:AF25: 26        .byte $26
- D 1 - I - 0x036F36 1A:AF26: 65        .byte $65
- D 1 - I - 0x036F37 1A:AF27: F0        .byte $F0
- D 1 - I - 0x036F38 1A:AF28: F0        .byte $F0
- D 1 - I - 0x036F39 1A:AF29: 3E        .byte $3E
- D 1 - I - 0x036F3A 1A:AF2A: 3C        .byte $3C
- D 1 - I - 0x036F3B 1A:AF2B: 1F        .byte $1F
- D 1 - I - 0x036F3C 1A:AF2C: 3A        .byte $3A
- D 1 - I - 0x036F3D 1A:AF2D: 1D        .byte $1D
- D 1 - I - 0x036F3E 1A:AF2E: 34        .byte $34
- D 1 - I - 0x036F3F 1A:AF2F: 19        .byte $19
- D 1 - I - 0x036F40 1A:AF30: 10        .byte $10
- D 1 - I - 0x036F41 1A:AF31: F0        .byte $F0
- D 1 - I - 0x036F42 1A:AF32: F0        .byte $F0
- D 1 - I - 0x036F43 1A:AF33: 82        .byte $82
- D 1 - I - 0x036F44 1A:AF34: 69        .byte $69
- D 1 - I - 0x036F45 1A:AF35: 36        .byte $36
- D 1 - I - 0x036F46 1A:AF36: 5A        .byte $5A
- D 1 - I - 0x036F47 1A:AF37: 7E        .byte $7E
- D 1 - I - 0x036F48 1A:AF38: 98        .byte $98
- D 1 - I - 0x036F49 1A:AF39: 4B        .byte $4B
- D 1 - I - 0x036F4A 1A:AF3A: 58        .byte $58
- D 1 - I - 0x036F4B 1A:AF3B: F0        .byte $F0
- D 1 - I - 0x036F4C 1A:AF3C: 92        .byte $92
- D 1 - I - 0x036F4D 1A:AF3D: 6C        .byte $6C
- D 1 - I - 0x036F4E 1A:AF3E: 55        .byte $55
- D 1 - I - 0x036F4F 1A:AF3F: 37        .byte $37
- D 1 - I - 0x036F50 1A:AF40: 75        .byte $75
- D 1 - I - 0x036F51 1A:AF41: 57        .byte $57
- D 1 - I - 0x036F52 1A:AF42: 41        .byte $41
- D 1 - I - 0x036F53 1A:AF43: 32        .byte $32
- D 1 - I - 0x036F54 1A:AF44: 28        .byte $28
- D 1 - I - 0x036F55 1A:AF45: 90        .byte $90
- D 1 - I - 0x036F56 1A:AF46: 6E        .byte $6E
- D 1 - I - 0x036F57 1A:AF47: 7F        .byte $7F
- D 1 - I - 0x036F58 1A:AF48: B1        .byte $B1
- D 1 - I - 0x036F59 1A:AF49: 5A        .byte $5A
- D 1 - I - 0x036F5A 1A:AF4A: AE        .byte $AE
- D 1 - I - 0x036F5B 1A:AF4B: C7        .byte $C7
- D 1 - I - 0x036F5C 1A:AF4C: CA        .byte $CA
- D 1 - I - 0x036F5D 1A:AF4D: 64        .byte $64
- D 1 - I - 0x036F5E 1A:AF4E: B7        .byte $B7
- D 1 - I - 0x036F5F 1A:AF4F: F0        .byte $F0
- D 1 - I - 0x036F60 1A:AF50: F0        .byte $F0
- D 1 - I - 0x036F61 1A:AF51: 84        .byte $84
- D 1 - I - 0x036F62 1A:AF52: 6E        .byte $6E
- D 1 - I - 0x036F63 1A:AF53: 74        .byte $74
- D 1 - I - 0x036F64 1A:AF54: 9A        .byte $9A
- D 1 - I - 0x036F65 1A:AF55: 88        .byte $88
- D 1 - I - 0x036F66 1A:AF56: 7D        .byte $7D
- D 1 - I - 0x036F67 1A:AF57: 4B        .byte $4B
- D 1 - I - 0x036F68 1A:AF58: 59        .byte $59
- D 1 - I - 0x036F69 1A:AF59: F0        .byte $F0
- D 1 - I - 0x036F6A 1A:AF5A: F0        .byte $F0
- D 1 - I - 0x036F6B 1A:AF5B: BB        .byte $BB
- D 1 - I - 0x036F6C 1A:AF5C: D5        .byte $D5
- D 1 - I - 0x036F6D 1A:AF5D: 9F        .byte $9F
- D 1 - I - 0x036F6E 1A:AF5E: A1        .byte $A1
- D 1 - I - 0x036F6F 1A:AF5F: EA        .byte $EA
- D 1 - I - 0x036F70 1A:AF60: EA        .byte $EA
- D 1 - I - 0x036F71 1A:AF61: A8        .byte $A8
- D 1 - I - 0x036F72 1A:AF62: D0        .byte $D0
- D 1 - I - 0x036F73 1A:AF63: F0        .byte $F0
- D 1 - I - 0x036F74 1A:AF64: F0        .byte $F0
- D 1 - I - 0x036F75 1A:AF65: F0        .byte $F0
- D 1 - I - 0x036F76 1A:AF66: F0        .byte $F0
- D 1 - I - 0x036F77 1A:AF67: F0        .byte $F0
- D 1 - I - 0x036F78 1A:AF68: F0        .byte $F0
- D 1 - I - 0x036F79 1A:AF69: F0        .byte $F0
- D 1 - I - 0x036F7A 1A:AF6A: 12        .byte $12
- D 1 - I - 0x036F7B 1A:AF6B: F0        .byte $F0
- D 1 - I - 0x036F7C 1A:AF6C: 04        .byte $04
- D 1 - I - 0x036F7D 1A:AF6D: F0        .byte $F0
- D 1 - I - 0x036F7E 1A:AF6E: 1D        .byte $1D
- D 1 - I - 0x036F7F 1A:AF6F: F0        .byte $F0
- D 1 - I - 0x036F80 1A:AF70: 07        .byte $07
- D 1 - I - 0x036F81 1A:AF71: F0        .byte $F0
- D 1 - I - 0x036F82 1A:AF72: 1E        .byte $1E
- D 1 - I - 0x036F83 1A:AF73: 73        .byte $73
- D 1 - I - 0x036F84 1A:AF74: 5E        .byte $5E
- D 1 - I - 0x036F85 1A:AF75: F0        .byte $F0
- D 1 - I - 0x036F86 1A:AF76: F0        .byte $F0
- D 1 - I - 0x036F87 1A:AF77: 70        .byte $70
- D 1 - I - 0x036F88 1A:AF78: 4A        .byte $4A
- D 1 - I - 0x036F89 1A:AF79: 03        .byte $03
- D 1 - I - 0x036F8A 1A:AF7A: 10        .byte $10
- D 1 - I - 0x036F8B 1A:AF7B: 08        .byte $08
- D 1 - I - 0x036F8C 1A:AF7C: 13        .byte $13
- D 1 - I - 0x036F8D 1A:AF7D: F0        .byte $F0
- D 1 - I - 0x036F8E 1A:AF7E: 1E        .byte $1E
- D 1 - I - 0x036F8F 1A:AF7F: 05        .byte $05
- D 1 - I - 0x036F90 1A:AF80: 05        .byte $05
- D 1 - I - 0x036F91 1A:AF81: F0        .byte $F0
- D 1 - I - 0x036F92 1A:AF82: 28        .byte $28
- D 1 - I - 0x036F93 1A:AF83: F0        .byte $F0
- D 1 - I - 0x036F94 1A:AF84: 45        .byte $45
- D 1 - I - 0x036F95 1A:AF85: F0        .byte $F0
- D 1 - I - 0x036F96 1A:AF86: 2B        .byte $2B
- D 1 - I - 0x036F97 1A:AF87: 73        .byte $73
- D 1 - I - 0x036F98 1A:AF88: 69        .byte $69
- D 1 - I - 0x036F99 1A:AF89: F0        .byte $F0
- D 1 - I - 0x036F9A 1A:AF8A: F0        .byte $F0
- D 1 - I - 0x036F9B 1A:AF8B: 6F        .byte $6F
- D 1 - I - 0x036F9C 1A:AF8C: 62        .byte $62
- D 1 - I - 0x036F9D 1A:AF8D: 1B        .byte $1B
- D 1 - I - 0x036F9E 1A:AF8E: 55        .byte $55
- D 1 - I - 0x036F9F 1A:AF8F: 20        .byte $20
- D 1 - I - 0x036FA0 1A:AF90: 5E        .byte $5E
- D 1 - I - 0x036FA1 1A:AF91: 1D        .byte $1D
- D 1 - I - 0x036FA2 1A:AF92: 35        .byte $35
- D 1 - I - 0x036FA3 1A:AF93: 12        .byte $12
- D 1 - I - 0x036FA4 1A:AF94: 12        .byte $12
- D 1 - I - 0x036FA5 1A:AF95: 6C        .byte $6C
- D 1 - I - 0x036FA6 1A:AF96: 63        .byte $63
- D 1 - I - 0x036FA7 1A:AF97: 68        .byte $68
- D 1 - I - 0x036FA8 1A:AF98: 81        .byte $81
- D 1 - I - 0x036FA9 1A:AF99: 36        .byte $36
- D 1 - I - 0x036FAA 1A:AF9A: 4F        .byte $4F
- D 1 - I - 0x036FAB 1A:AF9B: F0        .byte $F0
- D 1 - I - 0x036FAC 1A:AF9C: F0        .byte $F0
- D 1 - I - 0x036FAD 1A:AF9D: F0        .byte $F0
- D 1 - I - 0x036FAE 1A:AF9E: 58        .byte $58
- D 1 - I - 0x036FAF 1A:AF9F: F0        .byte $F0
- D 1 - I - 0x036FB0 1A:AFA0: F0        .byte $F0
- D 1 - I - 0x036FB1 1A:AFA1: 58        .byte $58
- D 1 - I - 0x036FB2 1A:AFA2: 79        .byte $79
- D 1 - I - 0x036FB3 1A:AFA3: 50        .byte $50
- D 1 - I - 0x036FB4 1A:AFA4: 82        .byte $82
- D 1 - I - 0x036FB5 1A:AFA5: 41        .byte $41
- D 1 - I - 0x036FB6 1A:AFA6: 5A        .byte $5A
- D 1 - I - 0x036FB7 1A:AFA7: 1E        .byte $1E
- D 1 - I - 0x036FB8 1A:AFA8: 37        .byte $37
- D 1 - I - 0x036FB9 1A:AFA9: B5        .byte $B5
- D 1 - I - 0x036FBA 1A:AFAA: 9E        .byte $9E
- D 1 - I - 0x036FBB 1A:AFAB: A5        .byte $A5
- D 1 - I - 0x036FBC 1A:AFAC: BE        .byte $BE
- D 1 - I - 0x036FBD 1A:AFAD: 73        .byte $73
- D 1 - I - 0x036FBE 1A:AFAE: 80        .byte $80
- D 1 - I - 0x036FBF 1A:AFAF: F0        .byte $F0
- D 1 - I - 0x036FC0 1A:AFB0: F0        .byte $F0
- D 1 - I - 0x036FC1 1A:AFB1: 7B        .byte $7B
- D 1 - I - 0x036FC2 1A:AFB2: 71        .byte $71
- D 1 - I - 0x036FC3 1A:AFB3: F0        .byte $F0
- D 1 - I - 0x036FC4 1A:AFB4: C3        .byte $C3
- D 1 - I - 0x036FC5 1A:AFB5: 9D        .byte $9D
- D 1 - I - 0x036FC6 1A:AFB6: 6E        .byte $6E
- D 1 - I - 0x036FC7 1A:AFB7: 75        .byte $75
- D 1 - I - 0x036FC8 1A:AFB8: A6        .byte $A6
- D 1 - I - 0x036FC9 1A:AFB9: 70        .byte $70
- D 1 - I - 0x036FCA 1A:AFBA: 89        .byte $89
- D 1 - I - 0x036FCB 1A:AFBB: 4E        .byte $4E
- D 1 - I - 0x036FCC 1A:AFBC: 67        .byte $67
- D 1 - I - 0x036FCD 1A:AFBD: E6        .byte $E6
- D 1 - I - 0x036FCE 1A:AFBE: CD        .byte $CD
- D 1 - I - 0x036FCF 1A:AFBF: D6        .byte $D6
- D 1 - I - 0x036FD0 1A:AFC0: ED        .byte $ED
- D 1 - I - 0x036FD1 1A:AFC1: A2        .byte $A2
- D 1 - I - 0x036FD2 1A:AFC2: 8B        .byte $8B
- D 1 - I - 0x036FD3 1A:AFC3: F0        .byte $F0
- D 1 - I - 0x036FD4 1A:AFC4: F0        .byte $F0
- D 1 - I - 0x036FD5 1A:AFC5: B6        .byte $B6
- D 1 - I - 0x036FD6 1A:AFC6: 94        .byte $94
- D 1 - I - 0x036FD7 1A:AFC7: F0        .byte $F0
- D 1 - I - 0x036FD8 1A:AFC8: F0        .byte $F0
- D 1 - I - 0x036FD9 1A:AFC9: 04        .byte $04
- D 1 - I - 0x036FDA 1A:AFCA: 04        .byte $04
- D 1 - I - 0x036FDB 1A:AFCB: F0        .byte $F0
- D 1 - I - 0x036FDC 1A:AFCC: F0        .byte $F0
- D 1 - I - 0x036FDD 1A:AFCD: 07        .byte $07
- D 1 - I - 0x036FDE 1A:AFCE: 07        .byte $07
- D 1 - I - 0x036FDF 1A:AFCF: F0        .byte $F0
- D 1 - I - 0x036FE0 1A:AFD0: F0        .byte $F0
- D 1 - I - 0x036FE1 1A:AFD1: 10        .byte $10
- D 1 - I - 0x036FE2 1A:AFD2: 10        .byte $10
- D 1 - I - 0x036FE3 1A:AFD3: F0        .byte $F0
- D 1 - I - 0x036FE4 1A:AFD4: 1F        .byte $1F
- D 1 - I - 0x036FE5 1A:AFD5: 12        .byte $12
- D 1 - I - 0x036FE6 1A:AFD6: 12        .byte $12
- D 1 - I - 0x036FE7 1A:AFD7: 75        .byte $75
- D 1 - I - 0x036FE8 1A:AFD8: 44        .byte $44
- D 1 - I - 0x036FE9 1A:AFD9: 1D        .byte $1D
- D 1 - I - 0x036FEA 1A:AFDA: 1D        .byte $1D
- D 1 - I - 0x036FEB 1A:AFDB: 70        .byte $70
- D 1 - I - 0x036FEC 1A:AFDC: 4D        .byte $4D
- D 1 - I - 0x036FED 1A:AFDD: 06        .byte $06
- D 1 - I - 0x036FEE 1A:AFDE: 06        .byte $06
- D 1 - I - 0x036FEF 1A:AFDF: F0        .byte $F0
- D 1 - I - 0x036FF0 1A:AFE0: F0        .byte $F0
- D 1 - I - 0x036FF1 1A:AFE1: 1F        .byte $1F
- D 1 - I - 0x036FF2 1A:AFE2: 07        .byte $07
- D 1 - I - 0x036FF3 1A:AFE3: 14        .byte $14
- D 1 - I - 0x036FF4 1A:AFE4: 2F        .byte $2F
- D 1 - I - 0x036FF5 1A:AFE5: 1C        .byte $1C
- D 1 - I - 0x036FF6 1A:AFE6: 34        .byte $34
- D 1 - I - 0x036FF7 1A:AFE7: F0        .byte $F0
- D 1 - I - 0x036FF8 1A:AFE8: 38        .byte $38
- D 1 - I - 0x036FF9 1A:AFE9: 20        .byte $20
- D 1 - I - 0x036FFA 1A:AFEA: 66        .byte $66
- D 1 - I - 0x036FFB 1A:AFEB: F0        .byte $F0
- D 1 - I - 0x036FFC 1A:AFEC: F0        .byte $F0
- D 1 - I - 0x036FFD 1A:AFED: 2A        .byte $2A
- D 1 - I - 0x036FFE 1A:AFEE: 2A        .byte $2A
- D 1 - I - 0x036FFF 1A:AFEF: 7F        .byte $7F
- D 1 - I - 0x037000 1A:AFF0: 6E        .byte $6E
- D 1 - I - 0x037001 1A:AFF1: 1C        .byte $1C
- D 1 - I - 0x037002 1A:AFF2: 31        .byte $31
- D 1 - I - 0x037003 1A:AFF3: 45        .byte $45
- D 1 - I - 0x037004 1A:AFF4: 47        .byte $47
- D 1 - I - 0x037005 1A:AFF5: 1E        .byte $1E
- D 1 - I - 0x037006 1A:AFF6: 37        .byte $37
- D 1 - I - 0x037007 1A:AFF7: 13        .byte $13
- D 1 - I - 0x037008 1A:AFF8: 22        .byte $22
- D 1 - I - 0x037009 1A:AFF9: 79        .byte $79
- D 1 - I - 0x03700A 1A:AFFA: 62        .byte $62
- D 1 - I - 0x03700B 1A:AFFB: F0        .byte $F0
- D 1 - I - 0x03700C 1A:AFFC: F0        .byte $F0
- D 1 - I - 0x03700D 1A:AFFD: 4F        .byte $4F
- D 1 - I - 0x03700E 1A:AFFE: 5C        .byte $5C
- D 1 - I - 0x03700F 1A:AFFF: F0        .byte $F0
- D 1 - I - 0x037010 1A:B000: 99        .byte $99
- D 1 - I - 0x037011 1A:B001: 35        .byte $35
- D 1 - I - 0x037012 1A:B002: 4D        .byte $4D
- D 1 - I - 0x037013 1A:B003: 93        .byte $93
- D 1 - I - 0x037014 1A:B004: 7D        .byte $7D
- D 1 - I - 0x037015 1A:B005: 6E        .byte $6E
- D 1 - I - 0x037016 1A:B006: 34        .byte $34
- D 1 - I - 0x037017 1A:B007: 5E        .byte $5E
- D 1 - I - 0x037018 1A:B008: 8F        .byte $8F
- D 1 - I - 0x037019 1A:B009: 42        .byte $42
- D 1 - I - 0x03701A 1A:B00A: 50        .byte $50
- D 1 - I - 0x03701B 1A:B00B: 2B        .byte $2B
- D 1 - I - 0x03701C 1A:B00C: 39        .byte $39
- D 1 - I - 0x03701D 1A:B00D: 87        .byte $87
- D 1 - I - 0x03701E 1A:B00E: 9E        .byte $9E
- D 1 - I - 0x03701F 1A:B00F: 81        .byte $81
- D 1 - I - 0x037020 1A:B010: A7        .byte $A7
- D 1 - I - 0x037021 1A:B011: 67        .byte $67
- D 1 - I - 0x037022 1A:B012: BB        .byte $BB
- D 1 - I - 0x037023 1A:B013: F0        .byte $F0
- D 1 - I - 0x037024 1A:B014: F0        .byte $F0
- D 1 - I - 0x037025 1A:B015: AD        .byte $AD
- D 1 - I - 0x037026 1A:B016: 59        .byte $59
- D 1 - I - 0x037027 1A:B017: C1        .byte $C1
- D 1 - I - 0x037028 1A:B018: C4        .byte $C4
- D 1 - I - 0x037029 1A:B019: 6F        .byte $6F
- D 1 - I - 0x03702A 1A:B01A: 91        .byte $91
- D 1 - I - 0x03702B 1A:B01B: 8F        .byte $8F
- D 1 - I - 0x03702C 1A:B01C: 75        .byte $75
- D 1 - I - 0x03702D 1A:B01D: 8B        .byte $8B
- D 1 - I - 0x03702E 1A:B01E: 7E        .byte $7E
- D 1 - I - 0x03702F 1A:B01F: 5A        .byte $5A
- D 1 - I - 0x037030 1A:B020: 50        .byte $50
- D 1 - I - 0x037031 1A:B021: B8        .byte $B8
- D 1 - I - 0x037032 1A:B022: CE        .byte $CE
- D 1 - I - 0x037033 1A:B023: F0        .byte $F0
- D 1 - I - 0x037034 1A:B024: F0        .byte $F0
- D 1 - I - 0x037035 1A:B025: B3        .byte $B3
- D 1 - I - 0x037036 1A:B026: D3        .byte $D3
- D 1 - I - 0x037037 1A:B027: F0        .byte $F0
- D 1 - I - 0x037038 1A:B028: F0        .byte $F0
- D 1 - I - 0x037039 1A:B029: AE        .byte $AE
- D 1 - I - 0x03703A 1A:B02A: A4        .byte $A4
- D 1 - I - 0x03703B 1A:B02B: E9        .byte $E9
- D 1 - I - 0x03703C 1A:B02C: E9        .byte $E9



off_B02D_04:
- D 1 - I - 0x03703D 1A:B02D: F0        .byte $F0
- D 1 - I - 0x03703E 1A:B02E: F0        .byte $F0
- D 1 - I - 0x03703F 1A:B02F: 07        .byte $07
- D 1 - I - 0x037040 1A:B030: 07        .byte $07
- D 1 - I - 0x037041 1A:B031: 04        .byte $04
- D 1 - I - 0x037042 1A:B032: 04        .byte $04
- D 1 - I - 0x037043 1A:B033: F0        .byte $F0
- D 1 - I - 0x037044 1A:B034: F0        .byte $F0
- D 1 - I - 0x037045 1A:B035: F0        .byte $F0
- D 1 - I - 0x037046 1A:B036: 1C        .byte $1C
- D 1 - I - 0x037047 1A:B037: 13        .byte $13
- D 1 - I - 0x037048 1A:B038: 13        .byte $13
- D 1 - I - 0x037049 1A:B039: 1E        .byte $1E
- D 1 - I - 0x03704A 1A:B03A: 1E        .byte $1E
- D 1 - I - 0x03704B 1A:B03B: 37        .byte $37
- D 1 - I - 0x03704C 1A:B03C: 68        .byte $68
- D 1 - I - 0x03704D 1A:B03D: 11        .byte $11
- D 1 - I - 0x03704E 1A:B03E: 11        .byte $11
- D 1 - I - 0x03704F 1A:B03F: F0        .byte $F0
- D 1 - I - 0x037050 1A:B040: F0        .byte $F0
- D 1 - I - 0x037051 1A:B041: F0        .byte $F0
- D 1 - I - 0x037052 1A:B042: F0        .byte $F0
- D 1 - I - 0x037053 1A:B043: 05        .byte $05
- D 1 - I - 0x037054 1A:B044: 05        .byte $05
- D 1 - I - 0x037055 1A:B045: 04        .byte $04
- D 1 - I - 0x037056 1A:B046: 1C        .byte $1C
- D 1 - I - 0x037057 1A:B047: F0        .byte $F0
- D 1 - I - 0x037058 1A:B048: 0F        .byte $0F
- D 1 - I - 0x037059 1A:B049: F0        .byte $F0
- D 1 - I - 0x03705A 1A:B04A: F0        .byte $F0
- D 1 - I - 0x03705B 1A:B04B: 29        .byte $29
- D 1 - I - 0x03705C 1A:B04C: 36        .byte $36
- D 1 - I - 0x03705D 1A:B04D: F0        .byte $F0
- D 1 - I - 0x03705E 1A:B04E: 33        .byte $33
- D 1 - I - 0x03705F 1A:B04F: 7E        .byte $7E
- D 1 - I - 0x037060 1A:B050: 5C        .byte $5C
- D 1 - I - 0x037061 1A:B051: F0        .byte $F0
- D 1 - I - 0x037062 1A:B052: 26        .byte $26
- D 1 - I - 0x037063 1A:B053: F0        .byte $F0
- D 1 - I - 0x037064 1A:B054: F0        .byte $F0
- D 1 - I - 0x037065 1A:B055: F0        .byte $F0
- D 1 - I - 0x037066 1A:B056: 3C        .byte $3C
- D 1 - I - 0x037067 1A:B057: 1D        .byte $1D
- D 1 - I - 0x037068 1A:B058: 4E        .byte $4E
- D 1 - I - 0x037069 1A:B059: 34        .byte $34
- D 1 - I - 0x03706A 1A:B05A: 35        .byte $35
- D 1 - I - 0x03706B 1A:B05B: 25        .byte $25
- D 1 - I - 0x03706C 1A:B05C: 1B        .byte $1B
- D 1 - I - 0x03706D 1A:B05D: F0        .byte $F0
- D 1 - I - 0x03706E 1A:B05E: 3E        .byte $3E
- D 1 - I - 0x03706F 1A:B05F: F0        .byte $F0
- D 1 - I - 0x037070 1A:B060: 4C        .byte $4C
- D 1 - I - 0x037071 1A:B061: F0        .byte $F0
- D 1 - I - 0x037072 1A:B062: 57        .byte $57
- D 1 - I - 0x037073 1A:B063: 51        .byte $51
- D 1 - I - 0x037074 1A:B064: 8C        .byte $8C
- D 1 - I - 0x037075 1A:B065: F0        .byte $F0
- D 1 - I - 0x037076 1A:B066: F0        .byte $F0
- D 1 - I - 0x037077 1A:B067: F0        .byte $F0
- D 1 - I - 0x037078 1A:B068: F0        .byte $F0
- D 1 - I - 0x037079 1A:B069: 6C        .byte $6C
- D 1 - I - 0x03707A 1A:B06A: 6E        .byte $6E
- D 1 - I - 0x03707B 1A:B06B: 36        .byte $36
- D 1 - I - 0x03707C 1A:B06C: 72        .byte $72
- D 1 - I - 0x03707D 1A:B06D: 57        .byte $57
- D 1 - I - 0x03707E 1A:B06E: 4D        .byte $4D
- D 1 - I - 0x03707F 1A:B06F: 3E        .byte $3E
- D 1 - I - 0x037080 1A:B070: 28        .byte $28
- D 1 - I - 0x037081 1A:B071: F0        .byte $F0
- D 1 - I - 0x037082 1A:B072: F0        .byte $F0
- D 1 - I - 0x037083 1A:B073: 70        .byte $70
- D 1 - I - 0x037084 1A:B074: 7D        .byte $7D
- D 1 - I - 0x037085 1A:B075: F0        .byte $F0
- D 1 - I - 0x037086 1A:B076: 87        .byte $87
- D 1 - I - 0x037087 1A:B077: 80        .byte $80
- D 1 - I - 0x037088 1A:B078: C7        .byte $C7
- D 1 - I - 0x037089 1A:B079: F0        .byte $F0
- D 1 - I - 0x03708A 1A:B07A: C7        .byte $C7
- D 1 - I - 0x03708B 1A:B07B: F0        .byte $F0
- D 1 - I - 0x03708C 1A:B07C: F0        .byte $F0
- D 1 - I - 0x03708D 1A:B07D: 84        .byte $84
- D 1 - I - 0x03708E 1A:B07E: 6E        .byte $6E
- D 1 - I - 0x03708F 1A:B07F: 66        .byte $66
- D 1 - I - 0x037090 1A:B080: A3        .byte $A3
- D 1 - I - 0x037091 1A:B081: 87        .byte $87
- D 1 - I - 0x037092 1A:B082: 70        .byte $70
- D 1 - I - 0x037093 1A:B083: 57        .byte $57
- D 1 - I - 0x037094 1A:B084: 4D        .byte $4D
- D 1 - I - 0x037095 1A:B085: F0        .byte $F0
- D 1 - I - 0x037096 1A:B086: 91        .byte $91
- D 1 - I - 0x037097 1A:B087: 95        .byte $95
- D 1 - I - 0x037098 1A:B088: AD        .byte $AD
- D 1 - I - 0x037099 1A:B089: F0        .byte $F0
- D 1 - I - 0x03709A 1A:B08A: B7        .byte $B7
- D 1 - I - 0x03709B 1A:B08B: F0        .byte $F0
- D 1 - I - 0x03709C 1A:B08C: D0        .byte $D0
- D 1 - I - 0x03709D 1A:B08D: F0        .byte $F0
- D 1 - I - 0x03709E 1A:B08E: F0        .byte $F0
- D 1 - I - 0x03709F 1A:B08F: F0        .byte $F0
- D 1 - I - 0x0370A0 1A:B090: F0        .byte $F0
- D 1 - I - 0x0370A1 1A:B091: F0        .byte $F0
- D 1 - I - 0x0370A2 1A:B092: 04        .byte $04
- D 1 - I - 0x0370A3 1A:B093: F0        .byte $F0
- D 1 - I - 0x0370A4 1A:B094: 07        .byte $07
- D 1 - I - 0x0370A5 1A:B095: F0        .byte $F0
- D 1 - I - 0x0370A6 1A:B096: F0        .byte $F0
- D 1 - I - 0x0370A7 1A:B097: F0        .byte $F0
- D 1 - I - 0x0370A8 1A:B098: F0        .byte $F0
- D 1 - I - 0x0370A9 1A:B099: F0        .byte $F0
- D 1 - I - 0x0370AA 1A:B09A: 1D        .byte $1D
- D 1 - I - 0x0370AB 1A:B09B: F0        .byte $F0
- D 1 - I - 0x0370AC 1A:B09C: 1E        .byte $1E
- D 1 - I - 0x0370AD 1A:B09D: F0        .byte $F0
- D 1 - I - 0x0370AE 1A:B09E: 12        .byte $12
- D 1 - I - 0x0370AF 1A:B09F: 68        .byte $68
- D 1 - I - 0x0370B0 1A:B0A0: 44        .byte $44
- D 1 - I - 0x0370B1 1A:B0A1: F0        .byte $F0
- D 1 - I - 0x0370B2 1A:B0A2: F0        .byte $F0
- D 1 - I - 0x0370B3 1A:B0A3: 3F        .byte $3F
- D 1 - I - 0x0370B4 1A:B0A4: 63        .byte $63
- D 1 - I - 0x0370B5 1A:B0A5: 10        .byte $10
- D 1 - I - 0x0370B6 1A:B0A6: 03        .byte $03
- D 1 - I - 0x0370B7 1A:B0A7: 13        .byte $13
- D 1 - I - 0x0370B8 1A:B0A8: 08        .byte $08
- D 1 - I - 0x0370B9 1A:B0A9: F0        .byte $F0
- D 1 - I - 0x0370BA 1A:B0AA: F0        .byte $F0
- D 1 - I - 0x0370BB 1A:B0AB: F0        .byte $F0
- D 1 - I - 0x0370BC 1A:B0AC: 05        .byte $05
- D 1 - I - 0x0370BD 1A:B0AD: F0        .byte $F0
- D 1 - I - 0x0370BE 1A:B0AE: 28        .byte $28
- D 1 - I - 0x0370BF 1A:B0AF: F0        .byte $F0
- D 1 - I - 0x0370C0 1A:B0B0: 2B        .byte $2B
- D 1 - I - 0x0370C1 1A:B0B1: F0        .byte $F0
- D 1 - I - 0x0370C2 1A:B0B2: 1E        .byte $1E
- D 1 - I - 0x0370C3 1A:B0B3: F0        .byte $F0
- D 1 - I - 0x0370C4 1A:B0B4: 69        .byte $69
- D 1 - I - 0x0370C5 1A:B0B5: F0        .byte $F0
- D 1 - I - 0x0370C6 1A:B0B6: F0        .byte $F0
- D 1 - I - 0x0370C7 1A:B0B7: F0        .byte $F0
- D 1 - I - 0x0370C8 1A:B0B8: 62        .byte $62
- D 1 - I - 0x0370C9 1A:B0B9: 55        .byte $55
- D 1 - I - 0x0370CA 1A:B0BA: 1B        .byte $1B
- D 1 - I - 0x0370CB 1A:B0BB: 20        .byte $20
- D 1 - I - 0x0370CC 1A:B0BC: 56        .byte $56
- D 1 - I - 0x0370CD 1A:B0BD: F0        .byte $F0
- D 1 - I - 0x0370CE 1A:B0BE: 35        .byte $35
- D 1 - I - 0x0370CF 1A:B0BF: 1D        .byte $1D
- D 1 - I - 0x0370D0 1A:B0C0: 12        .byte $12
- D 1 - I - 0x0370D1 1A:B0C1: F0        .byte $F0
- D 1 - I - 0x0370D2 1A:B0C2: 63        .byte $63
- D 1 - I - 0x0370D3 1A:B0C3: F0        .byte $F0
- D 1 - I - 0x0370D4 1A:B0C4: 68        .byte $68
- D 1 - I - 0x0370D5 1A:B0C5: 36        .byte $36
- D 1 - I - 0x0370D6 1A:B0C6: 4F        .byte $4F
- D 1 - I - 0x0370D7 1A:B0C7: F0        .byte $F0
- D 1 - I - 0x0370D8 1A:B0C8: F0        .byte $F0
- D 1 - I - 0x0370D9 1A:B0C9: F0        .byte $F0
- D 1 - I - 0x0370DA 1A:B0CA: 59        .byte $59
- D 1 - I - 0x0370DB 1A:B0CB: F0        .byte $F0
- D 1 - I - 0x0370DC 1A:B0CC: F0        .byte $F0
- D 1 - I - 0x0370DD 1A:B0CD: 57        .byte $57
- D 1 - I - 0x0370DE 1A:B0CE: 85        .byte $85
- D 1 - I - 0x0370DF 1A:B0CF: 50        .byte $50
- D 1 - I - 0x0370E0 1A:B0D0: 82        .byte $82
- D 1 - I - 0x0370E1 1A:B0D1: 40        .byte $40
- D 1 - I - 0x0370E2 1A:B0D2: 59        .byte $59
- D 1 - I - 0x0370E3 1A:B0D3: 2A        .byte $2A
- D 1 - I - 0x0370E4 1A:B0D4: 36        .byte $36
- D 1 - I - 0x0370E5 1A:B0D5: F0        .byte $F0
- D 1 - I - 0x0370E6 1A:B0D6: 9E        .byte $9E
- D 1 - I - 0x0370E7 1A:B0D7: F0        .byte $F0
- D 1 - I - 0x0370E8 1A:B0D8: A5        .byte $A5
- D 1 - I - 0x0370E9 1A:B0D9: F0        .byte $F0
- D 1 - I - 0x0370EA 1A:B0DA: 73        .byte $73
- D 1 - I - 0x0370EB 1A:B0DB: F0        .byte $F0
- D 1 - I - 0x0370EC 1A:B0DC: F0        .byte $F0
- D 1 - I - 0x0370ED 1A:B0DD: F0        .byte $F0
- D 1 - I - 0x0370EE 1A:B0DE: 70        .byte $70
- D 1 - I - 0x0370EF 1A:B0DF: F0        .byte $F0
- D 1 - I - 0x0370F0 1A:B0E0: F0        .byte $F0
- D 1 - I - 0x0370F1 1A:B0E1: 91        .byte $91
- D 1 - I - 0x0370F2 1A:B0E2: 6E        .byte $6E
- D 1 - I - 0x0370F3 1A:B0E3: 74        .byte $74
- D 1 - I - 0x0370F4 1A:B0E4: 9A        .byte $9A
- D 1 - I - 0x0370F5 1A:B0E5: 70        .byte $70
- D 1 - I - 0x0370F6 1A:B0E6: 89        .byte $89
- D 1 - I - 0x0370F7 1A:B0E7: 66        .byte $66
- D 1 - I - 0x0370F8 1A:B0E8: 5B        .byte $5B
- D 1 - I - 0x0370F9 1A:B0E9: F0        .byte $F0
- D 1 - I - 0x0370FA 1A:B0EA: C2        .byte $C2
- D 1 - I - 0x0370FB 1A:B0EB: F0        .byte $F0
- D 1 - I - 0x0370FC 1A:B0EC: C9        .byte $C9
- D 1 - I - 0x0370FD 1A:B0ED: F0        .byte $F0
- D 1 - I - 0x0370FE 1A:B0EE: A3        .byte $A3
- D 1 - I - 0x0370FF 1A:B0EF: F0        .byte $F0
- D 1 - I - 0x037100 1A:B0F0: F0        .byte $F0
- D 1 - I - 0x037101 1A:B0F1: F0        .byte $F0
- D 1 - I - 0x037102 1A:B0F2: A0        .byte $A0
- D 1 - I - 0x037103 1A:B0F3: F0        .byte $F0
- D 1 - I - 0x037104 1A:B0F4: F0        .byte $F0
- D 1 - I - 0x037105 1A:B0F5: 04        .byte $04
- D 1 - I - 0x037106 1A:B0F6: 04        .byte $04
- D 1 - I - 0x037107 1A:B0F7: F0        .byte $F0
- D 1 - I - 0x037108 1A:B0F8: F0        .byte $F0
- D 1 - I - 0x037109 1A:B0F9: 07        .byte $07
- D 1 - I - 0x03710A 1A:B0FA: 07        .byte $07
- D 1 - I - 0x03710B 1A:B0FB: F0        .byte $F0
- D 1 - I - 0x03710C 1A:B0FC: F0        .byte $F0
- D 1 - I - 0x03710D 1A:B0FD: 10        .byte $10
- D 1 - I - 0x03710E 1A:B0FE: 10        .byte $10
- D 1 - I - 0x03710F 1A:B0FF: F0        .byte $F0
- D 1 - I - 0x037110 1A:B100: 1F        .byte $1F
- D 1 - I - 0x037111 1A:B101: 12        .byte $12
- D 1 - I - 0x037112 1A:B102: 12        .byte $12
- D 1 - I - 0x037113 1A:B103: F0        .byte $F0
- D 1 - I - 0x037114 1A:B104: F0        .byte $F0
- D 1 - I - 0x037115 1A:B105: 1D        .byte $1D
- D 1 - I - 0x037116 1A:B106: 1D        .byte $1D
- D 1 - I - 0x037117 1A:B107: 34        .byte $34
- D 1 - I - 0x037118 1A:B108: 63        .byte $63
- D 1 - I - 0x037119 1A:B109: 06        .byte $06
- D 1 - I - 0x03711A 1A:B10A: 06        .byte $06
- D 1 - I - 0x03711B 1A:B10B: F0        .byte $F0
- D 1 - I - 0x03711C 1A:B10C: F0        .byte $F0
- D 1 - I - 0x03711D 1A:B10D: 07        .byte $07
- D 1 - I - 0x03711E 1A:B10E: 1F        .byte $1F
- D 1 - I - 0x03711F 1A:B10F: F0        .byte $F0
- D 1 - I - 0x037120 1A:B110: 14        .byte $14
- D 1 - I - 0x037121 1A:B111: 1D        .byte $1D
- D 1 - I - 0x037122 1A:B112: 1D        .byte $1D
- D 1 - I - 0x037123 1A:B113: F0        .byte $F0
- D 1 - I - 0x037124 1A:B114: F0        .byte $F0
- D 1 - I - 0x037125 1A:B115: F0        .byte $F0
- D 1 - I - 0x037126 1A:B116: 38        .byte $38
- D 1 - I - 0x037127 1A:B117: F0        .byte $F0
- D 1 - I - 0x037128 1A:B118: F0        .byte $F0
- D 1 - I - 0x037129 1A:B119: F0        .byte $F0
- D 1 - I - 0x03712A 1A:B11A: 2A        .byte $2A
- D 1 - I - 0x03712B 1A:B11B: 4B        .byte $4B
- D 1 - I - 0x03712C 1A:B11C: 7D        .byte $7D
- D 1 - I - 0x03712D 1A:B11D: 4D        .byte $4D
- D 1 - I - 0x03712E 1A:B11E: 1E        .byte $1E
- D 1 - I - 0x03712F 1A:B11F: F0        .byte $F0
- D 1 - I - 0x037130 1A:B120: 47        .byte $47
- D 1 - I - 0x037131 1A:B121: 36        .byte $36
- D 1 - I - 0x037132 1A:B122: 37        .byte $37
- D 1 - I - 0x037133 1A:B123: 20        .byte $20
- D 1 - I - 0x037134 1A:B124: 2E        .byte $2E
- D 1 - I - 0x037135 1A:B125: F0        .byte $F0
- D 1 - I - 0x037136 1A:B126: 4F        .byte $4F
- D 1 - I - 0x037137 1A:B127: F0        .byte $F0
- D 1 - I - 0x037138 1A:B128: 45        .byte $45
- D 1 - I - 0x037139 1A:B129: F0        .byte $F0
- D 1 - I - 0x03713A 1A:B12A: F0        .byte $F0
- D 1 - I - 0x03713B 1A:B12B: F0        .byte $F0
- D 1 - I - 0x03713C 1A:B12C: F0        .byte $F0
- D 1 - I - 0x03713D 1A:B12D: F0        .byte $F0
- D 1 - I - 0x03713E 1A:B12E: 5C        .byte $5C
- D 1 - I - 0x03713F 1A:B12F: 4A        .byte $4A
- D 1 - I - 0x037140 1A:B130: 93        .byte $93
- D 1 - I - 0x037141 1A:B131: 35        .byte $35
- D 1 - I - 0x037142 1A:B132: 71        .byte $71
- D 1 - I - 0x037143 1A:B133: 5D        .byte $5D
- D 1 - I - 0x037144 1A:B134: 8F        .byte $8F
- D 1 - I - 0x037145 1A:B135: 4E        .byte $4E
- D 1 - I - 0x037146 1A:B136: 43        .byte $43
- D 1 - I - 0x037147 1A:B137: 2B        .byte $2B
- D 1 - I - 0x037148 1A:B138: 45        .byte $45
- D 1 - I - 0x037149 1A:B139: 7E        .byte $7E
- D 1 - I - 0x03714A 1A:B13A: 67        .byte $67
- D 1 - I - 0x03714B 1A:B13B: F0        .byte $F0
- D 1 - I - 0x03714C 1A:B13C: F0        .byte $F0
- D 1 - I - 0x03714D 1A:B13D: F0        .byte $F0
- D 1 - I - 0x03714E 1A:B13E: 6A        .byte $6A
- D 1 - I - 0x03714F 1A:B13F: F0        .byte $F0
- D 1 - I - 0x037150 1A:B140: F0        .byte $F0
- D 1 - I - 0x037151 1A:B141: F0        .byte $F0
- D 1 - I - 0x037152 1A:B142: 8C        .byte $8C
- D 1 - I - 0x037153 1A:B143: 7B        .byte $7B
- D 1 - I - 0x037154 1A:B144: C4        .byte $C4
- D 1 - I - 0x037155 1A:B145: A0        .byte $A0
- D 1 - I - 0x037156 1A:B146: 65        .byte $65
- D 1 - I - 0x037157 1A:B147: 75        .byte $75
- D 1 - I - 0x037158 1A:B148: 8F        .byte $8F
- D 1 - I - 0x037159 1A:B149: 73        .byte $73
- D 1 - I - 0x03715A 1A:B14A: 8B        .byte $8B
- D 1 - I - 0x03715B 1A:B14B: 4E        .byte $4E
- D 1 - I - 0x03715C 1A:B14C: 5C        .byte $5C
- D 1 - I - 0x03715D 1A:B14D: 96        .byte $96
- D 1 - I - 0x03715E 1A:B14E: AE        .byte $AE
- D 1 - I - 0x03715F 1A:B14F: F0        .byte $F0
- D 1 - I - 0x037160 1A:B150: 9A        .byte $9A
- D 1 - I - 0x037161 1A:B151: F0        .byte $F0
- D 1 - I - 0x037162 1A:B152: F0        .byte $F0
- D 1 - I - 0x037163 1A:B153: F0        .byte $F0
- D 1 - I - 0x037164 1A:B154: F0        .byte $F0
- D 1 - I - 0x037165 1A:B155: F0        .byte $F0
- D 1 - I - 0x037166 1A:B156: BC        .byte $BC
- D 1 - I - 0x037167 1A:B157: F0        .byte $F0
- D 1 - I - 0x037168 1A:B158: D3        .byte $D3



off_B159_05:
- D 1 - I - 0x037169 1A:B159: F0        .byte $F0
- D 1 - I - 0x03716A 1A:B15A: F0        .byte $F0
- D 1 - I - 0x03716B 1A:B15B: 07        .byte $07
- D 1 - I - 0x03716C 1A:B15C: 07        .byte $07
- D 1 - I - 0x03716D 1A:B15D: 04        .byte $04
- D 1 - I - 0x03716E 1A:B15E: 04        .byte $04
- D 1 - I - 0x03716F 1A:B15F: F0        .byte $F0
- D 1 - I - 0x037170 1A:B160: F0        .byte $F0
- D 1 - I - 0x037171 1A:B161: F0        .byte $F0
- D 1 - I - 0x037172 1A:B162: 1C        .byte $1C
- D 1 - I - 0x037173 1A:B163: 13        .byte $13
- D 1 - I - 0x037174 1A:B164: 13        .byte $13
- D 1 - I - 0x037175 1A:B165: 1E        .byte $1E
- D 1 - I - 0x037176 1A:B166: 1E        .byte $1E
- D 1 - I - 0x037177 1A:B167: 5B        .byte $5B
- D 1 - I - 0x037178 1A:B168: 7F        .byte $7F
- D 1 - I - 0x037179 1A:B169: 11        .byte $11
- D 1 - I - 0x03717A 1A:B16A: 11        .byte $11
- D 1 - I - 0x03717B 1A:B16B: 57        .byte $57
- D 1 - I - 0x03717C 1A:B16C: 7B        .byte $7B
- D 1 - I - 0x03717D 1A:B16D: F0        .byte $F0
- D 1 - I - 0x03717E 1A:B16E: 24        .byte $24
- D 1 - I - 0x03717F 1A:B16F: 05        .byte $05
- D 1 - I - 0x037180 1A:B170: 05        .byte $05
- D 1 - I - 0x037181 1A:B171: 04        .byte $04
- D 1 - I - 0x037182 1A:B172: 04        .byte $04
- D 1 - I - 0x037183 1A:B173: 1B        .byte $1B
- D 1 - I - 0x037184 1A:B174: 0F        .byte $0F
- D 1 - I - 0x037185 1A:B175: F0        .byte $F0
- D 1 - I - 0x037186 1A:B176: F0        .byte $F0
- D 1 - I - 0x037187 1A:B177: 1F        .byte $1F
- D 1 - I - 0x037188 1A:B178: 36        .byte $36
- D 1 - I - 0x037189 1A:B179: 1C        .byte $1C
- D 1 - I - 0x03718A 1A:B17A: 29        .byte $29
- D 1 - I - 0x03718B 1A:B17B: 7C        .byte $7C
- D 1 - I - 0x03718C 1A:B17C: 7F        .byte $7F
- D 1 - I - 0x03718D 1A:B17D: 26        .byte $26
- D 1 - I - 0x03718E 1A:B17E: 34        .byte $34
- D 1 - I - 0x03718F 1A:B17F: F0        .byte $F0
- D 1 - I - 0x037190 1A:B180: F0        .byte $F0
- D 1 - I - 0x037191 1A:B181: 19        .byte $19
- D 1 - I - 0x037192 1A:B182: 3C        .byte $3C
- D 1 - I - 0x037193 1A:B183: 13        .byte $13
- D 1 - I - 0x037194 1A:B184: 39        .byte $39
- D 1 - I - 0x037195 1A:B185: 33        .byte $33
- D 1 - I - 0x037196 1A:B186: 1C        .byte $1C
- D 1 - I - 0x037197 1A:B187: 0F        .byte $0F
- D 1 - I - 0x037198 1A:B188: 11        .byte $11
- D 1 - I - 0x037199 1A:B189: F0        .byte $F0
- D 1 - I - 0x03719A 1A:B18A: F0        .byte $F0
- D 1 - I - 0x03719B 1A:B18B: 43        .byte $43
- D 1 - I - 0x03719C 1A:B18C: 69        .byte $69
- D 1 - I - 0x03719D 1A:B18D: 1D        .byte $1D
- D 1 - I - 0x03719E 1A:B18E: 36        .byte $36
- D 1 - I - 0x03719F 1A:B18F: 7E        .byte $7E
- D 1 - I - 0x0371A0 1A:B190: A2        .byte $A2
- D 1 - I - 0x0371A1 1A:B191: 3E        .byte $3E
- D 1 - I - 0x0371A2 1A:B192: 4C        .byte $4C
- D 1 - I - 0x0371A3 1A:B193: F0        .byte $F0
- D 1 - I - 0x0371A4 1A:B194: 9D        .byte $9D
- D 1 - I - 0x0371A5 1A:B195: 30        .byte $30
- D 1 - I - 0x0371A6 1A:B196: 49        .byte $49
- D 1 - I - 0x0371A7 1A:B197: 51        .byte $51
- D 1 - I - 0x0371A8 1A:B198: 37        .byte $37
- D 1 - I - 0x0371A9 1A:B199: 57        .byte $57
- D 1 - I - 0x0371AA 1A:B19A: 35        .byte $35
- D 1 - I - 0x0371AB 1A:B19B: 32        .byte $32
- D 1 - I - 0x0371AC 1A:B19C: 1C        .byte $1C
- D 1 - I - 0x0371AD 1A:B19D: 6C        .byte $6C
- D 1 - I - 0x0371AE 1A:B19E: 6E        .byte $6E
- D 1 - I - 0x0371AF 1A:B19F: 73        .byte $73
- D 1 - I - 0x0371B0 1A:B1A0: A5        .byte $A5
- D 1 - I - 0x0371B1 1A:B1A1: 59        .byte $59
- D 1 - I - 0x0371B2 1A:B1A2: 7E        .byte $7E
- D 1 - I - 0x0371B3 1A:B1A3: B8        .byte $B8
- D 1 - I - 0x0371B4 1A:B1A4: C7        .byte $C7
- D 1 - I - 0x0371B5 1A:B1A5: F0        .byte $F0
- D 1 - I - 0x0371B6 1A:B1A6: 70        .byte $70
- D 1 - I - 0x0371B7 1A:B1A7: F0        .byte $F0
- D 1 - I - 0x0371B8 1A:B1A8: F0        .byte $F0
- D 1 - I - 0x0371B9 1A:B1A9: 6C        .byte $6C
- D 1 - I - 0x0371BA 1A:B1AA: 55        .byte $55
- D 1 - I - 0x0371BB 1A:B1AB: 5D        .byte $5D
- D 1 - I - 0x0371BC 1A:B1AC: 82        .byte $82
- D 1 - I - 0x0371BD 1A:B1AD: 6F        .byte $6F
- D 1 - I - 0x0371BE 1A:B1AE: 65        .byte $65
- D 1 - I - 0x0371BF 1A:B1AF: 4C        .byte $4C
- D 1 - I - 0x0371C0 1A:B1B0: 4E        .byte $4E
- D 1 - I - 0x0371C1 1A:B1B1: F0        .byte $F0
- D 1 - I - 0x0371C2 1A:B1B2: 84        .byte $84
- D 1 - I - 0x0371C3 1A:B1B3: 97        .byte $97
- D 1 - I - 0x0371C4 1A:B1B4: BD        .byte $BD
- D 1 - I - 0x0371C5 1A:B1B5: 93        .byte $93
- D 1 - I - 0x0371C6 1A:B1B6: 7D        .byte $7D
- D 1 - I - 0x0371C7 1A:B1B7: F0        .byte $F0
- D 1 - I - 0x0371C8 1A:B1B8: EA        .byte $EA
- D 1 - I - 0x0371C9 1A:B1B9: 7A        .byte $7A
- D 1 - I - 0x0371CA 1A:B1BA: AA        .byte $AA
- D 1 - I - 0x0371CB 1A:B1BB: F0        .byte $F0
- D 1 - I - 0x0371CC 1A:B1BC: F0        .byte $F0
- D 1 - I - 0x0371CD 1A:B1BD: F0        .byte $F0
- D 1 - I - 0x0371CE 1A:B1BE: 04        .byte $04
- D 1 - I - 0x0371CF 1A:B1BF: F0        .byte $F0
- D 1 - I - 0x0371D0 1A:B1C0: F0        .byte $F0
- D 1 - I - 0x0371D1 1A:B1C1: F0        .byte $F0
- D 1 - I - 0x0371D2 1A:B1C2: 12        .byte $12
- D 1 - I - 0x0371D3 1A:B1C3: F0        .byte $F0
- D 1 - I - 0x0371D4 1A:B1C4: F0        .byte $F0
- D 1 - I - 0x0371D5 1A:B1C5: F0        .byte $F0
- D 1 - I - 0x0371D6 1A:B1C6: 1D        .byte $1D
- D 1 - I - 0x0371D7 1A:B1C7: F0        .byte $F0
- D 1 - I - 0x0371D8 1A:B1C8: 07        .byte $07
- D 1 - I - 0x0371D9 1A:B1C9: F0        .byte $F0
- D 1 - I - 0x0371DA 1A:B1CA: 1E        .byte $1E
- D 1 - I - 0x0371DB 1A:B1CB: 73        .byte $73
- D 1 - I - 0x0371DC 1A:B1CC: 5D        .byte $5D
- D 1 - I - 0x0371DD 1A:B1CD: F0        .byte $F0
- D 1 - I - 0x0371DE 1A:B1CE: F0        .byte $F0
- D 1 - I - 0x0371DF 1A:B1CF: 56        .byte $56
- D 1 - I - 0x0371E0 1A:B1D0: 70        .byte $70
- D 1 - I - 0x0371E1 1A:B1D1: 03        .byte $03
- D 1 - I - 0x0371E2 1A:B1D2: 10        .byte $10
- D 1 - I - 0x0371E3 1A:B1D3: 13        .byte $13
- D 1 - I - 0x0371E4 1A:B1D4: 08        .byte $08
- D 1 - I - 0x0371E5 1A:B1D5: F0        .byte $F0
- D 1 - I - 0x0371E6 1A:B1D6: 1E        .byte $1E
- D 1 - I - 0x0371E7 1A:B1D7: 05        .byte $05
- D 1 - I - 0x0371E8 1A:B1D8: 05        .byte $05
- D 1 - I - 0x0371E9 1A:B1D9: F0        .byte $F0
- D 1 - I - 0x0371EA 1A:B1DA: 28        .byte $28
- D 1 - I - 0x0371EB 1A:B1DB: F0        .byte $F0
- D 1 - I - 0x0371EC 1A:B1DC: 44        .byte $44
- D 1 - I - 0x0371ED 1A:B1DD: F0        .byte $F0
- D 1 - I - 0x0371EE 1A:B1DE: 2B        .byte $2B
- D 1 - I - 0x0371EF 1A:B1DF: 73        .byte $73
- D 1 - I - 0x0371F0 1A:B1E0: 69        .byte $69
- D 1 - I - 0x0371F1 1A:B1E1: F0        .byte $F0
- D 1 - I - 0x0371F2 1A:B1E2: F0        .byte $F0
- D 1 - I - 0x0371F3 1A:B1E3: 56        .byte $56
- D 1 - I - 0x0371F4 1A:B1E4: 6F        .byte $6F
- D 1 - I - 0x0371F5 1A:B1E5: 55        .byte $55
- D 1 - I - 0x0371F6 1A:B1E6: 0F        .byte $0F
- D 1 - I - 0x0371F7 1A:B1E7: 14        .byte $14
- D 1 - I - 0x0371F8 1A:B1E8: 5E        .byte $5E
- D 1 - I - 0x0371F9 1A:B1E9: 1D        .byte $1D
- D 1 - I - 0x0371FA 1A:B1EA: 35        .byte $35
- D 1 - I - 0x0371FB 1A:B1EB: 05        .byte $05
- D 1 - I - 0x0371FC 1A:B1EC: 12        .byte $12
- D 1 - I - 0x0371FD 1A:B1ED: 26        .byte $26
- D 1 - I - 0x0371FE 1A:B1EE: 62        .byte $62
- D 1 - I - 0x0371FF 1A:B1EF: 39        .byte $39
- D 1 - I - 0x037200 1A:B1F0: 69        .byte $69
- D 1 - I - 0x037201 1A:B1F1: 59        .byte $59
- D 1 - I - 0x037202 1A:B1F2: 2B        .byte $2B
- D 1 - I - 0x037203 1A:B1F3: F0        .byte $F0
- D 1 - I - 0x037204 1A:B1F4: F0        .byte $F0
- D 1 - I - 0x037205 1A:B1F5: F0        .byte $F0
- D 1 - I - 0x037206 1A:B1F6: 4B        .byte $4B
- D 1 - I - 0x037207 1A:B1F7: F0        .byte $F0
- D 1 - I - 0x037208 1A:B1F8: F0        .byte $F0
- D 1 - I - 0x037209 1A:B1F9: 31        .byte $31
- D 1 - I - 0x03720A 1A:B1FA: 61        .byte $61
- D 1 - I - 0x03720B 1A:B1FB: 3A        .byte $3A
- D 1 - I - 0x03720C 1A:B1FC: 6A        .byte $6A
- D 1 - I - 0x03720D 1A:B1FD: 3F        .byte $3F
- D 1 - I - 0x03720E 1A:B1FE: 44        .byte $44
- D 1 - I - 0x03720F 1A:B1FF: 28        .byte $28
- D 1 - I - 0x037210 1A:B200: 2B        .byte $2B
- D 1 - I - 0x037211 1A:B201: 90        .byte $90
- D 1 - I - 0x037212 1A:B202: 57        .byte $57
- D 1 - I - 0x037213 1A:B203: 4F        .byte $4F
- D 1 - I - 0x037214 1A:B204: 9B        .byte $9B
- D 1 - I - 0x037215 1A:B205: 59        .byte $59
- D 1 - I - 0x037216 1A:B206: 68        .byte $68
- D 1 - I - 0x037217 1A:B207: F0        .byte $F0
- D 1 - I - 0x037218 1A:B208: F0        .byte $F0
- D 1 - I - 0x037219 1A:B209: 7B        .byte $7B
- D 1 - I - 0x03721A 1A:B20A: 72        .byte $72
- D 1 - I - 0x03721B 1A:B20B: F0        .byte $F0
- D 1 - I - 0x03721C 1A:B20C: 9F        .byte $9F
- D 1 - I - 0x03721D 1A:B20D: 79        .byte $79
- D 1 - I - 0x03721E 1A:B20E: 56        .byte $56
- D 1 - I - 0x03721F 1A:B20F: 82        .byte $82
- D 1 - I - 0x037220 1A:B210: 5D        .byte $5D
- D 1 - I - 0x037221 1A:B211: 67        .byte $67
- D 1 - I - 0x037222 1A:B212: 70        .byte $70
- D 1 - I - 0x037223 1A:B213: 4D        .byte $4D
- D 1 - I - 0x037224 1A:B214: 42        .byte $42
- D 1 - I - 0x037225 1A:B215: 92        .byte $92
- D 1 - I - 0x037226 1A:B216: B5        .byte $B5
- D 1 - I - 0x037227 1A:B217: 99        .byte $99
- D 1 - I - 0x037228 1A:B218: BE        .byte $BE
- D 1 - I - 0x037229 1A:B219: B0        .byte $B0
- D 1 - I - 0x03722A 1A:B21A: 8B        .byte $8B
- D 1 - I - 0x03722B 1A:B21B: F0        .byte $F0
- D 1 - I - 0x03722C 1A:B21C: F0        .byte $F0
- D 1 - I - 0x03722D 1A:B21D: 88        .byte $88
- D 1 - I - 0x03722E 1A:B21E: A0        .byte $A0
- D 1 - I - 0x03722F 1A:B21F: F0        .byte $F0
- D 1 - I - 0x037230 1A:B220: F0        .byte $F0
- D 1 - I - 0x037231 1A:B221: 04        .byte $04
- D 1 - I - 0x037232 1A:B222: 04        .byte $04
- D 1 - I - 0x037233 1A:B223: F0        .byte $F0
- D 1 - I - 0x037234 1A:B224: F0        .byte $F0
- D 1 - I - 0x037235 1A:B225: 07        .byte $07
- D 1 - I - 0x037236 1A:B226: 07        .byte $07
- D 1 - I - 0x037237 1A:B227: F0        .byte $F0
- D 1 - I - 0x037238 1A:B228: F0        .byte $F0
- D 1 - I - 0x037239 1A:B229: 10        .byte $10
- D 1 - I - 0x03723A 1A:B22A: 10        .byte $10
- D 1 - I - 0x03723B 1A:B22B: F0        .byte $F0
- D 1 - I - 0x03723C 1A:B22C: 1F        .byte $1F
- D 1 - I - 0x03723D 1A:B22D: 12        .byte $12
- D 1 - I - 0x03723E 1A:B22E: 12        .byte $12
- D 1 - I - 0x03723F 1A:B22F: 5B        .byte $5B
- D 1 - I - 0x037240 1A:B230: 7E        .byte $7E
- D 1 - I - 0x037241 1A:B231: 1D        .byte $1D
- D 1 - I - 0x037242 1A:B232: 1D        .byte $1D
- D 1 - I - 0x037243 1A:B233: 64        .byte $64
- D 1 - I - 0x037244 1A:B234: 7C        .byte $7C
- D 1 - I - 0x037245 1A:B235: 06        .byte $06
- D 1 - I - 0x037246 1A:B236: 06        .byte $06
- D 1 - I - 0x037247 1A:B237: F0        .byte $F0
- D 1 - I - 0x037248 1A:B238: 2F        .byte $2F
- D 1 - I - 0x037249 1A:B239: 07        .byte $07
- D 1 - I - 0x03724A 1A:B23A: 07        .byte $07
- D 1 - I - 0x03724B 1A:B23B: 14        .byte $14
- D 1 - I - 0x03724C 1A:B23C: 20        .byte $20
- D 1 - I - 0x03724D 1A:B23D: 1C        .byte $1C
- D 1 - I - 0x03724E 1A:B23E: 34        .byte $34
- D 1 - I - 0x03724F 1A:B23F: F0        .byte $F0
- D 1 - I - 0x037250 1A:B240: F0        .byte $F0
- D 1 - I - 0x037251 1A:B241: 37        .byte $37
- D 1 - I - 0x037252 1A:B242: 39        .byte $39
- D 1 - I - 0x037253 1A:B243: F0        .byte $F0
- D 1 - I - 0x037254 1A:B244: F0        .byte $F0
- D 1 - I - 0x037255 1A:B245: 2A        .byte $2A
- D 1 - I - 0x037256 1A:B246: 1F        .byte $1F
- D 1 - I - 0x037257 1A:B247: 7C        .byte $7C
- D 1 - I - 0x037258 1A:B248: 7F        .byte $7F
- D 1 - I - 0x037259 1A:B249: 32        .byte $32
- D 1 - I - 0x03725A 1A:B24A: 10        .byte $10
- D 1 - I - 0x03725B 1A:B24B: 22        .byte $22
- D 1 - I - 0x03725C 1A:B24C: 47        .byte $47
- D 1 - I - 0x03725D 1A:B24D: 1F        .byte $1F
- D 1 - I - 0x03725E 1A:B24E: 37        .byte $37
- D 1 - I - 0x03725F 1A:B24F: 14        .byte $14
- D 1 - I - 0x037260 1A:B250: 12        .byte $12
- D 1 - I - 0x037261 1A:B251: 62        .byte $62
- D 1 - I - 0x037262 1A:B252: 40        .byte $40
- D 1 - I - 0x037263 1A:B253: F0        .byte $F0
- D 1 - I - 0x037264 1A:B254: F0        .byte $F0
- D 1 - I - 0x037265 1A:B255: 4F        .byte $4F
- D 1 - I - 0x037266 1A:B256: 45        .byte $45
- D 1 - I - 0x037267 1A:B257: 7D        .byte $7D
- D 1 - I - 0x037268 1A:B258: A1        .byte $A1
- D 1 - I - 0x037269 1A:B259: 1E        .byte $1E
- D 1 - I - 0x03726A 1A:B25A: 59        .byte $59
- D 1 - I - 0x03726B 1A:B25B: F0        .byte $F0
- D 1 - I - 0x03726C 1A:B25C: A6        .byte $A6
- D 1 - I - 0x03726D 1A:B25D: 4A        .byte $4A
- D 1 - I - 0x03726E 1A:B25E: 34        .byte $34
- D 1 - I - 0x03726F 1A:B25F: 3B        .byte $3B
- D 1 - I - 0x037270 1A:B260: 3B        .byte $3B
- D 1 - I - 0x037271 1A:B261: 36        .byte $36
- D 1 - I - 0x037272 1A:B262: 5B        .byte $5B
- D 1 - I - 0x037273 1A:B263: 39        .byte $39
- D 1 - I - 0x037274 1A:B264: 1F        .byte $1F
- D 1 - I - 0x037275 1A:B265: 9E        .byte $9E
- D 1 - I - 0x037276 1A:B266: 70        .byte $70
- D 1 - I - 0x037277 1A:B267: 5D        .byte $5D
- D 1 - I - 0x037278 1A:B268: 8F        .byte $8F
- D 1 - I - 0x037279 1A:B269: F0        .byte $F0
- D 1 - I - 0x03727A 1A:B26A: 74        .byte $74
- D 1 - I - 0x03727B 1A:B26B: F0        .byte $F0
- D 1 - I - 0x03727C 1A:B26C: F0        .byte $F0
- D 1 - I - 0x03727D 1A:B26D: 4E        .byte $4E
- D 1 - I - 0x03727E 1A:B26E: 7D        .byte $7D
- D 1 - I - 0x03727F 1A:B26F: BB        .byte $BB
- D 1 - I - 0x037280 1A:B270: C5        .byte $C5
- D 1 - I - 0x037281 1A:B271: 79        .byte $79
- D 1 - I - 0x037282 1A:B272: 56        .byte $56
- D 1 - I - 0x037283 1A:B273: 5E        .byte $5E
- D 1 - I - 0x037284 1A:B274: 77        .byte $77
- D 1 - I - 0x037285 1A:B275: 66        .byte $66
- D 1 - I - 0x037286 1A:B276: 74        .byte $74
- D 1 - I - 0x037287 1A:B277: 4D        .byte $4D
- D 1 - I - 0x037288 1A:B278: 4F        .byte $4F
- D 1 - I - 0x037289 1A:B279: B6        .byte $B6
- D 1 - I - 0x03728A 1A:B27A: 94        .byte $94
- D 1 - I - 0x03728B 1A:B27B: F0        .byte $F0
- D 1 - I - 0x03728C 1A:B27C: 8F        .byte $8F
- D 1 - I - 0x03728D 1A:B27D: 81        .byte $81
- D 1 - I - 0x03728E 1A:B27E: B2        .byte $B2
- D 1 - I - 0x03728F 1A:B27F: F0        .byte $F0
- D 1 - I - 0x037290 1A:B280: F0        .byte $F0
- D 1 - I - 0x037291 1A:B281: 7D        .byte $7D
- D 1 - I - 0x037292 1A:B282: 98        .byte $98
- D 1 - I - 0x037293 1A:B283: F0        .byte $F0
- D 1 - I - 0x037294 1A:B284: E9        .byte $E9



off_B285_06:
- D 1 - I - 0x037295 1A:B285: F0        .byte $F0
- D 1 - I - 0x037296 1A:B286: F0        .byte $F0
- D 1 - I - 0x037297 1A:B287: 07        .byte $07
- D 1 - I - 0x037298 1A:B288: 07        .byte $07
- D 1 - I - 0x037299 1A:B289: 04        .byte $04
- D 1 - I - 0x03729A 1A:B28A: 04        .byte $04
- D 1 - I - 0x03729B 1A:B28B: F0        .byte $F0
- D 1 - I - 0x03729C 1A:B28C: 0F        .byte $0F
- D 1 - I - 0x03729D 1A:B28D: F0        .byte $F0
- D 1 - I - 0x03729E 1A:B28E: F0        .byte $F0
- D 1 - I - 0x03729F 1A:B28F: 1E        .byte $1E
- D 1 - I - 0x0372A0 1A:B290: 1E        .byte $1E
- D 1 - I - 0x0372A1 1A:B291: 11        .byte $11
- D 1 - I - 0x0372A2 1A:B292: 11        .byte $11
- D 1 - I - 0x0372A3 1A:B293: 75        .byte $75
- D 1 - I - 0x0372A4 1A:B294: 4E        .byte $4E
- D 1 - I - 0x0372A5 1A:B295: 1C        .byte $1C
- D 1 - I - 0x0372A6 1A:B296: 1C        .byte $1C
- D 1 - I - 0x0372A7 1A:B297: 3F        .byte $3F
- D 1 - I - 0x0372A8 1A:B298: 78        .byte $78
- D 1 - I - 0x0372A9 1A:B299: 0E        .byte $0E
- D 1 - I - 0x0372AA 1A:B29A: 24        .byte $24
- D 1 - I - 0x0372AB 1A:B29B: 06        .byte $06
- D 1 - I - 0x0372AC 1A:B29C: 06        .byte $06
- D 1 - I - 0x0372AD 1A:B29D: 1C        .byte $1C
- D 1 - I - 0x0372AE 1A:B29E: 04        .byte $04
- D 1 - I - 0x0372AF 1A:B29F: F0        .byte $F0
- D 1 - I - 0x0372B0 1A:B2A0: 26        .byte $26
- D 1 - I - 0x0372B1 1A:B2A1: F0        .byte $F0
- D 1 - I - 0x0372B2 1A:B2A2: F0        .byte $F0
- D 1 - I - 0x0372B3 1A:B2A3: 1F        .byte $1F
- D 1 - I - 0x0372B4 1A:B2A4: 36        .byte $36
- D 1 - I - 0x0372B5 1A:B2A5: 29        .byte $29
- D 1 - I - 0x0372B6 1A:B2A6: 29        .byte $29
- D 1 - I - 0x0372B7 1A:B2A7: 7A        .byte $7A
- D 1 - I - 0x0372B8 1A:B2A8: 75        .byte $75
- D 1 - I - 0x0372B9 1A:B2A9: 33        .byte $33
- D 1 - I - 0x0372BA 1A:B2AA: 66        .byte $66
- D 1 - I - 0x0372BB 1A:B2AB: F0        .byte $F0
- D 1 - I - 0x0372BC 1A:B2AC: F0        .byte $F0
- D 1 - I - 0x0372BD 1A:B2AD: 1A        .byte $1A
- D 1 - I - 0x0372BE 1A:B2AE: 3C        .byte $3C
- D 1 - I - 0x0372BF 1A:B2AF: 1F        .byte $1F
- D 1 - I - 0x0372C0 1A:B2B0: 3A        .byte $3A
- D 1 - I - 0x0372C1 1A:B2B1: 1C        .byte $1C
- D 1 - I - 0x0372C2 1A:B2B2: 11        .byte $11
- D 1 - I - 0x0372C3 1A:B2B3: 3E        .byte $3E
- D 1 - I - 0x0372C4 1A:B2B4: 58        .byte $58
- D 1 - I - 0x0372C5 1A:B2B5: F0        .byte $F0
- D 1 - I - 0x0372C6 1A:B2B6: F0        .byte $F0
- D 1 - I - 0x0372C7 1A:B2B7: 82        .byte $82
- D 1 - I - 0x0372C8 1A:B2B8: 69        .byte $69
- D 1 - I - 0x0372C9 1A:B2B9: 34        .byte $34
- D 1 - I - 0x0372CA 1A:B2BA: 36        .byte $36
- D 1 - I - 0x0372CB 1A:B2BB: 98        .byte $98
- D 1 - I - 0x0372CC 1A:B2BC: 98        .byte $98
- D 1 - I - 0x0372CD 1A:B2BD: 7D        .byte $7D
- D 1 - I - 0x0372CE 1A:B2BE: 66        .byte $66
- D 1 - I - 0x0372CF 1A:B2BF: F0        .byte $F0
- D 1 - I - 0x0372D0 1A:B2C0: 92        .byte $92
- D 1 - I - 0x0372D1 1A:B2C1: 6C        .byte $6C
- D 1 - I - 0x0372D2 1A:B2C2: 3E        .byte $3E
- D 1 - I - 0x0372D3 1A:B2C3: 37        .byte $37
- D 1 - I - 0x0372D4 1A:B2C4: 75        .byte $75
- D 1 - I - 0x0372D5 1A:B2C5: 34        .byte $34
- D 1 - I - 0x0372D6 1A:B2C6: 29        .byte $29
- D 1 - I - 0x0372D7 1A:B2C7: 57        .byte $57
- D 1 - I - 0x0372D8 1A:B2C8: 64        .byte $64
- D 1 - I - 0x0372D9 1A:B2C9: 90        .byte $90
- D 1 - I - 0x0372DA 1A:B2CA: 6E        .byte $6E
- D 1 - I - 0x0372DB 1A:B2CB: B1        .byte $B1
- D 1 - I - 0x0372DC 1A:B2CC: 98        .byte $98
- D 1 - I - 0x0372DD 1A:B2CD: 72        .byte $72
- D 1 - I - 0x0372DE 1A:B2CE: 4D        .byte $4D
- D 1 - I - 0x0372DF 1A:B2CF: C7        .byte $C7
- D 1 - I - 0x0372E0 1A:B2D0: C9        .byte $C9
- D 1 - I - 0x0372E1 1A:B2D1: B7        .byte $B7
- D 1 - I - 0x0372E2 1A:B2D2: 95        .byte $95
- D 1 - I - 0x0372E3 1A:B2D3: F0        .byte $F0
- D 1 - I - 0x0372E4 1A:B2D4: F0        .byte $F0
- D 1 - I - 0x0372E5 1A:B2D5: 84        .byte $84
- D 1 - I - 0x0372E6 1A:B2D6: 62        .byte $62
- D 1 - I - 0x0372E7 1A:B2D7: 68        .byte $68
- D 1 - I - 0x0372E8 1A:B2D8: 9A        .byte $9A
- D 1 - I - 0x0372E9 1A:B2D9: 4B        .byte $4B
- D 1 - I - 0x0372EA 1A:B2DA: 59        .byte $59
- D 1 - I - 0x0372EB 1A:B2DB: 87        .byte $87
- D 1 - I - 0x0372EC 1A:B2DC: AA        .byte $AA
- D 1 - I - 0x0372ED 1A:B2DD: F0        .byte $F0
- D 1 - I - 0x0372EE 1A:B2DE: F0        .byte $F0
- D 1 - I - 0x0372EF 1A:B2DF: BB        .byte $BB
- D 1 - I - 0x0372F0 1A:B2E0: D5        .byte $D5
- D 1 - I - 0x0372F1 1A:B2E1: 7D        .byte $7D
- D 1 - I - 0x0372F2 1A:B2E2: A2        .byte $A2
- D 1 - I - 0x0372F3 1A:B2E3: EA        .byte $EA
- D 1 - I - 0x0372F4 1A:B2E4: EA        .byte $EA
- D 1 - I - 0x0372F5 1A:B2E5: A8        .byte $A8
- D 1 - I - 0x0372F6 1A:B2E6: D0        .byte $D0
- D 1 - I - 0x0372F7 1A:B2E7: F0        .byte $F0
- D 1 - I - 0x0372F8 1A:B2E8: F0        .byte $F0
- D 1 - I - 0x0372F9 1A:B2E9: F0        .byte $F0
- D 1 - I - 0x0372FA 1A:B2EA: 04        .byte $04
- D 1 - I - 0x0372FB 1A:B2EB: F0        .byte $F0
- D 1 - I - 0x0372FC 1A:B2EC: 07        .byte $07
- D 1 - I - 0x0372FD 1A:B2ED: F0        .byte $F0
- D 1 - I - 0x0372FE 1A:B2EE: F0        .byte $F0
- D 1 - I - 0x0372FF 1A:B2EF: F0        .byte $F0
- D 1 - I - 0x037300 1A:B2F0: 1D        .byte $1D
- D 1 - I - 0x037301 1A:B2F1: F0        .byte $F0
- D 1 - I - 0x037302 1A:B2F2: F0        .byte $F0
- D 1 - I - 0x037303 1A:B2F3: F0        .byte $F0
- D 1 - I - 0x037304 1A:B2F4: F0        .byte $F0
- D 1 - I - 0x037305 1A:B2F5: F0        .byte $F0
- D 1 - I - 0x037306 1A:B2F6: 12        .byte $12
- D 1 - I - 0x037307 1A:B2F7: 4F        .byte $4F
- D 1 - I - 0x037308 1A:B2F8: 73        .byte $73
- D 1 - I - 0x037309 1A:B2F9: 41        .byte $41
- D 1 - I - 0x03730A 1A:B2FA: 41        .byte $41
- D 1 - I - 0x03730B 1A:B2FB: 3F        .byte $3F
- D 1 - I - 0x03730C 1A:B2FC: 7B        .byte $7B
- D 1 - I - 0x03730D 1A:B2FD: 10        .byte $10
- D 1 - I - 0x03730E 1A:B2FE: 03        .byte $03
- D 1 - I - 0x03730F 1A:B2FF: 13        .byte $13
- D 1 - I - 0x037310 1A:B300: 08        .byte $08
- D 1 - I - 0x037311 1A:B301: F0        .byte $F0
- D 1 - I - 0x037312 1A:B302: 05        .byte $05
- D 1 - I - 0x037313 1A:B303: F0        .byte $F0
- D 1 - I - 0x037314 1A:B304: 28        .byte $28
- D 1 - I - 0x037315 1A:B305: F0        .byte $F0
- D 1 - I - 0x037316 1A:B306: 3E        .byte $3E
- D 1 - I - 0x037317 1A:B307: F0        .byte $F0
- D 1 - I - 0x037318 1A:B308: 2B        .byte $2B
- D 1 - I - 0x037319 1A:B309: F0        .byte $F0
- D 1 - I - 0x03731A 1A:B30A: 1E        .byte $1E
- D 1 - I - 0x03731B 1A:B30B: 73        .byte $73
- D 1 - I - 0x03731C 1A:B30C: 45        .byte $45
- D 1 - I - 0x03731D 1A:B30D: F0        .byte $F0
- D 1 - I - 0x03731E 1A:B30E: F0        .byte $F0
- D 1 - I - 0x03731F 1A:B30F: 62        .byte $62
- D 1 - I - 0x037320 1A:B310: 6F        .byte $6F
- D 1 - I - 0x037321 1A:B311: 1B        .byte $1B
- D 1 - I - 0x037322 1A:B312: 48        .byte $48
- D 1 - I - 0x037323 1A:B313: 20        .byte $20
- D 1 - I - 0x037324 1A:B314: 53        .byte $53
- D 1 - I - 0x037325 1A:B315: 11        .byte $11
- D 1 - I - 0x037326 1A:B316: 12        .byte $12
- D 1 - I - 0x037327 1A:B317: 4A        .byte $4A
- D 1 - I - 0x037328 1A:B318: 35        .byte $35
- D 1 - I - 0x037329 1A:B319: 6C        .byte $6C
- D 1 - I - 0x03732A 1A:B31A: 63        .byte $63
- D 1 - I - 0x03732B 1A:B31B: 68        .byte $68
- D 1 - I - 0x03732C 1A:B31C: 81        .byte $81
- D 1 - I - 0x03732D 1A:B31D: 2B        .byte $2B
- D 1 - I - 0x03732E 1A:B31E: 4F        .byte $4F
- D 1 - I - 0x03732F 1A:B31F: F0        .byte $F0
- D 1 - I - 0x037330 1A:B320: F0        .byte $F0
- D 1 - I - 0x037331 1A:B321: F0        .byte $F0
- D 1 - I - 0x037332 1A:B322: 59        .byte $59
- D 1 - I - 0x037333 1A:B323: F0        .byte $F0
- D 1 - I - 0x037334 1A:B324: F0        .byte $F0
- D 1 - I - 0x037335 1A:B325: 3F        .byte $3F
- D 1 - I - 0x037336 1A:B326: 79        .byte $79
- D 1 - I - 0x037337 1A:B327: 44        .byte $44
- D 1 - I - 0x037338 1A:B328: 82        .byte $82
- D 1 - I - 0x037339 1A:B329: 35        .byte $35
- D 1 - I - 0x03733A 1A:B32A: 2A        .byte $2A
- D 1 - I - 0x03733B 1A:B32B: 7B        .byte $7B
- D 1 - I - 0x03733C 1A:B32C: 58        .byte $58
- D 1 - I - 0x03733D 1A:B32D: B5        .byte $B5
- D 1 - I - 0x03733E 1A:B32E: 9E        .byte $9E
- D 1 - I - 0x03733F 1A:B32F: BE        .byte $BE
- D 1 - I - 0x037340 1A:B330: A5        .byte $A5
- D 1 - I - 0x037341 1A:B331: 5A        .byte $5A
- D 1 - I - 0x037342 1A:B332: 73        .byte $73
- D 1 - I - 0x037343 1A:B333: F0        .byte $F0
- D 1 - I - 0x037344 1A:B334: F0        .byte $F0
- D 1 - I - 0x037345 1A:B335: 89        .byte $89
- D 1 - I - 0x037346 1A:B336: 8A        .byte $8A
- D 1 - I - 0x037347 1A:B337: F0        .byte $F0
- D 1 - I - 0x037348 1A:B338: C3        .byte $C3
- D 1 - I - 0x037349 1A:B339: 9D        .byte $9D
- D 1 - I - 0x03734A 1A:B33A: 62        .byte $62
- D 1 - I - 0x03734B 1A:B33B: 68        .byte $68
- D 1 - I - 0x03734C 1A:B33C: A6        .byte $A6
- D 1 - I - 0x03734D 1A:B33D: 59        .byte $59
- D 1 - I - 0x03734E 1A:B33E: 42        .byte $42
- D 1 - I - 0x03734F 1A:B33F: 70        .byte $70
- D 1 - I - 0x037350 1A:B340: 9F        .byte $9F
- D 1 - I - 0x037351 1A:B341: E6        .byte $E6
- D 1 - I - 0x037352 1A:B342: CD        .byte $CD
- D 1 - I - 0x037353 1A:B343: ED        .byte $ED
- D 1 - I - 0x037354 1A:B344: D6        .byte $D6
- D 1 - I - 0x037355 1A:B345: 72        .byte $72
- D 1 - I - 0x037356 1A:B346: A3        .byte $A3
- D 1 - I - 0x037357 1A:B347: F0        .byte $F0
- D 1 - I - 0x037358 1A:B348: F0        .byte $F0
- D 1 - I - 0x037359 1A:B349: B9        .byte $B9
- D 1 - I - 0x03735A 1A:B34A: C6        .byte $C6
- D 1 - I - 0x03735B 1A:B34B: F0        .byte $F0
- D 1 - I - 0x03735C 1A:B34C: F0        .byte $F0
- D 1 - I - 0x03735D 1A:B34D: 04        .byte $04
- D 1 - I - 0x03735E 1A:B34E: 04        .byte $04
- D 1 - I - 0x03735F 1A:B34F: F0        .byte $F0
- D 1 - I - 0x037360 1A:B350: F0        .byte $F0
- D 1 - I - 0x037361 1A:B351: 07        .byte $07
- D 1 - I - 0x037362 1A:B352: 07        .byte $07
- D 1 - I - 0x037363 1A:B353: 12        .byte $12
- D 1 - I - 0x037364 1A:B354: 12        .byte $12
- D 1 - I - 0x037365 1A:B355: 1D        .byte $1D
- D 1 - I - 0x037366 1A:B356: 1D        .byte $1D
- D 1 - I - 0x037367 1A:B357: F0        .byte $F0
- D 1 - I - 0x037368 1A:B358: F0        .byte $F0
- D 1 - I - 0x037369 1A:B359: F0        .byte $F0
- D 1 - I - 0x03736A 1A:B35A: 14        .byte $14
- D 1 - I - 0x03736B 1A:B35B: 72        .byte $72
- D 1 - I - 0x03736C 1A:B35C: 76        .byte $76
- D 1 - I - 0x03736D 1A:B35D: 1F        .byte $1F
- D 1 - I - 0x03736E 1A:B35E: 1F        .byte $1F
- D 1 - I - 0x03736F 1A:B35F: 42        .byte $42
- D 1 - I - 0x037370 1A:B360: 6F        .byte $6F
- D 1 - I - 0x037371 1A:B361: 05        .byte $05
- D 1 - I - 0x037372 1A:B362: 1C        .byte $1C
- D 1 - I - 0x037373 1A:B363: 15        .byte $15
- D 1 - I - 0x037374 1A:B364: 2F        .byte $2F
- D 1 - I - 0x037375 1A:B365: 07        .byte $07
- D 1 - I - 0x037376 1A:B366: 1F        .byte $1F
- D 1 - I - 0x037377 1A:B367: 2A        .byte $2A
- D 1 - I - 0x037378 1A:B368: 2A        .byte $2A
- D 1 - I - 0x037379 1A:B369: 1C        .byte $1C
- D 1 - I - 0x03737A 1A:B36A: 33        .byte $33
- D 1 - I - 0x03737B 1A:B36B: F0        .byte $F0
- D 1 - I - 0x03737C 1A:B36C: F0        .byte $F0
- D 1 - I - 0x03737D 1A:B36D: F0        .byte $F0
- D 1 - I - 0x03737E 1A:B36E: 38        .byte $38
- D 1 - I - 0x03737F 1A:B36F: F0        .byte $F0
- D 1 - I - 0x037380 1A:B370: F0        .byte $F0
- D 1 - I - 0x037381 1A:B371: 65        .byte $65
- D 1 - I - 0x037382 1A:B372: 4F        .byte $4F
- D 1 - I - 0x037383 1A:B373: 6E        .byte $6E
- D 1 - I - 0x037384 1A:B374: 81        .byte $81
- D 1 - I - 0x037385 1A:B375: 1C        .byte $1C
- D 1 - I - 0x037386 1A:B376: 31        .byte $31
- D 1 - I - 0x037387 1A:B377: 21        .byte $21
- D 1 - I - 0x037388 1A:B378: 47        .byte $47
- D 1 - I - 0x037389 1A:B379: 12        .byte $12
- D 1 - I - 0x03738A 1A:B37A: 1F        .byte $1F
- D 1 - I - 0x03738B 1A:B37B: 35        .byte $35
- D 1 - I - 0x03738C 1A:B37C: 37        .byte $37
- D 1 - I - 0x03738D 1A:B37D: 79        .byte $79
- D 1 - I - 0x03738E 1A:B37E: 57        .byte $57
- D 1 - I - 0x03738F 1A:B37F: F0        .byte $F0
- D 1 - I - 0x037390 1A:B380: F0        .byte $F0
- D 1 - I - 0x037391 1A:B381: 5C        .byte $5C
- D 1 - I - 0x037392 1A:B382: 51        .byte $51
- D 1 - I - 0x037393 1A:B383: F0        .byte $F0
- D 1 - I - 0x037394 1A:B384: 99        .byte $99
- D 1 - I - 0x037395 1A:B385: 65        .byte $65
- D 1 - I - 0x037396 1A:B386: 7E        .byte $7E
- D 1 - I - 0x037397 1A:B387: 94        .byte $94
- D 1 - I - 0x037398 1A:B388: 94        .byte $94
- D 1 - I - 0x037399 1A:B389: 6E        .byte $6E
- D 1 - I - 0x03739A 1A:B38A: 34        .byte $34
- D 1 - I - 0x03739B 1A:B38B: 45        .byte $45
- D 1 - I - 0x03739C 1A:B38C: 5D        .byte $5D
- D 1 - I - 0x03739D 1A:B38D: 2A        .byte $2A
- D 1 - I - 0x03739E 1A:B38E: 37        .byte $37
- D 1 - I - 0x03739F 1A:B38F: 87        .byte $87
- D 1 - I - 0x0373A0 1A:B390: 59        .byte $59
- D 1 - I - 0x0373A1 1A:B391: B6        .byte $B6
- D 1 - I - 0x0373A2 1A:B392: A0        .byte $A0
- D 1 - I - 0x0373A3 1A:B393: 74        .byte $74
- D 1 - I - 0x0373A4 1A:B394: 8F        .byte $8F
- D 1 - I - 0x0373A5 1A:B395: 5B        .byte $5B
- D 1 - I - 0x0373A6 1A:B396: 8C        .byte $8C
- D 1 - I - 0x0373A7 1A:B397: F0        .byte $F0
- D 1 - I - 0x0373A8 1A:B398: F0        .byte $F0
- D 1 - I - 0x0373A9 1A:B399: 96        .byte $96
- D 1 - I - 0x0373AA 1A:B39A: BB        .byte $BB
- D 1 - I - 0x0373AB 1A:B39B: C3        .byte $C3
- D 1 - I - 0x0373AC 1A:B39C: C5        .byte $C5
- D 1 - I - 0x0373AD 1A:B39D: 63        .byte $63
- D 1 - I - 0x0373AE 1A:B39E: 91        .byte $91
- D 1 - I - 0x0373AF 1A:B39F: 69        .byte $69
- D 1 - I - 0x0373B0 1A:B3A0: 8F        .byte $8F
- D 1 - I - 0x0373B1 1A:B3A1: 5A        .byte $5A
- D 1 - I - 0x0373B2 1A:B3A2: 50        .byte $50
- D 1 - I - 0x0373B3 1A:B3A3: 7E        .byte $7E
- D 1 - I - 0x0373B4 1A:B3A4: A1        .byte $A1
- D 1 - I - 0x0373B5 1A:B3A5: B8        .byte $B8
- D 1 - I - 0x0373B6 1A:B3A6: CE        .byte $CE
- D 1 - I - 0x0373B7 1A:B3A7: F0        .byte $F0
- D 1 - I - 0x0373B8 1A:B3A8: F0        .byte $F0
- D 1 - I - 0x0373B9 1A:B3A9: 97        .byte $97
- D 1 - I - 0x0373BA 1A:B3AA: 8D        .byte $8D
- D 1 - I - 0x0373BB 1A:B3AB: F0        .byte $F0
- D 1 - I - 0x0373BC 1A:B3AC: F0        .byte $F0
- D 1 - I - 0x0373BD 1A:B3AD: B3        .byte $B3
- D 1 - I - 0x0373BE 1A:B3AE: D3        .byte $D3
- D 1 - I - 0x0373BF 1A:B3AF: E9        .byte $E9
- D 1 - I - 0x0373C0 1A:B3B0: E9        .byte $E9



off_B3B1_07:
- D 1 - I - 0x0373C1 1A:B3B1: F0        .byte $F0
- D 1 - I - 0x0373C2 1A:B3B2: F0        .byte $F0
- D 1 - I - 0x0373C3 1A:B3B3: 07        .byte $07
- D 1 - I - 0x0373C4 1A:B3B4: 07        .byte $07
- D 1 - I - 0x0373C5 1A:B3B5: 04        .byte $04
- D 1 - I - 0x0373C6 1A:B3B6: 04        .byte $04
- D 1 - I - 0x0373C7 1A:B3B7: F0        .byte $F0
- D 1 - I - 0x0373C8 1A:B3B8: 0F        .byte $0F
- D 1 - I - 0x0373C9 1A:B3B9: F0        .byte $F0
- D 1 - I - 0x0373CA 1A:B3BA: F0        .byte $F0
- D 1 - I - 0x0373CB 1A:B3BB: 1E        .byte $1E
- D 1 - I - 0x0373CC 1A:B3BC: 1E        .byte $1E
- D 1 - I - 0x0373CD 1A:B3BD: 11        .byte $11
- D 1 - I - 0x0373CE 1A:B3BE: 11        .byte $11
- D 1 - I - 0x0373CF 1A:B3BF: 34        .byte $34
- D 1 - I - 0x0373D0 1A:B3C0: 5A        .byte $5A
- D 1 - I - 0x0373D1 1A:B3C1: 1C        .byte $1C
- D 1 - I - 0x0373D2 1A:B3C2: 1C        .byte $1C
- D 1 - I - 0x0373D3 1A:B3C3: F0        .byte $F0
- D 1 - I - 0x0373D4 1A:B3C4: F0        .byte $F0
- D 1 - I - 0x0373D5 1A:B3C5: F0        .byte $F0
- D 1 - I - 0x0373D6 1A:B3C6: 24        .byte $24
- D 1 - I - 0x0373D7 1A:B3C7: 05        .byte $05
- D 1 - I - 0x0373D8 1A:B3C8: 05        .byte $05
- D 1 - I - 0x0373D9 1A:B3C9: 1C        .byte $1C
- D 1 - I - 0x0373DA 1A:B3CA: 04        .byte $04
- D 1 - I - 0x0373DB 1A:B3CB: F0        .byte $F0
- D 1 - I - 0x0373DC 1A:B3CC: 1B        .byte $1B
- D 1 - I - 0x0373DD 1A:B3CD: F0        .byte $F0
- D 1 - I - 0x0373DE 1A:B3CE: F0        .byte $F0
- D 1 - I - 0x0373DF 1A:B3CF: 29        .byte $29
- D 1 - I - 0x0373E0 1A:B3D0: 36        .byte $36
- D 1 - I - 0x0373E1 1A:B3D1: F0        .byte $F0
- D 1 - I - 0x0373E2 1A:B3D2: 33        .byte $33
- D 1 - I - 0x0373E3 1A:B3D3: 5B        .byte $5B
- D 1 - I - 0x0373E4 1A:B3D4: 80        .byte $80
- D 1 - I - 0x0373E5 1A:B3D5: F0        .byte $F0
- D 1 - I - 0x0373E6 1A:B3D6: F0        .byte $F0
- D 1 - I - 0x0373E7 1A:B3D7: F0        .byte $F0
- D 1 - I - 0x0373E8 1A:B3D8: F0        .byte $F0
- D 1 - I - 0x0373E9 1A:B3D9: F0        .byte $F0
- D 1 - I - 0x0373EA 1A:B3DA: 3C        .byte $3C
- D 1 - I - 0x0373EB 1A:B3DB: 1D        .byte $1D
- D 1 - I - 0x0373EC 1A:B3DC: 43        .byte $43
- D 1 - I - 0x0373ED 1A:B3DD: 1B        .byte $1B
- D 1 - I - 0x0373EE 1A:B3DE: 1C        .byte $1C
- D 1 - I - 0x0373EF 1A:B3DF: F0        .byte $F0
- D 1 - I - 0x0373F0 1A:B3E0: 3E        .byte $3E
- D 1 - I - 0x0373F1 1A:B3E1: F0        .byte $F0
- D 1 - I - 0x0373F2 1A:B3E2: F0        .byte $F0
- D 1 - I - 0x0373F3 1A:B3E3: F0        .byte $F0
- D 1 - I - 0x0373F4 1A:B3E4: 65        .byte $65
- D 1 - I - 0x0373F5 1A:B3E5: 34        .byte $34
- D 1 - I - 0x0373F6 1A:B3E6: 4C        .byte $4C
- D 1 - I - 0x0373F7 1A:B3E7: F0        .byte $F0
- D 1 - I - 0x0373F8 1A:B3E8: 7E        .byte $7E
- D 1 - I - 0x0373F9 1A:B3E9: 57        .byte $57
- D 1 - I - 0x0373FA 1A:B3EA: 57        .byte $57
- D 1 - I - 0x0373FB 1A:B3EB: F0        .byte $F0
- D 1 - I - 0x0373FC 1A:B3EC: F0        .byte $F0
- D 1 - I - 0x0373FD 1A:B3ED: 6C        .byte $6C
- D 1 - I - 0x0373FE 1A:B3EE: 4A        .byte $4A
- D 1 - I - 0x0373FF 1A:B3EF: 36        .byte $36
- D 1 - I - 0x037400 1A:B3F0: 72        .byte $72
- D 1 - I - 0x037401 1A:B3F1: 33        .byte $33
- D 1 - I - 0x037402 1A:B3F2: 28        .byte $28
- D 1 - I - 0x037403 1A:B3F3: F0        .byte $F0
- D 1 - I - 0x037404 1A:B3F4: 57        .byte $57
- D 1 - I - 0x037405 1A:B3F5: F0        .byte $F0
- D 1 - I - 0x037406 1A:B3F6: 79        .byte $79
- D 1 - I - 0x037407 1A:B3F7: F0        .byte $F0
- D 1 - I - 0x037408 1A:B3F8: 89        .byte $89
- D 1 - I - 0x037409 1A:B3F9: 59        .byte $59
- D 1 - I - 0x03740A 1A:B3FA: 70        .byte $70
- D 1 - I - 0x03740B 1A:B3FB: F0        .byte $F0
- D 1 - I - 0x03740C 1A:B3FC: AE        .byte $AE
- D 1 - I - 0x03740D 1A:B3FD: F0        .byte $F0
- D 1 - I - 0x03740E 1A:B3FE: F0        .byte $F0
- D 1 - I - 0x03740F 1A:B3FF: F0        .byte $F0
- D 1 - I - 0x037410 1A:B400: F0        .byte $F0
- D 1 - I - 0x037411 1A:B401: 84        .byte $84
- - - - - - 0x037412 1A:B402: 62        .byte $62
- D 1 - I - 0x037413 1A:B403: 67        .byte $67
- D 1 - I - 0x037414 1A:B404: 97        .byte $97
- D 1 - I - 0x037415 1A:B405: 4B        .byte $4B
- D 1 - I - 0x037416 1A:B406: 59        .byte $59
- D 1 - I - 0x037417 1A:B407: F0        .byte $F0
- D 1 - I - 0x037418 1A:B408: 87        .byte $87
- D 1 - I - 0x037419 1A:B409: F0        .byte $F0
- D 1 - I - 0x03741A 1A:B40A: F0        .byte $F0
- D 1 - I - 0x03741B 1A:B40B: F0        .byte $F0
- D 1 - I - 0x03741C 1A:B40C: A0        .byte $A0
- D 1 - I - 0x03741D 1A:B40D: 70        .byte $70
- D 1 - I - 0x03741E 1A:B40E: 7D        .byte $7D
- D 1 - I - 0x03741F 1A:B40F: D0        .byte $D0
- D 1 - I - 0x037420 1A:B410: D0        .byte $D0
- D 1 - I - 0x037421 1A:B411: F0        .byte $F0
- D 1 - I - 0x037422 1A:B412: 91        .byte $91
- D 1 - I - 0x037423 1A:B413: F0        .byte $F0
- D 1 - I - 0x037424 1A:B414: F0        .byte $F0
- D 1 - I - 0x037425 1A:B415: F0        .byte $F0
- D 1 - I - 0x037426 1A:B416: 04        .byte $04
- D 1 - I - 0x037427 1A:B417: F0        .byte $F0
- D 1 - I - 0x037428 1A:B418: 07        .byte $07
- D 1 - I - 0x037429 1A:B419: F0        .byte $F0
- D 1 - I - 0x03742A 1A:B41A: F0        .byte $F0
- D 1 - I - 0x03742B 1A:B41B: F0        .byte $F0
- D 1 - I - 0x03742C 1A:B41C: 1D        .byte $1D
- D 1 - I - 0x03742D 1A:B41D: F0        .byte $F0
- D 1 - I - 0x03742E 1A:B41E: F0        .byte $F0
- D 1 - I - 0x03742F 1A:B41F: F0        .byte $F0
- D 1 - I - 0x037430 1A:B420: F0        .byte $F0
- D 1 - I - 0x037431 1A:B421: F0        .byte $F0
- D 1 - I - 0x037432 1A:B422: 12        .byte $12
- D 1 - I - 0x037433 1A:B423: 38        .byte $38
- D 1 - I - 0x037434 1A:B424: 74        .byte $74
- D 1 - I - 0x037435 1A:B425: F0        .byte $F0
- D 1 - I - 0x037436 1A:B426: 1E        .byte $1E
- D 1 - I - 0x037437 1A:B427: 33        .byte $33
- D 1 - I - 0x037438 1A:B428: 6F        .byte $6F
- D 1 - I - 0x037439 1A:B429: 03        .byte $03
- D 1 - I - 0x03743A 1A:B42A: 10        .byte $10
- D 1 - I - 0x03743B 1A:B42B: 13        .byte $13
- D 1 - I - 0x03743C 1A:B42C: 08        .byte $08
- D 1 - I - 0x03743D 1A:B42D: F0        .byte $F0
- D 1 - I - 0x03743E 1A:B42E: 05        .byte $05
- D 1 - I - 0x03743F 1A:B42F: F0        .byte $F0
- D 1 - I - 0x037440 1A:B430: 28        .byte $28
- D 1 - I - 0x037441 1A:B431: F0        .byte $F0
- D 1 - I - 0x037442 1A:B432: 3F        .byte $3F
- D 1 - I - 0x037443 1A:B433: F0        .byte $F0
- D 1 - I - 0x037444 1A:B434: 2B        .byte $2B
- D 1 - I - 0x037445 1A:B435: F0        .byte $F0
- D 1 - I - 0x037446 1A:B436: 1E        .byte $1E
- D 1 - I - 0x037447 1A:B437: F0        .byte $F0
- D 1 - I - 0x037448 1A:B438: 44        .byte $44
- D 1 - I - 0x037449 1A:B439: F0        .byte $F0
- D 1 - I - 0x03744A 1A:B43A: F0        .byte $F0
- D 1 - I - 0x03744B 1A:B43B: F0        .byte $F0
- D 1 - I - 0x03744C 1A:B43C: 5A        .byte $5A
- D 1 - I - 0x03744D 1A:B43D: 55        .byte $55
- D 1 - I - 0x03744E 1A:B43E: 1B        .byte $1B
- D 1 - I - 0x03744F 1A:B43F: 20        .byte $20
- D 1 - I - 0x037450 1A:B440: 5E        .byte $5E
- D 1 - I - 0x037451 1A:B441: 11        .byte $11
- D 1 - I - 0x037452 1A:B442: 12        .byte $12
- D 1 - I - 0x037453 1A:B443: 4B        .byte $4B
- D 1 - I - 0x037454 1A:B444: 35        .byte $35
- D 1 - I - 0x037455 1A:B445: F0        .byte $F0
- D 1 - I - 0x037456 1A:B446: 63        .byte $63
- D 1 - I - 0x037457 1A:B447: F0        .byte $F0
- D 1 - I - 0x037458 1A:B448: 68        .byte $68
- D 1 - I - 0x037459 1A:B449: 36        .byte $36
- D 1 - I - 0x03745A 1A:B44A: 4F        .byte $4F
- D 1 - I - 0x03745B 1A:B44B: F0        .byte $F0
- D 1 - I - 0x03745C 1A:B44C: F0        .byte $F0
- D 1 - I - 0x03745D 1A:B44D: F0        .byte $F0
- D 1 - I - 0x03745E 1A:B44E: 59        .byte $59
- D 1 - I - 0x03745F 1A:B44F: F0        .byte $F0
- D 1 - I - 0x037460 1A:B450: F0        .byte $F0
- D 1 - I - 0x037461 1A:B451: 79        .byte $79
- D 1 - I - 0x037462 1A:B452: 3F        .byte $3F
- D 1 - I - 0x037463 1A:B453: 44        .byte $44
- D 1 - I - 0x037464 1A:B454: 82        .byte $82
- D 1 - I - 0x037465 1A:B455: 4D        .byte $4D
- D 1 - I - 0x037466 1A:B456: 5A        .byte $5A
- D 1 - I - 0x037467 1A:B457: F0        .byte $F0
- D 1 - I - 0x037468 1A:B458: 58        .byte $58
- D 1 - I - 0x037469 1A:B459: F0        .byte $F0
- D 1 - I - 0x03746A 1A:B45A: 9F        .byte $9F
- D 1 - I - 0x03746B 1A:B45B: F0        .byte $F0
- D 1 - I - 0x03746C 1A:B45C: A4        .byte $A4
- D 1 - I - 0x03746D 1A:B45D: F0        .byte $F0
- D 1 - I - 0x03746E 1A:B45E: 5A        .byte $5A
- D 1 - I - 0x03746F 1A:B45F: F0        .byte $F0
- D 1 - I - 0x037470 1A:B460: F0        .byte $F0
- D 1 - I - 0x037471 1A:B461: F0        .byte $F0
- D 1 - I - 0x037472 1A:B462: 71        .byte $71
- D 1 - I - 0x037473 1A:B463: F0        .byte $F0
- D 1 - I - 0x037474 1A:B464: F0        .byte $F0
- D 1 - I - 0x037475 1A:B465: 9D        .byte $9D
- D 1 - I - 0x037476 1A:B466: 62        .byte $62
- D 1 - I - 0x037477 1A:B467: 68        .byte $68
- D 1 - I - 0x037478 1A:B468: A6        .byte $A6
- D 1 - I - 0x037479 1A:B469: 4D        .byte $4D
- D 1 - I - 0x03747A 1A:B46A: 5A        .byte $5A
- D 1 - I - 0x03747B 1A:B46B: 94        .byte $94
- D 1 - I - 0x03747C 1A:B46C: 88        .byte $88
- D 1 - I - 0x03747D 1A:B46D: F0        .byte $F0
- D 1 - I - 0x03747E 1A:B46E: B6        .byte $B6
- D 1 - I - 0x03747F 1A:B46F: F0        .byte $F0
- D 1 - I - 0x037480 1A:B470: BD        .byte $BD
- D 1 - I - 0x037481 1A:B471: 8B        .byte $8B
- D 1 - I - 0x037482 1A:B472: 98        .byte $98
- D 1 - I - 0x037483 1A:B473: F0        .byte $F0
- D 1 - I - 0x037484 1A:B474: F0        .byte $F0
- D 1 - I - 0x037485 1A:B475: F0        .byte $F0
- D 1 - I - 0x037486 1A:B476: B9        .byte $B9
- D 1 - I - 0x037487 1A:B477: F0        .byte $F0
- D 1 - I - 0x037488 1A:B478: F0        .byte $F0
- D 1 - I - 0x037489 1A:B479: 04        .byte $04
- D 1 - I - 0x03748A 1A:B47A: 04        .byte $04
- D 1 - I - 0x03748B 1A:B47B: F0        .byte $F0
- D 1 - I - 0x03748C 1A:B47C: F0        .byte $F0
- D 1 - I - 0x03748D 1A:B47D: 07        .byte $07
- D 1 - I - 0x03748E 1A:B47E: 07        .byte $07
- D 1 - I - 0x03748F 1A:B47F: 12        .byte $12
- D 1 - I - 0x037490 1A:B480: 12        .byte $12
- D 1 - I - 0x037491 1A:B481: 1D        .byte $1D
- D 1 - I - 0x037492 1A:B482: 1D        .byte $1D
- D 1 - I - 0x037493 1A:B483: F0        .byte $F0
- D 1 - I - 0x037494 1A:B484: F0        .byte $F0
- D 1 - I - 0x037495 1A:B485: F0        .byte $F0
- D 1 - I - 0x037496 1A:B486: 14        .byte $14
- D 1 - I - 0x037497 1A:B487: F0        .byte $F0
- D 1 - I - 0x037498 1A:B488: F0        .byte $F0
- D 1 - I - 0x037499 1A:B489: 1F        .byte $1F
- D 1 - I - 0x03749A 1A:B48A: 1F        .byte $1F
- D 1 - I - 0x03749B 1A:B48B: 57        .byte $57
- D 1 - I - 0x03749C 1A:B48C: 37        .byte $37
- D 1 - I - 0x03749D 1A:B48D: 06        .byte $06
- D 1 - I - 0x03749E 1A:B48E: 06        .byte $06
- D 1 - I - 0x03749F 1A:B48F: F0        .byte $F0
- D 1 - I - 0x0374A0 1A:B490: 2F        .byte $2F
- D 1 - I - 0x0374A1 1A:B491: 07        .byte $07
- D 1 - I - 0x0374A2 1A:B492: 1F        .byte $1F
- D 1 - I - 0x0374A3 1A:B493: F0        .byte $F0
- D 1 - I - 0x0374A4 1A:B494: 2B        .byte $2B
- D 1 - I - 0x0374A5 1A:B495: 1D        .byte $1D
- D 1 - I - 0x0374A6 1A:B496: 1D        .byte $1D
- D 1 - I - 0x0374A7 1A:B497: F0        .byte $F0
- D 1 - I - 0x0374A8 1A:B498: F0        .byte $F0
- D 1 - I - 0x0374A9 1A:B499: F0        .byte $F0
- D 1 - I - 0x0374AA 1A:B49A: 20        .byte $20
- D 1 - I - 0x0374AB 1A:B49B: F0        .byte $F0
- D 1 - I - 0x0374AC 1A:B49C: F0        .byte $F0
- D 1 - I - 0x0374AD 1A:B49D: F0        .byte $F0
- D 1 - I - 0x0374AE 1A:B49E: 38        .byte $38
- D 1 - I - 0x0374AF 1A:B49F: 63        .byte $63
- D 1 - I - 0x0374B0 1A:B4A0: 4C        .byte $4C
- D 1 - I - 0x0374B1 1A:B4A1: 40        .byte $40
- D 1 - I - 0x0374B2 1A:B4A2: 1E        .byte $1E
- D 1 - I - 0x0374B3 1A:B4A3: F0        .byte $F0
- D 1 - I - 0x0374B4 1A:B4A4: 47        .byte $47
- D 1 - I - 0x0374B5 1A:B4A5: 1F        .byte $1F
- D 1 - I - 0x0374B6 1A:B4A6: 20        .byte $20
- D 1 - I - 0x0374B7 1A:B4A7: 37        .byte $37
- D 1 - I - 0x0374B8 1A:B4A8: 4F        .byte $4F
- D 1 - I - 0x0374B9 1A:B4A9: F0        .byte $F0
- D 1 - I - 0x0374BA 1A:B4AA: 59        .byte $59
- D 1 - I - 0x0374BB 1A:B4AB: F0        .byte $F0
- D 1 - I - 0x0374BC 1A:B4AC: F0        .byte $F0
- D 1 - I - 0x0374BD 1A:B4AD: F0        .byte $F0
- D 1 - I - 0x0374BE 1A:B4AE: 45        .byte $45
- D 1 - I - 0x0374BF 1A:B4AF: F0        .byte $F0
- D 1 - I - 0x0374C0 1A:B4B0: F0        .byte $F0
- D 1 - I - 0x0374C1 1A:B4B1: F0        .byte $F0
- D 1 - I - 0x0374C2 1A:B4B2: 5C        .byte $5C
- D 1 - I - 0x0374C3 1A:B4B3: F0        .byte $F0
- D 1 - I - 0x0374C4 1A:B4B4: 7E        .byte $7E
- D 1 - I - 0x0374C5 1A:B4B5: 71        .byte $71
- D 1 - I - 0x0374C6 1A:B4B6: 35        .byte $35
- D 1 - I - 0x0374C7 1A:B4B7: 51        .byte $51
- D 1 - I - 0x0374C8 1A:B4B8: 8F        .byte $8F
- D 1 - I - 0x0374C9 1A:B4B9: 2B        .byte $2B
- D 1 - I - 0x0374CA 1A:B4BA: 38        .byte $38
- D 1 - I - 0x0374CB 1A:B4BB: 4E        .byte $4E
- D 1 - I - 0x0374CC 1A:B4BC: 7E        .byte $7E
- D 1 - I - 0x0374CD 1A:B4BD: F0        .byte $F0
- D 1 - I - 0x0374CE 1A:B4BE: 96        .byte $96
- D 1 - I - 0x0374CF 1A:B4BF: F0        .byte $F0
- D 1 - I - 0x0374D0 1A:B4C0: 81        .byte $81
- D 1 - I - 0x0374D1 1A:B4C1: F0        .byte $F0
- D 1 - I - 0x0374D2 1A:B4C2: 5B        .byte $5B
- D 1 - I - 0x0374D3 1A:B4C3: F0        .byte $F0
- D 1 - I - 0x0374D4 1A:B4C4: F0        .byte $F0
- D 1 - I - 0x0374D5 1A:B4C5: F0        .byte $F0
- D 1 - I - 0x0374D6 1A:B4C6: F0        .byte $F0
- D 1 - I - 0x0374D7 1A:B4C7: F0        .byte $F0
- D 1 - I - 0x0374D8 1A:B4C8: BB        .byte $BB
- D 1 - I - 0x0374D9 1A:B4C9: 64        .byte $64
- D 1 - I - 0x0374DA 1A:B4CA: 94        .byte $94
- D 1 - I - 0x0374DB 1A:B4CB: 69        .byte $69
- D 1 - I - 0x0374DC 1A:B4CC: 8F        .byte $8F
- D 1 - I - 0x0374DD 1A:B4CD: 5A        .byte $5A
- D 1 - I - 0x0374DE 1A:B4CE: 50        .byte $50
- D 1 - I - 0x0374DF 1A:B4CF: 8A        .byte $8A
- D 1 - I - 0x0374E0 1A:B4D0: A4        .byte $A4
- D 1 - I - 0x0374E1 1A:B4D1: F0        .byte $F0
- D 1 - I - 0x0374E2 1A:B4D2: AE        .byte $AE
- D 1 - I - 0x0374E3 1A:B4D3: F0        .byte $F0
- D 1 - I - 0x0374E4 1A:B4D4: F0        .byte $F0
- - - - - - 0x0374E5 1A:B4D5: F0        .byte $F0
- D 1 - I - 0x0374E6 1A:B4D6: 80        .byte $80
- D 1 - I - 0x0374E7 1A:B4D7: F0        .byte $F0
- D 1 - I - 0x0374E8 1A:B4D8: F0        .byte $F0
- D 1 - I - 0x0374E9 1A:B4D9: F0        .byte $F0
- D 1 - I - 0x0374EA 1A:B4DA: B2        .byte $B2
- D 1 - I - 0x0374EB 1A:B4DB: F0        .byte $F0
- D 1 - I - 0x0374EC 1A:B4DC: D3        .byte $D3



off_B4DD_08:
- D 1 - I - 0x0374ED 1A:B4DD: F0        .byte $F0
- D 1 - I - 0x0374EE 1A:B4DE: F0        .byte $F0
- D 1 - I - 0x0374EF 1A:B4DF: 07        .byte $07
- D 1 - I - 0x0374F0 1A:B4E0: 07        .byte $07
- D 1 - I - 0x0374F1 1A:B4E1: 04        .byte $04
- D 1 - I - 0x0374F2 1A:B4E2: 04        .byte $04
- D 1 - I - 0x0374F3 1A:B4E3: F0        .byte $F0
- D 1 - I - 0x0374F4 1A:B4E4: 0F        .byte $0F
- D 1 - I - 0x0374F5 1A:B4E5: F0        .byte $F0
- D 1 - I - 0x0374F6 1A:B4E6: F0        .byte $F0
- D 1 - I - 0x0374F7 1A:B4E7: 1E        .byte $1E
- D 1 - I - 0x0374F8 1A:B4E8: 1E        .byte $1E
- D 1 - I - 0x0374F9 1A:B4E9: 11        .byte $11
- D 1 - I - 0x0374FA 1A:B4EA: 11        .byte $11
- D 1 - I - 0x0374FB 1A:B4EB: 7E        .byte $7E
- D 1 - I - 0x0374FC 1A:B4EC: 59        .byte $59
- D 1 - I - 0x0374FD 1A:B4ED: 1C        .byte $1C
- D 1 - I - 0x0374FE 1A:B4EE: 1C        .byte $1C
- D 1 - I - 0x0374FF 1A:B4EF: 56        .byte $56
- D 1 - I - 0x037500 1A:B4F0: 7A        .byte $7A
- D 1 - I - 0x037501 1A:B4F1: 0D        .byte $0D
- D 1 - I - 0x037502 1A:B4F2: 0F        .byte $0F
- D 1 - I - 0x037503 1A:B4F3: 05        .byte $05
- D 1 - I - 0x037504 1A:B4F4: 05        .byte $05
- D 1 - I - 0x037505 1A:B4F5: 04        .byte $04
- D 1 - I - 0x037506 1A:B4F6: 04        .byte $04
- D 1 - I - 0x037507 1A:B4F7: F0        .byte $F0
- D 1 - I - 0x037508 1A:B4F8: 26        .byte $26
- D 1 - I - 0x037509 1A:B4F9: F0        .byte $F0
- D 1 - I - 0x03750A 1A:B4FA: F0        .byte $F0
- D 1 - I - 0x03750B 1A:B4FB: 29        .byte $29
- D 1 - I - 0x03750C 1A:B4FC: 1F        .byte $1F
- D 1 - I - 0x03750D 1A:B4FD: 1B        .byte $1B
- D 1 - I - 0x03750E 1A:B4FE: 1C        .byte $1C
- D 1 - I - 0x03750F 1A:B4FF: 7C        .byte $7C
- D 1 - I - 0x037510 1A:B500: 80        .byte $80
- D 1 - I - 0x037511 1A:B501: 33        .byte $33
- D 1 - I - 0x037512 1A:B502: 36        .byte $36
- D 1 - I - 0x037513 1A:B503: F0        .byte $F0
- D 1 - I - 0x037514 1A:B504: F0        .byte $F0
- D 1 - I - 0x037515 1A:B505: 3C        .byte $3C
- D 1 - I - 0x037516 1A:B506: 19        .byte $19
- D 1 - I - 0x037517 1A:B507: 13        .byte $13
- D 1 - I - 0x037518 1A:B508: 39        .byte $39
- D 1 - I - 0x037519 1A:B509: 03        .byte $03
- D 1 - I - 0x03751A 1A:B50A: 10        .byte $10
- D 1 - I - 0x03751B 1A:B50B: 1B        .byte $1B
- D 1 - I - 0x03751C 1A:B50C: 33        .byte $33
- D 1 - I - 0x03751D 1A:B50D: F0        .byte $F0
- D 1 - I - 0x03751E 1A:B50E: F0        .byte $F0
- D 1 - I - 0x03751F 1A:B50F: 43        .byte $43
- D 1 - I - 0x037520 1A:B510: 69        .byte $69
- D 1 - I - 0x037521 1A:B511: 35        .byte $35
- D 1 - I - 0x037522 1A:B512: 1D        .byte $1D
- D 1 - I - 0x037523 1A:B513: 96        .byte $96
- D 1 - I - 0x037524 1A:B514: 7F        .byte $7F
- D 1 - I - 0x037525 1A:B515: 3E        .byte $3E
- D 1 - I - 0x037526 1A:B516: 4E        .byte $4E
- D 1 - I - 0x037527 1A:B517: F0        .byte $F0
- D 1 - I - 0x037528 1A:B518: F0        .byte $F0
- D 1 - I - 0x037529 1A:B519: 30        .byte $30
- D 1 - I - 0x03752A 1A:B51A: 49        .byte $49
- D 1 - I - 0x03752B 1A:B51B: 51        .byte $51
- D 1 - I - 0x03752C 1A:B51C: 37        .byte $37
- D 1 - I - 0x03752D 1A:B51D: 27        .byte $27
- D 1 - I - 0x03752E 1A:B51E: 1D        .byte $1D
- D 1 - I - 0x03752F 1A:B51F: 3E        .byte $3E
- D 1 - I - 0x037530 1A:B520: 57        .byte $57
- D 1 - I - 0x037531 1A:B521: 6C        .byte $6C
- D 1 - I - 0x037532 1A:B522: 6E        .byte $6E
- D 1 - I - 0x037533 1A:B523: 74        .byte $74
- D 1 - I - 0x037534 1A:B524: A5        .byte $A5
- D 1 - I - 0x037535 1A:B525: 35        .byte $35
- D 1 - I - 0x037536 1A:B526: 66        .byte $66
- D 1 - I - 0x037537 1A:B527: B8        .byte $B8
- D 1 - I - 0x037538 1A:B528: BB        .byte $BB
- D 1 - I - 0x037539 1A:B529: F0        .byte $F0
- D 1 - I - 0x03753A 1A:B52A: 70        .byte $70
- D 1 - I - 0x03753B 1A:B52B: F0        .byte $F0
- D 1 - I - 0x03753C 1A:B52C: F0        .byte $F0
- D 1 - I - 0x03753D 1A:B52D: 6C        .byte $6C
- D 1 - I - 0x03753E 1A:B52E: 56        .byte $56
- D 1 - I - 0x03753F 1A:B52F: 5C        .byte $5C
- D 1 - I - 0x037540 1A:B530: 82        .byte $82
- D 1 - I - 0x037541 1A:B531: 3F        .byte $3F
- D 1 - I - 0x037542 1A:B532: 4D        .byte $4D
- D 1 - I - 0x037543 1A:B533: 85        .byte $85
- D 1 - I - 0x037544 1A:B534: 6F        .byte $6F
- D 1 - I - 0x037545 1A:B535: F0        .byte $F0
- D 1 - I - 0x037546 1A:B536: 9C        .byte $9C
- D 1 - I - 0x037547 1A:B537: 97        .byte $97
- D 1 - I - 0x037548 1A:B538: BD        .byte $BD
- D 1 - I - 0x037549 1A:B539: 65        .byte $65
- D 1 - I - 0x03754A 1A:B53A: 89        .byte $89
- D 1 - I - 0x03754B 1A:B53B: EA        .byte $EA
- D 1 - I - 0x03754C 1A:B53C: EA        .byte $EA
- D 1 - I - 0x03754D 1A:B53D: 93        .byte $93
- D 1 - I - 0x03754E 1A:B53E: AD        .byte $AD
- D 1 - I - 0x03754F 1A:B53F: F0        .byte $F0
- D 1 - I - 0x037550 1A:B540: F0        .byte $F0
- D 1 - I - 0x037551 1A:B541: F0        .byte $F0
- D 1 - I - 0x037552 1A:B542: 04        .byte $04
- D 1 - I - 0x037553 1A:B543: F0        .byte $F0
- D 1 - I - 0x037554 1A:B544: 07        .byte $07
- D 1 - I - 0x037555 1A:B545: F0        .byte $F0
- D 1 - I - 0x037556 1A:B546: F0        .byte $F0
- D 1 - I - 0x037557 1A:B547: F0        .byte $F0
- D 1 - I - 0x037558 1A:B548: F0        .byte $F0
- D 1 - I - 0x037559 1A:B549: F0        .byte $F0
- D 1 - I - 0x03755A 1A:B54A: 1D        .byte $1D
- D 1 - I - 0x03755B 1A:B54B: F0        .byte $F0
- D 1 - I - 0x03755C 1A:B54C: 12        .byte $12
- D 1 - I - 0x03755D 1A:B54D: F0        .byte $F0
- D 1 - I - 0x03755E 1A:B54E: F0        .byte $F0
- D 1 - I - 0x03755F 1A:B54F: 44        .byte $44
- D 1 - I - 0x037560 1A:B550: 80        .byte $80
- D 1 - I - 0x037561 1A:B551: F0        .byte $F0
- D 1 - I - 0x037562 1A:B552: 1E        .byte $1E
- D 1 - I - 0x037563 1A:B553: 4B        .byte $4B
- D 1 - I - 0x037564 1A:B554: 6F        .byte $6F
- D 1 - I - 0x037565 1A:B555: 03        .byte $03
- D 1 - I - 0x037566 1A:B556: 10        .byte $10
- D 1 - I - 0x037567 1A:B557: 13        .byte $13
- D 1 - I - 0x037568 1A:B558: 08        .byte $08
- D 1 - I - 0x037569 1A:B559: F0        .byte $F0
- D 1 - I - 0x03756A 1A:B55A: 05        .byte $05
- D 1 - I - 0x03756B 1A:B55B: F0        .byte $F0
- D 1 - I - 0x03756C 1A:B55C: 28        .byte $28
- D 1 - I - 0x03756D 1A:B55D: F0        .byte $F0
- D 1 - I - 0x03756E 1A:B55E: 3F        .byte $3F
- D 1 - I - 0x03756F 1A:B55F: F0        .byte $F0
- D 1 - I - 0x037570 1A:B560: 2B        .byte $2B
- D 1 - I - 0x037571 1A:B561: F0        .byte $F0
- D 1 - I - 0x037572 1A:B562: 1E        .byte $1E
- D 1 - I - 0x037573 1A:B563: 73        .byte $73
- D 1 - I - 0x037574 1A:B564: 69        .byte $69
- D 1 - I - 0x037575 1A:B565: F0        .byte $F0
- D 1 - I - 0x037576 1A:B566: F0        .byte $F0
- D 1 - I - 0x037577 1A:B567: 56        .byte $56
- D 1 - I - 0x037578 1A:B568: 6F        .byte $6F
- D 1 - I - 0x037579 1A:B569: 48        .byte $48
- D 1 - I - 0x03757A 1A:B56A: 0F        .byte $0F
- D 1 - I - 0x03757B 1A:B56B: 14        .byte $14
- D 1 - I - 0x03757C 1A:B56C: 53        .byte $53
- D 1 - I - 0x03757D 1A:B56D: 05        .byte $05
- D 1 - I - 0x03757E 1A:B56E: 06        .byte $06
- D 1 - I - 0x03757F 1A:B56F: 1C        .byte $1C
- D 1 - I - 0x037580 1A:B570: 35        .byte $35
- D 1 - I - 0x037581 1A:B571: 26        .byte $26
- D 1 - I - 0x037582 1A:B572: 62        .byte $62
- D 1 - I - 0x037583 1A:B573: 39        .byte $39
- D 1 - I - 0x037584 1A:B574: 69        .byte $69
- D 1 - I - 0x037585 1A:B575: 1E        .byte $1E
- D 1 - I - 0x037586 1A:B576: 4F        .byte $4F
- D 1 - I - 0x037587 1A:B577: F0        .byte $F0
- D 1 - I - 0x037588 1A:B578: F0        .byte $F0
- D 1 - I - 0x037589 1A:B579: F0        .byte $F0
- D 1 - I - 0x03758A 1A:B57A: 59        .byte $59
- D 1 - I - 0x03758B 1A:B57B: F0        .byte $F0
- D 1 - I - 0x03758C 1A:B57C: F0        .byte $F0
- D 1 - I - 0x03758D 1A:B57D: 61        .byte $61
- D 1 - I - 0x03758E 1A:B57E: 32        .byte $32
- D 1 - I - 0x03758F 1A:B57F: 39        .byte $39
- D 1 - I - 0x037590 1A:B580: 6A        .byte $6A
- D 1 - I - 0x037591 1A:B581: 28        .byte $28
- D 1 - I - 0x037592 1A:B582: 2B        .byte $2B
- D 1 - I - 0x037593 1A:B583: 36        .byte $36
- D 1 - I - 0x037594 1A:B584: 59        .byte $59
- D 1 - I - 0x037595 1A:B585: 57        .byte $57
- D 1 - I - 0x037596 1A:B586: 90        .byte $90
- D 1 - I - 0x037597 1A:B587: 5C        .byte $5C
- D 1 - I - 0x037598 1A:B588: 9B        .byte $9B
- D 1 - I - 0x037599 1A:B589: 40        .byte $40
- D 1 - I - 0x03759A 1A:B58A: 4F        .byte $4F
- D 1 - I - 0x03759B 1A:B58B: F0        .byte $F0
- D 1 - I - 0x03759C 1A:B58C: 9F        .byte $9F
- D 1 - I - 0x03759D 1A:B58D: 70        .byte $70
- D 1 - I - 0x03759E 1A:B58E: 73        .byte $73
- D 1 - I - 0x03759F 1A:B58F: F0        .byte $F0
- D 1 - I - 0x0375A0 1A:B590: F0        .byte $F0
- D 1 - I - 0x0375A1 1A:B591: 79        .byte $79
- D 1 - I - 0x0375A2 1A:B592: 57        .byte $57
- D 1 - I - 0x0375A3 1A:B593: 5C        .byte $5C
- D 1 - I - 0x0375A4 1A:B594: 82        .byte $82
- D 1 - I - 0x0375A5 1A:B595: 4E        .byte $4E
- D 1 - I - 0x0375A6 1A:B596: 35        .byte $35
- D 1 - I - 0x0375A7 1A:B597: 59        .byte $59
- D 1 - I - 0x0375A8 1A:B598: 88        .byte $88
- D 1 - I - 0x0375A9 1A:B599: B5        .byte $B5
- D 1 - I - 0x0375AA 1A:B59A: 92        .byte $92
- D 1 - I - 0x0375AB 1A:B59B: 99        .byte $99
- D 1 - I - 0x0375AC 1A:B59C: BE        .byte $BE
- D 1 - I - 0x0375AD 1A:B59D: 66        .byte $66
- D 1 - I - 0x0375AE 1A:B59E: 8B        .byte $8B
- D 1 - I - 0x0375AF 1A:B59F: F0        .byte $F0
- D 1 - I - 0x0375B0 1A:B5A0: F0        .byte $F0
- D 1 - I - 0x0375B1 1A:B5A1: B9        .byte $B9
- D 1 - I - 0x0375B2 1A:B5A2: A2        .byte $A2
- D 1 - I - 0x0375B3 1A:B5A3: F0        .byte $F0
- D 1 - I - 0x0375B4 1A:B5A4: F0        .byte $F0
- D 1 - I - 0x0375B5 1A:B5A5: 04        .byte $04
- D 1 - I - 0x0375B6 1A:B5A6: 04        .byte $04
- D 1 - I - 0x0375B7 1A:B5A7: F0        .byte $F0
- D 1 - I - 0x0375B8 1A:B5A8: F0        .byte $F0
- D 1 - I - 0x0375B9 1A:B5A9: 07        .byte $07
- D 1 - I - 0x0375BA 1A:B5AA: 07        .byte $07
- D 1 - I - 0x0375BB 1A:B5AB: 12        .byte $12
- D 1 - I - 0x0375BC 1A:B5AC: 12        .byte $12
- D 1 - I - 0x0375BD 1A:B5AD: 1D        .byte $1D
- D 1 - I - 0x0375BE 1A:B5AE: 1D        .byte $1D
- D 1 - I - 0x0375BF 1A:B5AF: F0        .byte $F0
- D 1 - I - 0x0375C0 1A:B5B0: F0        .byte $F0
- D 1 - I - 0x0375C1 1A:B5B1: F0        .byte $F0
- D 1 - I - 0x0375C2 1A:B5B2: 14        .byte $14
- D 1 - I - 0x0375C3 1A:B5B3: 74        .byte $74
- D 1 - I - 0x0375C4 1A:B5B4: 6A        .byte $6A
- D 1 - I - 0x0375C5 1A:B5B5: 1F        .byte $1F
- D 1 - I - 0x0375C6 1A:B5B6: 1F        .byte $1F
- D 1 - I - 0x0375C7 1A:B5B7: 70        .byte $70
- D 1 - I - 0x0375C8 1A:B5B8: 4E        .byte $4E
- D 1 - I - 0x0375C9 1A:B5B9: 06        .byte $06
- D 1 - I - 0x0375CA 1A:B5BA: 06        .byte $06
- D 1 - I - 0x0375CB 1A:B5BB: 14        .byte $14
- D 1 - I - 0x0375CC 1A:B5BC: 16        .byte $16
- D 1 - I - 0x0375CD 1A:B5BD: 07        .byte $07
- D 1 - I - 0x0375CE 1A:B5BE: 07        .byte $07
- D 1 - I - 0x0375CF 1A:B5BF: 1F        .byte $1F
- D 1 - I - 0x0375D0 1A:B5C0: 20        .byte $20
- D 1 - I - 0x0375D1 1A:B5C1: 1C        .byte $1C
- D 1 - I - 0x0375D2 1A:B5C2: 2A        .byte $2A
- D 1 - I - 0x0375D3 1A:B5C3: F0        .byte $F0
- D 1 - I - 0x0375D4 1A:B5C4: F0        .byte $F0
- D 1 - I - 0x0375D5 1A:B5C5: F0        .byte $F0
- D 1 - I - 0x0375D6 1A:B5C6: 39        .byte $39
- D 1 - I - 0x0375D7 1A:B5C7: F0        .byte $F0
- D 1 - I - 0x0375D8 1A:B5C8: F0        .byte $F0
- D 1 - I - 0x0375D9 1A:B5C9: 34        .byte $34
- D 1 - I - 0x0375DA 1A:B5CA: 37        .byte $37
- D 1 - I - 0x0375DB 1A:B5CB: 7C        .byte $7C
- D 1 - I - 0x0375DC 1A:B5CC: 7F        .byte $7F
- D 1 - I - 0x0375DD 1A:B5CD: 32        .byte $32
- D 1 - I - 0x0375DE 1A:B5CE: 10        .byte $10
- D 1 - I - 0x0375DF 1A:B5CF: 22        .byte $22
- D 1 - I - 0x0375E0 1A:B5D0: 47        .byte $47
- D 1 - I - 0x0375E1 1A:B5D1: 13        .byte $13
- D 1 - I - 0x0375E2 1A:B5D2: 08        .byte $08
- D 1 - I - 0x0375E3 1A:B5D3: 1E        .byte $1E
- D 1 - I - 0x0375E4 1A:B5D4: 36        .byte $36
- D 1 - I - 0x0375E5 1A:B5D5: 62        .byte $62
- D 1 - I - 0x0375E6 1A:B5D6: 40        .byte $40
- D 1 - I - 0x0375E7 1A:B5D7: F0        .byte $F0
- D 1 - I - 0x0375E8 1A:B5D8: F0        .byte $F0
- D 1 - I - 0x0375E9 1A:B5D9: 20        .byte $20
- D 1 - I - 0x0375EA 1A:B5DA: 44        .byte $44
- D 1 - I - 0x0375EB 1A:B5DB: F0        .byte $F0
- D 1 - I - 0x0375EC 1A:B5DC: 99        .byte $99
- D 1 - I - 0x0375ED 1A:B5DD: 59        .byte $59
- D 1 - I - 0x0375EE 1A:B5DE: 51        .byte $51
- D 1 - I - 0x0375EF 1A:B5DF: 7C        .byte $7C
- D 1 - I - 0x0375F0 1A:B5E0: 95        .byte $95
- D 1 - I - 0x0375F1 1A:B5E1: 4A        .byte $4A
- D 1 - I - 0x0375F2 1A:B5E2: 34        .byte $34
- D 1 - I - 0x0375F3 1A:B5E3: 52        .byte $52
- D 1 - I - 0x0375F4 1A:B5E4: 3B        .byte $3B
- D 1 - I - 0x0375F5 1A:B5E5: 1E        .byte $1E
- D 1 - I - 0x0375F6 1A:B5E6: 2C        .byte $2C
- D 1 - I - 0x0375F7 1A:B5E7: 36        .byte $36
- D 1 - I - 0x0375F8 1A:B5E8: 65        .byte $65
- D 1 - I - 0x0375F9 1A:B5E9: 9E        .byte $9E
- D 1 - I - 0x0375FA 1A:B5EA: 6F        .byte $6F
- D 1 - I - 0x0375FB 1A:B5EB: 74        .byte $74
- D 1 - I - 0x0375FC 1A:B5EC: 8F        .byte $8F
- D 1 - I - 0x0375FD 1A:B5ED: 5B        .byte $5B
- D 1 - I - 0x0375FE 1A:B5EE: 45        .byte $45
- D 1 - I - 0x0375FF 1A:B5EF: F0        .byte $F0
- D 1 - I - 0x037600 1A:B5F0: F0        .byte $F0
- D 1 - I - 0x037601 1A:B5F1: F0        .byte $F0
- D 1 - I - 0x037602 1A:B5F2: 7E        .byte $7E
- D 1 - I - 0x037603 1A:B5F3: B8        .byte $B8
- D 1 - I - 0x037604 1A:B5F4: BB        .byte $BB
- D 1 - I - 0x037605 1A:B5F5: 79        .byte $79
- D 1 - I - 0x037606 1A:B5F6: 57        .byte $57
- D 1 - I - 0x037607 1A:B5F7: 5D        .byte $5D
- D 1 - I - 0x037608 1A:B5F8: 77        .byte $77
- D 1 - I - 0x037609 1A:B5F9: 4E        .byte $4E
- D 1 - I - 0x03760A 1A:B5FA: 44        .byte $44
- - - - - - 0x03760B 1A:B5FB: 66        .byte $66
- D 1 - I - 0x03760C 1A:B5FC: 8A        .byte $8A
- D 1 - I - 0x03760D 1A:B5FD: B6        .byte $B6
- D 1 - I - 0x03760E 1A:B5FE: 94        .byte $94
- D 1 - I - 0x03760F 1A:B5FF: F0        .byte $F0
- - - - - - 0x037610 1A:B600: B3        .byte $B3
- D 1 - I - 0x037611 1A:B601: 74        .byte $74
- D 1 - I - 0x037612 1A:B602: 8E        .byte $8E
- D 1 - I - 0x037613 1A:B603: F0        .byte $F0
- D 1 - I - 0x037614 1A:B604: F0        .byte $F0
- D 1 - I - 0x037615 1A:B605: AE        .byte $AE
- D 1 - I - 0x037616 1A:B606: 98        .byte $98
- D 1 - I - 0x037617 1A:B607: E9        .byte $E9
- D 1 - I - 0x037618 1A:B608: E9        .byte $E9



off_B609_09:
- D 1 - I - 0x037619 1A:B609: F0        .byte $F0
- D 1 - I - 0x03761A 1A:B60A: F0        .byte $F0
- D 1 - I - 0x03761B 1A:B60B: 07        .byte $07
- D 1 - I - 0x03761C 1A:B60C: 07        .byte $07
- D 1 - I - 0x03761D 1A:B60D: F0        .byte $F0
- D 1 - I - 0x03761E 1A:B60E: F0        .byte $F0
- D 1 - I - 0x03761F 1A:B60F: 04        .byte $04
- D 1 - I - 0x037620 1A:B610: 04        .byte $04
- D 1 - I - 0x037621 1A:B611: 11        .byte $11
- D 1 - I - 0x037622 1A:B612: 11        .byte $11
- D 1 - I - 0x037623 1A:B613: 4F        .byte $4F
- D 1 - I - 0x037624 1A:B614: 6A        .byte $6A
- D 1 - I - 0x037625 1A:B615: 1E        .byte $1E
- D 1 - I - 0x037626 1A:B616: 1E        .byte $1E
- D 1 - I - 0x037627 1A:B617: 56        .byte $56
- D 1 - I - 0x037628 1A:B618: 71        .byte $71
- D 1 - I - 0x037629 1A:B619: 1C        .byte $1C
- D 1 - I - 0x03762A 1A:B61A: 1C        .byte $1C
- D 1 - I - 0x03762B 1A:B61B: F0        .byte $F0
- D 1 - I - 0x03762C 1A:B61C: 0F        .byte $0F
- D 1 - I - 0x03762D 1A:B61D: F0        .byte $F0
- D 1 - I - 0x03762E 1A:B61E: F0        .byte $F0
- D 1 - I - 0x03762F 1A:B61F: 07        .byte $07
- D 1 - I - 0x037630 1A:B620: 1F        .byte $1F
- D 1 - I - 0x037631 1A:B621: 24        .byte $24
- D 1 - I - 0x037632 1A:B622: 0F        .byte $0F
- D 1 - I - 0x037633 1A:B623: 05        .byte $05
- D 1 - I - 0x037634 1A:B624: 05        .byte $05
- D 1 - I - 0x037635 1A:B625: 1C        .byte $1C
- D 1 - I - 0x037636 1A:B626: 1C        .byte $1C
- D 1 - I - 0x037637 1A:B627: 5D        .byte $5D
- D 1 - I - 0x037638 1A:B628: 76        .byte $76
- D 1 - I - 0x037639 1A:B629: 29        .byte $29
- D 1 - I - 0x03763A 1A:B62A: 36        .byte $36
- D 1 - I - 0x03763B 1A:B62B: 78        .byte $78
- D 1 - I - 0x03763C 1A:B62C: 7C        .byte $7C
- D 1 - I - 0x03763D 1A:B62D: F0        .byte $F0
- D 1 - I - 0x03763E 1A:B62E: 32        .byte $32
- D 1 - I - 0x03763F 1A:B62F: F0        .byte $F0
- D 1 - I - 0x037640 1A:B630: F0        .byte $F0
- D 1 - I - 0x037641 1A:B631: 3C        .byte $3C
- D 1 - I - 0x037642 1A:B632: 3E        .byte $3E
- D 1 - I - 0x037643 1A:B633: 1F        .byte $1F
- D 1 - I - 0x037644 1A:B634: 3A        .byte $3A
- D 1 - I - 0x037645 1A:B635: 19        .byte $19
- D 1 - I - 0x037646 1A:B636: 1C        .byte $1C
- D 1 - I - 0x037647 1A:B637: 35        .byte $35
- D 1 - I - 0x037648 1A:B638: 12        .byte $12
- D 1 - I - 0x037649 1A:B639: 56        .byte $56
- D 1 - I - 0x03764A 1A:B63A: 4C        .byte $4C
- D 1 - I - 0x03764B 1A:B63B: 5D        .byte $5D
- D 1 - I - 0x03764C 1A:B63C: 8E        .byte $8E
- D 1 - I - 0x03764D 1A:B63D: 4E        .byte $4E
- D 1 - I - 0x03764E 1A:B63E: 8B        .byte $8B
- D 1 - I - 0x03764F 1A:B63F: 9E        .byte $9E
- D 1 - I - 0x037650 1A:B640: A2        .byte $A2
- D 1 - I - 0x037651 1A:B641: F0        .byte $F0
- D 1 - I - 0x037652 1A:B642: 6F        .byte $6F
- D 1 - I - 0x037653 1A:B643: F0        .byte $F0
- D 1 - I - 0x037654 1A:B644: F0        .byte $F0
- D 1 - I - 0x037655 1A:B645: 6C        .byte $6C
- D 1 - I - 0x037656 1A:B646: 6E        .byte $6E
- D 1 - I - 0x037657 1A:B647: 44        .byte $44
- D 1 - I - 0x037658 1A:B648: 75        .byte $75
- D 1 - I - 0x037659 1A:B649: 3D        .byte $3D
- D 1 - I - 0x03765A 1A:B64A: 27        .byte $27
- D 1 - I - 0x03765B 1A:B64B: 35        .byte $35
- D 1 - I - 0x03765C 1A:B64C: 2A        .byte $2A
- D 1 - I - 0x03765D 1A:B64D: 57        .byte $57
- D 1 - I - 0x03765E 1A:B64E: 64        .byte $64
- D 1 - I - 0x03765F 1A:B64F: BD        .byte $BD
- D 1 - I - 0x037660 1A:B650: 9A        .byte $9A
- D 1 - I - 0x037661 1A:B651: AE        .byte $AE
- D 1 - I - 0x037662 1A:B652: 7E        .byte $7E
- D 1 - I - 0x037663 1A:B653: C3        .byte $C3
- D 1 - I - 0x037664 1A:B654: C7        .byte $C7
- D 1 - I - 0x037665 1A:B655: F0        .byte $F0
- D 1 - I - 0x037666 1A:B656: F0        .byte $F0
- D 1 - I - 0x037667 1A:B657: 90        .byte $90
- D 1 - I - 0x037668 1A:B658: 87        .byte $87
- D 1 - I - 0x037669 1A:B659: 84        .byte $84
- D 1 - I - 0x03766A 1A:B65A: 6E        .byte $6E
- D 1 - I - 0x03766B 1A:B65B: 74        .byte $74
- D 1 - I - 0x03766C 1A:B65C: 9A        .byte $9A
- D 1 - I - 0x03766D 1A:B65D: 4C        .byte $4C
- D 1 - I - 0x03766E 1A:B65E: 57        .byte $57
- D 1 - I - 0x03766F 1A:B65F: 65        .byte $65
- D 1 - I - 0x037670 1A:B660: 4E        .byte $4E
- D 1 - I - 0x037671 1A:B661: AA        .byte $AA
- D 1 - I - 0x037672 1A:B662: 87        .byte $87
- D 1 - I - 0x037673 1A:B663: D6        .byte $D6
- D 1 - I - 0x037674 1A:B664: D6        .byte $D6
- D 1 - I - 0x037675 1A:B665: A1        .byte $A1
- D 1 - I - 0x037676 1A:B666: C7        .byte $C7
- D 1 - I - 0x037677 1A:B667: E8        .byte $E8
- D 1 - I - 0x037678 1A:B668: EA        .byte $EA
- D 1 - I - 0x037679 1A:B669: F0        .byte $F0
- D 1 - I - 0x03767A 1A:B66A: F0        .byte $F0
- D 1 - I - 0x03767B 1A:B66B: F0        .byte $F0
- D 1 - I - 0x03767C 1A:B66C: F0        .byte $F0
- D 1 - I - 0x03767D 1A:B66D: F0        .byte $F0
- D 1 - I - 0x03767E 1A:B66E: 04        .byte $04
- D 1 - I - 0x03767F 1A:B66F: F0        .byte $F0
- D 1 - I - 0x037680 1A:B670: 07        .byte $07
- D 1 - I - 0x037681 1A:B671: F0        .byte $F0
- D 1 - I - 0x037682 1A:B672: F0        .byte $F0
- D 1 - I - 0x037683 1A:B673: F0        .byte $F0
- D 1 - I - 0x037684 1A:B674: F0        .byte $F0
- D 1 - I - 0x037685 1A:B675: F0        .byte $F0
- D 1 - I - 0x037686 1A:B676: F0        .byte $F0
- D 1 - I - 0x037687 1A:B677: 51        .byte $51
- D 1 - I - 0x037688 1A:B678: 6B        .byte $6B
- D 1 - I - 0x037689 1A:B679: F0        .byte $F0
- D 1 - I - 0x03768A 1A:B67A: 12        .byte $12
- D 1 - I - 0x03768B 1A:B67B: 6F        .byte $6F
- D 1 - I - 0x03768C 1A:B67C: 74        .byte $74
- D 1 - I - 0x03768D 1A:B67D: F0        .byte $F0
- D 1 - I - 0x03768E 1A:B67E: 3F        .byte $3F
- D 1 - I - 0x03768F 1A:B67F: F0        .byte $F0
- D 1 - I - 0x037690 1A:B680: F0        .byte $F0
- D 1 - I - 0x037691 1A:B681: 03        .byte $03
- D 1 - I - 0x037692 1A:B682: 10        .byte $10
- D 1 - I - 0x037693 1A:B683: 13        .byte $13
- D 1 - I - 0x037694 1A:B684: 08        .byte $08
- D 1 - I - 0x037695 1A:B685: F0        .byte $F0
- D 1 - I - 0x037696 1A:B686: 05        .byte $05
- D 1 - I - 0x037697 1A:B687: F0        .byte $F0
- D 1 - I - 0x037698 1A:B688: 1E        .byte $1E
- D 1 - I - 0x037699 1A:B689: F0        .byte $F0
- D 1 - I - 0x03769A 1A:B68A: F0        .byte $F0
- D 1 - I - 0x03769B 1A:B68B: 45        .byte $45
- D 1 - I - 0x03769C 1A:B68C: 77        .byte $77
- D 1 - I - 0x03769D 1A:B68D: F0        .byte $F0
- D 1 - I - 0x03769E 1A:B68E: 2B        .byte $2B
- D 1 - I - 0x03769F 1A:B68F: 74        .byte $74
- D 1 - I - 0x0376A0 1A:B690: 71        .byte $71
- D 1 - I - 0x0376A1 1A:B691: F0        .byte $F0
- D 1 - I - 0x0376A2 1A:B692: 56        .byte $56
- D 1 - I - 0x0376A3 1A:B693: F0        .byte $F0
- D 1 - I - 0x0376A4 1A:B694: 28        .byte $28
- D 1 - I - 0x0376A5 1A:B695: 55        .byte $55
- D 1 - I - 0x0376A6 1A:B696: 27        .byte $27
- D 1 - I - 0x0376A7 1A:B697: 2C        .byte $2C
- D 1 - I - 0x0376A8 1A:B698: 5E        .byte $5E
- D 1 - I - 0x0376A9 1A:B699: 1C        .byte $1C
- D 1 - I - 0x0376AA 1A:B69A: 10        .byte $10
- D 1 - I - 0x0376AB 1A:B69B: 1E        .byte $1E
- D 1 - I - 0x0376AC 1A:B69C: 13        .byte $13
- D 1 - I - 0x0376AD 1A:B69D: 35        .byte $35
- D 1 - I - 0x0376AE 1A:B69E: 59        .byte $59
- D 1 - I - 0x0376AF 1A:B69F: 82        .byte $82
- D 1 - I - 0x0376B0 1A:B6A0: 8F        .byte $8F
- D 1 - I - 0x0376B1 1A:B6A1: 4F        .byte $4F
- D 1 - I - 0x0376B2 1A:B6A2: 74        .byte $74
- D 1 - I - 0x0376B3 1A:B6A3: F0        .byte $F0
- D 1 - I - 0x0376B4 1A:B6A4: F0        .byte $F0
- D 1 - I - 0x0376B5 1A:B6A5: F0        .byte $F0
- D 1 - I - 0x0376B6 1A:B6A6: F0        .byte $F0
- D 1 - I - 0x0376B7 1A:B6A7: F0        .byte $F0
- D 1 - I - 0x0376B8 1A:B6A8: 4B        .byte $4B
- D 1 - I - 0x0376B9 1A:B6A9: 79        .byte $79
- D 1 - I - 0x0376BA 1A:B6AA: 4B        .byte $4B
- D 1 - I - 0x0376BB 1A:B6AB: 51        .byte $51
- D 1 - I - 0x0376BC 1A:B6AC: 82        .byte $82
- D 1 - I - 0x0376BD 1A:B6AD: 28        .byte $28
- D 1 - I - 0x0376BE 1A:B6AE: 40        .byte $40
- D 1 - I - 0x0376BF 1A:B6AF: 2B        .byte $2B
- D 1 - I - 0x0376C0 1A:B6B0: 42        .byte $42
- D 1 - I - 0x0376C1 1A:B6B1: 59        .byte $59
- D 1 - I - 0x0376C2 1A:B6B2: 5A        .byte $5A
- D 1 - I - 0x0376C3 1A:B6B3: A5        .byte $A5
- D 1 - I - 0x0376C4 1A:B6B4: BE        .byte $BE
- D 1 - I - 0x0376C5 1A:B6B5: 73        .byte $73
- D 1 - I - 0x0376C6 1A:B6B6: 80        .byte $80
- D 1 - I - 0x0376C7 1A:B6B7: F0        .byte $F0
- D 1 - I - 0x0376C8 1A:B6B8: F0        .byte $F0
- D 1 - I - 0x0376C9 1A:B6B9: 9E        .byte $9E
- D 1 - I - 0x0376CA 1A:B6BA: A0        .byte $A0
- D 1 - I - 0x0376CB 1A:B6BB: 7B        .byte $7B
- D 1 - I - 0x0376CC 1A:B6BC: 71        .byte $71
- D 1 - I - 0x0376CD 1A:B6BD: 9D        .byte $9D
- D 1 - I - 0x0376CE 1A:B6BE: 6E        .byte $6E
- D 1 - I - 0x0376CF 1A:B6BF: 75        .byte $75
- D 1 - I - 0x0376D0 1A:B6C0: A6        .byte $A6
- D 1 - I - 0x0376D1 1A:B6C1: 4C        .byte $4C
- D 1 - I - 0x0376D2 1A:B6C2: 70        .byte $70
- D 1 - I - 0x0376D3 1A:B6C3: 4F        .byte $4F
- D 1 - I - 0x0376D4 1A:B6C4: 67        .byte $67
- D 1 - I - 0x0376D5 1A:B6C5: 89        .byte $89
- D 1 - I - 0x0376D6 1A:B6C6: B9        .byte $B9
- D 1 - I - 0x0376D7 1A:B6C7: ED        .byte $ED
- D 1 - I - 0x0376D8 1A:B6C8: D6        .byte $D6
- D 1 - I - 0x0376D9 1A:B6C9: 7E        .byte $7E
- D 1 - I - 0x0376DA 1A:B6CA: B0        .byte $B0
- D 1 - I - 0x0376DB 1A:B6CB: F0        .byte $F0
- D 1 - I - 0x0376DC 1A:B6CC: F0        .byte $F0
- D 1 - I - 0x0376DD 1A:B6CD: F0        .byte $F0
- D 1 - I - 0x0376DE 1A:B6CE: F0        .byte $F0
- D 1 - I - 0x0376DF 1A:B6CF: CD        .byte $CD
- D 1 - I - 0x0376E0 1A:B6D0: 9F        .byte $9F
- D 1 - I - 0x0376E1 1A:B6D1: 04        .byte $04
- D 1 - I - 0x0376E2 1A:B6D2: 04        .byte $04
- D 1 - I - 0x0376E3 1A:B6D3: F0        .byte $F0
- D 1 - I - 0x0376E4 1A:B6D4: F0        .byte $F0
- D 1 - I - 0x0376E5 1A:B6D5: 07        .byte $07
- D 1 - I - 0x0376E6 1A:B6D6: 07        .byte $07
- D 1 - I - 0x0376E7 1A:B6D7: F0        .byte $F0
- D 1 - I - 0x0376E8 1A:B6D8: F0        .byte $F0
- D 1 - I - 0x0376E9 1A:B6D9: 12        .byte $12
- D 1 - I - 0x0376EA 1A:B6DA: 12        .byte $12
- D 1 - I - 0x0376EB 1A:B6DB: 52        .byte $52
- D 1 - I - 0x0376EC 1A:B6DC: 77        .byte $77
- D 1 - I - 0x0376ED 1A:B6DD: F0        .byte $F0
- D 1 - I - 0x0376EE 1A:B6DE: 1F        .byte $1F
- D 1 - I - 0x0376EF 1A:B6DF: 72        .byte $72
- D 1 - I - 0x0376F0 1A:B6E0: 5B        .byte $5B
- D 1 - I - 0x0376F1 1A:B6E1: 34        .byte $34
- D 1 - I - 0x0376F2 1A:B6E2: 62        .byte $62
- D 1 - I - 0x0376F3 1A:B6E3: 1D        .byte $1D
- D 1 - I - 0x0376F4 1A:B6E4: 1D        .byte $1D
- D 1 - I - 0x0376F5 1A:B6E5: 1C        .byte $1C
- D 1 - I - 0x0376F6 1A:B6E6: 04        .byte $04
- D 1 - I - 0x0376F7 1A:B6E7: F0        .byte $F0
- D 1 - I - 0x0376F8 1A:B6E8: F0        .byte $F0
- D 1 - I - 0x0376F9 1A:B6E9: 06        .byte $06
- D 1 - I - 0x0376FA 1A:B6EA: 12        .byte $12
- D 1 - I - 0x0376FB 1A:B6EB: 14        .byte $14
- D 1 - I - 0x0376FC 1A:B6EC: 2F        .byte $2F
- D 1 - I - 0x0376FD 1A:B6ED: 2A        .byte $2A
- D 1 - I - 0x0376FE 1A:B6EE: 1F        .byte $1F
- D 1 - I - 0x0376FF 1A:B6EF: F0        .byte $F0
- D 1 - I - 0x037700 1A:B6F0: F0        .byte $F0
- D 1 - I - 0x037701 1A:B6F1: F0        .byte $F0
- D 1 - I - 0x037702 1A:B6F2: 38        .byte $38
- D 1 - I - 0x037703 1A:B6F3: 7F        .byte $7F
- D 1 - I - 0x037704 1A:B6F4: 83        .byte $83
- D 1 - I - 0x037705 1A:B6F5: 57        .byte $57
- D 1 - I - 0x037706 1A:B6F6: 6E        .byte $6E
- D 1 - I - 0x037707 1A:B6F7: 32        .byte $32
- D 1 - I - 0x037708 1A:B6F8: 34        .byte $34
- D 1 - I - 0x037709 1A:B6F9: 31        .byte $31
- D 1 - I - 0x03770A 1A:B6FA: 33        .byte $33
- D 1 - I - 0x03770B 1A:B6FB: 45        .byte $45
- D 1 - I - 0x03770C 1A:B6FC: 47        .byte $47
- D 1 - I - 0x03770D 1A:B6FD: 1C        .byte $1C
- D 1 - I - 0x03770E 1A:B6FE: 11        .byte $11
- D 1 - I - 0x03770F 1A:B6FF: 1F        .byte $1F
- D 1 - I - 0x037710 1A:B700: 16        .byte $16
- D 1 - I - 0x037711 1A:B701: 36        .byte $36
- D 1 - I - 0x037712 1A:B702: 4F        .byte $4F
- D 1 - I - 0x037713 1A:B703: F0        .byte $F0
- D 1 - I - 0x037714 1A:B704: F0        .byte $F0
- D 1 - I - 0x037715 1A:B705: F0        .byte $F0
- D 1 - I - 0x037716 1A:B706: 5D        .byte $5D
- D 1 - I - 0x037717 1A:B707: A1        .byte $A1
- D 1 - I - 0x037718 1A:B708: A5        .byte $A5
- D 1 - I - 0x037719 1A:B709: 6E        .byte $6E
- D 1 - I - 0x03771A 1A:B70A: 91        .byte $91
- D 1 - I - 0x03771B 1A:B70B: 4D        .byte $4D
- D 1 - I - 0x03771C 1A:B70C: 7C        .byte $7C
- D 1 - I - 0x03771D 1A:B70D: 32        .byte $32
- D 1 - I - 0x03771E 1A:B70E: 6E        .byte $6E
- D 1 - I - 0x03771F 1A:B70F: 5D        .byte $5D
- D 1 - I - 0x037720 1A:B710: 8F        .byte $8F
- D 1 - I - 0x037721 1A:B711: 40        .byte $40
- D 1 - I - 0x037722 1A:B712: 29        .byte $29
- D 1 - I - 0x037723 1A:B713: 38        .byte $38
- D 1 - I - 0x037724 1A:B714: 2E        .byte $2E
- D 1 - I - 0x037725 1A:B715: 72        .byte $72
- D 1 - I - 0x037726 1A:B716: 5B        .byte $5B
- D 1 - I - 0x037727 1A:B717: F0        .byte $F0
- D 1 - I - 0x037728 1A:B718: F0        .byte $F0
- D 1 - I - 0x037729 1A:B719: 8C        .byte $8C
- D 1 - I - 0x03772A 1A:B71A: 81        .byte $81
- D 1 - I - 0x03772B 1A:B71B: C4        .byte $C4
- D 1 - I - 0x03772C 1A:B71C: C8        .byte $C8
- D 1 - I - 0x03772D 1A:B71D: 85        .byte $85
- D 1 - I - 0x03772E 1A:B71E: B6        .byte $B6
- D 1 - I - 0x03772F 1A:B71F: 70        .byte $70
- D 1 - I - 0x037730 1A:B720: AD        .byte $AD
- D 1 - I - 0x037731 1A:B721: 91        .byte $91
- D 1 - I - 0x037732 1A:B722: 6F        .byte $6F
- D 1 - I - 0x037733 1A:B723: 75        .byte $75
- D 1 - I - 0x037734 1A:B724: 8F        .byte $8F
- D 1 - I - 0x037735 1A:B725: 4C        .byte $4C
- D 1 - I - 0x037736 1A:B726: 65        .byte $65
- D 1 - I - 0x037737 1A:B727: 5B        .byte $5B
- D 1 - I - 0x037738 1A:B728: 50        .byte $50
- D 1 - I - 0x037739 1A:B729: 7E        .byte $7E
- D 1 - I - 0x03773A 1A:B72A: BC        .byte $BC
- D 1 - I - 0x03773B 1A:B72B: F0        .byte $F0
- D 1 - I - 0x03773C 1A:B72C: F0        .byte $F0
- D 1 - I - 0x03773D 1A:B72D: F0        .byte $F0
- D 1 - I - 0x03773E 1A:B72E: F0        .byte $F0
- - - - - - 0x03773F 1A:B72F: F0        .byte $F0
- D 1 - I - 0x037740 1A:B730: E9        .byte $E9
- D 1 - I - 0x037741 1A:B731: AA        .byte $AA
- D 1 - I - 0x037742 1A:B732: D3        .byte $D3
- D 1 - I - 0x037743 1A:B733: D0        .byte $D0
- D 1 - I - 0x037744 1A:B734: A1        .byte $A1



off_B735_0A:
- D 1 - I - 0x037745 1A:B735: F0        .byte $F0
- D 1 - I - 0x037746 1A:B736: F0        .byte $F0
- D 1 - I - 0x037747 1A:B737: 07        .byte $07
- D 1 - I - 0x037748 1A:B738: 07        .byte $07
- D 1 - I - 0x037749 1A:B739: F0        .byte $F0
- D 1 - I - 0x03774A 1A:B73A: F0        .byte $F0
- D 1 - I - 0x03774B 1A:B73B: 04        .byte $04
- D 1 - I - 0x03774C 1A:B73C: 04        .byte $04
- D 1 - I - 0x03774D 1A:B73D: 11        .byte $11
- D 1 - I - 0x03774E 1A:B73E: 11        .byte $11
- D 1 - I - 0x03774F 1A:B73F: 21        .byte $21
- D 1 - I - 0x037750 1A:B740: 37        .byte $37
- D 1 - I - 0x037751 1A:B741: 1E        .byte $1E
- D 1 - I - 0x037752 1A:B742: 1E        .byte $1E
- D 1 - I - 0x037753 1A:B743: 40        .byte $40
- D 1 - I - 0x037754 1A:B744: 65        .byte $65
- D 1 - I - 0x037755 1A:B745: 1C        .byte $1C
- D 1 - I - 0x037756 1A:B746: 1C        .byte $1C
- D 1 - I - 0x037757 1A:B747: 0F        .byte $0F
- D 1 - I - 0x037758 1A:B748: 0F        .byte $0F
- D 1 - I - 0x037759 1A:B749: F0        .byte $F0
- D 1 - I - 0x03775A 1A:B74A: F0        .byte $F0
- D 1 - I - 0x03775B 1A:B74B: 06        .byte $06
- D 1 - I - 0x03775C 1A:B74C: 1F        .byte $1F
- D 1 - I - 0x03775D 1A:B74D: F0        .byte $F0
- D 1 - I - 0x03775E 1A:B74E: 0F        .byte $0F
- D 1 - I - 0x03775F 1A:B74F: 1C        .byte $1C
- D 1 - I - 0x037760 1A:B750: 05        .byte $05
- D 1 - I - 0x037761 1A:B751: F0        .byte $F0
- D 1 - I - 0x037762 1A:B752: 1B        .byte $1B
- D 1 - I - 0x037763 1A:B753: 45        .byte $45
- D 1 - I - 0x037764 1A:B754: 76        .byte $76
- D 1 - I - 0x037765 1A:B755: F0        .byte $F0
- D 1 - I - 0x037766 1A:B756: 34        .byte $34
- D 1 - I - 0x037767 1A:B757: F0        .byte $F0
- D 1 - I - 0x037768 1A:B758: F0        .byte $F0
- D 1 - I - 0x037769 1A:B759: F0        .byte $F0
- D 1 - I - 0x03776A 1A:B75A: 26        .byte $26
- D 1 - I - 0x03776B 1A:B75B: F0        .byte $F0
- D 1 - I - 0x03776C 1A:B75C: F0        .byte $F0
- D 1 - I - 0x03776D 1A:B75D: F0        .byte $F0
- D 1 - I - 0x03776E 1A:B75E: 3C        .byte $3C
- D 1 - I - 0x03776F 1A:B75F: 1F        .byte $1F
- D 1 - I - 0x037770 1A:B760: 4F        .byte $4F
- D 1 - I - 0x037771 1A:B761: 25        .byte $25
- D 1 - I - 0x037772 1A:B762: 1B        .byte $1B
- D 1 - I - 0x037773 1A:B763: 1C        .byte $1C
- D 1 - I - 0x037774 1A:B764: 1D        .byte $1D
- D 1 - I - 0x037775 1A:B765: F0        .byte $F0
- D 1 - I - 0x037776 1A:B766: 33        .byte $33
- D 1 - I - 0x037777 1A:B767: 50        .byte $50
- D 1 - I - 0x037778 1A:B768: 8E        .byte $8E
- D 1 - I - 0x037779 1A:B769: F0        .byte $F0
- D 1 - I - 0x03777A 1A:B76A: 4C        .byte $4C
- D 1 - I - 0x03777B 1A:B76B: F0        .byte $F0
- D 1 - I - 0x03777C 1A:B76C: F0        .byte $F0
- D 1 - I - 0x03777D 1A:B76D: F0        .byte $F0
- D 1 - I - 0x03777E 1A:B76E: 56        .byte $56
- D 1 - I - 0x03777F 1A:B76F: F0        .byte $F0
- D 1 - I - 0x037780 1A:B770: F0        .byte $F0
- D 1 - I - 0x037781 1A:B771: 6C        .byte $6C
- D 1 - I - 0x037782 1A:B772: 6E        .byte $6E
- D 1 - I - 0x037783 1A:B773: 42        .byte $42
- D 1 - I - 0x037784 1A:B774: 73        .byte $73
- D 1 - I - 0x037785 1A:B775: 49        .byte $49
- D 1 - I - 0x037786 1A:B776: 33        .byte $33
- D 1 - I - 0x037787 1A:B777: 29        .byte $29
- D 1 - I - 0x037788 1A:B778: 35        .byte $35
- D 1 - I - 0x037789 1A:B779: F0        .byte $F0
- D 1 - I - 0x03778A 1A:B77A: 64        .byte $64
- D 1 - I - 0x03778B 1A:B77B: 80        .byte $80
- D 1 - I - 0x03778C 1A:B77C: BD        .byte $BD
- D 1 - I - 0x03778D 1A:B77D: F0        .byte $F0
- D 1 - I - 0x03778E 1A:B77E: 95        .byte $95
- D 1 - I - 0x03778F 1A:B77F: F0        .byte $F0
- D 1 - I - 0x037790 1A:B780: F0        .byte $F0
- D 1 - I - 0x037791 1A:B781: F0        .byte $F0
- D 1 - I - 0x037792 1A:B782: F0        .byte $F0
- D 1 - I - 0x037793 1A:B783: F0        .byte $F0
- D 1 - I - 0x037794 1A:B784: 79        .byte $79
- D 1 - I - 0x037795 1A:B785: 84        .byte $84
- D 1 - I - 0x037796 1A:B786: 6E        .byte $6E
- D 1 - I - 0x037797 1A:B787: 67        .byte $67
- D 1 - I - 0x037798 1A:B788: A4        .byte $A4
- D 1 - I - 0x037799 1A:B789: 57        .byte $57
- D 1 - I - 0x03779A 1A:B78A: 4C        .byte $4C
- D 1 - I - 0x03779B 1A:B78B: 65        .byte $65
- D 1 - I - 0x03779C 1A:B78C: 4E        .byte $4E
- D 1 - I - 0x03779D 1A:B78D: F0        .byte $F0
- D 1 - I - 0x03779E 1A:B78E: 87        .byte $87
- D 1 - I - 0x03779F 1A:B78F: 81        .byte $81
- D 1 - I - 0x0377A0 1A:B790: D6        .byte $D6
- D 1 - I - 0x0377A1 1A:B791: A0        .byte $A0
- D 1 - I - 0x0377A2 1A:B792: C5        .byte $C5
- D 1 - I - 0x0377A3 1A:B793: F0        .byte $F0
- D 1 - I - 0x0377A4 1A:B794: F0        .byte $F0
- D 1 - I - 0x0377A5 1A:B795: F0        .byte $F0
- D 1 - I - 0x0377A6 1A:B796: B5        .byte $B5
- D 1 - I - 0x0377A7 1A:B797: F0        .byte $F0
- D 1 - I - 0x0377A8 1A:B798: F0        .byte $F0
- D 1 - I - 0x0377A9 1A:B799: F0        .byte $F0
- D 1 - I - 0x0377AA 1A:B79A: 04        .byte $04
- D 1 - I - 0x0377AB 1A:B79B: F0        .byte $F0
- D 1 - I - 0x0377AC 1A:B79C: 07        .byte $07
- D 1 - I - 0x0377AD 1A:B79D: F0        .byte $F0
- D 1 - I - 0x0377AE 1A:B79E: F0        .byte $F0
- D 1 - I - 0x0377AF 1A:B79F: F0        .byte $F0
- D 1 - I - 0x0377B0 1A:B7A0: F0        .byte $F0
- D 1 - I - 0x0377B1 1A:B7A1: F0        .byte $F0
- D 1 - I - 0x0377B2 1A:B7A2: F0        .byte $F0
- D 1 - I - 0x0377B3 1A:B7A3: 2D        .byte $2D
- D 1 - I - 0x0377B4 1A:B7A4: 5E        .byte $5E
- D 1 - I - 0x0377B5 1A:B7A5: F0        .byte $F0
- D 1 - I - 0x0377B6 1A:B7A6: 12        .byte $12
- D 1 - I - 0x0377B7 1A:B7A7: 4B        .byte $4B
- D 1 - I - 0x0377B8 1A:B7A8: 5B        .byte $5B
- D 1 - I - 0x0377B9 1A:B7A9: F0        .byte $F0
- D 1 - I - 0x0377BA 1A:B7AA: 28        .byte $28
- D 1 - I - 0x0377BB 1A:B7AB: F0        .byte $F0
- D 1 - I - 0x0377BC 1A:B7AC: 1D        .byte $1D
- D 1 - I - 0x0377BD 1A:B7AD: 03        .byte $03
- D 1 - I - 0x0377BE 1A:B7AE: 10        .byte $10
- D 1 - I - 0x0377BF 1A:B7AF: 08        .byte $08
- D 1 - I - 0x0377C0 1A:B7B0: 13        .byte $13
- D 1 - I - 0x0377C1 1A:B7B1: F0        .byte $F0
- D 1 - I - 0x0377C2 1A:B7B2: 05        .byte $05
- D 1 - I - 0x0377C3 1A:B7B3: F0        .byte $F0
- D 1 - I - 0x0377C4 1A:B7B4: 1E        .byte $1E
- D 1 - I - 0x0377C5 1A:B7B5: F0        .byte $F0
- D 1 - I - 0x0377C6 1A:B7B6: 35        .byte $35
- D 1 - I - 0x0377C7 1A:B7B7: F0        .byte $F0
- D 1 - I - 0x0377C8 1A:B7B8: 51        .byte $51
- D 1 - I - 0x0377C9 1A:B7B9: F0        .byte $F0
- D 1 - I - 0x0377CA 1A:B7BA: F0        .byte $F0
- D 1 - I - 0x0377CB 1A:B7BB: F0        .byte $F0
- D 1 - I - 0x0377CC 1A:B7BC: 66        .byte $66
- D 1 - I - 0x0377CD 1A:B7BD: F0        .byte $F0
- D 1 - I - 0x0377CE 1A:B7BE: 3F        .byte $3F
- D 1 - I - 0x0377CF 1A:B7BF: F0        .byte $F0
- D 1 - I - 0x0377D0 1A:B7C0: F0        .byte $F0
- D 1 - I - 0x0377D1 1A:B7C1: 55        .byte $55
- D 1 - I - 0x0377D2 1A:B7C2: 1B        .byte $1B
- D 1 - I - 0x0377D3 1A:B7C3: 2B        .byte $2B
- D 1 - I - 0x0377D4 1A:B7C4: 5E        .byte $5E
- D 1 - I - 0x0377D5 1A:B7C5: 10        .byte $10
- D 1 - I - 0x0377D6 1A:B7C6: 1D        .byte $1D
- D 1 - I - 0x0377D7 1A:B7C7: 12        .byte $12
- D 1 - I - 0x0377D8 1A:B7C8: 1E        .byte $1E
- D 1 - I - 0x0377D9 1A:B7C9: 35        .byte $35
- D 1 - I - 0x0377DA 1A:B7CA: 36        .byte $36
- D 1 - I - 0x0377DB 1A:B7CB: F0        .byte $F0
- D 1 - I - 0x0377DC 1A:B7CC: 74        .byte $74
- D 1 - I - 0x0377DD 1A:B7CD: F0        .byte $F0
- D 1 - I - 0x0377DE 1A:B7CE: 5B        .byte $5B
- D 1 - I - 0x0377DF 1A:B7CF: F0        .byte $F0
- D 1 - I - 0x0377E0 1A:B7D0: F0        .byte $F0
- D 1 - I - 0x0377E1 1A:B7D1: F0        .byte $F0
- D 1 - I - 0x0377E2 1A:B7D2: 6F        .byte $6F
- D 1 - I - 0x0377E3 1A:B7D3: F0        .byte $F0
- D 1 - I - 0x0377E4 1A:B7D4: 58        .byte $58
- D 1 - I - 0x0377E5 1A:B7D5: 79        .byte $79
- D 1 - I - 0x0377E6 1A:B7D6: 4B        .byte $4B
- D 1 - I - 0x0377E7 1A:B7D7: 50        .byte $50
- D 1 - I - 0x0377E8 1A:B7D8: 82        .byte $82
- D 1 - I - 0x0377E9 1A:B7D9: 34        .byte $34
- D 1 - I - 0x0377EA 1A:B7DA: 41        .byte $41
- D 1 - I - 0x0377EB 1A:B7DB: 42        .byte $42
- D 1 - I - 0x0377EC 1A:B7DC: 37        .byte $37
- D 1 - I - 0x0377ED 1A:B7DD: 59        .byte $59
- D 1 - I - 0x0377EE 1A:B7DE: 72        .byte $72
- D 1 - I - 0x0377EF 1A:B7DF: F0        .byte $F0
- D 1 - I - 0x0377F0 1A:B7E0: A4        .byte $A4
- D 1 - I - 0x0377F1 1A:B7E1: F0        .byte $F0
- D 1 - I - 0x0377F2 1A:B7E2: 8B        .byte $8B
- D 1 - I - 0x0377F3 1A:B7E3: F0        .byte $F0
- D 1 - I - 0x0377F4 1A:B7E4: F0        .byte $F0
- D 1 - I - 0x0377F5 1A:B7E5: F0        .byte $F0
- D 1 - I - 0x0377F6 1A:B7E6: 9F        .byte $9F
- D 1 - I - 0x0377F7 1A:B7E7: F0        .byte $F0
- D 1 - I - 0x0377F8 1A:B7E8: 7C        .byte $7C
- D 1 - I - 0x0377F9 1A:B7E9: 91        .byte $91
- D 1 - I - 0x0377FA 1A:B7EA: 63        .byte $63
- D 1 - I - 0x0377FB 1A:B7EB: 74        .byte $74
- D 1 - I - 0x0377FC 1A:B7EC: 9A        .byte $9A
- D 1 - I - 0x0377FD 1A:B7ED: 70        .byte $70
- D 1 - I - 0x0377FE 1A:B7EE: 59        .byte $59
- D 1 - I - 0x0377FF 1A:B7EF: 66        .byte $66
- D 1 - I - 0x037800 1A:B7F0: 4E        .byte $4E
- D 1 - I - 0x037801 1A:B7F1: F0        .byte $F0
- D 1 - I - 0x037802 1A:B7F2: 89        .byte $89
- D 1 - I - 0x037803 1A:B7F3: F0        .byte $F0
- D 1 - I - 0x037804 1A:B7F4: B0        .byte $B0
- D 1 - I - 0x037805 1A:B7F5: F0        .byte $F0
- D 1 - I - 0x037806 1A:B7F6: A2        .byte $A2
- D 1 - I - 0x037807 1A:B7F7: F0        .byte $F0
- D 1 - I - 0x037808 1A:B7F8: F0        .byte $F0
- D 1 - I - 0x037809 1A:B7F9: F0        .byte $F0
- D 1 - I - 0x03780A 1A:B7FA: F0        .byte $F0
- D 1 - I - 0x03780B 1A:B7FB: F0        .byte $F0
- D 1 - I - 0x03780C 1A:B7FC: 9F        .byte $9F
- D 1 - I - 0x03780D 1A:B7FD: 04        .byte $04
- D 1 - I - 0x03780E 1A:B7FE: 04        .byte $04
- D 1 - I - 0x03780F 1A:B7FF: F0        .byte $F0
- D 1 - I - 0x037810 1A:B800: F0        .byte $F0
- D 1 - I - 0x037811 1A:B801: 07        .byte $07
- D 1 - I - 0x037812 1A:B802: 07        .byte $07
- D 1 - I - 0x037813 1A:B803: F0        .byte $F0
- D 1 - I - 0x037814 1A:B804: F0        .byte $F0
- D 1 - I - 0x037815 1A:B805: 12        .byte $12
- D 1 - I - 0x037816 1A:B806: 12        .byte $12
- D 1 - I - 0x037817 1A:B807: F0        .byte $F0
- D 1 - I - 0x037818 1A:B808: F0        .byte $F0
- D 1 - I - 0x037819 1A:B809: F0        .byte $F0
- D 1 - I - 0x03781A 1A:B80A: 1F        .byte $1F
- D 1 - I - 0x03781B 1A:B80B: 33        .byte $33
- D 1 - I - 0x03781C 1A:B80C: 65        .byte $65
- D 1 - I - 0x03781D 1A:B80D: 29        .byte $29
- D 1 - I - 0x03781E 1A:B80E: 2A        .byte $2A
- D 1 - I - 0x03781F 1A:B80F: 1D        .byte $1D
- D 1 - I - 0x037820 1A:B810: 1D        .byte $1D
- D 1 - I - 0x037821 1A:B811: 1C        .byte $1C
- D 1 - I - 0x037822 1A:B812: 05        .byte $05
- D 1 - I - 0x037823 1A:B813: F0        .byte $F0
- D 1 - I - 0x037824 1A:B814: F0        .byte $F0
- D 1 - I - 0x037825 1A:B815: 06        .byte $06
- D 1 - I - 0x037826 1A:B816: 12        .byte $12
- D 1 - I - 0x037827 1A:B817: F0        .byte $F0
- D 1 - I - 0x037828 1A:B818: 14        .byte $14
- D 1 - I - 0x037829 1A:B819: F0        .byte $F0
- D 1 - I - 0x03782A 1A:B81A: 1F        .byte $1F
- D 1 - I - 0x03782B 1A:B81B: F0        .byte $F0
- D 1 - I - 0x03782C 1A:B81C: F0        .byte $F0
- D 1 - I - 0x03782D 1A:B81D: F0        .byte $F0
- D 1 - I - 0x03782E 1A:B81E: 38        .byte $38
- D 1 - I - 0x03782F 1A:B81F: F0        .byte $F0
- D 1 - I - 0x037830 1A:B820: F0        .byte $F0
- D 1 - I - 0x037831 1A:B821: 41        .byte $41
- D 1 - I - 0x037832 1A:B822: 64        .byte $64
- D 1 - I - 0x037833 1A:B823: F0        .byte $F0
- D 1 - I - 0x037834 1A:B824: 2A        .byte $2A
- D 1 - I - 0x037835 1A:B825: 28        .byte $28
- D 1 - I - 0x037836 1A:B826: 57        .byte $57
- D 1 - I - 0x037837 1A:B827: F0        .byte $F0
- D 1 - I - 0x037838 1A:B828: 47        .byte $47
- D 1 - I - 0x037839 1A:B829: 1D        .byte $1D
- D 1 - I - 0x03783A 1A:B82A: 2A        .byte $2A
- D 1 - I - 0x03783B 1A:B82B: 1F        .byte $1F
- D 1 - I - 0x03783C 1A:B82C: 2D        .byte $2D
- D 1 - I - 0x03783D 1A:B82D: F0        .byte $F0
- D 1 - I - 0x03783E 1A:B82E: 4F        .byte $4F
- D 1 - I - 0x03783F 1A:B82F: F0        .byte $F0
- D 1 - I - 0x037840 1A:B830: F0        .byte $F0
- D 1 - I - 0x037841 1A:B831: F0        .byte $F0
- D 1 - I - 0x037842 1A:B832: F0        .byte $F0
- D 1 - I - 0x037843 1A:B833: F0        .byte $F0
- D 1 - I - 0x037844 1A:B834: F0        .byte $F0
- D 1 - I - 0x037845 1A:B835: F0        .byte $F0
- D 1 - I - 0x037846 1A:B836: 7F        .byte $7F
- D 1 - I - 0x037847 1A:B837: F0        .byte $F0
- D 1 - I - 0x037848 1A:B838: 4D        .byte $4D
- D 1 - I - 0x037849 1A:B839: 3F        .byte $3F
- D 1 - I - 0x03784A 1A:B83A: 6F        .byte $6F
- D 1 - I - 0x03784B 1A:B83B: 5D        .byte $5D
- D 1 - I - 0x03784C 1A:B83C: 8F        .byte $8F
- D 1 - I - 0x03784D 1A:B83D: 4C        .byte $4C
- D 1 - I - 0x03784E 1A:B83E: 35        .byte $35
- D 1 - I - 0x03784F 1A:B83F: 42        .byte $42
- D 1 - I - 0x037850 1A:B840: 39        .byte $39
- D 1 - I - 0x037851 1A:B841: F0        .byte $F0
- D 1 - I - 0x037852 1A:B842: 67        .byte $67
- D 1 - I - 0x037853 1A:B843: F0        .byte $F0
- D 1 - I - 0x037854 1A:B844: F0        .byte $F0
- D 1 - I - 0x037855 1A:B845: F0        .byte $F0
- D 1 - I - 0x037856 1A:B846: 6A        .byte $6A
- D 1 - I - 0x037857 1A:B847: F0        .byte $F0
- D 1 - I - 0x037858 1A:B848: F0        .byte $F0
- D 1 - I - 0x037859 1A:B849: F0        .byte $F0
- D 1 - I - 0x03785A 1A:B84A: AF        .byte $AF
- D 1 - I - 0x03785B 1A:B84B: F0        .byte $F0
- D 1 - I - 0x03785C 1A:B84C: 8A        .byte $8A
- - - - - - 0x03785D 1A:B84D: 63        .byte $63
- - - - - - 0x03785E 1A:B84E: 87        .byte $87
- - - - - - 0x03785F 1A:B84F: 75        .byte $75
- - - - - - 0x037860 1A:B850: 8F        .byte $8F
- - - - - - 0x037861 1A:B851: 4C        .byte $4C
- - - - - - 0x037862 1A:B852: 65        .byte $65
- - - - - - 0x037863 1A:B853: 5A        .byte $5A
- - - - - - 0x037864 1A:B854: 50        .byte $50
- - - - - - 0x037865 1A:B855: 7E        .byte $7E
- - - - - - 0x037866 1A:B856: 97        .byte $97
- - - - - - 0x037867 1A:B857: F0        .byte $F0
- - - - - - 0x037868 1A:B858: F0        .byte $F0
- - - - - - 0x037869 1A:B859: F0        .byte $F0
- - - - - - 0x03786A 1A:B85A: 9A        .byte $9A
- - - - - - 0x03786B 1A:B85B: F0        .byte $F0
- - - - - - 0x03786C 1A:B85C: F0        .byte $F0
- - - - - - 0x03786D 1A:B85D: AA        .byte $AA
- - - - - - 0x03786E 1A:B85E: D3        .byte $D3
- - - - - - 0x03786F 1A:B85F: F0        .byte $F0
- - - - - - 0x037870 1A:B860: AE        .byte $AE



off_B861_0B:
- D 1 - I - 0x037871 1A:B861: F0        .byte $F0
- D 1 - I - 0x037872 1A:B862: F0        .byte $F0
- D 1 - I - 0x037873 1A:B863: 07        .byte $07
- D 1 - I - 0x037874 1A:B864: 07        .byte $07
- D 1 - I - 0x037875 1A:B865: F0        .byte $F0
- D 1 - I - 0x037876 1A:B866: F0        .byte $F0
- D 1 - I - 0x037877 1A:B867: 04        .byte $04
- D 1 - I - 0x037878 1A:B868: 04        .byte $04
- D 1 - I - 0x037879 1A:B869: 11        .byte $11
- D 1 - I - 0x03787A 1A:B86A: 11        .byte $11
- D 1 - I - 0x03787B 1A:B86B: 69        .byte $69
- D 1 - I - 0x03787C 1A:B86C: 3A        .byte $3A
- D 1 - I - 0x03787D 1A:B86D: 1E        .byte $1E
- D 1 - I - 0x03787E 1A:B86E: 1E        .byte $1E
- D 1 - I - 0x03787F 1A:B86F: 49        .byte $49
- D 1 - I - 0x037880 1A:B870: 71        .byte $71
- D 1 - I - 0x037881 1A:B871: 1C        .byte $1C
- D 1 - I - 0x037882 1A:B872: 1C        .byte $1C
- D 1 - I - 0x037883 1A:B873: F0        .byte $F0
- D 1 - I - 0x037884 1A:B874: 0F        .byte $0F
- D 1 - I - 0x037885 1A:B875: F0        .byte $F0
- D 1 - I - 0x037886 1A:B876: 24        .byte $24
- D 1 - I - 0x037887 1A:B877: 07        .byte $07
- D 1 - I - 0x037888 1A:B878: 1F        .byte $1F
- D 1 - I - 0x037889 1A:B879: 0F        .byte $0F
- D 1 - I - 0x03788A 1A:B87A: 1B        .byte $1B
- D 1 - I - 0x03788B 1A:B87B: 05        .byte $05
- D 1 - I - 0x03788C 1A:B87C: 05        .byte $05
- D 1 - I - 0x03788D 1A:B87D: F0        .byte $F0
- D 1 - I - 0x03788E 1A:B87E: 1C        .byte $1C
- D 1 - I - 0x03788F 1A:B87F: 76        .byte $76
- D 1 - I - 0x037890 1A:B880: 46        .byte $46
- D 1 - I - 0x037891 1A:B881: 29        .byte $29
- D 1 - I - 0x037892 1A:B882: 36        .byte $36
- D 1 - I - 0x037893 1A:B883: 7C        .byte $7C
- D 1 - I - 0x037894 1A:B884: 7E        .byte $7E
- D 1 - I - 0x037895 1A:B885: F0        .byte $F0
- D 1 - I - 0x037896 1A:B886: F0        .byte $F0
- D 1 - I - 0x037897 1A:B887: F0        .byte $F0
- D 1 - I - 0x037898 1A:B888: F0        .byte $F0
- D 1 - I - 0x037899 1A:B889: 3C        .byte $3C
- D 1 - I - 0x03789A 1A:B88A: 25        .byte $25
- D 1 - I - 0x03789B 1A:B88B: 1F        .byte $1F
- D 1 - I - 0x03789C 1A:B88C: 39        .byte $39
- D 1 - I - 0x03789D 1A:B88D: 1B        .byte $1B
- D 1 - I - 0x03789E 1A:B88E: 10        .byte $10
- D 1 - I - 0x03789F 1A:B88F: 1D        .byte $1D
- D 1 - I - 0x0378A0 1A:B890: 12        .byte $12
- D 1 - I - 0x0378A1 1A:B891: 57        .byte $57
- D 1 - I - 0x0378A2 1A:B892: 34        .byte $34
- D 1 - I - 0x0378A3 1A:B893: 5D        .byte $5D
- D 1 - I - 0x0378A4 1A:B894: 9B        .byte $9B
- D 1 - I - 0x0378A5 1A:B895: 36        .byte $36
- D 1 - I - 0x0378A6 1A:B896: 4F        .byte $4F
- D 1 - I - 0x0378A7 1A:B897: 9E        .byte $9E
- D 1 - I - 0x0378A8 1A:B898: A2        .byte $A2
- D 1 - I - 0x0378A9 1A:B899: F0        .byte $F0
- D 1 - I - 0x0378AA 1A:B89A: F0        .byte $F0
- D 1 - I - 0x0378AB 1A:B89B: F0        .byte $F0
- D 1 - I - 0x0378AC 1A:B89C: 3E        .byte $3E
- D 1 - I - 0x0378AD 1A:B89D: 30        .byte $30
- D 1 - I - 0x0378AE 1A:B89E: 49        .byte $49
- D 1 - I - 0x0378AF 1A:B89F: 2B        .byte $2B
- D 1 - I - 0x0378B0 1A:B8A0: 51        .byte $51
- D 1 - I - 0x0378B1 1A:B8A1: 32        .byte $32
- D 1 - I - 0x0378B2 1A:B8A2: 28        .byte $28
- D 1 - I - 0x0378B3 1A:B8A3: 1E        .byte $1E
- D 1 - I - 0x0378B4 1A:B8A4: 42        .byte $42
- D 1 - I - 0x0378B5 1A:B8A5: 57        .byte $57
- D 1 - I - 0x0378B6 1A:B8A6: 40        .byte $40
- D 1 - I - 0x0378B7 1A:B8A7: 99        .byte $99
- D 1 - I - 0x0378B8 1A:B8A8: BE        .byte $BE
- D 1 - I - 0x0378B9 1A:B8A9: 59        .byte $59
- D 1 - I - 0x0378BA 1A:B8AA: 7F        .byte $7F
- D 1 - I - 0x0378BB 1A:B8AB: C3        .byte $C3
- D 1 - I - 0x0378BC 1A:B8AC: C7        .byte $C7
- D 1 - I - 0x0378BD 1A:B8AD: F0        .byte $F0
- D 1 - I - 0x0378BE 1A:B8AE: 6E        .byte $6E
- D 1 - I - 0x0378BF 1A:B8AF: F0        .byte $F0
- D 1 - I - 0x0378C0 1A:B8B0: F0        .byte $F0
- D 1 - I - 0x0378C1 1A:B8B1: 6C        .byte $6C
- - - - - - 0x0378C2 1A:B8B2: 55        .byte $55
- D 1 - I - 0x0378C3 1A:B8B3: 5D        .byte $5D
- - - - - - 0x0378C4 1A:B8B4: 82        .byte $82
- D 1 - I - 0x0378C5 1A:B8B5: 3E        .byte $3E
- - - - - - 0x0378C6 1A:B8B6: 57        .byte $57
- - - - - - 0x0378C7 1A:B8B7: 59        .byte $59
- D 1 - I - 0x0378C8 1A:B8B8: 4F        .byte $4F
- D 1 - I - 0x0378C9 1A:B8B9: 9F        .byte $9F
- - - - - - 0x0378CA 1A:B8BA: 70        .byte $70
- D 1 - I - 0x0378CB 1A:B8BB: A6        .byte $A6
- - - - - - 0x0378CC 1A:B8BC: D6        .byte $D6
- - - - - - 0x0378CD 1A:B8BD: 7E        .byte $7E
- D 1 - I - 0x0378CE 1A:B8BE: 98        .byte $98
- - - - - - 0x0378CF 1A:B8BF: F0        .byte $F0
- D 1 - I - 0x0378D0 1A:B8C0: DC        .byte $DC
- - - - - - 0x0378D1 1A:B8C1: F0        .byte $F0
- D 1 - I - 0x0378D2 1A:B8C2: F0        .byte $F0
- D 1 - I - 0x0378D3 1A:B8C3: 91        .byte $91
- - - - - - 0x0378D4 1A:B8C4: 7A        .byte $7A
- D 1 - I - 0x0378D5 1A:B8C5: F0        .byte $F0
- D 1 - I - 0x0378D6 1A:B8C6: 69        .byte $69
- D 1 - I - 0x0378D7 1A:B8C7: F0        .byte $F0
- D 1 - I - 0x0378D8 1A:B8C8: 69        .byte $69
- D 1 - I - 0x0378D9 1A:B8C9: F0        .byte $F0
- D 1 - I - 0x0378DA 1A:B8CA: F0        .byte $F0
- D 1 - I - 0x0378DB 1A:B8CB: F0        .byte $F0
- D 1 - I - 0x0378DC 1A:B8CC: F0        .byte $F0
- D 1 - I - 0x0378DD 1A:B8CD: F0        .byte $F0
- D 1 - I - 0x0378DE 1A:B8CE: F0        .byte $F0
- D 1 - I - 0x0378DF 1A:B8CF: 51        .byte $51
- D 1 - I - 0x0378E0 1A:B8D0: 6B        .byte $6B
- D 1 - I - 0x0378E1 1A:B8D1: F0        .byte $F0
- D 1 - I - 0x0378E2 1A:B8D2: 12        .byte $12
- D 1 - I - 0x0378E3 1A:B8D3: 6F        .byte $6F
- D 1 - I - 0x0378E4 1A:B8D4: 74        .byte $74
- D 1 - I - 0x0378E5 1A:B8D5: F0        .byte $F0
- D 1 - I - 0x0378E6 1A:B8D6: 3F        .byte $3F
- D 1 - I - 0x0378E7 1A:B8D7: F0        .byte $F0
- D 1 - I - 0x0378E8 1A:B8D8: 1D        .byte $1D
- D 1 - I - 0x0378E9 1A:B8D9: 03        .byte $03
- D 1 - I - 0x0378EA 1A:B8DA: 10        .byte $10
- D 1 - I - 0x0378EB 1A:B8DB: 08        .byte $08
- D 1 - I - 0x0378EC 1A:B8DC: 13        .byte $13
- D 1 - I - 0x0378ED 1A:B8DD: F0        .byte $F0
- D 1 - I - 0x0378EE 1A:B8DE: 05        .byte $05
- D 1 - I - 0x0378EF 1A:B8DF: F0        .byte $F0
- D 1 - I - 0x0378F0 1A:B8E0: 1E        .byte $1E
- D 1 - I - 0x0378F1 1A:B8E1: F0        .byte $F0
- D 1 - I - 0x0378F2 1A:B8E2: F0        .byte $F0
- D 1 - I - 0x0378F3 1A:B8E3: 51        .byte $51
- D 1 - I - 0x0378F4 1A:B8E4: 6B        .byte $6B
- D 1 - I - 0x0378F5 1A:B8E5: F0        .byte $F0
- D 1 - I - 0x0378F6 1A:B8E6: 2B        .byte $2B
- D 1 - I - 0x0378F7 1A:B8E7: 6F        .byte $6F
- D 1 - I - 0x0378F8 1A:B8E8: 74        .byte $74
- D 1 - I - 0x0378F9 1A:B8E9: F0        .byte $F0
- D 1 - I - 0x0378FA 1A:B8EA: 3F        .byte $3F
- D 1 - I - 0x0378FB 1A:B8EB: F0        .byte $F0
- D 1 - I - 0x0378FC 1A:B8EC: 28        .byte $28
- D 1 - I - 0x0378FD 1A:B8ED: 55        .byte $55
- D 1 - I - 0x0378FE 1A:B8EE: 0F        .byte $0F
- D 1 - I - 0x0378FF 1A:B8EF: 14        .byte $14
- D 1 - I - 0x037900 1A:B8F0: 5E        .byte $5E
- D 1 - I - 0x037901 1A:B8F1: 05        .byte $05
- D 1 - I - 0x037902 1A:B8F2: 1D        .byte $1D
- D 1 - I - 0x037903 1A:B8F3: 06        .byte $06
- D 1 - I - 0x037904 1A:B8F4: 12        .byte $12
- D 1 - I - 0x037905 1A:B8F5: 35        .byte $35
- D 1 - I - 0x037906 1A:B8F6: 36        .byte $36
- D 1 - I - 0x037907 1A:B8F7: 39        .byte $39
- D 1 - I - 0x037908 1A:B8F8: 69        .byte $69
- D 1 - I - 0x037909 1A:B8F9: 2B        .byte $2B
- D 1 - I - 0x03790A 1A:B8FA: 4F        .byte $4F
- D 1 - I - 0x03790B 1A:B8FB: F0        .byte $F0
- D 1 - I - 0x03790C 1A:B8FC: F0        .byte $F0
- D 1 - I - 0x03790D 1A:B8FD: F0        .byte $F0
- D 1 - I - 0x03790E 1A:B8FE: F0        .byte $F0
- D 1 - I - 0x03790F 1A:B8FF: F0        .byte $F0
- D 1 - I - 0x037910 1A:B900: 4B        .byte $4B
- D 1 - I - 0x037911 1A:B901: 61        .byte $61
- D 1 - I - 0x037912 1A:B902: 31        .byte $31
- D 1 - I - 0x037913 1A:B903: 39        .byte $39
- D 1 - I - 0x037914 1A:B904: 6A        .byte $6A
- D 1 - I - 0x037915 1A:B905: 29        .byte $29
- D 1 - I - 0x037916 1A:B906: 34        .byte $34
- D 1 - I - 0x037917 1A:B907: 2A        .byte $2A
- D 1 - I - 0x037918 1A:B908: 37        .byte $37
- D 1 - I - 0x037919 1A:B909: 4B        .byte $4B
- D 1 - I - 0x03791A 1A:B90A: 50        .byte $50
- D 1 - I - 0x03791B 1A:B90B: A5        .byte $A5
- D 1 - I - 0x03791C 1A:B90C: CA        .byte $CA
- D 1 - I - 0x03791D 1A:B90D: 66        .byte $66
- D 1 - I - 0x03791E 1A:B90E: 80        .byte $80
- D 1 - I - 0x03791F 1A:B90F: F0        .byte $F0
- D 1 - I - 0x037920 1A:B910: F0        .byte $F0
- D 1 - I - 0x037921 1A:B911: 9E        .byte $9E
- D 1 - I - 0x037922 1A:B912: 95        .byte $95
- D 1 - I - 0x037923 1A:B913: 7B        .byte $7B
- D 1 - I - 0x037924 1A:B914: 59        .byte $59
- D 1 - I - 0x037925 1A:B915: 79        .byte $79
- D 1 - I - 0x037926 1A:B916: 56        .byte $56
- D 1 - I - 0x037927 1A:B917: 5D        .byte $5D
- D 1 - I - 0x037928 1A:B918: 82        .byte $82
- D 1 - I - 0x037929 1A:B919: 4C        .byte $4C
- D 1 - I - 0x03792A 1A:B91A: 41        .byte $41
- D 1 - I - 0x03792B 1A:B91B: 5A        .byte $5A
- D 1 - I - 0x03792C 1A:B91C: 4F        .byte $4F
- D 1 - I - 0x03792D 1A:B91D: 71        .byte $71
- D 1 - I - 0x03792E 1A:B91E: 8B        .byte $8B
- D 1 - I - 0x03792F 1A:B91F: B0        .byte $B0
- D 1 - I - 0x037930 1A:B920: D6        .byte $D6
- D 1 - I - 0x037931 1A:B921: 74        .byte $74
- D 1 - I - 0x037932 1A:B922: 99        .byte $99
- D 1 - I - 0x037933 1A:B923: F0        .byte $F0
- D 1 - I - 0x037934 1A:B924: F0        .byte $F0
- D 1 - I - 0x037935 1A:B925: F0        .byte $F0
- D 1 - I - 0x037936 1A:B926: B6        .byte $B6
- D 1 - I - 0x037937 1A:B927: 9D        .byte $9D
- D 1 - I - 0x037938 1A:B928: 7C        .byte $7C
- D 1 - I - 0x037939 1A:B929: 04        .byte $04
- D 1 - I - 0x03793A 1A:B92A: 04        .byte $04
- D 1 - I - 0x03793B 1A:B92B: F0        .byte $F0
- D 1 - I - 0x03793C 1A:B92C: F0        .byte $F0
- D 1 - I - 0x03793D 1A:B92D: 07        .byte $07
- D 1 - I - 0x03793E 1A:B92E: 07        .byte $07
- D 1 - I - 0x03793F 1A:B92F: F0        .byte $F0
- D 1 - I - 0x037940 1A:B930: F0        .byte $F0
- D 1 - I - 0x037941 1A:B931: 12        .byte $12
- D 1 - I - 0x037942 1A:B932: 12        .byte $12
- D 1 - I - 0x037943 1A:B933: 52        .byte $52
- D 1 - I - 0x037944 1A:B934: 77        .byte $77
- D 1 - I - 0x037945 1A:B935: F0        .byte $F0
- D 1 - I - 0x037946 1A:B936: 14        .byte $14
- D 1 - I - 0x037947 1A:B937: 72        .byte $72
- D 1 - I - 0x037948 1A:B938: 5B        .byte $5B
- D 1 - I - 0x037949 1A:B939: 63        .byte $63
- D 1 - I - 0x03794A 1A:B93A: 1D        .byte $1D
- D 1 - I - 0x03794B 1A:B93B: 1F        .byte $1F
- D 1 - I - 0x03794C 1A:B93C: 1F        .byte $1F
- D 1 - I - 0x03794D 1A:B93D: 04        .byte $04
- D 1 - I - 0x03794E 1A:B93E: 1C        .byte $1C
- D 1 - I - 0x03794F 1A:B93F: F0        .byte $F0
- D 1 - I - 0x037950 1A:B940: 2F        .byte $2F
- D 1 - I - 0x037951 1A:B941: 06        .byte $06
- D 1 - I - 0x037952 1A:B942: 06        .byte $06
- D 1 - I - 0x037953 1A:B943: 20        .byte $20
- D 1 - I - 0x037954 1A:B944: 14        .byte $14
- D 1 - I - 0x037955 1A:B945: F0        .byte $F0
- D 1 - I - 0x037956 1A:B946: 2B        .byte $2B
- D 1 - I - 0x037957 1A:B947: F0        .byte $F0
- D 1 - I - 0x037958 1A:B948: F0        .byte $F0
- D 1 - I - 0x037959 1A:B949: F0        .byte $F0
- D 1 - I - 0x03795A 1A:B94A: F0        .byte $F0
- D 1 - I - 0x03795B 1A:B94B: 72        .byte $72
- D 1 - I - 0x03795C 1A:B94C: 76        .byte $76
- D 1 - I - 0x03795D 1A:B94D: 6E        .byte $6E
- D 1 - I - 0x03795E 1A:B94E: 58        .byte $58
- D 1 - I - 0x03795F 1A:B94F: 34        .byte $34
- D 1 - I - 0x037960 1A:B950: 1D        .byte $1D
- D 1 - I - 0x037961 1A:B951: 32        .byte $32
- D 1 - I - 0x037962 1A:B952: 1C        .byte $1C
- D 1 - I - 0x037963 1A:B953: 2E        .byte $2E
- D 1 - I - 0x037964 1A:B954: 47        .byte $47
- D 1 - I - 0x037965 1A:B955: 11        .byte $11
- D 1 - I - 0x037966 1A:B956: 1E        .byte $1E
- D 1 - I - 0x037967 1A:B957: 13        .byte $13
- D 1 - I - 0x037968 1A:B958: 20        .byte $20
- D 1 - I - 0x037969 1A:B959: 37        .byte $37
- D 1 - I - 0x03796A 1A:B95A: 5C        .byte $5C
- D 1 - I - 0x03796B 1A:B95B: F0        .byte $F0
- D 1 - I - 0x03796C 1A:B95C: F0        .byte $F0
- D 1 - I - 0x03796D 1A:B95D: F0        .byte $F0
- D 1 - I - 0x03796E 1A:B95E: 45        .byte $45
- D 1 - I - 0x03796F 1A:B95F: 95        .byte $95
- D 1 - I - 0x037970 1A:B960: 8B        .byte $8B
- D 1 - I - 0x037971 1A:B961: 7A        .byte $7A
- D 1 - I - 0x037972 1A:B962: 57        .byte $57
- D 1 - I - 0x037973 1A:B963: 35        .byte $35
- D 1 - I - 0x037974 1A:B964: 59        .byte $59
- D 1 - I - 0x037975 1A:B965: 28        .byte $28
- D 1 - I - 0x037976 1A:B966: 4A        .byte $4A
- D 1 - I - 0x037977 1A:B967: 52        .byte $52
- D 1 - I - 0x037978 1A:B968: 3B        .byte $3B
- D 1 - I - 0x037979 1A:B969: 1D        .byte $1D
- D 1 - I - 0x03797A 1A:B96A: 41        .byte $41
- D 1 - I - 0x03797B 1A:B96B: 2B        .byte $2B
- D 1 - I - 0x03797C 1A:B96C: 39        .byte $39
- D 1 - I - 0x03797D 1A:B96D: 67        .byte $67
- D 1 - I - 0x03797E 1A:B96E: 43        .byte $43
- D 1 - I - 0x03797F 1A:B96F: F0        .byte $F0
- D 1 - I - 0x037980 1A:B970: F0        .byte $F0
- D 1 - I - 0x037981 1A:B971: F0        .byte $F0
- D 1 - I - 0x037982 1A:B972: 81        .byte $81
- D 1 - I - 0x037983 1A:B973: BB        .byte $BB
- D 1 - I - 0x037984 1A:B974: BB        .byte $BB
- D 1 - I - 0x037985 1A:B975: 9F        .byte $9F
- D 1 - I - 0x037986 1A:B976: A1        .byte $A1
- D 1 - I - 0x037987 1A:B977: 59        .byte $59
- D 1 - I - 0x037988 1A:B978: 7B        .byte $7B
- D 1 - I - 0x037989 1A:B979: 79        .byte $79
- D 1 - I - 0x03798A 1A:B97A: 56        .byte $56
- D 1 - I - 0x03798B 1A:B97B: 5E        .byte $5E
- D 1 - I - 0x03798C 1A:B97C: 77        .byte $77
- D 1 - I - 0x03798D 1A:B97D: 4C        .byte $4C
- D 1 - I - 0x03798E 1A:B97E: 5A        .byte $5A
- D 1 - I - 0x03798F 1A:B97F: 5C        .byte $5C
- D 1 - I - 0x037990 1A:B980: 45        .byte $45
- D 1 - I - 0x037991 1A:B981: 73        .byte $73
- D 1 - I - 0x037992 1A:B982: A4        .byte $A4
- D 1 - I - 0x037993 1A:B983: F0        .byte $F0
- D 1 - I - 0x037994 1A:B984: F0        .byte $F0
- D 1 - I - 0x037995 1A:B985: 81        .byte $81
- D 1 - I - 0x037996 1A:B986: 9A        .byte $9A
- D 1 - I - 0x037997 1A:B987: F0        .byte $F0
- D 1 - I - 0x037998 1A:B988: DF        .byte $DF
- D 1 - I - 0x037999 1A:B989: C4        .byte $C4
- - - - - - 0x03799A 1A:B98A: 96        .byte $96
- D 1 - I - 0x03799B 1A:B98B: 93        .byte $93
- D 1 - I - 0x03799C 1A:B98C: 7D        .byte $7D
- - - - - - 0x03799D 1A:B98D: FF        .byte $FF



.out .sprintf("Free bytes in bank 1A: %04X [%d]", ($C000 - *), ($C000 - *))
