.segment "BANK_9A"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000  ; for listing file
; 0x034010-0x03800F



.export loc_0x03404C
.export loc_0x034137
.export loc_0x034508
.export sub_0x0345BC
.export loc_0x034706
.export sub_0x0347F1
.export loc_0x034845
.export sub_0x03489D
.export loc_0x0348B8
.export loc_0x034903
.export sub_0x034B5A
.export loc_0x034BF5
.export sub_0x034CB4
.export sub_0x034E96_катсцена_драйв_оверхеда
.export sub_0x034F82
.export sub_0x03505E
.export sub_0x0355F1_вычисление_счета_пенальти
.export sub_0x036113
.export sub_0x0361FB_отрисовка_чарли_на_фоне



loc_0x03404C:
C D 0 - - - 0x03404C 1A:803C: A9 00     LDA #$00
C - - - - - 0x03404E 1A:803E: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034051 1A:8041: 8D 21 06  STA ram_0621
C - - - - - 0x034054 1A:8044: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034057 1A:8047: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x034059 1A:8049: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03405C 1A:804C: 20 72 8F  JSR sub_8F72
C - - - - - 0x03405F 1A:804F: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034062 1A:8052: D0 06     BNE bra_805A_защитники_есть
C - - - - - 0x034064 1A:8054: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x034067 1A:8057: 4C 27 81  JMP loc_8127_никто_не_напал_на_игрока
bra_805A_защитники_есть:
C - - - - - 0x03406A 1A:805A: 20 23 82  JSR sub_8223_блок_ишизаки_будет_последним_защитным_действием
C - - - - - 0x03406D 1A:805D: A9 00     LDA #$00
C - - - - - 0x03406F 1A:805F: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034072 1A:8062: AD E2 00  LDA ram_random + $01
C - - - - - 0x034075 1A:8065: 29 07     AND #$07
bra_8067_loop:
C - - - - - 0x034077 1A:8067: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x03407A 1A:806A: 90 05     BCC bra_8071
C - - - - - 0x03407C 1A:806C: ED 00 06  SBC ram_колво_защитников
C - - - - - 0x03407F 1A:806F: B0 F6     BCS bra_8067_loop
bra_8071:
C - - - - - 0x034081 1A:8071: 8D 17 06  STA ram_колво_активных_защитников
loc_8074:
C D 0 - - - 0x034084 1A:8074: AE 17 06  LDX ram_колво_активных_защитников
C - - - - - 0x034087 1A:8077: 30 08     BMI bra_8081
C - - - - - 0x034089 1A:8079: EC 16 06  CPX ram_индекс_защитника
C - - - - - 0x03408C 1A:807C: D0 03     BNE bra_8081
C - - - - - 0x03408E 1A:807E: 20 76 81  JSR sub_8176
bra_8081:
C - - - - - 0x034091 1A:8081: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034094 1A:8084: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034097 1A:8087: C9 06     CMP #$06
C - - - - - 0x034099 1A:8089: D0 03     BNE bra_808E
C - - - - - 0x03409B 1A:808B: 4C DC 80  JMP loc_80DC
bra_808E:
C - - - - - 0x03409E 1A:808E: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0340A1 1A:8091: BC 06 06  LDY ram_подтип_действия_защитника,X
C - - - - - 0x0340A4 1A:8094: 8C 3E 04  STY ram_подтип_действия_защиты
C - - - - - 0x0340A7 1A:8097: C9 00     CMP #$00
C - - - - - 0x0340A9 1A:8099: D0 10     BNE bra_80AB
C - - - - - 0x0340AB 1A:809B: C0 01     CPY #$01
C - - - - - 0x0340AD 1A:809D: D0 0C     BNE bra_80AB
C - - - - - 0x0340AF 1A:809F: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0340B4 1A:80A4: F0 05     BEQ bra_80AB
C - - - - - 0x0340B6 1A:80A6: A9 00     LDA #$00
C - - - - - 0x0340B8 1A:80A8: 8D 3E 04  STA ram_подтип_действия_защиты
bra_80AB:
C - - - - - 0x0340BB 1A:80AB: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0340BE 1A:80AE: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0340C1 1A:80B1: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x0340C3 1A:80B3: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x0340C6 1A:80B6: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x0340C9 1A:80B9: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0340CC 1A:80BC: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0340CF 1A:80BF: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0340D2 1A:80C2: AD 3B 04  LDA ram_действие_атаки
; * 04
C - - - - - 0x0340D5 1A:80C5: 0A        ASL
C - - - - - 0x0340D6 1A:80C6: 0A        ASL
C - - - - - 0x0340D7 1A:80C7: 6D 3D 04  ADC ram_действие_защиты
C - - - - - 0x0340DA 1A:80CA: AA        TAX
C - - - - - 0x0340DB 1A:80CB: 0A        ASL
C - - - - - 0x0340DC 1A:80CC: 85 3B     STA ram_003B_t10
C - - - - - 0x0340DE 1A:80CE: A9 00     LDA #$00
C - - - - - 0x0340E0 1A:80D0: BC 7C 82  LDY tbl_827C,X
C - - - - - 0x0340E3 1A:80D3: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x0340E6 1A:80D6: 20 32 81  JSR sub_8132
C - - - - - 0x0340E9 1A:80D9: 20 4C 81  JSR sub_814C
loc_80DC:
C D 0 - - - 0x0340EC 1A:80DC: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0340EF 1A:80DF: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0340F2 1A:80E2: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0340F5 1A:80E5: F0 03     BEQ bra_80EA
C - - - - - 0x0340F7 1A:80E7: 4C 74 80  JMP loc_8074
bra_80EA:
C - - - - - 0x0340FA 1A:80EA: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
loc_80ED:
C D 0 - - - 0x0340FD 1A:80ED: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034100 1A:80F0: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034103 1A:80F3: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034106 1A:80F6: FE 80     .word ofs_038_80FE_00
- D 0 - I - 0x034108 1A:80F8: 07 81     .word ofs_038_8107_01
- D 0 - I - 0x03410A 1A:80FA: 18 81     .word ofs_038_8118_02
- D 0 - I - 0x03410C 1A:80FC: 1E 81     .word ofs_038_811E_03



ofs_038_80FE_00:
C - - J - - 0x03410E 1A:80FE: 20 70 81  JSR sub_8170
C - - - - - 0x034111 1A:8101: A2 50     LDX #$50
C - - - - - 0x034113 1A:8103: 9A        TXS
C - - - - - 0x034114 1A:8104: 4C 18 C6  JMP loc_0x03DD0D



ofs_038_8107_01:
C - - J - - 0x034117 1A:8107: 20 1E C6  JSR sub_0x03E069
C - - - - - 0x03411A 1A:810A: A9 0A     LDA #con_bsw_1C_05
C - - - - - 0x03411C 1A:810C: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03411F 1A:810F: 20 70 81  JSR sub_8170
C - - - - - 0x034122 1A:8112: A2 50     LDX #$50
C - - - - - 0x034124 1A:8114: 9A        TXS
C - - - - - 0x034125 1A:8115: 4C 12 C6  JMP loc_0x03DE62



ofs_038_8118_02:
C - - J - - 0x034128 1A:8118: A2 50     LDX #$50
C - - - - - 0x03412A 1A:811A: 9A        TXS
C - - - - - 0x03412B 1A:811B: 4C 0F C6  JMP loc_0x03E0EF



ofs_038_811E_03:
C - - J - - 0x03412E 1A:811E: 20 70 81  JSR sub_8170
C - - - - - 0x034131 1A:8121: A2 50     LDX #$50
C - - - - - 0x034133 1A:8123: 9A        TXS
C - - - - - 0x034134 1A:8124: 4C 21 C6  JMP loc_0x03DFE9



loc_0x034137:
loc_8127_никто_не_напал_на_игрока:
C D 0 - - - 0x034137 1A:8127: 20 DD 90  JSR sub_90DD_уменьшить_таймер_времени_тайма_изза_действия_атаки
C - - - - - 0x03413A 1A:812A: A9 00     LDA #$00
C - - - - - 0x03413C 1A:812C: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x03413F 1A:812F: 4C ED 80  JMP loc_80ED



sub_8132:
loc_8132:
C D 0 - - - 0x034142 1A:8132: 48        PHA
C - - - - - 0x034143 1A:8133: AD 3D 04  LDA ram_действие_защиты
; * 04
C - - - - - 0x034146 1A:8136: 0A        ASL
C - - - - - 0x034147 1A:8137: 0A        ASL
C - - - - - 0x034148 1A:8138: AA        TAX
C - - - - - 0x034149 1A:8139: 68        PLA
C - - - - - 0x03414A 1A:813A: A0 00     LDY #$00
bra_813C_loop:
C - - - - - 0x03414C 1A:813C: DD 8C 82  CMP tbl_828C,X
C - - - - - 0x03414F 1A:813F: B0 04     BCS bra_8145_запись_результата_рандома_пк
C - - - - - 0x034151 1A:8141: C8        INY
C - - - - - 0x034152 1A:8142: E8        INX
C - - - - - 0x034153 1A:8143: D0 F7     BNE bra_813C_loop
bra_8145_запись_результата_рандома_пк:
C - - - - - 0x034155 1A:8145: 4C 48 81  STY ram_результат_защитника
                                        RTS



sub_814C:
C - - - - - 0x03415C 1A:814C: 2C 17 06  BIT ram_колво_активных_защитников
C - - - - - 0x03415F 1A:814F: 30 03     BMI bra_8154
C - - - - - 0x034161 1A:8151: 20 33 8E  JSR sub_8E33
bra_8154:
C - - - - - 0x034164 1A:8154: A9 00     LDA #con_s_id_00
C - - - - - 0x034166 1A:8156: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034169 1A:8159: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03416C 1A:815C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03416F 1A:815F: 69 81     .word ofs_039_8169_00
- D 0 - I - 0x034171 1A:8161: 9C 81     .word ofs_039_819C_01
- D 0 - I - 0x034173 1A:8163: BC 81     .word ofs_039_81BC_02
- D 0 - I - 0x034175 1A:8165: D1 81     .word ofs_039_81D1_03
- D 0 - I - 0x034177 1A:8167: EA 81     .word ofs_039_81EA_04_нарушение



ofs_039_8169_00:
C - - J - - 0x034179 1A:8169: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03417C 1A:816C: 38        SEC
C - - - - - 0x03417D 1A:816D: 4C 95 90  JMP loc_9095



sub_8170:
C - - - - - 0x034180 1A:8170: 2C 17 06  BIT ram_колво_активных_защитников
C - - - - - 0x034183 1A:8173: 10 01     BPL bra_8176
C - - - - - 0x034185 1A:8175: 60        RTS
bra_8176:
sub_8176:
C - - - - - 0x034186 1A:8176: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x034189 1A:8179: E0 02     CPX #$02    ; dribble
C - - - - - 0x03418B 1A:817B: F0 1E     BEQ bra_819B_RTS
C - - - - - 0x03418D 1A:817D: A9 00     LDA #$00
C - - - - - 0x03418F 1A:817F: 8D 2D 06  STA ram_062D
C - - - - - 0x034192 1A:8182: BD 78 82  LDA tbl_8278_сценарий,X
C - - - - - 0x034195 1A:8185: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034198 1A:8188: AD 44 04  LDA ram_спешал_атакующего
C - - - - - 0x03419B 1A:818B: 29 03     AND #$03
C - - - - - 0x03419D 1A:818D: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x0341A0 1A:8190: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x0341A3 1A:8193: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x0341A6 1A:8196: 09 80     ORA #$80
C - - - - - 0x0341A8 1A:8198: 8D 17 06  STA ram_колво_активных_защитников
bra_819B_RTS:
C - - - - - 0x0341AB 1A:819B: 60        RTS



ofs_039_819C_01:
C - - J - - 0x0341AC 1A:819C: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x0341AF 1A:819F: 38        SEC
C - - - - - 0x0341B0 1A:81A0: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x0341B3 1A:81A3: ED 19 06  SBC ram_снижение_силы_действия
C - - - - - 0x0341B6 1A:81A6: AA        TAX
C - - - - - 0x0341B7 1A:81A7: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x0341BA 1A:81AA: E9 00     SBC #$00
C - - - - - 0x0341BC 1A:81AC: 10 04     BPL bra_81B2
- - - - - - 0x0341BE 1A:81AE: A2 00     LDX #$00
- - - - - - 0x0341C0 1A:81B0: A9 00     LDA #$00
bra_81B2:
C - - - - - 0x0341C2 1A:81B2: 8E 1C 06  STX ram_сила_действия_lo
C - - - - - 0x0341C5 1A:81B5: 8D 1D 06  STA ram_сила_действия_hi
C - - - - - 0x0341C8 1A:81B8: 38        SEC
C - - - - - 0x0341C9 1A:81B9: 4C 95 90  JMP loc_9095



loc_81BC:
ofs_039_81BC_02:
C D 0 - - - 0x0341CC 1A:81BC: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0341CF 1A:81BF: 18        CLC
C - - - - - 0x0341D0 1A:81C0: 20 95 90  JSR sub_9095
C - - - - - 0x0341D3 1A:81C3: A9 00     LDA #$00
C - - - - - 0x0341D5 1A:81C5: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x0341D8 1A:81C8: 20 ED 81  JSR sub_81ED_неудачное_действие
C - - - - - 0x0341DB 1A:81CB: A2 50     LDX #$50
C - - - - - 0x0341DD 1A:81CD: 9A        TXS
C - - - - - 0x0341DE 1A:81CE: 4C DF 8B  JMP loc_8BDF



ofs_039_81D1_03:
C - - J - - 0x0341E1 1A:81D1: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0341E4 1A:81D4: 18        CLC
C - - - - - 0x0341E5 1A:81D5: 20 95 90  JSR sub_9095
C - - - - - 0x0341E8 1A:81D8: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x0341EB 1A:81DB: 20 ED 81  JSR sub_81ED_неудачное_действие
loc_81DE:
C D 0 - - - 0x0341EE 1A:81DE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0341F1 1A:81E1: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0341F4 1A:81E4: A2 50     LDX #$50
C - - - - - 0x0341F6 1A:81E6: 9A        TXS
C - - - - - 0x0341F7 1A:81E7: 4C 0F C6  JMP loc_0x03E0EF



sub_81ED_неудачное_действие:
; срабатывает когда защитник отбил твой пас или удар и мяч полетел в сторону
C - - - - - 0x0341FD 1A:81ED: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034202 1A:81F2: D0 2E     BNE bra_8222_RTS        ; не удар
C - - - - - 0x034204 1A:81F4: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x034209 1A:81F9: D0 27     BNE bra_8222_RTS        ; не блок/перехват
C - - - - - 0x03420B 1A:81FB: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - - 0x03420E 1A:81FE: 29 7F     AND #$7F
C - - - - - 0x034210 1A:8200: C9 01     CMP #$01
C - - - - - 0x034212 1A:8202: D0 1E     BNE bra_8222_RTS
C - - - - - 0x034214 1A:8204: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034217 1A:8207: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x03421A 1A:820A: A9 50     LDA #$50
C - - - - - 0x03421C 1A:820C: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x03421F 1A:820F: A9 00     LDA #$00
C - - - - - 0x034221 1A:8211: 8D 40 04  STA ram_затрата_энергии_hi
C - - - - - 0x034224 1A:8214: 20 FB 8F  JSR sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов
C - - - - - 0x034227 1A:8217: A9 00     LDA #$00
C - - - - - 0x034229 1A:8219: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x03422C 1A:821C: A2 50     LDX #$50
C - - - - - 0x03422E 1A:821E: 9A        TXS
C - - - - - 0x03422F 1A:821F: 4C DF 8B  JMP loc_8BDF
bra_8222_RTS:
C - - - - - 0x034232 1A:8222: 60        RTS



sub_8223_блок_ишизаки_будет_последним_защитным_действием:
C - - - - - 0x034233 1A:8223: A2 00     LDX #$00
bra_8225_loop_поиска_ишизаки:
C - - - - - 0x034235 1A:8225: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034238 1A:8228: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x03423B 1A:822B: A0 00     LDY #con_plr_id
C - - - - - 0x03423D 1A:822D: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x03423F 1A:822F: C9 14     CMP #con_p_ishizaki_my
C - - - - - 0x034241 1A:8231: F0 0B     BEQ bra_823E_ишизаки_найден
C - - - - - 0x034243 1A:8233: C9 49     CMP #con_p_ishizaki_japan
C - - - - - 0x034245 1A:8235: F0 07     BEQ bra_823E_ишизаки_найден
C - - - - - 0x034247 1A:8237: E8        INX
C - - - - - 0x034248 1A:8238: EC 00 06  CPX ram_колво_защитников
C - - - - - 0x03424B 1A:823B: D0 E8     BNE bra_8225_loop_поиска_ишизаки
C - - - - - 0x03424D 1A:823D: 60        RTS
bra_823E_ишизаки_найден:
C - - - - - 0x03424E 1A:823E: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034251 1A:8241: D0 34     BNE bra_8277_RTS
C - - - - - 0x034253 1A:8243: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034256 1A:8246: D0 2F     BNE bra_8277_RTS
C - - - - - 0x034258 1A:8248: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x03425B 1A:824B: C9 01     CMP #$01
C - - - - - 0x03425D 1A:824D: D0 28     BNE bra_8277_RTS
C - - - - - 0x03425F 1A:824F: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034262 1A:8252: 48        PHA
C - - - - - 0x034263 1A:8253: AC 00 06  LDY ram_колво_защитников
C - - - - - 0x034266 1A:8256: 88        DEY
C - - - - - 0x034267 1A:8257: B9 01 06  LDA ram_номер_защитника,Y
C - - - - - 0x03426A 1A:825A: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x03426D 1A:825D: B9 0B 06  LDA ram_действие_защитника,Y
C - - - - - 0x034270 1A:8260: 9D 0B 06  STA ram_действие_защитника,X
C - - - - - 0x034273 1A:8263: B9 06 06  LDA ram_подтип_действия_защитника,Y
C - - - - - 0x034276 1A:8266: 9D 06 06  STA ram_подтип_действия_защитника,X
C - - - - - 0x034279 1A:8269: A9 01     LDA #$01
C - - - - - 0x03427B 1A:826B: 99 06 06  STA ram_подтип_действия_защитника,Y
C - - - - - 0x03427E 1A:826E: A9 00     LDA #$00
C - - - - - 0x034280 1A:8270: 99 0B 06  STA ram_действие_защитника,Y
C - - - - - 0x034283 1A:8273: 68        PLA
C - - - - - 0x034284 1A:8274: 99 01 06  STA ram_номер_защитника,Y
bra_8277_RTS:
C - - - - - 0x034287 1A:8277: 60        RTS



tbl_8278_сценарий:
    .byte con_s_id_1D ; 00 shoot
    .byte con_s_id_18 ; 01 pass
    .byte con_s_id_00 ; 02 dribble (placeholder)
    .byte con_s_id_1_2_start ; 03 1-2 pass



tbl_827C:
- D 0 - - - 0x03428C 1A:827C: 80        .byte $80   ; 00 
- D 0 - - - 0x03428D 1A:827D: 00        .byte $00   ; 01 
- D 0 - - - 0x03428E 1A:827E: 00        .byte $00   ; 02 
- - - - - - 0x03428F 1A:827F: 00        .byte $00   ; 03 
- D 0 - - - 0x034290 1A:8280: 00        .byte $00   ; 04 
- D 0 - - - 0x034291 1A:8281: 00        .byte $00   ; 05 
- D 0 - - - 0x034292 1A:8282: 80        .byte $80   ; 06 
- - - - - - 0x034293 1A:8283: 00        .byte $00   ; 07 
- D 0 - - - 0x034294 1A:8284: 00        .byte $00   ; 08 
- D 0 - - - 0x034295 1A:8285: 80        .byte $80   ; 09 
- D 0 - - - 0x034296 1A:8286: 00        .byte $00   ; 0A 
- - - - - - 0x034297 1A:8287: 00        .byte $00   ; 0B 
- D 0 - - - 0x034298 1A:8288: 00        .byte $00   ; 0C 
- D 0 - - - 0x034299 1A:8289: 00        .byte $00   ; 0D 
- D 0 - - - 0x03429A 1A:828A: 80        .byte $80   ; 0E 
- - - - - - 0x03429B 1A:828B: 00        .byte $00   ; 0F 



tbl_828C:
; 00 
- D 0 - - - 0x03429C 1A:828C: 9A        .byte $9A   ; 
- D 0 - - - 0x03429D 1A:828D: 60        .byte $60   ; 
- D 0 - - - 0x03429E 1A:828E: 30        .byte $30   ; 
- D 0 - - - 0x03429F 1A:828F: 00        .byte $00   ; 
; 01 
- D 0 - - - 0x0342A0 1A:8290: 9A        .byte $9A   ; 
- D 0 - - - 0x0342A1 1A:8291: 60        .byte $60   ; 
- D 0 - - - 0x0342A2 1A:8292: 44        .byte $44   ; 
- D 0 - - - 0x0342A3 1A:8293: 00        .byte $00   ; 
; 02 
- D 0 - - - 0x0342A4 1A:8294: 9A        .byte $9A   ; 
- D 0 - - - 0x0342A5 1A:8295: 60        .byte $60   ; 
- D 0 - - - 0x0342A6 1A:8296: 44        .byte $44   ; 
- D 0 - - - 0x0342A7 1A:8297: 00        .byte $00   ; 


loc_8298:
C D 0 - - - 0x0342A8 1A:8298: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x0342AA 1A:829A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x0342AD 1A:829D: 20 72 8F  JSR sub_8F72
C - - - - - 0x0342B0 1A:82A0: A9 01     LDA #con_s_id_01
C - - - - - 0x0342B2 1A:82A2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0342B5 1A:82A5: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x0342B8 1A:82A8: D0 0C     BNE bra_82B6
C - - - - - 0x0342BA 1A:82AA: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0342BD 1A:82AD: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x0342C0 1A:82B0: 20 DD 90  JSR sub_90DD_уменьшить_таймер_времени_тайма_изза_действия_атаки
C - - - - - 0x0342C3 1A:82B3: 4C F5 83  JMP loc_83F5
bra_82B6:
C - - - - - 0x0342C6 1A:82B6: A9 00     LDA #$00
C - - - - - 0x0342C8 1A:82B8: 8D 16 06  STA ram_индекс_защитника
bra_82BB_loop:
C - - - - - 0x0342CB 1A:82BB: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0342CE 1A:82BE: BC 0B 06  LDY ram_действие_защитника,X
C - - - - - 0x0342D1 1A:82C1: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0342D4 1A:82C4: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0342D7 1A:82C7: F0 08     BEQ bra_82D1
C - - - - - 0x0342D9 1A:82C9: C9 0B     CMP #$0B
C - - - - - 0x0342DB 1A:82CB: F0 04     BEQ bra_82D1
C - - - - - 0x0342DD 1A:82CD: C0 06     CPY #$06
C - - - - - 0x0342DF 1A:82CF: F0 13     BEQ bra_82E4
bra_82D1:
C - - - - - 0x0342E1 1A:82D1: 8C 3D 04  STY ram_действие_защиты
C - - - - - 0x0342E4 1A:82D4: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0342E7 1A:82D7: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0342EA 1A:82DA: A9 02     LDA #con_s_id_02
C - - - - - 0x0342EC 1A:82DC: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0342EF 1A:82DF: A9 14     LDA #$14
C - - - - - 0x0342F1 1A:82E1: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_82E4:
C - - - - - 0x0342F4 1A:82E4: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0342F7 1A:82E7: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0342FA 1A:82EA: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0342FD 1A:82ED: D0 CC     BNE bra_82BB_loop
C - - - - - 0x0342FF 1A:82EF: A9 04     LDA #con_s_id_04
C - - - - - 0x034301 1A:82F1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034304 1A:82F4: A9 00     LDA #$00
C - - - - - 0x034306 1A:82F6: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034309 1A:82F9: 8D 17 06  STA ram_колво_активных_защитников
loc_82FC_loop:
C D 0 - - - 0x03430C 1A:82FC: A9 01     LDA #$01
C - - - - - 0x03430E 1A:82FE: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034311 1A:8301: A9 00     LDA #$00
C - - - - - 0x034313 1A:8303: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x034316 1A:8306: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034319 1A:8309: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x03431C 1A:830C: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x03431F 1A:830F: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x034322 1A:8312: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034325 1A:8315: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034328 1A:8318: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x03432B 1A:831B: F0 04     BEQ bra_8321
C - - - - - 0x03432D 1A:831D: C9 0B     CMP #$0B
C - - - - - 0x03432F 1A:831F: D0 12     BNE bra_8333
bra_8321:
C - - - - - 0x034331 1A:8321: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034334 1A:8324: C9 04     CMP #$04
C - - - - - 0x034336 1A:8326: D0 03     BNE bra_832B
C - - - - - 0x034338 1A:8328: 4C A2 83  JMP loc_83A2
bra_832B:
C - - - - - 0x03433B 1A:832B: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x03433D 1A:832D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034340 1A:8330: 4C 49 83  JMP loc_8349
bra_8333:
C - - - - - 0x034343 1A:8333: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034346 1A:8336: C9 06     CMP #$06
C - - - - - 0x034348 1A:8338: D0 03     BNE bra_833D
C - - - - - 0x03434A 1A:833A: 4C A2 83  JMP loc_83A2
bra_833D:
C - - - - - 0x03434D 1A:833D: C9 05     CMP #$05
C - - - - - 0x03434F 1A:833F: D0 03     BNE bra_8344
C - - - - - 0x034351 1A:8341: 4C A2 83  JMP loc_83A2
bra_8344:
C - - - - - 0x034354 1A:8344: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034356 1A:8346: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
loc_8349:
C D 0 - - - 0x034359 1A:8349: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x03435C 1A:834C: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x03435F 1A:834F: BD D7 83  LDA tbl_83D7_offset_attack,X
; * 04
C - - - - - 0x034362 1A:8352: 0A        ASL
C - - - - - 0x034363 1A:8353: 0A        ASL
C - - - - - 0x034364 1A:8354: 85 3B     STA ram_003B_t19
C - - - - - 0x034366 1A:8356: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034369 1A:8359: A9 02     LDA #$02
C - - - - - 0x03436B 1A:835B: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x03436E 1A:835E: F0 07     BEQ bra_8367
C - - - - - 0x034370 1A:8360: C0 0B     CPY #$0B
C - - - - - 0x034372 1A:8362: F0 03     BEQ bra_8367
C - - - - - 0x034374 1A:8364: BD DD 83  LDA tbl_83DD_offset_defense,X
bra_8367:
C - - - - - 0x034377 1A:8367: 18        CLC
C - - - - - 0x034378 1A:8368: 65 3B     ADC ram_003B_t19
C - - - - - 0x03437A 1A:836A: AA        TAX
C - - - - - 0x03437B 1A:836B: 0A        ASL
C - - - - - 0x03437C 1A:836C: 85 3B     STA ram_003B_t10
C - - - - - 0x03437E 1A:836E: A9 01     LDA #$01
C - - - - - 0x034380 1A:8370: BC E1 83  LDY tbl_83E1,X
C - - - - - 0x034383 1A:8373: 20 E9 8E  JSR sub_8EE9
bra_8376_loop:
C - - - - - 0x034386 1A:8376: DD F1 83  CMP tbl_83F1,X
C - - - - - 0x034389 1A:8379: B0 04     BCS bra_837F
C - - - - - 0x03438B 1A:837B: E8        INX
C - - - - - 0x03438C 1A:837C: C8        INY
C - - - - - 0x03438D 1A:837D: D0 F7     BNE bra_8376_loop
bra_837F:
C - - - - - 0x03438F 1A:837F: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034392 1A:8382: 20 33 8E  JSR sub_8E33
C - - - - - 0x034395 1A:8385: A9 06     LDA #con_s_id_06
C - - - - - 0x034397 1A:8387: A2 01     LDX #$01
C - - - - - 0x034399 1A:8389: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x03439C 1A:838C: C0 02     CPY #$02
C - - - - - 0x03439E 1A:838E: 90 03     BCC bra_8393
C - - - - - 0x0343A0 1A:8390: CA        DEX ; 00
C - - - - - 0x0343A1 1A:8391: A9 05     LDA #con_s_id_05
bra_8393:
C - - - - - 0x0343A3 1A:8393: 48        PHA
C - - - - - 0x0343A4 1A:8394: 8A        TXA
C - - - - - 0x0343A5 1A:8395: 4A        LSR
C - - - - - 0x0343A6 1A:8396: 20 95 90  JSR sub_9095
C - - - - - 0x0343A9 1A:8399: 68        PLA
C - - - - - 0x0343AA 1A:839A: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0343AD 1A:839D: A9 07     LDA #con_s_id_07
C - - - - - 0x0343AF 1A:839F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_83A2:
C D 0 - - - 0x0343B2 1A:83A2: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0343B5 1A:83A5: C9 03     CMP #$03
C - - - - - 0x0343B7 1A:83A7: B0 13     BCS bra_83BC
C - - - - - 0x0343B9 1A:83A9: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0343BC 1A:83AC: F0 04     BEQ bra_83B2
C - - - - - 0x0343BE 1A:83AE: C9 0B     CMP #$0B
C - - - - - 0x0343C0 1A:83B0: D0 0A     BNE bra_83BC
bra_83B2:
C - - - - - 0x0343C2 1A:83B2: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x0343C5 1A:83B5: C9 03     CMP #$03
C - - - - - 0x0343C7 1A:83B7: D0 03     BNE bra_83BC
C - - - - - 0x0343C9 1A:83B9: EE 17 06  INC ram_колво_активных_защитников
bra_83BC:
C - - - - - 0x0343CC 1A:83BC: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0343CF 1A:83BF: C9 02     CMP #$02
C - - - - - 0x0343D1 1A:83C1: B0 11     BCS bra_83D4
C - - - - - 0x0343D3 1A:83C3: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0343D6 1A:83C6: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0343D9 1A:83C9: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0343DC 1A:83CC: F0 03     BEQ bra_83D1
C - - - - - 0x0343DE 1A:83CE: 4C FC 82  JMP loc_82FC_loop
bra_83D1:
C - - - - - 0x0343E1 1A:83D1: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_83D4:
C - - - - - 0x0343E4 1A:83D4: 4C F5 83  JMP loc_83F5



tbl_83D7_offset_attack:
- D 0 - - - 0x0343E7 1A:83D7: 02        .byte $02   ; 00 
- D 0 - - - 0x0343E8 1A:83D8: 00        .byte $00   ; 01 
- - - - - - 0x0343E9 1A:83D9: 00        .byte $00   ; 02 
- - - - - - 0x0343EA 1A:83DA: 00        .byte $00   ; 03 
- D 0 - - - 0x0343EB 1A:83DB: 01        .byte $01   ; 04 
- D 0 - - - 0x0343EC 1A:83DC: 03        .byte $03   ; 05 



tbl_83DD_offset_defense:
- - - - - - 0x0343ED 1A:83DD: 00        .byte $00   ; 00 
- - - - - - 0x0343EE 1A:83DE: 00        .byte $00   ; 01 
- D 0 - - - 0x0343EF 1A:83DF: 00        .byte $00   ; 02 
- D 0 - - - 0x0343F0 1A:83E0: 01        .byte $01   ; 03 



tbl_83E1:
; 00 
- D 0 - - - 0x0343F1 1A:83E1: 80        .byte $80   ; 00 
- D 0 - - - 0x0343F2 1A:83E2: 00        .byte $00   ; 01 
- D 0 - - - 0x0343F3 1A:83E3: 00        .byte $00   ; 02 
- - - - - - 0x0343F4 1A:83E4: 00        .byte $00   ; 03 
; 01 
- D 0 - - - 0x0343F5 1A:83E5: 00        .byte $00   ; 00 
- D 0 - - - 0x0343F6 1A:83E6: 00        .byte $00   ; 01 
- D 0 - - - 0x0343F7 1A:83E7: 80        .byte $80   ; 02 
- - - - - - 0x0343F8 1A:83E8: 00        .byte $00   ; 03 
; 02 
- D 0 - - - 0x0343F9 1A:83E9: 00        .byte $00   ; 00 
- D 0 - - - 0x0343FA 1A:83EA: 80        .byte $80   ; 01 
- D 0 - - - 0x0343FB 1A:83EB: 80        .byte $80   ; 02 
- - - - - - 0x0343FC 1A:83EC: 00        .byte $00   ; 03 
; 03 
- D 0 - - - 0x0343FD 1A:83ED: 00        .byte $00   ; 00 
- D 0 - - - 0x0343FE 1A:83EE: 00        .byte $00   ; 01 
- D 0 - - - 0x0343FF 1A:83EF: 00        .byte $00   ; 02 
- - - - - - 0x034400 1A:83F0: 00        .byte $00   ; 03 



tbl_83F1:
- D 0 - - - 0x034401 1A:83F1: A0        .byte $A0   ; 00 
- D 0 - - - 0x034402 1A:83F2: 60        .byte $60   ; 01 
- D 0 - - - 0x034403 1A:83F3: 40        .byte $40   ; 02 
- D 0 - - - 0x034404 1A:83F4: 00        .byte $00   ; 03 



loc_83F5:
C D 0 - - - 0x034405 1A:83F5: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034408 1A:83F8: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03440B 1A:83FB: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03440E 1A:83FE: 08 84     .word ofs_040_8408_00
- D 0 - I - 0x034410 1A:8400: 08 84     .word ofs_040_8408_01
- D 0 - I - 0x034412 1A:8402: 3F 84     .word ofs_040_843F_02
- D 0 - I - 0x034414 1A:8404: 4B 84     .word ofs_040_844B_03
- D 0 - I - 0x034416 1A:8406: 7C 84     .word ofs_040_847C_04_нарушение



ofs_040_8408_00:
ofs_040_8408_01:
C - - J - - 0x034418 1A:8408: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03441B 1A:840B: A9 08     LDA #con_s_id_08
C - - - - - 0x03441D 1A:840D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034420 1A:8410: 38        SEC
C - - - - - 0x034421 1A:8411: 20 95 90  JSR sub_9095
C - - - - - 0x034424 1A:8414: 20 7F 84  JSR sub_847F
C - - - - - 0x034427 1A:8417: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03442A 1A:841A: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03442D 1A:841D: 29 84     .word ofs_041_8429_00
- D 0 - I - 0x03442F 1A:841F: 12 C6     .word ofs_041_0x03DE62_01
- - - - - - 0x034431 1A:8421: 3C 84     .word $0000 ; 02
- - - - - - 0x034433 1A:8423: 3C 84     .word $0000 ; 03
- D 0 - I - 0x034435 1A:8425: 27 C6     .word ofs_041_0x03E55C_04
- D 0 - I - 0x034437 1A:8427: 2A C6     .word ofs_041_0x03E5A6



ofs_041_8429_00:
C - - J - - 0x034439 1A:8429: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x03443C 1A:842C: D0 08     BNE bra_8436
C - - - - - 0x03443E 1A:842E: A9 00     LDA #$00
C - - - - - 0x034440 1A:8430: 8D 21 06  STA ram_0621
C - - - - - 0x034443 1A:8433: 4C 18 C6  JMP loc_0x03DD0D
bra_8436:
C - - - - - 0x034446 1A:8436: A2 50     LDX #$50
C - - - - - 0x034448 1A:8438: 9A        TXS
C - - - - - 0x034449 1A:8439: 4C F3 88  JMP loc_88F3



ofs_040_843F_02:
C - - J - - 0x03444F 1A:843F: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034452 1A:8442: 20 7F 84  JSR sub_847F
C - - - - - 0x034455 1A:8445: A2 50     LDX #$50
C - - - - - 0x034457 1A:8447: 9A        TXS
C - - - - - 0x034458 1A:8448: 4C DF 8B  JMP loc_8BDF



ofs_040_844B_03:
C - - J - - 0x03445B 1A:844B: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x03445E 1A:844E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034461 1A:8451: F0 1D     BEQ bra_8470
C - - - - - 0x034463 1A:8453: C9 0B     CMP #$0B
C - - - - - 0x034465 1A:8455: F0 19     BEQ bra_8470
; if это не кипер
C - - - - - 0x034467 1A:8457: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x03446A 1A:845A: E0 02     CPX #$02
C - - - - - 0x03446C 1A:845C: D0 0C     BNE bra_846A
C - - - - - 0x03446E 1A:845E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034471 1A:8461: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034474 1A:8464: A2 50     LDX #$50
C - - - - - 0x034476 1A:8466: 9A        TXS
C - - - - - 0x034477 1A:8467: 4C 0F C6  JMP loc_0x03E0EF
bra_846A:
C - - - - - 0x03447A 1A:846A: A2 50     LDX #$50
C - - - - - 0x03447C 1A:846C: 9A        TXS
C - - - - - 0x03447D 1A:846D: 4C 30 C6  JMP loc_0x03E688
bra_8470:
C - - - - - 0x034480 1A:8470: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x034483 1A:8473: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034486 1A:8476: A2 50     LDX #$50
C - - - - - 0x034488 1A:8478: 9A        TXS
C - - - - - 0x034489 1A:8479: 4C 33 C6  JMP loc_0x03DE0D



sub_847F:
C - - - - - 0x03448F 1A:847F: AD 17 06  LDA ram_колво_активных_защитников
C - - - - - 0x034492 1A:8482: D0 01     BNE bra_8485
C - - - - - 0x034494 1A:8484: 60        RTS
bra_8485:
sub_8485:
C - - - - - 0x034495 1A:8485: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x034498 1A:8488: A0 0A     LDY #con_plr_stun
C - - - - - 0x03449A 1A:848A: A9 06     LDA #$06
C - - - - - 0x03449C 1A:848C: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x03449E 1A:848E: 60        RTS



sub_848F:
C - - - - - 0x03449F 1A:848F: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0344A2 1A:8492: A0 0A     LDY #con_plr_stun
C - - - - - 0x0344A4 1A:8494: B1 34     LDA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0344A6 1A:8496: D0 56     BNE bra_84EE_RTS
C - - - - - 0x0344A8 1A:8498: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x0344AB 1A:849B: 10 05     BPL bra_84A2
C - - - - - 0x0344AD 1A:849D: 49 FF     EOR #$FF
C - - - - - 0x0344AF 1A:849F: 18        CLC
C - - - - - 0x0344B0 1A:84A0: 69 01     ADC #$01
bra_84A2:
C - - - - - 0x0344B2 1A:84A2: AA        TAX
C - - - - - 0x0344B3 1A:84A3: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x0344B6 1A:84A6: 10 05     BPL bra_84AD
C - - - - - 0x0344B8 1A:84A8: 49 FF     EOR #$FF
C - - - - - 0x0344BA 1A:84AA: 18        CLC
C - - - - - 0x0344BB 1A:84AB: 69 01     ADC #$01
bra_84AD:
C - - - - - 0x0344BD 1A:84AD: A8        TAY
C - - - - - 0x0344BE 1A:84AE: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x0344C1 1A:84B1: A2 08     LDX #$08
bra_84B3_loop:
C - - - - - 0x0344C3 1A:84B3: DD EF 84  CMP tbl_84EF,X
C - - - - - 0x0344C6 1A:84B6: F0 05     BEQ bra_84BD
C - - - - - 0x0344C8 1A:84B8: CA        DEX
C - - - - - 0x0344C9 1A:84B9: 10 F8     BPL bra_84B3_loop
C - - - - - 0x0344CB 1A:84BB: 30 31     BMI bra_84EE_RTS    ; jmp
bra_84BD:
C - - - - - 0x0344CD 1A:84BD: A9 33     LDA #$33
C - - - - - 0x0344CF 1A:84BF: E0 06     CPX #$06
C - - - - - 0x0344D1 1A:84C1: 90 02     BCC bra_84C5
C - - - - - 0x0344D3 1A:84C3: A9 55     LDA #$55
bra_84C5:
C - - - - - 0x0344D5 1A:84C5: CD E2 00  CMP ram_random + $01
C - - - - - 0x0344D8 1A:84C8: 90 24     BCC bra_84EE_RTS
C - - - - - 0x0344DA 1A:84CA: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x0344DD 1A:84CD: E0 05     CPX #$05
C - - - - - 0x0344DF 1A:84CF: B0 1D     BCS bra_84EE_RTS
C - - - - - 0x0344E1 1A:84D1: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0344E4 1A:84D4: F0 04     BEQ bra_84DA    ; if комада слева
; if мяч у команды справа
C - - - - - 0x0344E6 1A:84D6: E0 04     CPX #$04
C - - - - - 0x0344E8 1A:84D8: B0 14     BCS bra_84EE_RTS
bra_84DA:
bra_84DA_loop:
C - - - - - 0x0344EA 1A:84DA: BD 00 06  LDA ram_колво_защитников,X
C - - - - - 0x0344ED 1A:84DD: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x0344F0 1A:84E0: CA        DEX
C - - - - - 0x0344F1 1A:84E1: 10 F7     BPL bra_84DA_loop
C - - - - - 0x0344F3 1A:84E3: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0344F6 1A:84E6: 49 0B     EOR #$0B
C - - - - - 0x0344F8 1A:84E8: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x0344FB 1A:84EB: EE 00 06  INC ram_колво_защитников
bra_84EE_RTS:
C - - - - - 0x0344FE 1A:84EE: 60        RTS



tbl_84EF:
- D 0 - - - 0x0344FF 1A:84EF: 03        .byte $03   ; 00 
- D 0 - - - 0x034500 1A:84F0: 0F        .byte $0F   ; 01 
- D 0 - - - 0x034501 1A:84F1: 1B        .byte $1B   ; 02 
- D 0 - - - 0x034502 1A:84F2: 10        .byte $10   ; 03 
- D 0 - - - 0x034503 1A:84F3: 1C        .byte $1C   ; 04 
- D 0 - - - 0x034504 1A:84F4: 1D        .byte $1D   ; 05 
- D 0 - - - 0x034505 1A:84F5: 04        .byte $04   ; 06 
- D 0 - - - 0x034506 1A:84F6: 05        .byte $05   ; 07 
- D 0 - - - 0x034507 1A:84F7: 11        .byte $11   ; 08 



loc_0x034508:
C D 0 - - - 0x034508 1A:84F8: A9 01     LDA #$01
C - - - - - 0x03450A 1A:84FA: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x03450D 1A:84FD: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034510 1A:8500: 08        PHP
C - - - - - 0x034511 1A:8501: 49 0B     EOR #$0B
C - - - - - 0x034513 1A:8503: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034516 1A:8506: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034519 1A:8509: 28        PLP
C - - - - - 0x03451A 1A:850A: D0 08     BNE bra_8514_команда_справа
; if комада слева
C - - - - - 0x03451C 1A:850C: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03451E 1A:850E: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034521 1A:8511: 4C 2F 85  JMP loc_852F
bra_8514_команда_справа:
C - - - - - 0x034524 1A:8514: A9 14     LDA #$14
C - - - - - 0x034526 1A:8516: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034529 1A:8519: A9 00     LDA #$00
C - - - - - 0x03452B 1A:851B: 85 11     STA ram_0011
C - - - - - 0x03452D 1A:851D: 85 12     STA ram_0012
C - - - - - 0x03452F 1A:851F: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x034532 1A:8522: A9 32     LDA #con_s_id_32
C - - - - - 0x034534 1A:8524: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034537 1A:8527: A9 04     LDA #$04
C - - - - - 0x034539 1A:8529: 8D 21 06  STA ram_0621
C - - - - - 0x03453C 1A:852C: 20 00 C6  JSR sub_0x03D575
loc_852F:
C D 0 - - - 0x03453F 1A:852F: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x034541 1A:8531: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034544 1A:8534: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x034547 1A:8537: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x03454A 1A:853A: A2 F3     LDX #$F3      ; шанс крита обычного кипера
C - - - - - 0x03454C 1A:853C: A0 00     LDY #con_plr_id
C - - - - - 0x03454E 1A:853E: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034550 1A:8540: C9 21     CMP #con_p_wakabayashi_my
C - - - - - 0x034552 1A:8542: F0 04     BEQ bra_8548_это_вакабаяши
C - - - - - 0x034554 1A:8544: C9 40     CMP #con_p_wakabayashi_hamburger_sv
C - - - - - 0x034556 1A:8546: D0 02     BNE bra_854A_это_не_вакабаяши
bra_8548_это_вакабаяши:
C - - - - - 0x034558 1A:8548: A2 CD     LDX #$CD      ; шанс крита кабаяши
bra_854A_это_не_вакабаяши:
C - - - - - 0x03455A 1A:854A: A9 00     LDA #$00
C - - - - - 0x03455C 1A:854C: EC E2 00  CPX ram_random + $01
C - - - - - 0x03455F 1A:854F: B0 02     BCS bra_8553_это_крит
C - - - - - 0x034561 1A:8551: A9 80     LDA #$80
bra_8553_это_крит:
C - - - - - 0x034563 1A:8553: A2 00     LDX #$00
C - - - - - 0x034565 1A:8555: 86 3B     STX ram_003B_t10
C - - - - - 0x034567 1A:8557: AA        TAX
C - - - - - 0x034568 1A:8558: 08        PHP
C - - - - - 0x034569 1A:8559: A9 03     LDA #$03
C - - - - - 0x03456B 1A:855B: 28        PLP
C - - - - - 0x03456C 1A:855C: 20 1F 8F  JSR sub_8F1F
C - - - - - 0x03456F 1A:855F: A0 00     LDY #$00
bra_8561_loop:
C - - - - - 0x034571 1A:8561: D9 B9 86  CMP tbl_86B9,Y
C - - - - - 0x034574 1A:8564: B0 05     BCS bra_856B
C - - - - - 0x034576 1A:8566: F0 03     BEQ bra_856B
C - - - - - 0x034578 1A:8568: C8        INY
C - - - - - 0x034579 1A:8569: D0 F6     BNE bra_8561_loop   ; jmp
bra_856B:
C - - - - - 0x03457B 1A:856B: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x03457E 1A:856E: D0 21     BNE bra_8591    ; if комада справа
; if мяч у команды слева
C - - - - - 0x034580 1A:8570: AE 2B 00  LDX ram_команда_соперника
C - - - - - 0x034583 1A:8573: E0 05     CPX #$05
C - - - - - 0x034585 1A:8575: D0 1A     BNE bra_8591
C - - - - - 0x034587 1A:8577: AE 46 04  LDX ram_drive_overhead_flag
C - - - - - 0x03458A 1A:857A: F0 15     BEQ bra_8591
C - - - - - 0x03458C 1A:857C: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x03458F 1A:857F: F0 10     BEQ bra_8591
C - - - - - 0x034591 1A:8581: C9 03     CMP #$03
C - - - - - 0x034593 1A:8583: F0 04     BEQ bra_8589
C - - - - - 0x034595 1A:8585: E0 04     CPX #$04
C - - - - - 0x034597 1A:8587: B0 08     BCS bra_8591
bra_8589:
C - - - - - 0x034599 1A:8589: A0 02     LDY #$02
C - - - - - 0x03459B 1A:858B: 2C E2 00  BIT ram_random + $01
C - - - - - 0x03459E 1A:858E: 10 01     BPL bra_8591
C - - - - - 0x0345A0 1A:8590: C8        INY
bra_8591:
C - - - - - 0x0345A1 1A:8591: 20 48 81  STY ram_результат_защитника
C - - - - - 0x0345A4 1A:8594: A9 00     LDA #$00
C - - - - - 0x0345A6 1A:8596: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x0345A9 1A:8599: A9 09     LDA #con_s_id_09
C - - - - - 0x0345AB 1A:859B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0345AE 1A:859E: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0345B1 1A:85A1: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x0345B4 1A:85A4: AC 85     .word ofs_064_85AC_00
- D 0 - I - 0x0345B6 1A:85A6: 05 86     .word ofs_064_8605_01
- D 0 - I - 0x0345B8 1A:85A8: 1C 86     .word ofs_064_861C_02
- D 0 - I - 0x0345BA 1A:85AA: 46 86     .word ofs_064_8646_03



loc_85AC:
sub_0x0345BC:
ofs_042_85AC_00:
ofs_063_85AC_00:
ofs_064_85AC_00:
C D 0 J - - 0x0345BC 1A:85AC: A2 00     LDX #$00
C - - - - - 0x0345BE 1A:85AE: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0345C1 1A:85B1: 20 D4 8B  JSR sub_8BD4_начислить_опыт
C - - - - - 0x0345C4 1A:85B4: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - - 0x0345C7 1A:85B7: A9 30     LDA #con_s_id_30
C - - - - - 0x0345C9 1A:85B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_85BC:
C D 0 - - - 0x0345CC 1A:85BC: 20 7B 98  JSR sub_987B
C - - - - - 0x0345CF 1A:85BF: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0345D2 1A:85C2: 49 0B     EOR #$0B
C - - - - - 0x0345D4 1A:85C4: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x0345D7 1A:85C7: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0345DA 1A:85CA: A9 00     LDA #$00
C - - - - - 0x0345DC 1A:85CC: A0 05     LDY #con_gk_таймер_наебки
C - - - - - 0x0345DE 1A:85CE: 91 34     STA (ram_plr_data),Y    ; con_gk_таймер_наебки
C - - - - - 0x0345E0 1A:85D0: A0 07     LDY #con_gk_величина_наебки
C - - - - - 0x0345E2 1A:85D2: 91 34     STA (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x0345E4 1A:85D4: A0 0A     LDY #con_plr_stun
C - - - - - 0x0345E6 1A:85D6: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0345E8 1A:85D8: A9 04     LDA #$04
C - - - - - 0x0345EA 1A:85DA: 8D 29 06  STA ram_флаг_разводки
C - - - - - 0x0345ED 1A:85DD: A2 50     LDX #$50
C - - - - - 0x0345EF 1A:85DF: 9A        TXS
C - - - - - 0x0345F0 1A:85E0: 4C 36 C6  JMP loc_0x03DABA



sub_85E3_увеличить_счетчик_голов:
C - - - - - 0x0345F3 1A:85E3: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x0345F6 1A:85E6: F0 05     BEQ bra_85ED_команда_слева
; if мяч у команды справа
C - - - - - 0x0345F8 1A:85E8: 20 4E 90  JSR sub_904E
C - - - - - 0x0345FB 1A:85EB: A2 01     LDX #$01
bra_85ED_команда_слева:     ; X = 00, bzk optimize, небезопасно
C - - - - - 0x0345FD 1A:85ED: FE 28 00  INC ram_голы,X
C - - - - - 0x034600 1A:85F0: A9 01     LDA #con_B3CF_team_names_and_score
C - - - - - 0x034602 1A:85F2: 20 2A C5  JMP loc_0x03EF8F_отрисовка_меню_во_время_матча



sub_85F6_выбор_мелодии_команды:
C - - - - - 0x034606 1A:85F6: 2C 3E 06  BIT ram_флаг_loss
C - - - - - 0x034609 1A:85F9: 10 06     BPL bra_8601_сейчас_не_loss
; музыка добавочного времени
C - - - - - 0x03460B 1A:85FB: A9 32     LDA #con_music_32
C - - - - - 0x03460D 1A:85FD: 20 5D C5  JMP loc_0x03CC01_запись_звука
bra_8601_сейчас_не_loss:
C - - - - - 0x034611 1A:8601: 20 6F C5  JMP loc_0x03D0A3_выбор_мелодии_команды



ofs_042_8605_01:
ofs_064_8605_01:
C - - J - - 0x034615 1A:8605: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x034618 1A:8608: 29 3F     AND #$3F
C - - - - - 0x03461A 1A:860A: C9 03     CMP #$03
C - - - - - 0x03461C 1A:860C: 90 9E     BCC bra_85AC_это_не_спешал
C - - - - - 0x03461E 1A:860E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034621 1A:8611: 49 0B     EOR #$0B
C - - - - - 0x034623 1A:8613: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x034626 1A:8616: A2 50     LDX #$50
C - - - - - 0x034628 1A:8618: 9A        TXS
C - - - - - 0x034629 1A:8619: 4C 33 C6  JMP loc_0x03DE0D
bra_85AC_это_не_спешал:
                                        JMP loc_85AC



ofs_042_861C_02:
ofs_063_861C_02:
ofs_064_861C_02:
C - - J - - 0x03462C 1A:861C: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x03462F 1A:861F: A9 00     LDA #$00
C - - - - - 0x034631 1A:8621: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034634 1A:8624: 20 D3 86  JSR sub_86D3_запись_наебки_кипера_после_отбивания_удара
C - - - - - 0x034637 1A:8627: 20 BD 86  JSR sub_86BD_увеличить_таймер_наебки_кипера
C - - - - - 0x03463A 1A:862A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03463D 1A:862D: F0 11     BEQ bra_8640
C - - - - - 0x03463F 1A:862F: A9 B0     LDA #$B0
C - - - - - 0x034641 1A:8631: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x034644 1A:8634: F0 02     BEQ bra_8638_команда_слева
; if мяч у команды справа
C - - - - - 0x034646 1A:8636: A9 50     LDA #$50
bra_8638_команда_слева:
C - - - - - 0x034648 1A:8638: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x03464B 1A:863B: A9 80     LDA #$80
C - - - - - 0x03464D 1A:863D: 8D 37 06  STA ram_ball_pos_Y_hi
bra_8640:
C - - - - - 0x034650 1A:8640: A2 50     LDX #$50
C - - - - - 0x034652 1A:8642: 9A        TXS
C - - - - - 0x034653 1A:8643: 4C DF 8B  JMP loc_8BDF



ofs_064_8646_03:
C - - J - - 0x034656 1A:8646: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034659 1A:8649: 20 BD 86  JSR sub_86BD_увеличить_таймер_наебки_кипера
C - - - - - 0x03465C 1A:864C: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x03465F 1A:864F: C9 01     CMP #$01
C - - - - - 0x034661 1A:8651: F0 0E     BEQ bra_8661
C - - - - - 0x034663 1A:8653: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034666 1A:8656: 49 0B     EOR #$0B
C - - - - - 0x034668 1A:8658: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x03466B 1A:865B: A2 50     LDX #$50
C - - - - - 0x03466D 1A:865D: 9A        TXS
C - - - - - 0x03466E 1A:865E: 4C 33 C6  JMP loc_0x03DE0D
bra_8661:
C - - - - - 0x034671 1A:8661: AD E2 00  LDA ram_random + $01
C - - - - - 0x034674 1A:8664: 29 07     AND #$07
C - - - - - 0x034676 1A:8666: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x034679 1A:8669: D0 02     BNE bra_866D_команда_справа
; if мяч у команды слева
C - - - - - 0x03467B 1A:866B: 49 07     EOR #$07
bra_866D_команда_справа:
C - - - - - 0x03467D 1A:866D: AA        TAX
; * 08
C - - - - - 0x03467E 1A:866E: 0A        ASL
C - - - - - 0x03467F 1A:866F: 0A        ASL
C - - - - - 0x034680 1A:8670: 0A        ASL
C - - - - - 0x034681 1A:8671: 85 3A     STA ram_003A_t31_ball_pos_X_hi
C - - - - - 0x034683 1A:8673: A9 30     LDA #$30
C - - - - - 0x034685 1A:8675: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x034688 1A:8678: D0 02     BNE bra_867C_команда_справа
; if мяч у команды слева
C - - - - - 0x03468A 1A:867A: A9 90     LDA #$90
bra_867C_команда_справа:
C - - - - - 0x03468C 1A:867C: 18        CLC
C - - - - - 0x03468D 1A:867D: 65 3A     ADC ram_003A_t31_ball_pos_X_hi
C - - - - - 0x03468F 1A:867F: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x034692 1A:8682: AD E3 00  LDA ram_random + $02
C - - - - - 0x034695 1A:8685: 29 0F     AND #$0F
loc_8687_loop:
C D 0 - - - 0x034697 1A:8687: DD B1 86  CMP tbl_86B1,X
C - - - - - 0x03469A 1A:868A: 90 06     BCC bra_8692_закончить
C - - - - - 0x03469C 1A:868C: FD B1 86  SBC tbl_86B1,X
C - - - - - 0x03469F 1A:868F: 4C 87 86  JMP loc_8687_loop
bra_8692_закончить:
; * 08
C - - - - - 0x0346A2 1A:8692: 0A        ASL
C - - - - - 0x0346A3 1A:8693: 0A        ASL
C - - - - - 0x0346A4 1A:8694: 0A        ASL
C - - - - - 0x0346A5 1A:8695: 69 50     ADC #$50
C - - - - - 0x0346A7 1A:8697: 2C E3 00  BIT ram_random + $02
C - - - - - 0x0346AA 1A:869A: 10 02     BPL bra_869E
C - - - - - 0x0346AC 1A:869C: 49 FF     EOR #$FF
bra_869E:
C - - - - - 0x0346AE 1A:869E: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0346B1 1A:86A1: A9 01     LDA #$01
C - - - - - 0x0346B3 1A:86A3: 8D FF 05  STA ram_05FF
C - - - - - 0x0346B6 1A:86A6: A9 00     LDA #$00
C - - - - - 0x0346B8 1A:86A8: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x0346BB 1A:86AB: 20 D3 86  JSR sub_86D3_запись_наебки_кипера_после_отбивания_удара
C - - - - - 0x0346BE 1A:86AE: 4C E5 8B  JMP loc_8BE5



tbl_86B1:
- D 0 - - - 0x0346C1 1A:86B1: 03        .byte $03   ; 00 
- D 0 - - - 0x0346C2 1A:86B2: 03        .byte $03   ; 01 
- D 0 - - - 0x0346C3 1A:86B3: 03        .byte $03   ; 02 
- D 0 - - - 0x0346C4 1A:86B4: 06        .byte $06   ; 03 
- D 0 - - - 0x0346C5 1A:86B5: 06        .byte $06   ; 04 
- D 0 - - - 0x0346C6 1A:86B6: 06        .byte $06   ; 05 
- D 0 - - - 0x0346C7 1A:86B7: 06        .byte $06   ; 06 
- D 0 - - - 0x0346C8 1A:86B8: 06        .byte $06   ; 07 



tbl_86B9:
- D 0 - - - 0x0346C9 1A:86B9: BF        .byte $BF   ; 00 
- D 0 - - - 0x0346CA 1A:86BA: BB        .byte $BB   ; 01 
- D 0 - - - 0x0346CB 1A:86BB: 87        .byte $87   ; 02 
- D 0 - - - 0x0346CC 1A:86BC: 00        .byte $00   ; 03 



sub_86BD_увеличить_таймер_наебки_кипера:
C - - - - - 0x0346CD 1A:86BD: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0346D0 1A:86C0: A9 07     LDA #$07
C - - - - - 0x0346D2 1A:86C2: AE 43 04  LDX ram_0443
C - - - - - 0x0346D5 1A:86C5: E0 02     CPX #$02
C - - - - - 0x0346D7 1A:86C7: 90 02     BCC bra_86CB
C - - - - - 0x0346D9 1A:86C9: A9 0B     LDA #$0B
bra_86CB:
; судя по новому логу, только для кипера соперника?
C - - - - - 0x0346DB 1A:86CB: A0 05     LDY #con_gk_таймер_наебки
C - - - - - 0x0346DD 1A:86CD: 18        CLC
C - - - - - 0x0346DE 1A:86CE: 71 34     ADC (ram_plr_data),Y    ; con_gk_таймер_наебки
C - - - - - 0x0346E0 1A:86D0: 91 34     STA (ram_plr_data),Y    ; con_gk_таймер_наебки
C - - - - - 0x0346E2 1A:86D2: 60        RTS



sub_86D3_запись_наебки_кипера_после_отбивания_удара:
C - - - - - 0x0346E3 1A:86D3: AD E2 00  LDA ram_random + $01
C - - - - - 0x0346E6 1A:86D6: C9 40     CMP #$40
C - - - - - 0x0346E8 1A:86D8: B0 1B     BCS bra_86F5_RTS
C - - - - - 0x0346EA 1A:86DA: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x0346ED 1A:86DD: A0 07     LDY #con_gk_величина_наебки
C - - - - - 0x0346EF 1A:86DF: B1 34     LDA (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x0346F1 1A:86E1: C9 50     CMP #$50
C - - - - - 0x0346F3 1A:86E3: B0 10     BCS bra_86F5_RTS
C - - - - - 0x0346F5 1A:86E5: 69 4F     ADC #$4F
C - - - - - 0x0346F7 1A:86E7: C9 80     CMP #$80
C - - - - - 0x0346F9 1A:86E9: 90 02     BCC bra_86ED_not_overflow
C - - - - - 0x0346FB 1A:86EB: A9 7F     LDA #$7F
bra_86ED_not_overflow:
C - - - - - 0x0346FD 1A:86ED: 91 34     STA (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x0346FF 1A:86EF: A0 06     LDY #con_gk_06
C - - - - - 0x034701 1A:86F1: A9 04     LDA #$04
C - - - - - 0x034703 1A:86F3: 91 34     STA (ram_plr_data),Y    ; con_gk_06
bra_86F5_RTS:
C - - - - - 0x034705 1A:86F5: 60        RTS



loc_0x034706:
C D 0 - - - 0x034706 1A:86F6: A9 03     LDA #$03
C - - - - - 0x034708 1A:86F8: 8D 21 06  STA ram_0621
C - - - - - 0x03470B 1A:86FB: A9 01     LDA #$01
C - - - - - 0x03470D 1A:86FD: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034710 1A:8700: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034713 1A:8703: 49 0B     EOR #$0B
C - - - - - 0x034715 1A:8705: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034718 1A:8708: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x03471B 1A:870B: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03471D 1A:870D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034720 1A:8710: A9 31     LDA #con_s_id_gk_vs_attacker
C - - - - - 0x034722 1A:8712: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034725 1A:8715: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034728 1A:8718: 20 72 8F  JSR sub_8F72
C - - - - - 0x03472B 1A:871B: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03472E 1A:871E: C9 01     CMP #$01
C - - - - - 0x034730 1A:8720: D0 10     BNE bra_8732
C - - - - - 0x034732 1A:8722: A9 00     LDA #$00
C - - - - - 0x034734 1A:8724: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034737 1A:8727: A9 18     LDA #con_s_id_18
C - - - - - 0x034739 1A:8729: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03473C 1A:872C: A2 50     LDX #$50
C - - - - - 0x03473E 1A:872E: 9A        TXS
C - - - - - 0x03473F 1A:872F: 4C 12 C6  JMP loc_0x03DE62
bra_8732:
C - - - - - 0x034742 1A:8732: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x034744 1A:8734: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034747 1A:8737: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x03474A 1A:873A: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x03474D 1A:873D: 38        SEC
C - - - - - 0x03474E 1A:873E: E9 05     SBC #$05
C - - - - - 0x034750 1A:8740: 85 3B     STA ram_003B_t11
C - - - - - 0x034752 1A:8742: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034755 1A:8745: 0A        ASL
C - - - - - 0x034756 1A:8746: 65 3B     ADC ram_003B_t11
C - - - - - 0x034758 1A:8748: AA        TAX
C - - - - - 0x034759 1A:8749: 0A        ASL
C - - - - - 0x03475A 1A:874A: 85 3B     STA ram_003B_t10
C - - - - - 0x03475C 1A:874C: A9 04     LDA #$04
C - - - - - 0x03475E 1A:874E: BC D7 87  LDY tbl_87D7,X
C - - - - - 0x034761 1A:8751: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x034764 1A:8754: 85 3A     STA ram_003A_t32
C - - - - - 0x034766 1A:8756: 20 59 8F  JSR sub_8F59
; / 04
C - - - - - 0x034769 1A:8759: 4A        LSR
C - - - - - 0x03476A 1A:875A: 4A        LSR
C - - - - - 0x03476B 1A:875B: 18        CLC
C - - - - - 0x03476C 1A:875C: 65 3A     ADC ram_003A_t32
C - - - - - 0x03476E 1A:875E: 90 02     BCC bra_8762_not_overflow
C - - - - - 0x034770 1A:8760: A9 FF     LDA #$FF
bra_8762_not_overflow:
C - - - - - 0x034772 1A:8762: A0 00     LDY #$00
bra_8764_loop:
C - - - - - 0x034774 1A:8764: D9 DD 87  CMP tbl_87DD,Y
C - - - - - 0x034777 1A:8767: B0 05     BCS bra_876E
C - - - - - 0x034779 1A:8769: F0 03     BEQ bra_876E
C - - - - - 0x03477B 1A:876B: C8        INY
C - - - - - 0x03477C 1A:876C: D0 F6     BNE bra_8764_loop   ; jmp
bra_876E:
C - - - - - 0x03477E 1A:876E: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034781 1A:8771: 20 33 8E  JSR sub_8E33
C - - - - - 0x034784 1A:8774: A9 0A     LDA #con_s_id_result_gk_vs_attacker
C - - - - - 0x034786 1A:8776: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034789 1A:8779: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03478C 1A:877C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03478F 1A:877F: 89 87     .word ofs_043_8789_00_кипер_промахнется
- D 0 - I - 0x034791 1A:8781: 9F 87     .word ofs_043_879F_01_кипер_отобъет_ладонью
- D 0 - I - 0x034793 1A:8783: B7 87     .word ofs_043_87B7_02_кипер_отобъет_кулаком
- D 0 - I - 0x034795 1A:8785: C3 87     .word ofs_043_87C3_03_кипер_словит
- D 0 - I - 0x034797 1A:8787: D4 87     .word ofs_043_87D4_04_нарушение



ofs_043_8789_00_кипер_промахнется:
C - - J - - 0x034799 1A:8789: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x03479C 1A:878C: 20 85 84  JSR sub_8485
C - - - - - 0x03479F 1A:878F: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0347A4 1A:8794: D0 03     BNE bra_8799
C - - - - - 0x0347A6 1A:8796: 4C F3 88  JMP loc_88F3
bra_8799:
C - - - - - 0x0347A9 1A:8799: A2 50     LDX #$50
C - - - - - 0x0347AB 1A:879B: 9A        TXS
C - - - - - 0x0347AC 1A:879C: 4C 2A 89  JMP loc_892A



ofs_043_879F_01_кипер_отобъет_ладонью:
C - - J - - 0x0347AF 1A:879F: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x0347B2 1A:87A2: 20 85 84  JSR sub_8485
C - - - - - 0x0347B5 1A:87A5: AD E2 00  LDA ram_random + $01
C - - - - - 0x0347B8 1A:87A8: C9 40     CMP #$40
C - - - - - 0x0347BA 1A:87AA: B0 05     BCS bra_87B1
C - - - - - 0x0347BE 1A:87AE: 20 F5 8C  JSR sub_8CF5
bra_87B1:
C - - - - - 0x0347C1 1A:87B1: A2 50     LDX #$50
C - - - - - 0x0347C3 1A:87B3: 9A        TXS
C - - - - - 0x0347C4 1A:87B4: 4C DF 8B  JMP loc_8BDF



ofs_043_87B7_02_кипер_отобъет_кулаком:
C - - J - - 0x0347C7 1A:87B7: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0347CA 1A:87BA: 20 85 84  JSR sub_8485
C - - - - - 0x0347CD 1A:87BD: A2 50     LDX #$50
C - - - - - 0x0347CF 1A:87BF: 9A        TXS
C - - - - - 0x0347D0 1A:87C0: 4C DF 8B  JMP loc_8BDF



ofs_043_87C3_03_кипер_словит:
C - - J - - 0x0347D3 1A:87C3: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0347D6 1A:87C6: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0347D9 1A:87C9: 49 0B     EOR #$0B
C - - - - - 0x0347DB 1A:87CB: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0347DE 1A:87CE: A2 50     LDX #$50
C - - - - - 0x0347E0 1A:87D0: 9A        TXS
C - - - - - 0x0347E1 1A:87D1: 4C 33 C6  JMP loc_0x03DE0D



tbl_87D7:
; 00 
- D 0 - - - 0x0347E7 1A:87D7: 00        .byte $00   ; 
- D 0 - - - 0x0347E8 1A:87D8: 80        .byte $80   ; 
; 01 
- - - - - - 0x0347E9 1A:87D9: 00        .byte $00   ; 
- - - - - - 0x0347EA 1A:87DA: 00        .byte $00   ; 
; 02 
- D 0 - - - 0x0347EB 1A:87DB: 80        .byte $80   ; 
- D 0 - - - 0x0347EC 1A:87DC: 00        .byte $00   ; 


tbl_87DD:
- D 0 - - - 0x0347ED 1A:87DD: A8        .byte $A8   ; 00 
- D 0 - - - 0x0347EE 1A:87DE: 5A        .byte $5A   ; 01 
- D 0 - - - 0x0347EF 1A:87DF: 52        .byte $52   ; 02 
- D 0 - - - 0x0347F0 1A:87E0: 00        .byte $00   ; 03 



sub_87E1:
sub_0x0347F1:
C D 0 - - - 0x0347F1 1A:87E1: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0347F4 1A:87E4: 49 0B     EOR #$0B
C - - - - - 0x0347F6 1A:87E6: 85 41     STA ram_0041_t05_порядковый_номер_игрока
C - - - - - 0x0347F8 1A:87E8: E6 41     INC ram_0041_t05_порядковый_номер_игрока   ; исключить GK из списка
C - - - - - 0x0347FA 1A:87EA: A9 0A     LDA #$0A
C - - - - - 0x0347FC 1A:87EC: 85 3B     STA ram_003B_t20_счетчик_игроков
bra_87EE_loop:
C - - - - - 0x0347FE 1A:87EE: A5 41     LDA ram_0041_t05_порядковый_номер_игрока
C - - - - - 0x034800 1A:87F0: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034803 1A:87F3: A0 0A     LDY #con_plr_stun
C - - - - - 0x034805 1A:87F5: B1 34     LDA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x034807 1A:87F7: D0 35     BNE bra_882E
C - - - - - 0x034809 1A:87F9: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x03480B 1A:87FB: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x03480D 1A:87FD: AA        TAX
C - - - - - 0x03480E 1A:87FE: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x034810 1A:8800: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x034812 1A:8802: A8        TAY
C - - - - - 0x034813 1A:8803: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x034816 1A:8806: CD FE 05  CMP ram_05FE
C - - - - - 0x034819 1A:8809: D0 23     BNE bra_882E
C - - - - - 0x03481B 1A:880B: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x03481E 1A:880E: E0 05     CPX #$05
C - - - - - 0x034820 1A:8810: B0 1C     BCS bra_882E
C - - - - - 0x034822 1A:8812: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034825 1A:8815: F0 04     BEQ bra_881B_команда_слева
; if мяч у команды справа
C - - - - - 0x034827 1A:8817: E0 04     CPX #$04
C - - - - - 0x034829 1A:8819: B0 13     BCS bra_882E
bra_881B_команда_слева:
C - - - - - 0x03482B 1A:881B: AD E2 00  LDA ram_random + $01
C - - - - - 0x03482E 1A:881E: ED E3 00  SBC ram_random + $02
C - - - - - 0x034831 1A:8821: CD 1A 06  CMP ram_061A
C - - - - - 0x034834 1A:8824: B0 08     BCS bra_882E
C - - - - - 0x034836 1A:8826: A5 41     LDA ram_0041_t05_порядковый_номер_игрока
C - - - - - 0x034838 1A:8828: 9D 01 06  STA ram_номер_защитника,X
C - - - - - 0x03483B 1A:882B: EE 00 06  INC ram_колво_защитников
bra_882E:
C - - - - - 0x03483E 1A:882E: E6 41     INC ram_0041_t05_порядковый_номер_игрока
C - - - - - 0x034840 1A:8830: C6 3B     DEC ram_003B_t20_счетчик_игроков
C - - - - - 0x034842 1A:8832: D0 BA     BNE bra_87EE_loop
C - - - - - 0x034844 1A:8834: 60        RTS



loc_0x034845:
C D 0 - - - 0x034845 1A:8835: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034848 1A:8838: D0 01     BEQ bra_888A_RTS
C - - - - - 0x03484B 1A:883B: A9 00     LDA #$00
C - - - - - 0x03484D 1A:883D: 8D 16 06  STA ram_индекс_защитника
bra_8840_loop:
C - - - - - 0x034850 1A:8840: A9 01     LDA #$01
C - - - - - 0x034852 1A:8842: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x034855 1A:8845: AD 4E 04  LDA ram_высота_мяча
C - - - - - 0x034858 1A:8848: 48        PHA
C - - - - - 0x034859 1A:8849: A9 00     LDA #$00
C - - - - - 0x03485B 1A:884B: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x03485E 1A:884E: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x034861 1A:8851: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034864 1A:8854: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034867 1A:8857: AE 1B 06  LDX ram_061B
; bzk optimize, загрузка 00 или 02 из таблицы
; в 061B может быть 00 или 01, сделать LDA + ASL + STA
C - - - - - 0x03486A 1A:885A: BD 8B 88  LDA tbl_888B,X
C - - - - - 0x03486D 1A:885D: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x034870 1A:8860: A9 00     LDA #$00
C - - - - - 0x034872 1A:8862: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034878 1A:8868: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x03487A 1A:886A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03487D 1A:886D: 20 8D 88  JSR sub_888D
C - - - - - 0x034880 1A:8870: 68        PLA
C - - - - - 0x034881 1A:8871: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034884 1A:8874: 20 A8 88  JSR sub_88A8
C - - - - - 0x034887 1A:8877: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x03488A 1A:887A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03488D 1A:887D: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x034890 1A:8880: D0 BE     BNE bra_8840_loop
C - - - - - 0x034892 1A:8882: A9 00     LDA #$00
C - - - - - 0x034894 1A:8884: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034897 1A:8887: 8D FF 05  STA ram_05FF
bra_888A_RTS:
C - - - - - 0x03489A 1A:888A: 60        RTS



tbl_888B:
- D 0 - - - 0x03489B 1A:888B: 00        .byte $00   ; 
- D 0 - - - 0x03489C 1A:888C: 02        .byte $02   ; 


sub_888D:
sub_0x03489D:
C D 0 - - - 0x03489D 1A:888D: A9 00     LDA #$00
C - - - - - 0x03489F 1A:888F: 85 3A     STA ram_003A_t33_flag
C - - - - - 0x0348A1 1A:8891: AD 3B 04  LDA ram_действие_атаки
; * 04
C - - - - - 0x0348A4 1A:8894: 0A        ASL
C - - - - - 0x0348A5 1A:8895: 0A        ASL
C - - - - - 0x0348A6 1A:8896: 6D 3D 04  ADC ram_действие_защиты
C - - - - - 0x0348A9 1A:8899: AA        TAX
; * 02 (08)
C - - - - - 0x0348AA 1A:889A: 0A        ASL
C - - - - - 0x0348AB 1A:889B: 85 3B     STA ram_003B_t10
C - - - - - 0x0348AD 1A:889D: A9 05     LDA #$05
C - - - - - 0x0348AF 1A:889F: BC EB 88  LDY tbl_88EB,X
C - - - - - 0x0348B2 1A:88A2: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x0348B5 1A:88A5: 4C 32 81  JMP loc_8132



sub_88A8:
loc_0x0348B8:
C D 0 - - - 0x0348B8 1A:88A8: A9 0B     LDA #con_s_id_0B
C - - - - - 0x0348BA 1A:88AA: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0348BD 1A:88AD: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0348C0 1A:88B0: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x0348C3 1A:88B3: 69 81     .word ofs_039_8169_00
- D 0 - I - 0x0348C5 1A:88B5: 9C 81     .word ofs_039_819C_01
- D 0 - I - 0x0348C7 1A:88B7: BB 88     .word ofs_039_88BB_02
- D 0 - I - 0x0348C9 1A:88B9: D5 88     .word ofs_039_88D5_03



ofs_039_88BB_02:
C - - J - - 0x0348CB 1A:88BB: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0348CE 1A:88BE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0348D1 1A:88C1: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0348D4 1A:88C4: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0348D6 1A:88C6: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0348D8 1A:88C8: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x0348DB 1A:88CB: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0348DD 1A:88CD: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0348DF 1A:88CF: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0348E2 1A:88D2: 4C BC 81  JMP loc_81BC



ofs_039_88D5_03:
C - - J - - 0x0348E5 1A:88D5: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x0348E8 1A:88D8: 18        CLC
C - - - - - 0x0348E9 1A:88D9: 20 95 90  JSR sub_9095
C - - - - - 0x0348EC 1A:88DC: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0348EF 1A:88DF: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0348F2 1A:88E2: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x0348F5 1A:88E5: A2 50     LDX #$50
C - - - - - 0x0348F7 1A:88E7: 9A        TXS
C - - - - - 0x0348F8 1A:88E8: 4C 0F C6  JMP loc_0x03E0EF



tbl_88EB:
; 00 
- D 0 - - - 0x0348FB 1A:88EB: 80        .byte $80   ; 00 
- - - - - - 0x0348FC 1A:88EC: 00        .byte $00   ; 01 
- - - - - - 0x0348FD 1A:88ED: 00        .byte $00   ; 02 
- - - - - - 0x0348FE 1A:88EE: 00        .byte $00   ; 03 
; 01 
- - - - - - 0x0348FF 1A:88EF: 00        .byte $00   ; 00 
- - - - - - 0x034900 1A:88F0: 00        .byte $00   ; 01 
- D 0 - - - 0x034901 1A:88F1: 80        .byte $80   ; 02 
- - - - - - 0x034902 1A:88F2: 00        .byte $00   ; 03 



loc_88F3:
loc_0x034903:
C D 0 - - - 0x034903 1A:88F3: A9 00     LDA #$00
C - - - - - 0x034905 1A:88F5: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034908 1A:88F8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03490B 1A:88FB: 49 0B     EOR #$0B
C - - - - - 0x03490D 1A:88FD: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034910 1A:8900: AD E2 00  LDA ram_random + $01
C - - - - - 0x034913 1A:8903: A0 00     LDY #$00
bra_8905_loop:
C - - - - - 0x034915 1A:8905: D9 28 89  CMP tbl_8928,Y
C - - - - - 0x034918 1A:8908: B0 05     BCS bra_890F
C - - - - - 0x03491A 1A:890A: F0 03     BEQ bra_890F
C - - - - - 0x03491C 1A:890C: C8        INY
C - - - - - 0x03491D 1A:890D: D0 F6     BNE bra_8905_loop   ; jmp
bra_890F:
C - - - - - 0x03491F 1A:890F: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034922 1A:8912: A9 00     LDA #$00
C - - - - - 0x034924 1A:8914: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x034927 1A:8917: A9 0C     LDA #con_s_id_0C
C - - - - - 0x034929 1A:8919: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03492C 1A:891C: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03492F 1A:891F: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034932 1A:8922: AC 85     .word ofs_042_85AC_00
- D 0 - I - 0x034934 1A:8924: 05 86     .word ofs_042_8605_01
- D 0 - I - 0x034936 1A:8926: 1C 86     .word ofs_042_861C_02



tbl_8928:
- D 0 - - - 0x034938 1A:8928: 10        .byte $10   ; 
- D 0 - - - 0x034939 1A:8929: 00        .byte $00   ; 


loc_892A:
C D 0 - - - 0x03493A 1A:892A: A0 00     LDY #$00
C - - - - - 0x03493C 1A:892C: A9 00     LDA #$00
C - - - - - 0x03493E 1A:892E: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034941 1A:8931: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034944 1A:8934: AD E2 00  LDA ram_random + $01
bra_8937_loop:
C - - - - - 0x034947 1A:8937: D9 75 89  CMP tbl_8975_сценарий_после_обводки_кипера,Y
C - - - - - 0x03494A 1A:893A: B0 05     BCS bra_8941_сценарий_выбран
C - - - - - 0x03494C 1A:893C: F0 03     BEQ bra_8941_сценарий_выбран
C - - - - - 0x03494E 1A:893E: C8        INY
C - - - - - 0x03494F 1A:893F: D0 F6     BNE bra_8937_loop
bra_8941_сценарий_выбран:
C - - - - - 0x034951 1A:8941: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034954 1A:8944: A9 0D     LDA #con_s_id_0D
C - - - - - 0x034956 1A:8946: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034959 1A:8949: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03495C 1A:894C: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x03495F 1A:894F: 55 89     .word ofs_044_8955_00
- D 0 - I - 0x034961 1A:8951: 55 89     .word ofs_044_8955_01
- D 0 - I - 0x034963 1A:8953: 72 89     .word ofs_044_8972_02



ofs_044_8955_00:
ofs_044_8955_01:
C - - J - - 0x034965 1A:8955: 2C 4C 04  BIT ram_044C_flag
C - - - - - 0x034968 1A:8958: 10 15     BPL bra_896F
C - - - - - 0x03496A 1A:895A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x03496D 1A:895D: C9 14     CMP #$14      ; проверка на номера 10 соперника
C - - - - - 0x03496F 1A:895F: D0 0E     BNE bra_896F
C - - - - - 0x034971 1A:8961: 20 70 90  JSR sub_9070
C - - - - - 0x034974 1A:8964: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - - 0x034977 1A:8967: A9 47     LDA #con_s_id_47
C - - - - - 0x034979 1A:8969: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03497C 1A:896C: 4C BC 85  JMP loc_85BC
bra_896F:
C - - - - - 0x03497F 1A:896F: 4C AC 85  JMP loc_85AC



tbl_8975_сценарий_после_обводки_кипера:
- D 0 - - - 0x034985 1A:8975: 56        .byte $56     ; защитник отобъет удар
- D 0 - - - 0x034986 1A:8976: 45        .byte $45     ; защитник промахнется
- D 0 - - - 0x034987 1A:8977: 00        .byte $00     ; гол (последний вариант)



loc_8978:
C D 0 - - - 0x034988 1A:8978: A9 02     LDA #con_bsw_1C_00
C - - - - - 0x03498A 1A:897A: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03498D 1A:897D: 20 72 8F  JSR sub_8F72
C - - - - - 0x034990 1A:8980: A9 0E     LDA #con_s_id_0E
C - - - - - 0x034992 1A:8982: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034995 1A:8985: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034998 1A:8988: D0 09     BNE bra_8993
C - - - - - 0x03499A 1A:898A: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x03499D 1A:898D: 20 DD 90  JSR sub_90DD_уменьшить_таймер_времени_тайма_изза_действия_атаки
C - - - - - 0x0349A0 1A:8990: 4C 6F 8A  JMP loc_8A6F
bra_8993:
C - - - - - 0x0349A3 1A:8993: A9 00     LDA #$00
C - - - - - 0x0349A5 1A:8995: 8D 16 06  STA ram_индекс_защитника
bra_8998_loop:
C - - - - - 0x0349A8 1A:8998: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0349AB 1A:899B: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x0349AE 1A:899E: C9 06     CMP #$06
C - - - - - 0x0349B0 1A:89A0: F0 19     BEQ bra_89BB
C - - - - - 0x0349B2 1A:89A2: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0349B5 1A:89A5: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0349B8 1A:89A8: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0349BB 1A:89AB: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0349BE 1A:89AE: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0349C1 1A:89B1: A9 0F     LDA #con_s_id_0F
C - - - - - 0x0349C3 1A:89B3: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0349C6 1A:89B6: A9 14     LDA #$14
C - - - - - 0x0349C8 1A:89B8: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_89BB:
C - - - - - 0x0349CB 1A:89BB: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x0349CE 1A:89BE: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0349D1 1A:89C1: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x0349D4 1A:89C4: D0 D2     BNE bra_8998_loop
C - - - - - 0x0349D6 1A:89C6: A9 04     LDA #con_s_id_04
C - - - - - 0x0349D8 1A:89C8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0349DB 1A:89CB: A9 00     LDA #$00
C - - - - - 0x0349DD 1A:89CD: 8D 16 06  STA ram_индекс_защитника
loc_89D0_loop:
C D 0 - - - 0x0349E0 1A:89D0: A9 01     LDA #$01
C - - - - - 0x0349E2 1A:89D2: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0349E5 1A:89D5: A9 00     LDA #$00
C - - - - - 0x0349E7 1A:89D7: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0349EA 1A:89DA: AE 16 06  LDX ram_индекс_защитника
C - - - - - 0x0349ED 1A:89DD: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x0349F0 1A:89E0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x0349F3 1A:89E3: BD 06 06  LDA ram_подтип_действия_защитника,X
C - - - - - 0x0349F6 1A:89E6: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x0349F9 1A:89E9: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x0349FC 1A:89EC: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x0349FF 1A:89EF: C9 06     CMP #$06
C - - - - - 0x034A01 1A:89F1: D0 03     BNE bra_89F6
C - - - - - 0x034A03 1A:89F3: 4C 4F 8A  JMP loc_8A4F
bra_89F6:
C - - - - - 0x034A06 1A:89F6: C9 05     CMP #$05
C - - - - - 0x034A08 1A:89F8: D0 03     BNE bra_89FD
C - - - - - 0x034A0A 1A:89FA: 4C 4F 8A  JMP loc_8A4F
bra_89FD:
C - - - - - 0x034A0D 1A:89FD: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034A0F 1A:89FF: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034A12 1A:8A02: 20 F3 8F  JSR sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов
C - - - - - 0x034A15 1A:8A05: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x034A18 1A:8A08: BD 63 8A  LDA tbl_8A63_offset_attack,X
; * 04
C - - - - - 0x034A1B 1A:8A0B: 0A        ASL
C - - - - - 0x034A1C 1A:8A0C: 0A        ASL
C - - - - - 0x034A1D 1A:8A0D: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034A20 1A:8A10: 7D 6A 8A  ADC tbl_8A6A_offset_defense,X
C - - - - - 0x034A23 1A:8A13: AA        TAX
C - - - - - 0x034A24 1A:8A14: 0A        ASL
C - - - - - 0x034A25 1A:8A15: 85 3B     STA ram_003B_t10
C - - - - - 0x034A27 1A:8A17: A9 08     LDA #$08
C - - - - - 0x034A29 1A:8A19: BC E1 83  LDY tbl_83E1,X
C - - - - - 0x034A2C 1A:8A1C: 20 E9 8E  JSR sub_8EE9
bra_8A1F_loop:
C - - - - - 0x034A2F 1A:8A1F: DD AC 8A  CMP tbl_8AAC,X
C - - - - - 0x034A32 1A:8A22: B0 04     BCS bra_8A28
C - - - - - 0x034A34 1A:8A24: E8        INX
C - - - - - 0x034A35 1A:8A25: C8        INY
C - - - - - 0x034A36 1A:8A26: D0 F7     BNE bra_8A1F_loop
bra_8A28:
C - - - - - 0x034A38 1A:8A28: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034A3B 1A:8A2B: A9 11     LDA #con_s_id_11
C - - - - - 0x034A3D 1A:8A2D: A2 01     LDX #$01
C - - - - - 0x034A3F 1A:8A2F: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x034A42 1A:8A32: C0 02     CPY #$02
C - - - - - 0x034A44 1A:8A34: 90 03     BCC bra_8A39
C - - - - - 0x034A46 1A:8A36: CA        DEX ; 00
C - - - - - 0x034A47 1A:8A37: A9 10     LDA #con_s_id_10
bra_8A39:
C - - - - - 0x034A49 1A:8A39: 48        PHA
C - - - - - 0x034A4A 1A:8A3A: 8A        TXA
C - - - - - 0x034A4B 1A:8A3B: 4A        LSR
C - - - - - 0x034A4C 1A:8A3C: 20 95 90  JSR sub_9095
C - - - - - 0x034A4F 1A:8A3F: 68        PLA
C - - - - - 0x034A50 1A:8A40: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A53 1A:8A43: A9 12     LDA #con_s_id_12
C - - - - - 0x034A55 1A:8A45: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A58 1A:8A48: AC 12 06  LDY ram_результат_защитника
C - - - - - 0x034A5B 1A:8A4B: C0 02     CPY #$02
C - - - - - 0x034A5D 1A:8A4D: B0 11     BCS bra_8A60
loc_8A4F:
C D 0 - - - 0x034A5F 1A:8A4F: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x034A62 1A:8A52: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x034A65 1A:8A55: CD 00 06  CMP ram_колво_защитников
C - - - - - 0x034A68 1A:8A58: F0 03     BEQ bra_8A5D
C - - - - - 0x034A6A 1A:8A5A: 4C D0 89  JMP loc_89D0_loop
bra_8A5D:
C - - - - - 0x034A6D 1A:8A5D: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_8A60:
C - - - - - 0x034A70 1A:8A60: 4C 6F 8A  JMP loc_8A6F



tbl_8A63_offset_attack:
- - - - - - 0x034A73 1A:8A63: 00        .byte $00   ; 00 
- D 0 - - - 0x034A74 1A:8A64: 00        .byte $00   ; 01 
- - - - - - 0x034A75 1A:8A65: 00        .byte $00   ; 02 
- - - - - - 0x034A76 1A:8A66: 00        .byte $00   ; 03 
- D 0 - - - 0x034A77 1A:8A67: 01        .byte $01   ; 04 
- - - - - - 0x034A78 1A:8A68: 00        .byte $00   ; 05 
- D 0 - - - 0x034A79 1A:8A69: 02        .byte $02   ; 06 



tbl_8A6A_offset_defense:
- - - - - - 0x034A7A 1A:8A6A: 00        .byte $00   ; 00 
- - - - - - 0x034A7B 1A:8A6B: 00        .byte $00   ; 01 
- D 0 - - - 0x034A7C 1A:8A6C: 00        .byte $00   ; 02 
- - - - - - 0x034A7D 1A:8A6D: 00        .byte $00   ; 03 
- D 0 - - - 0x034A7E 1A:8A6E: 01        .byte $01   ; 04 



loc_8A6F:
C D 0 - - - 0x034A7F 1A:8A6F: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034A82 1A:8A72: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034A85 1A:8A75: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034A88 1A:8A78: 80 8A     .word ofs_045_8A80_00
- D 0 - I - 0x034A8A 1A:8A7A: 80 8A     .word ofs_045_8A80_01
- D 0 - I - 0x034A8C 1A:8A7C: DF 8B     .word ofs_045_8BDF_02
- D 0 - I - 0x034A8E 1A:8A7E: 9C 8A     .word ofs_045_8A9C_03



ofs_045_8A80_00:
ofs_045_8A80_01:
C - - J - - 0x034A90 1A:8A80: 20 BA 8B  JSR sub_8BBA
C - - - - - 0x034A93 1A:8A83: A9 13     LDA #con_s_id_13
C - - - - - 0x034A95 1A:8A85: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034A98 1A:8A88: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034A9B 1A:8A8B: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- - - - - - 0x034A9E 1A:8A8E: 00        .word $0000          ; 00
- D 0 - I - 0x034AA0 1A:8A90: 12 C6     .word ofs_041_0x03DE62_01
- - - - - - 0x034AA2 1A:8A92: 00        .word $0000          ; 02
- - - - - - 0x034AA4 1A:8A94: 00        .word $0000          ; 03
- D 0 - I - 0x034AA6 1A:8A96: 27 C6     .word ofs_041_0x03E55C_04
- - - - - - 0x034AA8 1A:8A98: 00        .word $0000          ; 05
- D 0 - I - 0x034AAA 1A:8A9A: 2D C6     .word ofs_041_0x03E698_06



ofs_045_8A9C_03:
C - - J - - 0x034AAC 1A:8A9C: 20 C8 8B  JSR sub_8BC8_начислить_опыт
C - - - - - 0x034AAF 1A:8A9F: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x034AB2 1A:8AA2: C9 02     CMP #$02
C - - - - - 0x034AB4 1A:8AA4: D0 03     BNE bra_8AA9
C - - - - - 0x034AB6 1A:8AA6: 4C DE 81  JMP loc_81DE
bra_8AA9:
C - - - - - 0x034AB9 1A:8AA9: 4C DF 8B  JMP loc_8BDF



tbl_8AAC:
- D 0 - - - 0x034ABC 1A:8AAC: A0        .byte $A0   ; 
- D 0 - - - 0x034ABD 1A:8AAD: 60        .byte $60   ; 
- D 0 - - - 0x034ABE 1A:8AAE: 40        .byte $40   ; 
- D 0 - - - 0x034ABF 1A:8AAF: 00        .byte $00   ; 


loc_8AB0:
C D 0 - - - 0x034AC0 1A:8AB0: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034AC3 1A:8AB3: A2 02     LDX #$02
C - - - - - 0x034AC5 1A:8AB5: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034AC8 1A:8AB8: AD E2 00  LDA ram_random + $01
C - - - - - 0x034ACB 1A:8ABB: 29 03     AND #$03
C - - - - - 0x034ACD 1A:8ABD: C9 03     CMP #$03
C - - - - - 0x034ACF 1A:8ABF: D0 02     BNE bra_8AC3
C - - - - - 0x034AD1 1A:8AC1: A9 00     LDA #$00
bra_8AC3:
C - - - - - 0x034AD3 1A:8AC3: 18        CLC
C - - - - - 0x034AD4 1A:8AC4: 69 03     ADC #$03
C - - - - - 0x034AD6 1A:8AC6: 85 3A     STA ram_003A_t48_порядковый_номер_игрока
C - - - - - 0x034AD8 1A:8AC8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034ADB 1A:8ACB: 49 0B     EOR #$0B
C - - - - - 0x034ADD 1A:8ACD: 18        CLC
C - - - - - 0x034ADE 1A:8ACE: 65 3A     ADC ram_003A_t48_порядковый_номер_игрока
C - - - - - 0x034AE0 1A:8AD0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - - 0x034AE3 1A:8AD3: 8D 01 06  STA ram_номер_защитника
C - - - - - 0x034AE6 1A:8AD6: A2 03     LDX #$03
C - - - - - 0x034AE8 1A:8AD8: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034AEB 1A:8ADB: A9 00     LDA #$00
C - - - - - 0x034AED 1A:8ADD: 8D 3D 04  STA ram_действие_защиты
C - - - - - 0x034AF0 1A:8AE0: A9 00     LDA #$00
C - - - - - 0x034AF2 1A:8AE2: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034AF5 1A:8AE5: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x034AF8 1A:8AE8: 20 72 8F  JSR sub_8F72
C - - - - - 0x034AFB 1A:8AEB: A9 07     LDA #con_bsw_1C_02
C - - - - - 0x034AFD 1A:8AED: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034B00 1A:8AF0: A9 0A     LDA #$0A
C - - - - - 0x034B02 1A:8AF2: A2 00     LDX #$00
C - - - - - 0x034B04 1A:8AF4: 86 3B     STX ram_003B_t10
C - - - - - 0x034B06 1A:8AF6: A2 80     LDX #$80
C - - - - - 0x034B08 1A:8AF8: 20 E9 8E  JSR sub_8EE9
C - - - - - 0x034B0B 1A:8AFB: A0 00     LDY #$00
C - - - - - 0x034B0D 1A:8AFD: AE 12 06  LDX ram_результат_защитника
C - - - - - 0x034B10 1A:8B00: D0 08     BNE bra_8B0A
bra_8B02_loop:
C - - - - - 0x034B12 1A:8B02: D9 46 8B  CMP tbl_8B46,Y
C - - - - - 0x034B15 1A:8B05: B0 03     BCS bra_8B0A
C - - - - - 0x034B17 1A:8B07: C8        INY
C - - - - - 0x034B18 1A:8B08: D0 F8     BNE bra_8B02_loop
bra_8B0A:
C - - - - - 0x034B1A 1A:8B0A: 20 48 81  STY ram_результат_защитника
C - - - - - 0x034B1D 1A:8B0D: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034B20 1A:8B10: A2 FE     LDX #$FE
C - - - - - 0x034B22 1A:8B12: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034B25 1A:8B15: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034B28 1A:8B18: A2 FD     LDX #$FD
C - - - - - 0x034B2A 1A:8B1A: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - - 0x034B2D 1A:8B1D: A9 14     LDA #con_s_id_14
C - - - - - 0x034B2F 1A:8B1F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034B32 1A:8B22: A9 00     LDA #$00
C - - - - - 0x034B34 1A:8B24: 8D 1A 06  STA ram_061A
C - - - - - 0x034B37 1A:8B27: A9 02     LDA #$02
C - - - - - 0x034B39 1A:8B29: 8D FF 05  STA ram_05FF
C - - - - - 0x034B3C 1A:8B2C: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034B3F 1A:8B2F: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x034B42 1A:8B32: 1B C6     .word ofs_039_0x03DD12_00
- D 0 - I - 0x034B44 1A:8B34: 1B C6     .word ofs_039_0x03DD12_01
- D 0 - I - 0x034B46 1A:8B36: DF 8B     .word ofs_039_8BDF_02
- D 0 - I - 0x034B48 1A:8B38: D5 88     .word ofs_039_88D5_03



sub_8B3A_изменить_уровень_игрока:
; может как повышаться, так и понижаться
C - - - - - 0x034B4A 1A:8B3A: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034B4D 1A:8B3D: A0 03     LDY #con_plr_lvl
C - - - - - 0x034B4F 1A:8B3F: 8A        TXA
C - - - - - 0x034B50 1A:8B40: 18        CLC
C - - - - - 0x034B51 1A:8B41: 71 34     ADC (ram_plr_data),Y    ; con_plr_lvl
C - - - - - 0x034B53 1A:8B43: 91 34     STA (ram_plr_data),Y    ; con_plr_lvl
C - - - - - 0x034B55 1A:8B45: 60        RTS



tbl_8B46:
- D 0 - - - 0x034B56 1A:8B46: A0        .byte $A0   ; 
- D 0 - - - 0x034B57 1A:8B47: 60        .byte $60   ; 
- D 0 - - - 0x034B58 1A:8B48: 40        .byte $40   ; 
- D 0 - - - 0x034B59 1A:8B49: 00        .byte $00   ; 


sub_8B4A:
sub_0x034B5A:
C D 0 - - - 0x034B5A 1A:8B4A: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x034B5D 1A:8B4D: B0 01     BCS bra_8B50
C - - - - - 0x034B5F 1A:8B4F: 60        RTS
bra_8B50:
C - - - - - 0x034B60 1A:8B50: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x034B63 1A:8B53: A9 00     LDA #$00
C - - - - - 0x034B65 1A:8B55: 8D 00 06  STA ram_колво_защитников
C - - - - - 0x034B68 1A:8B58: 8A        TXA
C - - - - - 0x034B69 1A:8B59: A2 02     LDX #$02
C - - - - - 0x034B6B 1A:8B5B: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x034B6E 1A:8B5E: F0 02     BEQ bra_8B62_команда_справа
; if мяч у команды слева (да, комменты по идее правильные)
C - - - - - 0x034B70 1A:8B60: A2 01     LDX #$01
bra_8B62_команда_справа:
C - - - - - 0x034B72 1A:8B62: 8E 21 06  STX ram_0621
C - - - - - 0x034B75 1A:8B65: A9 FF     LDA #$FF
C - - - - - 0x034B77 1A:8B67: 8D 1A 06  STA ram_061A
C - - - - - 0x034B7A 1A:8B6A: 20 E1 87  JSR sub_87E1
C - - - - - 0x034B7D 1A:8B6D: A2 50     LDX #$50
C - - - - - 0x034B7F 1A:8B6F: 9A        TXS
C D 0 - - - 0x034B83 1A:8B73: A9 0A     LDA #$0A
C - - - - - 0x034B85 1A:8B75: 20 09 C6  JSR sub_0x03E4E7_вычислить_защитников_для_нападения_на_атакующего
C - - - - - 0x034B88 1A:8B78: A9 3F     LDA #con_s_id_3F
C - - - - - 0x034B8A 1A:8B7A: AE 21 06  LDX ram_0621
C - - - - - 0x034B8D 1A:8B7D: E0 02     CPX #$02
C - - - - - 0x034B8F 1A:8B7F: F0 05     BEQ bra_8B86
C - - - - - 0x034B91 1A:8B81: 20 8F 84  JSR sub_848F
C - - - - - 0x034B94 1A:8B84: A9 2F     LDA #con_s_id_2F
bra_8B86:
C - - - - - 0x034B96 1A:8B86: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034B99 1A:8B89: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - - 0x034B9C 1A:8B8C: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x034B9F 1A:8B8F: AD 21 06  LDA ram_0621
C - - - - - 0x034BA2 1A:8B92: C9 01     CMP #$01
C - - - - - 0x034BA4 1A:8B94: D0 03     BNE bra_8B99
C - - - - - 0x034BA6 1A:8B96: 4C 98 82  JMP loc_8298
bra_8B99:
C - - - - - 0x034BA9 1A:8B99: 4C 78 89  JMP loc_8978



sub_8B9C:
C - - - - - 0x034BAC 1A:8B9C: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034BAF 1A:8B9F: C9 60     CMP #$60
C - - - - - 0x034BB1 1A:8BA1: 90 13     BCC bra_8BB6
C - - - - - 0x034BB3 1A:8BA3: C9 A0     CMP #$A0
C - - - - - 0x034BB5 1A:8BA5: B0 0F     BCS bra_8BB6
C - - - - - 0x034BB7 1A:8BA7: A2 00     LDX #$00
C - - - - - 0x034BB9 1A:8BA9: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034BBC 1A:8BAC: C9 50     CMP #$50
C - - - - - 0x034BBE 1A:8BAE: 90 08     BCC bra_8BB8
C - - - - - 0x034BC0 1A:8BB0: A2 0B     LDX #$0B
C - - - - - 0x034BC2 1A:8BB2: C9 B0     CMP #$B0
C - - - - - 0x034BC4 1A:8BB4: B0 02     BCS bra_8BB8
bra_8BB6:
C - - - - - 0x034BC6 1A:8BB6: 18        CLC
C - - - - - 0x034BC7 1A:8BB7: 60        RTS
bra_8BB8:
C - - - - - 0x034BC8 1A:8BB8: 38        SEC
C - - - - - 0x034BC9 1A:8BB9: 60        RTS



sub_8BBA:
C - - - - - 0x034BCA 1A:8BBA: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034BCD 1A:8BBD: F0 08     BEQ bra_8BC7_RTS
C - - - - - 0x034BCF 1A:8BBF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034BD2 1A:8BC2: A2 01     LDX #$01
C - - - - - 0x034BD4 1A:8BC4: 4C D4 8B  JMP loc_8BD4_начислить_опыт
bra_8BC7_RTS:
C - - - - - 0x034BD7 1A:8BC7: 60        RTS



sub_8BC8_начислить_опыт:
C - - - - - 0x034BD8 1A:8BC8: A2 03     LDX #$03
C - - - - - 0x034BDA 1A:8BCA: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034BDD 1A:8BCD: F0 05     BEQ bra_8BD4_это_кипер
C - - - - - 0x034BDF 1A:8BCF: C9 0B     CMP #$0B
C - - - - - 0x034BE1 1A:8BD1: F0 01     BEQ bra_8BD4_это_кипер
C - - - - - 0x034BE3 1A:8BD3: CA        DEX ; 02
bra_8BD4_это_кипер:
sub_8BD4_начислить_опыт:
loc_8BD4_начислить_опыт:
C D 0 - - - 0x034BE4 1A:8BD4: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034BE7 1A:8BD7: A0 00     LDY #con_plr_id
C - - - - - 0x034BE9 1A:8BD9: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
                                        BEQ bra_8BDE_RTS    ; if con_p_clone
                                        CMP #$23
                                        BCS bra_8BDE_RTS    ; if игрок команды соперника
; if игрок из нашей команды
C - - - - - 0x034BEB 1A:8BDB: 20 C8 C4  JMP loc_0x03C4D8_начислить_опыт
bra_8BDE_RTS:
C - - - - - 0x034BEE 1A:8BDE: 60        RTS



loc_8BDF:
ofs_039_8BDF_02:
ofs_044_8972_02:
ofs_045_8BDF_02:
ofs_063_8BDF_01:
C D 0 - - - 0x034BEF 1A:8BDF: 20 70 90  JSR sub_9070
C - - - - - 0x034BF2 1A:8BE2: 20 6D 8C  JSR sub_8C6D
loc_8BE5:
loc_0x034BF5:
C D 0 - - - 0x034BF5 1A:8BE5: 20 06 C6  JSR sub_0x03E084
C - - - - - 0x034BF8 1A:8BE8: 20 42 8C  JSR sub_8C42
C - - - - - 0x034BFB 1A:8BEB: B0 25     BCS bra_8C12
C - - - - - 0x034BFD 1A:8BED: A9 00     LDA #$00
C - - - - - 0x034BFF 1A:8BEF: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - - 0x034C02 1A:8BF2: 85 3A     STA ram_003A_t49
C - - - - - 0x034C04 1A:8BF4: A5 47     LDA ram_0047_t06
C - - - - - 0x034C06 1A:8BF6: 48        PHA
C - - - - - 0x034C07 1A:8BF7: A9 0B     LDA #$0B
C - - - - - 0x034C09 1A:8BF9: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - - 0x034C0C 1A:8BFC: AA        TAX
C - - - - - 0x034C0D 1A:8BFD: 68        PLA
C - - - - - 0x034C0E 1A:8BFE: C5 47     CMP ram_0047_t06
C - - - - - 0x034C10 1A:8C00: 90 0E     BCC bra_8C10
C - - - - - 0x034C12 1A:8C02: F0 05     BEQ bra_8C09
C - - - - - 0x034C14 1A:8C04: 86 3A     STX ram_003A_t49
C - - - - - 0x034C16 1A:8C06: 4C 10 8C  JMP loc_8C10
bra_8C09:
C - - - - - 0x034C19 1A:8C09: 2C E2 00  BIT ram_random + $01
C - - - - - 0x034C1C 1A:8C0C: 10 02     BPL bra_8C10
C - - - - - 0x034C1E 1A:8C0E: 86 3A     STX ram_003A_t49
bra_8C10:
loc_8C10:
C D 0 - - - 0x034C20 1A:8C10: A5 3A     LDA ram_003A_t49
bra_8C12:
C - - - - - 0x034C22 1A:8C12: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x034C25 1A:8C15: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034C28 1A:8C18: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034C2B 1A:8C1B: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x034C2D 1A:8C1D: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034C30 1A:8C20: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x034C32 1A:8C22: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x034C34 1A:8C24: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034C37 1A:8C27: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x034C39 1A:8C29: A9 00     LDA #$00
C - - - - - 0x034C3B 1A:8C2B: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034C3E 1A:8C2E: 20 24 C6  JSR sub_0x03DCEF_рандом_высоты_мяча
C - - - - - 0x034C41 1A:8C31: 20 4A 8B  JSR sub_8B4A
C - - - - - 0x034C44 1A:8C34: A9 2C     LDA #con_s_id_2C
C - - - - - 0x034C46 1A:8C36: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034C49 1A:8C39: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - - 0x034C4C 1A:8C3C: A2 50     LDX #$50
C - - - - - 0x034C4E 1A:8C3E: 9A        TXS
C - - - - - 0x034C4F 1A:8C3F: 4C 0F C6  JMP loc_0x03E0EF



sub_8C42:
C - - - - - 0x034C52 1A:8C42: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034C55 1A:8C45: F0 18     BEQ bra_8C5F
C - - - - - 0x034C57 1A:8C47: A2 00     LDX #$00
bra_8C49_loop:
C - - - - - 0x034C59 1A:8C49: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034C5C 1A:8C4C: F0 0B     BEQ bra_8C59
C - - - - - 0x034C5E 1A:8C4E: C9 0B     CMP #$0B
C - - - - - 0x034C60 1A:8C50: F0 07     BEQ bra_8C59
C - - - - - 0x034C62 1A:8C52: BD 0B 06  LDA ram_действие_защитника,X
C - - - - - 0x034C65 1A:8C55: C9 05     CMP #$05
C - - - - - 0x034C67 1A:8C57: F0 08     BEQ bra_8C61
bra_8C59:
C - - - - - 0x034C69 1A:8C59: E8        INX
C - - - - - 0x034C6A 1A:8C5A: EC 00 06  CPX ram_колво_защитников
C - - - - - 0x034C6D 1A:8C5D: D0 EA     BNE bra_8C49_loop
bra_8C5F:
C - - - - - 0x034C6F 1A:8C5F: 18        CLC
C - - - - - 0x034C70 1A:8C60: 60        RTS
bra_8C61:
C - - - - - 0x034C71 1A:8C61: AD E2 00  LDA ram_random + $01
C - - - - - 0x034C74 1A:8C64: C9 40     CMP #$40
C - - - - - 0x034C76 1A:8C66: B0 F7     BCS bra_8C5F
C - - - - - 0x034C78 1A:8C68: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x034C7B 1A:8C6B: 38        SEC
C - - - - - 0x034C7C 1A:8C6C: 60        RTS



sub_8C6D:
C - - - - - 0x034C7D 1A:8C6D: AD E2 00  LDA ram_random + $01
C - - - - - 0x034C80 1A:8C70: 29 83     AND #$83
C - - - - - 0x034C82 1A:8C72: AE 37 06  LDX ram_ball_pos_Y_hi
C - - - - - 0x034C85 1A:8C75: 20 92 8C  JSR sub_8C92
C - - - - - 0x034C88 1A:8C78: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x034C8B 1A:8C7B: AD E3 00  LDA ram_random + $02
C - - - - - 0x034C8E 1A:8C7E: 29 83     AND #$83
C - - - - - 0x034C90 1A:8C80: 8D 2C 06  STA ram_062C
C - - - - - 0x034C93 1A:8C83: AE 35 06  LDX ram_ball_pos_X_hi
C - - - - - 0x034C96 1A:8C86: 20 92 8C  JSR sub_8C92
C - - - - - 0x034C99 1A:8C89: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x034C9C 1A:8C8C: A9 00     LDA #$00
C - - - - - 0x034C9E 1A:8C8E: 20 A4 8C  JMP loc_8CA4



sub_8C92:
; * 08
C - - - - - 0x034CA2 1A:8C92: 0A        ASL
C - - - - - 0x034CA3 1A:8C93: 08        PHP
C - - - - - 0x034CA4 1A:8C94: 0A        ASL
C - - - - - 0x034CA5 1A:8C95: 0A        ASL
C - - - - - 0x034CA6 1A:8C96: 28        PLP
C - - - - - 0x034CA7 1A:8C97: 90 04     BCC bra_8C9D
C - - - - - 0x034CA9 1A:8C99: 49 FF     EOR #$FF
C - - - - - 0x034CAB 1A:8C9B: 69 00     ADC #$00
bra_8C9D:
C - - - - - 0x034CAD 1A:8C9D: 85 3A     STA ram_003A_t50
C - - - - - 0x034CAF 1A:8C9F: 8A        TXA
C - - - - - 0x034CB0 1A:8CA0: 18        CLC
C - - - - - 0x034CB1 1A:8CA1: 65 3A     ADC ram_003A_t50
C - - - - - 0x034CB3 1A:8CA3: 60        RTS



loc_8CA4:
sub_0x034CB4:
C D 0 - - - 0x034CB4 1A:8CA4: 4A        LSR
C - - - - - 0x034CB5 1A:8CA5: 08        PHP
C - - - - - 0x034CB6 1A:8CA6: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x034CB9 1A:8CA9: C9 30     CMP #$30
C - - - - - 0x034CBB 1A:8CAB: 90 1E     BCC bra_8CCB
C - - - - - 0x034CBD 1A:8CAD: C9 D0     CMP #$D0
C - - - - - 0x034CBF 1A:8CAF: B0 1A     BCS bra_8CCB
C - - - - - 0x034CC1 1A:8CB1: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x034CC4 1A:8CB4: C9 50     CMP #$50
C - - - - - 0x034CC6 1A:8CB6: 90 06     BCC bra_8CBE
C - - - - - 0x034CC8 1A:8CB8: C9 B0     CMP #$B0
C - - - - - 0x034CCA 1A:8CBA: B0 02     BCS bra_8CBE
C - - - - - 0x034CCC 1A:8CBC: 28        PLP
C - - - - - 0x034CCD 1A:8CBD: 60        RTS
bra_8CBE:
C - - - - - 0x034CCE 1A:8CBE: 28        PLP
C - - - - - 0x034CCF 1A:8CBF: 20 EA 8C  JSR sub_8CEA
C - - - - - 0x034CD2 1A:8CC2: 20 5A C5  JSR sub_0x03CF5F
C - - - - - 0x034CD5 1A:8CC5: A2 50     LDX #$50
C - - - - - 0x034CD7 1A:8CC7: 9A        TXS
C - - - - - 0x034CD8 1A:8CC8: 4C 1C 91  JMP loc_911C
bra_8CCB:
C - - - - - 0x034CDB 1A:8CCB: 28        PLP
C - - - - - 0x034CDC 1A:8CCC: 20 EA 8C  JSR sub_8CEA
C - - - - - 0x034CDF 1A:8CCF: 20 5A C5  JSR sub_0x03CF5F
C - - - - - 0x034CE2 1A:8CD2: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034CE5 1A:8CD5: F0 02     BEQ bra_8CD9_команда_слева
; if мяч у команды справа
C - - - - - 0x034CE7 1A:8CD7: A9 80     LDA #$80
bra_8CD9_команда_слева:
C - - - - - 0x034CE9 1A:8CD9: 4D 35 06  EOR ram_ball_pos_X_hi    ; A = 00, bzk optimize, небезопасно
C - - - - - 0x034CEC 1A:8CDC: 10 06     BPL bra_8CE4
C - - - - - 0x034CEE 1A:8CDE: A2 50     LDX #$50
C - - - - - 0x034CF0 1A:8CE0: 9A        TXS
C - - - - - 0x034CF1 1A:8CE1: 4C EE 92  JMP loc_92EE
bra_8CE4:
C - - - - - 0x034CF4 1A:8CE4: A2 50     LDX #$50
C - - - - - 0x034CF6 1A:8CE6: 9A        TXS
C - - - - - 0x034CF7 1A:8CE7: 4C 5E 95  JMP loc_955E_очистить_stun_кипера_команды



sub_8CEA:
C - - - - - 0x034CFA 1A:8CEA: 90 08     BCC bra_8CF4_RTS
C - - - - - 0x034CFC 1A:8CEC: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034CFF 1A:8CEF: 49 0B     EOR #$0B
C - - - - - 0x034D01 1A:8CF1: 8D FB 05  STA ram_команда_с_мячом
bra_8CF4_RTS:
C - - - - - 0x034D04 1A:8CF4: 60        RTS



sub_8CF5:
C - - - - - 0x034D06 1A:8CF6: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
; судя по новому логу, только для кипера соперника?
C - - - - - 0x034D0A 1A:8CFA: A0 07     LDY #con_gk_величина_наебки
                                        LDA (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x034D0C 1A:8CFC: 18        CLC
C - - - - - 0x034D0D 1A:8CFD: 71 34     ADC #$24
C - - - - - 0x034D0F 1A:8CFF: 10 02     BPL bra_8D03_not_overflow
- - - - - - 0x034D11 1A:8D01: A9 7F     LDA #$7F
bra_8D03_not_overflow:
; судя по новому логу, только для кипера соперника?
C - - - - - 0x034D13 1A:8D03: 91 34     STA (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x034D15 1A:8D05: 60        RTS



sub_8D06:
; out
    ; ram_0071_t01_система_счисления_ХЗ
; бряк срабатывает при вычислении шанса успеха отбора мяча при каком-то соперничестве?
C - - - - - 0x034D16 1A:8D06: 08        PHP
C - - - - - 0x034D17 1A:8D07: 0A        ASL
C - - - - - 0x034D18 1A:8D08: AA        TAX
C - - - - - 0x034D19 1A:8D09: BD 93 8D  LDA tbl_8D93,X
C - - - - - 0x034D1C 1A:8D0C: 85 3C     STA ram_003C_t02_data
C - - - - - 0x034D1E 1A:8D0E: BD 94 8D  LDA tbl_8D93 + $01,X
C - - - - - 0x034D21 1A:8D11: 85 3D     STA ram_003C_t02_data + $01
C - - - - - 0x034D23 1A:8D13: AD E2 00  LDA ram_random + $01
C - - - - - 0x034D26 1A:8D16: 6D E3 00  ADC ram_random + $02
C - - - - - 0x034D29 1A:8D19: 6A        ROR
C - - - - - 0x034D2A 1A:8D1A: A2 00     LDX #$00
C - - - - - 0x034D2C 1A:8D1C: 28        PLP
C - - - - - 0x034D2D 1A:8D1D: 10 2B     BPL bra_8D4A
C - - - - - 0x034D2F 1A:8D1F: 24 3A     BIT ram_003A_t33_flag
C - - - - - 0x034D31 1A:8D21: 30 27     BMI bra_8D4A
C - - - - - 0x034D33 1A:8D23: AC 21 06  LDY ram_0621
C - - - - - 0x034D36 1A:8D26: C0 04     CPY #$04
C - - - - - 0x034D38 1A:8D28: D0 09     BNE bra_8D33
C - - - - - 0x034D3A 1A:8D2A: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x034D3D 1A:8D2D: F0 0B     BEQ bra_8D3A_это_кипер
C - - - - - 0x034D3F 1A:8D2F: C0 0B     CPY #$0B
C - - - - - 0x034D41 1A:8D31: F0 07     BEQ bra_8D3A_это_кипер
bra_8D33:
C - - - - - 0x034D43 1A:8D33: AC E3 00  LDY ram_random + $02
C - - - - - 0x034D46 1A:8D36: C0 F8     CPY #$F8      ; шанс крита (kurae)
C - - - - - 0x034D48 1A:8D38: 90 10     BCC bra_8D4A
bra_8D3A_это_кипер:
C - - - - - 0x034D4A 1A:8D3A: E8        INX
C - - - - - 0x034D4B 1A:8D3B: A8        TAY
C - - - - - 0x034D4C 1A:8D3C: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - - 0x034D4F 1A:8D3F: 09 80     ORA #$80
C - - - - - 0x034D51 1A:8D41: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x034D54 1A:8D44: 98        TYA
C - - - - - 0x034D55 1A:8D45: 29 7F     AND #$7F
C - - - - - 0x034D57 1A:8D47: 4C 60 8D  JMP loc_8D60
bra_8D4A:
C - - - - - 0x034D5A 1A:8D4A: A4 3B     LDY ram_003B_t10
loc_8D4C_loop:
C D 0 - - - 0x034D5C 1A:8D4C: D1 3C     CMP (ram_003C_t02_data),Y
C - - - - - 0x034D5E 1A:8D4E: 90 07     BCC bra_8D57
C - - - - - 0x034D60 1A:8D50: F0 05     BEQ bra_8D57
C - - - - - 0x034D62 1A:8D52: F1 3C     SBC (ram_003C_t02_data),Y
C - - - - - 0x034D64 1A:8D54: 4C 4C 8D  JMP loc_8D4C_loop
bra_8D57:
C - - - - - 0x034D67 1A:8D57: A2 00     LDX #$00
C - - - - - 0x034D69 1A:8D59: C8        INY
C - - - - - 0x034D6A 1A:8D5A: 18        CLC
C - - - - - 0x034D6B 1A:8D5B: 71 3C     ADC (ram_003C_t02_data),Y
C - - - - - 0x034D6D 1A:8D5D: 90 01     BCC bra_8D60
C - - - - - 0x034D6F 1A:8D5F: E8        INX ; 01
bra_8D60:
loc_8D60:
C D 0 - - - 0x034D70 1A:8D60: 24 3A     BIT ram_003A_t33_flag
C - - - - - 0x034D72 1A:8D62: 10 10     BPL bra_8D74
; / 10
C - - - - - 0x034D74 1A:8D64: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034D76 1A:8D66: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034D78 1A:8D68: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034D7A 1A:8D6A: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034D7C 1A:8D6C: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034D7E 1A:8D6E: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034D80 1A:8D70: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034D82 1A:8D72: 66 32     ROR ram_0032_t12_lo
bra_8D74:
C - - - - - 0x034D84 1A:8D74: 85 67     STA ram_0067_t02_множитель_lo_1
C - - - - - 0x034D86 1A:8D76: 86 68     STX ram_0068_t02_множитель_hi_1
C - - - - - 0x034D88 1A:8D78: A5 32     LDA ram_0032_t12_lo
C - - - - - 0x034D8A 1A:8D7A: 85 69     STA ram_0069_t01_множитель_lo_2
C - - - - - 0x034D8C 1A:8D7C: A5 33     LDA ram_0033_t03_hi
C - - - - - 0x034D8E 1A:8D7E: 85 6A     STA ram_006A_t01_множитель_2_hi
C - - - - - 0x034D90 1A:8D80: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034D98 1A:8D88: A5 6C     LDA ram_006B_t01_произведение + $01
C - - - - - 0x034D9A 1A:8D8A: A4 6D     LDY ram_006B_t01_произведение + $02
C - - - - - 0x034D9C 1A:8D8C: F0 02     BEQ bra_8D90
C - - - - - 0x034D9E 1A:8D8E: A9 FF     LDA #$FF
bra_8D90:
C - - - - - 0x034DA0 1A:8D90: 85 71     STA ram_0071_t01_система_счисления_ХЗ
C - - - - - 0x034DA2 1A:8D92: 60        RTS



tbl_8D93:
- D 0 - - - 0x034DA3 1A:8D93: A9 8D     .word off_8DA9_00
- D 0 - - - 0x034DA5 1A:8D95: C9 8D     .word off_8DC9_01
- - - - - - 0x034DA7 1A:8D97: C9 8D     .word off_8DC9_02
- D 0 - - - 0x034DA9 1A:8D99: E9 8D     .word off_8DE9_03
- D 0 - - - 0x034DAB 1A:8D9B: EB 8D     .word off_8DEB_04
- D 0 - - - 0x034DAD 1A:8D9D: F7 8D     .word off_8DF7_05
- - - - - - 0x034DAF 1A:8D9F: 17 8E     .word off_8E17_06
- - - - - - 0x034DB1 1A:8DA1: 17 8E     .word off_8E17_07
- D 0 - - - 0x034DB3 1A:8DA3: 17 8E     .word off_8E17_08
- D 0 - - - 0x034DB5 1A:8DA5: 31 8E     .word off_8E31_09
- D 0 - - - 0x034DB7 1A:8DA7: 2F 8E     .word off_8E2F_0A



off_8DA9_00:
- D 0 - I - 0x034DB9 1A:8DA9: C0        .byte $C0   ; 
- D 0 - I - 0x034DBA 1A:8DAA: 40        .byte $40   ; 
- D 0 - I - 0x034DBB 1A:8DAB: 99        .byte $99   ; 
- D 0 - I - 0x034DBC 1A:8DAC: 00        .byte $00   ; 
- D 0 - I - 0x034DBD 1A:8DAD: 99        .byte $99   ; 
- D 0 - I - 0x034DBE 1A:8DAE: 00        .byte $00   ; 
- - - - - - 0x034DBF 1A:8DAF: 00        .byte $00   ; 
- - - - - - 0x034DC0 1A:8DB0: 00        .byte $00   ; 
- D 0 - I - 0x034DC1 1A:8DB1: 99        .byte $99   ; 
- D 0 - I - 0x034DC2 1A:8DB2: 00        .byte $00   ; 
- D 0 - I - 0x034DC3 1A:8DB3: 99        .byte $99   ; 
- D 0 - I - 0x034DC4 1A:8DB4: 00        .byte $00   ; 
- D 0 - I - 0x034DC5 1A:8DB5: C0        .byte $C0   ; 
- D 0 - I - 0x034DC6 1A:8DB6: 40        .byte $40   ; 
- - - - - - 0x034DC7 1A:8DB7: 00        .byte $00   ; 
- - - - - - 0x034DC8 1A:8DB8: 00        .byte $00   ; 
- D 0 - I - 0x034DC9 1A:8DB9: 99        .byte $99   ; 
- D 0 - I - 0x034DCA 1A:8DBA: 00        .byte $00   ; 
- D 0 - I - 0x034DCB 1A:8DBB: C0        .byte $C0   ; 
- D 0 - I - 0x034DCC 1A:8DBC: 40        .byte $40   ; 
- D 0 - I - 0x034DCD 1A:8DBD: 99        .byte $99   ; 
- D 0 - I - 0x034DCE 1A:8DBE: 00        .byte $00   ; 
- - - - - - 0x034DCF 1A:8DBF: 00        .byte $00   ; 
- - - - - - 0x034DD0 1A:8DC0: 00        .byte $00   ; 
- D 0 - I - 0x034DD1 1A:8DC1: 99        .byte $99   ; 
- D 0 - I - 0x034DD2 1A:8DC2: 00        .byte $00   ; 
- D 0 - I - 0x034DD3 1A:8DC3: 99        .byte $99   ; 
- D 0 - I - 0x034DD4 1A:8DC4: 00        .byte $00   ; 
- D 0 - I - 0x034DD5 1A:8DC5: C0        .byte $C0   ; 
- D 0 - I - 0x034DD6 1A:8DC6: 40        .byte $40   ; 
- - - - - - 0x034DD7 1A:8DC7: 00        .byte $00   ; 
- - - - - - 0x034DD8 1A:8DC8: 00        .byte $00   ; 


off_8DC9_01:
off_8DC9_02:
- D 0 - I - 0x034DD9 1A:8DC9: 80        .byte $80   ; 
- D 0 - I - 0x034DDA 1A:8DCA: 80        .byte $80   ; 
- D 0 - I - 0x034DDB 1A:8DCB: C0        .byte $C0   ; 
- D 0 - I - 0x034DDC 1A:8DCC: 40        .byte $40   ; 
- D 0 - I - 0x034DDD 1A:8DCD: C0        .byte $C0   ; 
- D 0 - I - 0x034DDE 1A:8DCE: 40        .byte $40   ; 
- - - - - - 0x034DDF 1A:8DCF: 00        .byte $00   ; 
- - - - - - 0x034DE0 1A:8DD0: 00        .byte $00   ; 
- D 0 - I - 0x034DE1 1A:8DD1: 99        .byte $99   ; 
- D 0 - I - 0x034DE2 1A:8DD2: 00        .byte $00   ; 
- D 0 - I - 0x034DE3 1A:8DD3: 80        .byte $80   ; 
- D 0 - I - 0x034DE4 1A:8DD4: 80        .byte $80   ; 
- D 0 - I - 0x034DE5 1A:8DD5: 80        .byte $80   ; 
- D 0 - I - 0x034DE6 1A:8DD6: 80        .byte $80   ; 
- - - - - - 0x034DE7 1A:8DD7: 00        .byte $00   ; 
- - - - - - 0x034DE8 1A:8DD8: 00        .byte $00   ; 
- D 0 - I - 0x034DE9 1A:8DD9: 99        .byte $99   ; 
- D 0 - I - 0x034DEA 1A:8DDA: 00        .byte $00   ; 
- D 0 - I - 0x034DEB 1A:8DDB: C0        .byte $C0   ; 
- D 0 - I - 0x034DEC 1A:8DDC: 40        .byte $40   ; 
- D 0 - I - 0x034DED 1A:8DDD: 80        .byte $80   ; 
- D 0 - I - 0x034DEE 1A:8DDE: 80        .byte $80   ; 
- - - - - - 0x034DEF 1A:8DDF: 00        .byte $00   ; 
- - - - - - 0x034DF0 1A:8DE0: 00        .byte $00   ; 
- D 0 - I - 0x034DF1 1A:8DE1: C0        .byte $C0   ; 
- D 0 - I - 0x034DF2 1A:8DE2: 40        .byte $40   ; 
- D 0 - I - 0x034DF3 1A:8DE3: 99        .byte $99   ; 
- D 0 - I - 0x034DF4 1A:8DE4: 00        .byte $00   ; 
- D 0 - I - 0x034DF5 1A:8DE5: 99        .byte $99   ; 
- D 0 - I - 0x034DF6 1A:8DE6: 00        .byte $00   ; 
- - - - - - 0x034DF7 1A:8DE7: 00        .byte $00   ; 
- - - - - - 0x034DF8 1A:8DE8: 00        .byte $00   ; 


off_8DE9_03:
- D 0 - I - 0x034DF9 1A:8DE9: 80        .byte $80   ; 
- D 0 - I - 0x034DFA 1A:8DEA: 80        .byte $80   ; 


off_8DEB_04:
- D 0 - I - 0x034DFB 1A:8DEB: B3        .byte $B3   ; 
- D 0 - I - 0x034DFC 1A:8DEC: 00        .byte $00   ; 
- D 0 - I - 0x034DFD 1A:8DED: DA        .byte $DA   ; 
- D 0 - I - 0x034DFE 1A:8DEE: 25        .byte $25   ; 
- - - - - - 0x034DFF 1A:8DEF: 00        .byte $00   ; 
- - - - - - 0x034E00 1A:8DF0: 00        .byte $00   ; 
- - - - - - 0x034E01 1A:8DF1: 00        .byte $00   ; 
- - - - - - 0x034E02 1A:8DF2: 00        .byte $00   ; 
- D 0 - I - 0x034E03 1A:8DF3: CD        .byte $CD   ; 
- D 0 - I - 0x034E04 1A:8DF4: 32        .byte $32   ; 
- D 0 - I - 0x034E05 1A:8DF5: BF        .byte $BF   ; 
- D 0 - I - 0x034E06 1A:8DF6: 00        .byte $00   ; 


off_8DF7_05:
- D 0 - I - 0x034E07 1A:8DF7: C0        .byte $C0   ; 
- D 0 - I - 0x034E08 1A:8DF8: 40        .byte $40   ; 
- - - - - - 0x034E09 1A:8DF9: 00        .byte $00   ; 
- - - - - - 0x034E0A 1A:8DFA: 00        .byte $00   ; 
- - - - - - 0x034E0B 1A:8DFB: 00        .byte $00   ; 
- - - - - - 0x034E0C 1A:8DFC: 00        .byte $00   ; 
- - - - - - 0x034E0D 1A:8DFD: 00        .byte $00   ; 
- - - - - - 0x034E0E 1A:8DFE: 00        .byte $00   ; 
- - - - - - 0x034E0F 1A:8DFF: 00        .byte $00   ; 
- - - - - - 0x034E10 1A:8E00: 00        .byte $00   ; 
- - - - - - 0x034E11 1A:8E01: 00        .byte $00   ; 
- - - - - - 0x034E12 1A:8E02: 00        .byte $00   ; 
- D 0 - I - 0x034E13 1A:8E03: E6        .byte $E6   ; 
- D 0 - I - 0x034E14 1A:8E04: 00        .byte $00   ; 
- - - - - - 0x034E15 1A:8E05: 00        .byte $00   ; 
- - - - - - 0x034E16 1A:8E06: 00        .byte $00   ; 
- - - - - - 0x034E17 1A:8E07: 00        .byte $00   ; 
- - - - - - 0x034E18 1A:8E08: 00        .byte $00   ; 
- - - - - - 0x034E19 1A:8E09: 00        .byte $00   ; 
- - - - - - 0x034E1A 1A:8E0A: 00        .byte $00   ; 
- - - - - - 0x034E1B 1A:8E0B: 00        .byte $00   ; 
- - - - - - 0x034E1C 1A:8E0C: 00        .byte $00   ; 
- - - - - - 0x034E1D 1A:8E0D: 00        .byte $00   ; 
- - - - - - 0x034E1E 1A:8E0E: 00        .byte $00   ; 
- - - - - - 0x034E1F 1A:8E0F: 00        .byte $00   ; 
- - - - - - 0x034E20 1A:8E10: 00        .byte $00   ; 
- - - - - - 0x034E21 1A:8E11: 00        .byte $00   ; 
- - - - - - 0x034E22 1A:8E12: 00        .byte $00   ; 
- D 0 - I - 0x034E23 1A:8E13: 80        .byte $80   ; 
- D 0 - I - 0x034E24 1A:8E14: 80        .byte $80   ; 
- - - - - - 0x034E25 1A:8E15: 00        .byte $00   ; 
- - - - - - 0x034E26 1A:8E16: 00        .byte $00   ; 


off_8E17_06:
off_8E17_07:
off_8E17_08:
- D 0 - I - 0x034E27 1A:8E17: 80        .byte $80   ; 
- D 0 - I - 0x034E28 1A:8E18: 80        .byte $80   ; 
- D 0 - I - 0x034E29 1A:8E19: 80        .byte $80   ; 
- D 0 - I - 0x034E2A 1A:8E1A: 80        .byte $80   ; 
- - - - - - 0x034E2B 1A:8E1B: 00        .byte $00   ; 
- - - - - - 0x034E2C 1A:8E1C: 00        .byte $00   ; 
- - - - - - 0x034E2D 1A:8E1D: 00        .byte $00   ; 
- - - - - - 0x034E2E 1A:8E1E: 00        .byte $00   ; 
- D 0 - I - 0x034E2F 1A:8E1F: C0        .byte $C0   ; 
- D 0 - I - 0x034E30 1A:8E20: 40        .byte $40   ; 
- D 0 - I - 0x034E31 1A:8E21: 80        .byte $80   ; 
- D 0 - I - 0x034E32 1A:8E22: 80        .byte $80   ; 
- - - - - - 0x034E33 1A:8E23: 00        .byte $00   ; 
- - - - - - 0x034E34 1A:8E24: 00        .byte $00   ; 
- - - - - - 0x034E35 1A:8E25: 00        .byte $00   ; 
- - - - - - 0x034E36 1A:8E26: 00        .byte $00   ; 
- D 0 - I - 0x034E37 1A:8E27: 99        .byte $99   ; 
- D 0 - I - 0x034E38 1A:8E28: 00        .byte $00   ; 
- D 0 - I - 0x034E39 1A:8E29: C0        .byte $C0   ; 
- D 0 - I - 0x034E3A 1A:8E2A: 40        .byte $40   ; 
- - - - - - 0x034E3B 1A:8E2B: 00        .byte $00   ; 
- - - - - - 0x034E3C 1A:8E2C: 00        .byte $00   ; 
- - - - - - 0x034E3D 1A:8E2D: 00        .byte $00   ; 
- - - - - - 0x034E3E 1A:8E2E: 00        .byte $00   ; 


off_8E2F_0A:
- D 0 - I - 0x034E3F 1A:8E2F: 80        .byte $80   ; 
- D 0 - I - 0x034E40 1A:8E30: 80        .byte $80   ; 


off_8E31_09:
- D 0 - I - 0x034E41 1A:8E31: 80        .byte $80   ; 
- D 0 - I - 0x034E42 1A:8E32: 80        .byte $80   ; 


sub_8E33:
C - - - - - 0x034E43 1A:8E33: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034E46 1A:8E36: F0 35     BEQ bra_8E6D_RTS
C - - - - - 0x034E48 1A:8E38: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x034E4B 1A:8E3B: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x034E4E 1A:8E3E: F0 04     BEQ bra_8E44
C - - - - - 0x034E50 1A:8E40: C9 0B     CMP #$0B
C - - - - - 0x034E52 1A:8E42: D0 06     BNE bra_8E4A
bra_8E44:
C - - - - - 0x034E54 1A:8E44: E0 04     CPX #$04
C - - - - - 0x034E56 1A:8E46: F0 25     BEQ bra_8E6D_RTS
C - - - - - 0x034E58 1A:8E48: D0 08     BNE bra_8E52    ; jmp
bra_8E4A:
C - - - - - 0x034E5A 1A:8E4A: E0 05     CPX #$05
C - - - - - 0x034E5C 1A:8E4C: F0 1F     BEQ bra_8E6D_RTS
C - - - - - 0x034E5E 1A:8E4E: E0 06     CPX #$06
C - - - - - 0x034E60 1A:8E50: F0 1B     BEQ bra_8E6D_RTS
bra_8E52:
C - - - - - 0x034E62 1A:8E52: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x034E65 1A:8E55: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x034E68 1A:8E58: D0 13     BNE bra_8E6D_RTS
C - - - - - 0x034E6A 1A:8E5A: A9 0F     LDA #$0F
C - - - - - 0x034E6C 1A:8E5C: B0 02     BCS bra_8E60
C - - - - - 0x034E6E 1A:8E5E: A9 3F     LDA #$3F
bra_8E60:
C - - - - - 0x034E70 1A:8E60: CD E2 00  CMP ram_random + $01
C - - - - - 0x034E73 1A:8E63: 90 08     BCC bra_8E6D_RTS
C - - - - - 0x034E75 1A:8E65: A9 04     LDA #$04
C - - - - - 0x034E77 1A:8E67: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x034E7A 1A:8E6A: 20 5A C5  JMP loc_0x03CF5F
bra_8E6D_RTS:
C - - - - - 0x034E7D 1A:8E6D: 60        RTS



sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды:
C - - - - - 0x034E7E 1A:8E6E: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x034E81 1A:8E71: A2 00     LDX #$00    ; индекс команды слева
C - - - - - 0x034E83 1A:8E73: C9 0B     CMP #$0B
C - - - - - 0x034E85 1A:8E75: 90 02     BCC bra_8E79_команда_слева
; if комада справа
C - - - - - 0x034E87 1A:8E77: A2 0B     LDX #$0B    ; индекс команды справа
bra_8E79_команда_слева:
C - - - - - 0x034E89 1A:8E79: 8A        TXA
C - - - - - 0x034E8A 1A:8E7A: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x034E8D 1A:8E7D: 8E FB 05  STX ram_команда_с_мячом
C - - - - - 0x034E90 1A:8E80: F0 03     BEQ bra_8E85_RTS
C - - - - - 0x034E92 1A:8E82: 20 6F C5  JMP loc_0x03D0A3_выбор_мелодии_команды
bra_8E85_RTS:
C - - - - - 0x034E95 1A:8E85: 60        RTS



sub_8E86_катсцена_драйв_оверхеда:
sub_0x034E96_катсцена_драйв_оверхеда:
; попытка активировать катсцену, бряк периодически регулярно срабатывает во время матча
C D 0 - - - 0x034E96 1A:8E86: AD 46 04  LDA ram_drive_overhead_flag
C - - - - - 0x034E99 1A:8E89: C9 05     CMP #$05
C - - - - - 0x034E9B 1A:8E8B: F0 5B     BEQ bra_8EE8_RTS        ; if drive overhead уже в наличии
C - - - - - 0x034E9D 1A:8E8D: C9 04     CMP #$04
C - - - - - 0x034E9F 1A:8E8F: D0 57     BNE bra_8EE8_RTS        ; if еще не набралось 2 удара по meon
C - - - - - 0x034EA1 1A:8E91: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034EA4 1A:8E94: D0 52     BNE bra_8EE8_RTS        ; if мячом владеет соперник
; if мяч у команды слева
C - - - - - 0x034EA6 1A:8E96: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034EA9 1A:8E99: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034EAC 1A:8E9C: A0 00     LDY #con_plr_id
C - - - - - 0x034EAE 1A:8E9E: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034EB0 1A:8EA0: C9 01     CMP #con_p_tsubasa_my
C - - - - - 0x034EB2 1A:8EA2: F0 44     BEQ bra_8EE8_RTS        ; if мячом владеет tsubasa
C - - - - - 0x034EB4 1A:8EA4: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x034EB6 1A:8EA6: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
; выход если игрок с мячом на своей половине поля, типа недостаточно близко к воротам соперника
C - - - - - 0x034EB8 1A:8EA8: 10 3E     BPL bra_8EE8_RTS
C - - - - - 0x034EBA 1A:8EAA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x034EBD 1A:8EAD: 8D FC 05  STA ram_принимающий
C - - - - - 0x034EC0 1A:8EB0: A9 01     LDA #$01
bra_8EB2_найти_цубасу_в_команде:
C - - - - - 0x034EC2 1A:8EB2: 48        PHA
C - - - - - 0x034EC3 1A:8EB3: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x034EC6 1A:8EB6: A0 00     LDY #con_plr_id
C - - - - - 0x034EC8 1A:8EB8: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x034ECA 1A:8EBA: C9 01     CMP #con_p_tsubasa_my
C - - - - - 0x034ECC 1A:8EBC: F0 06     BEQ bra_8EC4_цубаса_найден
C - - - - - 0x034ECE 1A:8EBE: 68        PLA
C - - - - - 0x034ECF 1A:8EBF: 18        CLC
C - - - - - 0x034ED0 1A:8EC0: 69 01     ADC #$01
C - - - - - 0x034ED2 1A:8EC2: D0 EE     BNE bra_8EB2_найти_цубасу_в_команде
bra_8EC4_цубаса_найден:
C - - - - - 0x034ED4 1A:8EC4: 68        PLA
C - - - - - 0x034ED5 1A:8EC5: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x034ED8 1A:8EC8: EE 46 04  INC ram_drive_overhead_flag
C - - - - - 0x034EDB 1A:8ECB: A9 00     LDA #$00
C - - - - - 0x034EDD 1A:8ECD: 8D 15 06  STA ram_0615_флаг
C - - - - - 0x034EE0 1A:8ED0: 8D 2D 06  STA ram_062D
C - - - - - 0x034EE3 1A:8ED3: A9 17     LDA #con_s_id_17
C - - - - - 0x034EE5 1A:8ED5: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x034EE8 1A:8ED8: A9 00     LDA #$00
C - - - - - 0x034EEA 1A:8EDA: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x034EED 1A:8EDD: A9 04     LDA #$04
C - - - - - 0x034EEF 1A:8EDF: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x034EF2 1A:8EE2: A2 50     LDX #$50
C - - - - - 0x034EF4 1A:8EE4: 9A        TXS
C - - - - - 0x034EF5 1A:8EE5: 4C AC 85  JMP loc_85AC
bra_8EE8_RTS:
C - - - - - 0x034EF8 1A:8EE8: 60        RTS



sub_8EE9:
C - - - - - 0x034EF9 1A:8EE9: 20 06 8D  JSR sub_8D06
C - - - - - 0x034EFC 1A:8EEC: A5 71     LDA ram_0071_t01_система_счисления_ХЗ
; / 04
C - - - - - 0x034EFE 1A:8EEE: 4A        LSR
C - - - - - 0x034EFF 1A:8EEF: 4A        LSR
C - - - - - 0x034F00 1A:8EF0: 8D 19 06  STA ram_снижение_силы_действия
C - - - - - 0x034F03 1A:8EF3: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x034F06 1A:8EF6: 85 70     STA ram_0070_t02_число_hi
C - - - - - 0x034F08 1A:8EF8: AD 1C 06  LDA ram_сила_действия_lo
; * 40
C - - - - - 0x034F0B 1A:8EFB: 0A        ASL
C - - - - - 0x034F0C 1A:8EFC: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F0E 1A:8EFE: 0A        ASL
C - - - - - 0x034F0F 1A:8EFF: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F11 1A:8F01: 0A        ASL
C - - - - - 0x034F12 1A:8F02: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F14 1A:8F04: 0A        ASL
C - - - - - 0x034F15 1A:8F05: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F17 1A:8F07: 0A        ASL
C - - - - - 0x034F18 1A:8F08: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F1A 1A:8F0A: 0A        ASL
C - - - - - 0x034F1B 1A:8F0B: 26 70     ROL ram_0070_t02_число_hi
C - - - - - 0x034F1D 1A:8F0D: 85 6F     STA ram_006F_t02_число_lo
C - - - - - 0x034F1F 1A:8F0F: 20 1E C5  JSR sub_0x03CD4C_получить_младший_разряд_числа
C - - - - - 0x034F22 1A:8F12: A5 6F     LDA ram_006F_t03_lo
C - - - - - 0x034F24 1A:8F14: A4 70     LDY ram_0070_t03_hi
C - - - - - 0x034F26 1A:8F16: F0 02     BEQ bra_8F1A
C - - - - - 0x034F28 1A:8F18: A9 FF     LDA #$FF
bra_8F1A:
C - - - - - 0x034F2A 1A:8F1A: A2 00     LDX #$00
C - - - - - 0x034F2C 1A:8F1C: A0 00     LDY #$00
C - - - - - 0x034F2E 1A:8F1E: 60        RTS



sub_8F1F:
C - - - - - 0x034F2F 1A:8F1F: 20 06 8D  JSR sub_8D06
C - - - - - 0x034F32 1A:8F22: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x034F35 1A:8F25: 85 67     STA ram_0067_t02_множитель_lo_1
C - - - - - 0x034F37 1A:8F27: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x034F3A 1A:8F2A: 85 68     STA ram_0068_t02_множитель_hi_1
C - - - - - 0x034F3C 1A:8F2C: A9 C0     LDA #< $00C0
C - - - - - 0x034F3E 1A:8F2E: 85 69     STA ram_0069_t01_множитель_lo_2
C - - - - - 0x034F40 1A:8F30: A9 00     LDA #> $00C0
C - - - - - 0x034F42 1A:8F32: 85 6A     STA ram_006A_t01_множитель_2_hi
C - - - - - 0x034F44 1A:8F34: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034F47 1A:8F37: A5 6B     LDA ram_006B_t01_произведение
C - - - - - 0x034F49 1A:8F39: 85 6F     STA ram_006F_t02_число_lo
C - - - - - 0x034F4B 1A:8F3B: A5 6C     LDA ram_006B_t01_произведение + $01
C - - - - - 0x034F4D 1A:8F3D: 85 70     STA ram_0070_t02_число_hi
C - - - - - 0x034F4F 1A:8F3F: 20 1E C5  JSR sub_0x03CD4C_получить_младший_разряд_числа
C - - - - - 0x034F52 1A:8F42: A5 6F     LDA ram_006F_t03_lo
C - - - - - 0x034F54 1A:8F44: A4 70     LDY ram_0070_t03_hi
C - - - - - 0x034F56 1A:8F46: F0 02     BEQ bra_8F4A
C - - - - - 0x034F58 1A:8F48: A9 FF     LDA #$FF
bra_8F4A:
C - - - - - 0x034F5A 1A:8F4A: 85 3A     STA ram_003A_t51
C - - - - - 0x034F5C 1A:8F4C: 20 59 8F  JSR sub_8F59
C - - - - - 0x034F5F 1A:8F4F: 18        CLC
C - - - - - 0x034F60 1A:8F50: 65 3A     ADC ram_003A_t51
C - - - - - 0x034F62 1A:8F52: 90 02     BCC bra_8F56_not_overflow
C - - - - - 0x034F64 1A:8F54: A9 FF     LDA #$FF
bra_8F56_not_overflow:
C - - - - - 0x034F66 1A:8F56: A0 00     LDY #$00
C - - - - - 0x034F68 1A:8F58: 60        RTS



sub_8F59:
C - - - - - 0x034F69 1A:8F59: 20 51 C5  JSR sub_0x03CD87_получить_адрес_кипера_команды_без_мяча
C - - - - - 0x034F6C 1A:8F5C: A0 05     LDY #con_gk_таймер_наебки
C - - - - - 0x034F6E 1A:8F5E: B1 34     LDA (ram_plr_data),Y    ; con_gk_таймер_наебки
C - - - - - 0x034F70 1A:8F60: 38        SEC
C - - - - - 0x034F71 1A:8F61: ED 2B 06  SBC ram_062B
C - - - - - 0x034F74 1A:8F64: B0 02     BCS bra_8F68
C - - - - - 0x034F76 1A:8F66: A9 00     LDA #$00
bra_8F68:
C - - - - - 0x034F78 1A:8F68: A0 07     LDY #con_gk_величина_наебки
C - - - - - 0x034F7A 1A:8F6A: 18        CLC
C - - - - - 0x034F7B 1A:8F6B: 71 34     ADC (ram_plr_data),Y    ; con_gk_величина_наебки
C - - - - - 0x034F7D 1A:8F6D: 90 02     BCC bra_8F71_RTS    ; if not overflow
; if overflow
- - - - - - 0x034F7F 1A:8F6F: A9 FF     LDA #$FF
bra_8F71_RTS:
C - - - - - 0x034F81 1A:8F71: 60        RTS



sub_8F72:
sub_0x034F82:
C - - - - - 0x034F85 1A:8F75: A9 06     LDA #con_bsw_1C_01
C - - - - - 0x034F87 1A:8F77: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x034F8A 1A:8F7A: A9 00     LDA #$00
C - - - - - 0x034F8C 1A:8F7C: 85 3A     STA ram_003A_t33_flag
C - - - - - 0x034F8E 1A:8F7E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x034F91 1A:8F81: D0 17     BNE bra_8F9A_команда_справа
; if мяч у команды слева
C - - - - - 0x034F93 1A:8F83: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x034F96 1A:8F86: C9 02     CMP #$02      ; dribble
C - - - - - 0x034F98 1A:8F88: D0 0D     BNE bra_8F97
C - - - - - 0x034F9A 1A:8F8A: AD 00 06  LDA ram_колво_защитников
C - - - - - 0x034F9D 1A:8F8D: D0 08     BNE bra_8F97
C - - - - - 0x034F9F 1A:8F8F: A9 00     LDA #$00
C - - - - - 0x034FA1 1A:8F91: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x034FA4 1A:8F94: 8D 40 04  STA ram_затрата_энергии_hi
bra_8F97:
C - - - - - 0x034FA7 1A:8F97: 20 FB 8F  JSR sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов
bra_8F9A_команда_справа:
C - - - - - 0x034FAA 1A:8F9A: 24 3A     BIT ram_003A_t33_flag
C - - - - - 0x034FAC 1A:8F9C: 30 0F     BMI bra_8FAD
C - - - - - 0x034FAE 1A:8F9E: AD E2 00  LDA ram_random + $01
C - - - - - 0x034FB1 1A:8FA1: C9 08     CMP #$08      ; шанс крита
C - - - - - 0x034FB3 1A:8FA3: B0 08     BCS bra_8FAD
C - - - - - 0x034FB5 1A:8FA5: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x034FB8 1A:8FA8: 09 80     ORA #$80
C - - - - - 0x034FBA 1A:8FAA: 8D 3C 04  STA ram_подтип_действия_атаки
bra_8FAD:
C - - - - - 0x034FBD 1A:8FAD: A2 00     LDX #$00
C - - - - - 0x034FBF 1A:8FAF: AD E2 00  LDA ram_random + $01
C - - - - - 0x034FC2 1A:8FB2: 6D E3 00  ADC ram_random + $02
C - - - - - 0x034FC5 1A:8FB5: 6A        ROR
C - - - - - 0x034FC6 1A:8FB6: 09 80     ORA #$80
C - - - - - 0x034FC8 1A:8FB8: 2C 3C 04  BIT ram_подтип_действия_атаки
C - - - - - 0x034FCB 1A:8FBB: 10 03     BPL bra_8FC0
C - - - - - 0x034FCD 1A:8FBD: E8        INX ; 01
C - - - - - 0x034FCE 1A:8FBE: 29 7F     AND #$7F
bra_8FC0:
C - - - - - 0x034FD0 1A:8FC0: 69 00     ADC #$00
C - - - - - 0x034FD2 1A:8FC2: 90 01     BCC bra_8FC5
C - - - - - 0x034FD4 1A:8FC4: E8        INX ; 02/03
bra_8FC5:
C - - - - - 0x034FD5 1A:8FC5: 85 67     STA ram_0067_t02_множитель_lo_1
C - - - - - 0x034FD7 1A:8FC7: 86 68     STX ram_0068_t02_множитель_hi_1
C - - - - - 0x034FD9 1A:8FC9: 24 3A     BIT ram_003A_t33_flag
C - - - - - 0x034FDB 1A:8FCB: 10 10     BPL bra_8FDD
; / 10
C - - - - - 0x034FDD 1A:8FCD: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034FDF 1A:8FCF: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034FE1 1A:8FD1: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034FE3 1A:8FD3: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034FE5 1A:8FD5: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034FE7 1A:8FD7: 66 32     ROR ram_0032_t12_lo
C - - - - - 0x034FE9 1A:8FD9: 46 33     LSR ram_0033_t03_hi
C - - - - - 0x034FEB 1A:8FDB: 66 32     ROR ram_0032_t12_lo
bra_8FDD:
C - - - - - 0x034FED 1A:8FDD: A5 32     LDA ram_0032_t12_lo
C - - - - - 0x034FEF 1A:8FDF: 85 69     STA ram_0069_t01_множитель_lo_2
C - - - - - 0x034FF1 1A:8FE1: A5 33     LDA ram_0033_t03_hi
C - - - - - 0x034FF3 1A:8FE3: 85 6A     STA ram_006A_t01_множитель_2_hi
C - - - - - 0x034FF5 1A:8FE5: 20 21 C5  JSR sub_0x03CD1D_умножение_16бит_на_16бит
C - - - - - 0x034FF8 1A:8FE8: A5 6C     LDA ram_006B_t01_произведение + $01
C - - - - - 0x034FFA 1A:8FEA: 8D 1C 06  STA ram_сила_действия_lo
C - - - - - 0x034FFD 1A:8FED: A5 6D     LDA ram_006B_t01_произведение + $02
C - - - - - 0x034FFF 1A:8FEF: 8D 1D 06  STA ram_сила_действия_hi
C - - - - - 0x035002 1A:8FF2: 60        RTS



sub_8FF3_затрата_энергии_с_проверкой_на_команду_ботов:
C - - - - - 0x035003 1A:8FF3: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035006 1A:8FF6: D0 03     BNE bra_8FFB_команда_справа
; if мяч у команды слева
; A = 00
; bzk optimize, небезопасно
C - - - - - 0x035008 1A:8FF8: 85 3A     STA ram_003A_t33_flag
C - - - - - 0x03500A 1A:8FFA: 60        RTS
bra_8FFB_команда_справа:
sub_8FFB_затрата_энергии_без_проверки_на_команду_ботов:
C - - - - - 0x03500B 1A:8FFB: A9 00     LDA #$00
C - - - - - 0x03500D 1A:8FFD: 85 3A     STA ram_003A_t33_flag
C - - - - - 0x03500F 1A:8FFF: A0 00     LDY #con_plr_id
C - - - - - 0x035011 1A:9001: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x035013 1A:9003: C9 20     CMP #con_p_misugi_my
C - - - - - 0x035015 1A:9005: D0 28     BNE bra_902F    ; if not мисуги
C - - - - - 0x035017 1A:9007: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03501A 1A:900A: D0 0C     BNE bra_9018    ; if комада справа
; if мяч у команды слева
C - - - - - 0x03501C 1A:900C: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03501F 1A:900F: D0 07     BNE bra_9018
C - - - - - 0x035021 1A:9011: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x035024 1A:9014: C9 03     CMP #$03
C - - - - - 0x035026 1A:9016: B0 17     BCS bra_902F
bra_9018:
C - - - - - 0x035028 1A:9018: AD 40 04  LDA ram_затрата_энергии_hi
C - - - - - 0x03502B 1A:901B: 4A        LSR
C - - - - - 0x03502C 1A:901C: AA        TAX
C - - - - - 0x03502D 1A:901D: AD 3F 04  LDA ram_затрата_энергии_lo
C - - - - - 0x035030 1A:9020: 6A        ROR
C - - - - - 0x035031 1A:9021: 18        CLC
C - - - - - 0x035032 1A:9022: 6D 3F 04  ADC ram_затрата_энергии_lo
C - - - - - 0x035035 1A:9025: 8D 3F 04  STA ram_затрата_энергии_lo
C - - - - - 0x035038 1A:9028: 8A        TXA
C - - - - - 0x035039 1A:9029: 6D 40 04  ADC ram_затрата_энергии_hi
C - - - - - 0x03503C 1A:902C: 8D 40 04  STA ram_затрата_энергии_hi
bra_902F:
C - - - - - 0x03503F 1A:902F: A0 01     LDY #con_plr_guts_lo
C - - - - - 0x035041 1A:9031: 38        SEC
C - - - - - 0x035042 1A:9032: B1 34     LDA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x035044 1A:9034: ED 3F 04  SBC ram_затрата_энергии_lo
C - - - - - 0x035047 1A:9037: AA        TAX
C - - - - - 0x035048 1A:9038: C8        INY ; con_plr_guts_hi
C - - - - - 0x035049 1A:9039: B1 34     LDA (ram_plr_data),Y    ; con_plr_guts_hi
C - - - - - 0x03504B 1A:903B: ED 40 04  SBC ram_затрата_энергии_hi
C - - - - - 0x03504E 1A:903E: 10 07     BPL bra_9047
C - - - - - 0x035050 1A:9040: A2 00     LDX #$00
C - - - - - 0x035052 1A:9042: A9 00     LDA #$00
C - - - - - 0x035054 1A:9044: 38        SEC
C - - - - - 0x035055 1A:9045: 66 3A     ROR ram_003A_t33_flag
bra_9047:
C - - - - - 0x035057 1A:9047: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_hi
C - - - - - 0x035059 1A:9049: 88        DEY ; con_plr_guts_lo
C - - - - - 0x03505A 1A:904A: 8A        TXA
C - - - - - 0x03505B 1A:904B: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x03505D 1A:904D: 60        RTS



sub_904E:
sub_0x03505E:
; очистить защиту и энергию соперников
C D 0 - - - 0x03505E 1A:904E: 2C 4B 04  BIT ram_044B_flag
C - - - - - 0x035061 1A:9051: 10 1C     BPL bra_906F_RTS
C - - - - - 0x035063 1A:9053: A9 00     LDA #$00
C - - - - - 0x035065 1A:9055: 8D 4B 04  STA ram_044B_flag
C - - - - - 0x035068 1A:9058: 8D 2F 00  STA ram_защита_справа
C - - - - - 0x03506B 1A:905B: A9 0C     LDA #$0C
bra_905D_loop:
C - - - - - 0x03506D 1A:905D: 48        PHA
C - - - - - 0x03506E 1A:905E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035071 1A:9061: A0 01     LDY #con_plr_guts_lo
C - - - - - 0x035073 1A:9063: A9 00     LDA #$00
C - - - - - 0x035075 1A:9065: 91 34     STA (ram_plr_data),Y    ; con_plr_guts_lo
C - - - - - 0x035077 1A:9067: 68        PLA
C - - - - - 0x035078 1A:9068: 18        CLC
C - - - - - 0x035079 1A:9069: 69 01     ADC #$01
C - - - - - 0x03507B 1A:906B: C9 16     CMP #$16
C - - - - - 0x03507D 1A:906D: D0 EE     BNE bra_905D_loop
bra_906F_RTS:
C - - - - - 0x03507F 1A:906F: 60        RTS



sub_9070:
C - - - - - 0x035080 1A:9070: 2C 4C 04  BIT ram_044C_flag
C - - - - - 0x035083 1A:9073: 10 0F     BPL bra_9084_RTS
C - - - - - 0x035085 1A:9075: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x035088 1A:9078: C9 14     CMP #$14
C - - - - - 0x03508A 1A:907A: D0 08     BNE bra_9084_RTS
C - - - - - 0x03508C 1A:907C: A9 00     LDA #$00
C - - - - - 0x03508E 1A:907E: 8D 4C 04  STA ram_044C_flag
C - - - - - 0x035091 1A:9081: 8D F1 03  STA ram_03F1
bra_9084_RTS:
C - - - - - 0x035094 1A:9084: 60        RTS



sub_9085_клон_ссыт_напороться_на_мяч:
; сработал когда оставшиеся клоны ссут подстраиваться на мяч
; сработало во время драйв удара и драйв паса
; хз на что этот код влияет
C - - - - - 0x035095 1A:9085: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x035098 1A:9088: BD 8E 90  LDA tbl_908E_затраченное_время,X
C - - - - - 0x03509B 1A:908B: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



tbl_908E_затраченное_время:
- D 0 - - - 0x03509E 1A:908E: 02        .byte $02   ; 00 
- D 0 - - - 0x03509F 1A:908F: 01        .byte $01   ; 01 
- D 0 - - - 0x0350A0 1A:9090: 01        .byte $01   ; 02 
- D 0 - - - 0x0350A1 1A:9091: 04        .byte $04   ; 03 
- D 0 - - - 0x0350A2 1A:9092: 04        .byte $04   ; 04 
- D 0 - - - 0x0350A3 1A:9093: 01        .byte $01   ; 05 
- D 0 - - - 0x0350A4 1A:9094: 02        .byte $02   ; 06 



loc_9095:
sub_9095:
C D 0 - - - 0x0350A5 1A:9095: 08        PHP
C - - - - - 0x0350A6 1A:9096: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x0350A9 1A:9099: 0A        ASL
C - - - - - 0x0350AA 1A:909A: AA        TAX
C - - - - - 0x0350AB 1A:909B: 28        PLP
C - - - - - 0x0350AC 1A:909C: 90 01     BCC bra_909F
C - - - - - 0x0350AE 1A:909E: E8        INX
bra_909F:
C - - - - - 0x0350AF 1A:909F: BD F4 90  LDA tbl_90F4,X
C - - - - - 0x0350B2 1A:90A2: AC 42 04  LDY ram_игрок_без_мяча
C - - - - - 0x0350B5 1A:90A5: F0 33     BEQ bra_90DA
C - - - - - 0x0350B7 1A:90A7: C0 0B     CPY #$0B
C - - - - - 0x0350B9 1A:90A9: F0 2F     BEQ bra_90DA
C - - - - - 0x0350BB 1A:90AB: 8A        TXA
C - - - - - 0x0350BC 1A:90AC: 48        PHA
C - - - - - 0x0350BD 1A:90AD: 4A        LSR
C - - - - - 0x0350BE 1A:90AE: 90 13     BCC bra_90C3
C - - - - - 0x0350C0 1A:90B0: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0350C3 1A:90B3: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0350C6 1A:90B6: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x0350C9 1A:90B9: BD 02 91  LDA tbl_9102,X
C - - - - - 0x0350CC 1A:90BC: A0 0A     LDY #con_plr_stun
C - - - - - 0x0350CE 1A:90BE: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x0350D0 1A:90C0: 4C D5 90  JMP loc_90D5
bra_90C3:
C - - - - - 0x0350D3 1A:90C3: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0350D6 1A:90C6: F0 0D     BEQ bra_90D5
C - - - - - 0x0350D8 1A:90C8: C9 0B     CMP #$0B
C - - - - - 0x0350DA 1A:90CA: F0 09     BEQ bra_90D5
C - - - - - 0x0350DC 1A:90CC: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0350DF 1A:90CF: A0 0A     LDY #con_plr_stun
C - - - - - 0x0350E1 1A:90D1: A9 05     LDA #$05
C - - - - - 0x0350E3 1A:90D3: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
bra_90D5:
loc_90D5:
C D 0 - - - 0x0350E5 1A:90D5: 68        PLA
C - - - - - 0x0350E6 1A:90D6: AA        TAX
C - - - - - 0x0350E7 1A:90D7: BD E6 90  LDA tbl_90E6_затраченное_время,X
bra_90DA:
C - - - - - 0x0350EA 1A:90DA: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



sub_90DD_уменьшить_таймер_времени_тайма_изза_действия_атаки:
C - - - - - 0x0350ED 1A:90DD: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x0350F0 1A:90E0: BD 09 91  LDA tbl_9109_затраченное_время,X
C - - - - - 0x0350F3 1A:90E3: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



tbl_90E6_затраченное_время:
- D 0 - - - 0x0350F6 1A:90E6: 02        .byte $02   ; 00 
- D 0 - - - 0x0350F7 1A:90E7: 01        .byte $01   ; 01 
- D 0 - - - 0x0350F8 1A:90E8: 01        .byte $01   ; 02 
- D 0 - - - 0x0350F9 1A:90E9: 01        .byte $01   ; 03 
- D 0 - - - 0x0350FA 1A:90EA: 02        .byte $02   ; 04 
- D 0 - - - 0x0350FB 1A:90EB: 01        .byte $01   ; 05 
- D 0 - - - 0x0350FC 1A:90EC: 01        .byte $01   ; 06 
- D 0 - - - 0x0350FD 1A:90ED: 00        .byte $00   ; 07 
- D 0 - - - 0x0350FE 1A:90EE: 01        .byte $01   ; 08 
- D 0 - - - 0x0350FF 1A:90EF: 00        .byte $00   ; 09 
- - - - - - 0x035100 1A:90F0: 00        .byte $00   ; 0A 
- D 0 - - - 0x035101 1A:90F1: 00        .byte $00   ; 0B 
- - - - - - 0x035102 1A:90F2: 00        .byte $00   ; 0C 
- D 0 - - - 0x035103 1A:90F3: 00        .byte $00   ; 0D 



tbl_90F4:
; 00 block / catch
- D 0 - - - 0x035104 1A:90F4: 00        .byte $00   ; 
- D 0 - - - 0x035105 1A:90F5: 00        .byte $00   ; 
; 01 tackle / punch
- D 0 - - - 0x035106 1A:90F6: 00        .byte $00   ; 
- D 0 - - - 0x035107 1A:90F7: 00        .byte $00   ; 
; 02 pass cut / triangle jump
- D 0 - - - 0x035108 1A:90F8: 00        .byte $00   ; 
- D 0 - - - 0x035109 1A:90F9: 00        .byte $00   ; 
; 03 interfere / dive
- D 0 - - - 0x03510A 1A:90FA: 02        .byte $02   ; 
- D 0 - - - 0x03510B 1A:90FB: 00        .byte $00   ; 
; 04 clearing / wait (gk)
- D 0 - - - 0x03510C 1A:90FC: 00        .byte $00   ; 
- D 0 - - - 0x03510D 1A:90FD: 00        .byte $00   ; 
; 05 mark / through
- - - - - - 0x03510E 1A:90FE: 00        .byte $00   ; 
- D 0 - - - 0x03510F 1A:90FF: 00        .byte $00   ; 
; 06 wait (для полевых)
- - - - - - 0x035110 1A:9100: 00        .byte $00   ; 
- D 0 - - - 0x035111 1A:9101: 00        .byte $00   ; 


tbl_9102:
- D 0 - - - 0x035112 1A:9102: 06        .byte $06   ; 00 
- D 0 - - - 0x035113 1A:9103: 06        .byte $06   ; 01 
- D 0 - - - 0x035114 1A:9104: 06        .byte $06   ; 02 
- D 0 - - - 0x035115 1A:9105: 06        .byte $06   ; 03 
- D 0 - - - 0x035116 1A:9106: 06        .byte $06   ; 04 
- D 0 - - - 0x035117 1A:9107: 00        .byte $00   ; 05 
- D 0 - - - 0x035118 1A:9108: 00        .byte $00   ; 06 



tbl_9109_затраченное_время:
- D 0 - - - 0x035119 1A:9109: 01        .byte $01   ; 00 
- D 0 - - - 0x03511A 1A:910A: 00        .byte $00   ; 01 
- D 0 - - - 0x03511B 1A:910B: 00        .byte $00   ; 02 
- D 0 - - - 0x03511C 1A:910C: 01        .byte $01   ; 03 
- D 0 - - - 0x03511D 1A:910D: 02        .byte $02   ; 04 
- D 0 - - - 0x03511E 1A:910E: 00        .byte $00   ; 05 
- D 0 - - - 0x03511F 1A:910F: 01        .byte $01   ; 06 



sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма:
; in
    ; A = добавочное время loss
    ; X = 
C - - - - - 0x035120 1A:9110: 18        CLC
C - - - - - 0x035121 1A:9111: 6D F9 05  ADC ram_loss
C - - - - - 0x035124 1A:9114: 8D F9 05  STA ram_loss
C - - - - - 0x035127 1A:9117: 8A        TXA
C - - - - - 0x035128 1A:9118: 20 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма



loc_911C:
C D 0 - - - 0x03512C 1A:911C: A9 29     LDA #con_s_id_29
C - - - - - 0x03512E 1A:911E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035131 1A:9121: 20 7B 98  JSR sub_987B
C - - - - - 0x035134 1A:9124: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035137 1A:9127: 29 F8     AND #$F8
C - - - - - 0x035139 1A:9129: 18        CLC
C - - - - - 0x03513A 1A:912A: 69 04     ADC #$04
C - - - - - 0x03513C 1A:912C: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x03513F 1A:912F: A9 4C     LDA #$4C
C - - - - - 0x035141 1A:9131: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035144 1A:9134: 10 02     BPL bra_9138
C - - - - - 0x035146 1A:9136: A9 B4     LDA #$B4
bra_9138:
C - - - - - 0x035148 1A:9138: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x03514B 1A:913B: A2 00     LDX #$00
C - - - - - 0x03514D 1A:913D: 2C 35 06  BIT ram_ball_pos_X_hi
C - - - - - 0x035150 1A:9140: 10 01     BPL bra_9143
C - - - - - 0x035152 1A:9142: E8        INX ; 01
bra_9143:
C - - - - - 0x035153 1A:9143: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035156 1A:9146: 10 02     BPL bra_914A
C - - - - - 0x035158 1A:9148: E8        INX ; 02
C - - - - - 0x035159 1A:9149: E8        INX ; 03
bra_914A:
C - - - - - 0x03515A 1A:914A: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03515D 1A:914D: F0 04     BEQ bra_9153_команда_слева
; if мяч у команды справа
C - - - - - 0x03515F 1A:914F: 8A        TXA
C - - - - - 0x035160 1A:9150: 49 03     EOR #$03
C - - - - - 0x035162 1A:9152: AA        TAX
bra_9153_команда_слева:
C - - - - - 0x035163 1A:9153: BD EA 92  LDA tbl_92EA,X
C - - - - - 0x035166 1A:9156: 18        CLC
C - - - - - 0x035167 1A:9157: 6D FB 05  ADC ram_команда_с_мячом
C - - - - - 0x03516A 1A:915A: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x03516D 1A:915D: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035170 1A:9160: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035172 1A:9162: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035175 1A:9165: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035177 1A:9167: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035179 1A:9169: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x03517C 1A:916C: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x03517E 1A:916E: AE 35 06  LDX ram_ball_pos_X_hi
C - - - - - 0x035181 1A:9171: A9 08     LDA #$08
C - - - - - 0x035183 1A:9173: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035186 1A:9176: 10 02     BPL bra_917A
C - - - - - 0x035188 1A:9178: A9 F8     LDA #$F8
bra_917A:
C - - - - - 0x03518A 1A:917A: 18        CLC
C - - - - - 0x03518B 1A:917B: 6D 37 06  ADC ram_ball_pos_Y_hi
C - - - - - 0x03518E 1A:917E: A8        TAY
C - - - - - 0x03518F 1A:917F: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035192 1A:9182: 8D 24 06  STA ram_0624
C - - - - - 0x035195 1A:9185: 8D 1E 06  STA ram_061E
C - - - - - 0x035198 1A:9188: 20 D2 91  JSR sub_91D2
C - - - - - 0x03519B 1A:918B: A9 2A     LDA #con_s_id_2A
C - - - - - 0x03519D 1A:918D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0351A0 1A:9190: A9 02     LDA #$02
C - - - - - 0x0351A2 1A:9192: A2 0A     LDX #$0A
C - - - - - 0x0351A4 1A:9194: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x0351A7 1A:9197: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x0351AA 1A:919A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0351AD 1A:919D: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0351B0 1A:91A0: AD 1E 06  LDA ram_061E
C - - - - - 0x0351B3 1A:91A3: 8D FE 05  STA ram_05FE
C - - - - - 0x0351B6 1A:91A6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x0351B9 1A:91A9: 98        TYA
C - - - - - 0x0351BA 1A:91AA: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0351BC 1A:91AC: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0351BE 1A:91AE: 8D 37 06  STA ram_ball_pos_Y_hi
C - - - - - 0x0351C1 1A:91B1: 8A        TXA
C - - - - - 0x0351C2 1A:91B2: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0351C4 1A:91B4: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0351C6 1A:91B6: 8D 35 06  STA ram_ball_pos_X_hi
C - - - - - 0x0351C9 1A:91B9: AD 24 06  LDA ram_0624
C - - - - - 0x0351CC 1A:91BC: 8D 38 06  STA ram_0638
C - - - - - 0x0351CF 1A:91BF: A9 00     LDA #$00
C - - - - - 0x0351D1 1A:91C1: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0351D4 1A:91C4: 8D 1A 06  STA ram_061A
C - - - - - 0x0351D7 1A:91C7: A9 01     LDA #$01
C - - - - - 0x0351D9 1A:91C9: 8D 1B 06  STA ram_061B
C - - - - - 0x0351DC 1A:91CC: 20 0C C6  JSR sub_0x03E74E
C - - - - - 0x0351DF 1A:91CF: 4C 3C C6  JMP loc_0x03DE7C



sub_91D2:
C - - - - - 0x0351E2 1A:91D2: A9 00     LDA #$00
C - - - - - 0x0351E4 1A:91D4: 85 11     STA ram_0011
C - - - - - 0x0351E6 1A:91D6: 85 12     STA ram_0012
C - - - - - 0x0351E8 1A:91D8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0351EB 1A:91DB: F0 03     BEQ bra_91E0_команда_слева
; if мяч у команды справа
C - - - - - 0x0351ED 1A:91DD: 4C 98 92  JMP loc_9298
bra_91E0_команда_слева:
C - - - - - 0x0351F0 1A:91E0: A9 38     LDA #con_s_id_38
C - - - - - 0x0351F2 1A:91E2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0351F5 1A:91E5: A9 81     LDA #$81
C - - - - - 0x0351F7 1A:91E7: 8D 2D 06  STA ram_062D
C - - - - - 0x0351FA 1A:91EA: A9 1F     LDA #$1F
C - - - - - 0x0351FC 1A:91EC: 8D 94 04  STA ram_chr_bank + $04
C - - - - - 0x0351FF 1A:91EF: A9 0F     LDA #con_B3CF_pass_select_a_teammate
C - - - - - 0x035201 1A:91F1: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035204 1A:91F4: A9 00     LDA #$00
C - - - - - 0x035206 1A:91F6: 8D 26 06  STA ram_0626
C - - - - - 0x035209 1A:91F9: 8D 27 06  STA ram_0627
loc_91FC_loop:
C D 0 - - - 0x03520C 1A:91FC: A9 01     LDA #$01
C - - - - - 0x03520E 1A:91FE: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035211 1A:9201: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035214 1A:9204: 29 03     AND #con_btns_LR
C - - - - - 0x035216 1A:9206: F0 2C     BEQ bra_9234
C - - - - - 0x035218 1A:9208: 4A        LSR
C - - - - - 0x035219 1A:9209: A9 0C     LDA #$0C
C - - - - - 0x03521B 1A:920B: B0 02     BCS bra_920F
C - - - - - 0x03521D 1A:920D: A9 F4     LDA #$F4
bra_920F:
C - - - - - 0x03521F 1A:920F: 18        CLC
C - - - - - 0x035220 1A:9210: 6D 26 06  ADC ram_0626
C - - - - - 0x035223 1A:9213: AA        TAX
C - - - - - 0x035224 1A:9214: 10 05     BPL bra_921B
C - - - - - 0x035226 1A:9216: 49 FF     EOR #$FF
C - - - - - 0x035228 1A:9218: 18        CLC
C - - - - - 0x035229 1A:9219: 69 01     ADC #$01
bra_921B:
C - - - - - 0x03522B 1A:921B: C9 3C     CMP #$3C
C - - - - - 0x03522D 1A:921D: 90 03     BCC bra_9222
C - - - - - 0x03522F 1A:921F: AE 26 06  LDX ram_0626
bra_9222:
C - - - - - 0x035232 1A:9222: 8A        TXA
C - - - - - 0x035233 1A:9223: 18        CLC
C - - - - - 0x035234 1A:9224: 6D 1E 06  ADC ram_061E
C - - - - - 0x035237 1A:9227: C9 F0     CMP #$F0
C - - - - - 0x035239 1A:9229: 90 03     BCC bra_922E
C - - - - - 0x03523B 1A:922B: AE 26 06  LDX ram_0626
bra_922E:
C - - - - - 0x03523E 1A:922E: 8E 26 06  STX ram_0626
C - - - - - 0x035241 1A:9231: 4C 5F 92  JMP loc_925F
bra_9234:
C - - - - - 0x035244 1A:9234: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035247 1A:9237: 29 0C     AND #con_btns_UD
C - - - - - 0x035249 1A:9239: F0 45     BEQ bra_9280
; / 08
C - - - - - 0x03524B 1A:923B: 4A        LSR
C - - - - - 0x03524C 1A:923C: 4A        LSR
C - - - - - 0x03524D 1A:923D: 4A        LSR
C - - - - - 0x03524E 1A:923E: A9 01     LDA #$01
C - - - - - 0x035250 1A:9240: B0 02     BCS bra_9244
C - - - - - 0x035252 1A:9242: A9 FF     LDA #$FF
bra_9244:
C - - - - - 0x035254 1A:9244: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035257 1A:9247: 10 05     BPL bra_924E
C - - - - - 0x035259 1A:9249: 49 FF     EOR #$FF
C - - - - - 0x03525B 1A:924B: 18        CLC
C - - - - - 0x03525C 1A:924C: 69 01     ADC #$01
bra_924E:
C - - - - - 0x03525E 1A:924E: 18        CLC
C - - - - - 0x03525F 1A:924F: 6D 27 06  ADC ram_0627
C - - - - - 0x035262 1A:9252: 10 02     BPL bra_9256
C - - - - - 0x035264 1A:9254: A9 00     LDA #$00
bra_9256:
C - - - - - 0x035266 1A:9256: C9 05     CMP #$05
C - - - - - 0x035268 1A:9258: 90 02     BCC bra_925C
C - - - - - 0x03526A 1A:925A: A9 04     LDA #$04
bra_925C:
C - - - - - 0x03526C 1A:925C: 8D 27 06  STA ram_0627
loc_925F:
C D 0 - - - 0x03526F 1A:925F: AD 1E 06  LDA ram_061E
C - - - - - 0x035272 1A:9262: 18        CLC
C - - - - - 0x035273 1A:9263: 6D 26 06  ADC ram_0626
C - - - - - 0x035276 1A:9266: 8D 24 06  STA ram_0624
C - - - - - 0x035279 1A:9269: AD 27 06  LDA ram_0627
C - - - - - 0x03527C 1A:926C: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x03527F 1A:926F: 10 05     BPL bra_9276
C - - - - - 0x035281 1A:9271: 49 FF     EOR #$FF
C - - - - - 0x035283 1A:9273: 18        CLC
C - - - - - 0x035284 1A:9274: 69 01     ADC #$01
bra_9276:
C - - - - - 0x035286 1A:9276: 18        CLC
C - - - - - 0x035287 1A:9277: 6D 24 06  ADC ram_0624
C - - - - - 0x03528A 1A:927A: 8D 24 06  STA ram_0624
C - - - - - 0x03528D 1A:927D: 20 3F C6  JSR sub_0x03D907
bra_9280:
C - - - - - 0x035290 1A:9280: A9 80     LDA #con_btn_A
C - - - - - 0x035292 1A:9282: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035295 1A:9285: D0 03     BNE bra_928A
C - - - - - 0x035297 1A:9287: 4C FC 91  JMP loc_91FC_loop
bra_928A:
C - - - - - 0x03529A 1A:928A: 20 42 C6  JSR sub_0x03D862
C - - - - - 0x03529D 1A:928D: B0 03     BCS bra_9292
- - - - - - 0x03529F 1A:928F: 4C FC 91  JMP loc_91FC_loop
bra_9292:
C - - - - - 0x0352A2 1A:9292: A9 00     LDA #$00
C - - - - - 0x0352A4 1A:9294: 8D 2D 06  STA ram_062D
C - - - - - 0x0352A7 1A:9297: 60        RTS



loc_9298:
C D 0 - - - 0x0352A8 1A:9298: A9 0C     LDA #$0C
C - - - - - 0x0352AA 1A:929A: 85 3A     STA ram_003A_t34_порядковый_номер_игрока
bra_929C_loop:
C - - - - - 0x0352AC 1A:929C: A5 3A     LDA ram_003A_t34_порядковый_номер_игрока
C - - - - - 0x0352AE 1A:929E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0352B1 1A:92A1: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x0352B3 1A:92A3: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x0352B5 1A:92A5: 38        SEC
C - - - - - 0x0352B6 1A:92A6: ED 35 06  SBC ram_ball_pos_X_hi
C - - - - - 0x0352B9 1A:92A9: B0 04     BCS bra_92AF
C - - - - - 0x0352BB 1A:92AB: 49 FF     EOR #$FF
C - - - - - 0x0352BD 1A:92AD: 69 01     ADC #$01
bra_92AF:
C - - - - - 0x0352BF 1A:92AF: C9 20     CMP #$20
C - - - - - 0x0352C1 1A:92B1: B0 12     BCS bra_92C5
C - - - - - 0x0352C3 1A:92B3: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0352C5 1A:92B5: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0352C7 1A:92B7: 38        SEC
C - - - - - 0x0352C8 1A:92B8: ED 37 06  SBC ram_ball_pos_Y_hi
C - - - - - 0x0352CB 1A:92BB: B0 04     BCS bra_92C1
C - - - - - 0x0352CD 1A:92BD: 49 FF     EOR #$FF
C - - - - - 0x0352CF 1A:92BF: 69 01     ADC #$01
bra_92C1:
C - - - - - 0x0352D1 1A:92C1: C9 20     CMP #$20
C - - - - - 0x0352D3 1A:92C3: 90 1F     BCC bra_92E4
bra_92C5:
C - - - - - 0x0352D5 1A:92C5: E6 3A     INC ram_003A_t34_порядковый_номер_игрока
C - - - - - 0x0352D7 1A:92C7: A5 3A     LDA ram_003A_t34_порядковый_номер_игрока
C - - - - - 0x0352D9 1A:92C9: C9 16     CMP #$16
C - - - - - 0x0352DB 1A:92CB: D0 CF     BNE bra_929C_loop
; bzk garbage? или это fail safe?
- - - - - - 0x0352DD 1A:92CD: A9 14     LDA #$14
- - - - - - 0x0352DF 1A:92CF: 85 3A     STA ram_003A_t34_порядковый_номер_игрока
- - - - - - 0x0352E1 1A:92D1: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
- - - - - - 0x0352E4 1A:92D4: AD 1E 06  LDA ram_061E
- - - - - - 0x0352E7 1A:92D7: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
- - - - - - 0x0352EA 1A:92DA: 98        TYA
- - - - - - 0x0352EB 1A:92DB: A0 08     LDY #con_plr_pos_Y_hi
- - - - - - 0x0352ED 1A:92DD: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
- - - - - - 0x0352EF 1A:92DF: 8A        TXA
- - - - - - 0x0352F0 1A:92E0: A0 06     LDY #con_plr_pos_X_hi
- - - - - - 0x0352F2 1A:92E2: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi



bra_92E4:
C - - - - - 0x0352F4 1A:92E4: A5 3A     LDA ram_003A_t34_порядковый_номер_игрока
C - - - - - 0x0352F6 1A:92E6: 8D FC 05  STA ram_принимающий
C - - - - - 0x0352F9 1A:92E9: 60        RTS



tbl_92EA:
- D 0 - - - 0x0352FA 1A:92EA: 01        .byte $01   ; 00 
- D 0 - - - 0x0352FB 1A:92EB: 05        .byte $05   ; 01 
- - - - - - 0x0352FC 1A:92EC: 02        .byte $02   ; 02 
- D 0 - - - 0x0352FD 1A:92ED: 07        .byte $07   ; 03 



loc_92EE:
C D 0 - - - 0x0352FE 1A:92EE: A9 24     LDA #con_s_id_24
C - - - - - 0x035300 1A:92F0: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035303 1A:92F3: A9 00     LDA #$00
C - - - - - 0x035305 1A:92F5: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x035308 1A:92F8: 20 7B 98  JSR sub_987B
C - - - - - 0x03530B 1A:92FB: A2 06     LDX #$06
C - - - - - 0x03530D 1A:92FD: 2C 37 06  BIT ram_ball_pos_Y_hi
C - - - - - 0x035310 1A:9300: 10 01     BPL bra_9303
C - - - - - 0x035312 1A:9302: E8        INX
bra_9303:
C - - - - - 0x035313 1A:9303: 8E 1E 06  STX ram_061E
C - - - - - 0x035316 1A:9306: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035319 1A:9309: F0 08     BEQ bra_9313_команда_слева
; if мяч у команды справа
C - - - - - 0x03531B 1A:930B: A9 09     LDA #con_bsw_1C_04
C - - - - - 0x03531D 1A:930D: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035320 1A:9310: 4C 18 93  JMP loc_9318
bra_9313_команда_слева:
bra_9313_loop:
C - - - - - 0x035323 1A:9313: A9 2E     LDA #con_B3CF_corner_kick_taker
C - - - - - 0x035325 1A:9315: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
loc_9318:
C D 0 - - - 0x035328 1A:9318: AD 1E 06  LDA ram_061E
C - - - - - 0x03532B 1A:931B: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03532E 1A:931E: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - - 0x035331 1A:9321: B0 05     BCS bra_9328
C - - - - - 0x035333 1A:9323: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035336 1A:9326: F0 EB     BEQ bra_9313_loop
; if мяч у команды справа
bra_9328:
C - - - - - 0x035338 1A:9328: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03533B 1A:932B: D0 08     BNE bra_9335_команда_справа
; if мяч у команды слева
C - - - - - 0x03533D 1A:932D: A9 04     LDA #$04
C - - - - - 0x03533F 1A:932F: 8D 21 06  STA ram_0621
C - - - - - 0x035342 1A:9332: 20 00 C6  JSR sub_0x03D575
bra_9335_команда_справа:
C - - - - - 0x035345 1A:9335: 20 72 8F  JSR sub_8F72
C - - - - - 0x035348 1A:9338: A9 01     LDA #$01
C - - - - - 0x03534A 1A:933A: A2 12     LDX #$12
C - - - - - 0x03534C 1A:933C: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x03534F 1A:933F: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x035352 1A:9342: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x035355 1A:9345: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035358 1A:9348: 4C 93     .word ofs_046_934C_00
- D 0 - I - 0x03535A 1A:934A: 59 93     .word ofs_046_9359_01




ofs_046_934C_00:
C - - J - - 0x03535C 1A:934C: A9 25     LDA #con_s_id_25
C - - - - - 0x03535E 1A:934E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035361 1A:9351: A9 66     LDA #$66
C - - - - - 0x035363 1A:9353: 8D 1A 06  STA ram_061A
C - - - - - 0x035366 1A:9356: 4C 1B C6  JMP loc_0x03DD12




ofs_046_9359_01:
C - - J - - 0x035369 1A:9359: A9 26     LDA #con_s_id_26
C - - - - - 0x03536B 1A:935B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03536E 1A:935E: A9 4D     LDA #$4D
C - - - - - 0x035370 1A:9360: 8D 1A 06  STA ram_061A
C - - - - - 0x035373 1A:9363: 4C 15 C6  JMP loc_0x03DE6E




ofs_039_81EA_04_нарушение:
ofs_040_847C_04_нарушение:
ofs_043_87D4_04_нарушение:
C D 0 - - - 0x035376 1A:9366: A9 00     LDA #$00
C - - - - - 0x035378 1A:9368: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x03537B 1A:936B: 20 9C 8B  JSR sub_8B9C
C - - - - - 0x03537E 1A:936E: 90 09     BCC bra_9379
C - - - - - 0x035380 1A:9370: 8A        TXA
C - - - - - 0x035381 1A:9371: 4D FB 05  EOR ram_команда_с_мячом
C - - - - - 0x035384 1A:9374: F0 03     BEQ bra_9379    ; if комада слева
; if мяч у команды справа
C - - - - - 0x035386 1A:9376: 4C CF 94  JMP loc_94CF
bra_9379:
C - - - - - 0x035389 1A:9379: A9 2B     LDA #con_s_id_2B
C - - - - - 0x03538B 1A:937B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03538E 1A:937E: 20 7B 98  JSR sub_987B
C - - - - - 0x035391 1A:9381: AD 35 06  LDA ram_ball_pos_X_hi
C - - - - - 0x035394 1A:9384: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035397 1A:9387: F0 05     BEQ bra_938E_команда_слева
; if мяч у команды справа
C - - - - - 0x035399 1A:9389: 49 FF     EOR #$FF
C - - - - - 0x03539B 1A:938B: 18        CLC
C - - - - - 0x03539C 1A:938C: 69 01     ADC #$01
bra_938E_команда_слева:
C - - - - - 0x03539E 1A:938E: C9 A0     CMP #$A0
C - - - - - 0x0353A0 1A:9390: 90 03     BCC bra_9395
C - - - - - 0x0353A2 1A:9392: 4C E4 93  JMP loc_93E4
bra_9395:
loc_9395:
C D 0 - - - 0x0353A5 1A:9395: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0353A8 1A:9398: F0 22     BEQ bra_93BC_команда_слева
; if мяч у команды справа
C - - - - - 0x0353AA 1A:939A: AD E2 00  LDA ram_random + $01
C - - - - - 0x0353AD 1A:939D: 29 0F     AND #$0F
C - - - - - 0x0353AF 1A:939F: C9 0A     CMP #$0A
C - - - - - 0x0353B1 1A:93A1: 90 03     BCC bra_93A6
C - - - - - 0x0353B3 1A:93A3: 38        SEC
C - - - - - 0x0353B4 1A:93A4: E9 0A     SBC #$0A
bra_93A6:
C - - - - - 0x0353B6 1A:93A6: 38        SEC
C - - - - - 0x0353B7 1A:93A7: 69 0B     ADC #$0B
C - - - - - 0x0353B9 1A:93A9: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x0353BC 1A:93AC: D0 09     BNE bra_93B7
C - - - - - 0x0353BE 1A:93AE: 18        CLC
C - - - - - 0x0353BF 1A:93AF: 69 01     ADC #$01
C - - - - - 0x0353C1 1A:93B1: C9 16     CMP #$16
C - - - - - 0x0353C3 1A:93B3: 90 02     BCC bra_93B7
- - - - - - 0x0353C5 1A:93B5: A9 0C     LDA #$0C
bra_93B7:
C - - - - - 0x0353C7 1A:93B7: 8D FC 05  STA ram_принимающий
C - - - - - 0x0353CA 1A:93BA: D0 03     BNE bra_93BF    ; jmp?
bra_93BC_команда_слева:
C - - - - - 0x0353CC 1A:93BC: 20 DE 93  JSR sub_93DE
bra_93BF:
C - - - - - 0x0353CF 1A:93BF: A9 01     LDA #$01
C - - - - - 0x0353D1 1A:93C1: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x0353D4 1A:93C4: A9 00     LDA #$00
C - - - - - 0x0353D6 1A:93C6: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0353D9 1A:93C9: A9 18     LDA #con_s_id_18
C - - - - - 0x0353DB 1A:93CB: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0353DE 1A:93CE: A9 04     LDA #$04
C - - - - - 0x0353E0 1A:93D0: A2 12     LDX #$12
C - - - - - 0x0353E2 1A:93D2: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x0353E5 1A:93D5: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x0353E8 1A:93D8: A2 50     LDX #$50
C - - - - - 0x0353EA 1A:93DA: 9A        TXS
C - - - - - 0x0353EB 1A:93DB: 4C 12 C6  JMP loc_0x03DE62



sub_93DE:
loc_93DE_infinite_loop:
C D 0 - - - 0x0353EE 1A:93DE: 20 48 C6  JSR sub_0x03D7F8    ; возможен PLA PLA
C - - - - - 0x0353F1 1A:93E1: 4C DE 93  JMP loc_93DE_infinite_loop



loc_93E4:
C D 0 - - - 0x0353F4 1A:93E4: AA        TAX
C - - - - - 0x0353F5 1A:93E5: AD 37 06  LDA ram_ball_pos_Y_hi
C - - - - - 0x0353F8 1A:93E8: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x0353FB 1A:93EB: F0 02     BEQ bra_93EF_команда_слева
; if мяч у команды справа
C - - - - - 0x0353FD 1A:93ED: 49 FF     EOR #$FF
bra_93EF_команда_слева:
C - - - - - 0x0353FF 1A:93EF: A8        TAY
C - - - - - 0x035400 1A:93F0: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035403 1A:93F3: 85 3B     STA ram_003B_t22
C - - - - - 0x035405 1A:93F5: A9 00     LDA #$00
bra_93F7_loop:
C - - - - - 0x035407 1A:93F7: 48        PHA
C - - - - - 0x035408 1A:93F8: 0A        ASL
C - - - - - 0x035409 1A:93F9: AA        TAX
C - - - - - 0x03540A 1A:93FA: BD B9 9F  LDA tbl_9FB9,X
C - - - - - 0x03540D 1A:93FD: 85 3C     STA ram_003C_t03_data
C - - - - - 0x03540F 1A:93FF: BD BA 9F  LDA tbl_9FB9 + $01,X
C - - - - - 0x035412 1A:9402: 85 3D     STA ram_003C_t03_data + $01
C - - - - - 0x035414 1A:9404: A0 00     LDY #$00
bra_9406_loop:
C - - - - - 0x035416 1A:9406: B1 3C     LDA (ram_003C_t03_data),Y
C - - - - - 0x035418 1A:9408: C9 FF     CMP #$FF
C - - - - - 0x03541A 1A:940A: F0 07     BEQ bra_9413
C - - - - - 0x03541C 1A:940C: C5 3B     CMP ram_003B_t22
C - - - - - 0x03541E 1A:940E: F0 10     BEQ bra_9420
C - - - - - 0x035420 1A:9410: C8        INY
C - - - - - 0x035421 1A:9411: D0 F3     BNE bra_9406_loop   ; jmp
bra_9413:
C - - - - - 0x035423 1A:9413: 68        PLA
C - - - - - 0x035424 1A:9414: 18        CLC
C - - - - - 0x035425 1A:9415: 69 01     ADC #$01
C - - - - - 0x035427 1A:9417: C9 05     CMP #$05
C - - - - - 0x035429 1A:9419: D0 03     BNE bra_93F7_loop
C - - - - - 0x03542B 1A:941B: 4C 95 93  JMP loc_9395
bra_9420:
C - - - - - 0x035430 1A:9420: 68        PLA
C - - - - - 0x035431 1A:9421: 8D 12 06  STA ram_результат_защитника
bra_9424_loop:
C - - - - - 0x035434 1A:9424: A9 27     LDA #con_B3CF_free_kick_taker
C - - - - - 0x035436 1A:9426: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - - 0x035439 1A:9429: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x03543C 1A:942C: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03543F 1A:942F: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - - 0x035442 1A:9432: 90 F0     BCC bra_9424_loop
bra_9434_loop:
C - - - - - 0x035444 1A:9434: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035447 1A:9437: D0 08     BNE bra_9441_команда_справа
; if мяч у команды слева
C - - - - - 0x035449 1A:9439: A9 04     LDA #$04
C - - - - - 0x03544B 1A:943B: 8D 21 06  STA ram_0621
C - - - - - 0x03544E 1A:943E: 20 00 C6  JSR sub_0x03D575
bra_9441_команда_справа:
C - - - - - 0x035451 1A:9441: 20 70 94  JSR sub_9470
C - - - - - 0x035454 1A:9444: 90 EE     BCC bra_9434_loop
C - - - - - 0x035456 1A:9446: A9 0E     LDA #con_bsw_1C_07
C - - - - - 0x035458 1A:9448: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x03545B 1A:944B: A9 18     LDA #con_s_id_18
C - - - - - 0x03545D 1A:944D: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x035460 1A:9450: E0 01     CPX #$01
C - - - - - 0x035462 1A:9452: F0 02     BEQ bra_9456
C - - - - - 0x035464 1A:9454: A9 1D     LDA #con_s_id_1D
bra_9456:
C - - - - - 0x035466 1A:9456: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035469 1A:9459: A9 04     LDA #$04
C - - - - - 0x03546B 1A:945B: A2 12     LDX #$12
C - - - - - 0x03546D 1A:945D: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x035470 1A:9460: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - - 0x035473 1A:9463: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x035476 1A:9466: C9 01     CMP #$01
C - - - - - 0x035478 1A:9468: D0 03     BNE bra_946D
C - - - - - 0x03547A 1A:946A: 4C 12 C6  JMP loc_0x03DE62
bra_946D:
C - - - - - 0x03547D 1A:946D: 4C B0 8A  JMP loc_8AB0



sub_9470:
C - - - - - 0x035480 1A:9470: A2 03     LDX #$03
C - - - - - 0x035482 1A:9472: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035485 1A:9475: D0 0A     BNE bra_9481    ; if комада справа
; if мяч у команды слева
C - - - - - 0x035487 1A:9477: CA        DEX ; 02
C - - - - - 0x035488 1A:9478: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03548D 1A:947D: F0 02     BEQ bra_9481
C - - - - - 0x03548F 1A:947F: 38        SEC
C - - - - - 0x035490 1A:9480: 60        RTS
bra_9481:
C - - - - - 0x035491 1A:9481: 8E 12 06  STX ram_результат_защитника
C - - - - - 0x035494 1A:9484: 8A        TXA
C - - - - - 0x035495 1A:9485: 18        CLC
C - - - - - 0x035496 1A:9486: 69 28     ADC #$28
; con_B3CF_aim_left_right
; con_B3CF_wall_left_right
C - - - - - 0x035498 1A:9488: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03549B 1A:948B: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03549E 1A:948E: D0 05     BNE bra_9495_команда_справа
; if комада слева
C - - - - - 0x0354A0 1A:9490: A9 03     LDA #con_B3CF_player_dribble_pass_shoot
C - - - - - 0x0354A2 1A:9492: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9495_команда_справа:
C - - - - - 0x0354A5 1A:9495: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0354A8 1A:9498: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_949B_loop:
C - - - - - 0x0354AB 1A:949B: A9 01     LDA #$01
C - - - - - 0x0354AD 1A:949D: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0354B0 1A:94A0: A9 0C     LDA #con_btns_UD
C - - - - - 0x0354B2 1A:94A2: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354B5 1A:94A5: F0 0B     BEQ bra_94B2
C - - - - - 0x0354B7 1A:94A7: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x0354BA 1A:94AA: 49 40     EOR #$40
C - - - - - 0x0354BC 1A:94AC: 8D 12 06  STA ram_результат_защитника
C - - - - - 0x0354BF 1A:94AF: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_94B2:
C - - - - - 0x0354C2 1A:94B2: A9 40     LDA #con_btn_B
C - - - - - 0x0354C4 1A:94B4: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354C7 1A:94B7: F0 02     BEQ bra_94BB
- - - - - - 0x0354C9 1A:94B9: 18        CLC
- - - - - - 0x0354CA 1A:94BA: 60        RTS
bra_94BB:
C - - - - - 0x0354CB 1A:94BB: A9 80     LDA #con_btn_A
C - - - - - 0x0354CD 1A:94BD: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0354D0 1A:94C0: F0 D9     BEQ bra_949B_loop
C - - - - - 0x0354D2 1A:94C2: A2 00     LDX #$00
C - - - - - 0x0354D4 1A:94C4: 2C 12 06  BIT ram_результат_защитника
C - - - - - 0x0354D7 1A:94C7: 50 01     BVC bra_94CA
C - - - - - 0x0354D9 1A:94C9: E8        INX
bra_94CA:
C - - - - - 0x0354DA 1A:94CA: 8E 12 06  STX ram_результат_защитника
C - - - - - 0x0354DD 1A:94CD: 38        SEC
C - - - - - 0x0354DE 1A:94CE: 60        RTS



loc_94CF:
C D 0 - - - 0x0354DF 1A:94CF: A9 1F     LDA #con_s_id_1F
C - - - - - 0x0354E1 1A:94D1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0354E4 1A:94D4: 20 7B 98  JSR sub_987B
C - - - - - 0x0354E7 1A:94D7: A9 2F     LDA #con_B3CF_select_penalty_taker
C - - - - - 0x0354E9 1A:94D9: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - - 0x0354EC 1A:94DC: A9 20     LDA #con_s_id_20
C - - - - - 0x0354EE 1A:94DE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0354F1 1A:94E1: A9 05     LDA #$05
C - - - - - 0x0354F3 1A:94E3: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x0354F6 1A:94E6: 20 45 C6  JSR sub_0x03E6FC
C - - - - - 0x0354F9 1A:94E9: 20 09 95  JSR sub_9509
C - - - - - 0x0354FC 1A:94EC: A9 21     LDA #con_s_id_21
C - - - - - 0x0354FE 1A:94EE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035501 1A:94F1: A9 05     LDA #$05
C - - - - - 0x035503 1A:94F3: A2 00     LDX #$00
C - - - - - 0x035505 1A:94F5: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x035508 1A:94F8: A9 01     LDA #$01
C - - - - - 0x03550A 1A:94FA: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x03550D 1A:94FD: AD 12 06  LDA ram_результат_защитника
C - - - - - 0x035510 1A:9500: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035513 1A:9503: AC 85     .word ofs_063_85AC_00
- D 0 - I - 0x035515 1A:9505: DF 8B     .word ofs_063_8BDF_01
- D 0 - I - 0x035517 1A:9507: 1C 86     .word ofs_063_861C_02



sub_9509:
C - - - - - 0x035519 1A:9509: A9 00     LDA #$00
C - - - - - 0x03551B 1A:950B: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x03551E 1A:950E: 8D 3E 04  STA ram_подтип_действия_защиты
C - - - - - 0x035521 1A:9511: 8D 4E 04  STA ram_высота_мяча
C - - - - - 0x035524 1A:9514: A9 05     LDA #$05
C - - - - - 0x035526 1A:9516: 8D 21 06  STA ram_0621
C - - - - - 0x035529 1A:9519: 20 00 C6  JSR sub_0x03D575
C - - - - - 0x03552C 1A:951C: A9 0D     LDA #con_bsw_1C_рандом_стороны_кипера_в_пк
C - - - - - 0x03552E 1A:951E: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035531 1A:9521: 20 72 8F  JSR sub_8F72
C - - - - - 0x035534 1A:9524: A9 08     LDA #con_bsw_1C_03
C - - - - - 0x035536 1A:9526: 20 4B C5  JSR sub_0x03CE7E_подпрограммы_в_банке_1C
C - - - - - 0x035539 1A:9529: A9 00     LDA #$00
C - - - - - 0x03553B 1A:952B: 85 3A     STA ram_003A_t33_flag
C - - - - - 0x03553D 1A:952D: 85 3B     STA ram_003B_t10
C - - - - - 0x03553F 1A:952F: A9 09     LDA #$09
C - - - - - 0x035541 1A:9531: A2 80     LDX #$80
C - - - - - 0x035543 1A:9533: 20 1F 8F  JSR sub_8F1F
C - - - - - 0x035546 1A:9536: 48        PHA
C - - - - - 0x035547 1A:9537: A0 00     LDY #$00
C - - - - - 0x035549 1A:9539: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x03554C 1A:953C: EC 3D 04  CPX ram_действие_защиты
C - - - - - 0x03554F 1A:953F: D0 05     BNE bra_9546
C - - - - - 0x035551 1A:9541: C9 C8     CMP #$C8
C - - - - - 0x035553 1A:9543: B0 01     BCS bra_9546
C - - - - - 0x035555 1A:9545: C8        INY
bra_9546:
C - - - - - 0x035556 1A:9546: 98        TYA
C - - - - - 0x035557 1A:9547: D0 10     BNE bra_9559
C - - - - - 0x035559 1A:9549: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x03555C 1A:954C: C9 08     CMP #$08
C - - - - - 0x03555E 1A:954E: F0 09     BEQ bra_9559
C - - - - - 0x035560 1A:9550: AD E2 00  LDA ram_random + $01
C - - - - - 0x035563 1A:9553: C9 1F     CMP #$1F
C - - - - - 0x035565 1A:9555: B0 02     BCS bra_9559
C - - - - - 0x035567 1A:9557: A0 02     LDY #$02
bra_9559:
C - - - - - 0x035569 1A:9559: 68        PLA
C - - - - - 0x03556A 1A:955A: 20 48 81  STY ram_результат_защитника
C - - - - - 0x03556D 1A:955D: 60        RTS



loc_955E_очистить_stun_кипера_команды:
C D 0 - - - 0x03556E 1A:955E: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035571 1A:9561: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035574 1A:9564: A0 0A     LDY #con_plr_stun
C - - - - - 0x035576 1A:9566: A9 00     LDA #$00
C - - - - - 0x035578 1A:9568: 91 34     STA (ram_plr_data),Y    ; con_plr_stun
C - - - - - 0x03557A 1A:956A: A9 05     LDA #$05
C - - - - - 0x03557C 1A:956C: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x03557F 1A:956F: 8E 41 04  STX ram_игрок_с_мячом   ; запись номера кипера 00/0B
C - - - - - 0x035582 1A:9572: F0 02     BEQ bra_9576_команда_слева
; if комада справа
C - - - - - 0x035584 1A:9574: A9 E9     LDA #$E9
bra_9576_команда_слева:
C - - - - - 0x035586 1A:9576: 8D FE 05  STA ram_05FE
C - - - - - 0x035589 1A:9579: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x03558C 1A:957C: 8E 35 06  STX ram_ball_pos_X_hi
C - - - - - 0x03558F 1A:957F: 8C 37 06  STY ram_ball_pos_Y_hi
C - - - - - 0x035592 1A:9582: A9 27     LDA #con_s_id_27
C - - - - - 0x035594 1A:9584: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035597 1A:9587: 20 7B 98  JSR sub_987B
C - - - - - 0x03559A 1A:958A: A9 0A     LDA #$0A
C - - - - - 0x03559C 1A:958C: 20 0D 9E  JSR sub_9E0D
C - - - - - 0x03559F 1A:958F: AD E2 00  LDA ram_random + $01
C - - - - - 0x0355A2 1A:9592: 29 0F     AND #$0F
C - - - - - 0x0355A4 1A:9594: C9 0A     CMP #$0A
C - - - - - 0x0355A6 1A:9596: 90 02     BCC bra_959A
C - - - - - 0x0355A8 1A:9598: E9 0A     SBC #$0A
bra_959A:
C - - - - - 0x0355AA 1A:959A: 38        SEC
C - - - - - 0x0355AB 1A:959B: 6D FB 05  ADC ram_команда_с_мячом
C - - - - - 0x0355AE 1A:959E: 8D FC 05  STA ram_принимающий
C - - - - - 0x0355B1 1A:95A1: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
C - - - - - 0x0355B4 1A:95A4: 20 1E C6  JSR sub_0x03E069
C - - - - - 0x0355B7 1A:95A7: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0355BA 1A:95AA: 20 6E 8E  JSR sub_8E6E_запись_игрока_с_мячом___запись_команды_с_мячом___выбор_мелодии_команды
C - - - - - 0x0355BD 1A:95AD: A9 01     LDA #$01
C - - - - - 0x0355BF 1A:95AF: 8D 3B 04  STA ram_действие_атаки
C - - - - - 0x0355C2 1A:95B2: A9 00     LDA #$00
C - - - - - 0x0355C4 1A:95B4: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - - 0x0355C7 1A:95B7: A9 28     LDA #con_s_id_28
C - - - - - 0x0355C9 1A:95B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0355CC 1A:95BC: A9 02     LDA #$02
C - - - - - 0x0355CE 1A:95BE: A2 0C     LDX #$0C
C - - - - - 0x0355D0 1A:95C0: 20 10 91  JSR sub_9110_добавить_время_loss_и_уменьшить_таймер_времени_тайма
C - - - - - 0x0355D3 1A:95C3: A9 1A     LDA #$1A
C - - - - - 0x0355D5 1A:95C5: 8D 1A 06  STA ram_061A
C - - - - - 0x0355D8 1A:95C8: A9 01     LDA #$01
C - - - - - 0x0355DA 1A:95CA: 8D 1B 06  STA ram_061B
C - - - - - 0x0355DD 1A:95CD: 20 0C C6  JSR sub_0x03E74E
C - - - - - 0x0355E0 1A:95D0: AD FC 05  LDA ram_принимающий
C - - - - - 0x0355E3 1A:95D3: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x0355E6 1A:95D6: A9 1C     LDA #con_s_id_1C
C - - - - - 0x0355E8 1A:95D8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0355EB 1A:95DB: A2 50     LDX #$50
C - - - - - 0x0355ED 1A:95DD: 9A        TXS
C - - - - - 0x0355EE 1A:95DE: 4C 0F C6  JMP loc_0x03E0EF



sub_0x0355F1_вычисление_счета_пенальти:
; 003A что-то типа максимального количества ударов, чтобы не нужно было пробивать лишний раз если все уже проебано
; голы хранятся в 0610 и 0611
; бряк срабатывает перед появлением экрана с выбором пробивающих игроковв
C D 0 - - - 0x0355F1 1A:95E1: 20 CC 96  JSR sub_96CC
C - - - - - 0x0355F4 1A:95E4: A9 00     LDA #$00    ; индекс команды слева
C - - - - - 0x0355F6 1A:95E6: 8D 16 06  STA ram_индекс_защитника
C - - - - - 0x0355F9 1A:95E9: 8D 8E 03  STA ram_038E
C - - - - - 0x0355FC 1A:95EC: 8D 8B 03  STA ram_038B
C - - - - - 0x0355FF 1A:95EF: 8D 0A 03  STA ram_030A
C - - - - - 0x035602 1A:95F2: 8D 07 03  STA ram_0307
C - - - - - 0x035605 1A:95F5: 2C E2 00  BIT ram_random + $01
C - - - - - 0x035608 1A:95F8: 10 02     BPL bra_95FC
C - - - - - 0x03560A 1A:95FA: A9 0B     LDA #$0B    ; индекс команды справа
bra_95FC:
C - - - - - 0x03560C 1A:95FC: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x03560F 1A:95FF: 8D 19 06  STA ram_снижение_силы_действия
                                        LDA #con_B3CF_booth_for_charlie_pk_period_number
                                        JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035612 1A:9602: A9 41     LDA #con_B3CF_pk_score
C - - - - - 0x035614 1A:9604: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035617 1A:9607: A9 33     LDA #con_music_33
C - - - - - 0x035619 1A:9609: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - - 0x03561C 1A:960C: A9 39     LDA #con_s_id_39
C - - - - - 0x03561E 1A:960E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_9611:
; бряк срабатывает перед объявлением имени пробивающего
C D 0 - - - 0x035621 1A:9611: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x035624 1A:9614: 4A        LSR
C - - - - - 0x035625 1A:9615: 8D 17 06  STA ram_колво_активных_защитников
C - - - - - 0x035628 1A:9618: B0 09     BCS bra_9623
C - - - - - 0x03562A 1A:961A: C9 05     CMP #$05
C - - - - - 0x03562C 1A:961C: D0 05     BNE bra_9623
C - - - - - 0x03562E 1A:961E: A9 45     LDA #con_s_id_45
C - - - - - 0x035630 1A:9620: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
bra_9623:
C - - - - - 0x035633 1A:9623: AD 17 06  LDA ram_колво_активных_защитников
bra_9626_loop:
C - - - - - 0x035636 1A:9626: C9 0A     CMP #$0A
C - - - - - 0x035638 1A:9628: 90 04     BCC bra_962E
- - - - - - 0x03563A 1A:962A: E9 0A     SBC #$0A
- - - - - - 0x03563C 1A:962C: B0 F8     BCS bra_9626_loop
bra_962E:
C - - - - - 0x03563E 1A:962E: AA        TAX
C - - - - - 0x03563F 1A:962F: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035642 1A:9632: F0 08     BEQ bra_963C_команда_слева
; if мяч у команды справа
C - - - - - 0x035644 1A:9634: 86 3A     STX ram_003A_t35
C - - - - - 0x035646 1A:9636: A9 09     LDA #$09
C - - - - - 0x035648 1A:9638: 38        SEC
C - - - - - 0x035649 1A:9639: E5 3A     SBC ram_003A_t35
C - - - - - 0x03564B 1A:963B: AA        TAX
bra_963C_команда_слева:
C - - - - - 0x03564C 1A:963C: BD 31 04  LDA ram_список_спешалов + $01,X
C - - - - - 0x03564F 1A:963F: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035652 1A:9642: F0 03     BEQ bra_9647_команда_слева
; if мяч у команды справа
C - - - - - 0x035654 1A:9644: 18        CLC
C - - - - - 0x035655 1A:9645: 69 0B     ADC #$0B
bra_9647_команда_слева:
C - - - - - 0x035657 1A:9647: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x03565A 1A:964A: A9 22     LDA #con_s_id_22
C - - - - - 0x03565C 1A:964C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x03565F 1A:964F: 20 09 95  JSR sub_9509
C - - - - - 0x035662 1A:9652: A9 23     LDA #con_s_id_23
C - - - - - 0x035664 1A:9654: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035667 1A:9657: 20 AE 96  JSR sub_96AE
C - - - - - 0x03566A 1A:965A: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x03566D 1A:965D: EE 16 06  INC ram_индекс_защитника
C - - - - - 0x035670 1A:9660: 4A        LSR
C - - - - - 0x035671 1A:9661: 08        PHP
C - - - - - 0x035672 1A:9662: 85 3A     STA ram_003A_t36
C - - - - - 0x035674 1A:9664: 38        SEC
C - - - - - 0x035675 1A:9665: A9 03     LDA #$03
C - - - - - 0x035677 1A:9667: E5 3A     SBC ram_003A_t36
C - - - - - 0x035679 1A:9669: AA        TAX
C - - - - - 0x03567A 1A:966A: B0 02     BCS bra_966E
C - - - - - 0x03567C 1A:966C: A2 FF     LDX #$FF
bra_966E:
C - - - - - 0x03567E 1A:966E: E8        INX
C - - - - - 0x03567F 1A:966F: E8        INX
C - - - - - 0x035680 1A:9670: 28        PLP
C - - - - - 0x035681 1A:9671: B0 01     BCS bra_9674
C - - - - - 0x035683 1A:9673: E8        INX
bra_9674:
C - - - - - 0x035684 1A:9674: 86 3A     STX ram_003A_t37_колво_голов_пк
C - - - - - 0x035686 1A:9676: AD 10 06  LDA ram_пк_голы
C - - - - - 0x035689 1A:9679: 38        SEC
C - - - - - 0x03568A 1A:967A: ED 11 06  SBC ram_пк_голы + $01
C - - - - - 0x03568D 1A:967D: B0 04     BCS bra_9683
C - - - - - 0x03568F 1A:967F: 49 FF     EOR #$FF
C - - - - - 0x035691 1A:9681: 69 01     ADC #$01
bra_9683:
C - - - - - 0x035693 1A:9683: C5 3A     CMP ram_003A_t37_колво_голов_пк
C - - - - - 0x035695 1A:9685: B0 0B     BCS bra_9692
C - - - - - 0x035697 1A:9687: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03569A 1A:968A: 49 0B     EOR #$0B
C - - - - - 0x03569C 1A:968C: 8D FB 05  STA ram_команда_с_мячом
C - - - - - 0x03569F 1A:968F: 4C 11 96  JMP loc_9611
bra_9692:
C - - - - - 0x0356A2 1A:9692: A2 00     LDX #$00
C - - - - - 0x0356A4 1A:9694: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - - 0x0356A7 1A:9697: E8        INX
C - - - - - 0x0356A8 1A:9698: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - - 0x0356AB 1A:969B: A9 33     LDA #con_s_id_33
C - - - - - 0x0356AD 1A:969D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x0356B0 1A:96A0: 4C 54 C5  JMP loc_0x03CF0E



sub_96A3_сложение_голов_матча_и_пк:
; bzk optimize, нахрена это вообще надо? может для сценария
C - - - - - 0x0356B3 1A:96A3: BD 10 06  LDA ram_пк_голы,X
C - - - - - 0x0356B6 1A:96A6: 18        CLC
C - - - - - 0x0356B7 1A:96A7: 7D 28 00  ADC ram_голы,X
C - - - - - 0x0356BA 1A:96AA: 9D 28 00  STA ram_голы,X
C - - - - - 0x0356BD 1A:96AD: 60        RTS



sub_96AE:
C - - - - - 0x0356BE 1A:96AE: AD 12 06  LDA ram_результат_защитника
                                        BNE bra_96C9_RTS
; увеличить счетчик голов если кто-то забил
; включает в себя когда кипер не угадал, и когда не смог отбить даже если угадал
C - - J - - 0x0356CA 1A:96BA: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x0356CD 1A:96BD: F0 02     BEQ bra_96C1_команда_слева
; if мяч у команды справа
C - - - - - 0x0356CF 1A:96BF: A2 01     LDX #$01
bra_96C1_команда_слева: ; X = 00, bzk optimize, небезопасно
C - - - - - 0x0356D1 1A:96C1: FE 10 06  INC ram_пк_голы,X
C - - - - - 0x0356D4 1A:96C4: A9 41     LDA #con_B3CF_pk_score
C - - - - - 0x0356D6 1A:96C6: 20 2A C5  JMP loc_0x03EF8F_отрисовка_меню_во_время_матча
bra_96C9_RTS:
C - - - - - 0x0356D9 1A:96C9: 60        RTS



sub_96CC:
C - - - - - 0x0356DC 1A:96CC: A9 01     LDA #con_sfx_выкл_музыку_и_звуки
C - - - - - 0x0356DE 1A:96CE: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - - 0x0356E1 1A:96D1: A9 00     LDA #$00
C - - - - - 0x0356E3 1A:96D3: 85 11     STA ram_0011
C - - - - - 0x0356E5 1A:96D5: 85 12     STA ram_0012
C - - - - - 0x0356E9 1A:96D9: 8D 30 04  STA ram_список_спешалов
C - - - - - 0x0356EC 1A:96DC: 8D 3C 05  STA ram_номер_анимации
C - - - - - 0x0356EF 1A:96DF: A9 80     LDA #$80
C - - - - - 0x0356F1 1A:96E1: 8D 3A 05  STA ram_053A_flag
C - - - - - 0x0356F4 1A:96E4: A2 00     LDX #$00    ; палитра фона
C - - - - - 0x0356F6 1A:96E6: A9 12     LDA #con_FBCC_12
C - - - - - 0x0356F8 1A:96E8: 20 30 C5  JSR sub_0x03CC12_запись_палитры_во_время_матча
C - - - - - 0x0356FB 1A:96EB: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x035701 1A:96F1: A9 02     LDA #$02
C - - - - - 0x035703 1A:96F3: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035718 1A:9708: A9 2E     LDA #$2E
C - - - - - 0x03571A 1A:970A: 8D 91 04  STA ram_chr_bank + $01
                                        LDA ram_номер_матча
                                        ASL
                                        ADC #$80
                                        STA ram_chr_bank
C - - - - - 0x035706 1A:96F6: A9 00     LDA #$00
C - - - - - 0x03571F 1A:970F: 8D CE 05  STA ram_05CE
C - - - - - 0x035722 1A:9712: 85 4A     STA ram_004A_t03_scroll_X
C - - - - - 0x035724 1A:9714: 85 4B     STA ram_004B_t02_scroll_Y
; bzk optimize, бесполезный STA судя по логу
C - - - - - 0x035708 1A:96F8: 8D 69 04  STA ram_for_5204
C - - - - - 0x035710 1A:9700: 8D 00 E0  STA $5204
C - - - - - 0x035726 1A:9716: A5 20     LDA ram_for_2000
C - - - - - 0x035728 1A:9718: 29 FC     AND #$FC
C - - - - - 0x03572A 1A:971A: 85 20     STA ram_for_2000
C - - - - - 0x03572C 1A:971C: A9 3E     LDA #con_B3CF_pk_shootout_select_taker
C - - - - - 0x03572E 1A:971E: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035731 1A:9721: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
C - - - - - 0x035734 1A:9724: A2 00     LDX #$00    ; палитра фона
C - - - - - 0x035736 1A:9726: A9 13     LDA #con_FBCC_13
C - - - - - 0x035738 1A:9728: 20 30 C5  JSR sub_0x03CC12_запись_палитры_во_время_матча
C - - - - - 0x03573B 1A:972B: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x035741 1A:9731: A9 00     LDA #$00
C - - - - - 0x035743 1A:9733: 8D 24 06  STA ram_0624
C - - - - - 0x035746 1A:9736: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9739_loop:
C D 0 - - - 0x035749 1A:9739: A9 01     LDA #$01
C - - - - - 0x03574B 1A:973B: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03574E 1A:973E: A9 0C     LDA #con_btns_UD
C - - - - - 0x035750 1A:9740: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035753 1A:9743: F0 32     BEQ bra_9777
C - - - - - 0x035755 1A:9745: 48        PHA
C - - - - - 0x035756 1A:9746: A9 09     LDA #$09
C - - - - - 0x035758 1A:9748: 38        SEC
C - - - - - 0x035759 1A:9749: ED 30 04  SBC ram_список_спешалов
C - - - - - 0x03575C 1A:974C: 85 3A     STA ram_003A_t38
C - - - - - 0x03575E 1A:974E: 68        PLA
C - - - - - 0x03575F 1A:974F: A2 01     LDX #$01
C - - - - - 0x035761 1A:9751: 29 04     AND #$04
C - - - - - 0x035763 1A:9753: D0 02     BNE bra_9757_было_нажато_вниз
C - - - - - 0x035765 1A:9755: A2 FF     LDX #$FF
bra_9757_было_нажато_вниз:
C - - - - - 0x035767 1A:9757: 8A        TXA
C - - - - - 0x035768 1A:9758: 18        CLC
C - - - - - 0x035769 1A:9759: 6D 24 06  ADC ram_0624
C - - - - - 0x03576C 1A:975C: 30 19     BPL bra_975E
                                        LDA ram_003A_t38      ; нажато вверх
                                        JMP loc_9769_обновить_курсор
bra_975E:
C - - - - - 0x03576E 1A:975E: C5 3A     CMP ram_003A_t38
C - - - - - 0x035770 1A:9760: 90 02     BCC bra_9764
C - - - - - 0x035772 1A:9762: A5 3A     LDA ram_003A_t38
bra_9764:
C - - - - - 0x035774 1A:9764: CD 24 06  CMP ram_0624
C - - - - - 0x035777 1A:9767: F0 0E     BNE bra_9769_обновить_курсор
                                        LDA #$00          ; нажато вниз
loc_9769_обновить_курсор:
bra_9769_обновить_курсор:
C - - - - - 0x035779 1A:9769: 48        PHA
C - - - - - 0x03577A 1A:976A: AD 24 06  LDA ram_0624
C - - - - - 0x03577D 1A:976D: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - - 0x035780 1A:9770: 68        PLA
C - - - - - 0x035781 1A:9771: 8D 24 06  STA ram_0624
C - - - - - 0x035784 1A:9774: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9777:
bra_9777:
C - - - - - 0x035787 1A:9777: A9 40     LDA #con_btn_B
C - - - - - 0x035789 1A:9779: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03578C 1A:977C: F0 0B     BEQ bra_9789
C - - - - - 0x03578E 1A:977E: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x035791 1A:9781: F0 06     BEQ bra_9789
C - - - - - 0x035793 1A:9783: CE 30 04  DEC ram_список_спешалов
C - - - - - 0x035796 1A:9786: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_9789:
C - - - - - 0x035799 1A:9789: A9 80     LDA #con_btn_A
C - - - - - 0x03579B 1A:978B: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03579E 1A:978E: F0 66     BEQ bra_97F6
C - - - - - 0x0357A0 1A:9790: AD 30 04  LDA ram_список_спешалов
C - - - - - 0x0357A3 1A:9793: C9 05     CMP #$05
C - - - - - 0x0357A5 1A:9795: D0 03     BNE bra_979A
C - - - - - 0x0357A7 1A:9797: 4C F9 97  JMP loc_97F9_спешалы
bra_979A:
C - - - - - 0x0357AA 1A:979A: AD 24 06  LDA ram_0624
C - - - - - 0x0357AD 1A:979D: 85 3A     STA ram_003A_t39
C - - - - - 0x0357AF 1A:979F: A9 01     LDA #$01
C - - - - - 0x0357B1 1A:97A1: 85 3B     STA ram_003B_t23
C - - - - - 0x0357B3 1A:97A3: A9 00     LDA #$00
C - - - - - 0x0357B5 1A:97A5: 85 3C     STA ram_003C_t12
bra_97A7_loop:
C - - - - - 0x0357B7 1A:97A7: A5 3B     LDA ram_003B_t23
C - - - - - 0x0357B9 1A:97A9: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x0357BC 1A:97AC: F0 0E     BEQ bra_97BC
bra_97AE_loop:
C - - - - - 0x0357BE 1A:97AE: DD 30 04  CMP ram_список_спешалов,X
C - - - - - 0x0357C1 1A:97B1: F0 05     BEQ bra_97B8
C - - - - - 0x0357C3 1A:97B3: CA        DEX
C - - - - - 0x0357C4 1A:97B4: D0 F8     BNE bra_97AE_loop
C - - - - - 0x0357C6 1A:97B6: F0 04     BEQ bra_97BC    ; jmp
bra_97B8:
C - - - - - 0x0357C8 1A:97B8: E6 3B     INC ram_003B_t23
C - - - - - 0x0357CA 1A:97BA: D0 EB     BNE bra_97A7_loop    ; jmp
bra_97BC:
C - - - - - 0x0357CC 1A:97BC: A5 3C     LDA ram_003C_t12
C - - - - - 0x0357CE 1A:97BE: E6 3C     INC ram_003C_t12
C - - - - - 0x0357D0 1A:97C0: C5 3A     CMP ram_003A_t39
C - - - - - 0x0357D2 1A:97C2: F0 04     BEQ bra_97C8
C - - - - - 0x0357D4 1A:97C4: E6 3B     INC ram_003B_t23
C - - - - - 0x0357D6 1A:97C6: D0 DF     BNE bra_97A7_loop    ; jmp
bra_97C8:
C - - - - - 0x0357D8 1A:97C8: A5 3B     LDA ram_003B_t23
C - - - - - 0x0357DA 1A:97CA: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x0357DD 1A:97CD: 9D 31 04  STA ram_список_спешалов + $01,X
C - - - - - 0x0357E0 1A:97D0: EE 30 04  INC ram_список_спешалов
C - - - - - 0x0357E3 1A:97D3: A9 09     LDA #$09
C - - - - - 0x0357E5 1A:97D5: 38        SEC
C - - - - - 0x0357E6 1A:97D6: ED 30 04  SBC ram_список_спешалов
C - - - - - 0x0357E9 1A:97D9: 85 3A     STA ram_003A_t40
C - - - - - 0x0357EB 1A:97DB: AD 24 06  LDA ram_0624
C - - - - - 0x0357EE 1A:97DE: E5 3A     SBC ram_003A_t40
C - - - - - 0x0357F0 1A:97E0: 90 11     BCC bra_97F3
C - - - - - 0x0357F2 1A:97E2: AD 24 06  LDA ram_0624
C - - - - - 0x0357F5 1A:97E5: A6 3A     LDX ram_003A_t40
C - - - - - 0x0357F7 1A:97E7: 8E 24 06  STX ram_0624
C - - - - - 0x0357FA 1A:97EA: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - - 0x0357FD 1A:97ED: AD 24 06  LDA ram_0624
C - - - - - 0x035800 1A:97F0: 20 28 98  JSR sub_9828_нарисовать_курсор
bra_97F3:
C - - - - - 0x035803 1A:97F3: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_97F6:
C - - - - - 0x035806 1A:97F6: 4C 39 97  JMP loc_9739_loop



loc_97F9_спешалы:
C D 0 - - - 0x035809 1A:97F9: A9 01     LDA #$01
C - - - - - 0x03580B 1A:97FB: 85 3A     STA ram_003A_t41
C - - - - - 0x03580D 1A:97FD: A0 0A     LDY #$0A
bra_97FF_loop:
C - - - - - 0x03580F 1A:97FF: A2 00     LDX #$00
C - - - - - 0x035811 1A:9801: A5 3A     LDA ram_003A_t41
bra_9803_loop:
C - - - - - 0x035813 1A:9803: DD 31 04  CMP ram_список_спешалов + $01,X
C - - - - - 0x035816 1A:9806: F0 0E     BEQ bra_9816
C - - - - - 0x035818 1A:9808: E8        INX
C - - - - - 0x035819 1A:9809: E0 05     CPX #$05
C - - - - - 0x03581B 1A:980B: D0 F6     BNE bra_9803_loop
C - - - - - 0x03581D 1A:980D: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x035820 1A:9810: 9D 31 04  STA ram_список_спешалов + $01,X
C - - - - - 0x035823 1A:9813: EE 30 04  INC ram_список_спешалов
bra_9816:
C - - - - - 0x035826 1A:9816: E6 3A     INC ram_003A_t41
C - - - - - 0x035828 1A:9818: 88        DEY
C - - - - - 0x035829 1A:9819: D0 E4     BNE bra_97FF_loop
C - - - - - 0x03582B 1A:981B: 20 69 C5  JSR sub_0x03CB45_очистить_nametable
C - - - - - 0x03582E 1A:981E: A9 00     LDA #$00
C - - - - - 0x035830 1A:9820: 85 8E     STA ram_008E_t02_индекс_таблицы_сканлиний
C - - - - - 0x035832 1A:9822: A9 01     LDA #$80
C - - - - - 0x035834 1A:9824: 8D 69 04  STA ram_for_5204
C - - - - - 0x035837 1A:9827: 60        RTS



sub_9828_нарисовать_курсор:
C - - - - - 0x035838 1A:9828: A2 B1     LDX #$B1
C - - - - - 0x03583A 1A:982A: D0 02     BNE bra_982E    ; jmp



sub_982C_удалить_курсор:
C - - - - - 0x03583C 1A:982C: A2 00     LDX #$00
bra_982E:
C - - - - - 0x03583E 1A:982E: 48        PHA
bra_982F_ожидание_освобождения_буфера:
C - - - - - 0x03583F 1A:982F: A9 01     LDA #$01
C - - - - - 0x035841 1A:9831: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035844 1A:9834: AD 15 05  LDA ram_0515_buffer_flag
C - - - - - 0x035847 1A:9837: D0 F6     BNE bra_982F_ожидание_освобождения_буфера
C - - - - - 0x035849 1A:9839: A9 01     LDA #$01
C - - - - - 0x03584B 1A:983B: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x03584E 1A:983E: A0 01     LDY #$01
C - - - - - 0x035850 1A:9840: 8C A5 04  STY ram_04A5
C - - - - - 0x035853 1A:9843: 88        DEY
C - - - - - 0x035854 1A:9844: 8C A9 04  STY ram_04A9
C - - - - - 0x035857 1A:9847: 8E A8 04  STX ram_04A8
C - - - - - 0x03585A 1A:984A: 68        PLA
C - - - - - 0x03585B 1A:984B: 8C A6 04  STY ram_04A6
; / 04
C - - - - - 0x03585E 1A:984E: 4A        LSR
C - - - - - 0x03585F 1A:984F: 6E A6 04  ROR ram_04A6
C - - - - - 0x035862 1A:9852: 4A        LSR
C - - - - - 0x035863 1A:9853: 6E A6 04  ROR ram_04A6
; 
C - - - - - 0x035866 1A:9856: 48        PHA
; C = 0?
C - - - - - 0x035867 1A:9857: AD A6 04  LDA ram_04A6
C - - - - - 0x03586A 1A:985A: 69 02     ADC #$02
C - - - - - 0x03586C 1A:985C: 8D A6 04  STA ram_04A6
C - - - - - 0x03586F 1A:985F: 68        PLA
C - - - - - 0x035870 1A:9860: 69 21     ADC #$21
C - - - - - 0x035872 1A:9862: 8D A7 04  STA ram_04A7
C - - - - - 0x035875 1A:9865: A9 80     LDA #$80
C - - - - - 0x035877 1A:9867: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x03587A 1A:986A: 60        RTS



sub_986B_обновить_список_игроков_пенальти:
C - - - - - 0x03587B 1A:986B: A9 01     LDA #$01
C - - - - - 0x03587D 1A:986D: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035880 1A:9870: A9 3F     LDA #con_B3CF_pk_players_list
C - - - - - 0x035882 1A:9872: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035885 1A:9875: A9 40     LDA #con_B3CF_pk_order
C - - - - - 0x035887 1A:9877: 20 2A C5  JMP loc_0x03EF8F_отрисовка_меню_во_время_матча



sub_987B:
C - - - - - 0x03588B 1A:987B: A9 37     LDA #con_s_id_37
C - - - - - 0x03588D 1A:987D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035890 1A:9880: A9 00     LDA #$00
C - - - - - 0x035892 1A:9882: 85 11     STA ram_0011
C - - - - - 0x035894 1A:9884: 85 12     STA ram_0012
C - - - - - 0x035896 1A:9886: A9 01     LDA #$01
C - - - - - 0x035898 1A:9888: 20 15 C5  JSR sub_0x03CB1F_задержка
bra_9892_loop:
C - - - - - 0x0358A2 1A:9892: A9 00     LDA #$00
C - - - - - 0x0358A4 1A:9894: 8D 2D 06  STA ram_062D
C - - - - - 0x0358A7 1A:9897: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x03589E 1A:988E: A9 2E     LDA #con_chr_bank + $2E
C - - - - - 0x0358A0 1A:9890: 85 87     STA ram_0087_chr_bank
C - - - - - 0x0358AA 1A:989A: A9 33     LDA #con_B3CF_resume_play_edit_team_data
C - - - - - 0x0358AC 1A:989C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0358AF 1A:989F: A9 04     LDA #$04
C - - - - - 0x0358B1 1A:98A1: 8D 24 06  STA ram_0624
C - - - - - 0x0358B4 1A:98A4: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98A7_loop:
C - - - - - 0x0358B7 1A:98A7: A9 01     LDA #$01
C - - - - - 0x0358B9 1A:98A9: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0358BC 1A:98AC: A9 0C     LDA #con_btns_UD
C - - - - - 0x0358BE 1A:98AE: 2D 1E 00  AND ram_btn_press
C - - - - - 0x0358C1 1A:98B1: F0 0B     BEQ bra_98BE
C - - - - - 0x0358C3 1A:98B3: AD 24 06  LDA ram_0624
C - - - - - 0x0358C6 1A:98B6: 49 40     EOR #$40
C - - - - - 0x0358C8 1A:98B8: 8D 24 06  STA ram_0624
C - - - - - 0x0358CB 1A:98BB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98BE:
C - - - - - 0x0358CE 1A:98BE: 2C 1C 00  BIT ram_btn_hold
; con_btn_A
C - - - - - 0x0358D1 1A:98C1: 10 E4     BPL bra_98A7_loop
C - - - - - 0x0358D3 1A:98C3: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x0358D6 1A:98C6: 2C 24 06  BIT ram_0624
C - - - - - 0x0358D9 1A:98C9: 70 05     BVS bra_98D0
C - - - - - 0x0358DB 1A:98CB: A9 02     LDA #con_chr_bank + $02
C - - - - - 0x0358DD 1A:98CD: 85 87     STA ram_0087_chr_bank
C - - - - - 0x0358DF 1A:98CF: 60        RTS
bra_98D0:
C - - - - - 0x0358E0 1A:98D0: A9 00     LDA #$00
C - - - - - 0x0358E2 1A:98D2: 8D 24 06  STA ram_0624
loc_98D5:
C D 0 - - - 0x0358E5 1A:98D5: A9 34     LDA #con_B3CF__formation_defense_swap_status_done
C - - - - - 0x0358E7 1A:98D7: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0358EA 1A:98DA: A9 03     LDA #$03
C - - - - - 0x0358EC 1A:98DC: 8D 3D 06  STA ram_положение_миникарты
C - - - - - 0x0358EF 1A:98DF: 20 66 C5  JSR sub_0x03F023_отрисовка_миникарты
C - - - - - 0x0358F2 1A:98E2: A9 85     LDA #$85
C - - - - - 0x0358F4 1A:98E4: 8D 2D 06  STA ram_062D
C - - - - - 0x0358F7 1A:98E7: AD 24 06  LDA ram_0624
C - - - - - 0x0358FA 1A:98EA: 8D 22 06  STA ram_номер_опции
C - - - - - 0x0358FD 1A:98ED: A9 04     LDA #$04
C - - - - - 0x0358FF 1A:98EF: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035902 1A:98F2: 90 9E     BCC bra_9892_loop
C - - - - - 0x035904 1A:98F4: C9 04     CMP #$04
C - - - - - 0x035906 1A:98F6: F0 9A     BEQ bra_9892_loop
C - - - - - 0x035908 1A:98F8: 8D 24 06  STA ram_0624
C - - - - - 0x03590B 1A:98FB: 20 01 99  JSR sub_9901
C - - - - - 0x03590E 1A:98FE: 4C D5 98  JMP loc_98D5



sub_9901:
C - - - - - 0x035911 1A:9901: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035914 1A:9904: 1A 99     .word ofs_047_991A_00
- D 0 - I - 0x035916 1A:9906: 3A 99     .word ofs_047_993A_01
- D 0 - I - 0x035918 1A:9908: 50 99     .word ofs_047_9950_02
- D 0 - I - 0x03591A 1A:990A: AD 9B     .word ofs_047_9BAD_03



loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC55_полностью_очистить_нижнюю_половину_экрана
    JMP loc_990D_нарисовать_будку



sub_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
loc_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
loc_990D_нарисовать_будку:
    LDA #con_B3CF_booth_for_charlie_time_score_period_number
    JMP loc_0x03EF8F_отрисовка_меню_во_время_матча



ofs_047_991A_00:
C - - J - - 0x03592A 1A:991A: A9 35     LDA #con_B3CF_formation
C - - - - - 0x03592C 1A:991C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03592F 1A:991F: AD 2C 00  LDA ram_расстановка_слева
C - - - - - 0x035932 1A:9922: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035935 1A:9925: AD 2C 00  LDA ram_расстановка_слева
C - - - - - 0x035938 1A:9928: 8D 27 06  STA ram_0627
C - - - - - 0x03593B 1A:992B: A9 05     LDA #$05
C - - - - - 0x03593D 1A:992D: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035940 1A:9930: AE 27 06  LDX ram_0627
C - - - - - 0x035943 1A:9933: 90 01     BCC bra_9936
C - - - - - 0x035945 1A:9935: AA        TAX
bra_9936:
C - - - - - 0x035946 1A:9936: 8E 2C 00  STX ram_расстановка_слева
C - - - - - 0x035949 1A:9939: 60        RTS



ofs_047_993A_01:
C - - J - - 0x03594A 1A:993A: A9 36     LDA #con_B3CF_defense
C - - - - - 0x03594C 1A:993C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03594F 1A:993F: AD 2D 00  LDA ram_защита_слева
C - - - - - 0x035952 1A:9942: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035955 1A:9945: A9 06     LDA #$06
C - - - - - 0x035957 1A:9947: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x03595A 1A:994A: 90 03     BCC bra_994F_RTS
C - - - - - 0x03595C 1A:994C: 8D 2D 00  STA ram_защита_слева
bra_994F_RTS:
C - - - - - 0x03595F 1A:994F: 60        RTS



ofs_047_9950_02:
C - - J - - 0x035960 1A:9950: AD 2A 00  LDA ram_твоя_команда
C - - - - - 0x035963 1A:9953: C9 02     CMP #$02
C - - - - - 0x035965 1A:9955: F0 03     BEQ bra_995A
C - - - - - 0x035967 1A:9957: 4C C7 9A  JMP loc_9AC7_swap_positions
bra_995A:
C - - - - - 0x03596A 1A:995A: A9 37     LDA #con_B3CF_swap
C - - - - - 0x03596C 1A:995C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x03596F 1A:995F: A9 00     LDA #$00
C - - - - - 0x035971 1A:9961: 8D 22 06  STA ram_номер_опции
C - - - - - 0x035974 1A:9964: A9 07     LDA #$07
C - - - - - 0x035976 1A:9966: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - - 0x035979 1A:9969: B0 01     BCS bra_996C
C - - - - - 0x03597B 1A:996B: 60        RTS
bra_996C:
C - - - - - 0x03597C 1A:996C: 20 72 99  JSR sub_9972
C - - - - - 0x03597F 1A:996F: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой



sub_9972:
C - - - - - 0x035982 1A:9972: 20 09 C5  JSR sub_0x03CBA9_поинтеры_после_JSR
- D 0 - I - 0x035985 1A:9975: 79 99     .word ofs_048_9979_00_swap_players
- D 0 - I - 0x035987 1A:9977: C7 9A     .word ofs_048_9AC7_01_swap_positions



loc_9979_swap_players:
ofs_048_9979_00_swap_players:
C D 0 J - - 0x035989 1A:9979: AD 50 04  LDA ram_счетчик_замен
C - - - - - 0x03598C 1A:997C: C9 03     CMP #$03
C - - - - - 0x03598E 1A:997E: 90 12     BCC bra_9992_лимит_замен_еще_не_исчерпан
C - - - - - 0x035990 1A:9980: A9 38     LDA #con_B3CF_no_subs_left
C - - - - - 0x035992 1A:9982: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9985_loop:
C - - - - - 0x035995 1A:9985: A9 01     LDA #$01
C - - - - - 0x035997 1A:9987: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03599A 1A:998A: A9 C0     LDA #con_btns_AB
C - - - - - 0x03599C 1A:998C: 2D 1E 00  AND ram_btn_press
C - - - - - 0x03599F 1A:998F: F0 F4     BEQ bra_9985_loop
C - - - - - 0x0359A1 1A:9991: 60        RTS
bra_9992_лимит_замен_еще_не_исчерпан:
C - - - - - 0x0359A2 1A:9992: A9 00     LDA #$00
C - - - - - 0x0359A4 1A:9994: 8D 2D 06  STA ram_062D
C - - - - - 0x0359A7 1A:9997: A9 3A     LDA #con_B3CF__swap_sub_players
C - - - - - 0x0359A9 1A:9999: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x0359AC 1A:999C: A9 00     LDA #$00
bra_999E_loop:
C - - - - - 0x0359AE 1A:999E: 48        PHA
C - - - - - 0x0359AF 1A:999F: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359B2 1A:99A2: 90 09     BCC bra_99AD
C - - - - - 0x0359B4 1A:99A4: 68        PLA
C - - - - - 0x0359B5 1A:99A5: 48        PHA
C - - - - - 0x0359B6 1A:99A6: A0 2C     LDY #$2C
C - - - - - 0x0359B8 1A:99A8: A2 B2     LDX #$B2
C - - - - - 0x0359BA 1A:99AA: 20 41 9F  JSR sub_9F41_позиция_курсора_при_замене_основного_состава
bra_99AD:
C - - - - - 0x0359BD 1A:99AD: 68        PLA
C - - - - - 0x0359BE 1A:99AE: 18        CLC
C - - - - - 0x0359BF 1A:99AF: 69 01     ADC #$01
C - - - - - 0x0359C1 1A:99B1: C9 0A     CMP #$0A
C - - - - - 0x0359C3 1A:99B3: D0 E9     BNE bra_999E_loop
C - - - - - 0x0359C5 1A:99B5: A9 00     LDA #$00
bra_99B7_loop:
C - - - - - 0x0359C7 1A:99B7: 48        PHA
C - - - - - 0x0359C8 1A:99B8: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359CB 1A:99BB: 68        PLA
C - - - - - 0x0359CC 1A:99BC: 90 07     BCC bra_99C5
C - - - - - 0x0359CE 1A:99BE: 18        CLC
C - - - - - 0x0359CF 1A:99BF: 69 01     ADC #$01
C - - - - - 0x0359D1 1A:99C1: C9 0A     CMP #$0A
C - - - - - 0x0359D3 1A:99C3: D0 F2     BNE bra_99B7_loop
bra_99C5:
C - - - - - 0x0359D5 1A:99C5: 8D 25 06  STA ram_0625
C - - - - - 0x0359D8 1A:99C8: A0 2C     LDY #$2C
C - - - - - 0x0359DA 1A:99CA: 20 37 9F  JSR sub_9F37
bra_99CD_loop:
C - - - - - 0x0359DD 1A:99CD: A9 01     LDA #$01
C - - - - - 0x0359DF 1A:99CF: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0359E2 1A:99D2: AD 25 06  LDA ram_0625
C - - - - - 0x0359E5 1A:99D5: 20 90 9B  JSR sub_9B90_конвертер_Dpad_кнопки
C - - - - - 0x0359E8 1A:99D8: 90 24     BCC bra_99FE_Dpad_не_нажато
loc_99DA_loop:
C - - - - - 0x0359EA 1A:99DA: BD 0F 9F  LDA tbl_9F0F_изменение_позиции_курсора_запасных_игроков,X
C - - - - - 0x0359ED 1A:99DD: 48        PHA
C - - - - - 0x0359EE 1A:99DE: 20 AC 9A  JSR sub_9AAC
C - - - - - 0x0359F1 1A:99E1: 68        PLA
C - - - - - 0x0359F2 1A:99E2: 90 08     BCC bra_99EC
- - - - - - 0x0359F4 1A:99E4: A6 3A     LDX ram_003A_t42_индекс_таблицы
- - - - - - 0x0359F6 1A:99E6: 20 A4 9B  JSR sub_9BA4
- - - - - - 0x0359F9 1A:99E9: 4C DA 99  JMP loc_99DA_loop
bra_99EC:
C - - - - - 0x0359FC 1A:99EC: 48        PHA
C - - - - - 0x0359FD 1A:99ED: AD 25 06  LDA ram_0625
C - - - - - 0x035A00 1A:99F0: A0 2C     LDY #$2C
C - - - - - 0x035A02 1A:99F2: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035A05 1A:99F5: 68        PLA
C - - - - - 0x035A06 1A:99F6: 8D 25 06  STA ram_0625
C - - - - - 0x035A09 1A:99F9: A0 2C     LDY #$2C
C - - - - - 0x035A0B 1A:99FB: 20 37 9F  JSR sub_9F37
bra_99FE_Dpad_не_нажато:
C - - - - - 0x035A0E 1A:99FE: A9 80     LDA #con_btn_A
C - - - - - 0x035A10 1A:9A00: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A13 1A:9A03: D0 08     BNE bra_9A0D
C - - - - - 0x035A15 1A:9A05: A9 40     LDA #con_btn_B
C - - - - - 0x035A17 1A:9A07: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A1A 1A:9A0A: F0 C1     BEQ bra_99CD_loop
C - - - - - 0x035A1C 1A:9A0C: 60        RTS
bra_9A0D:
C - - - - - 0x035A1D 1A:9A0D: A9 3B     LDA #con_B3CF_whom_to_sub
C - - - - - 0x035A1F 1A:9A0F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035A22 1A:9A12: A9 01     LDA #$01
C - - - - - 0x035A24 1A:9A14: AE 25 06  LDX ram_0625
C - - - - - 0x035A27 1A:9A17: E0 08     CPX #$08
C - - - - - 0x035A29 1A:9A19: 90 02     BCC bra_9A1D
C - - - - - 0x035A2B 1A:9A1B: A9 00     LDA #$00
bra_9A1D:
C - - - - - 0x035A2D 1A:9A1D: 8D 26 06  STA ram_0626
C - - - - - 0x035A30 1A:9A20: A0 16     LDY #$16
C - - - - - 0x035A32 1A:9A22: 20 37 9F  JSR sub_9F37
bra_9A25_loop:
C - - - - - 0x035A35 1A:9A25: A9 01     LDA #$01
C - - - - - 0x035A37 1A:9A27: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035A3A 1A:9A2A: AD 26 06  LDA ram_0626
C - - - - - 0x035A3D 1A:9A2D: F0 1A     BEQ bra_9A49
C - - - - - 0x035A3F 1A:9A2F: 20 90 9B  JSR sub_9B90_конвертер_Dpad_кнопки
C - - - - - 0x035A42 1A:9A32: 90 15     BCC bra_9A49    ; Dpad не нажато
; if Dpad нажато
C - - - - - 0x035A44 1A:9A34: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035A47 1A:9A37: 48        PHA
C - - - - - 0x035A48 1A:9A38: AD 26 06  LDA ram_0626
C - - - - - 0x035A4B 1A:9A3B: A0 16     LDY #$16
C - - - - - 0x035A4D 1A:9A3D: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035A50 1A:9A40: 68        PLA
C - - - - - 0x035A51 1A:9A41: 8D 26 06  STA ram_0626
C - - - - - 0x035A54 1A:9A44: A0 16     LDY #$16
C - - - - - 0x035A56 1A:9A46: 20 37 9F  JSR sub_9F37
bra_9A49:
C - - - - - 0x035A59 1A:9A49: A9 40     LDA #con_btn_B
C - - - - - 0x035A5B 1A:9A4B: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A5E 1A:9A4E: F0 03     BEQ bra_9A53
C - - - - - 0x035A60 1A:9A50: 4C 79 99  JMP loc_9979_swap_players
bra_9A53:
C - - - - - 0x035A63 1A:9A53: A9 80     LDA #con_btn_A
C - - - - - 0x035A65 1A:9A55: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035A68 1A:9A58: F0 CB     BEQ bra_9A25_loop
C - - - - - 0x035A6A 1A:9A5A: AD 25 06  LDA ram_0625
C - - - - - 0x035A6D 1A:9A5D: 18        CLC
C - - - - - 0x035A6E 1A:9A5E: 69 16     ADC #$16
C - - - - - 0x035A70 1A:9A60: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035A73 1A:9A63: A5 34     LDA ram_plr_data
C - - - - - 0x035A75 1A:9A65: 85 3A     STA ram_003A_t07_plr_data
C - - - - - 0x035A77 1A:9A67: A5 35     LDA ram_plr_data + $01
C - - - - - 0x035A79 1A:9A69: 85 3B     STA ram_003A_t07_plr_data + $01
C - - - - - 0x035A7B 1A:9A6B: AD 26 06  LDA ram_0626
C - - - - - 0x035A7E 1A:9A6E: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035A81 1A:9A71: A0 00     LDY #$00
; con_plr_id
; con_plr_guts_lo
; con_plr_guts_hi
; con_plr_lvl
bra_9A73_копирование_между_адресами:
C - - - - - 0x035A83 1A:9A73: B1 3A     LDA (ram_003A_t07_plr_data),Y
C - - - - - 0x035A85 1A:9A75: AA        TAX
C - - - - - 0x035A86 1A:9A76: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x035A88 1A:9A78: 91 3A     STA (ram_003A_t07_plr_data),Y
C - - - - - 0x035A8A 1A:9A7A: 8A        TXA
C - - - - - 0x035A8B 1A:9A7B: 91 34     STA (ram_plr_data),Y
C - - - - - 0x035A8D 1A:9A7D: C8        INY
C - - - - - 0x035A8E 1A:9A7E: C0 04     CPY #$04
C - - - - - 0x035A90 1A:9A80: D0 F1     BNE bra_9A73_копирование_между_адресами
C - - - - - 0x035A92 1A:9A82: A0 00     LDY #$00
C - - - - - 0x035A94 1A:9A84: B1 3A     LDA (ram_003A_t07_plr_data),Y
C - - - - - 0x035A96 1A:9A86: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035A99 1A:9A89: 9D 51 04  STA ram_забаненный_игрок,X
C - - - - - 0x035A9C 1A:9A8C: E8        INX
C - - - - - 0x035A9D 1A:9A8D: 8E 50 04  STX ram_счетчик_замен
C - - - - - 0x035AA0 1A:9A90: A9 3B     LDA #con_B3CF_whom_to_sub
C - - - - - 0x035AA2 1A:9A92: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9A95_loop:
C - - - - - 0x035AA5 1A:9A95: A9 01     LDA #$01
C - - - - - 0x035AA7 1A:9A97: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035AAA 1A:9A9A: AD 1C 00  LDA ram_btn_hold
C - - - - - 0x035AAD 1A:9A9D: 29 C0     AND #con_btns_AB
C - - - - - 0x035AAF 1A:9A9F: F0 F4     BEQ bra_9A95_loop
C - - - - - 0x035AB1 1A:9AA1: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035AB4 1A:9AA4: E0 03     CPX #$03
C - - - - - 0x035AB6 1A:9AA6: B0 03     BCS bra_9AAB_RTS
C - - - - - 0x035AB8 1A:9AA8: 4C 79 99  JMP loc_9979_swap_players
bra_9AAB_RTS:
C - - - - - 0x035ABB 1A:9AAB: 60        RTS



sub_9AAC:
; out
    ; C
        ; 0 = 
        ; 1 = 
C - - - - - 0x035ABC 1A:9AAC: 18        CLC
C - - - - - 0x035ABD 1A:9AAD: 69 16     ADC #$16
C - - - - - 0x035ABF 1A:9AAF: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035AC2 1A:9AB2: A0 00     LDY #con_plr_id
C - - - - - 0x035AC4 1A:9AB4: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x035AC6 1A:9AB6: AE 50 04  LDX ram_счетчик_замен
C - - - - - 0x035AC9 1A:9AB9: F0 0A     BEQ bra_9AC5
bra_9ABB_loop:
C - - - - - 0x035ACB 1A:9ABB: DD 50 04  CMP ram_забаненный_игрок - $01,X
C - - - - - 0x035ACE 1A:9ABE: D0 02     BNE bra_9AC2
C - - - - - 0x035AD0 1A:9AC0: 38        SEC
C - - - - - 0x035AD1 1A:9AC1: 60        RTS
bra_9AC2:
C - - - - - 0x035AD2 1A:9AC2: CA        DEX
C - - - - - 0x035AD3 1A:9AC3: D0 F6     BNE bra_9ABB_loop
bra_9AC5:
C - - - - - 0x035AD5 1A:9AC5: 18        CLC
C - - - - - 0x035AD6 1A:9AC6: 60        RTS



loc_9AC7_swap_positions:
ofs_048_9AC7_01_swap_positions:
C D 0 - - - 0x035AD7 1A:9AC7: A9 00     LDA #$00
C - - - - - 0x035AD9 1A:9AC9: 8D 2D 06  STA ram_062D
C - - - - - 0x035ADC 1A:9ACC: A9 39     LDA #con_B3CF__swap_main_players
C - - - - - 0x035ADE 1A:9ACE: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035AE1 1A:9AD1: A9 01     LDA #$01
C - - - - - 0x035AE3 1A:9AD3: 8D 25 06  STA ram_0625
C - - - - - 0x035AE6 1A:9AD6: A0 16     LDY #$16
C - - - - - 0x035AE8 1A:9AD8: 20 37 9F  JSR sub_9F37
loc_9ADB:
bra_9ADB_B_не_нажата:
C D 0 - - - 0x035AEB 1A:9ADB: A9 01     LDA #$01
C - - - - - 0x035AED 1A:9ADD: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035AF0 1A:9AE0: AD 25 06  LDA ram_0625
C - - - - - 0x035AF3 1A:9AE3: 20 90 9B  JSR sub_9B90_конвертер_Dpad_кнопки
C - - - - - 0x035AF6 1A:9AE6: 90 15     BCC bra_9AFD_Dpad_не_нажато
; if Dpad нажато
C - - - - - 0x035AF8 1A:9AE8: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035AFB 1A:9AEB: 48        PHA
C - - - - - 0x035AFC 1A:9AEC: AD 25 06  LDA ram_0625
C - - - - - 0x035AFF 1A:9AEF: A0 16     LDY #$16
C - - - - - 0x035B01 1A:9AF1: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B04 1A:9AF4: 68        PLA
C - - - - - 0x035B05 1A:9AF5: 8D 25 06  STA ram_0625
C - - - - - 0x035B08 1A:9AF8: A0 16     LDY #$16
C - - - - - 0x035B0A 1A:9AFA: 20 37 9F  JSR sub_9F37
bra_9AFD_Dpad_не_нажато:
C - - - - - 0x035B0D 1A:9AFD: A9 80     LDA #con_btn_A
C - - - - - 0x035B0F 1A:9AFF: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B12 1A:9B02: D0 0B     BNE bra_9B0F_нажата_A
C - - - - - 0x035B14 1A:9B04: A9 40     LDA #con_btn_B
C - - - - - 0x035B16 1A:9B06: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B19 1A:9B09: F0 D0     BEQ bra_9ADB_B_не_нажата
                                        LDA ram_твоя_команда
                                        CMP #$02
                                        BEQ @пропустить_затирание     ; иначе потом повторно будет затирание
C - - - - - 0x035B1B 1A:9B0B: 20 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой
@пропустить_затирание:
C - - - - - 0x035B1E 1A:9B0E: 60        RTS
bra_9B0F_нажата_A:
C - - - - - 0x035B1F 1A:9B0F: A9 01     LDA #$01
C - - - - - 0x035B21 1A:9B11: CD 25 06  CMP ram_0625
C - - - - - 0x035B24 1A:9B14: D0 02     BNE bra_9B18
C - - - - - 0x035B26 1A:9B16: A9 02     LDA #$02
bra_9B18:
C - - - - - 0x035B28 1A:9B18: 8D 26 06  STA ram_0626
C - - - - - 0x035B2B 1A:9B1B: A0 16     LDY #$16
C - - - - - 0x035B2D 1A:9B1D: 20 37 9F  JSR sub_9F37
bra_9B20_loop:
C - - - - - 0x035B30 1A:9B20: A9 01     LDA #$01
C - - - - - 0x035B32 1A:9B22: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035B35 1A:9B25: AD 26 06  LDA ram_0626
C - - - - - 0x035B38 1A:9B28: 20 90 9B  JSR sub_9B90_конвертер_Dpad_кнопки
C - - - - - 0x035B3B 1A:9B2B: 90 22     BCC bra_9B4F_Dpad_не_нажато
; if Dpad нажато
C - - - - - 0x035B3D 1A:9B2D: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035B40 1A:9B30: CD 25 06  CMP ram_0625
C - - - - - 0x035B43 1A:9B33: D0 08     BNE bra_9B3D
C - - - - - 0x035B45 1A:9B35: A6 3A     LDX ram_003A_t42_индекс_таблицы
C - - - - - 0x035B47 1A:9B37: 20 A4 9B  JSR sub_9BA4
C - - - - - 0x035B4A 1A:9B3A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
bra_9B3D:
C - - - - - 0x035B4D 1A:9B3D: 48        PHA
C - - - - - 0x035B4E 1A:9B3E: AD 26 06  LDA ram_0626
C - - - - - 0x035B51 1A:9B41: A0 16     LDY #$16
C - - - - - 0x035B53 1A:9B43: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B56 1A:9B46: 68        PLA
C - - - - - 0x035B57 1A:9B47: 8D 26 06  STA ram_0626
C - - - - - 0x035B5A 1A:9B4A: A0 16     LDY #$16
C - - - - - 0x035B5C 1A:9B4C: 20 37 9F  JSR sub_9F37
bra_9B4F_Dpad_не_нажато:
C - - - - - 0x035B5F 1A:9B4F: A9 80     LDA #con_btn_A
C - - - - - 0x035B61 1A:9B51: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B64 1A:9B54: D0 12     BNE bra_9B68
C - - - - - 0x035B66 1A:9B56: A9 40     LDA #con_btn_B
C - - - - - 0x035B68 1A:9B58: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035B6B 1A:9B5B: F0 C3     BEQ bra_9B20_loop
C - - - - - 0x035B6D 1A:9B5D: AD 26 06  LDA ram_0626
C - - - - - 0x035B70 1A:9B60: A0 16     LDY #$16
C - - - - - 0x035B72 1A:9B62: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035B75 1A:9B65: 4C DB 9A  JMP loc_9ADB
bra_9B68:
C - - - - - 0x035B78 1A:9B68: AD 25 06  LDA ram_0625
C - - - - - 0x035B7B 1A:9B6B: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035B7E 1A:9B6E: A5 34     LDA ram_plr_data
C - - - - - 0x035B80 1A:9B70: 85 3A     STA ram_003A_t08_plr_data
C - - - - - 0x035B82 1A:9B72: A5 35     LDA ram_plr_data + $01
C - - - - - 0x035B84 1A:9B74: 85 3B     STA ram_003A_t08_plr_data + $01
C - - - - - 0x035B86 1A:9B76: AD 26 06  LDA ram_0626
C - - - - - 0x035B89 1A:9B79: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035B8C 1A:9B7C: A0 00     LDY #$00
; con_plr_id
; con_plr_guts_lo
; con_plr_guts_hi
; con_plr_lvl
bra_9B7E_копирование_между_адресами:
C - - - - - 0x035B8E 1A:9B7E: B1 3A     LDA (ram_003A_t08_plr_data),Y
C - - - - - 0x035B90 1A:9B80: AA        TAX
C - - - - - 0x035B91 1A:9B81: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x035B93 1A:9B83: 91 3A     STA (ram_003A_t08_plr_data),Y
C - - - - - 0x035B95 1A:9B85: 8A        TXA
C - - - - - 0x035B96 1A:9B86: 91 34     STA (ram_plr_data),Y
C - - - - - 0x035B98 1A:9B88: C8        INY
C - - - - - 0x035B99 1A:9B89: C0 04     CPY #$04
C - - - - - 0x035B9B 1A:9B8B: D0 F1     BNE bra_9B7E_копирование_между_адресами
C - - - - - 0x035B9D 1A:9B8D: 4C C7 9A  JMP loc_9AC7_swap_positions



sub_9B90_конвертер_Dpad_кнопки:
; in
    ; A = 
; out
    ; C
        ; 0 = Dpad не нажато
        ; 1 = Dpad нажато
    ; A = 
    ; X = сконвертированная кнопка
        ; 00 = con_btn_Right
        ; 01 = con_btn_Left
        ; 02 = con_btn_Down
        ; 03 = con_btn_Up
    ; ram_003A_t42_индекс_таблицы
C - - - - - 0x035BA0 1A:9B90: 48        PHA
C - - - - - 0x035BA1 1A:9B91: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035BA3 1A:9B93: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BA6 1A:9B96: D0 03     BNE bra_9B9B_кнопка_нажата
; if Dpad не нажато
C - - - - - 0x035BA8 1A:9B98: 68        PLA
C - - - - - 0x035BA9 1A:9B99: 18        CLC
C - - - - - 0x035BAA 1A:9B9A: 60        RTS
bra_9B9B_кнопка_нажата:
C - - - - - 0x035BAB 1A:9B9B: A2 00     LDX #$00
bra_9B9D_loop:
C - - - - - 0x035BAD 1A:9B9D: 4A        LSR
C - - - - - 0x035BAE 1A:9B9E: B0 03     BCS bra_9BA3_данная_кнопка_нанажа
C - - - - - 0x035BB0 1A:9BA0: E8        INX
C - - - - - 0x035BB1 1A:9BA1: D0 FA     BNE bra_9B9D_loop
bra_9BA3_данная_кнопка_нанажа:
C - - - - - 0x035BB3 1A:9BA3: 68        PLA
sub_9BA4:
; in
    ; X = 
C - - - - - 0x035BB4 1A:9BA4: 86 3A     STX ram_003A_t42_индекс_таблицы
; * 05
C - - - - - 0x035BB6 1A:9BA6: 0A        ASL
C - - - - - 0x035BB7 1A:9BA7: 0A        ASL
C - - - - - 0x035BB8 1A:9BA8: 65 3A     ADC ram_003A_t42_индекс_таблицы
C - - - - - 0x035BBA 1A:9BAA: AA        TAX
C - - - - - 0x035BBB 1A:9BAB: 38        SEC
C - - - - - 0x035BBC 1A:9BAC: 60        RTS



ofs_047_9BAD_03:
bra_9BAD_loop:
C - - J - - 0x035BBD 1A:9BAD: A9 00     LDA #$00
C - - - - - 0x035BBF 1A:9BAF: 8D 2D 06  STA ram_062D
C - - - - - 0x035BC2 1A:9BB2: A9 3C     LDA #con_B3CF_stamina_fielded_players
C - - - - - 0x035BC4 1A:9BB4: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BB7_loop:
C - - - - - 0x035BC7 1A:9BB7: A9 01     LDA #$01
C - - - - - 0x035BC9 1A:9BB9: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035BCC 1A:9BBC: A9 80     LDA #con_btn_A
C - - - - - 0x035BCE 1A:9BBE: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BD1 1A:9BC1: D0 09     BNE bra_9BCC
C - - - - - 0x035BD3 1A:9BC3: A9 40     LDA #con_btn_B
C - - - - - 0x035BD5 1A:9BC5: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BD8 1A:9BC8: D0 21     BNE bra_9BEB
C - - - - - 0x035BDA 1A:9BCA: F0 EB     BEQ bra_9BB7_loop    ; jmp
bra_9BCC:
C - - - - - 0x035BDC 1A:9BCC: AD 2A 00  LDA ram_твоя_команда
C - - - - - 0x035BDF 1A:9BCF: C9 02     CMP #$02
C - - - - - 0x035BE1 1A:9BD1: D0 18     BNE bra_9BEB
C - - - - - 0x035BE3 1A:9BD3: A9 3D     LDA #con_B3CF_stamina_substitutes_bench
C - - - - - 0x035BE5 1A:9BD5: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BD8_loop:
C - - - - - 0x035BE8 1A:9BD8: A9 01     LDA #$01
C - - - - - 0x035BEA 1A:9BDA: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035BED 1A:9BDD: A9 40     LDA #con_btn_B
C - - - - - 0x035BEF 1A:9BDF: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BF2 1A:9BE2: D0 C9     BNE bra_9BAD_loop
C - - - - - 0x035BF4 1A:9BE4: A9 80     LDA #con_btn_A
C - - - - - 0x035BF6 1A:9BE6: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035BF9 1A:9BE9: F0 ED     BEQ bra_9BD8_loop
bra_9BEB:
C - - - - - 0x035BFB 1A:9BEB: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой



sub_9BEE:
; предположительно связано с ограничением/фиксированной записью координат игрока
; в зависимости от его позиции или типа того
C - - - - - 0x035BFE 1A:9BEE: C9 FF     CMP #$FF
C - - - - - 0x035C00 1A:9BF0: F0 1C     BEQ bra_9C0E_RTS
; 00-FE
C - - - - - 0x035C02 1A:9BF2: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x035C05 1A:9BF5: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x035C08 1A:9BF8: F0 0A     BEQ bra_9C04_мяч_у_команды_слева
; if мяч у комады справа
C - - - - - 0x035C0A 1A:9BFA: 98        TYA
C - - - - - 0x035C0B 1A:9BFB: 49 FF     EOR #$FF
C - - - - - 0x035C0D 1A:9BFD: A8        TAY
C - - - - - 0x035C0E 1A:9BFE: 8A        TXA
C - - - - - 0x035C0F 1A:9BFF: 49 FF     EOR #$FF
C - - - - - 0x035C11 1A:9C01: AA        TAX
C - - - - - 0x035C12 1A:9C02: C8        INY
C - - - - - 0x035C13 1A:9C03: E8        INX
bra_9C04_мяч_у_команды_слева:
C - - - - - 0x035C14 1A:9C04: 98        TYA
C - - - - - 0x035C15 1A:9C05: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035C17 1A:9C07: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035C19 1A:9C09: 8A        TXA
C - - - - - 0x035C1A 1A:9C0A: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035C1C 1A:9C0C: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
bra_9C0E_RTS:
C - - - - - 0x035C1E 1A:9C0E: 60        RTS



sub_9C0F_перемещение_игроков:
C - - - - - 0x035C1F 1A:9C0F: AD FC 05  LDA ram_принимающий
C - - - - - 0x035C22 1A:9C12: 8D 26 06  STA ram_0626
C - - - - - 0x035C25 1A:9C15: 20 1F 9C  JSR sub_9C1F_перемещение_игроков
C - - - - - 0x035C28 1A:9C18: AD 26 06  LDA ram_0626
C - - - - - 0x035C2B 1A:9C1B: 8D FC 05  STA ram_принимающий
C - - - - - 0x035C2E 1A:9C1E: 60        RTS



sub_9C1F_перемещение_игроков:
C - - - - - 0x035C2F 1A:9C1F: A9 28     LDA #con_B3CF_rearrange_players_no_yes
C - - - - - 0x035C31 1A:9C21: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035C34 1A:9C24: A9 00     LDA #$00
C - - - - - 0x035C36 1A:9C26: 8D 24 06  STA ram_0624
C - - - - - 0x035C39 1A:9C29: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C2C_ожидание_нажатия_A:
C - - - - - 0x035C3C 1A:9C2C: A9 01     LDA #$01
C - - - - - 0x035C3E 1A:9C2E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035C41 1A:9C31: A9 0C     LDA #con_btns_UD
C - - - - - 0x035C43 1A:9C33: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C46 1A:9C36: F0 0B     BEQ bra_9C43_кнопки_не_нажаты
C - - - - - 0x035C48 1A:9C38: AD 24 06  LDA ram_0624
C - - - - - 0x035C4B 1A:9C3B: 49 40     EOR #$40
C - - - - - 0x035C4D 1A:9C3D: 8D 24 06  STA ram_0624
C - - - - - 0x035C50 1A:9C40: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C43_кнопки_не_нажаты:
C - - - - - 0x035C53 1A:9C43: A9 40     LDA #con_btn_B
C - - - - - 0x035C55 1A:9C45: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C58 1A:9C48: F0 02     BEQ bra_9C4C_B_не_нажата
C - - - - - 0x035C5A 1A:9C4A: 18        CLC
C - - - - - 0x035C5B 1A:9C4B: 60        RTS
bra_9C4C_B_не_нажата:
C - - - - - 0x035C5C 1A:9C4C: A9 80     LDA #con_btn_A
C - - - - - 0x035C5E 1A:9C4E: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C61 1A:9C51: F0 D9     BEQ bra_9C2C_ожидание_нажатия_A
C - - - - - 0x035C63 1A:9C53: 2C 24 06  BIT ram_0624
C - - - - - 0x035C66 1A:9C56: 70 02     BVS bra_9C5A
C - - - - - 0x035C68 1A:9C58: 38        SEC
C - - - - - 0x035C69 1A:9C59: 60        RTS
bra_9C5A:
C - - - - - 0x035C6A 1A:9C5A: A9 38     LDA #con_s_id_38
C - - - - - 0x035C6C 1A:9C5C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - - 0x035C6F 1A:9C5F: A9 29     LDA #con_B3CF_rearrange_select_done
C - - - - - 0x035C71 1A:9C61: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035C74 1A:9C64: A9 01     LDA #$01
C - - - - - 0x035C76 1A:9C66: 8D 25 06  STA ram_0625
C - - - - - 0x035C79 1A:9C69: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035C7C 1A:9C6C: AD FE 05  LDA ram_05FE
C - - - - - 0x035C7F 1A:9C6F: 8D 24 06  STA ram_0624
loc_9C72_loop:
bra_9C72_ожидание_нажатия_A:
C D 0 - - - 0x035C82 1A:9C72: A9 01     LDA #$01
C - - - - - 0x035C84 1A:9C74: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035C87 1A:9C77: A9 84     LDA #$84
C - - - - - 0x035C89 1A:9C79: 8D 2D 06  STA ram_062D
C - - - - - 0x035C8C 1A:9C7C: A9 0C     LDA #con_btns_UD
C - - - - - 0x035C8E 1A:9C7E: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035C91 1A:9C81: F0 0B     BEQ bra_9C8E
C - - - - - 0x035C93 1A:9C83: AD 25 06  LDA ram_0625
C - - - - - 0x035C96 1A:9C86: 49 40     EOR #$40
C - - - - - 0x035C98 1A:9C88: 8D 25 06  STA ram_0625
C - - - - - 0x035C9B 1A:9C8B: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C8E:
C - - - - - 0x035C9E 1A:9C8E: A9 80     LDA #con_btn_A
C - - - - - 0x035CA0 1A:9C90: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CA3 1A:9C93: F0 DD     BEQ bra_9C72_ожидание_нажатия_A
C - - - - - 0x035CA5 1A:9C95: 2C 25 06  BIT ram_0625
C - - - - - 0x035CA8 1A:9C98: 50 07     BVC bra_9CA1
C - - - - - 0x035CAA 1A:9C9A: A9 00     LDA #$00
C - - - - - 0x035CAC 1A:9C9C: 8D 2D 06  STA ram_062D
C - - - - - 0x035CAF 1A:9C9F: 38        SEC
C - - - - - 0x035CB0 1A:9CA0: 60        RTS
bra_9CA1:
C - - - - - 0x035CB1 1A:9CA1: A9 81     LDA #$81
C - - - - - 0x035CB3 1A:9CA3: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035CB6 1A:9CA6: A9 81     LDA #$81
C - - - - - 0x035CB8 1A:9CA8: 8D 2D 06  STA ram_062D
C - - - - - 0x035CBB 1A:9CAB: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
loc_9CAE_loop:
bra_9CAE_loop:
C D 0 - - - 0x035CBE 1A:9CAE: A9 01     LDA #$01
C - - - - - 0x035CC0 1A:9CB0: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035CC3 1A:9CB3: 20 9B 9D  JSR sub_9D9B
C - - - - - 0x035CC6 1A:9CB6: CD 24 06  CMP ram_0624
C - - - - - 0x035CC9 1A:9CB9: 8D 24 06  STA ram_0624
C - - - - - 0x035CCC 1A:9CBC: F0 03     BEQ bra_9CC1
C - - - - - 0x035CCE 1A:9CBE: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
bra_9CC1:
C - - - - - 0x035CD1 1A:9CC1: A9 40     LDA #con_btn_B
C - - - - - 0x035CD3 1A:9CC3: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CD6 1A:9CC6: F0 09     BEQ bra_9CD1_B_не_нажата
C - - - - - 0x035CD8 1A:9CC8: AD 25 06  LDA ram_0625
C - - - - - 0x035CDB 1A:9CCB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035CDE 1A:9CCE: 4C 72 9C  JMP loc_9C72_loop
bra_9CD1_B_не_нажата:
C - - - - - 0x035CE1 1A:9CD1: A9 80     LDA #con_btn_A
C - - - - - 0x035CE3 1A:9CD3: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035CE6 1A:9CD6: F0 D6     BEQ bra_9CAE_loop
C - - - - - 0x035CE8 1A:9CD8: AD FC 05  LDA ram_принимающий
C - - - - - 0x035CEB 1A:9CDB: C9 FF     CMP #$FF
C - - - - - 0x035CED 1A:9CDD: F0 CF     BEQ bra_9CAE_loop
C - - - - - 0x035CEF 1A:9CDF: AD 24 06  LDA ram_0624
C - - - - - 0x035CF2 1A:9CE2: 8D 16 06  STA ram_индекс_защитника
bra_9CE5_ожидание_нажатия_A:
C - - - - - 0x035CF5 1A:9CE5: A9 01     LDA #$01
C - - - - - 0x035CF7 1A:9CE7: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035CFA 1A:9CEA: 20 9B 9D  JSR sub_9D9B
C - - - - - 0x035CFD 1A:9CED: CD 24 06  CMP ram_0624
C - - - - - 0x035D00 1A:9CF0: 8D 24 06  STA ram_0624
C - - - - - 0x035D03 1A:9CF3: F0 03     BEQ bra_9CF8
C - - - - - 0x035D05 1A:9CF5: 20 BD 9D  JSR sub_9DBD
bra_9CF8:
C - - - - - 0x035D08 1A:9CF8: A9 40     LDA #con_btn_B
C - - - - - 0x035D0A 1A:9CFA: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035D0D 1A:9CFD: F0 0C     BEQ bra_9D0B_B_не_нажата
C - - - - - 0x035D0F 1A:9CFF: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x035D12 1A:9D02: 8D 24 06  STA ram_0624
C - - - - - 0x035D15 1A:9D05: 20 BD 9D  JSR sub_9DBD
C - - - - - 0x035D18 1A:9D08: 4C AE 9C  JMP loc_9CAE_loop
bra_9D0B_B_не_нажата:
C - - - - - 0x035D1B 1A:9D0B: A9 80     LDA #con_btn_A
C - - - - - 0x035D1D 1A:9D0D: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035D20 1A:9D10: F0 D3     BEQ bra_9CE5_ожидание_нажатия_A
C - - - - - 0x035D22 1A:9D12: AD 25 06  LDA ram_0625
C - - - - - 0x035D25 1A:9D15: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - - 0x035D28 1A:9D18: 4C 72 9C  JMP loc_9C72_loop



sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча:
C - - - - - 0x035D2B 1A:9D1B: 48        PHA
bra_9D1C_ожидание_освобождения_буфера:
C - - - - - 0x035D2C 1A:9D1C: A9 01     LDA #$01
C - - - - - 0x035D2E 1A:9D1E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035D31 1A:9D21: AD 15 05  LDA ram_0515_buffer_flag
C - - - - - 0x035D34 1A:9D24: D0 F6     BNE bra_9D1C_ожидание_освобождения_буфера
C - - - - - 0x035D36 1A:9D26: A9 01     LDA #$01
C - - - - - 0x035D38 1A:9D28: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x035D3B 1A:9D2B: 68        PLA
C - - - - - 0x035D3C 1A:9D2C: 8D A5 04  STA ram_04A5
C - - - - - 0x035D3F 1A:9D2F: 29 0F     AND #$0F
; * 04
C - - - - - 0x035D41 1A:9D31: 0A        ASL
C - - - - - 0x035D42 1A:9D32: 0A        ASL
C - - - - - 0x035D43 1A:9D33: AA        TAX
C - - - - - 0x035D44 1A:9D34: BD 82 9D  LDA tbl_9D82_адрес_ppu_курсора,X
C - - - - - 0x035D47 1A:9D37: 8D A6 04  STA ram_04A6
C - - - - - 0x035D4A 1A:9D3A: BD 83 9D  LDA tbl_9D82_адрес_ppu_курсора + $01,X
C - - - - - 0x035D4D 1A:9D3D: 8D A7 04  STA ram_04A7
C - - - - - 0x035D50 1A:9D40: BD 84 9D  LDA tbl_9D82_адрес_ppu_курсора + $02,X
C - - - - - 0x035D53 1A:9D43: 8D AA 04  STA ram_04AA
C - - - - - 0x035D56 1A:9D46: BD 85 9D  LDA tbl_9D82_адрес_ppu_курсора + $03,X
C - - - - - 0x035D59 1A:9D49: 8D AB 04  STA ram_04AB
C - - - - - 0x035D5C 1A:9D4C: AD A5 04  LDA ram_04A5
C - - - - - 0x035D5F 1A:9D4F: 29 0F     AND #$0F
C - - - - - 0x035D61 1A:9D51: AA        TAX
C - - - - - 0x035D62 1A:9D52: A9 00     LDA #$00
C - - - - - 0x035D64 1A:9D54: 2C A5 04  BIT ram_04A5
C - - - - - 0x035D67 1A:9D57: 30 05     BMI bra_9D5E
C - - - - - 0x035D69 1A:9D59: 70 03     BVS bra_9D5E
C - - - - - 0x035D6B 1A:9D5B: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D5E:
C - - - - - 0x035D6E 1A:9D5E: 8D A8 04  STA ram_04A8
C - - - - - 0x035D71 1A:9D61: A9 00     LDA #$00
C - - - - - 0x035D73 1A:9D63: 2C A5 04  BIT ram_04A5
C - - - - - 0x035D76 1A:9D66: 30 05     BMI bra_9D6D
C - - - - - 0x035D78 1A:9D68: 50 03     BVC bra_9D6D
C - - - - - 0x035D7A 1A:9D6A: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D6D:
C - - - - - 0x035D7D 1A:9D6D: 8D AC 04  STA ram_04AC
C - - - - - 0x035D80 1A:9D70: A2 01     LDX #$01
C - - - - - 0x035D82 1A:9D72: 8E A5 04  STX ram_04A5
C - - - - - 0x035D85 1A:9D75: 8E A9 04  STX ram_04A9
C - - - - - 0x035D88 1A:9D78: CA        DEX ; 00
C - - - - - 0x035D89 1A:9D79: 8E AD 04  STX ram_04AD
C - - - - - 0x035D8C 1A:9D7C: A9 80     LDA #$80
C - - - - - 0x035D8E 1A:9D7E: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x035D91 1A:9D81: 60        RTS



tbl_9D82_адрес_ppu_курсора:
    .word $22ED, $232D      ; rearrange players no/yes
    .word $2288, $22C8      ; rearrange select/done
    .word $2288, $22C8      ; aim left/right
    .word $228A, $22CA      ; wall left/right
    .word $2289, $22C9      ; resume/edit team data



tbl_9D96_тайл_курсора:
    .byte $F6   ; 
    .byte $F6   ; 
    .byte $F6   ; 
    .byte $F6   ; 
    .byte $B1   ; 



sub_9D9B:
C - - - - - 0x035DAB 1A:9D9B: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035DAD 1A:9D9D: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035DB0 1A:9DA0: F0 13     BEQ bra_9DB5
C - - - - - 0x035DB2 1A:9DA2: A2 00     LDX #$00
bra_9DA4_loop:
C - - - - - 0x035DB4 1A:9DA4: 4A        LSR
C - - - - - 0x035DB5 1A:9DA5: B0 03     BCS bra_9DAA
C - - - - - 0x035DB7 1A:9DA7: E8        INX
C - - - - - 0x035DB8 1A:9DA8: D0 FA     BNE bra_9DA4_loop    ; jmp
bra_9DAA:
C - - - - - 0x035DBA 1A:9DAA: BD B9 9D  LDA tbl_9DB9,X
C - - - - - 0x035DBD 1A:9DAD: 18        CLC
C - - - - - 0x035DBE 1A:9DAE: 6D 24 06  ADC ram_0624
C - - - - - 0x035DC1 1A:9DB1: C9 F0     CMP #$F0
C - - - - - 0x035DC3 1A:9DB3: 90 03     BCC bra_9DB8_RTS
bra_9DB5:
C - - - - - 0x035DC5 1A:9DB5: AD 24 06  LDA ram_0624
bra_9DB8_RTS:
C - - - - - 0x035DC8 1A:9DB8: 60        RTS



tbl_9DB9:
- D 0 - - - 0x035DC9 1A:9DB9: 0C        .byte $0C   ; right
- D 0 - - - 0x035DCA 1A:9DBA: F4        .byte $F4   ; left
- D 0 - - - 0x035DCB 1A:9DBB: 01        .byte $01   ; down
- D 0 - - - 0x035DCC 1A:9DBC: FF        .byte $FF   ; up



sub_9DBD:
C - - - - - 0x035DCD 1A:9DBD: AD FC 05  LDA ram_принимающий
C - - - - - 0x035DD0 1A:9DC0: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035DD3 1A:9DC3: AD 24 06  LDA ram_0624
C - - - - - 0x035DD6 1A:9DC6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x035DD9 1A:9DC9: 98        TYA
C - - - - - 0x035DDA 1A:9DCA: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035DDC 1A:9DCC: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035DDE 1A:9DCE: 8A        TXA
C - - - - - 0x035DDF 1A:9DCF: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035DE1 1A:9DD1: 91 34     STA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035DE3 1A:9DD3: 60        RTS



sub_9DD4_отобразить_или_затереть_статы_принимающего:
C - - - - - 0x035DE4 1A:9DD4: A9 01     LDA #$01      ; не начинать поиск с кипера
C - - - - - 0x035DE6 1A:9DD6: 85 3A     STA ram_003A_t43_порядковый_номер_игрока
bra_9DD8_loop:
C - - - - - 0x035DE8 1A:9DD8: A5 3A     LDA ram_003A_t43_порядковый_номер_игрока
C - - - - - 0x035DEA 1A:9DDA: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x035DED 1A:9DDD: F0 15     BEQ bra_9DF4_игнорировать_игрока_с_мячом_при_поиске
C - - - - - 0x035DEF 1A:9DDF: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035DF2 1A:9DE2: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x035DF4 1A:9DE4: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_X_hi
C - - - - - 0x035DF6 1A:9DE6: AA        TAX
C - - - - - 0x035DF7 1A:9DE7: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x035DF9 1A:9DE9: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x035DFB 1A:9DEB: A8        TAY
C - - - - - 0x035DFC 1A:9DEC: 20 39 C5  JSR sub_0x03CDF2
C - - - - - 0x035DFF 1A:9DEF: CD 24 06  CMP ram_0624
C - - - - - 0x035E02 1A:9DF2: F0 0E     BEQ bra_9E02_игрок_найден
bra_9DF4_игнорировать_игрока_с_мячом_при_поиске:
C - - - - - 0x035E04 1A:9DF4: E6 3A     INC ram_003A_t43_порядковый_номер_игрока
C - - - - - 0x035E06 1A:9DF6: A5 3A     LDA ram_003A_t43_порядковый_номер_игрока
C - - - - - 0x035E08 1A:9DF8: C9 0B     CMP #$0B
C - - - - - 0x035E0A 1A:9DFA: D0 DC     BNE bra_9DD8_loop
C - - - - - 0x035E0C 1A:9DFC: A2 FF     LDX #$FF
C - - - - - 0x035E0E 1A:9DFE: A9 1C     LDA #con_B3CF_clear_receiver_stats_window
C - - - - - 0x035E10 1A:9E00: D0 04     BNE bra_9E06_очистить_экран_справа    ; jmp
bra_9E02_игрок_найден:
C - - - - - 0x035E12 1A:9E02: A9 1D     LDA #con_B3CF_receiver_dribble_pass_shoot
C - - - - - 0x035E14 1A:9E04: A6 3A     LDX ram_003A_t43_порядковый_номер_игрока
bra_9E06_очистить_экран_справа:
C - - - - - 0x035E16 1A:9E06: 8E FC 05  STX ram_принимающий
C - - - - - 0x035E19 1A:9E09: 20 2A C5  JMP loc_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035E1C 1A:9E0C: 60        RTS



sub_9E0D:
; in
    ; A = 
; предположительно связано с ограничением/фиксированной записью координат игрока
; в зависимости от его позиции или типа того
C - - - - - 0x035E1D 1A:9E0D: 85 3A     STA ram_003A_t44
C - - - - - 0x035E1F 1A:9E0F: 0A        ASL
C - - - - - 0x035E20 1A:9E10: AA        TAX
C - - - - - 0x035E21 1A:9E11: BD F0 9F  LDA tbl_9FF0,X
C - - - - - 0x035E24 1A:9E14: 85 3C     STA ram_003C_t04_data
C - - - - - 0x035E26 1A:9E16: BD F1 9F  LDA tbl_9FF0 + $01,X
C - - - - - 0x035E29 1A:9E19: 85 3D     STA ram_003C_t04_data + $01
C - - - - - 0x035E2B 1A:9E1B: A9 00     LDA #$00
C - - - - - 0x035E2D 1A:9E1D: 85 3B     STA ram_003B_t21_порядковый_номер_игрока
bra_9E1F_loop:
C - - - - - 0x035E2F 1A:9E1F: A5 3B     LDA ram_003B_t21_порядковый_номер_игрока
C - - - - - 0x035E31 1A:9E21: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x035E34 1A:9E24: A6 3B     LDX ram_003B_t21_порядковый_номер_игрока
C - - - - - 0x035E36 1A:9E26: EC 41 04  CPX ram_игрок_с_мячом
C - - - - - 0x035E39 1A:9E29: F0 1B     BEQ bra_9E46_этот_игрок_с_мячом
C - - - - - 0x035E3B 1A:9E2B: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x035E3E 1A:9E2E: E0 0B     CPX #$0B
C - - - - - 0x035E40 1A:9E30: 90 08     BCC bra_9E3A_команда_слева
; if команда справа
C - - - - - 0x035E42 1A:9E32: 8A        TXA
C - - - - - 0x035E43 1A:9E33: E9 0B     SBC #$0B
C - - - - - 0x035E45 1A:9E35: AA        TAX
C - - - - - 0x035E46 1A:9E36: 98        TYA
C - - - - - 0x035E47 1A:9E37: 49 0B     EOR #$0B
C - - - - - 0x035E49 1A:9E39: A8        TAY
bra_9E3A_команда_слева:
C - - - - - 0x035E4A 1A:9E3A: 86 3E     STX ram_003E_t12
C - - - - - 0x035E4C 1A:9E3C: 98        TYA
C - - - - - 0x035E4D 1A:9E3D: 18        CLC
C - - - - - 0x035E4E 1A:9E3E: 65 3E     ADC ram_003E_t12
C - - - - - 0x035E50 1A:9E40: A8        TAY
C - - - - - 0x035E51 1A:9E41: B1 3C     LDA (ram_003C_t04_data),Y
C - - - - - 0x035E53 1A:9E43: 4C 4B 9E  JMP loc_9E4B
bra_9E46_этот_игрок_с_мячом:
C - - - - - 0x035E56 1A:9E46: A6 3A     LDX ram_003A_t44
C - - - - - 0x035E58 1A:9E48: BD F8 A0  LDA tbl_A0F8_для_игрока_с_мячом,X
loc_9E4B:
C D 0 - - - 0x035E5B 1A:9E4B: 20 EE 9B  JSR sub_9BEE
C - - - - - 0x035E5E 1A:9E4E: E6 3B     INC ram_003B_t21_порядковый_номер_игрока
C - - - - - 0x035E60 1A:9E50: A5 3B     LDA ram_003B_t21_порядковый_номер_игрока
C - - - - - 0x035E62 1A:9E52: C9 16     CMP #$16
C - - - - - 0x035E64 1A:9E54: D0 C9     BNE bra_9E1F_loop
C - - - - - 0x035E66 1A:9E56: 20 45 C6  JMP loc_0x03E6FC
C - - - - - 0x035E69 1A:9E59: 60        RTS



sub_9E5A_отрисовка_меню_во_время_матча:
C - - - - - 0x035E6A 1A:9E5A: 48        PHA
C - - - - - 0x035E6B 1A:9E5B: A9 01     LDA #$01
C - - - - - 0x035E6D 1A:9E5D: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035E70 1A:9E60: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x035E73 1A:9E63: 68        PLA
C - - - - - 0x035E74 1A:9E64: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x035E77 1A:9E67: F0 06     BEQ bra_9E6F_команда_слева
; if мяч у команды справа
C - - - - - 0x035E79 1A:9E69: A9 14     LDA #$14      ; у компа всегда пробивает 10й номер
C - - - - - 0x035E7B 1A:9E6B: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035E7E 1A:9E6E: 60        RTS
bra_9E6F_команда_слева:
C - - - - - 0x035E7F 1A:9E6F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - - 0x035E82 1A:9E72: A9 01     LDA #$01
C - - - - - 0x035E84 1A:9E74: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035E87 1A:9E77: A0 00     LDY #$00
C - - - - - 0x035E89 1A:9E79: 20 3B 9F  JSR sub_9F3B
bra_9E7C_loop:
C - - - - - 0x035E8C 1A:9E7C: A9 01     LDA #$01
C - - - - - 0x035E8E 1A:9E7E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035E91 1A:9E81: A9 0F     LDA #con_btns_Dpad
C - - - - - 0x035E93 1A:9E83: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035E96 1A:9E86: F0 27     BEQ bra_9EAF
C - - - - - 0x035E98 1A:9E88: A2 00     LDX #$00
bra_9E8A_loop:
C - - - - - 0x035E9A 1A:9E8A: 4A        LSR
C - - - - - 0x035E9B 1A:9E8B: B0 03     BCS bra_9E90
C - - - - - 0x035E9D 1A:9E8D: E8        INX
C - - - - - 0x035E9E 1A:9E8E: D0 FA     BNE bra_9E8A_loop
bra_9E90:
C - - - - - 0x035EA0 1A:9E90: 86 3A     STX ram_003A_t45
C - - - - - 0x035EA2 1A:9E92: AD 41 04  LDA ram_игрок_с_мячом
; * 04
C - - - - - 0x035EA5 1A:9E95: 0A        ASL
C - - - - - 0x035EA6 1A:9E96: 0A        ASL
C - - - - - 0x035EA7 1A:9E97: 65 3A     ADC ram_003A_t45
C - - - - - 0x035EA9 1A:9E99: AA        TAX
C - - - - - 0x035EAA 1A:9E9A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - - 0x035EAD 1A:9E9D: 48        PHA
C - - - - - 0x035EAE 1A:9E9E: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x035EB1 1A:9EA1: A0 00     LDY #$00
C - - - - - 0x035EB3 1A:9EA3: 20 3F 9F  JSR sub_9F3F
C - - - - - 0x035EB6 1A:9EA6: 68        PLA
C - - - - - 0x035EB7 1A:9EA7: 8D 41 04  STA ram_игрок_с_мячом
C - - - - - 0x035EBA 1A:9EAA: A0 00     LDY #$00
C - - - - - 0x035EBC 1A:9EAC: 20 3B 9F  JSR sub_9F3B
bra_9EAF:
C - - - - - 0x035EBF 1A:9EAF: A9 80     LDA #con_btn_A
C - - - - - 0x035EC1 1A:9EB1: 2D 1E 00  AND ram_btn_press
C - - - - - 0x035EC4 1A:9EB4: F0 C6     BEQ bra_9E7C_loop
C - - - - - 0x035EC6 1A:9EB6: 60        RTS



tbl_9EB7_изменение_позиции_курсора_основных_игроков:
; также используется для выбора игрока на пенальти
    ; GK (unused)
    .byte $FF   ; right
    .byte $FF   ; left
    .byte $FF   ; down
    .byte $FF   ; up
    ; 2
    .byte $06   ; right
    .byte $06   ; left
    .byte $02   ; down
    .byte $05   ; up
    ; 3
    .byte $07   ; right
    .byte $07   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $05   ; down
    .byte $03   ; up
    ; 6
    .byte $0A   ; right
    .byte $0A   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 7
    .byte $01   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $0A   ; up
    ; 8
    .byte $02   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; 9
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; 10
    .byte $04   ; right
    .byte $04   ; left
    .byte $0A   ; down
    .byte $08   ; up
    ; 11
    .byte $05   ; right
    .byte $05   ; left
    .byte $06   ; down
    .byte $09   ; up



tbl_9F0F_изменение_позиции_курсора_запасных_игроков:
    ; 1
    .byte $05   ; right
    .byte $08   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 2
    .byte $06   ; right
    .byte $08   ; left
    .byte $02   ; down
    .byte $00   ; up
    ; 3
    .byte $07   ; right
    .byte $08   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $00   ; down
    .byte $03   ; up
    ; 6
    .byte $08   ; right
    .byte $00   ; left
    .byte $06   ; down
    .byte $09   ; up
    ; 7
    .byte $08   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $05   ; up
    ; 8
    .byte $09   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; GK1
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; GK2
    .byte $04   ; right
    .byte $04   ; left
    .byte $05   ; down
    .byte $08   ; up



sub_9F37:
C - - - - - 0x035F47 1A:9F37: A2 B1     LDX #$B1
C - - - - - 0x035F49 1A:9F39: D0 06     BNE bra_9F41    ; jmp



sub_9F3B:
C - - - - - 0x035F4B 1A:9F3B: A2 F6     LDX #$F6
C - - - - - 0x035F4D 1A:9F3D: D0 02     BNE bra_9F41    ; jmp



sub_9F3F:
C - - - - - 0x035F4F 1A:9F3F: A2 00     LDX #$00
bra_9F41:
sub_9F41_позиция_курсора_при_замене_основного_состава:
C - - - - - 0x035F51 1A:9F41: 48        PHA
bra_9F42_ожидание_освобождения_буфера:
C - - - - - 0x035F52 1A:9F42: A9 01     LDA #$01
C - - - - - 0x035F54 1A:9F44: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x035F57 1A:9F47: AD 15 05  LDA ram_0515_buffer_flag
C - - - - - 0x035F5A 1A:9F4A: D0 F6     BNE bra_9F42_ожидание_освобождения_буфера
C - - - - - 0x035F5C 1A:9F4C: A9 01     LDA #$01
C - - - - - 0x035F5E 1A:9F4E: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x035F61 1A:9F51: 8E A8 04  STX ram_04A8
C - - - - - 0x035F64 1A:9F54: 8C A5 04  STY ram_04A5
C - - - - - 0x035F67 1A:9F57: 68        PLA
C - - - - - 0x035F68 1A:9F58: 0A        ASL
C - - - - - 0x035F69 1A:9F59: 6D A5 04  ADC ram_04A5
C - - - - - 0x035F6C 1A:9F5C: AA        TAX
C - - - - - 0x035F6D 1A:9F5D: A9 01     LDA #$01
C - - - - - 0x035F6F 1A:9F5F: 8D A5 04  STA ram_04A5
C - - - - - 0x035F72 1A:9F62: BD 79 9F  LDA tbl_9F79_позиция_ppu_курсора,X
C - - - - - 0x035F75 1A:9F65: 8D A6 04  STA ram_04A6
C - - - - - 0x035F78 1A:9F68: BD 7A 9F  LDA tbl_9F79_позиция_ppu_курсора + $01,X
C - - - - - 0x035F7B 1A:9F6B: 8D A7 04  STA ram_04A7
C - - - - - 0x035F7E 1A:9F6E: A9 00     LDA #$00
C - - - - - 0x035F80 1A:9F70: 8D A9 04  STA ram_04A9
C - - - - - 0x035F83 1A:9F73: A9 80     LDA #$80
C - - - - - 0x035F85 1A:9F75: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x035F88 1A:9F78: 60        RTS



tbl_9F79_позиция_ppu_курсора:
; выбор пробивающего нарушение
    .word $0000     ; unused
    .word $226A     ; 2
    .word $22AA     ; 3
    .word $22EA     ; 4
    .word $232A     ; 5
    .word $236A     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена между основными игроками
    .word $238D ; 
    .word $2264     ; 2
    .word $22A4     ; 3
    .word $22E4     ; 4
    .word $2324     ; 5
    .word $2364     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена запасных игроков
    .word $2262     ; 1
    .word $22A2     ; 2
    .word $22E2     ; 3
    .word $2322     ; 4
    .word $2362     ; 5
    .word $226C     ; 6
    .word $22AC     ; 7
    .word $22EC     ; 8
    .word $2334     ; GK1
    .word $2374     ; GK2



tbl_9FB9:
- D 0 - - - 0x035FC9 1A:9FB9: C3 9F     .word off_9FC3_00
- D 0 - - - 0x035FCB 1A:9FBB: CD 9F     .word off_9FCD_01
- D 0 - - - 0x035FCD 1A:9FBD: D5 9F     .word off_9FD5_02
- D 0 - - - 0x035FCF 1A:9FBF: DE 9F     .word off_9FDE_03
- D 0 - - - 0x035FD1 1A:9FC1: E6 9F     .word off_9FE6_04



off_9FC3_00:
- D 0 - I - 0x035FD3 1A:9FC3: B4        .byte $B4   ; <ガ>
- D 0 - I - 0x035FD4 1A:9FC4: C0        .byte $C0   ; <ヅ>
- D 0 - I - 0x035FD5 1A:9FC5: C1        .byte $C1   ; <デ>
- D 0 - I - 0x035FD6 1A:9FC6: CC        .byte $CC   ; <ぽ>
- D 0 - I - 0x035FD7 1A:9FC7: CD        .byte $CD   ; <パ>
- D 0 - I - 0x035FD8 1A:9FC8: D8        .byte $D8   ; 
- D 0 - I - 0x035FD9 1A:9FC9: D9        .byte $D9   ; 
- D 0 - I - 0x035FDA 1A:9FCA: E4        .byte $E4   ; 
- D 0 - I - 0x035FDB 1A:9FCB: E5        .byte $E5   ; 
- D 0 - I - 0x035FDC 1A:9FCC: FF        .byte $FF   ; end token

off_9FCD_01:
- D 0 - I - 0x035FDD 1A:9FCD: A8        .byte $A8   ; <ぜ>
- D 0 - I - 0x035FDE 1A:9FCE: A9        .byte $A9   ; <ぞ>
- D 0 - I - 0x035FDF 1A:9FCF: AA        .byte $AA   ; <だ>
- D 0 - I - 0x035FE0 1A:9FD0: AB        .byte $AB   ; <ぢ>
- D 0 - I - 0x035FE1 1A:9FD1: B5        .byte $B5   ; <ギ>
- D 0 - I - 0x035FE2 1A:9FD2: B6        .byte $B6   ; <グ>
- D 0 - I - 0x035FE3 1A:9FD3: B7        .byte $B7   ; <ゲ>
- D 0 - I - 0x035FE4 1A:9FD4: FF        .byte $FF   ; end token

off_9FD5_02:
- D 0 - I - 0x035FE5 1A:9FD5: AC        .byte $AC   ; <づ>
- D 0 - I - 0x035FE6 1A:9FD6: AD        .byte $AD   ; <で>
- D 0 - I - 0x035FE7 1A:9FD7: AE        .byte $AE   ; <ど>
- D 0 - I - 0x035FE8 1A:9FD8: AF        .byte $AF   ; <ば>
- D 0 - I - 0x035FE9 1A:9FD9: B8        .byte $B8   ; <ゴ>
- D 0 - I - 0x035FEA 1A:9FDA: B9        .byte $B9   ; <ザ>
- D 0 - I - 0x035FEB 1A:9FDB: BA        .byte $BA   ; <ジ>
- D 0 - I - 0x035FEC 1A:9FDC: BB        .byte $BB   ; <ズ>
- D 0 - I - 0x035FED 1A:9FDD: FF        .byte $FF   ; end token

off_9FDE_03:
- D 0 - I - 0x035FEE 1A:9FDE: B0        .byte $B0   ; <び>
- D 0 - I - 0x035FEF 1A:9FDF: B1        .byte $B1   ; <ぶ>
- D 0 - I - 0x035FF0 1A:9FE0: B2        .byte $B2   ; <べ>
- D 0 - I - 0x035FF1 1A:9FE1: B3        .byte $B3   ; <ぼ>
- D 0 - I - 0x035FF2 1A:9FE2: BC        .byte $BC   ; <ゼ>
- D 0 - I - 0x035FF3 1A:9FE3: BD        .byte $BD   ; <ゾ>
- D 0 - I - 0x035FF4 1A:9FE4: BE        .byte $BE   ; <ダ>
- D 0 - I - 0x035FF5 1A:9FE5: FF        .byte $FF   ; end token

off_9FE6_04:
- D 0 - I - 0x035FF6 1A:9FE6: BF        .byte $BF   ; <ヂ>
- D 0 - I - 0x035FF7 1A:9FE7: CA        .byte $CA   ; <ぷ>
- D 0 - I - 0x035FF8 1A:9FE8: CB        .byte $CB   ; <ぺ>
- D 0 - I - 0x035FF9 1A:9FE9: D6        .byte $D6   ; 
- D 0 - I - 0x035FFA 1A:9FEA: D7        .byte $D7   ; 
- D 0 - I - 0x035FFB 1A:9FEB: E2        .byte $E2   ; 
- D 0 - I - 0x035FFC 1A:9FEC: E3        .byte $E3   ; 
- D 0 - I - 0x035FFD 1A:9FED: EE        .byte $EE   ; 
- D 0 - I - 0x035FFE 1A:9FEE: EF        .byte $EF   ; 
- D 0 - I - 0x035FFF 1A:9FEF: FF        .byte $FF   ; end token



tbl_9FF0:
- - - - - - 0x036000 1A:9FF0: 06 A0     .word off_A006_00
- - - - - - 0x036002 1A:9FF2: 1C A0     .word off_A01C_01
- D 0 - - - 0x036004 1A:9FF4: 32 A0     .word off_A032_02
- D 0 - - - 0x036006 1A:9FF6: 48 A0     .word off_A048_03
- D 0 - - - 0x036008 1A:9FF8: 5E A0     .word off_A05E_04
- D 0 - - - 0x03600A 1A:9FFA: 74 A0     .word off_A074_05
- D 0 - - - 0x03600C 1A:9FFC: 8A A0     .word off_A08A_06
- D 0 - - - 0x03600E 1A:9FFE: A0 A0     .word off_A0A0_07
- D 1 - - - 0x036010 1A:A000: B6 A0     .word off_A0B6_08
- D 1 - - - 0x036012 1A:A002: CC A0     .word off_A0CC_09
- D 1 - - - 0x036014 1A:A004: E2 A0     .word off_A0E2_0A



off_A006_00:
; 
- - - - - - 0x036016 1A:A006: FF        .byte $FF   ; 00 
- - - - - - 0x036017 1A:A007: 9D        .byte $9D   ; 01 
- - - - - - 0x036018 1A:A008: B2        .byte $B2   ; 02 
- - - - - - 0x036019 1A:A009: 95        .byte $95   ; 03 
- - - - - - 0x03601A 1A:A00A: 7E        .byte $7E   ; 04 
- - - - - - 0x03601B 1A:A00B: C4        .byte $C4   ; 05 
- - - - - - 0x03601C 1A:A00C: E4        .byte $E4   ; 06 
- - - - - - 0x03601D 1A:A00D: DF        .byte $DF   ; 07 
- - - - - - 0x03601E 1A:A00E: E9        .byte $E9   ; 08 
- - - - - - 0x03601F 1A:A00F: DE        .byte $DE   ; 09 
- - - - - - 0x036020 1A:A010: E1        .byte $E1   ; 0A 
; 
- - - - - - 0x036021 1A:A011: FF        .byte $FF   ; 00 
- - - - - - 0x036022 1A:A012: EA        .byte $EA   ; 01 
- - - - - - 0x036023 1A:A013: E5        .byte $E5   ; 02 
- - - - - - 0x036024 1A:A014: E7        .byte $E7   ; 03 
- - - - - - 0x036025 1A:A015: DB        .byte $DB   ; 04 
- - - - - - 0x036026 1A:A016: CF        .byte $CF   ; 05 
- - - - - - 0x036027 1A:A017: 84        .byte $84   ; 06 
- - - - - - 0x036028 1A:A018: D3        .byte $D3   ; 07 
- - - - - - 0x036029 1A:A019: 7D        .byte $7D   ; 08 
- - - - - - 0x03602A 1A:A01A: D1        .byte $D1   ; 09 
- - - - - - 0x03602B 1A:A01B: A5        .byte $A5   ; 0A 



off_A01C_01:
; 
- - - - - - 0x03602C 1A:A01C: FF        .byte $FF   ; 00 
- - - - - - 0x03602D 1A:A01D: 91        .byte $91   ; 01 
- - - - - - 0x03602E 1A:A01E: A5        .byte $A5   ; 02 
- - - - - - 0x03602F 1A:A01F: 95        .byte $95   ; 03 
- - - - - - 0x036030 1A:A020: 7E        .byte $7E   ; 04 
- - - - - - 0x036031 1A:A021: B4        .byte $B4   ; 05 
- - - - - - 0x036032 1A:A022: E1        .byte $E1   ; 06 
- - - - - - 0x036033 1A:A023: D4        .byte $D4   ; 07 
- - - - - - 0x036034 1A:A024: D2        .byte $D2   ; 08 
- - - - - - 0x036035 1A:A025: BB        .byte $BB   ; 09 
- - - - - - 0x036036 1A:A026: CD        .byte $CD   ; 0A 
; 
- - - - - - 0x036037 1A:A027: FF        .byte $FF   ; 00 
- - - - - - 0x036038 1A:A028: E0        .byte $E0   ; 01 
- - - - - - 0x036039 1A:A029: D9        .byte $D9   ; 02 
- - - - - - 0x03603A 1A:A02A: DB        .byte $DB   ; 03 
- - - - - - 0x03603B 1A:A02B: D0        .byte $D0   ; 04 
- - - - - - 0x03603C 1A:A02C: C5        .byte $C5   ; 05 
- - - - - - 0x03603D 1A:A02D: 90        .byte $90   ; 06 
- - - - - - 0x03603E 1A:A02E: A0        .byte $A0   ; 07 
- - - - - - 0x03603F 1A:A02F: 7D        .byte $7D   ; 08 
- - - - - - 0x036040 1A:A030: BC        .byte $BC   ; 09 
- - - - - - 0x036041 1A:A031: 9A        .byte $9A   ; 0A 



off_A032_02:
; 
- D 1 - I - 0x036042 1A:A032: FF        .byte $FF   ; 00 
- D 1 - I - 0x036043 1A:A033: 92        .byte $92   ; 01 
- D 1 - I - 0x036044 1A:A034: A5        .byte $A5   ; 02 
- D 1 - I - 0x036045 1A:A035: 95        .byte $95   ; 03 
- D 1 - I - 0x036046 1A:A036: 7E        .byte $7E   ; 04 
- D 1 - I - 0x036047 1A:A037: AB        .byte $AB   ; 05 
- D 1 - I - 0x036048 1A:A038: E1        .byte $E1   ; 06 
- D 1 - I - 0x036049 1A:A039: C8        .byte $C8   ; 07 
- D 1 - I - 0x03604A 1A:A03A: CF        .byte $CF   ; 08 
- D 1 - I - 0x03604B 1A:A03B: AF        .byte $AF   ; 09 
- D 1 - I - 0x03604C 1A:A03C: C1        .byte $C1   ; 0A 
; 
- D 1 - I - 0x03604D 1A:A03D: FF        .byte $FF   ; 00 
- D 1 - I - 0x03604E 1A:A03E: E0        .byte $E0   ; 01 
- D 1 - I - 0x03604F 1A:A03F: CD        .byte $CD   ; 02 
- D 1 - I - 0x036050 1A:A040: D0        .byte $D0   ; 03 
- D 1 - I - 0x036051 1A:A041: D1        .byte $D1   ; 04 
- D 1 - I - 0x036052 1A:A042: D2        .byte $D2   ; 05 
- D 1 - I - 0x036053 1A:A043: 91        .byte $91   ; 06 
- D 1 - I - 0x036054 1A:A044: B7        .byte $B7   ; 07 
- D 1 - I - 0x036055 1A:A045: 7D        .byte $7D   ; 08 
- D 1 - I - 0x036056 1A:A046: BC        .byte $BC   ; 09 
- D 1 - I - 0x036057 1A:A047: 9A        .byte $9A   ; 0A 



off_A048_03:
; 
- D 1 - I - 0x036058 1A:A048: FF        .byte $FF   ; 00 
- D 1 - I - 0x036059 1A:A049: 91        .byte $91   ; 01 
- D 1 - I - 0x03605A 1A:A04A: 9A        .byte $9A   ; 02 
- D 1 - I - 0x03605B 1A:A04B: 95        .byte $95   ; 03 
- D 1 - I - 0x03605C 1A:A04C: 7E        .byte $7E   ; 04 
- D 1 - I - 0x03605D 1A:A04D: BF        .byte $BF   ; 05 
- D 1 - I - 0x03605E 1A:A04E: D6        .byte $D6   ; 06 
- D 1 - I - 0x03605F 1A:A04F: CF        .byte $CF   ; 07 
- D 1 - I - 0x036060 1A:A050: D1        .byte $D1   ; 08 
- D 1 - I - 0x036061 1A:A051: B8        .byte $B8   ; 09 
- D 1 - I - 0x036062 1A:A052: DA        .byte $DA   ; 0A 
; 
- D 1 - I - 0x036063 1A:A053: FF        .byte $FF   ; 00 
- D 1 - I - 0x036064 1A:A054: E2        .byte $E2   ; 01 
- D 1 - I - 0x036065 1A:A055: DB        .byte $DB   ; 02 
- D 1 - I - 0x036066 1A:A056: C6        .byte $C6   ; 03 
- D 1 - I - 0x036067 1A:A057: D3        .byte $D3   ; 04 
- D 1 - I - 0x036068 1A:A058: E0        .byte $E0   ; 05 
- D 1 - I - 0x036069 1A:A059: 90        .byte $90   ; 06 
- D 1 - I - 0x03606A 1A:A05A: A2        .byte $A2   ; 07 
- D 1 - I - 0x03606B 1A:A05B: 7D        .byte $7D   ; 08 
- D 1 - I - 0x03606C 1A:A05C: B7        .byte $B7   ; 09 
- D 1 - I - 0x03606D 1A:A05D: 9B        .byte $9B   ; 0A 



off_A05E_04:
; 
- D 1 - I - 0x03606E 1A:A05E: FF        .byte $FF   ; 00 
- D 1 - I - 0x03606F 1A:A05F: 9D        .byte $9D   ; 01 
- D 1 - I - 0x036070 1A:A060: A6        .byte $A6   ; 02 
- D 1 - I - 0x036071 1A:A061: 95        .byte $95   ; 03 
- D 1 - I - 0x036072 1A:A062: 7E        .byte $7E   ; 04 
- - - - - - 0x036073 1A:A063: DC        .byte $DC   ; 05 
- D 1 - I - 0x036074 1A:A064: DA        .byte $DA   ; 06 
- D 1 - I - 0x036075 1A:A065: C7        .byte $C7   ; 07 
- D 1 - I - 0x036076 1A:A066: EA        .byte $EA   ; 08 
- D 1 - I - 0x036077 1A:A067: DD        .byte $DD   ; 09 
- D 1 - I - 0x036078 1A:A068: EF        .byte $EF   ; 0A 
; 
- D 1 - I - 0x036079 1A:A069: FF        .byte $FF   ; 00 
- D 1 - I - 0x03607A 1A:A06A: EE        .byte $EE   ; 01 
- D 1 - I - 0x03607B 1A:A06B: E9        .byte $E9   ; 02 
- D 1 - I - 0x03607C 1A:A06C: D4        .byte $D4   ; 03 
- D 1 - I - 0x03607D 1A:A06D: E0        .byte $E0   ; 04 
- D 1 - I - 0x03607E 1A:A06E: EC        .byte $EC   ; 05 
- D 1 - I - 0x03607F 1A:A06F: 90        .byte $90   ; 06 
- D 1 - I - 0x036080 1A:A070: D2        .byte $D2   ; 07 
- D 1 - I - 0x036081 1A:A071: 7D        .byte $7D   ; 08 
- D 1 - I - 0x036082 1A:A072: D0        .byte $D0   ; 09 
- D 1 - I - 0x036083 1A:A073: 99        .byte $99   ; 0A 



off_A074_05:
; 
- D 1 - I - 0x036084 1A:A074: FF        .byte $FF   ; 00 
- D 1 - I - 0x036085 1A:A075: 91        .byte $91   ; 01 
- D 1 - I - 0x036086 1A:A076: 9A        .byte $9A   ; 02 
- D 1 - I - 0x036087 1A:A077: 95        .byte $95   ; 03 
- D 1 - I - 0x036088 1A:A078: 7E        .byte $7E   ; 04 
- D 1 - I - 0x036089 1A:A079: B7        .byte $B7   ; 05 
- D 1 - I - 0x03608A 1A:A07A: D6        .byte $D6   ; 06 
- D 1 - I - 0x03608B 1A:A07B: AE        .byte $AE   ; 07 
- D 1 - I - 0x03608C 1A:A07C: BC        .byte $BC   ; 08 
- D 1 - I - 0x03608D 1A:A07D: B9        .byte $B9   ; 09 
- D 1 - I - 0x03608E 1A:A07E: CD        .byte $CD   ; 0A 
; 
- D 1 - I - 0x03608F 1A:A07F: FF        .byte $FF   ; 00 
- D 1 - I - 0x036090 1A:A080: E2        .byte $E2   ; 01 
- D 1 - I - 0x036091 1A:A081: D9        .byte $D9   ; 02 
- D 1 - I - 0x036092 1A:A082: BB        .byte $BB   ; 03 
- D 1 - I - 0x036093 1A:A083: B8        .byte $B8   ; 04 
- D 1 - I - 0x036094 1A:A084: BD        .byte $BD   ; 05 
- D 1 - I - 0x036095 1A:A085: 9C        .byte $9C   ; 06 
- D 1 - I - 0x036096 1A:A086: C1        .byte $C1   ; 07 
- D 1 - I - 0x036097 1A:A087: 7D        .byte $7D   ; 08 
- D 1 - I - 0x036098 1A:A088: B6        .byte $B6   ; 09 
- D 1 - I - 0x036099 1A:A089: A7        .byte $A7   ; 0A 



off_A08A_06:
; 
- D 1 - I - 0x03609A 1A:A08A: FF        .byte $FF   ; 00 
- D 1 - I - 0x03609B 1A:A08B: A9        .byte $A9   ; 01 
- D 1 - I - 0x03609C 1A:A08C: A5        .byte $A5   ; 02 
- D 1 - I - 0x03609D 1A:A08D: A1        .byte $A1   ; 03 
- D 1 - I - 0x03609E 1A:A08E: 7E        .byte $7E   ; 04 
- D 1 - I - 0x03609F 1A:A08F: CF        .byte $CF   ; 05 
- D 1 - I - 0x0360A0 1A:A090: D4        .byte $D4   ; 06 
- D 1 - I - 0x0360A1 1A:A091: D1        .byte $D1   ; 07 
- D 1 - I - 0x0360A2 1A:A092: E9        .byte $E9   ; 08 
- D 1 - I - 0x0360A3 1A:A093: DE        .byte $DE   ; 09 
- D 1 - I - 0x0360A4 1A:A094: D9        .byte $D9   ; 0A 
; 
- D 1 - I - 0x0360A5 1A:A095: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360A6 1A:A096: DF        .byte $DF   ; 01 
- D 1 - I - 0x0360A7 1A:A097: E6        .byte $E6   ; 02 
- D 1 - I - 0x0360A8 1A:A098: E8        .byte $E8   ; 03 
- D 1 - I - 0x0360A9 1A:A099: EA        .byte $EA   ; 04 
- D 1 - I - 0x0360AA 1A:A09A: DD        .byte $DD   ; 05 
- D 1 - I - 0x0360AB 1A:A09B: C0        .byte $C0   ; 06 
- D 1 - I - 0x0360AC 1A:A09C: DB        .byte $DB   ; 07 
- D 1 - I - 0x0360AD 1A:A09D: 89        .byte $89   ; 08 
- D 1 - I - 0x0360AE 1A:A09E: D2        .byte $D2   ; 09 
- D 1 - I - 0x0360AF 1A:A09F: C8        .byte $C8   ; 0A 



off_A0A0_07:
; 
- D 1 - I - 0x0360B0 1A:A0A0: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360B1 1A:A0A1: 9D        .byte $9D   ; 01 
- D 1 - I - 0x0360B2 1A:A0A2: B2        .byte $B2   ; 02 
- D 1 - I - 0x0360B3 1A:A0A3: A2        .byte $A2   ; 03 
- D 1 - I - 0x0360B4 1A:A0A4: 7D        .byte $7D   ; 04 
- D 1 - I - 0x0360B5 1A:A0A5: D2        .byte $D2   ; 05 
- D 1 - I - 0x0360B6 1A:A0A6: E2        .byte $E2   ; 06 
- D 1 - I - 0x0360B7 1A:A0A7: D4        .byte $D4   ; 07 
- D 1 - I - 0x0360B8 1A:A0A8: EA        .byte $EA   ; 08 
- D 1 - I - 0x0360B9 1A:A0A9: DD        .byte $DD   ; 09 
- D 1 - I - 0x0360BA 1A:A0AA: CF        .byte $CF   ; 0A 
; 
- D 1 - I - 0x0360BB 1A:A0AB: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360BC 1A:A0AC: ED        .byte $ED   ; 01 
- D 1 - I - 0x0360BD 1A:A0AD: DC        .byte $DC   ; 02 
- D 1 - I - 0x0360BE 1A:A0AE: EB        .byte $EB   ; 03 
- D 1 - I - 0x0360BF 1A:A0AF: E9        .byte $E9   ; 04 
- D 1 - I - 0x0360C0 1A:A0B0: E0        .byte $E0   ; 05 
- D 1 - I - 0x0360C1 1A:A0B1: C3        .byte $C3   ; 06 
- D 1 - I - 0x0360C2 1A:A0B2: DE        .byte $DE   ; 07 
- D 1 - I - 0x0360C3 1A:A0B3: 8A        .byte $8A   ; 08 
- D 1 - I - 0x0360C4 1A:A0B4: D1        .byte $D1   ; 09 
- D 1 - I - 0x0360C5 1A:A0B5: CB        .byte $CB   ; 0A 



off_A0B6_08:
; 
- D 1 - I - 0x0360C6 1A:A0B6: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360C7 1A:A0B7: 7E        .byte $7E   ; 01 
- D 1 - I - 0x0360C8 1A:A0B8: 87        .byte $87   ; 02 
- D 1 - I - 0x0360C9 1A:A0B9: DC        .byte $DC   ; 03 
- D 1 - I - 0x0360CA 1A:A0BA: DE        .byte $DE   ; 04 
- D 1 - I - 0x0360CB 1A:A0BB: CF        .byte $CF   ; 05 
- D 1 - I - 0x0360CC 1A:A0BC: B1        .byte $B1   ; 06 
- D 1 - I - 0x0360CD 1A:A0BD: C6        .byte $C6   ; 07 
- D 1 - I - 0x0360CE 1A:A0BE: E9        .byte $E9   ; 08 
- D 1 - I - 0x0360CF 1A:A0BF: D1        .byte $D1   ; 09 
- D 1 - I - 0x0360D0 1A:A0C0: AA        .byte $AA   ; 0A 
; 
- D 1 - I - 0x0360D1 1A:A0C1: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360D2 1A:A0C2: DF        .byte $DF   ; 01 
- D 1 - I - 0x0360D3 1A:A0C3: E6        .byte $E6   ; 02 
- D 1 - I - 0x0360D4 1A:A0C4: E8        .byte $E8   ; 03 
- D 1 - I - 0x0360D5 1A:A0C5: EA        .byte $EA   ; 04 
- D 1 - I - 0x0360D6 1A:A0C6: DD        .byte $DD   ; 05 
- D 1 - I - 0x0360D7 1A:A0C7: C0        .byte $C0   ; 06 
- D 1 - I - 0x0360D8 1A:A0C8: DB        .byte $DB   ; 07 
- D 1 - I - 0x0360D9 1A:A0C9: 89        .byte $89   ; 08 
- D 1 - I - 0x0360DA 1A:A0CA: D2        .byte $D2   ; 09 
- D 1 - I - 0x0360DB 1A:A0CB: C8        .byte $C8   ; 0A 



off_A0CC_09:
; 
- D 1 - I - 0x0360DC 1A:A0CC: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360DD 1A:A0CD: 7D        .byte $7D   ; 01 
- D 1 - I - 0x0360DE 1A:A0CE: A2        .byte $A2   ; 02 
- D 1 - I - 0x0360DF 1A:A0CF: DF        .byte $DF   ; 03 
- D 1 - I - 0x0360E0 1A:A0D0: DD        .byte $DD   ; 04 
- D 1 - I - 0x0360E1 1A:A0D1: C5        .byte $C5   ; 05 
- D 1 - I - 0x0360E2 1A:A0D2: B1        .byte $B1   ; 06 
- D 1 - I - 0x0360E3 1A:A0D3: D4        .byte $D4   ; 07 
- D 1 - I - 0x0360E4 1A:A0D4: EA        .byte $EA   ; 08 
- D 1 - I - 0x0360E5 1A:A0D5: D2        .byte $D2   ; 09 
- D 1 - I - 0x0360E6 1A:A0D6: AA        .byte $AA   ; 0A 
; 
- D 1 - I - 0x0360E7 1A:A0D7: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360E8 1A:A0D8: ED        .byte $ED   ; 01 
- D 1 - I - 0x0360E9 1A:A0D9: DC        .byte $DC   ; 02 
- D 1 - I - 0x0360EA 1A:A0DA: EB        .byte $EB   ; 03 
- D 1 - I - 0x0360EB 1A:A0DB: E9        .byte $E9   ; 04 
- D 1 - I - 0x0360EC 1A:A0DC: E0        .byte $E0   ; 05 
- D 1 - I - 0x0360ED 1A:A0DD: C3        .byte $C3   ; 06 
- D 1 - I - 0x0360EE 1A:A0DE: DE        .byte $DE   ; 07 
- D 1 - I - 0x0360EF 1A:A0DF: 8A        .byte $8A   ; 08 
- D 1 - I - 0x0360F0 1A:A0E0: D1        .byte $D1   ; 09 
- D 1 - I - 0x0360F1 1A:A0E1: CB        .byte $CB   ; 0A 



off_A0E2_0A:
; 
- - - - - - 0x0360F2 1A:A0E2: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360F3 1A:A0E3: 19        .byte $19   ; 01 
- D 1 - I - 0x0360F4 1A:A0E4: 22        .byte $22   ; 02 
- D 1 - I - 0x0360F5 1A:A0E5: 34        .byte $34   ; 03 
- D 1 - I - 0x0360F6 1A:A0E6: 37        .byte $37   ; 04 
- D 1 - I - 0x0360F7 1A:A0E7: 4A        .byte $4A   ; 05 
- D 1 - I - 0x0360F8 1A:A0E8: 6B        .byte $6B   ; 06 
- D 1 - I - 0x0360F9 1A:A0E9: 51        .byte $51   ; 07 
- D 1 - I - 0x0360FA 1A:A0EA: 71        .byte $71   ; 08 
- D 1 - I - 0x0360FB 1A:A0EB: 5A        .byte $5A   ; 09 
- D 1 - I - 0x0360FC 1A:A0EC: 60        .byte $60   ; 0A 
; 
- D 1 - I - 0x0360FD 1A:A0ED: FF        .byte $FF   ; 00 
- D 1 - I - 0x0360FE 1A:A0EE: 9A        .byte $9A   ; 01 
- D 1 - I - 0x0360FF 1A:A0EF: 91        .byte $91   ; 02 
- D 1 - I - 0x036100 1A:A0F0: 96        .byte $96   ; 03 
- D 1 - I - 0x036101 1A:A0F1: A0        .byte $A0   ; 04 
- D 1 - I - 0x036102 1A:A0F2: 74        .byte $74   ; 05 
- D 1 - I - 0x036103 1A:A0F3: 55        .byte $55   ; 06 
- D 1 - I - 0x036104 1A:A0F4: 6F        .byte $6F   ; 07 
- D 1 - I - 0x036105 1A:A0F5: 4D        .byte $4D   ; 08 
- D 1 - I - 0x036106 1A:A0F6: 7E        .byte $7E   ; 09 
- D 1 - I - 0x036107 1A:A0F7: 5D        .byte $5D   ; 0A 



tbl_A0F8_для_игрока_с_мячом:
- - - - - - 0x036108 1A:A0F8: CD        .byte $CD   ; 00 
- - - - - - 0x036109 1A:A0F9: AA        .byte $AA   ; 01 
- D 1 - - - 0x03610A 1A:A0FA: AD        .byte $AD   ; 02 
- D 1 - - - 0x03610B 1A:A0FB: B1        .byte $B1   ; 03 
- D 1 - - - 0x03610C 1A:A0FC: D6        .byte $D6   ; 04 
- D 1 - - - 0x03610D 1A:A0FD: D1        .byte $D1   ; 05 
- D 1 - - - 0x03610E 1A:A0FE: E4        .byte $E4   ; 06 
- D 1 - - - 0x03610F 1A:A0FF: EF        .byte $EF   ; 07 
- D 1 - - - 0x036110 1A:A100: E4        .byte $E4   ; 08 
- D 1 - - - 0x036111 1A:A101: EF        .byte $EF   ; 09 
- D 1 - - - 0x036112 1A:A102: FF        .byte $FF   ; 0A 



sub_0x036113:
; in
    ; A = номер игрока
C D 1 - - - 0x036113 1A:A103: 48        PHA ; -> 0x036121
C - - - - - 0x036114 1A:A104: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x036117 1A:A107: A2 00     LDX #$00    ; индекс команды слева
C - - - - - 0x036119 1A:A109: 86 3D     STX ram_003D_t09_поинтер_hi
C - - - - - 0x03611B 1A:A10B: AD 2A 06  LDA ram_хз_062A
C - - - - - 0x03611E 1A:A10E: 29 7F     AND #$7F
C - - - - - 0x036120 1A:A110: A8        TAY ; -> 0x036133
C - - - - - 0x036121 1A:A111: 68        PLA ; <- 0x036113
C - - - - - 0x036122 1A:A112: 48        PHA ; -> 0x0361B2
C - - - - - 0x036123 1A:A113: C9 0B     CMP #$0B
C - - - - - 0x036125 1A:A115: 08        PHP ; -> 0x03614A
C - - - - - 0x036126 1A:A116: 90 0A     BCC bra_A122_игрок_команды_слева
; if игрок команды справа
C - - - - - 0x036128 1A:A118: E9 0B     SBC #$0B
C - - - - - 0x03612A 1A:A11A: 48        PHA ; -> 0x036131
C - - - - - 0x03612B 1A:A11B: B9 DC A1  LDA tbl_A1DC,Y
C - - - - - 0x03612E 1A:A11E: A8        TAY ; -> 0x036133
C - - - - - 0x03612F 1A:A11F: E8        INX
C - - - - - 0x036130 1A:A120: E8        INX ; 02 индекс команды справа
C - - - - - 0x036131 1A:A121: 68        PLA ; <- 0x03612A
bra_A122_игрок_команды_слева:
C - - - - - 0x036132 1A:A122: 48        PHA ; -> 0x036140
C - - - - - 0x036133 1A:A123: 98        TYA ; <- 0x036120 / 0x03612E
; * 14
C - - - - - 0x036134 1A:A124: 0A        ASL
C - - - - - 0x036135 1A:A125: 0A        ASL
C - - - - - 0x036136 1A:A126: 85 3C     STA ram_003C_t13_x04
C - - - - - 0x036138 1A:A128: 0A        ASL
C - - - - - 0x036139 1A:A129: 0A        ASL
C - - - - - 0x03613A 1A:A12A: 65 3C     ADC ram_003C_t13_x04
C - - - - - 0x03613C 1A:A12C: 85 3C     STA ram_003C_t14_поинтер_lo
C - - - - - 0x03613E 1A:A12E: 26 3D     ROL ram_003D_t09_поинтер_hi
C - - - - - 0x036140 1A:A130: 68        PLA ; <- 0x036132
C - - - - - 0x036141 1A:A131: 38        SEC
C - - - - - 0x036142 1A:A132: E9 01     SBC #$01
C - - - - - 0x036144 1A:A134: 4E E2 00  LSR ram_random + $01
C - - - - - 0x036147 1A:A137: 2A        ROL
C - - - - - 0x036148 1A:A138: 85 3E     STA ram_003E_t13_data_index
C - - - - - 0x03614A 1A:A13A: 28        PLP ; <- 0x036125
C - - - - - 0x03614B 1A:A13B: 08        PHP ; -> 0x036197
C - - - - - 0x03614C 1A:A13C: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x03614F 1A:A13F: F0 06     BEQ bra_A147_команда_слева
; if мяч у команды справа, поменять
; состояние флага C на противоположное
C - - - - - 0x036151 1A:A141: 08        PHP
C - - - - - 0x036152 1A:A142: 68        PLA
C - - - - - 0x036153 1A:A143: 49 01     EOR #$01
C - - - - - 0x036155 1A:A145: 48        PHA
C - - - - - 0x036156 1A:A146: 28        PLP
bra_A147_команда_слева:
C - - - - - 0x036157 1A:A147: B0 13     BCS bra_A15C
C - - - - - 0x036159 1A:A149: A9 25     LDA #con_skill_25
C - - - - - 0x03615B 1A:A14B: 85 3F     STA ram_003F_t06_номер_скилла
; also ram_расстановка_справа
C - - - - - 0x03615D 1A:A14D: BD 2C 00  LDA ram_расстановка_слева,X
C - - - - - 0x036160 1A:A150: 0A        ASL
C - - - - - 0x036161 1A:A151: AA        TAX
C - - - - - 0x036162 1A:A152: BD AE A6  LDA tbl_A6AD + $01,X
C - - - - - 0x036165 1A:A155: A8        TAY
C - - - - - 0x036166 1A:A156: BD AD A6  LDA tbl_A6AD,X
C - - - - - 0x036169 1A:A159: 4C 79 A1  JMP loc_A179
bra_A15C:
C - - - - - 0x03616C 1A:A15C: A9 26     LDA #con_skill_26
C - - - - - 0x03616E 1A:A15E: 85 3F     STA ram_003F_t06_номер_скилла
; also ram_расстановка_справа
C - - - - - 0x036170 1A:A160: BD 2C 00  LDA ram_расстановка_слева,X
; расстановка * 06 + защита * 02
C - - - - - 0x036173 1A:A163: 0A        ASL
C - - - - - 0x036174 1A:A164: 85 3A     STA ram_003A_t46_x02
C - - - - - 0x036176 1A:A166: 0A        ASL
C - - - - - 0x036177 1A:A167: 65 3A     ADC ram_003A_t46_x02
C - - - - - 0x036179 1A:A169: 85 3A     STA ram_003A_t47_расстановка_x06
; also ram_защита_справа
C - - - - - 0x03617B 1A:A16B: BD 2D 00  LDA ram_защита_слева,X
C - - - - - 0x03617E 1A:A16E: 0A        ASL
C - - - - - 0x03617F 1A:A16F: 65 3A     ADC ram_003A_t47_расстановка_x06
C - - - - - 0x036181 1A:A171: AA        TAX
C - - - - - 0x036182 1A:A172: BD 66 AB  LDA tbl_AB65 + $01,X
C - - - - - 0x036185 1A:A175: A8        TAY
C - - - - - 0x036186 1A:A176: BD 65 AB  LDA tbl_AB65,X
loc_A179:
C D 1 - - - 0x036189 1A:A179: 18        CLC
C - - - - - 0x03618A 1A:A17A: 65 3C     ADC ram_003C_t14_поинтер_lo
C - - - - - 0x03618C 1A:A17C: 85 3A     STA ram_003A_t09_data
C - - - - - 0x03618E 1A:A17E: 98        TYA
C - - - - - 0x03618F 1A:A17F: 65 3D     ADC ram_003D_t09_поинтер_hi
C - - - - - 0x036191 1A:A181: 85 3B     STA ram_003A_t09_data + $01
C - - - - - 0x036193 1A:A183: A4 3E     LDY ram_003E_t13_data_index
C - - - - - 0x036195 1A:A185: B1 3A     LDA (ram_003A_t09_data),Y
C - - - - - 0x036197 1A:A187: 28        PLP ; <- 0x03614B
C - - - - - 0x036198 1A:A188: 90 14     BCC bra_A19E
C - - - - - 0x03619A 1A:A18A: C9 F0     CMP #$F0
C - - - - - 0x03619C 1A:A18C: F0 10     BEQ bra_A19E
C - - - - - 0x03619E 1A:A18E: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x0361A1 1A:A191: 8A        TXA
C - - - - - 0x0361A2 1A:A192: 49 FF     EOR #$FF
C - - - - - 0x0361A4 1A:A194: AA        TAX
C - - - - - 0x0361A5 1A:A195: 98        TYA
C - - - - - 0x0361A6 1A:A196: 49 FF     EOR #$FF
C - - - - - 0x0361A8 1A:A198: A8        TAY
C - - - - - 0x0361A9 1A:A199: E8        INX
C - - - - - 0x0361AA 1A:A19A: C8        INY
C - - - - - 0x0361AB 1A:A19B: 20 39 C5  JSR sub_0x03CDF2
bra_A19E:
C - - - - - 0x0361AE 1A:A19E: A0 09     LDY #con_plr_09
C - - - - - 0x0361B0 1A:A1A0: 91 34     STA (ram_plr_data),Y    ; con_plr_09
C - - - - - 0x0361B2 1A:A1A2: 68        PLA ; <- 0x036122
C - - - - - 0x0361B3 1A:A1A3: 48        PHA ; -> 0x0361B9
C - - - - - 0x0361B4 1A:A1A4: A6 3F     LDX ram_003F_t06_номер_скилла
C - - - - - 0x0361B6 1A:A1A6: 20 27 C5  JSR sub_0x03CE18_вычислить_числовой_стат_скилла
C - - - - - 0x0361B9 1A:A1A9: 68        PLA ; <- 0x0361B3
C - - - - - 0x0361BA 1A:A1AA: A6 32     LDX ram_0032_t10_число_скилла_lo
C - - - - - 0x0361BC 1A:A1AC: EC E2 00  CPX ram_random + $01
C - - - - - 0x0361BF 1A:A1AF: B0 01     BCS bra_A1B2
C - - - - - 0x0361C1 1A:A1B1: 60        RTS
bra_A1B2:
C - - - - - 0x0361C2 1A:A1B2: A6 3F     LDX ram_003F_t06_номер_скилла
C - - - - - 0x0361C4 1A:A1B4: E0 25     CPX #con_skill_25
C - - - - - 0x0361C6 1A:A1B6: F0 04     BEQ bra_A1BC
; if con_skill_26
C - - - - - 0x0361C8 1A:A1B8: A9 F0     LDA #$F0
C - - - - - 0x0361CA 1A:A1BA: D0 1B     BNE bra_A1D7    ; jmp
bra_A1BC:
C - - - - - 0x0361CC 1A:A1BC: C9 0B     CMP #$0B
C - - - - - 0x0361CE 1A:A1BE: 90 02     BCC bra_A1C2_игрок_команды_слева
; if игрок команды справа
C - - - - - 0x0361D0 1A:A1C0: E9 0B     SBC #$0B
bra_A1C2_игрок_команды_слева:
C - - - - - 0x0361D2 1A:A1C2: C9 05     CMP #$05
C - - - - - 0x0361D4 1A:A1C4: B0 15     BCS bra_A1DB_RTS    ; if MF/FW
; if DF
; bzk bug? порядковый номер защитника должен
; выбираться исходя из расстановки, а не фиксированный
C - - - - - 0x0361D6 1A:A1C6: A2 C8     LDX #$C8
C - - - - - 0x0361D8 1A:A1C8: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0361DB 1A:A1CB: F0 02     BEQ bra_A1CF_команда_слева
; if мяч у команды справа
C - - - - - 0x0361DD 1A:A1CD: A2 38     LDX #$38
bra_A1CF_команда_слева:
C - - - - - 0x0361DF 1A:A1CF: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x0361E1 1A:A1D1: B1 34     LDA (ram_plr_data),Y    ; con_plr_pos_Y_hi
C - - - - - 0x0361E3 1A:A1D3: A8        TAY
C - - - - - 0x0361E4 1A:A1D4: 20 39 C5  JSR sub_0x03CDF2
bra_A1D7:
C - - - - - 0x0361E7 1A:A1D7: A0 09     LDY #con_plr_09
C - - - - - 0x0361E9 1A:A1D9: 91 34     STA (ram_plr_data),Y    ; con_plr_09
bra_A1DB_RTS:
C - - - - - 0x0361EB 1A:A1DB: 60        RTS



tbl_A1DC:
; bzk optimize, байты в убывающем порядке
; возможно достаточно будет делать EOR 0F
- D 1 - - - 0x0361EC 1A:A1DC: 0E        .byte $0E   ; 00 
- D 1 - - - 0x0361ED 1A:A1DD: 0D        .byte $0D   ; 01 
- D 1 - - - 0x0361EE 1A:A1DE: 0C        .byte $0C   ; 02 
- D 1 - - - 0x0361EF 1A:A1DF: 0B        .byte $0B   ; 03 
- D 1 - - - 0x0361F0 1A:A1E0: 0A        .byte $0A   ; 04 
- D 1 - - - 0x0361F1 1A:A1E1: 09        .byte $09   ; 05 
- D 1 - - - 0x0361F2 1A:A1E2: 08        .byte $08   ; 06 
- D 1 - - - 0x0361F3 1A:A1E3: 07        .byte $07   ; 07 
- D 1 - - - 0x0361F4 1A:A1E4: 06        .byte $06   ; 08 
- D 1 - - - 0x0361F5 1A:A1E5: 05        .byte $05   ; 09 
- D 1 - - - 0x0361F6 1A:A1E6: 04        .byte $04   ; 0A 
- D 1 - - - 0x0361F7 1A:A1E7: 03        .byte $03   ; 0B 
- D 1 - - - 0x0361F8 1A:A1E8: 02        .byte $02   ; 0C 
- D 1 - - - 0x0361F9 1A:A1E9: 01        .byte $01   ; 0D 
- D 1 - - - 0x0361FA 1A:A1EA: 00        .byte $00   ; 0E 



sub_0x0361FB_отрисовка_чарли_на_фоне:
C D 1 - - - 0x0361FB 1A:A1EB: AD F4 05  LDA ram_05F4_flag_charlie
C - - - - - 0x0361FE 1A:A1EE: D0 01     BNE bra_A1F1
C - - - - - 0x036200 1A:A1F0: 60        RTS
bra_A1F1:
C - - - - - 0x036201 1A:A1F1: 10 19     BPL bra_A20C
C - - - - - 0x036203 1A:A1F3: A9 01     LDA #$01
C - - - - - 0x036205 1A:A1F5: 8D F4 05  STA ram_05F4_flag_charlie
C - - - - - 0x036208 1A:A1F8: AD F3 05  LDA ram_05F3
C - - - - - 0x03620B 1A:A1FB: 0A        ASL
C - - - - - 0x03620C 1A:A1FC: AA        TAX
C - - - - - 0x03620D 1A:A1FD: BD 92 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли,X
C - - - - - 0x036210 1A:A200: 85 63     STA ram_0063_t04_data
C - - - - - 0x036212 1A:A202: BD 93 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли + $01,X
C - - - - - 0x036215 1A:A205: 85 64     STA ram_0063_t04_data + $01
C - - - - - 0x036217 1A:A207: A9 00     LDA #$00
C - - - - - 0x036219 1A:A209: 8D F5 05  STA ram_05F5_timer_charlie
bra_A20C:
C - - - - - 0x03621C 1A:A20C: AD F5 05  LDA ram_05F5_timer_charlie
C - - - - - 0x03621F 1A:A20F: F0 04     BEQ bra_A215_ожидание_освобождения_буфера
C - - - - - 0x036221 1A:A211: CE F5 05  DEC ram_05F5_timer_charlie
C - - - - - 0x036224 1A:A214: 60        RTS
bra_A215_ожидание_освобождения_буфера:
C - - - - - 0x036225 1A:A215: A9 01     LDA #$01
C - - - - - 0x036227 1A:A217: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03622A 1A:A21A: AD 15 05  LDA ram_0515_buffer_flag
C - - - - - 0x03622D 1A:A21D: D0 F6     BNE bra_A215_ожидание_освобождения_буфера
C - - - - - 0x03622F 1A:A21F: A9 01     LDA #$01
C - - - - - 0x036231 1A:A221: 8D 15 05  STA ram_0515_buffer_flag
bra_A224_loop:
loc_A224_loop:
C D 1 - - - 0x036234 1A:A224: A0 00     LDY #$00
C - - - - - 0x036236 1A:A226: B1 63     LDA (ram_0063_t04_data),Y
C - - - - - 0x036238 1A:A228: C9 FF     CMP #$FF
C - - - - - 0x03623A 1A:A22A: D0 16     BNE bra_A242_байты_еще_есть
; FF прочитать поинтеры и повторить цикл
C - - - - - 0x03623C 1A:A22C: C8        INY
C - - - - - 0x03623D 1A:A22D: B1 63     LDA (ram_0063_t04_data),Y
C - - - - - 0x03623F 1A:A22F: AA        TAX
C - - - - - 0x036240 1A:A230: C8        INY
C - - - - - 0x036241 1A:A231: B1 63     LDA (ram_0063_t04_data),Y
C - - - - - 0x036243 1A:A233: 85 64     STA ram_0063_t04_data + $01
C - - - - - 0x036245 1A:A235: 86 63     STX ram_0063_t04_data
C - - - - - 0x036247 1A:A237: AD E3 05  LDA ram_05E3_флаг
C - - - - - 0x03624A 1A:A23A: D0 E8     BNE bra_A224_loop
; A = 00
C - - - - - 0x03624C 1A:A23C: 8D F4 05  STA ram_05F4_flag_charlie
C - - - - - 0x03624F 1A:A23F: 4C 24 A2  JMP loc_A224_loop
bra_A242_байты_еще_есть:
C - - - - - 0x036252 1A:A242: 8D F5 05  STA ram_05F5_timer_charlie
C - - - - - 0x036255 1A:A245: C8        INY
C - - - - - 0x036256 1A:A246: B1 63     LDA (ram_0063_t04_data),Y
C - - - - - 0x036258 1A:A248: 0A        ASL
C - - - - - 0x036259 1A:A249: AA        TAX
C - - - - - 0x03625A 1A:A24A: BD 2A A4  LDA tbl_A42A_ppu_байты_анимаций_чарли,X
C - - - - - 0x03625D 1A:A24D: 85 3A     STA ram_003A_t10_data_байты_анимации_чарли
C - - - - - 0x03625F 1A:A24F: BD 2B A4  LDA tbl_A42A_ppu_байты_анимаций_чарли + $01,X
C - - - - - 0x036262 1A:A252: 85 3B     STA ram_003A_t10_data_байты_анимации_чарли + $01
C - - - - - 0x036264 1A:A254: A0 00     LDY #$00
C - - - - - 0x036266 1A:A256: A2 00     LDX #$00
bra_A258_loop:
C - - - - - 0x036268 1A:A258: B1 3A     LDA (ram_003A_t10_data_байты_анимации_чарли),Y
C - - - - - 0x03626A 1A:A25A: F0 22     BEQ bra_A27E_закончить_чтение_атрибутов
C - - - - - 0x03626C 1A:A25C: 9D A5 04  STA ram_04A5,X
C - - - - - 0x03626F 1A:A25F: 85 3C     STA ram_003C_t15_loop_counter
C - - - - - 0x036271 1A:A261: C8        INY
C - - - - - 0x036272 1A:A262: B1 3A     LDA (ram_003A_t10_data_байты_анимации_чарли),Y
C - - - - - 0x036274 1A:A264: 9D A6 04  STA ram_04A6,X
C - - - - - 0x036277 1A:A267: C8        INY
C - - - - - 0x036278 1A:A268: B1 3A     LDA (ram_003A_t10_data_байты_анимации_чарли),Y
C - - - - - 0x03627A 1A:A26A: 9D A7 04  STA ram_04A7,X
C - - - - - 0x03627D 1A:A26D: C8        INY
C - - - - - 0x03627E 1A:A26E: E8        INX
C - - - - - 0x03627F 1A:A26F: E8        INX
C - - - - - 0x036280 1A:A270: E8        INX
bra_A271_loop:
C - - - - - 0x036281 1A:A271: B1 3A     LDA (ram_003A_t10_data_байты_анимации_чарли),Y
C - - - - - 0x036283 1A:A273: 9D A5 04  STA ram_04A5,X
C - - - - - 0x036286 1A:A276: E8        INX
C - - - - - 0x036287 1A:A277: C8        INY
C - - - - - 0x036288 1A:A278: C6 3C     DEC ram_003C_t15_loop_counter
C - - - - - 0x03628A 1A:A27A: D0 F5     BNE bra_A271_loop
C - - - - - 0x03628C 1A:A27C: F0 DA     BEQ bra_A258_loop   ; jmp
bra_A27E_закончить_чтение_атрибутов:
C - - - - - 0x03628E 1A:A27E: 9D A5 04  STA ram_04A5,X
C - - - - - 0x036291 1A:A281: A9 80     LDA #$80
C - - - - - 0x036293 1A:A283: 8D 15 05  STA ram_0515_buffer_flag
C - - - - - 0x036296 1A:A286: A5 63     LDA ram_0063_t04_data
C - - - - - 0x036298 1A:A288: 18        CLC
C - - - - - 0x036299 1A:A289: 69 02     ADC #$02
C - - - - - 0x03629B 1A:A28B: 85 63     STA ram_0063_t04_data
C - - - - - 0x03629D 1A:A28D: 90 02     BCC bra_A291_RTS
C - - - - - 0x03629F 1A:A28F: E6 64     INC ram_0063_t04_data + $01
bra_A291_RTS:
C - - - - - 0x0362A1 1A:A291: 60        RTS



tbl_A292_номера_ppu_байтов_для_анимаций_чарли:
; see con_cloud_charlie
- D 1 - - - 0x0362A2 1A:A292: AE A2     .word off_A2AE_00
- D 1 - - - 0x0362A4 1A:A294: CB A2     .word off_A2CB_01
- D 1 - - - 0x0362A6 1A:A296: E8 A2     .word off_A2E8_02
- D 1 - - - 0x0362A8 1A:A298: FD A2     .word off_A2FD_03
- D 1 - - - 0x0362AA 1A:A29A: 1A A3     .word off_A31A_04
- D 1 - - - 0x0362AC 1A:A29C: 3F A3     .word off_A33F_05
- D 1 - - - 0x0362AE 1A:A29E: 5E A3     .word off_A35E_06
- D 1 - - - 0x0362B0 1A:A2A0: 6B A3     .word off_A36B_07
- D 1 - - - 0x0362B2 1A:A2A2: 72 A3     .word off_A372_08
- D 1 - - - 0x0362B4 1A:A2A4: 77 A3     .word off_A377_09
- D 1 - - - 0x0362B6 1A:A2A6: 92 A3     .word off_A392_0A
- D 1 - - - 0x0362B8 1A:A2A8: CB A3     .word off_A3CB_0B
- D 1 - - - 0x0362BA 1A:A2AA: F4 A3     .word off_A3F4_0C
- D 1 - - - 0x0362BC 1A:A2AC: 25 A4     .word off_A425_0D



off_A2AE_00:
loc_FF_A2AE:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x0362BE 1A:A2AE: 05        .byte $05, $00   ; 
- D 1 - I - 0x0362C0 1A:A2B0: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362C2 1A:A2B2: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362C4 1A:A2B4: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362C6 1A:A2B6: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362C8 1A:A2B8: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362CA 1A:A2BA: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362CC 1A:A2BC: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362CE 1A:A2BE: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362D0 1A:A2C0: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362D2 1A:A2C2: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362D4 1A:A2C4: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362D6 1A:A2C6: 05        .byte $05, $00   ; 
- D 1 - I - 0x0362D8 1A:A2C8: FF        .byte $FF   ; jmp
- D 1 - I - 0x0362D9 1A:A2C9: AE A2     .word loc_FF_A2AE



off_A2CB_01:
loc_FF_A2CB:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x0362DB 1A:A2CB: 05        .byte $05, $04   ; 
- D 1 - I - 0x0362DD 1A:A2CD: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362DF 1A:A2CF: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E1 1A:A2D1: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362E3 1A:A2D3: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E5 1A:A2D5: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362E7 1A:A2D7: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362E9 1A:A2D9: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362EB 1A:A2DB: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362ED 1A:A2DD: 05        .byte $05, $03   ; 
- D 1 - I - 0x0362EF 1A:A2DF: 05        .byte $05, $02   ; 
- D 1 - I - 0x0362F1 1A:A2E1: 05        .byte $05, $01   ; 
- D 1 - I - 0x0362F3 1A:A2E3: 05        .byte $05, $04   ; 
- D 1 - I - 0x0362F5 1A:A2E5: FF        .byte $FF   ; jmp
- D 1 - I - 0x0362F6 1A:A2E6: CB A2     .word loc_FF_A2CB



off_A2E8_02:
loc_FF_A2E8:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x0362F8 1A:A2E8: 04        .byte $04, $05   ; 
- D 1 - I - 0x0362FA 1A:A2EA: 04        .byte $04, $06   ; 
- D 1 - I - 0x0362FC 1A:A2EC: 04        .byte $04, $07   ; 
- D 1 - I - 0x0362FE 1A:A2EE: 04        .byte $04, $06   ; 
- D 1 - I - 0x036300 1A:A2F0: 04        .byte $04, $07   ; 
- D 1 - I - 0x036302 1A:A2F2: 04        .byte $04, $06   ; 
- D 1 - I - 0x036304 1A:A2F4: 04        .byte $04, $07   ; 
- D 1 - I - 0x036306 1A:A2F6: 04        .byte $04, $06   ; 
- D 1 - I - 0x036308 1A:A2F8: 04        .byte $04, $05   ; 
- D 1 - I - 0x03630A 1A:A2FA: FF        .byte $FF   ; jmp
- D 1 - I - 0x03630B 1A:A2FB: E8 A2     .word loc_FF_A2E8



off_A2FD_03:
loc_FF_A2FD:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x03630D 1A:A2FD: 05        .byte $05, $08   ; 
- D 1 - I - 0x03630F 1A:A2FF: 05        .byte $05, $09   ; 
- D 1 - I - 0x036311 1A:A301: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036313 1A:A303: 05        .byte $05, $09   ; 
- D 1 - I - 0x036315 1A:A305: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036317 1A:A307: 05        .byte $05, $09   ; 
- D 1 - I - 0x036319 1A:A309: 05        .byte $05, $08   ; 
- D 1 - I - 0x03631B 1A:A30B: 05        .byte $05, $09   ; 
- D 1 - I - 0x03631D 1A:A30D: 05        .byte $05, $0A   ; 
- D 1 - I - 0x03631F 1A:A30F: 05        .byte $05, $09   ; 
- D 1 - I - 0x036321 1A:A311: 05        .byte $05, $0A   ; 
- D 1 - I - 0x036323 1A:A313: 05        .byte $05, $09   ; 
- D 1 - I - 0x036325 1A:A315: 05        .byte $05, $08   ; 
- D 1 - I - 0x036327 1A:A317: FF        .byte $FF   ; jmp
- D 1 - I - 0x036328 1A:A318: FD A2     .word loc_FF_A2FD



off_A31A_04:
loc_FF_A31A:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x03632A 1A:A31A: 08        .byte $08, $0B   ; 
- D 1 - I - 0x03632C 1A:A31C: 04        .byte $04, $02   ; 
- D 1 - I - 0x03632E 1A:A31E: 04        .byte $04, $03   ; 
- D 1 - I - 0x036330 1A:A320: 04        .byte $04, $02   ; 
- D 1 - I - 0x036332 1A:A322: 04        .byte $04, $03   ; 
- D 1 - I - 0x036334 1A:A324: 04        .byte $04, $02   ; 
- D 1 - I - 0x036336 1A:A326: 04        .byte $04, $03   ; 
- D 1 - I - 0x036338 1A:A328: 08        .byte $08, $0C   ; 
- D 1 - I - 0x03633A 1A:A32A: 04        .byte $04, $02   ; 
- D 1 - I - 0x03633C 1A:A32C: 04        .byte $04, $03   ; 
- D 1 - I - 0x03633E 1A:A32E: 04        .byte $04, $02   ; 
- D 1 - I - 0x036340 1A:A330: 04        .byte $04, $0B   ; 
- D 1 - I - 0x036342 1A:A332: 04        .byte $04, $02   ; 
- D 1 - I - 0x036344 1A:A334: 08        .byte $08, $0C   ; 
- D 1 - I - 0x036346 1A:A336: 04        .byte $04, $02   ; 
- D 1 - I - 0x036348 1A:A338: 04        .byte $04, $03   ; 
- D 1 - I - 0x03634A 1A:A33A: 04        .byte $04, $02   ; 
- D 1 - I - 0x03634C 1A:A33C: FF        .byte $FF   ; jmp
- D 1 - I - 0x03634D 1A:A33D: 1A A3     .word loc_FF_A31A



off_A33F_05:
loc_FF_A33F:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x03634F 1A:A33F: 05        .byte $05, $0F   ; 
- D 1 - I - 0x036351 1A:A341: 05        .byte $05, $10   ; 
- D 1 - I - 0x036353 1A:A343: 05        .byte $05, $11   ; 
- D 1 - I - 0x036355 1A:A345: 05        .byte $05, $10   ; 
- D 1 - I - 0x036357 1A:A347: 05        .byte $05, $11   ; 
- D 1 - I - 0x036359 1A:A349: 05        .byte $05, $10   ; 
- D 1 - I - 0x03635B 1A:A34B: 05        .byte $05, $0F   ; 
- D 1 - I - 0x03635D 1A:A34D: 05        .byte $05, $10   ; 
- D 1 - I - 0x03635F 1A:A34F: 05        .byte $05, $11   ; 
- D 1 - I - 0x036361 1A:A351: 05        .byte $05, $10   ; 
- D 1 - I - 0x036363 1A:A353: 05        .byte $05, $11   ; 
- D 1 - I - 0x036365 1A:A355: 05        .byte $05, $10   ; 
- D 1 - I - 0x036367 1A:A357: 05        .byte $05, $11   ; 
- D 1 - I - 0x036369 1A:A359: 05        .byte $05, $10   ; 
- D 1 - I - 0x03636B 1A:A35B: FF        .byte $FF   ; jmp
- D 1 - I - 0x03636C 1A:A35C: 3F A3     .word loc_FF_A33F



off_A35E_06:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x03636E 1A:A35E: 0A        .byte $0A, $05   ; 
- D 1 - I - 0x036370 1A:A360: 0A        .byte $0A, $06   ; 
- D 1 - I - 0x036372 1A:A362: 0F        .byte $0F, $07   ; 
loc_FF_A364:
- D 1 - I - 0x036374 1A:A364: 05        .byte $05, $12   ; 
- D 1 - I - 0x036376 1A:A366: 05        .byte $05, $13   ; 
- D 1 - I - 0x036378 1A:A368: FF        .byte $FF   ; jmp
- D 1 - I - 0x036379 1A:A369: 64 A3     .word loc_FF_A364



off_A36B_07:
loc_FF_A36B:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x03637B 1A:A36B: 08        .byte $08, $14   ; 
- D 1 - I - 0x03637D 1A:A36D: 08        .byte $08, $15   ; 
- D 1 - I - 0x03637F 1A:A36F: FF        .byte $FF   ; jmp
- D 1 - I - 0x036380 1A:A370: 6B A3     .word loc_FF_A36B



off_A372_08:
loc_FF_A372:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x036382 1A:A372: 80        .byte $80, $00   ; 
- D 1 - I - 0x036384 1A:A374: FF        .byte $FF   ; jmp
- D 1 - I - 0x036385 1A:A375: 72 A3     .word loc_FF_A372



off_A377_09:
loc_FF_A377:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x036387 1A:A377: 03        .byte $03, $16   ; 
- D 1 - I - 0x036389 1A:A379: 03        .byte $03, $17   ; 
- D 1 - I - 0x03638B 1A:A37B: 03        .byte $03, $19   ; 
- D 1 - I - 0x03638D 1A:A37D: 03        .byte $03, $18   ; 
- D 1 - I - 0x03638F 1A:A37F: 05        .byte $05, $16   ; 
- D 1 - I - 0x036391 1A:A381: 05        .byte $05, $17   ; 
- D 1 - I - 0x036393 1A:A383: 05        .byte $05, $19   ; 
- D 1 - I - 0x036395 1A:A385: 05        .byte $05, $18   ; 
- D 1 - I - 0x036397 1A:A387: 03        .byte $03, $16   ; 
- D 1 - I - 0x036399 1A:A389: 03        .byte $03, $17   ; 
- D 1 - I - 0x03639B 1A:A38B: 03        .byte $03, $19   ; 
- D 1 - I - 0x03639D 1A:A38D: 03        .byte $03, $18   ; 
- D 1 - I - 0x03639F 1A:A38F: FF        .byte $FF   ; jmp
- D 1 - I - 0x0363A0 1A:A390: 77 A3     .word loc_FF_A377



off_A392_0A:
loc_FF_A392:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x0363A2 1A:A392: 07        .byte $07, $1A   ; 
- D 1 - I - 0x0363A4 1A:A394: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363A6 1A:A396: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363A8 1A:A398: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363AA 1A:A39A: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363AC 1A:A39C: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363AE 1A:A39E: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363B0 1A:A3A0: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363B2 1A:A3A2: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363B4 1A:A3A4: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363B6 1A:A3A6: 05        .byte $05, $1A   ; 
- D 1 - I - 0x0363B8 1A:A3A8: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363BA 1A:A3AA: 07        .byte $07, $1A   ; 
- D 1 - I - 0x0363BC 1A:A3AC: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363BE 1A:A3AE: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C0 1A:A3B0: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363C2 1A:A3B2: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C4 1A:A3B4: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363C6 1A:A3B6: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363C8 1A:A3B8: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363CA 1A:A3BA: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363CC 1A:A3BC: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363CE 1A:A3BE: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363D0 1A:A3C0: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363D2 1A:A3C2: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363D4 1A:A3C4: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363D6 1A:A3C6: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363D8 1A:A3C8: FF        .byte $FF   ; jmp
- D 1 - I - 0x0363D9 1A:A3C9: 92 A3     .word loc_FF_A392



off_A3CB_0B:
loc_FF_A3CB:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x0363DB 1A:A3CB: 07        .byte $07, $1E   ; 
- D 1 - I - 0x0363DD 1A:A3CD: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363DF 1A:A3CF: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363E1 1A:A3D1: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363E3 1A:A3D3: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363E5 1A:A3D5: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363E7 1A:A3D7: 07        .byte $07, $1E   ; 
- D 1 - I - 0x0363E9 1A:A3D9: 05        .byte $05, $1B   ; 
- D 1 - I - 0x0363EB 1A:A3DB: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363ED 1A:A3DD: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363EF 1A:A3DF: 07        .byte $07, $1C   ; 
- D 1 - I - 0x0363F1 1A:A3E1: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363F3 1A:A3E3: 07        .byte $07, $1D   ; 
- D 1 - I - 0x0363F5 1A:A3E5: 07        .byte $07, $1B   ; 
- D 1 - I - 0x0363F7 1A:A3E7: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363F9 1A:A3E9: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363FB 1A:A3EB: 05        .byte $05, $1C   ; 
- D 1 - I - 0x0363FD 1A:A3ED: 05        .byte $05, $1D   ; 
- D 1 - I - 0x0363FF 1A:A3EF: 07        .byte $07, $1B   ; 
- D 1 - I - 0x036401 1A:A3F1: FF        .byte $FF   ; jmp
- D 1 - I - 0x036402 1A:A3F2: CB A3     .word loc_FF_A3CB



off_A3F4_0C:
loc_FF_A3F4:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x036404 1A:A3F4: 07        .byte $07, $1F   ; 
- D 1 - I - 0x036406 1A:A3F6: 05        .byte $05, $02   ; 
- D 1 - I - 0x036408 1A:A3F8: 05        .byte $05, $03   ; 
- D 1 - I - 0x03640A 1A:A3FA: 05        .byte $05, $02   ; 
- D 1 - I - 0x03640C 1A:A3FC: 05        .byte $05, $03   ; 
- D 1 - I - 0x03640E 1A:A3FE: 05        .byte $05, $02   ; 
- D 1 - I - 0x036410 1A:A400: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036412 1A:A402: 05        .byte $05, $03   ; 
- D 1 - I - 0x036414 1A:A404: 05        .byte $05, $0C   ; 
- D 1 - I - 0x036416 1A:A406: 07        .byte $07, $03   ; 
- D 1 - I - 0x036418 1A:A408: 05        .byte $05, $02   ; 
- D 1 - I - 0x03641A 1A:A40A: 07        .byte $07, $1F   ; 
- D 1 - I - 0x03641C 1A:A40C: 05        .byte $05, $02   ; 
- D 1 - I - 0x03641E 1A:A40E: 07        .byte $07, $03   ; 
- D 1 - I - 0x036420 1A:A410: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036422 1A:A412: 05        .byte $05, $03   ; 
- D 1 - I - 0x036424 1A:A414: 07        .byte $07, $0C   ; 
- D 1 - I - 0x036426 1A:A416: 05        .byte $05, $03   ; 
- D 1 - I - 0x036428 1A:A418: 07        .byte $07, $0C   ; 
- D 1 - I - 0x03642A 1A:A41A: 05        .byte $05, $03   ; 
- D 1 - I - 0x03642C 1A:A41C: 07        .byte $07, $0C   ; 
- D 1 - I - 0x03642E 1A:A41E: 05        .byte $05, $03   ; 
- D 1 - I - 0x036430 1A:A420: 05        .byte $05, $02   ; 
- D 1 - I - 0x036432 1A:A422: FF        .byte $FF   ; jmp
- D 1 - I - 0x036433 1A:A423: F4 A3     .word loc_FF_A3F4



off_A425_0D:
loc_FF_A425:
;                                              +---------- таймер
;                                              |    +----- индекс анимации
;                                              |    |
- D 1 - I - 0x036435 1A:A425: EF        .byte $EF, $00   ; 
- - - - - - 0x036437 1A:A427: FF        .byte $FF   ; jmp
- - - - - - 0x036438 1A:A428: 25 A4     .word loc_FF_A425



tbl_A42A_ppu_байты_анимаций_чарли:
; 0x03643A
    .word off_A46A_00
    .word off_A48F_01
    .word off_A494_02
    .word off_A499_03
    .word off_A49E_04
    .word off_A4C3_05
    .word off_A4E8_06
    .word off_A4ED_07
    .word off_A4F2_08
    .word off_A517_09
    .word off_A51C_0A
    .word off_A521_0B
    .word off_A546_0C
    .word $0000  ; 0D unused
    .word $0000  ; 0E unused
    .word off_A54B_0F
    .word off_A570_10
    .word off_A57A_11
    .word off_A584_12
    .word off_A5A9_13
    .word off_A5B8_14
    .word off_A5DD_15
    .word off_A5E6_16
    .word off_A60B_17
    .word off_A615_18
    .word off_A61F_19
    .word off_A629_1A
    .word off_A64E_1B
    .word off_A655_1C
    .word off_A65C_1D
    .word off_A663_1E
    .word off_A688_1F



off_A46A_00:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $B4, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $B6, $B7, $E2   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A48F_01:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $DA   ; 
    
    .byte $00   ; end token



off_A494_02:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $F1   ; 
    
    .byte $00   ; end token



off_A499_03:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $D8   ; 
    
    .byte $00   ; end token



off_A49E_04:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $EB, $EE, $EF   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $B6, $B7, $E2   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A4C3_05:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $B4, $E4, $E5   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $B6, $E6, $E7   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A4E8_06:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $D9   ; 
    
    .byte $00   ; end token



off_A4ED_07:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $F2   ; 
    
    .byte $00   ; end token



off_A4F2_08:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $B4, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $E9, $EC, $ED   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A517_09:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $DB   ; 
    
    .byte $00   ; end token



off_A51C_0A:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $F0   ; 
    
    .byte $00   ; end token



off_A521_0B:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $EB, $EE, $EF   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $B6, $DA, $E2   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A546_0C:
    .byte $01   ; счетчик тайлов
    .word $2323 ; ppu адрес
    .byte $F3   ; 
    
    .byte $00   ; end token



off_A54B_0F:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $F4, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $F5, $EC, $ED   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $B0, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A570_10:
    .byte $01   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $E1   ; 
    
    .byte $02   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $E3, $DB   ; 
    
    .byte $00   ; end token



off_A57A_11:
    .byte $01   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $F4   ; 
    
    .byte $02   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $F5, $F0   ; 
    
    .byte $00   ; end token



off_A584_12:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $00, $00, $00   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $00, $B2, $B3   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $AD, $B8, $B9   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AF, $BA, $BB   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A5A9_13:
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $A6, $A7, $00   ; 
    
    .byte $01   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $AC   ; 
    
    .byte $01   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AE   ; 
    
    .byte $00   ; end token



off_A5B8_14:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $00, $00, $F8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $00, $00, $FA   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $AD, $B8, $B9   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AF, $BA, $BB   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A5DD_15:
    .byte $01   ; счетчик тайлов
    .word $2304 ; ppu адрес
    .byte $F9   ; 
    
    .byte $01   ; счетчик тайлов
    .word $2324 ; ppu адрес
    .byte $FB   ; 
    
    .byte $00   ; end token



off_A5E6_16:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $DC, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $DF, $EC, $ED   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $B0, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A60B_17:
    .byte $01   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $DD   ; 
    
    .byte $02   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $DF, $DB   ; 
    
    .byte $00   ; end token



off_A615_18:
    .byte $01   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $DD   ; 
    
    .byte $02   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $F5, $DB   ; 
    
    .byte $00   ; end token



off_A61F_19:
    .byte $01   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $DE   ; 
    
    .byte $02   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $F5, $F0   ; 
    
    .byte $00   ; end token



off_A629_1A:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $B4, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $E9, $EC, $ED   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $D6, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AE, $D3, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A64E_1B:
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $E9, $F7, $ED   ; 
    
    .byte $00   ; end token



off_A655_1C:
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $D1, $D4, $D5   ; 
    
    .byte $00   ; end token



off_A65C_1D:
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $D1, $D7, $D5   ; 
    
    .byte $00   ; end token



off_A663_1E:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $B4, $B5, $E0   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $E9, $EC, $ED   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $BD, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $BE, $BF, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



off_A688_1F:
    .byte $03   ; счетчик тайлов
    .word $2302 ; ppu адрес
    .byte $EB, $EE, $EF   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2322 ; ppu адрес
    .byte $B6, $DA, $E2   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2342 ; ppu адрес
    .byte $BC, $D6, $E8   ; 
    
    .byte $03   ; счетчик тайлов
    .word $2362 ; ppu адрес
    .byte $AE, $D3, $EA   ; 
    
    .byte $02   ; счетчик тайлов
    .word $23F0 ; ppu адрес
    .byte $44, $11   ; 
    
    .byte $00   ; end token



tbl_A6AD:
- D 1 - - - 0x0366BD 1A:A6AD: B5 A6     .word off_A6B5_00___4_3_3
- D 1 - - - 0x0366BF 1A:A6AF: E1 A7     .word off_A7E1_01___4_4_2
- D 1 - - - 0x0366C1 1A:A6B1: 0D A9     .word off_A90D_02___3_5_2
- D 1 - - - 0x0366C3 1A:A6B3: 39 AA     .word off_AA39_03___brazil_tactics

; 01-10 (DEC) = позиции полевых игроков
; для каждой позиции рандомно выбирается одно из двух значений

off_A6B5_00___4_3_3:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x0366C5 1A:A6B5: 00        .byte $00, $24, $1E, $1E, $26, $28, $03, $03, $4A, $4A, $6B, $6B, $28, $44, $79, $7D, $40, $66, $6C, $6C   ; 00 
- D 1 - I - 0x0366D9 1A:A6C9: 3C        .byte $3C, $3C, $50, $50, $4C, $3F, $28, $35, $62, $7A, $83, $A7, $67, $67, $A8, $95, $70, $98, $84, $87   ; 01 
- D 1 - I - 0x0366ED 1A:A6DD: 54        .byte $54, $6C, $80, $80, $6F, $7C, $4B, $65, $9D, $AC, $BF, $BF, $AE, $C7, $C4, $C4, $95, $B6, $B4, $C0   ; 02 
- D 1 - I - 0x036701 1A:A6F1: 90        .byte $90, $90, $A5, $A5, $94, $94, $7E, $7E, $C3, $C3, $DF, $DF, $AD, $C6, $DC, $DC, $D1, $D1, $D8, $D8   ; 03 
- D 1 - I - 0x036715 1A:A705: A8        .byte $A8, $A8, $B1, $B1, $95, $95, $7E, $7E, $D1, $D1, $E0, $E0, $D3, $D3, $E9, $E9, $DE, $DE, $DC, $DC   ; 04 
- D 1 - I - 0x036729 1A:A719: 03        .byte $03, $1B, $08, $20, $1C, $1D, $06, $11, $25, $33, $5F, $5F, $2B, $44, $72, $72, $35, $4E, $54, $54   ; 05 
- D 1 - I - 0x03673D 1A:A72D: 3C        .byte $3C, $48, $47, $53, $41, $41, $37, $37, $57, $7B, $83, $8F, $5C, $80, $8A, $A3, $71, $94, $78, $84   ; 06 
- D 1 - I - 0x036751 1A:A741: 6C        .byte $6C, $6C, $77, $77, $71, $71, $66, $66, $AA, $93, $CB, $B3, $B0, $98, $B8, $C7, $95, $AE, $A8, $C0   ; 07 
- D 1 - I - 0x036765 1A:A755: 9C        .byte $9C, $9C, $A7, $A7, $96, $96, $7D, $7D, $B7, $D0, $E3, $E3, $BC, $D3, $DD, $DD, $C5, $DE, $D8, $D8   ; 08 
- D 1 - I - 0x036779 1A:A769: 9C        .byte $9C, $9C, $A7, $A7, $AD, $AD, $8A, $8A, $CF, $DC, $EF, $EF, $D4, $DF, $E9, $E9, $DE, $EA, $E4, $E4   ; 09 
- D 1 - I - 0x03678D 1A:A77D: 1D        .byte $1D, $1D, $0B, $2F, $2D, $39, $08, $08, $2B, $3F, $77, $77, $51, $51, $7E, $82, $43, $65, $60, $60   ; 0A 
- D 1 - I - 0x0367A1 1A:A791: 4B        .byte $4B, $4B, $47, $47, $4F, $44, $2B, $36, $64, $64, $80, $9B, $69, $82, $97, $B3, $73, $94, $78, $9C   ; 0B 
- D 1 - I - 0x0367B5 1A:A7A5: 7B        .byte $7B, $7B, $5F, $77, $74, $7F, $50, $66, $AD, $C4, $BF, $CB, $A6, $AF, $C7, $C7, $96, $BD, $B4, $B4   ; 0C 
- D 1 - I - 0x0367C9 1A:A7B9: 9E        .byte $9E, $9E, $9B, $9B, $97, $97, $7D, $7D, $AE, $C5, $E3, $E3, $C8, $C8, $DF, $DF, $D2, $D2, $DC, $DC   ; 0D 
- D 1 - I - 0x0367DD 1A:A7CD: AA        .byte $AA, $AA, $B3, $B3, $A2, $A2, $7D, $7D, $D0, $D0, $DF, $DF, $D2, $D2, $EA, $EA, $DD, $DD, $DB, $DB   ; 0E 



off_A7E1_01___4_4_2:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x0367F1 1A:A7E1: 00        .byte $00, $24, $12, $12, $26, $32, $03, $03, $49, $54, $51, $51, $1D, $36, $7F, $7F, $40, $5A, $6C, $70   ; 00 
- D 1 - I - 0x036805 1A:A7F5: 30        .byte $30, $6C, $44, $52, $26, $26, $29, $29, $84, $79, $75, $8E, $67, $4D, $97, $97, $64, $89, $9C, $93   ; 01 
- D 1 - I - 0x036819 1A:A809: 54        .byte $54, $9C, $68, $82, $57, $57, $4D, $4D, $B4, $A9, $B2, $B2, $89, $A3, $BB, $C6, $9F, $AD, $CC, $C4   ; 02 
- D 1 - I - 0x03682D 1A:A81D: 79        .byte $79, $CC, $8D, $B2, $7C, $7C, $71, $71, $C3, $E4, $C8, $C8, $A1, $C6, $DE, $DE, $D1, $D1, $CE, $DC   ; 03 
- D 1 - I - 0x036841 1A:A831: 9C        .byte $9C, $9C, $99, $99, $88, $88, $71, $71, $DC, $DC, $D4, $D4, $D1, $D1, $EA, $EA, $DE, $DE, $E9, $E9   ; 04 
- D 1 - I - 0x036855 1A:A845: 0E        .byte $0E, $0E, $15, $15, $10, $10, $06, $06, $60, $4A, $51, $6B, $37, $41, $73, $83, $34, $65, $70, $78   ; 05 
- D 1 - I - 0x036869 1A:A859: 3C        .byte $3C, $6C, $47, $77, $35, $35, $2B, $2B, $56, $84, $5D, $8F, $80, $67, $8A, $A7, $7B, $71, $94, $9C   ; 06 
- D 1 - I - 0x03687D 1A:A86D: 61        .byte $61, $90, $6A, $9B, $59, $6F, $5B, $74, $9D, $C0, $A6, $CB, $93, $98, $BC, $BB, $A3, $AD, $B7, $B8   ; 07 
- D 1 - I - 0x036891 1A:A881: 85        .byte $85, $CC, $8E, $D7, $7D, $7D, $72, $72, $D0, $E4, $D3, $EF, $C3, $C8, $DE, $E2, $D2, $E9, $D9, $DD   ; 08 
- D 1 - I - 0x0368A5 1A:A895: 85        .byte $85, $85, $8E, $8E, $95, $95, $72, $72, $DB, $DB, $E0, $E0, $C5, $C5, $EA, $EA, $DE, $DE, $E9, $E9   ; 09 
- D 1 - I - 0x0368B9 1A:A8A9: 11        .byte $11, $11, $0B, $2F, $2D, $39, $08, $08, $4A, $4A, $52, $5F, $1E, $35, $73, $77, $43, $59, $7C, $7C   ; 0A 
- D 1 - I - 0x0368CD 1A:A8BD: 3F        .byte $3F, $4A, $3B, $77, $2D, $2D, $2A, $2A, $6E, $85, $82, $8F, $64, $4E, $98, $A7, $67, $8A, $94, $A1   ; 0B 
- D 1 - I - 0x0368E1 1A:A8D1: 79        .byte $79, $63, $5F, $A7, $5C, $5C, $4E, $4E, $A9, $A9, $B2, $BF, $A0, $8A, $C7, $D7, $AE, $A4, $B8, $C5   ; 0C 
- D 1 - I - 0x0368F5 1A:A8E5: 86        .byte $86, $B5, $82, $D7, $7F, $7F, $72, $72, $C3, $C3, $C8, $EF, $C5, $A2, $D5, $DF, $D2, $D2, $DD, $DD   ; 0D 
- D 1 - I - 0x036909 1A:A8F9: 92        .byte $92, $92, $A7, $A7, $8B, $8B, $72, $72, $CF, $CF, $DF, $DF, $D2, $D2, $EA, $EA, $DD, $DD, $E9, $E9   ; 0E 



off_A90D_02___3_5_2:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x03691D 1A:A90D: 0C        .byte $0C, $30, $14, $14, $05, $05, $49, $27, $54, $56, $44, $53, $2A, $35, $73, $7F, $3F, $5B, $6C, $70   ; 00 
- D 1 - I - 0x036931 1A:A921: 25        .byte $25, $25, $38, $38, $28, $28, $78, $4C, $84, $62, $5C, $83, $41, $66, $8B, $A2, $70, $A0, $87, $9C   ; 01 
- D 1 - I - 0x036945 1A:A935: 55        .byte $55, $55, $69, $69, $4D, $4D, $B4, $88, $9D, $CC, $B1, $BF, $C6, $BB, $C7, $D2, $B6, $AD, $C4, $C4   ; 02 
- D 1 - I - 0x036959 1A:A949: 79        .byte $79, $79, $8D, $8D, $71, $71, $D8, $AC, $C3, $E4, $D4, $D4, $A2, $C6, $DE, $DE, $D1, $D1, $DC, $DC   ; 03 
- D 1 - I - 0x03696D 1A:A95D: 91        .byte $91, $91, $9A, $9A, $7E, $7E, $AD, $C7, $D1, $D1, $E0, $E0, $DE, $DE, $E9, $E9, $EA, $EA, $DC, $DC   ; 04 
- D 1 - I - 0x036981 1A:A971: 0F        .byte $0F, $0F, $14, $14, $05, $05, $24, $33, $60, $4B, $51, $43, $38, $2F, $73, $83, $41, $59, $70, $78   ; 05 
- D 1 - I - 0x036995 1A:A985: 32        .byte $32, $32, $39, $39, $29, $29, $49, $7A, $63, $84, $68, $8F, $52, $81, $8B, $A7, $71, $A1, $88, $9C   ; 06 
- D 1 - I - 0x0369A9 1A:A999: 62        .byte $62, $90, $69, $9B, $59, $59, $B4, $7A, $93, $C0, $98, $CB, $81, $BF, $B0, $BC, $A2, $C5, $AB, $B7   ; 07 
- D 1 - I - 0x0369BD 1A:A9AD: 79        .byte $79, $90, $82, $9B, $71, $71, $D0, $B6, $C0, $E4, $CB, $EF, $D4, $BD, $E0, $DE, $E9, $D2, $DB, $DD   ; 08 
- D 1 - I - 0x0369D1 1A:A9C1: 9D        .byte $9D, $9D, $A6, $A6, $7D, $7D, $D0, $D0, $DB, $DB, $E0, $E0, $D3, $D3, $EA, $EA, $DE, $DE, $E9, $E9   ; 09 
- D 1 - I - 0x0369E5 1A:A9D5: 0F        .byte $0F, $0F, $17, $3B, $06, $06, $29, $36, $3F, $48, $5F, $5D, $2C, $52, $73, $77, $59, $44, $7C, $7C   ; 0A 
- D 1 - I - 0x0369F9 1A:A9E9: 33        .byte $33, $33, $2E, $2E, $2B, $2B, $58, $42, $78, $62, $69, $8F, $4F, $83, $8C, $A7, $67, $A3, $88, $A1   ; 0B 
- D 1 - I - 0x036A0D 1A:A9FD: 62        .byte $62, $62, $5E, $5E, $4E, $4E, $7D, $94, $B4, $AA, $A6, $D7, $BF, $8B, $C7, $C7, $AE, $BD, $B8, $C5   ; 0C 
- D 1 - I - 0x036A21 1A:AA11: 86        .byte $86, $86, $82, $82, $72, $72, $A1, $C5, $CF, $CF, $C8, $EF, $AF, $E3, $DF, $DF, $D2, $D2, $DD, $DD   ; 0D 
- D 1 - I - 0x036A35 1A:AA25: 91        .byte $91, $91, $9A, $9A, $7D, $7D, $DD, $DD, $DB, $DB, $D2, $D2, $AE, $C4, $DF, $DF, $E9, $E9, $EA, $EA   ; 0E 



off_AA39_03___brazil_tactics:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x036A49 1A:AA39: 0C        .byte $0C, $48, $20, $20, $1B, $1B, $11, $11, $40, $4D, $6B, $6B, $36, $36, $7E, $7E, $63, $85, $3E, $6C   ; 00 
- D 1 - I - 0x036A5D 1A:AA4D: 30        .byte $30, $90, $45, $52, $33, $33, $36, $41, $58, $7C, $83, $83, $5A, $67, $A2, $A2, $86, $AB, $6D, $A8   ; 01 
- D 1 - I - 0x036A71 1A:AA61: 60        .byte $60, $B4, $69, $69, $63, $63, $59, $7D, $94, $A1, $CB, $CB, $8B, $A5, $C6, $C6, $B7, $C3, $9D, $CC   ; 02 
- D 1 - I - 0x036A85 1A:AA75: A8        .byte $A8, $CC, $B1, $B1, $88, $88, $96, $96, $AC, $AC, $DF, $DF, $BA, $C6, $DC, $DC, $D1, $D1, $C2, $E4   ; 03 
- D 1 - I - 0x036A99 1A:AA89: B4        .byte $B4, $E4, $BE, $BE, $A0, $A0, $97, $97, $D1, $D1, $E0, $E0, $D3, $D3, $E9, $E9, $DE, $DE, $DC, $DC   ; 04 
- D 1 - I - 0x036AAD 1A:AA9D: 0D        .byte $0D, $24, $16, $2F, $05, $0F, $06, $14, $35, $42, $77, $77, $2C, $5C, $72, $8B, $58, $86, $33, $6C   ; 05 
- D 1 - I - 0x036AC1 1A:AAB1: 3C        .byte $3C, $6C, $47, $52, $28, $32, $2B, $38, $7A, $72, $8F, $8F, $5C, $80, $A2, $A2, $9E, $88, $4B, $57   ; 06 
- D 1 - I - 0x036AD5 1A:AAC5: 78        .byte $78, $C2, $77, $5E, $58, $6F, $5B, $81, $A1, $AF, $CB, $CB, $98, $BD, $C6, $C6, $AB, $D0, $92, $CC   ; 07 
- D 1 - I - 0x036AE9 1A:AAD9: A8        .byte $A8, $D8, $B3, $B3, $7D, $7D, $7F, $7F, $C6, $C6, $E3, $E3, $BC, $D4, $DE, $DE, $D0, $DD, $C3, $E4   ; 08 
- D 1 - I - 0x036AFD 1A:AAED: A8        .byte $A8, $D8, $B3, $B3, $88, $88, $8A, $8A, $C4, $C4, $E2, $E2, $DE, $DE, $EA, $EA, $E9, $E9, $D0, $D0   ; 09 
- D 1 - I - 0x036B11 1A:AB01: 3C        .byte $3C, $1C, $0B, $2F, $12, $12, $08, $20, $37, $44, $77, $5F, $46, $69, $7E, $82, $61, $70, $41, $5B   ; 0A 
- D 1 - I - 0x036B25 1A:AB15: 30        .byte $30, $90, $3B, $6B, $29, $3F, $2B, $43, $65, $5C, $9B, $B3, $8D, $82, $8A, $B0, $73, $9F, $4D, $60   ; 0B 
- D 1 - I - 0x036B39 1A:AB29: 6C        .byte $6C, $C0, $6B, $A7, $58, $63, $4F, $73, $A2, $95, $CB, $CB, $A5, $B0, $C6, $C9, $B8, $C3, $7D, $9D   ; 0C 
- D 1 - I - 0x036B4D 1A:AB3D: 85        .byte $85, $CF, $9B, $9B, $7C, $93, $74, $A4, $AE, $C7, $EF, $EF, $D5, $D5, $DE, $DE, $D1, $D1, $B8, $CC   ; 0D 
- D 1 - I - 0x036B61 1A:AB51: 9D        .byte $9D, $DB, $B3, $B3, $88, $88, $7F, $7F, $D0, $D0, $DF, $DF, $D2, $D2, $EA, $EA, $DD, $DD, $E9, $E9   ; 0E 



tbl_AB65:
; 4_3_3
- D 1 - - - 0x036B75 1A:AB65: 7D AB     .word off_AB7D_00_00___4_3_3___normal
- D 1 - - - 0x036B77 1A:AB67: A9 AC     .word off_ACA9_00_01___4_3_3___press
- D 1 - - - 0x036B79 1A:AB69: D5 AD     .word off_ADD5_00_02___4_3_3___counter
; 4_4_2
- D 1 - - - 0x036B7B 1A:AB6B: 01 AF     .word off_AF01_01_00___4_4_2___normal
- D 1 - - - 0x036B7D 1A:AB6D: 2D B0     .word off_B02D_01_01___4_4_2___press
- D 1 - - - 0x036B7F 1A:AB6F: 59 B1     .word off_B159_01_02___4_4_2___counter
; 3_5_2
- D 1 - - - 0x036B81 1A:AB71: 85 B2     .word off_B285_02_00___3_5_2___normal
- D 1 - - - 0x036B83 1A:AB73: B1 B3     .word off_B3B1_02_01___3_5_2___press
- D 1 - - - 0x036B85 1A:AB75: DD B4     .word off_B4DD_02_02___3_5_2___counter
; brazil_tactics
- D 1 - - - 0x036B87 1A:AB77: 09 B6     .word off_B609_03_00___brazil_tactics___normal
- D 1 - - - 0x036B89 1A:AB79: 35 B7     .word off_B735_03_01___brazil_tactics___press
- D 1 - - - 0x036B8B 1A:AB7B: 61 B8     .word off_B861_03_02___brazil_tactics___counter

; 01-10 (DEC) = позиции полевых игроков
; для каждой позиции рандомно выбирается одно из двух значений

off_AB7D_00_00___4_3_3___normal:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x036B8D 1A:AB7D: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $39, $6A, $11, $11, $71, $5A, $1E, $1E, $F0, $60   ; 00 
- D 1 - I - 0x036BA1 1A:AB91: F0        .byte $F0, $F0, $06, $1F, $04, $1C, $0F, $24, $F0, $33, $76, $5D, $29, $36, $7C, $62, $4C, $66, $F0, $F0   ; 01 
- D 1 - I - 0x036BB5 1A:ABA5: 3E        .byte $3E, $3C, $1F, $3A, $35, $34, $1B, $11, $F0, $4C, $69, $8E, $4E, $8B, $88, $A2, $63, $71, $F0, $F0   ; 02 
- D 1 - I - 0x036BC9 1A:ABB9: 6C        .byte $6C, $6E, $36, $75, $4D, $57, $32, $28, $64, $90, $BD, $BD, $7E, $AE, $C6, $C6, $94, $B7, $F0, $F0   ; 03 
- D 1 - I - 0x036BDD 1A:ABCD: 84        .byte $84, $6E, $8B, $74, $7E, $88, $4D, $65, $F0, $F0, $D6, $D6, $C7, $D4, $F0, $EA, $B7, $DC, $F0, $F0   ; 04 
- D 1 - I - 0x036BF1 1A:ABE1: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $1D, $2E, $6B, $F0, $12, $4D, $71, $F0, $F0, $25, $60   ; 05 
- D 1 - I - 0x036C05 1A:ABF5: 03        .byte $03, $10, $13, $08, $F0, $1E, $F0, $05, $F0, $28, $45, $77, $F0, $2B, $71, $71, $F0, $F0, $3E, $6C   ; 06 
- D 1 - I - 0x036C19 1A:AC09: 1B        .byte $1B, $55, $20, $5E, $1D, $35, $12, $12, $F0, $58, $68, $82, $36, $4F, $F0, $F0, $F0, $F0, $63, $79   ; 07 
- D 1 - I - 0x036C2D 1A:AC1D: 58        .byte $58, $79, $50, $82, $41, $5A, $1E, $37, $71, $7B, $A5, $BE, $73, $80, $F0, $F0, $96, $96, $9E, $B5   ; 08 
- D 1 - I - 0x036C41 1A:AC31: 9D        .byte $9D, $6E, $75, $A6, $70, $89, $4F, $66, $94, $B6, $D6, $ED, $A2, $8B, $F0, $F0, $F0, $F0, $E6, $CD   ; 09 
- D 1 - I - 0x036C55 1A:AC45: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $F0, $6B, $F0, $1F, $59, $72, $1D, $1D, $32, $61   ; 0A 
- D 1 - I - 0x036C69 1A:AC59: 3C        .byte $3C, $1C, $F0, $F0, $07, $1F, $14, $2F, $2A, $34, $F0, $F0, $F0, $38, $7F, $69, $4F, $66, $6D, $56   ; 0B 
- D 1 - I - 0x036C7D 1A:AC6D: 1C        .byte $1C, $31, $45, $47, $2A, $37, $12, $20, $4D, $88, $F0, $F0, $F0, $5D, $8B, $A1, $4F, $68, $62, $85   ; 0C 
- D 1 - I - 0x036C91 1A:AC81: 35        .byte $35, $6E, $5D, $8F, $4E, $5B, $2B, $38, $65, $AD, $F0, $F0, $8C, $81, $C4, $C4, $AF, $C8, $91, $B6   ; 0D 
- D 1 - I - 0x036CA5 1A:AC95: 6F        .byte $6F, $91, $75, $8F, $7D, $8B, $5A, $50, $C4, $D0, $F0, $F0, $F0, $F0, $F0, $E9, $BC, $DF, $CD, $CD   ; 0E 



off_ACA9_00_01___4_3_3___press:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x036CB9 1A:ACA9: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $21, $16, $11, $11, $40, $65, $1E, $1E, $F0, $F0   ; 00 
- D 1 - I - 0x036CCD 1A:ACBD: F0        .byte $F0, $F0, $06, $1F, $1C, $05, $F0, $0F, $F0, $26, $45, $76, $F0, $29, $F0, $F0, $F0, $33, $F0, $F0   ; 01 
- D 1 - I - 0x036CE1 1A:ACD1: F0        .byte $F0, $3C, $1D, $4E, $34, $35, $25, $1B, $F0, $3E, $51, $8E, $F0, $4C, $F0, $F0, $F0, $63, $F0, $F0   ; 02 
- D 1 - I - 0x036CF5 1A:ACE5: 6C        .byte $6C, $6E, $72, $36, $57, $4D, $3E, $28, $F0, $F0, $80, $BD, $70, $7D, $F0, $79, $F0, $87, $F0, $F0   ; 03 
- D 1 - I - 0x036D09 1A:ACF9: 84        .byte $84, $6E, $66, $A3, $87, $70, $57, $4D, $F0, $91, $81, $D6, $A0, $C5, $F0, $F0, $F0, $AA, $F0, $F0   ; 04 
- D 1 - I - 0x036D1D 1A:AD0D: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $1D, $2D, $5E, $F0, $12, $41, $71, $F0, $1E, $26, $55   ; 05 
- D 1 - I - 0x036D31 1A:AD21: 10        .byte $10, $03, $13, $08, $F0, $F0, $F0, $05, $F0, $28, $F0, $5E, $F0, $1E, $F0, $65, $F0, $F0, $F0, $55   ; 06 
- D 1 - I - 0x036D45 1A:AD35: 1B        .byte $1B, $55, $2B, $5E, $F0, $36, $1D, $12, $35, $4B, $F0, $68, $4F, $59, $F0, $8A, $F0, $F0, $F0, $63   ; 07 
- D 1 - I - 0x036D59 1A:AD49: 57        .byte $57, $85, $50, $82, $40, $59, $36, $2A, $70, $73, $F0, $A4, $F0, $8B, $F0, $F0, $F0, $89, $F0, $9F   ; 08 
- D 1 - I - 0x036D6D 1A:AD5D: 91        .byte $91, $6E, $74, $9A, $70, $89, $5B, $66, $87, $8B, $F0, $B1, $F0, $A2, $F0, $F0, $F0, $F0, $F0, $AA   ; 09 
- D 1 - I - 0x036D81 1A:AD71: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $F0, $F0, $F0, $1F, $66, $43, $1D, $1D, $0D, $1A   ; 0A 
- D 1 - I - 0x036D95 1A:AD85: 1C        .byte $1C, $05, $F0, $F0, $06, $1F, $F0, $14, $F0, $2A, $F0, $F0, $F0, $38, $F0, $F0, $F0, $2B, $3F, $6D   ; 0B 
- D 1 - I - 0x036DA9 1A:AD99: 4D        .byte $4D, $1E, $F0, $47, $37, $36, $20, $2E, $F0, $4F, $F0, $45, $F0, $44, $F0, $F0, $F0, $F0, $85, $4A   ; 0C 
- D 1 - I - 0x036DBD 1A:ADAD: 34        .byte $34, $65, $5D, $8F, $5B, $42, $2A, $46, $7E, $72, $F0, $F0, $F0, $6A, $F0, $F0, $F0, $74, $7B, $B6   ; 0D 
- D 1 - I - 0x036DD1 1A:ADC1: 65        .byte $65, $88, $75, $8F, $8B, $73, $4E, $5C, $C6, $96, $F0, $F0, $F0, $9A, $F0, $F0, $F0, $A4, $7A, $CD   ; 0E 



off_ADD5_00_02___4_3_3___counter:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x036DE5 1A:ADD5: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $51, $77, $11, $11, $71, $73, $1E, $1E, $54, $6C   ; 00 
- D 1 - I - 0x036DF9 1A:ADE9: F0        .byte $F0, $24, $1F, $06, $04, $04, $0F, $1B, $F0, $F0, $46, $76, $29, $36, $7C, $7E, $F0, $1C, $F0, $F0   ; 01 
- D 1 - I - 0x036E0D 1A:ADFD: 3C        .byte $3C, $19, $13, $39, $1C, $33, $0F, $11, $F0, $3E, $5E, $9B, $36, $4F, $9E, $A2, $4C, $1E, $F0, $F0   ; 02 
- D 1 - I - 0x036E21 1A:AE11: 30        .byte $30, $49, $37, $51, $58, $35, $32, $1C, $6C, $6E, $8E, $BE, $4F, $7F, $F0, $B8, $7C, $59, $F0, $F0   ; 03 
- D 1 - I - 0x036E35 1A:AE25: 6C        .byte $6C, $55, $5D, $82, $6F, $65, $4C, $4E, $F0, $91, $A6, $D6, $7E, $98, $F0, $DC, $88, $A0, $F0, $F0   ; 04 
- D 1 - I - 0x036E49 1A:AE39: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $1D, $46, $77, $F0, $12, $71, $66, $F0, $F0, $3D, $6C   ; 05 
- D 1 - I - 0x036E5D 1A:AE4D: 03        .byte $03, $10, $13, $08, $F0, $1E, $F0, $05, $F0, $28, $2E, $77, $F0, $2B, $6F, $73, $F0, $F0, $25, $6C   ; 06 
- D 1 - I - 0x036E71 1A:AE61: 55        .byte $55, $0F, $14, $5E, $35, $1D, $12, $05, $27, $4B, $39, $8F, $2B, $36, $F0, $F0, $F0, $F0, $3E, $84   ; 07 
- D 1 - I - 0x036E85 1A:AE75: 31        .byte $31, $61, $3A, $6A, $3F, $44, $28, $2B, $57, $7B, $A5, $CA, $73, $5C, $F0, $F0, $59, $71, $9E, $C0   ; 08 
- D 1 - I - 0x036E99 1A:AE89: 79        .byte $79, $56, $5D, $82, $70, $66, $41, $4E, $9D, $88, $B0, $D6, $8B, $A6, $F0, $F0, $F0, $89, $9F, $CD   ; 09 
- D 1 - I - 0x036EAD 1A:AE9D: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $5F, $77, $F0, $1F, $70, $73, $1D, $1D, $6C, $4A   ; 0A 
- D 1 - I - 0x036EC1 1A:AEB1: 1C        .byte $1C, $05, $F0, $2F, $07, $07, $14, $20, $2A, $36, $F0, $F0, $F0, $F0, $7D, $7F, $F0, $1F, $49, $6D   ; 0B 
- D 1 - I - 0x036ED5 1A:AEC5: 10        .byte $10, $32, $22, $47, $1F, $37, $12, $14, $40, $35, $F0, $F0, $F0, $45, $A1, $A5, $1D, $4F, $90, $55   ; 0C 
- D 1 - I - 0x036EE9 1A:AED9: 4A        .byte $4A, $34, $3B, $3B, $36, $5B, $1F, $39, $4C, $70, $F0, $F0, $50, $6A, $F0, $BB, $59, $80, $85, $B5   ; 0D 
- D 1 - I - 0x036EFD 1A:AEED: 79        .byte $79, $55, $5E, $77, $66, $74, $4D, $4F, $F0, $8D, $F0, $F0, $93, $7C, $F0, $DF, $7E, $A3, $9D, $CD   ; 0E 



off_AF01_01_00___4_4_2___normal:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x036F11 1A:AF01: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $13, $13, $1E, $1E, $4E, $73, $11, $11, $7B, $3E   ; 00 
- D 1 - I - 0x036F25 1A:AF15: F0        .byte $F0, $F0, $05, $05, $1C, $04, $0F, $24, $F0, $33, $1F, $36, $29, $29, $7C, $75, $26, $65, $F0, $F0   ; 01 
- D 1 - I - 0x036F39 1A:AF29: 3E        .byte $3E, $3C, $1F, $3A, $1D, $34, $19, $10, $F0, $F0, $82, $69, $36, $5A, $7E, $98, $4B, $58, $F0, $92   ; 02 
- D 1 - I - 0x036F4D 1A:AF3D: 6C        .byte $6C, $55, $37, $75, $57, $41, $32, $28, $90, $6E, $7F, $B1, $5A, $AE, $C7, $CA, $64, $B7, $F0, $F0   ; 03 
- D 1 - I - 0x036F61 1A:AF51: 84        .byte $84, $6E, $74, $9A, $88, $7D, $4B, $59, $F0, $F0, $BB, $D5, $9F, $A1, $EA, $EA, $A8, $D0, $F0, $F0   ; 04 
- D 1 - I - 0x036F75 1A:AF65: F0        .byte $F0, $F0, $F0, $F0, $F0, $12, $F0, $04, $F0, $1D, $F0, $07, $F0, $1E, $73, $5E, $F0, $F0, $70, $4A   ; 05 
- D 1 - I - 0x036F89 1A:AF79: 03        .byte $03, $10, $08, $13, $F0, $1E, $05, $05, $F0, $28, $F0, $45, $F0, $2B, $73, $69, $F0, $F0, $6F, $62   ; 06 
- D 1 - I - 0x036F9D 1A:AF8D: 1B        .byte $1B, $55, $20, $5E, $1D, $35, $12, $12, $6C, $63, $68, $81, $36, $4F, $F0, $F0, $F0, $58, $F0, $F0   ; 07 
- D 1 - I - 0x036FB1 1A:AFA1: 58        .byte $58, $79, $50, $82, $41, $5A, $1E, $37, $B5, $9E, $A5, $BE, $73, $80, $F0, $F0, $7B, $71, $F0, $C3   ; 08 
- D 1 - I - 0x036FC5 1A:AFB5: 9D        .byte $9D, $6E, $75, $A6, $70, $89, $4E, $67, $E6, $CD, $D6, $ED, $A2, $8B, $F0, $F0, $B6, $94, $F0, $F0   ; 09 
- D 1 - I - 0x036FD9 1A:AFC9: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $10, $10, $F0, $1F, $12, $12, $75, $44, $1D, $1D, $70, $4D   ; 0A 
- D 1 - I - 0x036FED 1A:AFDD: 06        .byte $06, $06, $F0, $F0, $1F, $07, $14, $2F, $1C, $34, $F0, $38, $20, $66, $F0, $F0, $2A, $2A, $7F, $6E   ; 0B 
- D 1 - I - 0x037001 1A:AFF1: 1C        .byte $1C, $31, $45, $47, $1E, $37, $13, $22, $79, $62, $F0, $F0, $4F, $5C, $F0, $99, $35, $4D, $93, $7D   ; 0C 
- D 1 - I - 0x037015 1A:B005: 6E        .byte $6E, $34, $5E, $8F, $42, $50, $2B, $39, $87, $9E, $81, $A7, $67, $BB, $F0, $F0, $AD, $59, $C1, $C4   ; 0D 
- D 1 - I - 0x037029 1A:B019: 6F        .byte $6F, $91, $8F, $75, $8B, $7E, $5A, $50, $B8, $CE, $F0, $F0, $B3, $D3, $F0, $F0, $AE, $A4, $E9, $E9   ; 0E 



off_B02D_01_01___4_4_2___press:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x03703D 1A:B02D: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $13, $13, $1E, $1E, $37, $68, $11, $11, $F0, $F0   ; 00 
- D 1 - I - 0x037051 1A:B041: F0        .byte $F0, $F0, $05, $05, $04, $1C, $F0, $0F, $F0, $F0, $29, $36, $F0, $33, $7E, $5C, $F0, $26, $F0, $F0   ; 01 
- D 1 - I - 0x037065 1A:B055: F0        .byte $F0, $3C, $1D, $4E, $34, $35, $25, $1B, $F0, $3E, $F0, $4C, $F0, $57, $51, $8C, $F0, $F0, $F0, $F0   ; 02 
- D 1 - I - 0x037079 1A:B069: 6C        .byte $6C, $6E, $36, $72, $57, $4D, $3E, $28, $F0, $F0, $70, $7D, $F0, $87, $80, $C7, $F0, $C7, $F0, $F0   ; 03 
- D 1 - I - 0x03708D 1A:B07D: 84        .byte $84, $6E, $66, $A3, $87, $70, $57, $4D, $F0, $91, $95, $AD, $F0, $B7, $F0, $D0, $F0, $F0, $F0, $F0   ; 04 
- D 1 - I - 0x0370A1 1A:B091: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $1D, $F0, $1E, $F0, $12, $68, $44, $F0, $F0, $3F, $63   ; 05 
- D 1 - I - 0x0370B5 1A:B0A5: 10        .byte $10, $03, $13, $08, $F0, $F0, $F0, $05, $F0, $28, $F0, $2B, $F0, $1E, $F0, $69, $F0, $F0, $F0, $62   ; 06 
- D 1 - I - 0x0370C9 1A:B0B9: 55        .byte $55, $1B, $20, $56, $F0, $35, $1D, $12, $F0, $63, $F0, $68, $36, $4F, $F0, $F0, $F0, $59, $F0, $F0   ; 07 
- D 1 - I - 0x0370DD 1A:B0CD: 57        .byte $57, $85, $50, $82, $40, $59, $2A, $36, $F0, $9E, $F0, $A5, $F0, $73, $F0, $F0, $F0, $70, $F0, $F0   ; 08 
- D 1 - I - 0x0370F1 1A:B0E1: 91        .byte $91, $6E, $74, $9A, $70, $89, $66, $5B, $F0, $C2, $F0, $C9, $F0, $A3, $F0, $F0, $F0, $A0, $F0, $F0   ; 09 
- D 1 - I - 0x037105 1A:B0F5: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $10, $10, $F0, $1F, $12, $12, $F0, $F0, $1D, $1D, $34, $63   ; 0A 
- D 1 - I - 0x037119 1A:B109: 06        .byte $06, $06, $F0, $F0, $07, $1F, $F0, $14, $1D, $1D, $F0, $F0, $F0, $38, $F0, $F0, $F0, $2A, $4B, $7D   ; 0B 
- D 1 - I - 0x03712D 1A:B11D: 4D        .byte $4D, $1E, $F0, $47, $36, $37, $20, $2E, $F0, $4F, $F0, $45, $F0, $F0, $F0, $F0, $F0, $5C, $4A, $93   ; 0C 
- D 1 - I - 0x037141 1A:B131: 35        .byte $35, $71, $5D, $8F, $4E, $43, $2B, $45, $7E, $67, $F0, $F0, $F0, $6A, $F0, $F0, $F0, $8C, $7B, $C4   ; 0D 
- D 1 - I - 0x037155 1A:B145: A0        .byte $A0, $65, $75, $8F, $73, $8B, $4E, $5C, $96, $AE, $F0, $9A, $F0, $F0, $F0, $F0, $F0, $BC, $F0, $D3   ; 0E 



off_B159_01_02___4_4_2___counter:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x037169 1A:B159: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $F0, $F0, $1C, $13, $13, $1E, $1E, $5B, $7F, $11, $11, $57, $7B   ; 00 
- D 1 - I - 0x03717D 1A:B16D: F0        .byte $F0, $24, $05, $05, $04, $04, $1B, $0F, $F0, $F0, $1F, $36, $1C, $29, $7C, $7F, $26, $34, $F0, $F0   ; 01 
- D 1 - I - 0x037191 1A:B181: 19        .byte $19, $3C, $13, $39, $33, $1C, $0F, $11, $F0, $F0, $43, $69, $1D, $36, $7E, $A2, $3E, $4C, $F0, $9D   ; 02 
- D 1 - I - 0x0371A5 1A:B195: 30        .byte $30, $49, $51, $37, $57, $35, $32, $1C, $6C, $6E, $73, $A5, $59, $7E, $B8, $C7, $F0, $70, $F0, $F0   ; 03 
- D 1 - I - 0x0371B9 1A:B1A9: 6C        .byte $6C, $55, $5D, $82, $6F, $65, $4C, $4E, $F0, $84, $97, $BD, $93, $7D, $F0, $EA, $7A, $AA, $F0, $F0   ; 04 
- D 1 - I - 0x0371CD 1A:B1BD: F0        .byte $F0, $04, $F0, $F0, $F0, $12, $F0, $F0, $F0, $1D, $F0, $07, $F0, $1E, $73, $5D, $F0, $F0, $56, $70   ; 05 
- D 1 - I - 0x0371E1 1A:B1D1: 03        .byte $03, $10, $13, $08, $F0, $1E, $05, $05, $F0, $28, $F0, $44, $F0, $2B, $73, $69, $F0, $F0, $56, $6F   ; 06 
- D 1 - I - 0x0371F5 1A:B1E5: 55        .byte $55, $0F, $14, $5E, $1D, $35, $05, $12, $26, $62, $39, $69, $59, $2B, $F0, $F0, $F0, $4B, $F0, $F0   ; 07 
- D 1 - I - 0x037209 1A:B1F9: 31        .byte $31, $61, $3A, $6A, $3F, $44, $28, $2B, $90, $57, $4F, $9B, $59, $68, $F0, $F0, $7B, $72, $F0, $9F   ; 08 
- D 1 - I - 0x03721D 1A:B20D: 79        .byte $79, $56, $82, $5D, $67, $70, $4D, $42, $92, $B5, $99, $BE, $B0, $8B, $F0, $F0, $88, $A0, $F0, $F0   ; 09 
- D 1 - I - 0x037231 1A:B221: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $10, $10, $F0, $1F, $12, $12, $5B, $7E, $1D, $1D, $64, $7C   ; 0A 
- D 1 - I - 0x037245 1A:B235: 06        .byte $06, $06, $F0, $2F, $07, $07, $14, $20, $1C, $34, $F0, $F0, $37, $39, $F0, $F0, $2A, $1F, $7C, $7F   ; 0B 
- D 1 - I - 0x037259 1A:B249: 32        .byte $32, $10, $22, $47, $1F, $37, $14, $12, $62, $40, $F0, $F0, $4F, $45, $7D, $A1, $1E, $59, $F0, $A6   ; 0C 
- D 1 - I - 0x03726D 1A:B25D: 4A        .byte $4A, $34, $3B, $3B, $36, $5B, $39, $1F, $9E, $70, $5D, $8F, $F0, $74, $F0, $F0, $4E, $7D, $BB, $C5   ; 0D 
- D 1 - I - 0x037281 1A:B271: 79        .byte $79, $56, $5E, $77, $66, $74, $4D, $4F, $B6, $94, $F0, $8F, $81, $B2, $F0, $F0, $7D, $98, $F0, $E9   ; 0E 



off_B285_02_00___3_5_2___normal:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x037295 1A:B285: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $0F, $F0, $F0, $1E, $1E, $11, $11, $75, $4E, $1C, $1C, $3F, $78   ; 00 
- D 1 - I - 0x0372A9 1A:B299: 0E        .byte $0E, $24, $06, $06, $1C, $04, $F0, $26, $F0, $F0, $1F, $36, $29, $29, $7A, $75, $33, $66, $F0, $F0   ; 01 
- D 1 - I - 0x0372BD 1A:B2AD: 1A        .byte $1A, $3C, $1F, $3A, $1C, $11, $3E, $58, $F0, $F0, $82, $69, $34, $36, $98, $98, $7D, $66, $F0, $92   ; 02 
- D 1 - I - 0x0372D1 1A:B2C1: 6C        .byte $6C, $3E, $37, $75, $34, $29, $57, $64, $90, $6E, $B1, $98, $72, $4D, $C7, $C9, $B7, $95, $F0, $F0   ; 03 
- D 1 - I - 0x0372E5 1A:B2D5: 84        .byte $84, $62, $68, $9A, $4B, $59, $87, $AA, $F0, $F0, $BB, $D5, $7D, $A2, $EA, $EA, $A8, $D0, $F0, $F0   ; 04 
- D 1 - I - 0x0372F9 1A:B2E9: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $1D, $F0, $F0, $F0, $F0, $F0, $12, $4F, $73, $41, $41, $3F, $7B   ; 05 
- D 1 - I - 0x03730D 1A:B2FD: 10        .byte $10, $03, $13, $08, $F0, $05, $F0, $28, $F0, $3E, $F0, $2B, $F0, $1E, $73, $45, $F0, $F0, $62, $6F   ; 06 
- D 1 - I - 0x037321 1A:B311: 1B        .byte $1B, $48, $20, $53, $11, $12, $4A, $35, $6C, $63, $68, $81, $2B, $4F, $F0, $F0, $F0, $59, $F0, $F0   ; 07 
- D 1 - I - 0x037335 1A:B325: 3F        .byte $3F, $79, $44, $82, $35, $2A, $7B, $58, $B5, $9E, $BE, $A5, $5A, $73, $F0, $F0, $89, $8A, $F0, $C3   ; 08 
- D 1 - I - 0x037349 1A:B339: 9D        .byte $9D, $62, $68, $A6, $59, $42, $70, $9F, $E6, $CD, $ED, $D6, $72, $A3, $F0, $F0, $B9, $C6, $F0, $F0   ; 09 
- D 1 - I - 0x03735D 1A:B34D: 04        .byte $04, $04, $F0, $F0, $07, $07, $12, $12, $1D, $1D, $F0, $F0, $F0, $14, $72, $76, $1F, $1F, $42, $6F   ; 0A 
- D 1 - I - 0x037371 1A:B361: 05        .byte $05, $1C, $15, $2F, $07, $1F, $2A, $2A, $1C, $33, $F0, $F0, $F0, $38, $F0, $F0, $65, $4F, $6E, $81   ; 0B 
- D 1 - I - 0x037385 1A:B375: 1C        .byte $1C, $31, $21, $47, $12, $1F, $35, $37, $79, $57, $F0, $F0, $5C, $51, $F0, $99, $65, $7E, $94, $94   ; 0C 
- D 1 - I - 0x037399 1A:B389: 6E        .byte $6E, $34, $45, $5D, $2A, $37, $87, $59, $B6, $A0, $74, $8F, $5B, $8C, $F0, $F0, $96, $BB, $C3, $C5   ; 0D 
- D 1 - I - 0x0373AD 1A:B39D: 63        .byte $63, $91, $69, $8F, $5A, $50, $7E, $A1, $B8, $CE, $F0, $F0, $97, $8D, $F0, $F0, $B3, $D3, $E9, $E9   ; 0E 



off_B3B1_02_01___3_5_2___press:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x0373C1 1A:B3B1: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $0F, $F0, $F0, $1E, $1E, $11, $11, $34, $5A, $1C, $1C, $F0, $F0   ; 00 
- D 1 - I - 0x0373D5 1A:B3C5: F0        .byte $F0, $24, $05, $05, $1C, $04, $F0, $1B, $F0, $F0, $29, $36, $F0, $33, $5B, $80, $F0, $F0, $F0, $F0   ; 01 
- D 1 - I - 0x0373E9 1A:B3D9: F0        .byte $F0, $3C, $1D, $43, $1B, $1C, $F0, $3E, $F0, $F0, $F0, $65, $34, $4C, $F0, $7E, $57, $57, $F0, $F0   ; 02 
- D 1 - I - 0x0373FD 1A:B3ED: 6C        .byte $6C, $4A, $36, $72, $33, $28, $F0, $57, $F0, $79, $F0, $89, $59, $70, $F0, $AE, $F0, $F0, $F0, $F0   ; 03 
- D 1 - I - 0x037411 1A:B401: 84        .byte $84, $62, $67, $97, $4B, $59, $F0, $87, $F0, $F0, $F0, $A0, $70, $7D, $D0, $D0, $F0, $91, $F0, $F0   ; 04 
- D 1 - I - 0x037425 1A:B415: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $1D, $F0, $F0, $F0, $F0, $F0, $12, $38, $74, $F0, $1E, $33, $6F   ; 05 
- D 1 - I - 0x037439 1A:B429: 03        .byte $03, $10, $13, $08, $F0, $05, $F0, $28, $F0, $3F, $F0, $2B, $F0, $1E, $F0, $44, $F0, $F0, $F0, $5A   ; 06 
- D 1 - I - 0x03744D 1A:B43D: 55        .byte $55, $1B, $20, $5E, $11, $12, $4B, $35, $F0, $63, $F0, $68, $36, $4F, $F0, $F0, $F0, $59, $F0, $F0   ; 07 
- D 1 - I - 0x037461 1A:B451: 79        .byte $79, $3F, $44, $82, $4D, $5A, $F0, $58, $F0, $9F, $F0, $A4, $F0, $5A, $F0, $F0, $F0, $71, $F0, $F0   ; 08 
- D 1 - I - 0x037475 1A:B465: 9D        .byte $9D, $62, $68, $A6, $4D, $5A, $94, $88, $F0, $B6, $F0, $BD, $8B, $98, $F0, $F0, $F0, $B9, $F0, $F0   ; 09 
- D 1 - I - 0x037489 1A:B479: 04        .byte $04, $04, $F0, $F0, $07, $07, $12, $12, $1D, $1D, $F0, $F0, $F0, $14, $F0, $F0, $1F, $1F, $57, $37   ; 0A 
- D 1 - I - 0x03749D 1A:B48D: 06        .byte $06, $06, $F0, $2F, $07, $1F, $F0, $2B, $1D, $1D, $F0, $F0, $F0, $20, $F0, $F0, $F0, $38, $63, $4C   ; 0B 
- D 1 - I - 0x0374B1 1A:B4A1: 40        .byte $40, $1E, $F0, $47, $1F, $20, $37, $4F, $F0, $59, $F0, $F0, $F0, $45, $F0, $F0, $F0, $5C, $F0, $7E   ; 0C 
- D 1 - I - 0x0374C5 1A:B4B5: 71        .byte $71, $35, $51, $8F, $2B, $38, $4E, $7E, $F0, $96, $F0, $81, $F0, $5B, $F0, $F0, $F0, $F0, $F0, $BB   ; 0D 
- D 1 - I - 0x0374D9 1A:B4C9: 64        .byte $64, $94, $69, $8F, $5A, $50, $8A, $A4, $F0, $AE, $F0, $F0, $F0, $80, $F0, $F0, $F0, $B2, $F0, $D3   ; 0E 



off_B4DD_02_02___3_5_2___counter:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x0374ED 1A:B4DD: F0        .byte $F0, $F0, $07, $07, $04, $04, $F0, $0F, $F0, $F0, $1E, $1E, $11, $11, $7E, $59, $1C, $1C, $56, $7A   ; 00 
- D 1 - I - 0x037501 1A:B4F1: 0D        .byte $0D, $0F, $05, $05, $04, $04, $F0, $26, $F0, $F0, $29, $1F, $1B, $1C, $7C, $80, $33, $36, $F0, $F0   ; 01 
- D 1 - I - 0x037515 1A:B505: 3C        .byte $3C, $19, $13, $39, $03, $10, $1B, $33, $F0, $F0, $43, $69, $35, $1D, $96, $7F, $3E, $4E, $F0, $F0   ; 02 
- D 1 - I - 0x037529 1A:B519: 30        .byte $30, $49, $51, $37, $27, $1D, $3E, $57, $6C, $6E, $74, $A5, $35, $66, $B8, $BB, $F0, $70, $F0, $F0   ; 03 
- D 1 - I - 0x03753D 1A:B52D: 6C        .byte $6C, $56, $5C, $82, $3F, $4D, $85, $6F, $F0, $9C, $97, $BD, $65, $89, $EA, $EA, $93, $AD, $F0, $F0   ; 04 
- D 1 - I - 0x037551 1A:B541: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $1D, $F0, $12, $F0, $F0, $44, $80, $F0, $1E, $4B, $6F   ; 05 
- D 1 - I - 0x037565 1A:B555: 03        .byte $03, $10, $13, $08, $F0, $05, $F0, $28, $F0, $3F, $F0, $2B, $F0, $1E, $73, $69, $F0, $F0, $56, $6F   ; 06 
- D 1 - I - 0x037579 1A:B569: 48        .byte $48, $0F, $14, $53, $05, $06, $1C, $35, $26, $62, $39, $69, $1E, $4F, $F0, $F0, $F0, $59, $F0, $F0   ; 07 
- D 1 - I - 0x03758D 1A:B57D: 61        .byte $61, $32, $39, $6A, $28, $2B, $36, $59, $57, $90, $5C, $9B, $40, $4F, $F0, $9F, $70, $73, $F0, $F0   ; 08 
- D 1 - I - 0x0375A1 1A:B591: 79        .byte $79, $57, $5C, $82, $4E, $35, $59, $88, $B5, $92, $99, $BE, $66, $8B, $F0, $F0, $B9, $A2, $F0, $F0   ; 09 
- D 1 - I - 0x0375B5 1A:B5A5: 04        .byte $04, $04, $F0, $F0, $07, $07, $12, $12, $1D, $1D, $F0, $F0, $F0, $14, $74, $6A, $1F, $1F, $70, $4E   ; 0A 
- D 1 - I - 0x0375C9 1A:B5B9: 06        .byte $06, $06, $14, $16, $07, $07, $1F, $20, $1C, $2A, $F0, $F0, $F0, $39, $F0, $F0, $34, $37, $7C, $7F   ; 0B 
- D 1 - I - 0x0375DD 1A:B5CD: 32        .byte $32, $10, $22, $47, $13, $08, $1E, $36, $62, $40, $F0, $F0, $20, $44, $F0, $99, $59, $51, $7C, $95   ; 0C 
- D 1 - I - 0x0375F1 1A:B5E1: 4A        .byte $4A, $34, $52, $3B, $1E, $2C, $36, $65, $9E, $6F, $74, $8F, $5B, $45, $F0, $F0, $F0, $7E, $B8, $BB   ; 0D 
- D 1 - I - 0x037605 1A:B5F5: 79        .byte $79, $57, $5D, $77, $4E, $44, $66, $8A, $B6, $94, $F0, $B3, $74, $8E, $F0, $F0, $AE, $98, $E9, $E9   ; 0E 



off_B609_03_00___brazil_tactics___normal:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x037619 1A:B609: F0        .byte $F0, $F0, $07, $07, $F0, $F0, $04, $04, $11, $11, $4F, $6A, $1E, $1E, $56, $71, $1C, $1C, $F0, $0F   ; 00 
- D 1 - I - 0x03762D 1A:B61D: F0        .byte $F0, $F0, $07, $1F, $24, $0F, $05, $05, $1C, $1C, $5D, $76, $29, $36, $78, $7C, $F0, $32, $F0, $F0   ; 01 
- D 1 - I - 0x037641 1A:B631: 3C        .byte $3C, $3E, $1F, $3A, $19, $1C, $35, $12, $56, $4C, $5D, $8E, $4E, $8B, $9E, $A2, $F0, $6F, $F0, $F0   ; 02 
- D 1 - I - 0x037655 1A:B645: 6C        .byte $6C, $6E, $44, $75, $3D, $27, $35, $2A, $57, $64, $BD, $9A, $AE, $7E, $C3, $C7, $F0, $F0, $90, $87   ; 03 
- D 1 - I - 0x037669 1A:B659: 84        .byte $84, $6E, $74, $9A, $4C, $57, $65, $4E, $AA, $87, $D6, $D6, $A1, $C7, $E8, $EA, $F0, $F0, $F0, $F0   ; 04 
- D 1 - I - 0x03767D 1A:B66D: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $F0, $51, $6B, $F0, $12, $6F, $74, $F0, $3F, $F0, $F0   ; 05 
- D 1 - I - 0x037691 1A:B681: 03        .byte $03, $10, $13, $08, $F0, $05, $F0, $1E, $F0, $F0, $45, $77, $F0, $2B, $74, $71, $F0, $56, $F0, $28   ; 06 
- D 1 - I - 0x0376A5 1A:B695: 55        .byte $55, $27, $2C, $5E, $1C, $10, $1E, $13, $35, $59, $82, $8F, $4F, $74, $F0, $F0, $F0, $F0, $F0, $4B   ; 07 
- D 1 - I - 0x0376B9 1A:B6A9: 79        .byte $79, $4B, $51, $82, $28, $40, $2B, $42, $59, $5A, $A5, $BE, $73, $80, $F0, $F0, $9E, $A0, $7B, $71   ; 08 
- D 1 - I - 0x0376CD 1A:B6BD: 9D        .byte $9D, $6E, $75, $A6, $4C, $70, $4F, $67, $89, $B9, $ED, $D6, $7E, $B0, $F0, $F0, $F0, $F0, $CD, $9F   ; 09 
- D 1 - I - 0x0376E1 1A:B6D1: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $52, $77, $F0, $1F, $72, $5B, $34, $62, $1D, $1D   ; 0A 
- D 1 - I - 0x0376F5 1A:B6E5: 1C        .byte $1C, $04, $F0, $F0, $06, $12, $14, $2F, $2A, $1F, $F0, $F0, $F0, $38, $7F, $83, $57, $6E, $32, $34   ; 0B 
- D 1 - I - 0x037709 1A:B6F9: 31        .byte $31, $33, $45, $47, $1C, $11, $1F, $16, $36, $4F, $F0, $F0, $F0, $5D, $A1, $A5, $6E, $91, $4D, $7C   ; 0C 
- D 1 - I - 0x03771D 1A:B70D: 32        .byte $32, $6E, $5D, $8F, $40, $29, $38, $2E, $72, $5B, $F0, $F0, $8C, $81, $C4, $C8, $85, $B6, $70, $AD   ; 0D 
- D 1 - I - 0x037731 1A:B721: 91        .byte $91, $6F, $75, $8F, $4C, $65, $5B, $50, $7E, $BC, $F0, $F0, $F0, $F0, $F0, $E9, $AA, $D3, $D0, $A1   ; 0E 



off_B735_03_01___brazil_tactics___press:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x037745 1A:B735: F0        .byte $F0, $F0, $07, $07, $F0, $F0, $04, $04, $11, $11, $21, $37, $1E, $1E, $40, $65, $1C, $1C, $0F, $0F   ; 00 
- D 1 - I - 0x037759 1A:B749: F0        .byte $F0, $F0, $06, $1F, $F0, $0F, $1C, $05, $F0, $1B, $45, $76, $F0, $34, $F0, $F0, $F0, $26, $F0, $F0   ; 01 
- D 1 - I - 0x03776D 1A:B75D: F0        .byte $F0, $3C, $1F, $4F, $25, $1B, $1C, $1D, $F0, $33, $50, $8E, $F0, $4C, $F0, $F0, $F0, $56, $F0, $F0   ; 02 
- D 1 - I - 0x037781 1A:B771: 6C        .byte $6C, $6E, $42, $73, $49, $33, $29, $35, $F0, $64, $80, $BD, $F0, $95, $F0, $F0, $F0, $F0, $F0, $79   ; 03 
- D 1 - I - 0x037795 1A:B785: 84        .byte $84, $6E, $67, $A4, $57, $4C, $65, $4E, $F0, $87, $81, $D6, $A0, $C5, $F0, $F0, $F0, $B5, $F0, $F0   ; 04 
- D 1 - I - 0x0377A9 1A:B799: F0        .byte $F0, $04, $F0, $07, $F0, $F0, $F0, $F0, $F0, $F0, $2D, $5E, $F0, $12, $4B, $5B, $F0, $28, $F0, $1D   ; 05 
- D 1 - I - 0x0377BD 1A:B7AD: 03        .byte $03, $10, $08, $13, $F0, $05, $F0, $1E, $F0, $35, $F0, $51, $F0, $F0, $F0, $66, $F0, $3F, $F0, $F0   ; 06 
- D 1 - I - 0x0377D1 1A:B7C1: 55        .byte $55, $1B, $2B, $5E, $10, $1D, $12, $1E, $35, $36, $F0, $74, $F0, $5B, $F0, $F0, $F0, $6F, $F0, $58   ; 07 
- D 1 - I - 0x0377E5 1A:B7D5: 79        .byte $79, $4B, $50, $82, $34, $41, $42, $37, $59, $72, $F0, $A4, $F0, $8B, $F0, $F0, $F0, $9F, $F0, $7C   ; 08 
- D 1 - I - 0x0377F9 1A:B7E9: 91        .byte $91, $63, $74, $9A, $70, $59, $66, $4E, $F0, $89, $F0, $B0, $F0, $A2, $F0, $F0, $F0, $F0, $F0, $9F   ; 09 
- D 1 - I - 0x03780D 1A:B7FD: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $F0, $F0, $F0, $1F, $33, $65, $29, $2A, $1D, $1D   ; 0A 
- D 1 - I - 0x037821 1A:B811: 1C        .byte $1C, $05, $F0, $F0, $06, $12, $F0, $14, $F0, $1F, $F0, $F0, $F0, $38, $F0, $F0, $41, $64, $F0, $2A   ; 0B 
- D 1 - I - 0x037835 1A:B825: 28        .byte $28, $57, $F0, $47, $1D, $2A, $1F, $2D, $F0, $4F, $F0, $F0, $F0, $F0, $F0, $F0, $F0, $7F, $F0, $4D   ; 0C 
- D 1 - I - 0x037849 1A:B839: 3F        .byte $3F, $6F, $5D, $8F, $4C, $35, $42, $39, $F0, $67, $F0, $F0, $F0, $6A, $F0, $F0, $F0, $AF, $F0, $8A   ; 0D 
- - - - - - 0x03785D 1A:B84D: 63        .byte $63, $87, $75, $8F, $4C, $65, $5A, $50, $7E, $97, $F0, $F0, $F0, $9A, $F0, $F0, $AA, $D3, $F0, $AE   ; 0E 



off_B861_03_02___brazil_tactics___counter:
;                                                01        02        03        04        05        06        07        08        09        10
;                                               /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \      /  \
- D 1 - I - 0x037871 1A:B861: F0        .byte $F0, $F0, $07, $07, $F0, $F0, $04, $04, $11, $11, $69, $3A, $1E, $1E, $49, $71, $1C, $1C, $F0, $0F   ; 00 
- D 1 - I - 0x037885 1A:B875: F0        .byte $F0, $24, $07, $1F, $0F, $1B, $05, $05, $F0, $1C, $76, $46, $29, $36, $7C, $7E, $F0, $F0, $F0, $F0   ; 01 
- D 1 - I - 0x037899 1A:B889: 3C        .byte $3C, $25, $1F, $39, $1B, $10, $1D, $12, $57, $34, $5D, $9B, $36, $4F, $9E, $A2, $F0, $F0, $F0, $3E   ; 02 
- D 1 - I - 0x0378AD 1A:B89D: 30        .byte $30, $49, $2B, $51, $32, $28, $1E, $42, $57, $40, $99, $BE, $59, $7F, $C3, $C7, $F0, $6E, $F0, $F0   ; 03 
- D 1 - I - 0x0378C1 1A:B8B1: 6C        .byte $6C, $55, $5D, $82, $3E, $57, $59, $4F, $9F, $70, $A6, $D6, $7E, $98, $F0, $DC, $F0, $F0, $91, $7A   ; 04 
- D 1 - I - 0x0378D5 1A:B8C5: F0        .byte $F0, $69, $F0, $69, $F0, $F0, $F0, $F0, $F0, $F0, $51, $6B, $F0, $12, $6F, $74, $F0, $3F, $F0, $1D   ; 05 
- D 1 - I - 0x0378E9 1A:B8D9: 03        .byte $03, $10, $08, $13, $F0, $05, $F0, $1E, $F0, $F0, $51, $6B, $F0, $2B, $6F, $74, $F0, $3F, $F0, $28   ; 06 
- D 1 - I - 0x0378FD 1A:B8ED: 55        .byte $55, $0F, $14, $5E, $05, $1D, $06, $12, $35, $36, $39, $69, $2B, $4F, $F0, $F0, $F0, $F0, $F0, $4B   ; 07 
- D 1 - I - 0x037911 1A:B901: 61        .byte $61, $31, $39, $6A, $29, $34, $2A, $37, $4B, $50, $A5, $CA, $66, $80, $F0, $F0, $9E, $95, $7B, $59   ; 08 
- D 1 - I - 0x037925 1A:B915: 79        .byte $79, $56, $5D, $82, $4C, $41, $5A, $4F, $71, $8B, $B0, $D6, $74, $99, $F0, $F0, $F0, $B6, $9D, $7C   ; 09 
- D 1 - I - 0x037939 1A:B929: 04        .byte $04, $04, $F0, $F0, $07, $07, $F0, $F0, $12, $12, $52, $77, $F0, $14, $72, $5B, $63, $1D, $1F, $1F   ; 0A 
- D 1 - I - 0x03794D 1A:B93D: 04        .byte $04, $1C, $F0, $2F, $06, $06, $20, $14, $F0, $2B, $F0, $F0, $F0, $F0, $72, $76, $6E, $58, $34, $1D   ; 0B 
- D 1 - I - 0x037961 1A:B951: 32        .byte $32, $1C, $2E, $47, $11, $1E, $13, $20, $37, $5C, $F0, $F0, $F0, $45, $95, $8B, $7A, $57, $35, $59   ; 0C 
- D 1 - I - 0x037975 1A:B965: 28        .byte $28, $4A, $52, $3B, $1D, $41, $2B, $39, $67, $43, $F0, $F0, $F0, $81, $BB, $BB, $9F, $A1, $59, $7B   ; 0D 
- D 1 - I - 0x037989 1A:B979: 79        .byte $79, $56, $5E, $77, $4C, $5A, $5C, $45, $73, $A4, $F0, $F0, $81, $9A, $F0, $DF, $C4, $96, $93, $7D   ; 0E 


; bzk garbage
- - - - - - 0x03799D 1A:B98D: FF        .byte $FF   ; 


.out .sprintf("Free bytes in bank 9A: 0x%04X [%d]", ($C000 - *), ($C000 - *))



