.segment "BANK_23"
.include "copy_bank_ram.inc"

.export loc_0x03404C
loc_0x03404C:
C D - - - 0x03404C 23:803C: A9 00     LDA #$00
C - - - - 0x03404E 23:803E: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x034051 23:8041: 8D 21 06  STA $0621
C - - - - 0x034054 23:8044: 20 00 C6  JSR sub_0x03D575
C - - - - 0x034057 23:8047: A9 02     LDA #$02
C - - - - 0x034059 23:8049: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x03405C 23:804C: 20 72 8F  JSR sub_8F72
C - - - - 0x03405F 23:804F: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034062 23:8052: D0 06     BNE bra_805A
C - - - - 0x034064 23:8054: 8D 17 06  STA $0617
C - - - - 0x034067 23:8057: 4C 27 81  JMP loc_8127
bra_805A:
C - - - - 0x03406A 23:805A: 20 23 82  JSR sub_8223
C - - - - 0x03406D 23:805D: A9 00     LDA #$00
C - - - - 0x03406F 23:805F: 8D 16 06  STA ram_номер_защитника
C - - - - 0x034072 23:8062: AD E2 00  LDA ram_рандом_2
C - - - - 0x034075 23:8065: 29 07     AND #$07
bra_8067:
C - - - - 0x034077 23:8067: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x03407A 23:806A: 90 05     BCC bra_8071
C - - - - 0x03407C 23:806C: ED 00 06  SBC ram_колво_нападающих
C - - - - 0x03407F 23:806F: B0 F6     BCS bra_8067
bra_8071:
C - - - - 0x034081 23:8071: 8D 17 06  STA $0617
loc_8074:
C D - - - 0x034084 23:8074: AE 17 06  LDX $0617
C - - - - 0x034087 23:8077: 30 08     BMI bra_8081
C - - - - 0x034089 23:8079: EC 16 06  CPX ram_номер_защитника
C - - - - 0x03408C 23:807C: D0 03     BNE bra_8081
C - - - - 0x03408E 23:807E: 20 76 81  JSR sub_8176
bra_8081:
C - - - - 0x034091 23:8081: AE 16 06  LDX ram_номер_защитника
C - - - - 0x034094 23:8084: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x034097 23:8087: C9 06     CMP #$06
C - - - - 0x034099 23:8089: D0 03     BNE bra_808E
C - - - - 0x03409B 23:808B: 4C DC 80  JMP loc_80DC
bra_808E:
C - - - - 0x03409E 23:808E: 8D 3D 04  STA $043D
C - - - - 0x0340A1 23:8091: BC 06 06  LDY $0606,X
C - - - - 0x0340A4 23:8094: 8C 3E 04  STY $043E
C - - - - 0x0340A7 23:8097: C9 00     CMP #$00
C - - - - 0x0340A9 23:8099: D0 10     BNE bra_80AB
C - - - - 0x0340AB 23:809B: C0 01     CPY #$01
C - - - - 0x0340AD 23:809D: D0 0C     BNE bra_80AB
C - - - - 0x0340AF 23:809F: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0340B4 23:80A4: F0 05     BEQ bra_80AB
C - - - - 0x0340B6 23:80A6: A9 00     LDA #$00
C - - - - 0x0340B8 23:80A8: 8D 3E 04  STA $043E
bra_80AB:
C - - - - 0x0340BB 23:80AB: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x0340BE 23:80AE: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x0340C1 23:80B1: A9 07     LDA #$07
C - - - - 0x0340C3 23:80B3: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x0340C6 23:80B6: 20 F3 8F  JSR sub_8FF3
C - - - - 0x0340C9 23:80B9: AE 16 06  LDX ram_номер_защитника
C - - - - 0x0340CC 23:80BC: BD 06 06  LDA $0606,X
C - - - - 0x0340CF 23:80BF: 8D 3E 04  STA $043E
C - - - - 0x0340D2 23:80C2: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0340D5 23:80C5: 0A        ASL
C - - - - 0x0340D6 23:80C6: 0A        ASL
C - - - - 0x0340D7 23:80C7: 6D 3D 04  ADC $043D
C - - - - 0x0340DA 23:80CA: AA        TAX
C - - - - 0x0340DB 23:80CB: 0A        ASL
C - - - - 0x0340DC 23:80CC: 85 3B     STA ram_003B
C - - - - 0x0340DE 23:80CE: A9 00     LDA #$00
C - - - - 0x0340E0 23:80D0: BC 7C 82  LDY tbl_827C,X
C - - - - 0x0340E3 23:80D3: 20 E9 8E  JSR sub_8EE9
C - - - - 0x0340E6 23:80D6: 20 32 81  JSR sub_8132
C - - - - 0x0340E9 23:80D9: 20 4C 81  JSR sub_814C
loc_80DC:
C D - - - 0x0340EC 23:80DC: EE 16 06  INC ram_номер_защитника
C - - - - 0x0340EF 23:80DF: AD 16 06  LDA ram_номер_защитника
C - - - - 0x0340F2 23:80E2: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x0340F5 23:80E5: F0 03     BEQ bra_80EA
C - - - - 0x0340F7 23:80E7: 4C 74 80  JMP loc_8074
bra_80EA:
C - - - - 0x0340FA 23:80EA: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
loc_80ED:
C D - - - 0x0340FD 23:80ED: 20 06 C6  JSR sub_0x03E084
C - - - - 0x034100 23:80F0: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034103 23:80F3: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x034106 23:80F6: FE 80     .word ofs_80FE_00
- D - I - 0x034108 23:80F8: 07 81     .word ofs_8107_01
- D - I - 0x03410A 23:80FA: 18 81     .word ofs_8118_02
- D - I - 0x03410C 23:80FC: 1E 81     .word ofs_811E_03

ofs_80FE_00:
C - J - - 0x03410E 23:80FE: 20 70 81  JSR sub_8170
C - - - - 0x034111 23:8101: A2 50     LDX #$50
C - - - - 0x034113 23:8103: 9A        TXS
C - - - - 0x034114 23:8104: 4C 18 C6  JMP loc_0x03DD0D

ofs_8107_01:
C - J - - 0x034117 23:8107: 20 1E C6  JSR sub_0x03E069
C - - - - 0x03411A 23:810A: A9 0A     LDA #$0A
C - - - - 0x03411C 23:810C: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x03411F 23:810F: 20 70 81  JSR sub_8170
C - - - - 0x034122 23:8112: A2 50     LDX #$50
C - - - - 0x034124 23:8114: 9A        TXS
C - - - - 0x034125 23:8115: 4C 12 C6  JMP loc_0x03DE62

ofs_8118_02:
C - J - - 0x034128 23:8118: A2 50     LDX #$50
C - - - - 0x03412A 23:811A: 9A        TXS
C - - - - 0x03412B 23:811B: 4C 0F C6  JMP loc_0x03E0EF

ofs_811E_03:
C - J - - 0x03412E 23:811E: 20 70 81  JSR sub_8170
C - - - - 0x034131 23:8121: A2 50     LDX #$50
C - - - - 0x034133 23:8123: 9A        TXS
C - - - - 0x034134 23:8124: 4C 21 C6  JMP loc_0x03DFE9

.export loc_0x034137
loc_0x034137:
loc_8127:
C D - - - 0x034137 23:8127: 20 DD 90  JSR sub_90DD
C - - - - 0x03413A 23:812A: A9 00     LDA #$00
C - - - - 0x03413C 23:812C: 8D 17 06  STA $0617
C - - - - 0x03413F 23:812F: 4C ED 80  JMP loc_80ED

sub_8132:
loc_8132:
C D - - - 0x034142 23:8132: 48        PHA
C - - - - 0x034143 23:8133: AD 3D 04  LDA $043D
C - - - - 0x034146 23:8136: 0A        ASL
C - - - - 0x034147 23:8137: 0A        ASL
C - - - - 0x034148 23:8138: AA        TAX
C - - - - 0x034149 23:8139: 68        PLA
C - - - - 0x03414A 23:813A: A0 00     LDY #$00
bra_813C_цикл:
C - - - - 0x03414C 23:813C: DD 8C 82  CMP tbl_828C,X
C - - - - 0x03414F 23:813F: B0 04     BCS bra_8145_запись_результата_рандома_пк
C - - - - 0x034151 23:8141: C8        INY
C - - - - 0x034152 23:8142: E8        INX
C - - - - 0x034153 23:8143: D0 F7     BNE bra_813C_цикл
bra_8145_запись_результата_рандома_пк:
C - - - - 0x034155 23:8145: 4C 48 81  STY ram_флаг_защитника
                                      RTS

sub_814C:
C - - - - 0x03415C 23:814C: 2C 17 06  BIT $0617
C - - - - 0x03415F 23:814F: 30 03     BMI bra_8154
C - - - - 0x034161 23:8151: 20 33 8E  JSR sub_8E33
bra_8154:
C - - - - 0x034164 23:8154: A9 00     LDA #$00
C - - - - 0x034166 23:8156: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034169 23:8159: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03416C 23:815C: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x03416F 23:815F: 69 81     .word ofs_8169_00
- D - I - 0x034171 23:8161: 9C 81     .word ofs_819C_01
- D - I - 0x034173 23:8163: BC 81     .word ofs_81BC_02
- D - I - 0x034175 23:8165: D1 81     .word ofs_81D1_03
- D - I - 0x034177 23:8167: EA 81     .word ofs_81EA_04

ofs_8169_00:
C - J - - 0x034179 23:8169: 20 BA 8B  JSR sub_8BBA
C - - - - 0x03417C 23:816C: 38        SEC
C - - - - 0x03417D 23:816D: 4C 95 90  JMP loc_9095

sub_8170:
C - - - - 0x034180 23:8170: 2C 17 06  BIT $0617
C - - - - 0x034183 23:8173: 10 01     BPL bra_8176
C - - - - 0x034185 23:8175: 60        RTS
bra_8176:
sub_8176:
C - - - - 0x034186 23:8176: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x034189 23:8179: E0 02     CPX #$02
C - - - - 0x03418B 23:817B: F0 1E     BEQ bra_819B_выход
C - - - - 0x03418D 23:817D: A9 00     LDA #$00
C - - - - 0x03418F 23:817F: 8D 2D 06  STA $062D
C - - - - 0x034192 23:8182: BD 78 82  LDA tbl_8278_номер_главной_анимации,X
C - - - - 0x034195 23:8185: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034198 23:8188: AD 44 04  LDA $0444
C - - - - 0x03419B 23:818B: 29 03     AND #$03
C - - - - 0x03419D 23:818D: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x0341A0 23:8190: 20 24 C6  JSR sub_0x03DCEF
C - - - - 0x0341A3 23:8193: AD 17 06  LDA $0617
C - - - - 0x0341A6 23:8196: 09 80     ORA #$80
C - - - - 0x0341A8 23:8198: 8D 17 06  STA $0617
bra_819B_выход:
C - - - - 0x0341AB 23:819B: 60        RTS

ofs_819C_01:
C - J - - 0x0341AC 23:819C: 20 BA 8B  JSR sub_8BBA
C - - - - 0x0341AF 23:819F: 38        SEC
C - - - - 0x0341B0 23:81A0: AD 1C 06  LDA $061C
C - - - - 0x0341B3 23:81A3: ED 19 06  SBC $0619
C - - - - 0x0341B6 23:81A6: AA        TAX
C - - - - 0x0341B7 23:81A7: AD 1D 06  LDA $061D
C - - - - 0x0341BA 23:81AA: E9 00     SBC #$00
C - - - - 0x0341BC 23:81AC: 10 04     BPL bra_81B2
- - - - - 0x0341BE 23:81AE: A2 00     LDX #$00
- - - - - 0x0341C0 23:81B0: A9 00     LDA #$00
bra_81B2:
C - - - - 0x0341C2 23:81B2: 8E 1C 06  STX $061C
C - - - - 0x0341C5 23:81B5: 8D 1D 06  STA $061D
C - - - - 0x0341C8 23:81B8: 38        SEC
C - - - - 0x0341C9 23:81B9: 4C 95 90  JMP loc_9095

loc_81BC:
ofs_81BC_02:
C D - - - 0x0341CC 23:81BC: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0341CF 23:81BF: 18        CLC
C - - - - 0x0341D0 23:81C0: 20 95 90  JSR sub_9095
C - - - - 0x0341D3 23:81C3: A9 00     LDA #$00
C - - - - 0x0341D5 23:81C5: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x0341D8 23:81C8: 20 ED 81  JSR sub_81ED
C - - - - 0x0341DB 23:81CB: A2 50     LDX #$50
C - - - - 0x0341DD 23:81CD: 9A        TXS
C - - - - 0x0341DE 23:81CE: 4C DF 8B  JMP loc_8BDF

ofs_81D1_03:
C - J - - 0x0341E1 23:81D1: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0341E4 23:81D4: 18        CLC
C - - - - 0x0341E5 23:81D5: 20 95 90  JSR sub_9095
C - - - - 0x0341E8 23:81D8: 20 06 C6  JSR sub_0x03E084
C - - - - 0x0341EB 23:81DB: 20 ED 81  JSR sub_81ED
loc_81DE:
C D - - - 0x0341EE 23:81DE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0341F1 23:81E1: 20 6E 8E  JSR sub_8E6E
C - - - - 0x0341F4 23:81E4: A2 50     LDX #$50
C - - - - 0x0341F6 23:81E6: 9A        TXS
C - - - - 0x0341F7 23:81E7: 4C 0F C6  JMP loc_0x03E0EF

sub_81ED:
C - - - - 0x0341FD 23:81ED: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034202 23:81F2: D0 2E     BNE bra_8222_выход
C - - - - 0x034204 23:81F4: AD 3D 04  LDA $043D
C - - - - 0x034209 23:81F9: D0 27     BNE bra_8222_выход
C - - - - 0x03420B 23:81FB: AD 3E 04  LDA $043E
C - - - - 0x03420E 23:81FE: 29 7F     AND #$7F
C - - - - 0x034210 23:8200: C9 01     CMP #$01
C - - - - 0x034212 23:8202: D0 1E     BNE bra_8222_выход
C - - - - 0x034214 23:8204: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034217 23:8207: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x03421A 23:820A: A9 50     LDA #$50
C - - - - 0x03421C 23:820C: 8D 3F 04  STA $043F
C - - - - 0x03421F 23:820F: A9 00     LDA #$00
C - - - - 0x034221 23:8211: 8D 40 04  STA $0440
C - - - - 0x034224 23:8214: 20 FB 8F  JSR sub_8FFB
C - - - - 0x034227 23:8217: A9 00     LDA #$00
C - - - - 0x034229 23:8219: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x03422C 23:821C: A2 50     LDX #$50
C - - - - 0x03422E 23:821E: 9A        TXS
C - - - - 0x03422F 23:821F: 4C DF 8B  JMP loc_8BDF
bra_8222_выход:
C - - - - 0x034232 23:8222: 60        RTS

sub_8223:
C - - - - 0x034233 23:8223: A2 00     LDX #$00
bra_8225:
C - - - - 0x034235 23:8225: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034238 23:8228: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x03423B 23:822B: A0 00     LDY #con_игрок_номер
C - - - - 0x03423D 23:822D: B1 34     LDA (ram_plr_data),Y
; проверка на ишизаки
C - - - - 0x03423F 23:822F: C9 14     CMP #$14
C - - - - 0x034241 23:8231: F0 0B     BEQ bra_823E
; проверка на ишизаки
C - - - - 0x034243 23:8233: C9 49     CMP #$49
C - - - - 0x034245 23:8235: F0 07     BEQ bra_823E
C - - - - 0x034247 23:8237: E8        INX
C - - - - 0x034248 23:8238: EC 00 06  CPX ram_колво_нападающих
C - - - - 0x03424B 23:823B: D0 E8     BNE bra_8225
C - - - - 0x03424D 23:823D: 60        RTS
bra_823E:
C - - - - 0x03424E 23:823E: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034251 23:8241: D0 34     BNE bra_8277_выход
C - - - - 0x034253 23:8243: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x034256 23:8246: D0 2F     BNE bra_8277_выход
C - - - - 0x034258 23:8248: BD 06 06  LDA $0606,X
C - - - - 0x03425B 23:824B: C9 01     CMP #$01
C - - - - 0x03425D 23:824D: D0 28     BNE bra_8277_выход
C - - - - 0x03425F 23:824F: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034262 23:8252: 48        PHA
C - - - - 0x034263 23:8253: AC 00 06  LDY ram_колво_нападающих
C - - - - 0x034266 23:8256: 88        DEY
C - - - - 0x034267 23:8257: B9 01 06  LDA ram_номер_нападающего,Y
C - - - - 0x03426A 23:825A: 9D 01 06  STA ram_номер_нападающего,X
C - - - - 0x03426D 23:825D: B9 0B 06  LDA ram_действие_защиты,Y
C - - - - 0x034270 23:8260: 9D 0B 06  STA ram_действие_защиты,X
C - - - - 0x034273 23:8263: B9 06 06  LDA $0606,Y
C - - - - 0x034276 23:8266: 9D 06 06  STA $0606,X
C - - - - 0x034279 23:8269: A9 01     LDA #$01
C - - - - 0x03427B 23:826B: 99 06 06  STA $0606,Y
C - - - - 0x03427E 23:826E: A9 00     LDA #$00
C - - - - 0x034280 23:8270: 99 0B 06  STA ram_действие_защиты,Y
C - - - - 0x034283 23:8273: 68        PLA
C - - - - 0x034284 23:8274: 99 01 06  STA ram_номер_нападающего,Y
bra_8277_выход:
C - - - - 0x034287 23:8277: 60        RTS

tbl_8278_номер_главной_анимации:
; удар, пас, дриблинг, перепасовка
- D - - - 0x034288 23:8278: 1D        .byte $1D    ; <へ>
- D - - - 0x034289 23:8279: 18        .byte $18    ; <ね>
- - - - - 0x03428A 23:827A: 00        .byte $00
- D - - - 0x03428B 23:827B: 19        .byte $19    ; <の>

tbl_827C:
- D - - - 0x03428C 23:827C: 80        .byte $80
- D - - - 0x03428D 23:827D: 00        .byte $00
- D - - - 0x03428E 23:827E: 00        .byte $00
- - - - - 0x03428F 23:827F: 00        .byte $00
- D - - - 0x034290 23:8280: 00        .byte $00
- D - - - 0x034291 23:8281: 00        .byte $00
- D - - - 0x034292 23:8282: 80        .byte $80
- - - - - 0x034293 23:8283: 00        .byte $00
- D - - - 0x034294 23:8284: 00        .byte $00
- D - - - 0x034295 23:8285: 80        .byte $80
- D - - - 0x034296 23:8286: 00        .byte $00
- - - - - 0x034297 23:8287: 00        .byte $00
- D - - - 0x034298 23:8288: 00        .byte $00
- D - - - 0x034299 23:8289: 00        .byte $00
- D - - - 0x03429A 23:828A: 80        .byte $80
- - - - - 0x03429B 23:828B: 00        .byte $00

tbl_828C:
- D - - - 0x03429C 23:828C: 9A        .byte $9A
- D - - - 0x03429D 23:828D: 60        .byte $60    ; <ミ>
- D - - - 0x03429E 23:828E: 30        .byte $30    ; <ゃ>
- D - - - 0x03429F 23:828F: 00        .byte $00
- D - - - 0x0342A0 23:8290: 9A        .byte $9A
- D - - - 0x0342A1 23:8291: 60        .byte $60    ; <ミ>
- D - - - 0x0342A2 23:8292: 44        .byte $44    ; <エ>
- D - - - 0x0342A3 23:8293: 00        .byte $00
- D - - - 0x0342A4 23:8294: 9A        .byte $9A
- D - - - 0x0342A5 23:8295: 60        .byte $60    ; <ミ>
- D - - - 0x0342A6 23:8296: 44        .byte $44    ; <エ>
- D - - - 0x0342A7 23:8297: 00        .byte $00

loc_8298:
C D - - - 0x0342A8 23:8298: A9 02     LDA #$02
C - - - - 0x0342AA 23:829A: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x0342AD 23:829D: 20 72 8F  JSR sub_8F72
C - - - - 0x0342B0 23:82A0: A9 01     LDA #$01
C - - - - 0x0342B2 23:82A2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0342B5 23:82A5: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x0342B8 23:82A8: D0 0C     BNE bra_82B6
C - - - - 0x0342BA 23:82AA: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x0342BD 23:82AD: 8D 17 06  STA $0617
C - - - - 0x0342C0 23:82B0: 20 DD 90  JSR sub_90DD
C - - - - 0x0342C3 23:82B3: 4C F5 83  JMP loc_83F5
bra_82B6:
C - - - - 0x0342C6 23:82B6: A9 00     LDA #$00
C - - - - 0x0342C8 23:82B8: 8D 16 06  STA ram_номер_защитника
bra_82BB:
C - - - - 0x0342CB 23:82BB: AE 16 06  LDX ram_номер_защитника
C - - - - 0x0342CE 23:82BE: BC 0B 06  LDY ram_действие_защиты,X
C - - - - 0x0342D1 23:82C1: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x0342D4 23:82C4: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x0342D7 23:82C7: F0 08     BEQ bra_82D1
C - - - - 0x0342D9 23:82C9: C9 0B     CMP #$0B
C - - - - 0x0342DB 23:82CB: F0 04     BEQ bra_82D1
C - - - - 0x0342DD 23:82CD: C0 06     CPY #$06
C - - - - 0x0342DF 23:82CF: F0 13     BEQ bra_82E4
bra_82D1:
C - - - - 0x0342E1 23:82D1: 8C 3D 04  STY $043D
C - - - - 0x0342E4 23:82D4: BD 06 06  LDA $0606,X
C - - - - 0x0342E7 23:82D7: 8D 3E 04  STA $043E
C - - - - 0x0342EA 23:82DA: A9 02     LDA #$02
C - - - - 0x0342EC 23:82DC: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0342EF 23:82DF: A9 14     LDA #$14
C - - - - 0x0342F1 23:82E1: 20 15 C5  JSR sub_0x03CB1F
bra_82E4:
C - - - - 0x0342F4 23:82E4: EE 16 06  INC ram_номер_защитника
C - - - - 0x0342F7 23:82E7: AD 16 06  LDA ram_номер_защитника
C - - - - 0x0342FA 23:82EA: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x0342FD 23:82ED: D0 CC     BNE bra_82BB
C - - - - 0x0342FF 23:82EF: A9 04     LDA #$04
C - - - - 0x034301 23:82F1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034304 23:82F4: A9 00     LDA #$00
C - - - - 0x034306 23:82F6: 8D 16 06  STA ram_номер_защитника
C - - - - 0x034309 23:82F9: 8D 17 06  STA $0617
loc_82FC:
C D - - - 0x03430C 23:82FC: A9 01     LDA #$01
C - - - - 0x03430E 23:82FE: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x034311 23:8301: A9 00     LDA #$00
C - - - - 0x034313 23:8303: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x034316 23:8306: AE 16 06  LDX ram_номер_защитника
C - - - - 0x034319 23:8309: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x03431C 23:830C: 8D 3D 04  STA $043D
C - - - - 0x03431F 23:830F: BD 06 06  LDA $0606,X
C - - - - 0x034322 23:8312: 8D 3E 04  STA $043E
C - - - - 0x034325 23:8315: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034328 23:8318: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x03432B 23:831B: F0 04     BEQ bra_8321
C - - - - 0x03432D 23:831D: C9 0B     CMP #$0B
C - - - - 0x03432F 23:831F: D0 12     BNE bra_8333
bra_8321:
C - - - - 0x034331 23:8321: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x034334 23:8324: C9 04     CMP #$04
C - - - - 0x034336 23:8326: D0 03     BNE bra_832B
C - - - - 0x034338 23:8328: 4C A2 83  JMP loc_83A2
bra_832B:
C - - - - 0x03433B 23:832B: A9 08     LDA #$08
C - - - - 0x03433D 23:832D: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034340 23:8330: 4C 49 83  JMP loc_8349
bra_8333:
C - - - - 0x034343 23:8333: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x034346 23:8336: C9 06     CMP #$06
C - - - - 0x034348 23:8338: D0 03     BNE bra_833D
C - - - - 0x03434A 23:833A: 4C A2 83  JMP loc_83A2
bra_833D:
C - - - - 0x03434D 23:833D: C9 05     CMP #$05
C - - - - 0x03434F 23:833F: D0 03     BNE bra_8344
C - - - - 0x034351 23:8341: 4C A2 83  JMP loc_83A2
bra_8344:
C - - - - 0x034354 23:8344: A9 07     LDA #$07
C - - - - 0x034356 23:8346: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
loc_8349:
C D - - - 0x034359 23:8349: 20 F3 8F  JSR sub_8FF3
C - - - - 0x03435C 23:834C: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x03435F 23:834F: BD D7 83  LDA tbl_83D7,X
C - - - - 0x034362 23:8352: 0A        ASL
C - - - - 0x034363 23:8353: 0A        ASL
C - - - - 0x034364 23:8354: 85 3B     STA ram_003B
C - - - - 0x034366 23:8356: AE 3D 04  LDX $043D
C - - - - 0x034369 23:8359: A9 02     LDA #$02
C - - - - 0x03436B 23:835B: AC 42 04  LDY ram_игрок_без_мяча
C - - - - 0x03436E 23:835E: F0 07     BEQ bra_8367
C - - - - 0x034370 23:8360: C0 0B     CPY #$0B
C - - - - 0x034372 23:8362: F0 03     BEQ bra_8367
C - - - - 0x034374 23:8364: BD DD 83  LDA tbl_83DD,X
bra_8367:
C - - - - 0x034377 23:8367: 18        CLC
C - - - - 0x034378 23:8368: 65 3B     ADC ram_003B
C - - - - 0x03437A 23:836A: AA        TAX
C - - - - 0x03437B 23:836B: 0A        ASL
C - - - - 0x03437C 23:836C: 85 3B     STA ram_003B
C - - - - 0x03437E 23:836E: A9 01     LDA #$01
C - - - - 0x034380 23:8370: BC E1 83  LDY tbl_83E1,X
C - - - - 0x034383 23:8373: 20 E9 8E  JSR sub_8EE9
bra_8376:
C - - - - 0x034386 23:8376: DD F1 83  CMP tbl_83F1,X
C - - - - 0x034389 23:8379: B0 04     BCS bra_837F
C - - - - 0x03438B 23:837B: E8        INX
C - - - - 0x03438C 23:837C: C8        INY
C - - - - 0x03438D 23:837D: D0 F7     BNE bra_8376
bra_837F:
C - - - - 0x03438F 23:837F: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034392 23:8382: 20 33 8E  JSR sub_8E33
C - - - - 0x034395 23:8385: A9 06     LDA #$06
C - - - - 0x034397 23:8387: A2 01     LDX #$01
C - - - - 0x034399 23:8389: AC 12 06  LDY ram_флаг_защитника
C - - - - 0x03439C 23:838C: C0 02     CPY #$02
C - - - - 0x03439E 23:838E: 90 03     BCC bra_8393
C - - - - 0x0343A0 23:8390: CA        DEX
C - - - - 0x0343A1 23:8391: A9 05     LDA #$05
bra_8393:
C - - - - 0x0343A3 23:8393: 48        PHA
C - - - - 0x0343A4 23:8394: 8A        TXA
C - - - - 0x0343A5 23:8395: 4A        LSR
C - - - - 0x0343A6 23:8396: 20 95 90  JSR sub_9095
C - - - - 0x0343A9 23:8399: 68        PLA
C - - - - 0x0343AA 23:839A: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0343AD 23:839D: A9 07     LDA #$07
C - - - - 0x0343AF 23:839F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_83A2:
C D - - - 0x0343B2 23:83A2: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0343B5 23:83A5: C9 03     CMP #$03
C - - - - 0x0343B7 23:83A7: B0 13     BCS bra_83BC
C - - - - 0x0343B9 23:83A9: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0343BC 23:83AC: F0 04     BEQ bra_83B2
C - - - - 0x0343BE 23:83AE: C9 0B     CMP #$0B
C - - - - 0x0343C0 23:83B0: D0 0A     BNE bra_83BC
bra_83B2:
C - - - - 0x0343C2 23:83B2: AD 3D 04  LDA $043D
C - - - - 0x0343C5 23:83B5: C9 03     CMP #$03
C - - - - 0x0343C7 23:83B7: D0 03     BNE bra_83BC
C - - - - 0x0343C9 23:83B9: EE 17 06  INC $0617
bra_83BC:
C - - - - 0x0343CC 23:83BC: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0343CF 23:83BF: C9 02     CMP #$02
C - - - - 0x0343D1 23:83C1: B0 11     BCS bra_83D4
C - - - - 0x0343D3 23:83C3: EE 16 06  INC ram_номер_защитника
C - - - - 0x0343D6 23:83C6: AD 16 06  LDA ram_номер_защитника
C - - - - 0x0343D9 23:83C9: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x0343DC 23:83CC: F0 03     BEQ bra_83D1
C - - - - 0x0343DE 23:83CE: 4C FC 82  JMP loc_82FC
bra_83D1:
C - - - - 0x0343E1 23:83D1: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_83D4:
C - - - - 0x0343E4 23:83D4: 4C F5 83  JMP loc_83F5

tbl_83D7:
- D - - - 0x0343E7 23:83D7: 02        .byte $02    ; <い>
- D - - - 0x0343E8 23:83D8: 00        .byte $00
- - - - - 0x0343E9 23:83D9: 00        .byte $00
- - - - - 0x0343EA 23:83DA: 00        .byte $00
- D - - - 0x0343EB 23:83DB: 01        .byte $01    ; <あ>
- D - - - 0x0343EC 23:83DC: 03        .byte $03    ; <う>

tbl_83DD:
- - - - - 0x0343ED 23:83DD: 00        .byte $00
- - - - - 0x0343EE 23:83DE: 00        .byte $00
- D - - - 0x0343EF 23:83DF: 00        .byte $00
- D - - - 0x0343F0 23:83E0: 01        .byte $01    ; <あ>

tbl_83E1:
- D - - - 0x0343F1 23:83E1: 80        .byte $80
- D - - - 0x0343F2 23:83E2: 00        .byte $00
- D - - - 0x0343F3 23:83E3: 00        .byte $00
- - - - - 0x0343F4 23:83E4: 00        .byte $00
- D - - - 0x0343F5 23:83E5: 00        .byte $00
- D - - - 0x0343F6 23:83E6: 00        .byte $00
- D - - - 0x0343F7 23:83E7: 80        .byte $80
- - - - - 0x0343F8 23:83E8: 00        .byte $00
- D - - - 0x0343F9 23:83E9: 00        .byte $00
- D - - - 0x0343FA 23:83EA: 80        .byte $80
- D - - - 0x0343FB 23:83EB: 80        .byte $80
- - - - - 0x0343FC 23:83EC: 00        .byte $00
- D - - - 0x0343FD 23:83ED: 00        .byte $00
- D - - - 0x0343FE 23:83EE: 00        .byte $00
- D - - - 0x0343FF 23:83EF: 00        .byte $00
- - - - - 0x034400 23:83F0: 00        .byte $00

tbl_83F1:
- D - - - 0x034401 23:83F1: A0        .byte $A0    ; <が>
- D - - - 0x034402 23:83F2: 60        .byte $60    ; <ミ>
- D - - - 0x034403 23:83F3: 40        .byte $40    ; <「>
- D - - - 0x034404 23:83F4: 00        .byte $00

loc_83F5:
C D - - - 0x034405 23:83F5: 20 06 C6  JSR sub_0x03E084
C - - - - 0x034408 23:83F8: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03440B 23:83FB: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x03440E 23:83FE: 08 84     .word ofs_8408_00_01
- D - I - 0x034410 23:8400: 08 84     .word ofs_8408_00_01
- D - I - 0x034412 23:8402: 3F 84     .word ofs_843F_02
- D - I - 0x034414 23:8404: 4B 84     .word ofs_844B_03
- D - I - 0x034416 23:8406: 7C 84     .word ofs_847C_04

ofs_8408_00_01:
C - J - - 0x034418 23:8408: 20 BA 8B  JSR sub_8BBA
C - - - - 0x03441B 23:840B: A9 08     LDA #$08
C - - - - 0x03441D 23:840D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034420 23:8410: 38        SEC
C - - - - 0x034421 23:8411: 20 95 90  JSR sub_9095
C - - - - 0x034424 23:8414: 20 7F 84  JSR sub_847F
C - - - - 0x034427 23:8417: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x03442A 23:841A: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x03442D 23:841D: 29 84     .word ofs_8429_00
- D - I - 0x03442F 23:841F: 12 C6     .word ofs_0x03DE62
- - - - - 0x034431 23:8421: 3C 84     .word $0000
- - - - - 0x034433 23:8423: 3C 84     .word $0000
- D - I - 0x034435 23:8425: 27 C6     .word ofs_0x03E55C
- D - I - 0x034437 23:8427: 2A C6     .word ofs_0x03E5A6

ofs_8429_00:
C - J - - 0x034439 23:8429: AD 17 06  LDA $0617
C - - - - 0x03443C 23:842C: D0 08     BNE bra_8436
C - - - - 0x03443E 23:842E: A9 00     LDA #$00
C - - - - 0x034440 23:8430: 8D 21 06  STA $0621
C - - - - 0x034443 23:8433: 4C 18 C6  JMP loc_0x03DD0D
bra_8436:
C - - - - 0x034446 23:8436: A2 50     LDX #$50
C - - - - 0x034448 23:8438: 9A        TXS
C - - - - 0x034449 23:8439: 4C F3 88  JMP loc_88F3

ofs_843F_02:
C - J - - 0x03444F 23:843F: 20 C8 8B  JSR sub_8BC8
C - - - - 0x034452 23:8442: 20 7F 84  JSR sub_847F
C - - - - 0x034455 23:8445: A2 50     LDX #$50
C - - - - 0x034457 23:8447: 9A        TXS
C - - - - 0x034458 23:8448: 4C DF 8B  JMP loc_8BDF

ofs_844B_03:
C - J - - 0x03445B 23:844B: 20 C8 8B  JSR sub_8BC8
C - - - - 0x03445E 23:844E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034461 23:8451: F0 1D     BEQ bra_8470
C - - - - 0x034463 23:8453: C9 0B     CMP #$0B
C - - - - 0x034465 23:8455: F0 19     BEQ bra_8470
C - - - - 0x034467 23:8457: AE 3D 04  LDX $043D
C - - - - 0x03446A 23:845A: E0 02     CPX #$02
C - - - - 0x03446C 23:845C: D0 0C     BNE bra_846A
C - - - - 0x03446E 23:845E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034471 23:8461: 20 6E 8E  JSR sub_8E6E
C - - - - 0x034474 23:8464: A2 50     LDX #$50
C - - - - 0x034476 23:8466: 9A        TXS
C - - - - 0x034477 23:8467: 4C 0F C6  JMP loc_0x03E0EF
bra_846A:
C - - - - 0x03447A 23:846A: A2 50     LDX #$50
C - - - - 0x03447C 23:846C: 9A        TXS
C - - - - 0x03447D 23:846D: 4C 30 C6  JMP loc_0x03E688
bra_8470:
C - - - - 0x034480 23:8470: 8D FB 05  STA ram_команда_с_мячом
C - - - - 0x034483 23:8473: 20 6E 8E  JSR sub_8E6E
C - - - - 0x034486 23:8476: A2 50     LDX #$50
C - - - - 0x034488 23:8478: 9A        TXS
C - - - - 0x034489 23:8479: 4C 33 C6  JMP loc_0x03DE0D

sub_847F:
C - - - - 0x03448F 23:847F: AD 17 06  LDA $0617
C - - - - 0x034492 23:8482: D0 01     BNE bra_8485
C - - - - 0x034494 23:8484: 60        RTS
bra_8485:
sub_8485:
C - - - - 0x034495 23:8485: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x034498 23:8488: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x03449A 23:848A: A9 06     LDA #$06
C - - - - 0x03449C 23:848C: 91 34     STA (ram_plr_data),Y
C - - - - 0x03449E 23:848E: 60        RTS

sub_848F:
C - - - - 0x03449F 23:848F: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x0344A2 23:8492: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x0344A4 23:8494: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0344A6 23:8496: D0 56     BNE bra_84EE_выход
C - - - - 0x0344A8 23:8498: AD 35 06  LDA $0635
C - - - - 0x0344AB 23:849B: 10 05     BPL bra_84A2
C - - - - 0x0344AD 23:849D: 49 FF     EOR #$FF
C - - - - 0x0344AF 23:849F: 18        CLC
C - - - - 0x0344B0 23:84A0: 69 01     ADC #$01
bra_84A2:
C - - - - 0x0344B2 23:84A2: AA        TAX
C - - - - 0x0344B3 23:84A3: AD 37 06  LDA $0637
C - - - - 0x0344B6 23:84A6: 10 05     BPL bra_84AD
C - - - - 0x0344B8 23:84A8: 49 FF     EOR #$FF
C - - - - 0x0344BA 23:84AA: 18        CLC
C - - - - 0x0344BB 23:84AB: 69 01     ADC #$01
bra_84AD:
C - - - - 0x0344BD 23:84AD: A8        TAY
C - - - - 0x0344BE 23:84AE: 20 39 C5  JSR sub_0x03CDF2
C - - - - 0x0344C1 23:84B1: A2 08     LDX #$08
bra_84B3:
C - - - - 0x0344C3 23:84B3: DD EF 84  CMP tbl_84EF,X
C - - - - 0x0344C6 23:84B6: F0 05     BEQ bra_84BD
C - - - - 0x0344C8 23:84B8: CA        DEX
C - - - - 0x0344C9 23:84B9: 10 F8     BPL bra_84B3
C - - - - 0x0344CB 23:84BB: 30 31     BMI bra_84EE_выход
bra_84BD:
C - - - - 0x0344CD 23:84BD: A9 33     LDA #$33
C - - - - 0x0344CF 23:84BF: E0 06     CPX #$06
C - - - - 0x0344D1 23:84C1: 90 02     BCC bra_84C5
C - - - - 0x0344D3 23:84C3: A9 55     LDA #$55
bra_84C5:
C - - - - 0x0344D5 23:84C5: CD E2 00  CMP ram_рандом_2
C - - - - 0x0344D8 23:84C8: 90 24     BCC bra_84EE_выход
C - - - - 0x0344DA 23:84CA: AE 00 06  LDX ram_колво_нападающих
C - - - - 0x0344DD 23:84CD: E0 05     CPX #$05
C - - - - 0x0344DF 23:84CF: B0 1D     BCS bra_84EE_выход
C - - - - 0x0344E1 23:84D1: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0344E4 23:84D4: F0 04     BEQ bra_84DA
C - - - - 0x0344E6 23:84D6: E0 04     CPX #$04
C - - - - 0x0344E8 23:84D8: B0 14     BCS bra_84EE_выход
bra_84DA:
C - - - - 0x0344EA 23:84DA: BD 00 06  LDA ram_колво_нападающих,X
C - - - - 0x0344ED 23:84DD: 9D 01 06  STA ram_номер_нападающего,X
C - - - - 0x0344F0 23:84E0: CA        DEX
C - - - - 0x0344F1 23:84E1: 10 F7     BPL bra_84DA
C - - - - 0x0344F3 23:84E3: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0344F6 23:84E6: 49 0B     EOR #$0B
C - - - - 0x0344F8 23:84E8: 8D 01 06  STA ram_номер_нападающего
C - - - - 0x0344FB 23:84EB: EE 00 06  INC ram_колво_нападающих
bra_84EE_выход:
C - - - - 0x0344FE 23:84EE: 60        RTS

tbl_84EF:
- D - - - 0x0344FF 23:84EF: 03        .byte $03    ; <う>
- D - - - 0x034500 23:84F0: 0F        .byte $0F    ; <そ>
- D - - - 0x034501 23:84F1: 1B        .byte $1B    ; <ひ>
- D - - - 0x034502 23:84F2: 10        .byte $10    ; <た>
- D - - - 0x034503 23:84F3: 1C        .byte $1C    ; <ふ>
- D - - - 0x034504 23:84F4: 1D        .byte $1D    ; <へ>
- D - - - 0x034505 23:84F5: 04        .byte $04    ; <え>
- D - - - 0x034506 23:84F6: 05        .byte $05    ; <お>
- D - - - 0x034507 23:84F7: 11        .byte $11    ; <ち>

.export loc_0x034508
loc_0x034508:
C D - - - 0x034508 23:84F8: A9 01     LDA #$01
C - - - - 0x03450A 23:84FA: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x03450D 23:84FD: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034510 23:8500: 08        PHP
C - - - - 0x034511 23:8501: 49 0B     EOR #$0B
C - - - - 0x034513 23:8503: 8D 01 06  STA ram_номер_нападающего
C - - - - 0x034516 23:8506: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x034519 23:8509: 28        PLP
C - - - - 0x03451A 23:850A: D0 08     BNE bra_8514
C - - - - 0x03451C 23:850C: A9 02     LDA #$02
C - - - - 0x03451E 23:850E: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034521 23:8511: 4C 2F 85  JMP loc_852F
bra_8514:
C - - - - 0x034524 23:8514: A9 14     LDA #$14
C - - - - 0x034526 23:8516: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x034529 23:8519: A9 00     LDA #$00
C - - - - 0x03452B 23:851B: 85 11     STA ram_0011
C - - - - 0x03452D 23:851D: 85 12     STA ram_0012
C - - - - 0x03452F 23:851F: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - 0x034532 23:8522: A9 32     LDA #$32
C - - - - 0x034534 23:8524: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034537 23:8527: A9 04     LDA #$04
C - - - - 0x034539 23:8529: 8D 21 06  STA $0621
C - - - - 0x03453C 23:852C: 20 00 C6  JSR sub_0x03D575
loc_852F:
C D - - - 0x03453F 23:852F: A9 08     LDA #$08
C - - - - 0x034541 23:8531: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034544 23:8534: 20 F3 8F  JSR sub_8FF3
C - - - - 0x034547 23:8537: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x03454A 23:853A: A2 F3     LDX #$F3
C - - - - 0x03454C 23:853C: A0 00     LDY #con_игрок_номер
C - - - - 0x03454E 23:853E: B1 34     LDA (ram_plr_data),Y
; проверка на вакабаяши
C - - - - 0x034550 23:8540: C9 21     CMP #$21
C - - - - 0x034552 23:8542: F0 04     BEQ bra_8548
; проверка на вакабаяши
C - - - - 0x034554 23:8544: C9 40     CMP #$40
C - - - - 0x034556 23:8546: D0 02     BNE bra_854A
bra_8548:
C - - - - 0x034558 23:8548: A2 CD     LDX #$CD
bra_854A:
C - - - - 0x03455A 23:854A: A9 00     LDA #$00
; шанс крита кабаяши
C - - - - 0x03455C 23:854C: EC E2 00  CPX ram_рандом_2
C - - - - 0x03455F 23:854F: B0 02     BCS bra_8553
C - - - - 0x034561 23:8551: A9 80     LDA #$80
bra_8553:
C - - - - 0x034563 23:8553: A2 00     LDX #$00
C - - - - 0x034565 23:8555: 86 3B     STX ram_003B
C - - - - 0x034567 23:8557: AA        TAX
C - - - - 0x034568 23:8558: 08        PHP
C - - - - 0x034569 23:8559: A9 03     LDA #$03
C - - - - 0x03456B 23:855B: 28        PLP
C - - - - 0x03456C 23:855C: 20 1F 8F  JSR sub_8F1F
C - - - - 0x03456F 23:855F: A0 00     LDY #$00
bra_8561:
C - - - - 0x034571 23:8561: D9 B9 86  CMP tbl_86B9,Y
C - - - - 0x034574 23:8564: B0 05     BCS bra_856B
C - - - - 0x034576 23:8566: F0 03     BEQ bra_856B
C - - - - 0x034578 23:8568: C8        INY
C - - - - 0x034579 23:8569: D0 F6     BNE bra_8561
bra_856B:
C - - - - 0x03457B 23:856B: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x03457E 23:856E: D0 21     BNE bra_8591
C - - - - 0x034580 23:8570: AE 2B 00  LDX ram_команда_соперника
C - - - - 0x034583 23:8573: E0 05     CPX #$05
C - - - - 0x034585 23:8575: D0 1A     BNE bra_8591
C - - - - 0x034587 23:8577: AE 46 04  LDX ram_флаг_драйв_оверхеда
C - - - - 0x03458A 23:857A: F0 15     BEQ bra_8591
C - - - - 0x03458C 23:857C: AD 3C 04  LDA ram_подтип_действия
C - - - - 0x03458F 23:857F: F0 10     BEQ bra_8591
C - - - - 0x034591 23:8581: C9 03     CMP #$03
C - - - - 0x034593 23:8583: F0 04     BEQ bra_8589
C - - - - 0x034595 23:8585: E0 04     CPX #$04
C - - - - 0x034597 23:8587: B0 08     BCS bra_8591
bra_8589:
C - - - - 0x034599 23:8589: A0 02     LDY #$02
C - - - - 0x03459B 23:858B: 2C E2 00  BIT ram_рандом_2
C - - - - 0x03459E 23:858E: 10 01     BPL bra_8591
C - - - - 0x0345A0 23:8590: C8        INY
bra_8591:
C - - - - 0x0345A1 23:8591: 20 48 81  STY ram_флаг_защитника
C - - - - 0x0345A4 23:8594: A9 00     LDA #$00
C - - - - 0x0345A6 23:8596: 8D 16 06  STA ram_номер_защитника
C - - - - 0x0345A9 23:8599: A9 09     LDA #$09
C - - - - 0x0345AB 23:859B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0345AE 23:859E: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0345B1 23:85A1: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0345B4 23:85A4: AC 85     .word ofs_85AC_00
- D - I - 0x0345B6 23:85A6: 05 86     .word ofs_8605_01
- D - I - 0x0345B8 23:85A8: 1C 86     .word ofs_861C_02
- D - I - 0x0345BA 23:85AA: 46 86     .word ofs_8646_03

bra_85AC:
loc_85AC:
ofs_85AC_00:
.export sub_0x0345BC
sub_0x0345BC:
C D J - - 0x0345BC 23:85AC: A2 00     LDX #$00
C - - - - 0x0345BE 23:85AE: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0345C1 23:85B1: 20 D4 8B  JSR sub_8BD4
C - - - - 0x0345C4 23:85B4: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - 0x0345C7 23:85B7: A9 30     LDA #$30
C - - - - 0x0345C9 23:85B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_85BC:
C D - - - 0x0345CC 23:85BC: 20 7B 98  JSR sub_987B
C - - - - 0x0345CF 23:85BF: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0345D2 23:85C2: 49 0B     EOR #$0B
C - - - - 0x0345D4 23:85C4: 8D FB 05  STA ram_команда_с_мячом
C - - - - 0x0345D7 23:85C7: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0345DA 23:85CA: A9 00     LDA #$00
C - - - - 0x0345DC 23:85CC: A0 05     LDY #con_игрок_координата_X_lo
C - - - - 0x0345DE 23:85CE: 91 34     STA (ram_plr_data),Y
C - - - - 0x0345E0 23:85D0: A0 07     LDY #con_игрок_координата_Y_lo
C - - - - 0x0345E2 23:85D2: 91 34     STA (ram_plr_data),Y
C - - - - 0x0345E4 23:85D4: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x0345E6 23:85D6: 91 34     STA (ram_plr_data),Y
C - - - - 0x0345E8 23:85D8: A9 04     LDA #$04
C - - - - 0x0345EA 23:85DA: 8D 29 06  STA ram_флаг_разводки
C - - - - 0x0345ED 23:85DD: A2 50     LDX #$50
C - - - - 0x0345EF 23:85DF: 9A        TXS
C - - - - 0x0345F0 23:85E0: 4C 36 C6  JMP loc_0x03DABA

sub_85E3_увеличить_счетчик_голов:
C - - - - 0x0345F3 23:85E3: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x0345F6 23:85E6: F0 05     BEQ bra_85ED_команда_слева
C - - - - 0x0345F8 23:85E8: 20 4E 90  JSR sub_904E
C - - - - 0x0345FB 23:85EB: A2 01     LDX #$01
bra_85ED_команда_слева:
C - - - - 0x0345FD 23:85ED: FE 28 00  INC ram_голы,X
C - - - - 0x034600 23:85F0: A9 01     LDA #$01      ; team_names_and_score 
C - - - - 0x034602 23:85F2: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x034605 23:85F5: 60        RTS

sub_85F6_выбор_мелодии_команды:
C - - - - 0x034606 23:85F6: 2C 3E 06  BIT ram_флаг_loss
C - - - - 0x034609 23:85F9: 10 06     BPL bra_8601_сейчас_не_loss
; музыка добавочного времени
C - - - - 0x03460B 23:85FB: A9 32     LDA #$32
C - - - - 0x03460D 23:85FD: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - 0x034610 23:8600: 60        RTS
bra_8601_сейчас_не_loss:
C - - - - 0x034611 23:8601: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
C - - - - 0x034614 23:8604: 60        RTS

ofs_8605_01:
C - J - - 0x034615 23:8605: AD 3C 04  LDA ram_подтип_действия
C - - - - 0x034618 23:8608: 29 3F     AND #$3F
C - - - - 0x03461A 23:860A: C9 03     CMP #$03
C - - - - 0x03461C 23:860C: 90 9E     BCC bra_85AC
C - - - - 0x03461E 23:860E: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034621 23:8611: 49 0B     EOR #$0B
C - - - - 0x034623 23:8613: 8D FB 05  STA ram_команда_с_мячом
C - - - - 0x034626 23:8616: A2 50     LDX #$50
C - - - - 0x034628 23:8618: 9A        TXS
C - - - - 0x034629 23:8619: 4C 33 C6  JMP loc_0x03DE0D

ofs_861C_02:
C - J - - 0x03462C 23:861C: 20 C8 8B  JSR sub_8BC8
C - - - - 0x03462F 23:861F: A9 00     LDA #$00
C - - - - 0x034631 23:8621: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x034634 23:8624: 20 D3 86  JSR sub_86D3
C - - - - 0x034637 23:8627: 20 BD 86  JSR sub_86BD
C - - - - 0x03463A 23:862A: AD 16 06  LDA ram_номер_защитника
C - - - - 0x03463D 23:862D: F0 11     BEQ bra_8640
C - - - - 0x03463F 23:862F: A9 B0     LDA #$B0
C - - - - 0x034641 23:8631: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x034644 23:8634: F0 02     BEQ bra_8638
C - - - - 0x034646 23:8636: A9 50     LDA #$50
bra_8638:
C - - - - 0x034648 23:8638: 8D 35 06  STA $0635
C - - - - 0x03464B 23:863B: A9 80     LDA #$80
C - - - - 0x03464D 23:863D: 8D 37 06  STA $0637
bra_8640:
C - - - - 0x034650 23:8640: A2 50     LDX #$50
C - - - - 0x034652 23:8642: 9A        TXS
C - - - - 0x034653 23:8643: 4C DF 8B  JMP loc_8BDF

ofs_8646_03:
C - J - - 0x034656 23:8646: 20 C8 8B  JSR sub_8BC8
C - - - - 0x034659 23:8649: 20 BD 86  JSR sub_86BD
C - - - - 0x03465C 23:864C: AD 3D 04  LDA $043D
C - - - - 0x03465F 23:864F: C9 01     CMP #$01
C - - - - 0x034661 23:8651: F0 0E     BEQ bra_8661
C - - - - 0x034663 23:8653: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034666 23:8656: 49 0B     EOR #$0B
C - - - - 0x034668 23:8658: 20 6E 8E  JSR sub_8E6E
C - - - - 0x03466B 23:865B: A2 50     LDX #$50
C - - - - 0x03466D 23:865D: 9A        TXS
C - - - - 0x03466E 23:865E: 4C 33 C6  JMP loc_0x03DE0D
bra_8661:
C - - - - 0x034671 23:8661: AD E2 00  LDA ram_рандом_2
C - - - - 0x034674 23:8664: 29 07     AND #$07
C - - - - 0x034676 23:8666: AC FB 05  LDY ram_команда_с_мячом
C - - - - 0x034679 23:8669: D0 02     BNE bra_866D
C - - - - 0x03467B 23:866B: 49 07     EOR #$07
bra_866D:
C - - - - 0x03467D 23:866D: AA        TAX
C - - - - 0x03467E 23:866E: 0A        ASL
C - - - - 0x03467F 23:866F: 0A        ASL
C - - - - 0x034680 23:8670: 0A        ASL
C - - - - 0x034681 23:8671: 85 3A     STA ram_003A
C - - - - 0x034683 23:8673: A9 30     LDA #$30
C - - - - 0x034685 23:8675: AC FB 05  LDY ram_команда_с_мячом
C - - - - 0x034688 23:8678: D0 02     BNE bra_867C
C - - - - 0x03468A 23:867A: A9 90     LDA #$90
bra_867C:
C - - - - 0x03468C 23:867C: 18        CLC
C - - - - 0x03468D 23:867D: 65 3A     ADC ram_003A
C - - - - 0x03468F 23:867F: 8D 35 06  STA $0635
C - - - - 0x034692 23:8682: AD E3 00  LDA ram_рандом_3
C - - - - 0x034695 23:8685: 29 0F     AND #$0F
loc_8687:
C D - - - 0x034697 23:8687: DD B1 86  CMP tbl_86B1,X
C - - - - 0x03469A 23:868A: 90 06     BCC bra_8692
C - - - - 0x03469C 23:868C: FD B1 86  SBC tbl_86B1,X
C - - - - 0x03469F 23:868F: 4C 87 86  JMP loc_8687
bra_8692:
C - - - - 0x0346A2 23:8692: 0A        ASL
C - - - - 0x0346A3 23:8693: 0A        ASL
C - - - - 0x0346A4 23:8694: 0A        ASL
C - - - - 0x0346A5 23:8695: 69 50     ADC #$50
C - - - - 0x0346A7 23:8697: 2C E3 00  BIT ram_рандом_3
C - - - - 0x0346AA 23:869A: 10 02     BPL bra_869E
C - - - - 0x0346AC 23:869C: 49 FF     EOR #$FF
bra_869E:
C - - - - 0x0346AE 23:869E: 8D 37 06  STA $0637
C - - - - 0x0346B1 23:86A1: A9 01     LDA #$01
C - - - - 0x0346B3 23:86A3: 8D FF 05  STA $05FF
C - - - - 0x0346B6 23:86A6: A9 00     LDA #$00
C - - - - 0x0346B8 23:86A8: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x0346BB 23:86AB: 20 D3 86  JSR sub_86D3
C - - - - 0x0346BE 23:86AE: 4C E5 8B  JMP loc_8BE5

tbl_86B1:
- D - - - 0x0346C1 23:86B1: 03        .byte $03    ; <う>
- D - - - 0x0346C2 23:86B2: 03        .byte $03    ; <う>
- D - - - 0x0346C3 23:86B3: 03        .byte $03    ; <う>
- D - - - 0x0346C4 23:86B4: 06        .byte $06    ; <か>
- D - - - 0x0346C5 23:86B5: 06        .byte $06    ; <か>
- D - - - 0x0346C6 23:86B6: 06        .byte $06    ; <か>
- D - - - 0x0346C7 23:86B7: 06        .byte $06    ; <か>
- D - - - 0x0346C8 23:86B8: 06        .byte $06    ; <か>

tbl_86B9:
- D - - - 0x0346C9 23:86B9: BF        .byte $BF    ; <ヂ>
- D - - - 0x0346CA 23:86BA: BB        .byte $BB    ; <ズ>
- D - - - 0x0346CB 23:86BB: 87        .byte $87    ; <G>
- D - - - 0x0346CC 23:86BC: 00        .byte $00

sub_86BD:
C - - - - 0x0346CD 23:86BD: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x0346D0 23:86C0: A9 07     LDA #$07
C - - - - 0x0346D2 23:86C2: AE 43 04  LDX $0443
C - - - - 0x0346D5 23:86C5: E0 02     CPX #$02
C - - - - 0x0346D7 23:86C7: 90 02     BCC bra_86CB
C - - - - 0x0346D9 23:86C9: A9 0B     LDA #$0B
bra_86CB:
C - - - - 0x0346DB 23:86CB: A0 05     LDY #con_игрок_координата_X_lo
C - - - - 0x0346DD 23:86CD: 18        CLC
C - - - - 0x0346DE 23:86CE: 71 34     ADC (ram_plr_data),Y
C - - - - 0x0346E0 23:86D0: 91 34     STA (ram_plr_data),Y
C - - - - 0x0346E2 23:86D2: 60        RTS

sub_86D3:
C - - - - 0x0346E3 23:86D3: AD E2 00  LDA ram_рандом_2
C - - - - 0x0346E6 23:86D6: C9 40     CMP #$40
C - - - - 0x0346E8 23:86D8: B0 1B     BCS bra_86F5_выход
C - - - - 0x0346EA 23:86DA: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x0346ED 23:86DD: A0 07     LDY #con_игрок_координата_Y_lo
C - - - - 0x0346EF 23:86DF: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0346F1 23:86E1: C9 50     CMP #$50
C - - - - 0x0346F3 23:86E3: B0 10     BCS bra_86F5_выход
C - - - - 0x0346F5 23:86E5: 69 4F     ADC #$4F
C - - - - 0x0346F7 23:86E7: C9 80     CMP #$80
C - - - - 0x0346F9 23:86E9: 90 02     BCC bra_86ED
C - - - - 0x0346FB 23:86EB: A9 7F     LDA #$7F
bra_86ED:
C - - - - 0x0346FD 23:86ED: 91 34     STA (ram_plr_data),Y
C - - - - 0x0346FF 23:86EF: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x034701 23:86F1: A9 04     LDA #$04
C - - - - 0x034703 23:86F3: 91 34     STA (ram_plr_data),Y
bra_86F5_выход:
C - - - - 0x034705 23:86F5: 60        RTS

.export loc_0x034706
loc_0x034706:
C D - - - 0x034706 23:86F6: A9 03     LDA #$03
C - - - - 0x034708 23:86F8: 8D 21 06  STA $0621
C - - - - 0x03470B 23:86FB: A9 01     LDA #$01
C - - - - 0x03470D 23:86FD: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x034710 23:8700: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034713 23:8703: 49 0B     EOR #$0B
C - - - - 0x034715 23:8705: 8D 01 06  STA ram_номер_нападающего
C - - - - 0x034718 23:8708: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x03471B 23:870B: A9 02     LDA #$02
C - - - - 0x03471D 23:870D: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034720 23:8710: A9 31     LDA #$31
C - - - - 0x034722 23:8712: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034725 23:8715: 20 00 C6  JSR sub_0x03D575
C - - - - 0x034728 23:8718: 20 72 8F  JSR sub_8F72
C - - - - 0x03472B 23:871B: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x03472E 23:871E: C9 01     CMP #$01
C - - - - 0x034730 23:8720: D0 10     BNE bra_8732
C - - - - 0x034732 23:8722: A9 00     LDA #$00
C - - - - 0x034734 23:8724: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x034737 23:8727: A9 18     LDA #$18
C - - - - 0x034739 23:8729: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03473C 23:872C: A2 50     LDX #$50
C - - - - 0x03473E 23:872E: 9A        TXS
C - - - - 0x03473F 23:872F: 4C 12 C6  JMP loc_0x03DE62
bra_8732:
C - - - - 0x034742 23:8732: A9 08     LDA #$08
C - - - - 0x034744 23:8734: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034747 23:8737: 20 F3 8F  JSR sub_8FF3
C - - - - 0x03474A 23:873A: AD 3D 04  LDA $043D
C - - - - 0x03474D 23:873D: 38        SEC
C - - - - 0x03474E 23:873E: E9 05     SBC #$05
C - - - - 0x034750 23:8740: 85 3B     STA ram_003B
C - - - - 0x034752 23:8742: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034755 23:8745: 0A        ASL
C - - - - 0x034756 23:8746: 65 3B     ADC ram_003B
C - - - - 0x034758 23:8748: AA        TAX
C - - - - 0x034759 23:8749: 0A        ASL
C - - - - 0x03475A 23:874A: 85 3B     STA ram_003B
C - - - - 0x03475C 23:874C: A9 04     LDA #$04
C - - - - 0x03475E 23:874E: BC D7 87  LDY tbl_87D7,X
C - - - - 0x034761 23:8751: 20 E9 8E  JSR sub_8EE9
C - - - - 0x034764 23:8754: 85 3A     STA ram_003A
C - - - - 0x034766 23:8756: 20 59 8F  JSR sub_8F59
C - - - - 0x034769 23:8759: 4A        LSR
C - - - - 0x03476A 23:875A: 4A        LSR
C - - - - 0x03476B 23:875B: 18        CLC
C - - - - 0x03476C 23:875C: 65 3A     ADC ram_003A
C - - - - 0x03476E 23:875E: 90 02     BCC bra_8762
C - - - - 0x034770 23:8760: A9 FF     LDA #$FF
bra_8762:
C - - - - 0x034772 23:8762: A0 00     LDY #$00
bra_8764:
C - - - - 0x034774 23:8764: D9 DD 87  CMP tbl_87DD,Y
C - - - - 0x034777 23:8767: B0 05     BCS bra_876E
C - - - - 0x034779 23:8769: F0 03     BEQ bra_876E
C - - - - 0x03477B 23:876B: C8        INY
C - - - - 0x03477C 23:876C: D0 F6     BNE bra_8764
bra_876E:
C - - - - 0x03477E 23:876E: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034781 23:8771: 20 33 8E  JSR sub_8E33
C - - - - 0x034784 23:8774: A9 0A     LDA #$0A
C - - - - 0x034786 23:8776: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034789 23:8779: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03478C 23:877C: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x03478F 23:877F: 89 87     .word ofs_8789_00
- D - I - 0x034791 23:8781: 9F 87     .word ofs_879F_01
- D - I - 0x034793 23:8783: B7 87     .word ofs_87B7_02
- D - I - 0x034795 23:8785: C3 87     .word ofs_87C3_03
- D - I - 0x034797 23:8787: D4 87     .word ofs_87D4_04

ofs_8789_00:
C - J - - 0x034799 23:8789: 20 BA 8B  JSR sub_8BBA
C - - - - 0x03479C 23:878C: 20 85 84  JSR sub_8485
C - - - - 0x03479F 23:878F: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0347A4 23:8794: D0 03     BNE bra_8799
C - - - - 0x0347A6 23:8796: 4C F3 88  JMP loc_88F3
bra_8799:
C - - - - 0x0347A9 23:8799: A2 50     LDX #$50
C - - - - 0x0347AB 23:879B: 9A        TXS
C - - - - 0x0347AC 23:879C: 4C 2A 89  JMP loc_892A

ofs_879F_01:
C - J - - 0x0347AF 23:879F: 20 BA 8B  JSR sub_8BBA
C - - - - 0x0347B2 23:87A2: 20 85 84  JSR sub_8485
C - - - - 0x0347B5 23:87A5: AD E2 00  LDA ram_рандом_2
C - - - - 0x0347B8 23:87A8: C9 40     CMP #$40
C - - - - 0x0347BA 23:87AA: B0 05     BCS bra_87B1
C - - - - 0x0347BC 23:87AC: A9 24     LDA #$24
C - - - - 0x0347BE 23:87AE: 20 F5 8C  JSR sub_8CF5
bra_87B1:
C - - - - 0x0347C1 23:87B1: A2 50     LDX #$50
C - - - - 0x0347C3 23:87B3: 9A        TXS
C - - - - 0x0347C4 23:87B4: 4C DF 8B  JMP loc_8BDF

ofs_87B7_02:
C - J - - 0x0347C7 23:87B7: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0347CA 23:87BA: 20 85 84  JSR sub_8485
C - - - - 0x0347CD 23:87BD: A2 50     LDX #$50
C - - - - 0x0347CF 23:87BF: 9A        TXS
C - - - - 0x0347D0 23:87C0: 4C DF 8B  JMP loc_8BDF

ofs_87C3_03:
C - J - - 0x0347D3 23:87C3: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0347D6 23:87C6: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0347D9 23:87C9: 49 0B     EOR #$0B
C - - - - 0x0347DB 23:87CB: 20 6E 8E  JSR sub_8E6E
C - - - - 0x0347DE 23:87CE: A2 50     LDX #$50
C - - - - 0x0347E0 23:87D0: 9A        TXS
C - - - - 0x0347E1 23:87D1: 4C 33 C6  JMP loc_0x03DE0D

tbl_87D7:
- D - - - 0x0347E7 23:87D7: 00        .byte $00
- D - - - 0x0347E8 23:87D8: 80        .byte $80
- - - - - 0x0347E9 23:87D9: 00        .byte $00
- - - - - 0x0347EA 23:87DA: 00        .byte $00
- D - - - 0x0347EB 23:87DB: 80        .byte $80
- D - - - 0x0347EC 23:87DC: 00        .byte $00

tbl_87DD:
- D - - - 0x0347ED 23:87DD: A8        .byte $A8    ; <ぜ>
- D - - - 0x0347EE 23:87DE: 5A        .byte $5A    ; <ハ>
- D - - - 0x0347EF 23:87DF: 52        .byte $52    ; <ツ>
- D - - - 0x0347F0 23:87E0: 00        .byte $00

.export sub_0x0347F1
sub_0x0347F1:
sub_87E1:
C D - - - 0x0347F1 23:87E1: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0347F4 23:87E4: 49 0B     EOR #$0B
C - - - - 0x0347F6 23:87E6: 85 41     STA ram_0041
C - - - - 0x0347F8 23:87E8: E6 41     INC ram_0041
C - - - - 0x0347FA 23:87EA: A9 0A     LDA #$0A
C - - - - 0x0347FC 23:87EC: 85 3B     STA ram_003B
bra_87EE:
C - - - - 0x0347FE 23:87EE: A5 41     LDA ram_0041
C - - - - 0x034800 23:87F0: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034803 23:87F3: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x034805 23:87F5: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034807 23:87F7: D0 35     BNE bra_882E
C - - - - 0x034809 23:87F9: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x03480B 23:87FB: B1 34     LDA (ram_plr_data),Y
C - - - - 0x03480D 23:87FD: AA        TAX
C - - - - 0x03480E 23:87FE: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x034810 23:8800: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034812 23:8802: A8        TAY
C - - - - 0x034813 23:8803: 20 39 C5  JSR sub_0x03CDF2
C - - - - 0x034816 23:8806: CD FE 05  CMP $05FE
C - - - - 0x034819 23:8809: D0 23     BNE bra_882E
C - - - - 0x03481B 23:880B: AE 00 06  LDX ram_колво_нападающих
C - - - - 0x03481E 23:880E: E0 05     CPX #$05
C - - - - 0x034820 23:8810: B0 1C     BCS bra_882E
C - - - - 0x034822 23:8812: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034825 23:8815: F0 04     BEQ bra_881B
C - - - - 0x034827 23:8817: E0 04     CPX #$04
C - - - - 0x034829 23:8819: B0 13     BCS bra_882E
bra_881B:
C - - - - 0x03482B 23:881B: AD E2 00  LDA ram_рандом_2
C - - - - 0x03482E 23:881E: ED E3 00  SBC ram_рандом_3
C - - - - 0x034831 23:8821: CD 1A 06  CMP $061A
C - - - - 0x034834 23:8824: B0 08     BCS bra_882E
C - - - - 0x034836 23:8826: A5 41     LDA ram_0041
C - - - - 0x034838 23:8828: 9D 01 06  STA ram_номер_нападающего,X
C - - - - 0x03483B 23:882B: EE 00 06  INC ram_колво_нападающих
bra_882E:
C - - - - 0x03483E 23:882E: E6 41     INC ram_0041
C - - - - 0x034840 23:8830: C6 3B     DEC ram_003B
C - - - - 0x034842 23:8832: D0 BA     BNE bra_87EE
C - - - - 0x034844 23:8834: 60        RTS

.export sub_0x034845
sub_0x034845:
C D - - - 0x034845 23:8835: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034848 23:8838: D0 01     BNE bra_883B
; bzk переход на rts внизу
C - - - - 0x03484A 23:883A: 60        RTS
bra_883B:
C - - - - 0x03484B 23:883B: A9 00     LDA #$00
C - - - - 0x03484D 23:883D: 8D 16 06  STA ram_номер_защитника
bra_8840:
C - - - - 0x034850 23:8840: A9 01     LDA #$01
C - - - - 0x034852 23:8842: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x034855 23:8845: AD 4E 04  LDA ram_высота_мяча
C - - - - 0x034858 23:8848: 48        PHA
C - - - - 0x034859 23:8849: A9 00     LDA #$00
C - - - - 0x03485B 23:884B: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x03485E 23:884E: AE 16 06  LDX ram_номер_защитника
C - - - - 0x034861 23:8851: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034864 23:8854: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x034867 23:8857: AE 1B 06  LDX $061B
; bzk загрузка 00 или 02 из таблицы, в 061B может быть 00 или 01, сделать LDA + ASL + STA
C - - - - 0x03486A 23:885A: BD 8B 88  LDA tbl_888B,X
C - - - - 0x03486D 23:885D: 8D 3D 04  STA $043D
C - - - - 0x034870 23:8860: A9 00     LDA #$00
C - - - - 0x034872 23:8862: 8D 3E 04  STA $043E
; bzk бесполезная загрузка номера
C - - - - 0x034875 23:8865: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034878 23:8868: A9 07     LDA #$07
C - - - - 0x03487A 23:886A: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x03487D 23:886D: 20 8D 88  JSR sub_888D
C - - - - 0x034880 23:8870: 68        PLA
C - - - - 0x034881 23:8871: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x034884 23:8874: 20 A8 88  JSR sub_88A8
C - - - - 0x034887 23:8877: EE 16 06  INC ram_номер_защитника
C - - - - 0x03488A 23:887A: AD 16 06  LDA ram_номер_защитника
C - - - - 0x03488D 23:887D: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x034890 23:8880: D0 BE     BNE bra_8840
C - - - - 0x034892 23:8882: A9 00     LDA #$00
C - - - - 0x034894 23:8884: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x034897 23:8887: 8D FF 05  STA $05FF
C - - - - 0x03489A 23:888A: 60        RTS

tbl_888B:
- D - - - 0x03489B 23:888B: 00        .byte $00
- D - - - 0x03489C 23:888C: 02        .byte $02    ; <い>

.export sub_0x03489D
sub_0x03489D:
sub_888D:
C D - - - 0x03489D 23:888D: A9 00     LDA #$00
C - - - - 0x03489F 23:888F: 85 3A     STA ram_003A
C - - - - 0x0348A1 23:8891: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0348A4 23:8894: 0A        ASL
C - - - - 0x0348A5 23:8895: 0A        ASL
C - - - - 0x0348A6 23:8896: 6D 3D 04  ADC $043D
C - - - - 0x0348A9 23:8899: AA        TAX
C - - - - 0x0348AA 23:889A: 0A        ASL
C - - - - 0x0348AB 23:889B: 85 3B     STA ram_003B
C - - - - 0x0348AD 23:889D: A9 05     LDA #$05
C - - - - 0x0348AF 23:889F: BC EB 88  LDY tbl_88EB,X
C - - - - 0x0348B2 23:88A2: 20 E9 8E  JSR sub_8EE9
C - - - - 0x0348B5 23:88A5: 4C 32 81  JMP loc_8132

.export sub_0x0348B8
sub_0x0348B8:
sub_88A8:
C D - - - 0x0348B8 23:88A8: A9 0B     LDA #$0B
C - - - - 0x0348BA 23:88AA: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0348BD 23:88AD: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0348C0 23:88B0: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0348C3 23:88B3: 69 81     .word ofs_8169_00
- D - I - 0x0348C5 23:88B5: 9C 81     .word ofs_819C_01
- D - I - 0x0348C7 23:88B7: BB 88     .word ofs_88BB_02
- D - I - 0x0348C9 23:88B9: D5 88     .word ofs_88D5_03

ofs_88BB_02:
C - J - - 0x0348CB 23:88BB: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0348CE 23:88BE: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0348D1 23:88C1: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0348D4 23:88C4: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x0348D6 23:88C6: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0348D8 23:88C8: 8D 35 06  STA $0635
C - - - - 0x0348DB 23:88CB: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x0348DD 23:88CD: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0348DF 23:88CF: 8D 37 06  STA $0637
C - - - - 0x0348E2 23:88D2: 4C BC 81  JMP loc_81BC

ofs_88D5_03:
C - J - - 0x0348E5 23:88D5: 20 C8 8B  JSR sub_8BC8
C - - - - 0x0348E8 23:88D8: 18        CLC
C - - - - 0x0348E9 23:88D9: 20 95 90  JSR sub_9095
C - - - - 0x0348EC 23:88DC: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0348EF 23:88DF: 20 6E 8E  JSR sub_8E6E
C - - - - 0x0348F2 23:88E2: 20 06 C6  JSR sub_0x03E084
C - - - - 0x0348F5 23:88E5: A2 50     LDX #$50
C - - - - 0x0348F7 23:88E7: 9A        TXS
C - - - - 0x0348F8 23:88E8: 4C 0F C6  JMP loc_0x03E0EF

tbl_88EB:
- D - - - 0x0348FB 23:88EB: 80        .byte $80
- - - - - 0x0348FC 23:88EC: 00        .byte $00
- - - - - 0x0348FD 23:88ED: 00        .byte $00
- - - - - 0x0348FE 23:88EE: 00        .byte $00
- - - - - 0x0348FF 23:88EF: 00        .byte $00
- - - - - 0x034900 23:88F0: 00        .byte $00
- D - - - 0x034901 23:88F1: 80        .byte $80
- - - - - 0x034902 23:88F2: 00        .byte $00

.export loc_0x034903
loc_0x034903:
loc_88F3:
C D - - - 0x034903 23:88F3: A9 00     LDA #$00
C - - - - 0x034905 23:88F5: 8D 3B 04  STA ram_действие_атаки
C - - - - 0x034908 23:88F8: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03490B 23:88FB: 49 0B     EOR #$0B
C - - - - 0x03490D 23:88FD: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x034910 23:8900: AD E2 00  LDA ram_рандом_2
C - - - - 0x034913 23:8903: A0 00     LDY #$00
bra_8905:
C - - - - 0x034915 23:8905: D9 28 89  CMP tbl_8928,Y
C - - - - 0x034918 23:8908: B0 05     BCS bra_890F
- - - - - 0x03491A 23:890A: F0 03     BEQ bra_890F
- - - - - 0x03491C 23:890C: C8        INY
- - - - - 0x03491D 23:890D: D0 F6     BNE bra_8905
bra_890F:
C - - - - 0x03491F 23:890F: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034922 23:8912: A9 00     LDA #$00
C - - - - 0x034924 23:8914: 8D 16 06  STA ram_номер_защитника
C - - - - 0x034927 23:8917: A9 0C     LDA #$0C
C - - - - 0x034929 23:8919: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03492C 23:891C: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03492F 23:891F: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x034932 23:8922: AC 85     .word ofs_85AC_00
- - - - - 0x034934 23:8924: 05 86     .word ofs_8605_01
- D - I - 0x034936 23:8926: 1C 86     .word ofs_861C_02

tbl_8928:
- D - - - 0x034938 23:8928: 10        .byte $10    ; <た>
- - - - - 0x034939 23:8929: 00        .byte $00

loc_892A:
C D - - - 0x03493A 23:892A: A0 00     LDY #$00
C - - - - 0x03493C 23:892C: A9 00     LDA #$00
C - - - - 0x03493E 23:892E: 8D 3B 04  STA ram_действие_атаки
C - - - - 0x034941 23:8931: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x034944 23:8934: AD E2 00  LDA ram_рандом_2
bra_8937:
C - - - - 0x034947 23:8937: D9 75 89  CMP tbl_8975_сценарий_после_обводки_кипера,Y
C - - - - 0x03494A 23:893A: B0 05     BCS bra_8941_сценарий_выбран
C - - - - 0x03494C 23:893C: F0 03     BEQ bra_8941_сценарий_выбран
C - - - - 0x03494E 23:893E: C8        INY
C - - - - 0x03494F 23:893F: D0 F6     BNE bra_8937
bra_8941_сценарий_выбран:
C - - - - 0x034951 23:8941: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034954 23:8944: A9 0D     LDA #$0D
C - - - - 0x034956 23:8946: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034959 23:8949: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03495C 23:894C: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x03495F 23:894F: 55 89     .word ofs_8955_00_01
- D - I - 0x034961 23:8951: 55 89     .word ofs_8955_00_01
- D - I - 0x034963 23:8953: 72 89     .word ofs_8972_02

ofs_8955_00_01:
C - J - - 0x034965 23:8955: 2C 4C 04  BIT $044C
C - - - - 0x034968 23:8958: 10 15     BPL bra_896F
C - - - - 0x03496A 23:895A: AD 41 04  LDA ram_игрок_с_мячом
; проверка на номера 10 соперника
C - - - - 0x03496D 23:895D: C9 14     CMP #$14
C - - - - 0x03496F 23:895F: D0 0E     BNE bra_896F
C - - - - 0x034971 23:8961: 20 70 90  JSR sub_9070
C - - - - 0x034974 23:8964: 20 E3 85  JSR sub_85E3_увеличить_счетчик_голов
C - - - - 0x034977 23:8967: A9 47     LDA #$47
C - - - - 0x034979 23:8969: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03497C 23:896C: 4C BC 85  JMP loc_85BC
bra_896F:
C - - - - 0x03497F 23:896F: 4C AC 85  JMP loc_85AC

tbl_8975_сценарий_после_обводки_кипера:
- D - - - 0x034985 23:8975: 56        .byte $56 ; защитник отобъет удар
- D - - - 0x034986 23:8976: 45        .byte $45 ; защитник промахнется
- D - - - 0x034987 23:8977: 00        .byte $00 ; гол (последний вариант)

loc_8978:
C D - - - 0x034988 23:8978: A9 02     LDA #$02
C - - - - 0x03498A 23:897A: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x03498D 23:897D: 20 72 8F  JSR sub_8F72
C - - - - 0x034990 23:8980: A9 0E     LDA #$0E
C - - - - 0x034992 23:8982: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034995 23:8985: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034998 23:8988: D0 09     BNE bra_8993
C - - - - 0x03499A 23:898A: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x03499D 23:898D: 20 DD 90  JSR sub_90DD
C - - - - 0x0349A0 23:8990: 4C 6F 8A  JMP loc_8A6F
bra_8993:
C - - - - 0x0349A3 23:8993: A9 00     LDA #$00
C - - - - 0x0349A5 23:8995: 8D 16 06  STA ram_номер_защитника
bra_8998:
C - - - - 0x0349A8 23:8998: AE 16 06  LDX ram_номер_защитника
C - - - - 0x0349AB 23:899B: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x0349AE 23:899E: C9 06     CMP #$06
C - - - - 0x0349B0 23:89A0: F0 19     BEQ bra_89BB
C - - - - 0x0349B2 23:89A2: 8D 3D 04  STA $043D
C - - - - 0x0349B5 23:89A5: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x0349B8 23:89A8: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x0349BB 23:89AB: BD 06 06  LDA $0606,X
C - - - - 0x0349BE 23:89AE: 8D 3E 04  STA $043E
C - - - - 0x0349C1 23:89B1: A9 0F     LDA #$0F
C - - - - 0x0349C3 23:89B3: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0349C6 23:89B6: A9 14     LDA #$14
C - - - - 0x0349C8 23:89B8: 20 15 C5  JSR sub_0x03CB1F
bra_89BB:
C - - - - 0x0349CB 23:89BB: EE 16 06  INC ram_номер_защитника
C - - - - 0x0349CE 23:89BE: AD 16 06  LDA ram_номер_защитника
C - - - - 0x0349D1 23:89C1: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x0349D4 23:89C4: D0 D2     BNE bra_8998
C - - - - 0x0349D6 23:89C6: A9 04     LDA #$04
C - - - - 0x0349D8 23:89C8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0349DB 23:89CB: A9 00     LDA #$00
C - - - - 0x0349DD 23:89CD: 8D 16 06  STA ram_номер_защитника
loc_89D0:
C D - - - 0x0349E0 23:89D0: A9 01     LDA #$01
C - - - - 0x0349E2 23:89D2: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x0349E5 23:89D5: A9 00     LDA #$00
C - - - - 0x0349E7 23:89D7: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x0349EA 23:89DA: AE 16 06  LDX ram_номер_защитника
C - - - - 0x0349ED 23:89DD: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x0349F0 23:89E0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x0349F3 23:89E3: BD 06 06  LDA $0606,X
C - - - - 0x0349F6 23:89E6: 8D 3E 04  STA $043E
C - - - - 0x0349F9 23:89E9: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x0349FC 23:89EC: 8D 3D 04  STA $043D
C - - - - 0x0349FF 23:89EF: C9 06     CMP #$06
C - - - - 0x034A01 23:89F1: D0 03     BNE bra_89F6
C - - - - 0x034A03 23:89F3: 4C 4F 8A  JMP loc_8A4F
bra_89F6:
C - - - - 0x034A06 23:89F6: C9 05     CMP #$05
C - - - - 0x034A08 23:89F8: D0 03     BNE bra_89FD
C - - - - 0x034A0A 23:89FA: 4C 4F 8A  JMP loc_8A4F
bra_89FD:
C - - - - 0x034A0D 23:89FD: A9 07     LDA #$07
C - - - - 0x034A0F 23:89FF: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034A12 23:8A02: 20 F3 8F  JSR sub_8FF3
C - - - - 0x034A15 23:8A05: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x034A18 23:8A08: BD 63 8A  LDA tbl_8A63,X
C - - - - 0x034A1B 23:8A0B: 0A        ASL
C - - - - 0x034A1C 23:8A0C: 0A        ASL
C - - - - 0x034A1D 23:8A0D: AE 3D 04  LDX $043D
C - - - - 0x034A20 23:8A10: 7D 6A 8A  ADC tbl_8A6A,X
C - - - - 0x034A23 23:8A13: AA        TAX
C - - - - 0x034A24 23:8A14: 0A        ASL
C - - - - 0x034A25 23:8A15: 85 3B     STA ram_003B
C - - - - 0x034A27 23:8A17: A9 08     LDA #$08
C - - - - 0x034A29 23:8A19: BC E1 83  LDY tbl_83E1,X
C - - - - 0x034A2C 23:8A1C: 20 E9 8E  JSR sub_8EE9
bra_8A1F:
C - - - - 0x034A2F 23:8A1F: DD AC 8A  CMP tbl_8AAC,X
C - - - - 0x034A32 23:8A22: B0 04     BCS bra_8A28
C - - - - 0x034A34 23:8A24: E8        INX
C - - - - 0x034A35 23:8A25: C8        INY
C - - - - 0x034A36 23:8A26: D0 F7     BNE bra_8A1F
bra_8A28:
C - - - - 0x034A38 23:8A28: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034A3B 23:8A2B: A9 11     LDA #$11
C - - - - 0x034A3D 23:8A2D: A2 01     LDX #$01
C - - - - 0x034A3F 23:8A2F: AC 12 06  LDY ram_флаг_защитника
C - - - - 0x034A42 23:8A32: C0 02     CPY #$02
C - - - - 0x034A44 23:8A34: 90 03     BCC bra_8A39
C - - - - 0x034A46 23:8A36: CA        DEX
C - - - - 0x034A47 23:8A37: A9 10     LDA #$10
bra_8A39:
C - - - - 0x034A49 23:8A39: 48        PHA
C - - - - 0x034A4A 23:8A3A: 8A        TXA
C - - - - 0x034A4B 23:8A3B: 4A        LSR
C - - - - 0x034A4C 23:8A3C: 20 95 90  JSR sub_9095
C - - - - 0x034A4F 23:8A3F: 68        PLA
C - - - - 0x034A50 23:8A40: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034A53 23:8A43: A9 12     LDA #$12
C - - - - 0x034A55 23:8A45: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034A58 23:8A48: AC 12 06  LDY ram_флаг_защитника
C - - - - 0x034A5B 23:8A4B: C0 02     CPY #$02
C - - - - 0x034A5D 23:8A4D: B0 11     BCS bra_8A60
loc_8A4F:
C D - - - 0x034A5F 23:8A4F: EE 16 06  INC ram_номер_защитника
C - - - - 0x034A62 23:8A52: AD 16 06  LDA ram_номер_защитника
C - - - - 0x034A65 23:8A55: CD 00 06  CMP ram_колво_нападающих
C - - - - 0x034A68 23:8A58: F0 03     BEQ bra_8A5D
C - - - - 0x034A6A 23:8A5A: 4C D0 89  JMP loc_89D0
bra_8A5D:
C - - - - 0x034A6D 23:8A5D: 20 85 90  JSR sub_9085_клон_ссыт_напороться_на_мяч
bra_8A60:
C - - - - 0x034A70 23:8A60: 4C 6F 8A  JMP loc_8A6F

tbl_8A63:
- - - - - 0x034A73 23:8A63: 00        .byte $00
- D - - - 0x034A74 23:8A64: 00        .byte $00
- - - - - 0x034A75 23:8A65: 00        .byte $00
- - - - - 0x034A76 23:8A66: 00        .byte $00
- D - - - 0x034A77 23:8A67: 01        .byte $01    ; <あ>
- - - - - 0x034A78 23:8A68: 00        .byte $00
- D - - - 0x034A79 23:8A69: 02        .byte $02    ; <い>

tbl_8A6A:
- - - - - 0x034A7A 23:8A6A: 00        .byte $00
- - - - - 0x034A7B 23:8A6B: 00        .byte $00
- D - - - 0x034A7C 23:8A6C: 00        .byte $00
- - - - - 0x034A7D 23:8A6D: 00        .byte $00
- D - - - 0x034A7E 23:8A6E: 01        .byte $01    ; <あ>

loc_8A6F:
C D - - - 0x034A7F 23:8A6F: 20 06 C6  JSR sub_0x03E084
C - - - - 0x034A82 23:8A72: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x034A85 23:8A75: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x034A88 23:8A78: 80 8A     .word ofs_8A80_00_01
- D - I - 0x034A8A 23:8A7A: 80 8A     .word ofs_8A80_00_01
- D - I - 0x034A8C 23:8A7C: DF 8B     .word ofs_8BDF
- D - I - 0x034A8E 23:8A7E: 9C 8A     .word ofs_8A9C_03

ofs_8A80_00_01:
C - J - - 0x034A90 23:8A80: 20 BA 8B  JSR sub_8BBA
C - - - - 0x034A93 23:8A83: A9 13     LDA #$13
C - - - - 0x034A95 23:8A85: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034A98 23:8A88: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034A9B 23:8A8B: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- - - - - 0x034A9E 23:8A8E: 00        .byte $00
- - - - - 0x034A9F 23:8A8F: 00        .byte $00
- D - I - 0x034AA0 23:8A90: 12 C6     .word ofs_0x03DE62
- - - - - 0x034AA2 23:8A92: 00        .byte $00
- - - - - 0x034AA3 23:8A93: 00        .byte $00
- - - - - 0x034AA4 23:8A94: 00        .byte $00
- - - - - 0x034AA5 23:8A95: 00        .byte $00
- D - I - 0x034AA6 23:8A96: 27 C6     .word ofs_0x03E55C
- - - - - 0x034AA8 23:8A98: 00        .byte $00
- - - - - 0x034AA9 23:8A99: 00        .byte $00
- D - I - 0x034AAA 23:8A9A: 2D C6     .word ofs_0x03E698

ofs_8A9C_03:
C - J - - 0x034AAC 23:8A9C: 20 C8 8B  JSR sub_8BC8
C - - - - 0x034AAF 23:8A9F: AD 3D 04  LDA $043D
C - - - - 0x034AB2 23:8AA2: C9 02     CMP #$02
C - - - - 0x034AB4 23:8AA4: D0 03     BNE bra_8AA9
C - - - - 0x034AB6 23:8AA6: 4C DE 81  JMP loc_81DE
bra_8AA9:
C - - - - 0x034AB9 23:8AA9: 4C DF 8B  JMP loc_8BDF

tbl_8AAC:
- D - - - 0x034ABC 23:8AAC: A0        .byte $A0    ; <が>
- D - - - 0x034ABD 23:8AAD: 60        .byte $60    ; <ミ>
- D - - - 0x034ABE 23:8AAE: 40        .byte $40    ; <「>
- D - - - 0x034ABF 23:8AAF: 00        .byte $00

loc_8AB0:
C D - - - 0x034AC0 23:8AB0: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034AC3 23:8AB3: A2 02     LDX #$02
C - - - - 0x034AC5 23:8AB5: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - 0x034AC8 23:8AB8: AD E2 00  LDA ram_рандом_2
C - - - - 0x034ACB 23:8ABB: 29 03     AND #$03
C - - - - 0x034ACD 23:8ABD: C9 03     CMP #$03
C - - - - 0x034ACF 23:8ABF: D0 02     BNE bra_8AC3
C - - - - 0x034AD1 23:8AC1: A9 00     LDA #$00
bra_8AC3:
C - - - - 0x034AD3 23:8AC3: 18        CLC
C - - - - 0x034AD4 23:8AC4: 69 03     ADC #$03
C - - - - 0x034AD6 23:8AC6: 85 3A     STA ram_003A
C - - - - 0x034AD8 23:8AC8: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034ADB 23:8ACB: 49 0B     EOR #$0B
C - - - - 0x034ADD 23:8ACD: 18        CLC
C - - - - 0x034ADE 23:8ACE: 65 3A     ADC ram_003A
C - - - - 0x034AE0 23:8AD0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x034AE3 23:8AD3: 8D 01 06  STA ram_номер_нападающего
C - - - - 0x034AE6 23:8AD6: A2 03     LDX #$03
C - - - - 0x034AE8 23:8AD8: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - 0x034AEB 23:8ADB: A9 00     LDA #$00
C - - - - 0x034AED 23:8ADD: 8D 3D 04  STA $043D
C - - - - 0x034AF0 23:8AE0: A9 00     LDA #$00
C - - - - 0x034AF2 23:8AE2: 8D 3E 04  STA $043E
C - - - - 0x034AF5 23:8AE5: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x034AF8 23:8AE8: 20 72 8F  JSR sub_8F72
C - - - - 0x034AFB 23:8AEB: A9 07     LDA #$07
C - - - - 0x034AFD 23:8AED: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034B00 23:8AF0: A9 0A     LDA #$0A
C - - - - 0x034B02 23:8AF2: A2 00     LDX #$00
C - - - - 0x034B04 23:8AF4: 86 3B     STX ram_003B
C - - - - 0x034B06 23:8AF6: A2 80     LDX #$80
C - - - - 0x034B08 23:8AF8: 20 E9 8E  JSR sub_8EE9
C - - - - 0x034B0B 23:8AFB: A0 00     LDY #$00
C - - - - 0x034B0D 23:8AFD: AE 12 06  LDX ram_флаг_защитника
C - - - - 0x034B10 23:8B00: D0 08     BNE bra_8B0A
bra_8B02:
C - - - - 0x034B12 23:8B02: D9 46 8B  CMP tbl_8B46,Y
C - - - - 0x034B15 23:8B05: B0 03     BCS bra_8B0A
C - - - - 0x034B17 23:8B07: C8        INY
C - - - - 0x034B18 23:8B08: D0 F8     BNE bra_8B02
bra_8B0A:
C - - - - 0x034B1A 23:8B0A: 20 48 81  STY ram_флаг_защитника
C - - - - 0x034B1D 23:8B0D: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034B20 23:8B10: A2 FE     LDX #$FE
C - - - - 0x034B22 23:8B12: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - 0x034B25 23:8B15: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034B28 23:8B18: A2 FD     LDX #$FD
C - - - - 0x034B2A 23:8B1A: 20 3A 8B  JSR sub_8B3A_изменить_уровень_игрока
C - - - - 0x034B2D 23:8B1D: A9 14     LDA #$14
C - - - - 0x034B2F 23:8B1F: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034B32 23:8B22: A9 00     LDA #$00
C - - - - 0x034B34 23:8B24: 8D 1A 06  STA $061A
C - - - - 0x034B37 23:8B27: A9 02     LDA #$02
C - - - - 0x034B39 23:8B29: 8D FF 05  STA $05FF
C - - - - 0x034B3C 23:8B2C: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x034B3F 23:8B2F: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x034B42 23:8B32: 1B C6     .word ofs_0x03DD12
- - - - - 0x034B44 23:8B34: 1B C6     .word ofs_0x03DD12
- D - I - 0x034B46 23:8B36: DF 8B     .word ofs_8BDF
- D - I - 0x034B48 23:8B38: D5 88     .word ofs_88D5_03

sub_8B3A_изменить_уровень_игрока:
; может как повышаться, так и понижаться
C - - - - 0x034B4A 23:8B3A: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034B4D 23:8B3D: A0 03     LDY #con_игрок_уровень
C - - - - 0x034B4F 23:8B3F: 8A        TXA
C - - - - 0x034B50 23:8B40: 18        CLC
C - - - - 0x034B51 23:8B41: 71 34     ADC (ram_plr_data),Y
C - - - - 0x034B53 23:8B43: 91 34     STA (ram_plr_data),Y
C - - - - 0x034B55 23:8B45: 60        RTS

tbl_8B46:
- D - - - 0x034B56 23:8B46: A0        .byte $A0    ; <が>
- D - - - 0x034B57 23:8B47: 60        .byte $60    ; <ミ>
- D - - - 0x034B58 23:8B48: 40        .byte $40    ; <「>
- D - - - 0x034B59 23:8B49: 00        .byte $00

.export sub_0x034B5A
sub_0x034B5A:
sub_8B4A:
C D - - - 0x034B5A 23:8B4A: 20 9C 8B  JSR sub_8B9C
C - - - - 0x034B5D 23:8B4D: B0 01     BCS bra_8B50
C - - - - 0x034B5F 23:8B4F: 60        RTS
bra_8B50:
C - - - - 0x034B60 23:8B50: 20 24 C6  JSR sub_0x03DCEF
C - - - - 0x034B63 23:8B53: A9 00     LDA #$00
C - - - - 0x034B65 23:8B55: 8D 00 06  STA ram_колво_нападающих
C - - - - 0x034B68 23:8B58: 8A        TXA
C - - - - 0x034B69 23:8B59: A2 02     LDX #$02
C - - - - 0x034B6B 23:8B5B: 4D FB 05  EOR ram_команда_с_мячом
C - - - - 0x034B6E 23:8B5E: F0 02     BEQ bra_8B62
C - - - - 0x034B70 23:8B60: A2 01     LDX #$01
bra_8B62:
C - - - - 0x034B72 23:8B62: 8E 21 06  STX $0621
C - - - - 0x034B75 23:8B65: A9 FF     LDA #$FF
C - - - - 0x034B77 23:8B67: 8D 1A 06  STA $061A
C - - - - 0x034B7A 23:8B6A: 20 E1 87  JSR sub_87E1
C - - - - 0x034B7D 23:8B6D: A2 50     LDX #$50
C - - - - 0x034B7F 23:8B6F: 9A        TXS
C - - - - 0x034B80 23:8B70: 4C 73 8B  JMP loc_8B73

loc_8B73:
C D - - - 0x034B83 23:8B73: A9 0A     LDA #$0A
C - - - - 0x034B85 23:8B75: 20 09 C6  JSR sub_0x03E4E7
C - - - - 0x034B88 23:8B78: A9 3F     LDA #$3F
C - - - - 0x034B8A 23:8B7A: AE 21 06  LDX $0621
C - - - - 0x034B8D 23:8B7D: E0 02     CPX #$02
C - - - - 0x034B8F 23:8B7F: F0 05     BEQ bra_8B86
C - - - - 0x034B91 23:8B81: 20 8F 84  JSR sub_848F
C - - - - 0x034B94 23:8B84: A9 2F     LDA #$2F
bra_8B86:
C - - - - 0x034B96 23:8B86: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034B99 23:8B89: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - 0x034B9C 23:8B8C: 20 00 C6  JSR sub_0x03D575
C - - - - 0x034B9F 23:8B8F: AD 21 06  LDA $0621
C - - - - 0x034BA2 23:8B92: C9 01     CMP #$01
C - - - - 0x034BA4 23:8B94: D0 03     BNE bra_8B99
C - - - - 0x034BA6 23:8B96: 4C 98 82  JMP loc_8298
bra_8B99:
C - - - - 0x034BA9 23:8B99: 4C 78 89  JMP loc_8978

sub_8B9C:
C - - - - 0x034BAC 23:8B9C: AD 37 06  LDA $0637
C - - - - 0x034BAF 23:8B9F: C9 60     CMP #$60
C - - - - 0x034BB1 23:8BA1: 90 13     BCC bra_8BB6
C - - - - 0x034BB3 23:8BA3: C9 A0     CMP #$A0
C - - - - 0x034BB5 23:8BA5: B0 0F     BCS bra_8BB6
C - - - - 0x034BB7 23:8BA7: A2 00     LDX #$00
C - - - - 0x034BB9 23:8BA9: AD 35 06  LDA $0635
C - - - - 0x034BBC 23:8BAC: C9 50     CMP #$50
C - - - - 0x034BBE 23:8BAE: 90 08     BCC bra_8BB8
C - - - - 0x034BC0 23:8BB0: A2 0B     LDX #$0B
C - - - - 0x034BC2 23:8BB2: C9 B0     CMP #$B0
C - - - - 0x034BC4 23:8BB4: B0 02     BCS bra_8BB8
bra_8BB6:
C - - - - 0x034BC6 23:8BB6: 18        CLC
C - - - - 0x034BC7 23:8BB7: 60        RTS
bra_8BB8:
C - - - - 0x034BC8 23:8BB8: 38        SEC
C - - - - 0x034BC9 23:8BB9: 60        RTS

sub_8BBA:
C - - - - 0x034BCA 23:8BBA: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034BCD 23:8BBD: F0 08     BEQ bra_8BC7_выход
C - - - - 0x034BCF 23:8BBF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034BD2 23:8BC2: A2 01     LDX #$01
C - - - - 0x034BD4 23:8BC4: 4C D4 8B  JMP loc_8BD4
bra_8BC7_выход:
C - - - - 0x034BD7 23:8BC7: 60        RTS

sub_8BC8:
C - - - - 0x034BD8 23:8BC8: A2 03     LDX #$03
C - - - - 0x034BDA 23:8BCA: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034BDD 23:8BCD: F0 05     BEQ bra_8BD4
C - - - - 0x034BDF 23:8BCF: C9 0B     CMP #$0B
C - - - - 0x034BE1 23:8BD1: F0 01     BEQ bra_8BD4
C - - - - 0x034BE3 23:8BD3: CA        DEX
bra_8BD4:
sub_8BD4:
loc_8BD4:
C D - - - 0x034BE4 23:8BD4: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034BE7 23:8BD7: A0 00     LDY #con_игрок_номер
C - - - - 0x034BE9 23:8BD9: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034BEB 23:8BDB: 20 C8 C4  JSR sub_0x03C4D8
C - - - - 0x034BEE 23:8BDE: 60        RTS

ofs_8972_02:
loc_8BDF:
ofs_8BDF:
C D - - - 0x034BEF 23:8BDF: 20 70 90  JSR sub_9070
C - - - - 0x034BF2 23:8BE2: 20 6D 8C  JSR sub_8C6D
.export loc_0x034BF5
loc_0x034BF5:
loc_8BE5:
C D - - - 0x034BF5 23:8BE5: 20 06 C6  JSR sub_0x03E084
C - - - - 0x034BF8 23:8BE8: 20 42 8C  JSR sub_8C42
C - - - - 0x034BFB 23:8BEB: B0 25     BCS bra_8C12
C - - - - 0x034BFD 23:8BED: A9 00     LDA #$00
C - - - - 0x034BFF 23:8BEF: 20 48 C5  JSR sub_0x03CEA9
C - - - - 0x034C02 23:8BF2: 85 3A     STA ram_003A
C - - - - 0x034C04 23:8BF4: A5 47     LDA ram_0047
C - - - - 0x034C06 23:8BF6: 48        PHA
C - - - - 0x034C07 23:8BF7: A9 0B     LDA #$0B
C - - - - 0x034C09 23:8BF9: 20 48 C5  JSR sub_0x03CEA9
C - - - - 0x034C0C 23:8BFC: AA        TAX
C - - - - 0x034C0D 23:8BFD: 68        PLA
C - - - - 0x034C0E 23:8BFE: C5 47     CMP ram_0047
C - - - - 0x034C10 23:8C00: 90 0E     BCC bra_8C10
C - - - - 0x034C12 23:8C02: F0 05     BEQ bra_8C09
C - - - - 0x034C14 23:8C04: 86 3A     STX ram_003A
C - - - - 0x034C16 23:8C06: 4C 10 8C  JMP loc_8C10
bra_8C09:
C - - - - 0x034C19 23:8C09: 2C E2 00  BIT ram_рандом_2
C - - - - 0x034C1C 23:8C0C: 10 02     BPL bra_8C10
C - - - - 0x034C1E 23:8C0E: 86 3A     STX ram_003A
bra_8C10:
loc_8C10:
C D - - - 0x034C20 23:8C10: A5 3A     LDA ram_003A
bra_8C12:
C - - - - 0x034C22 23:8C12: 20 6E 8E  JSR sub_8E6E
C - - - - 0x034C25 23:8C15: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034C28 23:8C18: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034C2B 23:8C1B: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x034C2D 23:8C1D: AD 35 06  LDA $0635
C - - - - 0x034C30 23:8C20: 91 34     STA (ram_plr_data),Y
C - - - - 0x034C32 23:8C22: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x034C34 23:8C24: AD 37 06  LDA $0637
C - - - - 0x034C37 23:8C27: 91 34     STA (ram_plr_data),Y
C - - - - 0x034C39 23:8C29: A9 00     LDA #$00
C - - - - 0x034C3B 23:8C2B: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x034C3E 23:8C2E: 20 24 C6  JSR sub_0x03DCEF
C - - - - 0x034C41 23:8C31: 20 4A 8B  JSR sub_8B4A
C - - - - 0x034C44 23:8C34: A9 2C     LDA #$2C
C - - - - 0x034C46 23:8C36: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034C49 23:8C39: 20 86 8E  JSR sub_8E86_катсцена_драйв_оверхеда
C - - - - 0x034C4C 23:8C3C: A2 50     LDX #$50
C - - - - 0x034C4E 23:8C3E: 9A        TXS
C - - - - 0x034C4F 23:8C3F: 4C 0F C6  JMP loc_0x03E0EF

sub_8C42:
C - - - - 0x034C52 23:8C42: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034C55 23:8C45: F0 18     BEQ bra_8C5F
C - - - - 0x034C57 23:8C47: A2 00     LDX #$00
bra_8C49:
C - - - - 0x034C59 23:8C49: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034C5C 23:8C4C: F0 0B     BEQ bra_8C59
C - - - - 0x034C5E 23:8C4E: C9 0B     CMP #$0B
C - - - - 0x034C60 23:8C50: F0 07     BEQ bra_8C59
C - - - - 0x034C62 23:8C52: BD 0B 06  LDA ram_действие_защиты,X
C - - - - 0x034C65 23:8C55: C9 05     CMP #$05
C - - - - 0x034C67 23:8C57: F0 08     BEQ bra_8C61
bra_8C59:
C - - - - 0x034C69 23:8C59: E8        INX
C - - - - 0x034C6A 23:8C5A: EC 00 06  CPX ram_колво_нападающих
C - - - - 0x034C6D 23:8C5D: D0 EA     BNE bra_8C49
bra_8C5F:
C - - - - 0x034C6F 23:8C5F: 18        CLC
C - - - - 0x034C70 23:8C60: 60        RTS
bra_8C61:
C - - - - 0x034C71 23:8C61: AD E2 00  LDA ram_рандом_2
C - - - - 0x034C74 23:8C64: C9 40     CMP #$40
C - - - - 0x034C76 23:8C66: B0 F7     BCS bra_8C5F
C - - - - 0x034C78 23:8C68: BD 01 06  LDA ram_номер_нападающего,X
C - - - - 0x034C7B 23:8C6B: 38        SEC
C - - - - 0x034C7C 23:8C6C: 60        RTS

sub_8C6D:
C - - - - 0x034C7D 23:8C6D: AD E2 00  LDA ram_рандом_2
C - - - - 0x034C80 23:8C70: 29 83     AND #$83
C - - - - 0x034C82 23:8C72: AE 37 06  LDX $0637
C - - - - 0x034C85 23:8C75: 20 92 8C  JSR sub_8C92
C - - - - 0x034C88 23:8C78: 8D 37 06  STA $0637
C - - - - 0x034C8B 23:8C7B: AD E3 00  LDA ram_рандом_3
C - - - - 0x034C8E 23:8C7E: 29 83     AND #$83
C - - - - 0x034C90 23:8C80: 8D 2C 06  STA $062C
C - - - - 0x034C93 23:8C83: AE 35 06  LDX $0635
C - - - - 0x034C96 23:8C86: 20 92 8C  JSR sub_8C92
C - - - - 0x034C99 23:8C89: 8D 35 06  STA $0635
C - - - - 0x034C9C 23:8C8C: A9 00     LDA #$00
C - - - - 0x034C9E 23:8C8E: 20 A4 8C  JSR sub_8CA4
C - - - - 0x034CA1 23:8C91: 60        RTS

sub_8C92:
C - - - - 0x034CA2 23:8C92: 0A        ASL
C - - - - 0x034CA3 23:8C93: 08        PHP
C - - - - 0x034CA4 23:8C94: 0A        ASL
C - - - - 0x034CA5 23:8C95: 0A        ASL
C - - - - 0x034CA6 23:8C96: 28        PLP
C - - - - 0x034CA7 23:8C97: 90 04     BCC bra_8C9D
C - - - - 0x034CA9 23:8C99: 49 FF     EOR #$FF
C - - - - 0x034CAB 23:8C9B: 69 00     ADC #$00
bra_8C9D:
C - - - - 0x034CAD 23:8C9D: 85 3A     STA ram_003A
C - - - - 0x034CAF 23:8C9F: 8A        TXA
C - - - - 0x034CB0 23:8CA0: 18        CLC
C - - - - 0x034CB1 23:8CA1: 65 3A     ADC ram_003A
C - - - - 0x034CB3 23:8CA3: 60        RTS

.export sub_0x034CB4
sub_0x034CB4:
sub_8CA4:
C D - - - 0x034CB4 23:8CA4: 4A        LSR
C - - - - 0x034CB5 23:8CA5: 08        PHP
C - - - - 0x034CB6 23:8CA6: AD 35 06  LDA $0635
C - - - - 0x034CB9 23:8CA9: C9 30     CMP #$30
C - - - - 0x034CBB 23:8CAB: 90 1E     BCC bra_8CCB
C - - - - 0x034CBD 23:8CAD: C9 D0     CMP #$D0
C - - - - 0x034CBF 23:8CAF: B0 1A     BCS bra_8CCB
C - - - - 0x034CC1 23:8CB1: AD 37 06  LDA $0637
C - - - - 0x034CC4 23:8CB4: C9 50     CMP #$50
C - - - - 0x034CC6 23:8CB6: 90 06     BCC bra_8CBE
C - - - - 0x034CC8 23:8CB8: C9 B0     CMP #$B0
C - - - - 0x034CCA 23:8CBA: B0 02     BCS bra_8CBE
C - - - - 0x034CCC 23:8CBC: 28        PLP
C - - - - 0x034CCD 23:8CBD: 60        RTS
bra_8CBE:
C - - - - 0x034CCE 23:8CBE: 28        PLP
C - - - - 0x034CCF 23:8CBF: 20 EA 8C  JSR sub_8CEA
C - - - - 0x034CD2 23:8CC2: 20 5A C5  JSR sub_0x03CF5F
C - - - - 0x034CD5 23:8CC5: A2 50     LDX #$50
C - - - - 0x034CD7 23:8CC7: 9A        TXS
C - - - - 0x034CD8 23:8CC8: 4C 1C 91  JMP loc_911C
bra_8CCB:
C - - - - 0x034CDB 23:8CCB: 28        PLP
C - - - - 0x034CDC 23:8CCC: 20 EA 8C  JSR sub_8CEA
C - - - - 0x034CDF 23:8CCF: 20 5A C5  JSR sub_0x03CF5F
C - - - - 0x034CE2 23:8CD2: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034CE5 23:8CD5: F0 02     BEQ bra_8CD9
C - - - - 0x034CE7 23:8CD7: A9 80     LDA #$80
bra_8CD9:
C - - - - 0x034CE9 23:8CD9: 4D 35 06  EOR $0635
C - - - - 0x034CEC 23:8CDC: 10 06     BPL bra_8CE4
C - - - - 0x034CEE 23:8CDE: A2 50     LDX #$50
C - - - - 0x034CF0 23:8CE0: 9A        TXS
C - - - - 0x034CF1 23:8CE1: 4C EE 92  JMP loc_92EE
bra_8CE4:
C - - - - 0x034CF4 23:8CE4: A2 50     LDX #$50
C - - - - 0x034CF6 23:8CE6: 9A        TXS
C - - - - 0x034CF7 23:8CE7: 4C 5E 95  JMP loc_955E

sub_8CEA:
C - - - - 0x034CFA 23:8CEA: 90 08     BCC bra_8CF4_выход
C - - - - 0x034CFC 23:8CEC: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034CFF 23:8CEF: 49 0B     EOR #$0B
C - - - - 0x034D01 23:8CF1: 8D FB 05  STA ram_команда_с_мячом
bra_8CF4_выход:
C - - - - 0x034D04 23:8CF4: 60        RTS

sub_8CF5:
C - - - - 0x034D05 23:8CF5: 48        PHA
C - - - - 0x034D06 23:8CF6: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x034D09 23:8CF9: 68        PLA
C - - - - 0x034D0A 23:8CFA: A0 07     LDY #con_игрок_координата_Y_lo
C - - - - 0x034D0C 23:8CFC: 18        CLC
C - - - - 0x034D0D 23:8CFD: 71 34     ADC (ram_plr_data),Y
C - - - - 0x034D0F 23:8CFF: 10 02     BPL bra_8D03
- - - - - 0x034D11 23:8D01: A9 7F     LDA #$7F
bra_8D03:
C - - - - 0x034D13 23:8D03: 91 34     STA (ram_plr_data),Y
C - - - - 0x034D15 23:8D05: 60        RTS

sub_8D06:
C - - - - 0x034D16 23:8D06: 08        PHP
C - - - - 0x034D17 23:8D07: 0A        ASL
C - - - - 0x034D18 23:8D08: AA        TAX
C - - - - 0x034D19 23:8D09: BD 93 8D  LDA tbl_8D93,X
C - - - - 0x034D1C 23:8D0C: 85 3C     STA ram_003C
C - - - - 0x034D1E 23:8D0E: BD 94 8D  LDA tbl_8D93 + 1,X
C - - - - 0x034D21 23:8D11: 85 3D     STA ram_003D
C - - - - 0x034D23 23:8D13: AD E2 00  LDA ram_рандом_2
C - - - - 0x034D26 23:8D16: 6D E3 00  ADC ram_рандом_3
C - - - - 0x034D29 23:8D19: 6A        ROR
C - - - - 0x034D2A 23:8D1A: A2 00     LDX #$00
C - - - - 0x034D2C 23:8D1C: 28        PLP
C - - - - 0x034D2D 23:8D1D: 10 2B     BPL bra_8D4A
C - - - - 0x034D2F 23:8D1F: 24 3A     BIT ram_003A
C - - - - 0x034D31 23:8D21: 30 27     BMI bra_8D4A
C - - - - 0x034D33 23:8D23: AC 21 06  LDY $0621
C - - - - 0x034D36 23:8D26: C0 04     CPY #$04
C - - - - 0x034D38 23:8D28: D0 09     BNE bra_8D33
C - - - - 0x034D3A 23:8D2A: AC 42 04  LDY ram_игрок_без_мяча
C - - - - 0x034D3D 23:8D2D: F0 0B     BEQ bra_8D3A
C - - - - 0x034D3F 23:8D2F: C0 0B     CPY #$0B
C - - - - 0x034D41 23:8D31: F0 07     BEQ bra_8D3A
bra_8D33:
C - - - - 0x034D43 23:8D33: AC E3 00  LDY ram_рандом_3
C - - - - 0x034D46 23:8D36: C0 F8     CPY #$F8
C - - - - 0x034D48 23:8D38: 90 10     BCC bra_8D4A
bra_8D3A:
C - - - - 0x034D4A 23:8D3A: E8        INX
C - - - - 0x034D4B 23:8D3B: A8        TAY
C - - - - 0x034D4C 23:8D3C: AD 3E 04  LDA $043E
C - - - - 0x034D4F 23:8D3F: 09 80     ORA #$80
C - - - - 0x034D51 23:8D41: 8D 3E 04  STA $043E
C - - - - 0x034D54 23:8D44: 98        TYA
C - - - - 0x034D55 23:8D45: 29 7F     AND #$7F
C - - - - 0x034D57 23:8D47: 4C 60 8D  JMP loc_8D60
bra_8D4A:
C - - - - 0x034D5A 23:8D4A: A4 3B     LDY ram_003B
loc_8D4C:
C D - - - 0x034D5C 23:8D4C: D1 3C     CMP (ram_003C),Y
C - - - - 0x034D5E 23:8D4E: 90 07     BCC bra_8D57
C - - - - 0x034D60 23:8D50: F0 05     BEQ bra_8D57
C - - - - 0x034D62 23:8D52: F1 3C     SBC (ram_003C),Y
C - - - - 0x034D64 23:8D54: 4C 4C 8D  JMP loc_8D4C
bra_8D57:
C - - - - 0x034D67 23:8D57: A2 00     LDX #$00
C - - - - 0x034D69 23:8D59: C8        INY
C - - - - 0x034D6A 23:8D5A: 18        CLC
C - - - - 0x034D6B 23:8D5B: 71 3C     ADC (ram_003C),Y
C - - - - 0x034D6D 23:8D5D: 90 01     BCC bra_8D60
C - - - - 0x034D6F 23:8D5F: E8        INX
bra_8D60:
loc_8D60:
C D - - - 0x034D70 23:8D60: 24 3A     BIT ram_003A
C - - - - 0x034D72 23:8D62: 10 10     BPL bra_8D74
C - - - - 0x034D74 23:8D64: 46 33     LSR ram_0033
C - - - - 0x034D76 23:8D66: 66 32     ROR ram_0032
C - - - - 0x034D78 23:8D68: 46 33     LSR ram_0033
C - - - - 0x034D7A 23:8D6A: 66 32     ROR ram_0032
C - - - - 0x034D7C 23:8D6C: 46 33     LSR ram_0033
C - - - - 0x034D7E 23:8D6E: 66 32     ROR ram_0032
C - - - - 0x034D80 23:8D70: 46 33     LSR ram_0033
C - - - - 0x034D82 23:8D72: 66 32     ROR ram_0032
bra_8D74:
C - - - - 0x034D84 23:8D74: 85 67     STA ram_0067
C - - - - 0x034D86 23:8D76: 86 68     STX ram_0068
C - - - - 0x034D88 23:8D78: A5 32     LDA ram_0032
C - - - - 0x034D8A 23:8D7A: 85 69     STA ram_0069
C - - - - 0x034D8C 23:8D7C: A5 33     LDA ram_0033
C - - - - 0x034D8E 23:8D7E: 85 6A     STA ram_006A
C - - - - 0x034D90 23:8D80: 20 21 C5  JSR sub_0x03CD1D
C - - - - 0x034D93 23:8D83: A9 00     LDA #$00
C - - - - 0x034D95 23:8D85: 8D 74 00  STA ram_0074
C - - - - 0x034D98 23:8D88: A5 6C     LDA ram_006C
C - - - - 0x034D9A 23:8D8A: A4 6D     LDY ram_006D
C - - - - 0x034D9C 23:8D8C: F0 02     BEQ bra_8D90
- - - - - 0x034D9E 23:8D8E: A9 FF     LDA #$FF
bra_8D90:
C - - - - 0x034DA0 23:8D90: 85 71     STA ram_0071
C - - - - 0x034DA2 23:8D92: 60        RTS



tbl_8D93:
- D - - - 0x034DA3 23:8D93: A9 8D     .word off_8DA9_00
- D - - - 0x034DA5 23:8D95: C9 8D     .word off_8DC9_01_02
- - - - - 0x034DA7 23:8D97: C9 8D     .word off_8DC9_01_02
- D - - - 0x034DA9 23:8D99: E9 8D     .word off_8DE9_03
- D - - - 0x034DAB 23:8D9B: EB 8D     .word off_8DEB_04
- D - - - 0x034DAD 23:8D9D: F7 8D     .word off_8DF7_05
- - - - - 0x034DAF 23:8D9F: 17 8E     .word off_8E17_06_07_08
- - - - - 0x034DB1 23:8DA1: 17 8E     .word off_8E17_06_07_08
- D - - - 0x034DB3 23:8DA3: 17 8E     .word off_8E17_06_07_08
- D - - - 0x034DB5 23:8DA5: 31 8E     .word off_8E31_09
- D - - - 0x034DB7 23:8DA7: 2F 8E     .word off_8E2F_0A

off_8DA9_00:
- D - I - 0x034DB9 23:8DA9: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DBA 23:8DAA: 40        .byte $40    ; <「>
- D - I - 0x034DBB 23:8DAB: 99        .byte $99
- D - I - 0x034DBC 23:8DAC: 00        .byte $00
- D - I - 0x034DBD 23:8DAD: 99        .byte $99
- D - I - 0x034DBE 23:8DAE: 00        .byte $00
- - - - - 0x034DBF 23:8DAF: 00        .byte $00
- - - - - 0x034DC0 23:8DB0: 00        .byte $00
- D - I - 0x034DC1 23:8DB1: 99        .byte $99
- D - I - 0x034DC2 23:8DB2: 00        .byte $00
- D - I - 0x034DC3 23:8DB3: 99        .byte $99
- D - I - 0x034DC4 23:8DB4: 00        .byte $00
- D - I - 0x034DC5 23:8DB5: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DC6 23:8DB6: 40        .byte $40    ; <「>
- - - - - 0x034DC7 23:8DB7: 00        .byte $00
- - - - - 0x034DC8 23:8DB8: 00        .byte $00
- D - I - 0x034DC9 23:8DB9: 99        .byte $99
- D - I - 0x034DCA 23:8DBA: 00        .byte $00
- D - I - 0x034DCB 23:8DBB: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DCC 23:8DBC: 40        .byte $40    ; <「>
- D - I - 0x034DCD 23:8DBD: 99        .byte $99
- D - I - 0x034DCE 23:8DBE: 00        .byte $00
- - - - - 0x034DCF 23:8DBF: 00        .byte $00
- - - - - 0x034DD0 23:8DC0: 00        .byte $00
- D - I - 0x034DD1 23:8DC1: 99        .byte $99
- D - I - 0x034DD2 23:8DC2: 00        .byte $00
- D - I - 0x034DD3 23:8DC3: 99        .byte $99
- D - I - 0x034DD4 23:8DC4: 00        .byte $00
- D - I - 0x034DD5 23:8DC5: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DD6 23:8DC6: 40        .byte $40    ; <「>
- - - - - 0x034DD7 23:8DC7: 00        .byte $00
- - - - - 0x034DD8 23:8DC8: 00        .byte $00
off_8DC9_01_02:
- D - I - 0x034DD9 23:8DC9: 80        .byte $80
- D - I - 0x034DDA 23:8DCA: 80        .byte $80
- D - I - 0x034DDB 23:8DCB: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DDC 23:8DCC: 40        .byte $40    ; <「>
- D - I - 0x034DDD 23:8DCD: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DDE 23:8DCE: 40        .byte $40    ; <「>
- - - - - 0x034DDF 23:8DCF: 00        .byte $00
- - - - - 0x034DE0 23:8DD0: 00        .byte $00
- D - I - 0x034DE1 23:8DD1: 99        .byte $99
- D - I - 0x034DE2 23:8DD2: 00        .byte $00
- D - I - 0x034DE3 23:8DD3: 80        .byte $80
- D - I - 0x034DE4 23:8DD4: 80        .byte $80
- D - I - 0x034DE5 23:8DD5: 80        .byte $80
- D - I - 0x034DE6 23:8DD6: 80        .byte $80
- - - - - 0x034DE7 23:8DD7: 00        .byte $00
- - - - - 0x034DE8 23:8DD8: 00        .byte $00
- D - I - 0x034DE9 23:8DD9: 99        .byte $99
- D - I - 0x034DEA 23:8DDA: 00        .byte $00
- D - I - 0x034DEB 23:8DDB: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DEC 23:8DDC: 40        .byte $40    ; <「>
- D - I - 0x034DED 23:8DDD: 80        .byte $80
- D - I - 0x034DEE 23:8DDE: 80        .byte $80
- - - - - 0x034DEF 23:8DDF: 00        .byte $00
- - - - - 0x034DF0 23:8DE0: 00        .byte $00
- D - I - 0x034DF1 23:8DE1: C0        .byte $C0    ; <ヅ>
- D - I - 0x034DF2 23:8DE2: 40        .byte $40    ; <「>
- D - I - 0x034DF3 23:8DE3: 99        .byte $99
- D - I - 0x034DF4 23:8DE4: 00        .byte $00
- D - I - 0x034DF5 23:8DE5: 99        .byte $99
- D - I - 0x034DF6 23:8DE6: 00        .byte $00
- - - - - 0x034DF7 23:8DE7: 00        .byte $00
- - - - - 0x034DF8 23:8DE8: 00        .byte $00
off_8DE9_03:
- D - I - 0x034DF9 23:8DE9: 80        .byte $80
- D - I - 0x034DFA 23:8DEA: 80        .byte $80
off_8DEB_04:
- D - I - 0x034DFB 23:8DEB: B3        .byte $B3    ; <ぼ>
- D - I - 0x034DFC 23:8DEC: 00        .byte $00
- D - I - 0x034DFD 23:8DED: DA        .byte $DA
- D - I - 0x034DFE 23:8DEE: 25        .byte $25    ; <ゆ>
- - - - - 0x034DFF 23:8DEF: 00        .byte $00
- - - - - 0x034E00 23:8DF0: 00        .byte $00
- - - - - 0x034E01 23:8DF1: 00        .byte $00
- - - - - 0x034E02 23:8DF2: 00        .byte $00
- D - I - 0x034E03 23:8DF3: CD        .byte $CD    ; <パ>
- D - I - 0x034E04 23:8DF4: 32        .byte $32    ; <ょ>
- D - I - 0x034E05 23:8DF5: BF        .byte $BF    ; <ヂ>
- D - I - 0x034E06 23:8DF6: 00        .byte $00
off_8DF7_05:
- D - I - 0x034E07 23:8DF7: C0        .byte $C0    ; <ヅ>
- D - I - 0x034E08 23:8DF8: 40        .byte $40    ; <「>
- - - - - 0x034E09 23:8DF9: 00        .byte $00
- - - - - 0x034E0A 23:8DFA: 00        .byte $00
- - - - - 0x034E0B 23:8DFB: 00        .byte $00
- - - - - 0x034E0C 23:8DFC: 00        .byte $00
- - - - - 0x034E0D 23:8DFD: 00        .byte $00
- - - - - 0x034E0E 23:8DFE: 00        .byte $00
- - - - - 0x034E0F 23:8DFF: 00        .byte $00
- - - - - 0x034E10 23:8E00: 00        .byte $00
- - - - - 0x034E11 23:8E01: 00        .byte $00
- - - - - 0x034E12 23:8E02: 00        .byte $00
- D - I - 0x034E13 23:8E03: E6        .byte $E6
- D - I - 0x034E14 23:8E04: 00        .byte $00
- - - - - 0x034E15 23:8E05: 00        .byte $00
- - - - - 0x034E16 23:8E06: 00        .byte $00
- - - - - 0x034E17 23:8E07: 00        .byte $00
- - - - - 0x034E18 23:8E08: 00        .byte $00
- - - - - 0x034E19 23:8E09: 00        .byte $00
- - - - - 0x034E1A 23:8E0A: 00        .byte $00
- - - - - 0x034E1B 23:8E0B: 00        .byte $00
- - - - - 0x034E1C 23:8E0C: 00        .byte $00
- - - - - 0x034E1D 23:8E0D: 00        .byte $00
- - - - - 0x034E1E 23:8E0E: 00        .byte $00
- - - - - 0x034E1F 23:8E0F: 00        .byte $00
- - - - - 0x034E20 23:8E10: 00        .byte $00
- - - - - 0x034E21 23:8E11: 00        .byte $00
- - - - - 0x034E22 23:8E12: 00        .byte $00
- D - I - 0x034E23 23:8E13: 80        .byte $80
- D - I - 0x034E24 23:8E14: 80        .byte $80
- - - - - 0x034E25 23:8E15: 00        .byte $00
- - - - - 0x034E26 23:8E16: 00        .byte $00
off_8E17_06_07_08:
- D - I - 0x034E27 23:8E17: 80        .byte $80
- D - I - 0x034E28 23:8E18: 80        .byte $80
- D - I - 0x034E29 23:8E19: 80        .byte $80
- D - I - 0x034E2A 23:8E1A: 80        .byte $80
- - - - - 0x034E2B 23:8E1B: 00        .byte $00
- - - - - 0x034E2C 23:8E1C: 00        .byte $00
- - - - - 0x034E2D 23:8E1D: 00        .byte $00
- - - - - 0x034E2E 23:8E1E: 00        .byte $00
- D - I - 0x034E2F 23:8E1F: C0        .byte $C0    ; <ヅ>
- D - I - 0x034E30 23:8E20: 40        .byte $40    ; <「>
- D - I - 0x034E31 23:8E21: 80        .byte $80
- D - I - 0x034E32 23:8E22: 80        .byte $80
- - - - - 0x034E33 23:8E23: 00        .byte $00
- - - - - 0x034E34 23:8E24: 00        .byte $00
- - - - - 0x034E35 23:8E25: 00        .byte $00
- - - - - 0x034E36 23:8E26: 00        .byte $00
- D - I - 0x034E37 23:8E27: 99        .byte $99
- D - I - 0x034E38 23:8E28: 00        .byte $00
- D - I - 0x034E39 23:8E29: C0        .byte $C0    ; <ヅ>
- D - I - 0x034E3A 23:8E2A: 40        .byte $40    ; <「>
- - - - - 0x034E3B 23:8E2B: 00        .byte $00
- - - - - 0x034E3C 23:8E2C: 00        .byte $00
- - - - - 0x034E3D 23:8E2D: 00        .byte $00
- - - - - 0x034E3E 23:8E2E: 00        .byte $00
off_8E2F_0A:
- D - I - 0x034E3F 23:8E2F: 80        .byte $80
- D - I - 0x034E40 23:8E30: 80        .byte $80
off_8E31_09:
- D - I - 0x034E41 23:8E31: 80        .byte $80
- D - I - 0x034E42 23:8E32: 80        .byte $80



sub_8E33:
C - - - - 0x034E43 23:8E33: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034E46 23:8E36: F0 35     BEQ bra_8E6D_выход
C - - - - 0x034E48 23:8E38: AE 3D 04  LDX $043D
C - - - - 0x034E4B 23:8E3B: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x034E4E 23:8E3E: F0 04     BEQ bra_8E44
C - - - - 0x034E50 23:8E40: C9 0B     CMP #$0B
C - - - - 0x034E52 23:8E42: D0 06     BNE bra_8E4A
bra_8E44:
C - - - - 0x034E54 23:8E44: E0 04     CPX #$04
C - - - - 0x034E56 23:8E46: F0 25     BEQ bra_8E6D_выход
C - - - - 0x034E58 23:8E48: D0 08     BNE bra_8E52
bra_8E4A:
C - - - - 0x034E5A 23:8E4A: E0 05     CPX #$05
C - - - - 0x034E5C 23:8E4C: F0 1F     BEQ bra_8E6D_выход
C - - - - 0x034E5E 23:8E4E: E0 06     CPX #$06
C - - - - 0x034E60 23:8E50: F0 1B     BEQ bra_8E6D_выход
bra_8E52:
C - - - - 0x034E62 23:8E52: 20 9C 8B  JSR sub_8B9C
C - - - - 0x034E65 23:8E55: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x034E68 23:8E58: D0 13     BNE bra_8E6D_выход
C - - - - 0x034E6A 23:8E5A: A9 0F     LDA #$0F
C - - - - 0x034E6C 23:8E5C: B0 02     BCS bra_8E60
C - - - - 0x034E6E 23:8E5E: A9 3F     LDA #$3F
bra_8E60:
C - - - - 0x034E70 23:8E60: CD E2 00  CMP ram_рандом_2
C - - - - 0x034E73 23:8E63: 90 08     BCC bra_8E6D_выход
C - - - - 0x034E75 23:8E65: A9 04     LDA #$04
C - - - - 0x034E77 23:8E67: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x034E7A 23:8E6A: 20 5A C5  JSR sub_0x03CF5F
bra_8E6D_выход:
C - - - - 0x034E7D 23:8E6D: 60        RTS

sub_8E6E:
C - - - - 0x034E7E 23:8E6E: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x034E81 23:8E71: A2 00     LDX #$00
; проверка на кипера соперника
C - - - - 0x034E83 23:8E73: C9 0B     CMP #$0B
C - - - - 0x034E85 23:8E75: 90 02     BCC bra_8E79
C - - - - 0x034E87 23:8E77: A2 0B     LDX #$0B
bra_8E79:
C - - - - 0x034E89 23:8E79: 8A        TXA
C - - - - 0x034E8A 23:8E7A: 4D FB 05  EOR ram_команда_с_мячом
C - - - - 0x034E8D 23:8E7D: 8E FB 05  STX ram_команда_с_мячом
C - - - - 0x034E90 23:8E80: F0 03     BEQ bra_8E85_выход
C - - - - 0x034E92 23:8E82: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
bra_8E85_выход:
C - - - - 0x034E95 23:8E85: 60        RTS

.export sub_0x034E96_катсцена_драйв_оверхеда
sub_0x034E96_катсцена_драйв_оверхеда:
sub_8E86_катсцена_драйв_оверхеда:
; попытка активировать катсцену, бряк периодически регулярно срабатывает во время матча
C D - - - 0x034E96 23:8E86: AD 46 04  LDA ram_флаг_драйв_оверхеда
C - - - - 0x034E99 23:8E89: C9 05     CMP #$05
; выход если уже есть драйв оверхед уже в наличии
C - - - - 0x034E9B 23:8E8B: F0 5B     BEQ bra_8EE8_выход
C - - - - 0x034E9D 23:8E8D: C9 04     CMP #$04
; выход если еще не набралось 2 удара по меону
C - - - - 0x034E9F 23:8E8F: D0 57     BNE bra_8EE8_выход
C - - - - 0x034EA1 23:8E91: AD FB 05  LDA ram_команда_с_мячом
; выход если мячом владеет соперник
C - - - - 0x034EA4 23:8E94: D0 52     BNE bra_8EE8_выход
C - - - - 0x034EA6 23:8E96: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034EA9 23:8E99: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034EAC 23:8E9C: A0 00     LDY #con_игрок_номер
C - - - - 0x034EAE 23:8E9E: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034EB0 23:8EA0: C9 01     CMP #$01
; выход если мячом владеет цубаса
C - - - - 0x034EB2 23:8EA2: F0 44     BEQ bra_8EE8_выход
C - - - - 0x034EB4 23:8EA4: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x034EB6 23:8EA6: B1 34     LDA (ram_plr_data),Y
; выход если игрок с мячом на своей половине поля, типа недостаточно близко к воротам соперника
C - - - - 0x034EB8 23:8EA8: 10 3E     BPL bra_8EE8_выход
C - - - - 0x034EBA 23:8EAA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034EBD 23:8EAD: 8D FC 05  STA ram_принимающий
C - - - - 0x034EC0 23:8EB0: A9 01     LDA #$01
bra_8EB2_найти_цубасу_в_команде:
C - - - - 0x034EC2 23:8EB2: 48        PHA
C - - - - 0x034EC3 23:8EB3: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x034EC6 23:8EB6: A0 00     LDY #con_игрок_номер
C - - - - 0x034EC8 23:8EB8: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034ECA 23:8EBA: C9 01     CMP #$01
C - - - - 0x034ECC 23:8EBC: F0 06     BEQ bra_8EC4_цубаса_найден
C - - - - 0x034ECE 23:8EBE: 68        PLA
C - - - - 0x034ECF 23:8EBF: 18        CLC
C - - - - 0x034ED0 23:8EC0: 69 01     ADC #$01
C - - - - 0x034ED2 23:8EC2: D0 EE     BNE bra_8EB2_найти_цубасу_в_команде
bra_8EC4_цубаса_найден:
C - - - - 0x034ED4 23:8EC4: 68        PLA
C - - - - 0x034ED5 23:8EC5: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x034ED8 23:8EC8: EE 46 04  INC ram_флаг_драйв_оверхеда
C - - - - 0x034EDB 23:8ECB: A9 00     LDA #$00
C - - - - 0x034EDD 23:8ECD: 8D 15 06  STA $0615
C - - - - 0x034EE0 23:8ED0: 8D 2D 06  STA $062D
C - - - - 0x034EE3 23:8ED3: A9 17     LDA #$17
C - - - - 0x034EE5 23:8ED5: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x034EE8 23:8ED8: A9 00     LDA #$00
C - - - - 0x034EEA 23:8EDA: 8D 3B 04  STA ram_действие_атаки
C - - - - 0x034EED 23:8EDD: A9 04     LDA #$04
C - - - - 0x034EEF 23:8EDF: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x034EF2 23:8EE2: A2 50     LDX #$50
C - - - - 0x034EF4 23:8EE4: 9A        TXS
C - - - - 0x034EF5 23:8EE5: 4C AC 85  JMP loc_85AC
bra_8EE8_выход:
C - - - - 0x034EF8 23:8EE8: 60        RTS

sub_8EE9:
C - - - - 0x034EF9 23:8EE9: 20 06 8D  JSR sub_8D06
C - - - - 0x034EFC 23:8EEC: A5 71     LDA ram_0071
C - - - - 0x034EFE 23:8EEE: 4A        LSR
C - - - - 0x034EFF 23:8EEF: 4A        LSR
C - - - - 0x034F00 23:8EF0: 8D 19 06  STA $0619
C - - - - 0x034F03 23:8EF3: AD 1D 06  LDA $061D
C - - - - 0x034F06 23:8EF6: 85 70     STA ram_0070
C - - - - 0x034F08 23:8EF8: AD 1C 06  LDA $061C
C - - - - 0x034F0B 23:8EFB: 0A        ASL
C - - - - 0x034F0C 23:8EFC: 26 70     ROL ram_0070
C - - - - 0x034F0E 23:8EFE: 0A        ASL
C - - - - 0x034F0F 23:8EFF: 26 70     ROL ram_0070
C - - - - 0x034F11 23:8F01: 0A        ASL
C - - - - 0x034F12 23:8F02: 26 70     ROL ram_0070
C - - - - 0x034F14 23:8F04: 0A        ASL
C - - - - 0x034F15 23:8F05: 26 70     ROL ram_0070
C - - - - 0x034F17 23:8F07: 0A        ASL
C - - - - 0x034F18 23:8F08: 26 70     ROL ram_0070
C - - - - 0x034F1A 23:8F0A: 0A        ASL
C - - - - 0x034F1B 23:8F0B: 26 70     ROL ram_0070
C - - - - 0x034F1D 23:8F0D: 85 6F     STA ram_006F
C - - - - 0x034F1F 23:8F0F: 20 1E C5  JSR sub_0x03CD4C
C - - - - 0x034F22 23:8F12: A5 6F     LDA ram_006F
C - - - - 0x034F24 23:8F14: A4 70     LDY ram_0070
C - - - - 0x034F26 23:8F16: F0 02     BEQ bra_8F1A
C - - - - 0x034F28 23:8F18: A9 FF     LDA #$FF
bra_8F1A:
C - - - - 0x034F2A 23:8F1A: A2 00     LDX #$00
C - - - - 0x034F2C 23:8F1C: A0 00     LDY #$00
C - - - - 0x034F2E 23:8F1E: 60        RTS

sub_8F1F:
C - - - - 0x034F2F 23:8F1F: 20 06 8D  JSR sub_8D06
C - - - - 0x034F32 23:8F22: AD 1C 06  LDA $061C
C - - - - 0x034F35 23:8F25: 85 67     STA ram_0067
C - - - - 0x034F37 23:8F27: AD 1D 06  LDA $061D
C - - - - 0x034F3A 23:8F2A: 85 68     STA ram_0068
C - - - - 0x034F3C 23:8F2C: A9 C0     LDA #$C0
C - - - - 0x034F3E 23:8F2E: 85 69     STA ram_0069
C - - - - 0x034F40 23:8F30: A9 00     LDA #$00
C - - - - 0x034F42 23:8F32: 85 6A     STA ram_006A
C - - - - 0x034F44 23:8F34: 20 21 C5  JSR sub_0x03CD1D
C - - - - 0x034F47 23:8F37: A5 6B     LDA ram_006B
C - - - - 0x034F49 23:8F39: 85 6F     STA ram_006F
C - - - - 0x034F4B 23:8F3B: A5 6C     LDA ram_006C
C - - - - 0x034F4D 23:8F3D: 85 70     STA ram_0070
C - - - - 0x034F4F 23:8F3F: 20 1E C5  JSR sub_0x03CD4C
C - - - - 0x034F52 23:8F42: A5 6F     LDA ram_006F
C - - - - 0x034F54 23:8F44: A4 70     LDY ram_0070
C - - - - 0x034F56 23:8F46: F0 02     BEQ bra_8F4A
C - - - - 0x034F58 23:8F48: A9 FF     LDA #$FF
bra_8F4A:
C - - - - 0x034F5A 23:8F4A: 85 3A     STA ram_003A
C - - - - 0x034F5C 23:8F4C: 20 59 8F  JSR sub_8F59
C - - - - 0x034F5F 23:8F4F: 18        CLC
C - - - - 0x034F60 23:8F50: 65 3A     ADC ram_003A
C - - - - 0x034F62 23:8F52: 90 02     BCC bra_8F56
C - - - - 0x034F64 23:8F54: A9 FF     LDA #$FF
bra_8F56:
C - - - - 0x034F66 23:8F56: A0 00     LDY #$00
C - - - - 0x034F68 23:8F58: 60        RTS

sub_8F59:
C - - - - 0x034F69 23:8F59: 20 51 C5  JSR sub_0x03CD87
C - - - - 0x034F6C 23:8F5C: A0 05     LDY #con_игрок_координата_X_lo
C - - - - 0x034F6E 23:8F5E: B1 34     LDA (ram_plr_data),Y
C - - - - 0x034F70 23:8F60: 38        SEC
C - - - - 0x034F71 23:8F61: ED 2B 06  SBC $062B
C - - - - 0x034F74 23:8F64: B0 02     BCS bra_8F68
C - - - - 0x034F76 23:8F66: A9 00     LDA #$00
bra_8F68:
C - - - - 0x034F78 23:8F68: A0 07     LDY #con_игрок_координата_Y_lo
C - - - - 0x034F7A 23:8F6A: 18        CLC
C - - - - 0x034F7B 23:8F6B: 71 34     ADC (ram_plr_data),Y
C - - - - 0x034F7D 23:8F6D: 90 02     BCC bra_8F71_выход
- - - - - 0x034F7F 23:8F6F: A9 FF     LDA #$FF
bra_8F71_выход:
C - - - - 0x034F81 23:8F71: 60        RTS

.export sub_0x034F82
sub_0x034F82:
sub_8F72:
; bzk беспозеное чтение номера
C D - - - 0x034F82 23:8F72: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x034F85 23:8F75: A9 06     LDA #$06
C - - - - 0x034F87 23:8F77: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x034F8A 23:8F7A: A9 00     LDA #$00
C - - - - 0x034F8C 23:8F7C: 85 3A     STA ram_003A
C - - - - 0x034F8E 23:8F7E: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x034F91 23:8F81: D0 17     BNE bra_8F9A
C - - - - 0x034F93 23:8F83: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x034F96 23:8F86: C9 02     CMP #$02
C - - - - 0x034F98 23:8F88: D0 0D     BNE bra_8F97
C - - - - 0x034F9A 23:8F8A: AD 00 06  LDA ram_колво_нападающих
C - - - - 0x034F9D 23:8F8D: D0 08     BNE bra_8F97
C - - - - 0x034F9F 23:8F8F: A9 00     LDA #$00
C - - - - 0x034FA1 23:8F91: 8D 3F 04  STA $043F
C - - - - 0x034FA4 23:8F94: 8D 40 04  STA $0440
bra_8F97:
C - - - - 0x034FA7 23:8F97: 20 FB 8F  JSR sub_8FFB
bra_8F9A:
C - - - - 0x034FAA 23:8F9A: 24 3A     BIT ram_003A
C - - - - 0x034FAC 23:8F9C: 30 0F     BMI bra_8FAD
C - - - - 0x034FAE 23:8F9E: AD E2 00  LDA ram_рандом_2
C - - - - 0x034FB1 23:8FA1: C9 08     CMP #$08
C - - - - 0x034FB3 23:8FA3: B0 08     BCS bra_8FAD
C - - - - 0x034FB5 23:8FA5: AD 3C 04  LDA ram_подтип_действия
C - - - - 0x034FB8 23:8FA8: 09 80     ORA #$80
C - - - - 0x034FBA 23:8FAA: 8D 3C 04  STA ram_подтип_действия
bra_8FAD:
C - - - - 0x034FBD 23:8FAD: A2 00     LDX #$00
C - - - - 0x034FBF 23:8FAF: AD E2 00  LDA ram_рандом_2
C - - - - 0x034FC2 23:8FB2: 6D E3 00  ADC ram_рандом_3
C - - - - 0x034FC5 23:8FB5: 6A        ROR
C - - - - 0x034FC6 23:8FB6: 09 80     ORA #$80
C - - - - 0x034FC8 23:8FB8: 2C 3C 04  BIT ram_подтип_действия
C - - - - 0x034FCB 23:8FBB: 10 03     BPL bra_8FC0
C - - - - 0x034FCD 23:8FBD: E8        INX
C - - - - 0x034FCE 23:8FBE: 29 7F     AND #$7F
bra_8FC0:
C - - - - 0x034FD0 23:8FC0: 69 00     ADC #$00
C - - - - 0x034FD2 23:8FC2: 90 01     BCC bra_8FC5
C - - - - 0x034FD4 23:8FC4: E8        INX
bra_8FC5:
C - - - - 0x034FD5 23:8FC5: 85 67     STA ram_0067
C - - - - 0x034FD7 23:8FC7: 86 68     STX ram_0068
C - - - - 0x034FD9 23:8FC9: 24 3A     BIT ram_003A
C - - - - 0x034FDB 23:8FCB: 10 10     BPL bra_8FDD
C - - - - 0x034FDD 23:8FCD: 46 33     LSR ram_0033
C - - - - 0x034FDF 23:8FCF: 66 32     ROR ram_0032
C - - - - 0x034FE1 23:8FD1: 46 33     LSR ram_0033
C - - - - 0x034FE3 23:8FD3: 66 32     ROR ram_0032
C - - - - 0x034FE5 23:8FD5: 46 33     LSR ram_0033
C - - - - 0x034FE7 23:8FD7: 66 32     ROR ram_0032
C - - - - 0x034FE9 23:8FD9: 46 33     LSR ram_0033
C - - - - 0x034FEB 23:8FDB: 66 32     ROR ram_0032
bra_8FDD:
C - - - - 0x034FED 23:8FDD: A5 32     LDA ram_0032
C - - - - 0x034FEF 23:8FDF: 85 69     STA ram_0069
C - - - - 0x034FF1 23:8FE1: A5 33     LDA ram_0033
C - - - - 0x034FF3 23:8FE3: 85 6A     STA ram_006A
C - - - - 0x034FF5 23:8FE5: 20 21 C5  JSR sub_0x03CD1D
C - - - - 0x034FF8 23:8FE8: A5 6C     LDA ram_006C
C - - - - 0x034FFA 23:8FEA: 8D 1C 06  STA $061C
C - - - - 0x034FFD 23:8FED: A5 6D     LDA ram_006D
C - - - - 0x034FFF 23:8FEF: 8D 1D 06  STA $061D
C - - - - 0x035002 23:8FF2: 60        RTS

sub_8FF3:
C - - - - 0x035003 23:8FF3: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035006 23:8FF6: D0 03     BNE bra_8FFB
C - - - - 0x035008 23:8FF8: 85 3A     STA ram_003A
C - - - - 0x03500A 23:8FFA: 60        RTS
bra_8FFB:
sub_8FFB:
C - - - - 0x03500B 23:8FFB: A9 00     LDA #$00
C - - - - 0x03500D 23:8FFD: 85 3A     STA ram_003A
C - - - - 0x03500F 23:8FFF: A0 00     LDY #con_игрок_номер
C - - - - 0x035011 23:9001: B1 34     LDA (ram_plr_data),Y
; проверка на мисуги
C - - - - 0x035013 23:9003: C9 20     CMP #$20
C - - - - 0x035015 23:9005: D0 28     BNE bra_902F
C - - - - 0x035017 23:9007: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03501A 23:900A: D0 0C     BNE bra_9018
C - - - - 0x03501C 23:900C: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x03501F 23:900F: D0 07     BNE bra_9018
C - - - - 0x035021 23:9011: AD 3C 04  LDA ram_подтип_действия
C - - - - 0x035024 23:9014: C9 03     CMP #$03
C - - - - 0x035026 23:9016: B0 17     BCS bra_902F
bra_9018:
C - - - - 0x035028 23:9018: AD 40 04  LDA $0440
C - - - - 0x03502B 23:901B: 4A        LSR
C - - - - 0x03502C 23:901C: AA        TAX
C - - - - 0x03502D 23:901D: AD 3F 04  LDA $043F
C - - - - 0x035030 23:9020: 6A        ROR
C - - - - 0x035031 23:9021: 18        CLC
C - - - - 0x035032 23:9022: 6D 3F 04  ADC $043F
C - - - - 0x035035 23:9025: 8D 3F 04  STA $043F
C - - - - 0x035038 23:9028: 8A        TXA
C - - - - 0x035039 23:9029: 6D 40 04  ADC $0440
C - - - - 0x03503C 23:902C: 8D 40 04  STA $0440
bra_902F:
C - - - - 0x03503F 23:902F: A0 01     LDY #con_игрок_энергия_lo
C - - - - 0x035041 23:9031: 38        SEC
C - - - - 0x035042 23:9032: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035044 23:9034: ED 3F 04  SBC $043F
C - - - - 0x035047 23:9037: AA        TAX
C - - - - 0x035048 23:9038: C8        INY
C - - - - 0x035049 23:9039: B1 34     LDA (ram_plr_data),Y
C - - - - 0x03504B 23:903B: ED 40 04  SBC $0440
C - - - - 0x03504E 23:903E: 10 07     BPL bra_9047
C - - - - 0x035050 23:9040: A2 00     LDX #$00
C - - - - 0x035052 23:9042: A9 00     LDA #$00
C - - - - 0x035054 23:9044: 38        SEC
C - - - - 0x035055 23:9045: 66 3A     ROR ram_003A
bra_9047:
C - - - - 0x035057 23:9047: 91 34     STA (ram_plr_data),Y
C - - - - 0x035059 23:9049: 88        DEY
C - - - - 0x03505A 23:904A: 8A        TXA
C - - - - 0x03505B 23:904B: 91 34     STA (ram_plr_data),Y
C - - - - 0x03505D 23:904D: 60        RTS

.export sub_0x03505E
sub_0x03505E:
sub_904E:
; очистить защиту и энергию соперников
C D - - - 0x03505E 23:904E: 2C 4B 04  BIT $044B
C - - - - 0x035061 23:9051: 10 1C     BPL bra_906F_выход
C - - - - 0x035063 23:9053: A9 00     LDA #$00
C - - - - 0x035065 23:9055: 8D 4B 04  STA $044B
C - - - - 0x035068 23:9058: 8D 2F 00  STA ram_защита_справа
C - - - - 0x03506B 23:905B: A9 0C     LDA #$0C
bra_905D_цикл:
C - - - - 0x03506D 23:905D: 48        PHA
C - - - - 0x03506E 23:905E: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035071 23:9061: A0 01     LDY #con_игрок_энергия_lo
C - - - - 0x035073 23:9063: A9 00     LDA #$00
C - - - - 0x035075 23:9065: 91 34     STA (ram_plr_data),Y
C - - - - 0x035077 23:9067: 68        PLA
C - - - - 0x035078 23:9068: 18        CLC
C - - - - 0x035079 23:9069: 69 01     ADC #$01
C - - - - 0x03507B 23:906B: C9 16     CMP #$16
C - - - - 0x03507D 23:906D: D0 EE     BNE bra_905D_цикл
bra_906F_выход:
C - - - - 0x03507F 23:906F: 60        RTS

sub_9070:
C - - - - 0x035080 23:9070: 2C 4C 04  BIT $044C
C - - - - 0x035083 23:9073: 10 0F     BPL bra_9084_выход
C - - - - 0x035085 23:9075: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x035088 23:9078: C9 14     CMP #$14
C - - - - 0x03508A 23:907A: D0 08     BNE bra_9084_выход
C - - - - 0x03508C 23:907C: A9 00     LDA #$00
C - - - - 0x03508E 23:907E: 8D 4C 04  STA $044C
C - - - - 0x035091 23:9081: 8D F1 03  STA $03F1
bra_9084_выход:
C - - - - 0x035094 23:9084: 60        RTS

sub_9085_клон_ссыт_напороться_на_мяч:
; сработал когда оставшиеся клоны ссут подстраиваться на мяч
; сработало во время драйв удара и драйв паса
; хз на что этот код влияет
C - - - - 0x035095 23:9085: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x035098 23:9088: BD 8E 90  LDA tbl_908E_затраченное_время,X
C - - - - 0x03509B 23:908B: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма

tbl_908E_затраченное_время:
- D - - - 0x03509E 23:908E: 02        .byte $02    ; <い>
- D - - - 0x03509F 23:908F: 01        .byte $01    ; <あ>
- D - - - 0x0350A0 23:9090: 01        .byte $01    ; <あ>
- D - - - 0x0350A1 23:9091: 04        .byte $04    ; <え>
- D - - - 0x0350A2 23:9092: 04        .byte $04    ; <え>
- D - - - 0x0350A3 23:9093: 01        .byte $01    ; <あ>
- D - - - 0x0350A4 23:9094: 02        .byte $02    ; <い>

loc_9095:
sub_9095:
C D - - - 0x0350A5 23:9095: 08        PHP
C - - - - 0x0350A6 23:9096: AD 3D 04  LDA $043D
C - - - - 0x0350A9 23:9099: 0A        ASL
C - - - - 0x0350AA 23:909A: AA        TAX
C - - - - 0x0350AB 23:909B: 28        PLP
C - - - - 0x0350AC 23:909C: 90 01     BCC bra_909F
C - - - - 0x0350AE 23:909E: E8        INX
bra_909F:
C - - - - 0x0350AF 23:909F: BD F4 90  LDA tbl_90F4,X
C - - - - 0x0350B2 23:90A2: AC 42 04  LDY ram_игрок_без_мяча
C - - - - 0x0350B5 23:90A5: F0 33     BEQ bra_90DA
C - - - - 0x0350B7 23:90A7: C0 0B     CPY #$0B
C - - - - 0x0350B9 23:90A9: F0 2F     BEQ bra_90DA
C - - - - 0x0350BB 23:90AB: 8A        TXA
C - - - - 0x0350BC 23:90AC: 48        PHA
C - - - - 0x0350BD 23:90AD: 4A        LSR
C - - - - 0x0350BE 23:90AE: 90 13     BCC bra_90C3
C - - - - 0x0350C0 23:90B0: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0350C3 23:90B3: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0350C6 23:90B6: AE 3D 04  LDX $043D
C - - - - 0x0350C9 23:90B9: BD 02 91  LDA tbl_9102,X
C - - - - 0x0350CC 23:90BC: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x0350CE 23:90BE: 91 34     STA (ram_plr_data),Y
C - - - - 0x0350D0 23:90C0: 4C D5 90  JMP loc_90D5
bra_90C3:
C - - - - 0x0350D3 23:90C3: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0350D6 23:90C6: F0 0D     BEQ bra_90D5
C - - - - 0x0350D8 23:90C8: C9 0B     CMP #$0B
C - - - - 0x0350DA 23:90CA: F0 09     BEQ bra_90D5
C - - - - 0x0350DC 23:90CC: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0350DF 23:90CF: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x0350E1 23:90D1: A9 05     LDA #$05
C - - - - 0x0350E3 23:90D3: 91 34     STA (ram_plr_data),Y
bra_90D5:
loc_90D5:
C D - - - 0x0350E5 23:90D5: 68        PLA
C - - - - 0x0350E6 23:90D6: AA        TAX
C - - - - 0x0350E7 23:90D7: BD E6 90  LDA tbl_90E6_затраченное_время,X
bra_90DA:
C - - - - 0x0350EA 23:90DA: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма

sub_90DD:
C - - - - 0x0350ED 23:90DD: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x0350F0 23:90E0: BD 09 91  LDA tbl_9109_затраченное_время,X
C - - - - 0x0350F3 23:90E3: 4C 03 C6  JMP loc_0x03D1A3_уменьшить_таймер_времени_тайма

tbl_90E6_затраченное_время:
- D - - - 0x0350F6 23:90E6: 02        .byte $02    ; <い>
- D - - - 0x0350F7 23:90E7: 01        .byte $01    ; <あ>
- D - - - 0x0350F8 23:90E8: 01        .byte $01    ; <あ>
- D - - - 0x0350F9 23:90E9: 01        .byte $01    ; <あ>
- D - - - 0x0350FA 23:90EA: 02        .byte $02    ; <い>
- D - - - 0x0350FB 23:90EB: 01        .byte $01    ; <あ>
- D - - - 0x0350FC 23:90EC: 01        .byte $01    ; <あ>
- D - - - 0x0350FD 23:90ED: 00        .byte $00
- D - - - 0x0350FE 23:90EE: 01        .byte $01    ; <あ>
- D - - - 0x0350FF 23:90EF: 00        .byte $00
- - - - - 0x035100 23:90F0: 00        .byte $00
- D - - - 0x035101 23:90F1: 00        .byte $00
- - - - - 0x035102 23:90F2: 00        .byte $00
- D - - - 0x035103 23:90F3: 00        .byte $00

tbl_90F4:
- D - - - 0x035104 23:90F4: 00        .byte $00
- D - - - 0x035105 23:90F5: 00        .byte $00
- D - - - 0x035106 23:90F6: 00        .byte $00
- D - - - 0x035107 23:90F7: 00        .byte $00
- D - - - 0x035108 23:90F8: 00        .byte $00
- D - - - 0x035109 23:90F9: 00        .byte $00
- D - - - 0x03510A 23:90FA: 02        .byte $02    ; <い>
- D - - - 0x03510B 23:90FB: 00        .byte $00
- D - - - 0x03510C 23:90FC: 00        .byte $00
- D - - - 0x03510D 23:90FD: 00        .byte $00
- - - - - 0x03510E 23:90FE: 00        .byte $00
- D - - - 0x03510F 23:90FF: 00        .byte $00
- - - - - 0x035110 23:9100: 00        .byte $00
- D - - - 0x035111 23:9101: 00        .byte $00

tbl_9102:
- D - - - 0x035112 23:9102: 06        .byte $06    ; <か>
- D - - - 0x035113 23:9103: 06        .byte $06    ; <か>
- D - - - 0x035114 23:9104: 06        .byte $06    ; <か>
- D - - - 0x035115 23:9105: 06        .byte $06    ; <か>
- D - - - 0x035116 23:9106: 06        .byte $06    ; <か>
- D - - - 0x035117 23:9107: 00        .byte $00
- D - - - 0x035118 23:9108: 00        .byte $00

tbl_9109_затраченное_время:
- D - - - 0x035119 23:9109: 01        .byte $01    ; <あ>
- D - - - 0x03511A 23:910A: 00        .byte $00
- D - - - 0x03511B 23:910B: 00        .byte $00
- D - - - 0x03511C 23:910C: 01        .byte $01    ; <あ>
- D - - - 0x03511D 23:910D: 02        .byte $02    ; <い>
- D - - - 0x03511E 23:910E: 00        .byte $00
- D - - - 0x03511F 23:910F: 01        .byte $01    ; <あ>

sub_9110:
C - - - - 0x035120 23:9110: 18        CLC
C - - - - 0x035121 23:9111: 6D F9 05  ADC ram_loss
C - - - - 0x035124 23:9114: 8D F9 05  STA ram_loss
C - - - - 0x035127 23:9117: 8A        TXA
C - - - - 0x035128 23:9118: 20 03 C6  JSR sub_0x03D1A3_уменьшить_таймер_времени_тайма
C - - - - 0x03512B 23:911B: 60        RTS

loc_911C:
C D - - - 0x03512C 23:911C: A9 29     LDA #$29
C - - - - 0x03512E 23:911E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035131 23:9121: 20 7B 98  JSR sub_987B
C - - - - 0x035134 23:9124: AD 35 06  LDA $0635
C - - - - 0x035137 23:9127: 29 F8     AND #$F8
C - - - - 0x035139 23:9129: 18        CLC
C - - - - 0x03513A 23:912A: 69 04     ADC #$04
C - - - - 0x03513C 23:912C: 8D 35 06  STA $0635
C - - - - 0x03513F 23:912F: A9 4C     LDA #$4C
C - - - - 0x035141 23:9131: 2C 37 06  BIT $0637
C - - - - 0x035144 23:9134: 10 02     BPL bra_9138
C - - - - 0x035146 23:9136: A9 B4     LDA #$B4
bra_9138:
C - - - - 0x035148 23:9138: 8D 37 06  STA $0637
C - - - - 0x03514B 23:913B: A2 00     LDX #$00
C - - - - 0x03514D 23:913D: 2C 35 06  BIT $0635
C - - - - 0x035150 23:9140: 10 01     BPL bra_9143
C - - - - 0x035152 23:9142: E8        INX
bra_9143:
C - - - - 0x035153 23:9143: 2C 37 06  BIT $0637
C - - - - 0x035156 23:9146: 10 02     BPL bra_914A
C - - - - 0x035158 23:9148: E8        INX
C - - - - 0x035159 23:9149: E8        INX
bra_914A:
C - - - - 0x03515A 23:914A: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03515D 23:914D: F0 04     BEQ bra_9153
C - - - - 0x03515F 23:914F: 8A        TXA
C - - - - 0x035160 23:9150: 49 03     EOR #$03
C - - - - 0x035162 23:9152: AA        TAX
bra_9153:
C - - - - 0x035163 23:9153: BD EA 92  LDA tbl_92EA,X
C - - - - 0x035166 23:9156: 18        CLC
C - - - - 0x035167 23:9157: 6D FB 05  ADC ram_команда_с_мячом
C - - - - 0x03516A 23:915A: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x03516D 23:915D: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035170 23:9160: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x035172 23:9162: AD 35 06  LDA $0635
C - - - - 0x035175 23:9165: 91 34     STA (ram_plr_data),Y
C - - - - 0x035177 23:9167: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x035179 23:9169: AD 37 06  LDA $0637
C - - - - 0x03517C 23:916C: 91 34     STA (ram_plr_data),Y
C - - - - 0x03517E 23:916E: AE 35 06  LDX $0635
C - - - - 0x035181 23:9171: A9 08     LDA #$08
C - - - - 0x035183 23:9173: 2C 37 06  BIT $0637
C - - - - 0x035186 23:9176: 10 02     BPL bra_917A
C - - - - 0x035188 23:9178: A9 F8     LDA #$F8
bra_917A:
C - - - - 0x03518A 23:917A: 18        CLC
C - - - - 0x03518B 23:917B: 6D 37 06  ADC $0637
C - - - - 0x03518E 23:917E: A8        TAY
C - - - - 0x03518F 23:917F: 20 39 C5  JSR sub_0x03CDF2
C - - - - 0x035192 23:9182: 8D 24 06  STA $0624
C - - - - 0x035195 23:9185: 8D 1E 06  STA $061E
C - - - - 0x035198 23:9188: 20 D2 91  JSR sub_91D2
C - - - - 0x03519B 23:918B: A9 2A     LDA #$2A
C - - - - 0x03519D 23:918D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0351A0 23:9190: A9 02     LDA #$02
C - - - - 0x0351A2 23:9192: A2 0A     LDX #$0A
C - - - - 0x0351A4 23:9194: 20 10 91  JSR sub_9110
C - - - - 0x0351A7 23:9197: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - 0x0351AA 23:919A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0351AD 23:919D: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0351B0 23:91A0: AD 1E 06  LDA $061E
C - - - - 0x0351B3 23:91A3: 8D FE 05  STA $05FE
C - - - - 0x0351B6 23:91A6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x0351B9 23:91A9: 98        TYA
C - - - - 0x0351BA 23:91AA: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x0351BC 23:91AC: 91 34     STA (ram_plr_data),Y
C - - - - 0x0351BE 23:91AE: 8D 37 06  STA $0637
C - - - - 0x0351C1 23:91B1: 8A        TXA
C - - - - 0x0351C2 23:91B2: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x0351C4 23:91B4: 91 34     STA (ram_plr_data),Y
C - - - - 0x0351C6 23:91B6: 8D 35 06  STA $0635
C - - - - 0x0351C9 23:91B9: AD 24 06  LDA $0624
C - - - - 0x0351CC 23:91BC: 8D 38 06  STA $0638
C - - - - 0x0351CF 23:91BF: A9 00     LDA #$00
C - - - - 0x0351D1 23:91C1: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x0351D4 23:91C4: 8D 1A 06  STA $061A
C - - - - 0x0351D7 23:91C7: A9 01     LDA #$01
C - - - - 0x0351D9 23:91C9: 8D 1B 06  STA $061B
C - - - - 0x0351DC 23:91CC: 20 0C C6  JSR sub_0x03E74E
C - - - - 0x0351DF 23:91CF: 4C 3C C6  JMP loc_0x03DE7C

sub_91D2:
C - - - - 0x0351E2 23:91D2: A9 00     LDA #$00
C - - - - 0x0351E4 23:91D4: 85 11     STA ram_0011
C - - - - 0x0351E6 23:91D6: 85 12     STA ram_0012
C - - - - 0x0351E8 23:91D8: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0351EB 23:91DB: F0 03     BEQ bra_91E0
C - - - - 0x0351ED 23:91DD: 4C 98 92  JMP loc_9298
bra_91E0:
C - - - - 0x0351F0 23:91E0: A9 38     LDA #$38
C - - - - 0x0351F2 23:91E2: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0351F5 23:91E5: A9 81     LDA #$81
C - - - - 0x0351F7 23:91E7: 8D 2D 06  STA $062D
C - - - - 0x0351FA 23:91EA: A9 1F     LDA #$1F
C - - - - 0x0351FC 23:91EC: 8D 94 04  STA $0494
C - - - - 0x0351FF 23:91EF: A9 0F     LDA #$0F      ; pass_select_a_teammate
C - - - - 0x035201 23:91F1: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035204 23:91F4: A9 00     LDA #$00
C - - - - 0x035206 23:91F6: 8D 26 06  STA $0626
C - - - - 0x035209 23:91F9: 8D 27 06  STA $0627
loc_91FC:
C D - - - 0x03520C 23:91FC: A9 01     LDA #$01
C - - - - 0x03520E 23:91FE: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035211 23:9201: AD 1C 00  LDA ram_удержанные
C - - - - 0x035214 23:9204: 29 03     AND #con_btn_Right + con_btn_Left
C - - - - 0x035216 23:9206: F0 2C     BEQ bra_9234
C - - - - 0x035218 23:9208: 4A        LSR
C - - - - 0x035219 23:9209: A9 0C     LDA #$0C
C - - - - 0x03521B 23:920B: B0 02     BCS bra_920F
C - - - - 0x03521D 23:920D: A9 F4     LDA #$F4
bra_920F:
C - - - - 0x03521F 23:920F: 18        CLC
C - - - - 0x035220 23:9210: 6D 26 06  ADC $0626
C - - - - 0x035223 23:9213: AA        TAX
C - - - - 0x035224 23:9214: 10 05     BPL bra_921B
- - - - - 0x035226 23:9216: 49 FF     EOR #$FF
- - - - - 0x035228 23:9218: 18        CLC
- - - - - 0x035229 23:9219: 69 01     ADC #$01
bra_921B:
C - - - - 0x03522B 23:921B: C9 3C     CMP #$3C
C - - - - 0x03522D 23:921D: 90 03     BCC bra_9222
C - - - - 0x03522F 23:921F: AE 26 06  LDX $0626
bra_9222:
C - - - - 0x035232 23:9222: 8A        TXA
C - - - - 0x035233 23:9223: 18        CLC
C - - - - 0x035234 23:9224: 6D 1E 06  ADC $061E
C - - - - 0x035237 23:9227: C9 F0     CMP #$F0
C - - - - 0x035239 23:9229: 90 03     BCC bra_922E
C - - - - 0x03523B 23:922B: AE 26 06  LDX $0626
bra_922E:
C - - - - 0x03523E 23:922E: 8E 26 06  STX $0626
C - - - - 0x035241 23:9231: 4C 5F 92  JMP loc_925F
bra_9234:
C - - - - 0x035244 23:9234: AD 1C 00  LDA ram_удержанные
C - - - - 0x035247 23:9237: 29 0C     AND #con_btn_Down + con_btn_Up
C - - - - 0x035249 23:9239: F0 45     BEQ bra_9280
C - - - - 0x03524B 23:923B: 4A        LSR
C - - - - 0x03524C 23:923C: 4A        LSR
C - - - - 0x03524D 23:923D: 4A        LSR
C - - - - 0x03524E 23:923E: A9 01     LDA #$01
C - - - - 0x035250 23:9240: B0 02     BCS bra_9244
C - - - - 0x035252 23:9242: A9 FF     LDA #$FF
bra_9244:
C - - - - 0x035254 23:9244: 2C 37 06  BIT $0637
C - - - - 0x035257 23:9247: 10 05     BPL bra_924E
C - - - - 0x035259 23:9249: 49 FF     EOR #$FF
C - - - - 0x03525B 23:924B: 18        CLC
C - - - - 0x03525C 23:924C: 69 01     ADC #$01
bra_924E:
C - - - - 0x03525E 23:924E: 18        CLC
C - - - - 0x03525F 23:924F: 6D 27 06  ADC $0627
C - - - - 0x035262 23:9252: 10 02     BPL bra_9256
- - - - - 0x035264 23:9254: A9 00     LDA #$00
bra_9256:
C - - - - 0x035266 23:9256: C9 05     CMP #$05
C - - - - 0x035268 23:9258: 90 02     BCC bra_925C
C - - - - 0x03526A 23:925A: A9 04     LDA #$04
bra_925C:
C - - - - 0x03526C 23:925C: 8D 27 06  STA $0627
loc_925F:
C D - - - 0x03526F 23:925F: AD 1E 06  LDA $061E
C - - - - 0x035272 23:9262: 18        CLC
C - - - - 0x035273 23:9263: 6D 26 06  ADC $0626
C - - - - 0x035276 23:9266: 8D 24 06  STA $0624
C - - - - 0x035279 23:9269: AD 27 06  LDA $0627
C - - - - 0x03527C 23:926C: 2C 37 06  BIT $0637
C - - - - 0x03527F 23:926F: 10 05     BPL bra_9276
C - - - - 0x035281 23:9271: 49 FF     EOR #$FF
C - - - - 0x035283 23:9273: 18        CLC
C - - - - 0x035284 23:9274: 69 01     ADC #$01
bra_9276:
C - - - - 0x035286 23:9276: 18        CLC
C - - - - 0x035287 23:9277: 6D 24 06  ADC $0624
C - - - - 0x03528A 23:927A: 8D 24 06  STA $0624
C - - - - 0x03528D 23:927D: 20 3F C6  JSR loc_0x03D907
bra_9280:
C - - - - 0x035290 23:9280: A9 80     LDA #con_btn_A
C - - - - 0x035292 23:9282: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035295 23:9285: D0 03     BNE bra_928A
C - - - - 0x035297 23:9287: 4C FC 91  JMP loc_91FC
bra_928A:
C - - - - 0x03529A 23:928A: 20 42 C6  JSR loc_0x03D862
C - - - - 0x03529D 23:928D: B0 03     BCS bra_9292
- - - - - 0x03529F 23:928F: 4C FC 91  JMP loc_91FC
bra_9292:
C - - - - 0x0352A2 23:9292: A9 00     LDA #$00
C - - - - 0x0352A4 23:9294: 8D 2D 06  STA $062D
C - - - - 0x0352A7 23:9297: 60        RTS

loc_9298:
C D - - - 0x0352A8 23:9298: A9 0C     LDA #$0C
C - - - - 0x0352AA 23:929A: 85 3A     STA ram_003A
bra_929C:
C - - - - 0x0352AC 23:929C: A5 3A     LDA ram_003A
C - - - - 0x0352AE 23:929E: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0352B1 23:92A1: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x0352B3 23:92A3: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0352B5 23:92A5: 38        SEC
C - - - - 0x0352B6 23:92A6: ED 35 06  SBC $0635
C - - - - 0x0352B9 23:92A9: B0 04     BCS bra_92AF
- - - - - 0x0352BB 23:92AB: 49 FF     EOR #$FF
- - - - - 0x0352BD 23:92AD: 69 01     ADC #$01
bra_92AF:
C - - - - 0x0352BF 23:92AF: C9 20     CMP #$20
C - - - - 0x0352C1 23:92B1: B0 12     BCS bra_92C5
C - - - - 0x0352C3 23:92B3: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x0352C5 23:92B5: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0352C7 23:92B7: 38        SEC
C - - - - 0x0352C8 23:92B8: ED 37 06  SBC $0637
C - - - - 0x0352CB 23:92BB: B0 04     BCS bra_92C1
- - - - - 0x0352CD 23:92BD: 49 FF     EOR #$FF
- - - - - 0x0352CF 23:92BF: 69 01     ADC #$01
bra_92C1:
C - - - - 0x0352D1 23:92C1: C9 20     CMP #$20
C - - - - 0x0352D3 23:92C3: 90 1F     BCC bra_92E4
bra_92C5:
C - - - - 0x0352D5 23:92C5: E6 3A     INC ram_003A
C - - - - 0x0352D7 23:92C7: A5 3A     LDA ram_003A
C - - - - 0x0352D9 23:92C9: C9 16     CMP #$16
C - - - - 0x0352DB 23:92CB: D0 CF     BNE bra_929C

; bzk
- - - - - 0x0352DD 23:92CD: A9 14     LDA #$14
- - - - - 0x0352DF 23:92CF: 85 3A     STA ram_003A
- - - - - 0x0352E1 23:92D1: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
- - - - - 0x0352E4 23:92D4: AD 1E 06  LDA $061E
- - - - - 0x0352E7 23:92D7: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
- - - - - 0x0352EA 23:92DA: 98        TYA
- - - - - 0x0352EB 23:92DB: A0 08     LDY #con_игрок_координата_Y_hi
- - - - - 0x0352ED 23:92DD: 91 34     STA (ram_plr_data),Y
- - - - - 0x0352EF 23:92DF: 8A        TXA
- - - - - 0x0352F0 23:92E0: A0 06     LDY #con_игрок_координата_X_hi
- - - - - 0x0352F2 23:92E2: 91 34     STA (ram_plr_data),Y

bra_92E4:
C - - - - 0x0352F4 23:92E4: A5 3A     LDA ram_003A
C - - - - 0x0352F6 23:92E6: 8D FC 05  STA ram_принимающий
C - - - - 0x0352F9 23:92E9: 60        RTS

tbl_92EA:
- D - - - 0x0352FA 23:92EA: 01        .byte $01    ; <あ>
- D - - - 0x0352FB 23:92EB: 05        .byte $05    ; <お>
- - - - - 0x0352FC 23:92EC: 02        .byte $02    ; <い>
- D - - - 0x0352FD 23:92ED: 07        .byte $07    ; <き>

loc_92EE:
C D - - - 0x0352FE 23:92EE: A9 24     LDA #$24
C - - - - 0x035300 23:92F0: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035303 23:92F3: A9 00     LDA #$00
C - - - - 0x035305 23:92F5: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x035308 23:92F8: 20 7B 98  JSR sub_987B
C - - - - 0x03530B 23:92FB: A2 06     LDX #$06
C - - - - 0x03530D 23:92FD: 2C 37 06  BIT $0637
C - - - - 0x035310 23:9300: 10 01     BPL bra_9303
C - - - - 0x035312 23:9302: E8        INX
bra_9303:
C - - - - 0x035313 23:9303: 8E 1E 06  STX $061E
C - - - - 0x035316 23:9306: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035319 23:9309: F0 08     BEQ bra_9313
C - - - - 0x03531B 23:930B: A9 09     LDA #$09
C - - - - 0x03531D 23:930D: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x035320 23:9310: 4C 18 93  JMP loc_9318
bra_9313:
C - - - - 0x035323 23:9313: A9 2E     LDA #$2E      ; corner_kick_taker
C - - - - 0x035325 23:9315: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
loc_9318:
C D - - - 0x035328 23:9318: AD 1E 06  LDA $061E
C - - - - 0x03532B 23:931B: 20 0D 9E  JSR sub_9E0D
C - - - - 0x03532E 23:931E: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - 0x035331 23:9321: B0 05     BCS bra_9328
C - - - - 0x035333 23:9323: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035336 23:9326: F0 EB     BEQ bra_9313
bra_9328:
C - - - - 0x035338 23:9328: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03533B 23:932B: D0 08     BNE bra_9335
C - - - - 0x03533D 23:932D: A9 04     LDA #$04
C - - - - 0x03533F 23:932F: 8D 21 06  STA $0621
C - - - - 0x035342 23:9332: 20 00 C6  JSR sub_0x03D575
bra_9335:
C - - - - 0x035345 23:9335: 20 72 8F  JSR sub_8F72
C - - - - 0x035348 23:9338: A9 01     LDA #$01
C - - - - 0x03534A 23:933A: A2 12     LDX #$12
C - - - - 0x03534C 23:933C: 20 10 91  JSR sub_9110
C - - - - 0x03534F 23:933F: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - 0x035352 23:9342: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x035355 23:9345: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x035358 23:9348: 4C 93     .word ofs_934C_00
- D - I - 0x03535A 23:934A: 59 93     .word ofs_9359_01

ofs_934C_00:
C - J - - 0x03535C 23:934C: A9 25     LDA #$25
C - - - - 0x03535E 23:934E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035361 23:9351: A9 66     LDA #$66
C - - - - 0x035363 23:9353: 8D 1A 06  STA $061A
C - - - - 0x035366 23:9356: 4C 1B C6  JMP loc_0x03DD12

ofs_9359_01:
C - J - - 0x035369 23:9359: A9 26     LDA #$26
C - - - - 0x03536B 23:935B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03536E 23:935E: A9 4D     LDA #$4D
C - - - - 0x035370 23:9360: 8D 1A 06  STA $061A
C - - - - 0x035373 23:9363: 4C 15 C6  JMP loc_0x03DE6E

ofs_81EA_04:
ofs_847C_04:
ofs_87D4_04:
C D - - - 0x035376 23:9366: A9 00     LDA #$00
C - - - - 0x035378 23:9368: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x03537B 23:936B: 20 9C 8B  JSR sub_8B9C
C - - - - 0x03537E 23:936E: 90 09     BCC bra_9379
C - - - - 0x035380 23:9370: 8A        TXA
C - - - - 0x035381 23:9371: 4D FB 05  EOR ram_команда_с_мячом
C - - - - 0x035384 23:9374: F0 03     BEQ bra_9379
C - - - - 0x035386 23:9376: 4C CF 94  JMP loc_94CF
bra_9379:
C - - - - 0x035389 23:9379: A9 2B     LDA #$2B
C - - - - 0x03538B 23:937B: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03538E 23:937E: 20 7B 98  JSR sub_987B
C - - - - 0x035391 23:9381: AD 35 06  LDA $0635
C - - - - 0x035394 23:9384: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x035397 23:9387: F0 05     BEQ bra_938E
C - - - - 0x035399 23:9389: 49 FF     EOR #$FF
C - - - - 0x03539B 23:938B: 18        CLC
C - - - - 0x03539C 23:938C: 69 01     ADC #$01
bra_938E:
C - - - - 0x03539E 23:938E: C9 A0     CMP #$A0
C - - - - 0x0353A0 23:9390: 90 03     BCC bra_9395
C - - - - 0x0353A2 23:9392: 4C E4 93  JMP loc_93E4
bra_9395:
loc_9395:
C D - - - 0x0353A5 23:9395: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0353A8 23:9398: F0 22     BEQ bra_93BC
C - - - - 0x0353AA 23:939A: AD E2 00  LDA ram_рандом_2
C - - - - 0x0353AD 23:939D: 29 0F     AND #$0F
C - - - - 0x0353AF 23:939F: C9 0A     CMP #$0A
C - - - - 0x0353B1 23:93A1: 90 03     BCC bra_93A6
C - - - - 0x0353B3 23:93A3: 38        SEC
C - - - - 0x0353B4 23:93A4: E9 0A     SBC #$0A
bra_93A6:
C - - - - 0x0353B6 23:93A6: 38        SEC
C - - - - 0x0353B7 23:93A7: 69 0B     ADC #$0B
C - - - - 0x0353B9 23:93A9: CD 41 04  CMP ram_игрок_с_мячом
C - - - - 0x0353BC 23:93AC: D0 09     BNE bra_93B7
C - - - - 0x0353BE 23:93AE: 18        CLC
C - - - - 0x0353BF 23:93AF: 69 01     ADC #$01
C - - - - 0x0353C1 23:93B1: C9 16     CMP #$16
C - - - - 0x0353C3 23:93B3: 90 02     BCC bra_93B7
- - - - - 0x0353C5 23:93B5: A9 0C     LDA #$0C
bra_93B7:
C - - - - 0x0353C7 23:93B7: 8D FC 05  STA ram_принимающий
C - - - - 0x0353CA 23:93BA: D0 03     BNE bra_93BF
bra_93BC:
C - - - - 0x0353CC 23:93BC: 20 DE 93  JSR sub_93DE
bra_93BF:
C - - - - 0x0353CF 23:93BF: A9 01     LDA #$01
C - - - - 0x0353D1 23:93C1: 8D 3B 04  STA ram_действие_атаки
C - - - - 0x0353D4 23:93C4: A9 00     LDA #$00
C - - - - 0x0353D6 23:93C6: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x0353D9 23:93C9: A9 18     LDA #$18
C - - - - 0x0353DB 23:93CB: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0353DE 23:93CE: A9 04     LDA #$04
C - - - - 0x0353E0 23:93D0: A2 12     LDX #$12
C - - - - 0x0353E2 23:93D2: 20 10 91  JSR sub_9110
C - - - - 0x0353E5 23:93D5: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - 0x0353E8 23:93D8: A2 50     LDX #$50
C - - - - 0x0353EA 23:93DA: 9A        TXS
C - - - - 0x0353EB 23:93DB: 4C 12 C6  JMP loc_0x03DE62

sub_93DE:
loc_93DE:
; бесконечный цикл
C D - - - 0x0353EE 23:93DE: 20 48 C6  JSR sub_0x03D7F8
C - - - - 0x0353F1 23:93E1: 4C DE 93  JMP loc_93DE

loc_93E4:
C D - - - 0x0353F4 23:93E4: AA        TAX
C - - - - 0x0353F5 23:93E5: AD 37 06  LDA $0637
C - - - - 0x0353F8 23:93E8: AC FB 05  LDY ram_команда_с_мячом
C - - - - 0x0353FB 23:93EB: F0 02     BEQ bra_93EF
C - - - - 0x0353FD 23:93ED: 49 FF     EOR #$FF
bra_93EF:
C - - - - 0x0353FF 23:93EF: A8        TAY
C - - - - 0x035400 23:93F0: 20 39 C5  JSR sub_0x03CDF2
C - - - - 0x035403 23:93F3: 85 3B     STA ram_003B
C - - - - 0x035405 23:93F5: A9 00     LDA #$00
bra_93F7:
C - - - - 0x035407 23:93F7: 48        PHA
C - - - - 0x035408 23:93F8: 0A        ASL
C - - - - 0x035409 23:93F9: AA        TAX
C - - - - 0x03540A 23:93FA: BD B9 9F  LDA tbl_9FB9,X
C - - - - 0x03540D 23:93FD: 85 3C     STA ram_003C
C - - - - 0x03540F 23:93FF: BD BA 9F  LDA tbl_9FB9 + 1,X
C - - - - 0x035412 23:9402: 85 3D     STA ram_003D
C - - - - 0x035414 23:9404: A0 00     LDY #$00
bra_9406:
C - - - - 0x035416 23:9406: B1 3C     LDA (ram_003C),Y
C - - - - 0x035418 23:9408: C9 FF     CMP #$FF
C - - - - 0x03541A 23:940A: F0 07     BEQ bra_9413
C - - - - 0x03541C 23:940C: C5 3B     CMP ram_003B
C - - - - 0x03541E 23:940E: F0 10     BEQ bra_9420
C - - - - 0x035420 23:9410: C8        INY
C - - - - 0x035421 23:9411: D0 F3     BNE bra_9406
bra_9413:
C - - - - 0x035423 23:9413: 68        PLA
C - - - - 0x035424 23:9414: 18        CLC
C - - - - 0x035425 23:9415: 69 01     ADC #$01
C - - - - 0x035427 23:9417: C9 05     CMP #$05
C - - - - 0x035429 23:9419: D0 03     BNE bra_941E
C - - - - 0x03542B 23:941B: 4C 95 93  JMP loc_9395
bra_941E:
C - - - - 0x03542E 23:941E: D0 D7     BNE bra_93F7
bra_9420:
C - - - - 0x035430 23:9420: 68        PLA
C - - - - 0x035431 23:9421: 8D 12 06  STA ram_флаг_защитника
bra_9424:
C - - - - 0x035434 23:9424: A9 27     LDA #$27      ; free_kick_taker
C - - - - 0x035436 23:9426: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - 0x035439 23:9429: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x03543C 23:942C: 20 0D 9E  JSR sub_9E0D
C - - - - 0x03543F 23:942F: 20 0F 9C  JSR sub_9C0F_перемещение_игроков
C - - - - 0x035442 23:9432: 90 F0     BCC bra_9424
bra_9434:
C - - - - 0x035444 23:9434: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035447 23:9437: D0 08     BNE bra_9441
C - - - - 0x035449 23:9439: A9 04     LDA #$04
C - - - - 0x03544B 23:943B: 8D 21 06  STA $0621
C - - - - 0x03544E 23:943E: 20 00 C6  JSR sub_0x03D575
bra_9441:
C - - - - 0x035451 23:9441: 20 70 94  JSR sub_9470
C - - - - 0x035454 23:9444: 90 EE     BCC bra_9434
C - - - - 0x035456 23:9446: A9 0E     LDA #$0E
C - - - - 0x035458 23:9448: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x03545B 23:944B: A9 18     LDA #$18
C - - - - 0x03545D 23:944D: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x035460 23:9450: E0 01     CPX #$01
C - - - - 0x035462 23:9452: F0 02     BEQ bra_9456
C - - - - 0x035464 23:9454: A9 1D     LDA #$1D
bra_9456:
C - - - - 0x035466 23:9456: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035469 23:9459: A9 04     LDA #$04
C - - - - 0x03546B 23:945B: A2 12     LDX #$12
C - - - - 0x03546D 23:945D: 20 10 91  JSR sub_9110
C - - - - 0x035470 23:9460: 20 F6 85  JSR sub_85F6_выбор_мелодии_команды
C - - - - 0x035473 23:9463: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x035476 23:9466: C9 01     CMP #$01
C - - - - 0x035478 23:9468: D0 03     BNE bra_946D
C - - - - 0x03547A 23:946A: 4C 12 C6  JMP loc_0x03DE62
bra_946D:
C - - - - 0x03547D 23:946D: 4C B0 8A  JMP loc_8AB0

sub_9470:
C - - - - 0x035480 23:9470: A2 03     LDX #$03
C - - - - 0x035482 23:9472: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035485 23:9475: D0 0A     BNE bra_9481
C - - - - 0x035487 23:9477: CA        DEX
C - - - - 0x035488 23:9478: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x03548D 23:947D: F0 02     BEQ bra_9481
C - - - - 0x03548F 23:947F: 38        SEC
C - - - - 0x035490 23:9480: 60        RTS
bra_9481:
C - - - - 0x035491 23:9481: 8E 12 06  STX ram_флаг_защитника
C - - - - 0x035494 23:9484: 8A        TXA
C - - - - 0x035495 23:9485: 18        CLC
C - - - - 0x035496 23:9486: 69 28     ADC #$28      ; 2A_aim_left_right, 2B_wall_left_right
C - - - - 0x035498 23:9488: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x03549B 23:948B: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03549E 23:948E: D0 05     BNE bra_9495
C - - - - 0x0354A0 23:9490: A9 03     LDA #$03      ; player_dribble_pass_shoot
C - - - - 0x0354A2 23:9492: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9495:
C - - - - 0x0354A5 23:9495: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0354A8 23:9498: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_949B:
C - - - - 0x0354AB 23:949B: A9 01     LDA #$01
C - - - - 0x0354AD 23:949D: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x0354B0 23:94A0: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - 0x0354B2 23:94A2: 2D 1E 00  AND ram_одноразовые
C - - - - 0x0354B5 23:94A5: F0 0B     BEQ bra_94B2
C - - - - 0x0354B7 23:94A7: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x0354BA 23:94AA: 49 40     EOR #$40
C - - - - 0x0354BC 23:94AC: 8D 12 06  STA ram_флаг_защитника
C - - - - 0x0354BF 23:94AF: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_94B2:
C - - - - 0x0354C2 23:94B2: A9 40     LDA #con_btn_B
C - - - - 0x0354C4 23:94B4: 2D 1E 00  AND ram_одноразовые
C - - - - 0x0354C7 23:94B7: F0 02     BEQ bra_94BB
- - - - - 0x0354C9 23:94B9: 18        CLC
- - - - - 0x0354CA 23:94BA: 60        RTS
bra_94BB:
C - - - - 0x0354CB 23:94BB: A9 80     LDA #con_btn_A
C - - - - 0x0354CD 23:94BD: 2D 1E 00  AND ram_одноразовые
C - - - - 0x0354D0 23:94C0: F0 D9     BEQ bra_949B
C - - - - 0x0354D2 23:94C2: A2 00     LDX #$00
C - - - - 0x0354D4 23:94C4: 2C 12 06  BIT ram_флаг_защитника
C - - - - 0x0354D7 23:94C7: 50 01     BVC bra_94CA
C - - - - 0x0354D9 23:94C9: E8        INX
bra_94CA:
C - - - - 0x0354DA 23:94CA: 8E 12 06  STX ram_флаг_защитника
C - - - - 0x0354DD 23:94CD: 38        SEC
C - - - - 0x0354DE 23:94CE: 60        RTS

loc_94CF:
C D - - - 0x0354DF 23:94CF: A9 1F     LDA #$1F
C - - - - 0x0354E1 23:94D1: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0354E4 23:94D4: 20 7B 98  JSR sub_987B
C - - - - 0x0354E7 23:94D7: A9 2F     LDA #$2F      ; select_penalty_taker
C - - - - 0x0354E9 23:94D9: 20 5A 9E  JSR sub_9E5A_отрисовка_меню_во_время_матча
C - - - - 0x0354EC 23:94DC: A9 20     LDA #$20
C - - - - 0x0354EE 23:94DE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0354F1 23:94E1: A9 05     LDA #$05
C - - - - 0x0354F3 23:94E3: 20 0D 9E  JSR sub_9E0D
C - - - - 0x0354F6 23:94E6: 20 45 C6  JSR sub_0x03E6FC
C - - - - 0x0354F9 23:94E9: 20 09 95  JSR sub_9509
C - - - - 0x0354FC 23:94EC: A9 21     LDA #$21
C - - - - 0x0354FE 23:94EE: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035501 23:94F1: A9 05     LDA #$05
C - - - - 0x035503 23:94F3: A2 00     LDX #$00
C - - - - 0x035505 23:94F5: 20 10 91  JSR sub_9110
C - - - - 0x035508 23:94F8: A9 01     LDA #$01
C - - - - 0x03550A 23:94FA: 8D 16 06  STA ram_номер_защитника
C - - - - 0x03550D 23:94FD: AD 12 06  LDA ram_флаг_защитника
C - - - - 0x035510 23:9500: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x035513 23:9503: AC 85     .word ofs_85AC_00
- D - I - 0x035515 23:9505: DF 8B     .word ofs_8BDF
- - - - - 0x035517 23:9507: 1C 86     .word ofs_861C_02

sub_9509:
C - - - - 0x035519 23:9509: A9 00     LDA #$00
C - - - - 0x03551B 23:950B: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x03551E 23:950E: 8D 3E 04  STA $043E
C - - - - 0x035521 23:9511: 8D 4E 04  STA ram_высота_мяча
C - - - - 0x035524 23:9514: A9 05     LDA #$05
C - - - - 0x035526 23:9516: 8D 21 06  STA $0621
C - - - - 0x035529 23:9519: 20 00 C6  JSR sub_0x03D575
C - - - - 0x03552C 23:951C: A9 0D     LDA #$0D
C - - - - 0x03552E 23:951E: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x035531 23:9521: 20 72 8F  JSR sub_8F72
C - - - - 0x035534 23:9524: A9 08     LDA #$08
C - - - - 0x035536 23:9526: 20 4B C5  JSR sub_0x03CE7E_прыжки_в_начале_банка_24
C - - - - 0x035539 23:9529: A9 00     LDA #$00
C - - - - 0x03553B 23:952B: 85 3A     STA ram_003A
C - - - - 0x03553D 23:952D: 85 3B     STA ram_003B
C - - - - 0x03553F 23:952F: A9 09     LDA #$09
C - - - - 0x035541 23:9531: A2 80     LDX #$80
C - - - - 0x035543 23:9533: 20 1F 8F  JSR sub_8F1F
C - - - - 0x035546 23:9536: 48        PHA
C - - - - 0x035547 23:9537: A0 00     LDY #$00
C - - - - 0x035549 23:9539: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x03554C 23:953C: EC 3D 04  CPX $043D
C - - - - 0x03554F 23:953F: D0 05     BNE bra_9546
C - - - - 0x035551 23:9541: C9 C8     CMP #$C8
C - - - - 0x035553 23:9543: B0 01     BCS bra_9546
C - - - - 0x035555 23:9545: C8        INY
bra_9546:
C - - - - 0x035556 23:9546: 98        TYA
C - - - - 0x035557 23:9547: D0 10     BNE bra_9559
C - - - - 0x035559 23:9549: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x03555C 23:954C: C9 08     CMP #$08
C - - - - 0x03555E 23:954E: F0 09     BEQ bra_9559
C - - - - 0x035560 23:9550: AD E2 00  LDA ram_рандом_2
C - - - - 0x035563 23:9553: C9 1F     CMP #$1F
C - - - - 0x035565 23:9555: B0 02     BCS bra_9559
C - - - - 0x035567 23:9557: A0 02     LDY #$02
bra_9559:
C - - - - 0x035569 23:9559: 68        PLA
C - - - - 0x03556A 23:955A: 20 48 81  STY ram_флаг_защитника
C - - - - 0x03556D 23:955D: 60        RTS

loc_955E:
C D - - - 0x03556E 23:955E: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035571 23:9561: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035574 23:9564: A0 0A     LDY #con_игрок_бездействие
C - - - - 0x035576 23:9566: A9 00     LDA #$00
C - - - - 0x035578 23:9568: 91 34     STA (ram_plr_data),Y
C - - - - 0x03557A 23:956A: A9 05     LDA #$05
C - - - - 0x03557C 23:956C: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x03557F 23:956F: 8E 41 04  STX ram_игрок_с_мячом
C - - - - 0x035582 23:9572: F0 02     BEQ bra_9576
C - - - - 0x035584 23:9574: A9 E9     LDA #$E9
bra_9576:
C - - - - 0x035586 23:9576: 8D FE 05  STA $05FE
C - - - - 0x035589 23:9579: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x03558C 23:957C: 8E 35 06  STX $0635
C - - - - 0x03558F 23:957F: 8C 37 06  STY $0637
C - - - - 0x035592 23:9582: A9 27     LDA #$27
C - - - - 0x035594 23:9584: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035597 23:9587: 20 7B 98  JSR sub_987B
C - - - - 0x03559A 23:958A: A9 0A     LDA #$0A
C - - - - 0x03559C 23:958C: 20 0D 9E  JSR sub_9E0D
C - - - - 0x03559F 23:958F: AD E2 00  LDA ram_рандом_2
C - - - - 0x0355A2 23:9592: 29 0F     AND #$0F
C - - - - 0x0355A4 23:9594: C9 0A     CMP #$0A
C - - - - 0x0355A6 23:9596: 90 02     BCC bra_959A
C - - - - 0x0355A8 23:9598: E9 0A     SBC #$0A
bra_959A:
C - - - - 0x0355AA 23:959A: 38        SEC
C - - - - 0x0355AB 23:959B: 6D FB 05  ADC ram_команда_с_мячом
C - - - - 0x0355AE 23:959E: 8D FC 05  STA ram_принимающий
C - - - - 0x0355B1 23:95A1: 20 6F C5  JSR sub_0x03D0A3_выбор_мелодии_команды
C - - - - 0x0355B4 23:95A4: 20 1E C6  JSR sub_0x03E069
C - - - - 0x0355B7 23:95A7: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0355BA 23:95AA: 20 6E 8E  JSR sub_8E6E
C - - - - 0x0355BD 23:95AD: A9 01     LDA #$01
C - - - - 0x0355BF 23:95AF: 8D 3B 04  STA ram_действие_атаки
C - - - - 0x0355C2 23:95B2: A9 00     LDA #$00
C - - - - 0x0355C4 23:95B4: 8D 3C 04  STA ram_подтип_действия
C - - - - 0x0355C7 23:95B7: A9 28     LDA #$28
C - - - - 0x0355C9 23:95B9: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0355CC 23:95BC: A9 02     LDA #$02
C - - - - 0x0355CE 23:95BE: A2 0C     LDX #$0C
C - - - - 0x0355D0 23:95C0: 20 10 91  JSR sub_9110
C - - - - 0x0355D3 23:95C3: A9 1A     LDA #$1A
C - - - - 0x0355D5 23:95C5: 8D 1A 06  STA $061A
C - - - - 0x0355D8 23:95C8: A9 01     LDA #$01
C - - - - 0x0355DA 23:95CA: 8D 1B 06  STA $061B
C - - - - 0x0355DD 23:95CD: 20 0C C6  JSR sub_0x03E74E
C - - - - 0x0355E0 23:95D0: AD FC 05  LDA ram_принимающий
C - - - - 0x0355E3 23:95D3: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x0355E6 23:95D6: A9 1C     LDA #$1C
C - - - - 0x0355E8 23:95D8: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0355EB 23:95DB: A2 50     LDX #$50
C - - - - 0x0355ED 23:95DD: 9A        TXS
C - - - - 0x0355EE 23:95DE: 4C 0F C6  JMP loc_0x03E0EF

.export sub_0x0355F1_вычисление_счета_пенальти
sub_0x0355F1_вычисление_счета_пенальти:
; 003A что-то типа максимального количества ударов, чтобы не нужно было пробивать лишний раз если все уже проебано
; голы хранятся в 0610 и 0611
; бряк срабатывает перед появлением экрана с выбором пробивающих игроковв
C D - - - 0x0355F1 23:95E1: 20 CC 96  JSR sub_96CC
C - - - - 0x0355F4 23:95E4: A9 00     LDA #$00
C - - - - 0x0355F6 23:95E6: 8D 16 06  STA ram_номер_защитника
C - - - - 0x0355F9 23:95E9: 8D 8E 03  STA $038E
C - - - - 0x0355FC 23:95EC: 8D 8B 03  STA $038B
C - - - - 0x0355FF 23:95EF: 8D 0A 03  STA $030A
C - - - - 0x035602 23:95F2: 8D 07 03  STA $0307
C - - - - 0x035605 23:95F5: 2C E2 00  BIT ram_рандом_2
C - - - - 0x035608 23:95F8: 10 02     BPL bra_95FC
- - - - - 0x03560A 23:95FA: A9 0B     LDA #$0B
bra_95FC:
C - - - - 0x03560C 23:95FC: 8D FB 05  STA ram_команда_с_мячом
C - - - - 0x03560F 23:95FF: 8D 19 06  STA $0619
C - - - - 0x035612 23:9602: A9 41     LDA #$41      ; pk_and_score
C - - - - 0x035614 23:9604: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035617 23:9607: A9 33     LDA #$33
C - - - - 0x035619 23:9609: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - 0x03561C 23:960C: A9 39     LDA #$39
C - - - - 0x03561E 23:960E: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
loc_9611:
; бряк срабатывает перед объявлением имени пробивающего
C D - - - 0x035621 23:9611: AD 16 06  LDA ram_номер_защитника
C - - - - 0x035624 23:9614: 4A        LSR
C - - - - 0x035625 23:9615: 8D 17 06  STA $0617
C - - - - 0x035628 23:9618: B0 09     BCS bra_9623
C - - - - 0x03562A 23:961A: C9 05     CMP #$05
C - - - - 0x03562C 23:961C: D0 05     BNE bra_9623
- - - - - 0x03562E 23:961E: A9 45     LDA #$45
- - - - - 0x035630 23:9620: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
bra_9623:
C - - - - 0x035633 23:9623: AD 17 06  LDA $0617
bra_9626:
C - - - - 0x035636 23:9626: C9 0A     CMP #$0A
C - - - - 0x035638 23:9628: 90 04     BCC bra_962E
- - - - - 0x03563A 23:962A: E9 0A     SBC #$0A
- - - - - 0x03563C 23:962C: B0 F8     BCS bra_9626
bra_962E:
C - - - - 0x03563E 23:962E: AA        TAX
C - - - - 0x03563F 23:962F: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035642 23:9632: F0 08     BEQ bra_963C
C - - - - 0x035644 23:9634: 86 3A     STX ram_003A
C - - - - 0x035646 23:9636: A9 09     LDA #$09
C - - - - 0x035648 23:9638: 38        SEC
C - - - - 0x035649 23:9639: E5 3A     SBC ram_003A
C - - - - 0x03564B 23:963B: AA        TAX
bra_963C:
C - - - - 0x03564C 23:963C: BD 31 04  LDA $0431,X
C - - - - 0x03564F 23:963F: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x035652 23:9642: F0 03     BEQ bra_9647
C - - - - 0x035654 23:9644: 18        CLC
C - - - - 0x035655 23:9645: 69 0B     ADC #$0B
bra_9647:
C - - - - 0x035657 23:9647: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x03565A 23:964A: A9 22     LDA #$22
C - - - - 0x03565C 23:964C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x03565F 23:964F: 20 09 95  JSR sub_9509
C - - - - 0x035662 23:9652: A9 23     LDA #$23
C - - - - 0x035664 23:9654: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035667 23:9657: 20 AE 96  JSR sub_96AE
C - - - - 0x03566A 23:965A: AD 16 06  LDA ram_номер_защитника
C - - - - 0x03566D 23:965D: EE 16 06  INC ram_номер_защитника
C - - - - 0x035670 23:9660: 4A        LSR
C - - - - 0x035671 23:9661: 08        PHP
C - - - - 0x035672 23:9662: 85 3A     STA ram_003A
C - - - - 0x035674 23:9664: 38        SEC
C - - - - 0x035675 23:9665: A9 03     LDA #$03
C - - - - 0x035677 23:9667: E5 3A     SBC ram_003A
C - - - - 0x035679 23:9669: AA        TAX
C - - - - 0x03567A 23:966A: B0 02     BCS bra_966E
C - - - - 0x03567C 23:966C: A2 FF     LDX #$FF
bra_966E:
C - - - - 0x03567E 23:966E: E8        INX
C - - - - 0x03567F 23:966F: E8        INX
C - - - - 0x035680 23:9670: 28        PLP
C - - - - 0x035681 23:9671: B0 01     BCS bra_9674
C - - - - 0x035683 23:9673: E8        INX
bra_9674:
C - - - - 0x035684 23:9674: 86 3A     STX ram_003A
C - - - - 0x035686 23:9676: AD 10 06  LDA ram_пк_голы
C - - - - 0x035689 23:9679: 38        SEC
C - - - - 0x03568A 23:967A: ED 11 06  SBC ram_пк_голы + 1
C - - - - 0x03568D 23:967D: B0 04     BCS bra_9683
C - - - - 0x03568F 23:967F: 49 FF     EOR #$FF
C - - - - 0x035691 23:9681: 69 01     ADC #$01
bra_9683:
C - - - - 0x035693 23:9683: C5 3A     CMP ram_003A
C - - - - 0x035695 23:9685: B0 0B     BCS bra_9692
C - - - - 0x035697 23:9687: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03569A 23:968A: 49 0B     EOR #$0B
C - - - - 0x03569C 23:968C: 8D FB 05  STA ram_команда_с_мячом
C - - - - 0x03569F 23:968F: 4C 11 96  JMP loc_9611
bra_9692:
C - - - - 0x0356A2 23:9692: A2 00     LDX #$00
C - - - - 0x0356A4 23:9694: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - 0x0356A7 23:9697: E8        INX
C - - - - 0x0356A8 23:9698: 20 A3 96  JSR sub_96A3_сложение_голов_матча_и_пк
C - - - - 0x0356AB 23:969B: A9 33     LDA #$33
C - - - - 0x0356AD 23:969D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x0356B0 23:96A0: 4C 54 C5  JMP loc_0x03CF0E

sub_96A3_сложение_голов_матча_и_пк:
; bzk нахрена это вообще надо, может для сценария
C - - - - 0x0356B3 23:96A3: BD 10 06  LDA ram_пк_голы,X
C - - - - 0x0356B6 23:96A6: 18        CLC
C - - - - 0x0356B7 23:96A7: 7D 28 00  ADC ram_голы,X
C - - - - 0x0356BA 23:96AA: 9D 28 00  STA ram_голы,X
C - - - - 0x0356BD 23:96AD: 60        RTS

sub_96AE:
C - - - - 0x0356BE 23:96AE: AD 12 06  LDA ram_флаг_защитника
                                      BNE bra_96C9_выход
; увеличить счетчик голов если кто-то забил
; включает в себя когда кипер не угадал, и когда не смог отбить даже если угадал
C - J - - 0x0356CA 23:96BA: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x0356CD 23:96BD: F0 02     BEQ bra_96C1_это_команда_слева
C - - - - 0x0356CF 23:96BF: A2 01     LDX #$01
bra_96C1_это_команда_слева:
C - - - - 0x0356D1 23:96C1: FE 10 06  INC ram_пк_голы,X
C - - - - 0x0356D4 23:96C4: A9 41     LDA #$41      ; pk_and_score
C - - - - 0x0356D6 23:96C6: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_96C9_выход:
C - - - - 0x0356D9 23:96C9: 60        RTS

sub_96CC:
C - - - - 0x0356DC 23:96CC: A9 01     LDA #$01
C - - - - 0x0356DE 23:96CE: 20 5D C5  JSR sub_0x03CC01_запись_звука
C - - - - 0x0356E1 23:96D1: A9 00     LDA #$00
C - - - - 0x0356E3 23:96D3: 85 11     STA ram_0011
C - - - - 0x0356E5 23:96D5: 85 12     STA ram_0012
C - - - - 0x0356E9 23:96D9: 8D 30 04  STA $0430
C - - - - 0x0356EC 23:96DC: 8D 3C 05  STA ram_номер_анимации
C - - - - 0x0356EF 23:96DF: A9 80     LDA #$80
C - - - - 0x0356F1 23:96E1: 8D 3A 05  STA $053A
C - - - - 0x0356F4 23:96E4: A2 00     LDX #$00
C - - - - 0x0356F6 23:96E6: A9 12     LDA #$12
C - - - - 0x0356F8 23:96E8: 20 30 C5  JSR sub_0x03CC12
C - - - - 0x0356FB 23:96EB: 20 33 C5  JSR sub_0x03CCE3
C - - - - 0x035701 23:96F1: A9 02     LDA #$02
C - - - - 0x035703 23:96F3: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035718 23:9708: A9 2E     LDA #$2E
C - - - - 0x03571A 23:970A: 8D 91 04  STA $0491
                                      LDX ram_матч
                                      LDA tbl_0x040000_банки_CHR_с_сокращенными_именами,X
                                      STA $0490
C - - - - 0x035706 23:96F6: A9 00     LDA #$00
C - - - - 0x03571F 23:970F: 8D CE 05  STA $05CE
C - - - - 0x035722 23:9712: 85 4A     STA ram_004A
C - - - - 0x035724 23:9714: 85 4B     STA ram_004B
C - - - - 0x035708 23:96F8: 8D 69 04  STA $0469
C - - - - 0x035710 23:9700: 8D 00 E0  STA $5204
C - - - - 0x035726 23:9716: A5 20     LDA ram_0020
C - - - - 0x035728 23:9718: 29 FC     AND #$FC
C - - - - 0x03572A 23:971A: 85 20     STA ram_0020
C - - - - 0x03572C 23:971C: A9 3E     LDA #$3E      ; pk_shootout_select_taker
C - - - - 0x03572E 23:971E: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035731 23:9721: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
C - - - - 0x035734 23:9724: A2 00     LDX #$00
C - - - - 0x035736 23:9726: A9 13     LDA #$13
C - - - - 0x035738 23:9728: 20 30 C5  JSR sub_0x03CC12
C - - - - 0x03573B 23:972B: 20 33 C5  JSR sub_0x03CCE3
C - - - - 0x035741 23:9731: A9 00     LDA #$00
C - - - - 0x035743 23:9733: 8D 24 06  STA $0624
C - - - - 0x035746 23:9736: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9739:
C D - - - 0x035749 23:9739: A9 01     LDA #$01
C - - - - 0x03574B 23:973B: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x03574E 23:973E: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - 0x035750 23:9740: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035753 23:9743: F0 32     BEQ bra_9777
C - - - - 0x035755 23:9745: 48        PHA
C - - - - 0x035756 23:9746: A9 09     LDA #$09
C - - - - 0x035758 23:9748: 38        SEC
C - - - - 0x035759 23:9749: ED 30 04  SBC $0430
C - - - - 0x03575C 23:974C: 85 3A     STA ram_003A
C - - - - 0x03575E 23:974E: 68        PLA
C - - - - 0x03575F 23:974F: A2 01     LDX #$01
C - - - - 0x035761 23:9751: 29 04     AND #$04
C - - - - 0x035763 23:9753: D0 02     BNE bra_9757_было_нажато_вниз
C - - - - 0x035765 23:9755: A2 FF     LDX #$FF
bra_9757_было_нажато_вниз:
C - - - - 0x035767 23:9757: 8A        TXA
C - - - - 0x035768 23:9758: 18        CLC
C - - - - 0x035769 23:9759: 6D 24 06  ADC $0624
C - - - - 0x03576C 23:975C: 30 19     BPL bra_975E
                                      LDA ram_003A      ; нажато вверх
                                      JMP loc_9769_обновить_курсор
bra_975E:
C - - - - 0x03576E 23:975E: C5 3A     CMP ram_003A
C - - - - 0x035770 23:9760: 90 02     BCC bra_9764
C - - - - 0x035772 23:9762: A5 3A     LDA ram_003A
bra_9764:
C - - - - 0x035774 23:9764: CD 24 06  CMP $0624
C - - - - 0x035777 23:9767: F0 0E     BNE bra_9769_обновить_курсор
                                      LDA #$00          ; нажато вниз
loc_9769_обновить_курсор:
bra_9769_обновить_курсор:
C - - - - 0x035779 23:9769: 48        PHA
C - - - - 0x03577A 23:976A: AD 24 06  LDA $0624
C - - - - 0x03577D 23:976D: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - 0x035780 23:9770: 68        PLA
C - - - - 0x035781 23:9771: 8D 24 06  STA $0624
C - - - - 0x035784 23:9774: 20 28 98  JSR sub_9828_нарисовать_курсор
loc_9777:
bra_9777:
C - - - - 0x035787 23:9777: A9 40     LDA #con_btn_B
C - - - - 0x035789 23:9779: 2D 1E 00  AND ram_одноразовые
C - - - - 0x03578C 23:977C: F0 0B     BEQ bra_9789
C - - - - 0x03578E 23:977E: AE 30 04  LDX $0430
C - - - - 0x035791 23:9781: F0 06     BEQ bra_9789
C - - - - 0x035793 23:9783: CE 30 04  DEC $0430
C - - - - 0x035796 23:9786: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_9789:
C - - - - 0x035799 23:9789: A9 80     LDA #con_btn_A
C - - - - 0x03579B 23:978B: 2D 1E 00  AND ram_одноразовые
C - - - - 0x03579E 23:978E: F0 66     BEQ bra_97F6
C - - - - 0x0357A0 23:9790: AD 30 04  LDA $0430
C - - - - 0x0357A3 23:9793: C9 05     CMP #$05
C - - - - 0x0357A5 23:9795: D0 03     BNE bra_979A
C - - - - 0x0357A7 23:9797: 4C F9 97  JMP loc_97F9
bra_979A:
C - - - - 0x0357AA 23:979A: AD 24 06  LDA $0624
C - - - - 0x0357AD 23:979D: 85 3A     STA ram_003A
C - - - - 0x0357AF 23:979F: A9 01     LDA #$01
C - - - - 0x0357B1 23:97A1: 85 3B     STA ram_003B
C - - - - 0x0357B3 23:97A3: A9 00     LDA #$00
C - - - - 0x0357B5 23:97A5: 85 3C     STA ram_003C
bra_97A7:
C - - - - 0x0357B7 23:97A7: A5 3B     LDA ram_003B
C - - - - 0x0357B9 23:97A9: AE 30 04  LDX $0430
C - - - - 0x0357BC 23:97AC: F0 0E     BEQ bra_97BC
bra_97AE:
C - - - - 0x0357BE 23:97AE: DD 30 04  CMP $0430,X
C - - - - 0x0357C1 23:97B1: F0 05     BEQ bra_97B8
C - - - - 0x0357C3 23:97B3: CA        DEX
C - - - - 0x0357C4 23:97B4: D0 F8     BNE bra_97AE
C - - - - 0x0357C6 23:97B6: F0 04     BEQ bra_97BC
bra_97B8:
C - - - - 0x0357C8 23:97B8: E6 3B     INC ram_003B
C - - - - 0x0357CA 23:97BA: D0 EB     BNE bra_97A7
bra_97BC:
C - - - - 0x0357CC 23:97BC: A5 3C     LDA ram_003C
C - - - - 0x0357CE 23:97BE: E6 3C     INC ram_003C
C - - - - 0x0357D0 23:97C0: C5 3A     CMP ram_003A
C - - - - 0x0357D2 23:97C2: F0 04     BEQ bra_97C8
C - - - - 0x0357D4 23:97C4: E6 3B     INC ram_003B
C - - - - 0x0357D6 23:97C6: D0 DF     BNE bra_97A7
bra_97C8:
C - - - - 0x0357D8 23:97C8: A5 3B     LDA ram_003B
C - - - - 0x0357DA 23:97CA: AE 30 04  LDX $0430
C - - - - 0x0357DD 23:97CD: 9D 31 04  STA $0431,X
C - - - - 0x0357E0 23:97D0: EE 30 04  INC $0430
C - - - - 0x0357E3 23:97D3: A9 09     LDA #$09
C - - - - 0x0357E5 23:97D5: 38        SEC
C - - - - 0x0357E6 23:97D6: ED 30 04  SBC $0430
C - - - - 0x0357E9 23:97D9: 85 3A     STA ram_003A
C - - - - 0x0357EB 23:97DB: AD 24 06  LDA $0624
C - - - - 0x0357EE 23:97DE: E5 3A     SBC ram_003A
C - - - - 0x0357F0 23:97E0: 90 11     BCC bra_97F3
C - - - - 0x0357F2 23:97E2: AD 24 06  LDA $0624
C - - - - 0x0357F5 23:97E5: A6 3A     LDX ram_003A
C - - - - 0x0357F7 23:97E7: 8E 24 06  STX $0624
C - - - - 0x0357FA 23:97EA: 20 2C 98  JSR sub_982C_удалить_курсор
C - - - - 0x0357FD 23:97ED: AD 24 06  LDA $0624
C - - - - 0x035800 23:97F0: 20 28 98  JSR sub_9828_нарисовать_курсор
bra_97F3:
C - - - - 0x035803 23:97F3: 20 6B 98  JSR sub_986B_обновить_список_игроков_пенальти
bra_97F6:
C - - - - 0x035806 23:97F6: 4C 39 97  JMP loc_9739

loc_97F9:
C D - - - 0x035809 23:97F9: A9 01     LDA #$01
C - - - - 0x03580B 23:97FB: 85 3A     STA ram_003A
C - - - - 0x03580D 23:97FD: A0 0A     LDY #$0A
bra_97FF:
C - - - - 0x03580F 23:97FF: A2 00     LDX #$00
C - - - - 0x035811 23:9801: A5 3A     LDA ram_003A
bra_9803:
C - - - - 0x035813 23:9803: DD 31 04  CMP $0431,X
C - - - - 0x035816 23:9806: F0 0E     BEQ bra_9816
C - - - - 0x035818 23:9808: E8        INX
C - - - - 0x035819 23:9809: E0 05     CPX #$05
C - - - - 0x03581B 23:980B: D0 F6     BNE bra_9803
C - - - - 0x03581D 23:980D: AE 30 04  LDX $0430
C - - - - 0x035820 23:9810: 9D 31 04  STA $0431,X
C - - - - 0x035823 23:9813: EE 30 04  INC $0430
bra_9816:
C - - - - 0x035826 23:9816: E6 3A     INC ram_003A
C - - - - 0x035828 23:9818: 88        DEY
C - - - - 0x035829 23:9819: D0 E4     BNE bra_97FF
C - - - - 0x03582B 23:981B: 20 69 C5  JSR sub_0x03CB45_очистить_nametable
C - - - - 0x03582E 23:981E: A9 00     LDA #$00
C - - - - 0x035830 23:9820: 85 8E     STA ram_008E
C - - - - 0x035832 23:9822: A9 01     LDA #$80
C - - - - 0x035834 23:9824: 8D 69 04  STA $0469
C - - - - 0x035837 23:9827: 60        RTS

sub_9828_нарисовать_курсор:
C - - - - 0x035838 23:9828: A2 B1     LDX #$B1
C - - - - 0x03583A 23:982A: D0 02     BNE bra_982E

sub_982C_удалить_курсор:
C - - - - 0x03583C 23:982C: A2 00     LDX #$00
bra_982E:
C - - - - 0x03583E 23:982E: 48        PHA
bra_982F_ожидание_освобождения_буфера:
C - - - - 0x03583F 23:982F: A9 01     LDA #$01
C - - - - 0x035841 23:9831: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035844 23:9834: AD 15 05  LDA $0515
C - - - - 0x035847 23:9837: D0 F6     BNE bra_982F_ожидание_освобождения_буфера
C - - - - 0x035849 23:9839: A9 01     LDA #$01
C - - - - 0x03584B 23:983B: 8D 15 05  STA $0515
C - - - - 0x03584E 23:983E: A0 01     LDY #$01
C - - - - 0x035850 23:9840: 8C A5 04  STY $04A5
C - - - - 0x035853 23:9843: 88        DEY
C - - - - 0x035854 23:9844: 8C A9 04  STY $04A9
C - - - - 0x035857 23:9847: 8E A8 04  STX $04A8
C - - - - 0x03585A 23:984A: 68        PLA
C - - - - 0x03585B 23:984B: 8C A6 04  STY $04A6
C - - - - 0x03585E 23:984E: 4A        LSR
C - - - - 0x03585F 23:984F: 6E A6 04  ROR $04A6
C - - - - 0x035862 23:9852: 4A        LSR
C - - - - 0x035863 23:9853: 6E A6 04  ROR $04A6
C - - - - 0x035866 23:9856: 48        PHA
C - - - - 0x035867 23:9857: AD A6 04  LDA $04A6
C - - - - 0x03586A 23:985A: 69 02     ADC #$02
C - - - - 0x03586C 23:985C: 8D A6 04  STA $04A6
C - - - - 0x03586F 23:985F: 68        PLA
C - - - - 0x035870 23:9860: 69 21     ADC #$21
C - - - - 0x035872 23:9862: 8D A7 04  STA $04A7
C - - - - 0x035875 23:9865: A9 80     LDA #$80
C - - - - 0x035877 23:9867: 8D 15 05  STA $0515
C - - - - 0x03587A 23:986A: 60        RTS

sub_986B_обновить_список_игроков_пенальти:
C - - - - 0x03587B 23:986B: A9 01     LDA #$01
C - - - - 0x03587D 23:986D: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x035880 23:9870: A9 3F     LDA #$3F      ; pk_players_list
C - - - - 0x035882 23:9872: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035885 23:9875: A9 40     LDA #$40      ; pk_order
C - - - - 0x035887 23:9877: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x03588A 23:987A: 60        RTS

sub_987B:
C - - - - 0x03588B 23:987B: A9 37     LDA #$37
C - - - - 0x03588D 23:987D: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035890 23:9880: A9 00     LDA #$00
C - - - - 0x035892 23:9882: 85 11     STA ram_0011
C - - - - 0x035894 23:9884: 85 12     STA ram_0012
C - - - - 0x035896 23:9886: A9 01     LDA #$01
C - - - - 0x035898 23:9888: 20 15 C5  JSR sub_0x03CB1F
bra_9892:
C - - - - 0x0358A2 23:9892: A9 00     LDA #$00
C - - - - 0x0358A4 23:9894: 8D 2D 06  STA $062D
C - - - - 0x0358A7 23:9897: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - 0x03589E 23:988E: A9 2E     LDA #$2E
C - - - - 0x0358A0 23:9890: 85 87     STA ram_0087
C - - - - 0x0358AA 23:989A: A9 33     LDA #$33      ; resume_play_edit_team_data
C - - - - 0x0358AC 23:989C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x0358AF 23:989F: A9 04     LDA #$04
C - - - - 0x0358B1 23:98A1: 8D 24 06  STA $0624
C - - - - 0x0358B4 23:98A4: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98A7:
C - - - - 0x0358B7 23:98A7: A9 01     LDA #$01
C - - - - 0x0358B9 23:98A9: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x0358BC 23:98AC: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - 0x0358BE 23:98AE: 2D 1E 00  AND ram_одноразовые
C - - - - 0x0358C1 23:98B1: F0 0B     BEQ bra_98BE
C - - - - 0x0358C3 23:98B3: AD 24 06  LDA $0624
C - - - - 0x0358C6 23:98B6: 49 40     EOR #$40
C - - - - 0x0358C8 23:98B8: 8D 24 06  STA $0624
C - - - - 0x0358CB 23:98BB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_98BE:
C - - - - 0x0358CE 23:98BE: 2C 1C 00  BIT ram_удержанные
; con_btn_A
C - - - - 0x0358D1 23:98C1: 10 E4     BPL bra_98A7
C - - - - 0x0358D3 23:98C3: 20 0C 99  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - 0x0358D6 23:98C6: 2C 24 06  BIT $0624
C - - - - 0x0358D9 23:98C9: 70 05     BVS bra_98D0
C - - - - 0x0358DB 23:98CB: A9 02     LDA #$02
C - - - - 0x0358DD 23:98CD: 85 87     STA ram_0087
C - - - - 0x0358DF 23:98CF: 60        RTS
bra_98D0:
C - - - - 0x0358E0 23:98D0: A9 00     LDA #$00
C - - - - 0x0358E2 23:98D2: 8D 24 06  STA $0624
loc_98D5:
C D - - - 0x0358E5 23:98D5: A9 34     LDA #$34      ; formation_defense_swap_status_done
C - - - - 0x0358E7 23:98D7: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x0358EA 23:98DA: A9 03     LDA #$03
C - - - - 0x0358EC 23:98DC: 8D 3D 06  STA $063D
C - - - - 0x0358EF 23:98DF: 20 66 C5  JSR sub_0x03F023
C - - - - 0x0358F2 23:98E2: A9 85     LDA #$85
C - - - - 0x0358F4 23:98E4: 8D 2D 06  STA $062D
C - - - - 0x0358F7 23:98E7: AD 24 06  LDA $0624
C - - - - 0x0358FA 23:98EA: 8D 22 06  STA ram_номер_опции
C - - - - 0x0358FD 23:98ED: A9 04     LDA #$04
C - - - - 0x0358FF 23:98EF: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - 0x035902 23:98F2: 90 9E     BCC bra_9892
C - - - - 0x035904 23:98F4: C9 04     CMP #$04
C - - - - 0x035906 23:98F6: F0 9A     BEQ bra_9892
C - - - - 0x035908 23:98F8: 8D 24 06  STA $0624
C - - - - 0x03590B 23:98FB: 20 01 99  JSR sub_9901
C - - - - 0x03590E 23:98FE: 4C D5 98  JMP loc_98D5

sub_9901:
C - - - - 0x035911 23:9901: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x035914 23:9904: 1A 99     .word ofs_991A_00
- D - I - 0x035916 23:9906: 3A 99     .word ofs_993A_01
- D - I - 0x035918 23:9908: 50 99     .word ofs_9950_02
- D - I - 0x03591A 23:990A: AD 9B     .word ofs_9BAD_03

loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
sub_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC55_полностью_очистить_нижнюю_половину_экрана
    JMP loc_990D_нарисовать_будку
sub_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
loc_990C_очистить_экран_и_вывести_будку_чарли_со_всей_инфой:
    JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
loc_990D_нарисовать_будку:
    LDA #$42      ; booth_for_charlie_time_score_period_number
    JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
    RTS

ofs_991A_00:
C - J - - 0x03592A 23:991A: A9 35     LDA #$35      ; опция formation
C - - - - 0x03592C 23:991C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x03592F 23:991F: AD 2C 00  LDA ram_расстановка_слева
C - - - - 0x035932 23:9922: 8D 22 06  STA ram_номер_опции
C - - - - 0x035935 23:9925: AD 2C 00  LDA ram_расстановка_слева
C - - - - 0x035938 23:9928: 8D 27 06  STA $0627
C - - - - 0x03593B 23:992B: A9 05     LDA #$05
C - - - - 0x03593D 23:992D: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - 0x035940 23:9930: AE 27 06  LDX $0627
C - - - - 0x035943 23:9933: 90 01     BCC bra_9936
C - - - - 0x035945 23:9935: AA        TAX
bra_9936:
C - - - - 0x035946 23:9936: 8E 2C 00  STX ram_расстановка_слева
C - - - - 0x035949 23:9939: 60        RTS

ofs_993A_01:
C - J - - 0x03594A 23:993A: A9 36     LDA #$36      ; опция defense
C - - - - 0x03594C 23:993C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x03594F 23:993F: AD 2D 00  LDA ram_защита_слева
C - - - - 0x035952 23:9942: 8D 22 06  STA ram_номер_опции
C - - - - 0x035955 23:9945: A9 06     LDA #$06
C - - - - 0x035957 23:9947: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - 0x03595A 23:994A: 90 03     BCC bra_994F_выход
C - - - - 0x03595C 23:994C: 8D 2D 00  STA ram_защита_слева
bra_994F_выход:
C - - - - 0x03595F 23:994F: 60        RTS

ofs_9950_02:
C - J - - 0x035960 23:9950: AD 2A 00  LDA ram_твоя_команда
C - - - - 0x035963 23:9953: C9 02     CMP #$02
C - - - - 0x035965 23:9955: F0 03     BEQ bra_995A
C - - - - 0x035967 23:9957: 4C C7 9A  JMP loc_9AC7
bra_995A:
C - - - - 0x03596A 23:995A: A9 37     LDA #$37      ; опция swap
C - - - - 0x03596C 23:995C: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x03596F 23:995F: A9 00     LDA #$00
C - - - - 0x035971 23:9961: 8D 22 06  STA ram_номер_опции
C - - - - 0x035974 23:9964: A9 07     LDA #$07
C - - - - 0x035976 23:9966: 20 63 C5  JSR sub_0x03CF9F_курсор_меню_после_гола
C - - - - 0x035979 23:9969: B0 01     BCS bra_996C
- - - - - 0x03597B 23:996B: 60        RTS
bra_996C:
C - - - - 0x03597C 23:996C: 20 72 99  JSR sub_9972
C - - - - 0x03597F 23:996F: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой

sub_9972:
C - - - - 0x035982 23:9972: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x035985 23:9975: 79 99     .word ofs_9979_00_swap_players
- D - I - 0x035987 23:9977: C7 9A     .word ofs_9AC7_01_swap_positions

loc_9979:
ofs_9979_00_swap_players:
C D J - - 0x035989 23:9979: AD 50 04  LDA ram_счетчик_замен
C - - - - 0x03598C 23:997C: C9 03     CMP #$03
C - - - - 0x03598E 23:997E: 90 12     BCC bra_9992_лимит_замен_еще_не_исчерпан
- - - - - 0x035990 23:9980: A9 38     LDA #$38      ; no_subs_left
- - - - - 0x035992 23:9982: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9985:
- - - - - 0x035995 23:9985: A9 01     LDA #$01
- - - - - 0x035997 23:9987: 20 15 C5  JSR sub_0x03CB1F
- - - - - 0x03599A 23:998A: A9 C0     LDA #con_btn_B + con_btn_A
- - - - - 0x03599C 23:998C: 2D 1E 00  AND ram_одноразовые
- - - - - 0x03599F 23:998F: F0 F4     BEQ bra_9985
- - - - - 0x0359A1 23:9991: 60        RTS
bra_9992_лимит_замен_еще_не_исчерпан:
C - - - - 0x0359A2 23:9992: A9 00     LDA #$00
C - - - - 0x0359A4 23:9994: 8D 2D 06  STA $062D
C - - - - 0x0359A7 23:9997: A9 3A     LDA #$3A      ; swap_sub_players
C - - - - 0x0359A9 23:9999: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x0359AC 23:999C: A9 00     LDA #$00
bra_999E:
C - - - - 0x0359AE 23:999E: 48        PHA
C - - - - 0x0359AF 23:999F: 20 AC 9A  JSR sub_9AAC
C - - - - 0x0359B2 23:99A2: 90 09     BCC bra_99AD
C - - - - 0x0359B4 23:99A4: 68        PLA
C - - - - 0x0359B5 23:99A5: 48        PHA
C - - - - 0x0359B6 23:99A6: A0 2C     LDY #$2C
C - - - - 0x0359B8 23:99A8: A2 B2     LDX #$B2
C - - - - 0x0359BA 23:99AA: 20 41 9F  JSR sub_9F41_позиция_курсора_при_замене_основного_состава
bra_99AD:
C - - - - 0x0359BD 23:99AD: 68        PLA
C - - - - 0x0359BE 23:99AE: 18        CLC
C - - - - 0x0359BF 23:99AF: 69 01     ADC #$01
C - - - - 0x0359C1 23:99B1: C9 0A     CMP #$0A
C - - - - 0x0359C3 23:99B3: D0 E9     BNE bra_999E
C - - - - 0x0359C5 23:99B5: A9 00     LDA #$00
bra_99B7:
C - - - - 0x0359C7 23:99B7: 48        PHA
C - - - - 0x0359C8 23:99B8: 20 AC 9A  JSR sub_9AAC
C - - - - 0x0359CB 23:99BB: 68        PLA
C - - - - 0x0359CC 23:99BC: 90 07     BCC bra_99C5
- - - - - 0x0359CE 23:99BE: 18        CLC
- - - - - 0x0359CF 23:99BF: 69 01     ADC #$01
- - - - - 0x0359D1 23:99C1: C9 0A     CMP #$0A
- - - - - 0x0359D3 23:99C3: D0 F2     BNE bra_99B7
bra_99C5:
C - - - - 0x0359D5 23:99C5: 8D 25 06  STA $0625
C - - - - 0x0359D8 23:99C8: A0 2C     LDY #$2C
C - - - - 0x0359DA 23:99CA: 20 37 9F  JSR sub_9F37
bra_99CD:
C - - - - 0x0359DD 23:99CD: A9 01     LDA #$01
C - - - - 0x0359DF 23:99CF: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x0359E2 23:99D2: AD 25 06  LDA $0625
C - - - - 0x0359E5 23:99D5: 20 90 9B  JSR sub_9B90
C - - - - 0x0359E8 23:99D8: 90 24     BCC bra_99FE
loc_99DA:
C - - - - 0x0359EA 23:99DA: BD 0F 9F  LDA tbl_9F0F_изменение_позиции_курсора_запасных_игроков,X
C - - - - 0x0359ED 23:99DD: 48        PHA
C - - - - 0x0359EE 23:99DE: 20 AC 9A  JSR sub_9AAC
C - - - - 0x0359F1 23:99E1: 68        PLA
C - - - - 0x0359F2 23:99E2: 90 08     BCC bra_99EC
- - - - - 0x0359F4 23:99E4: A6 3A     LDX ram_003A
- - - - - 0x0359F6 23:99E6: 20 A4 9B  JSR sub_9BA4
- - - - - 0x0359F9 23:99E9: 4C DA 99  JMP loc_99DA
bra_99EC:
C - - - - 0x0359FC 23:99EC: 48        PHA
C - - - - 0x0359FD 23:99ED: AD 25 06  LDA $0625
C - - - - 0x035A00 23:99F0: A0 2C     LDY #$2C
C - - - - 0x035A02 23:99F2: 20 3F 9F  JSR sub_9F3F
C - - - - 0x035A05 23:99F5: 68        PLA
C - - - - 0x035A06 23:99F6: 8D 25 06  STA $0625
C - - - - 0x035A09 23:99F9: A0 2C     LDY #$2C
C - - - - 0x035A0B 23:99FB: 20 37 9F  JSR sub_9F37
bra_99FE:
C - - - - 0x035A0E 23:99FE: A9 80     LDA #con_btn_A
C - - - - 0x035A10 23:9A00: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035A13 23:9A03: D0 08     BNE bra_9A0D
C - - - - 0x035A15 23:9A05: A9 40     LDA #con_btn_B
C - - - - 0x035A17 23:9A07: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035A1A 23:9A0A: F0 C1     BEQ bra_99CD
C - - - - 0x035A1C 23:9A0C: 60        RTS
bra_9A0D:
C - - - - 0x035A1D 23:9A0D: A9 3B     LDA #$3B      ; whom_to_sub
C - - - - 0x035A1F 23:9A0F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035A22 23:9A12: A9 01     LDA #$01
C - - - - 0x035A24 23:9A14: AE 25 06  LDX $0625
C - - - - 0x035A27 23:9A17: E0 08     CPX #$08
C - - - - 0x035A29 23:9A19: 90 02     BCC bra_9A1D
C - - - - 0x035A2B 23:9A1B: A9 00     LDA #$00
bra_9A1D:
C - - - - 0x035A2D 23:9A1D: 8D 26 06  STA $0626
C - - - - 0x035A30 23:9A20: A0 16     LDY #$16
C - - - - 0x035A32 23:9A22: 20 37 9F  JSR sub_9F37
bra_9A25:
C - - - - 0x035A35 23:9A25: A9 01     LDA #$01
C - - - - 0x035A37 23:9A27: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035A3A 23:9A2A: AD 26 06  LDA $0626
C - - - - 0x035A3D 23:9A2D: F0 1A     BEQ bra_9A49
- - - - - 0x035A3F 23:9A2F: 20 90 9B  JSR sub_9B90
- - - - - 0x035A42 23:9A32: 90 15     BCC bra_9A49
- - - - - 0x035A44 23:9A34: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
- - - - - 0x035A47 23:9A37: 48        PHA
- - - - - 0x035A48 23:9A38: AD 26 06  LDA $0626
- - - - - 0x035A4B 23:9A3B: A0 16     LDY #$16
- - - - - 0x035A4D 23:9A3D: 20 3F 9F  JSR sub_9F3F
- - - - - 0x035A50 23:9A40: 68        PLA
- - - - - 0x035A51 23:9A41: 8D 26 06  STA $0626
- - - - - 0x035A54 23:9A44: A0 16     LDY #$16
- - - - - 0x035A56 23:9A46: 20 37 9F  JSR sub_9F37
bra_9A49:
C - - - - 0x035A59 23:9A49: A9 40     LDA #con_btn_B
C - - - - 0x035A5B 23:9A4B: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035A5E 23:9A4E: F0 03     BEQ bra_9A53
- - - - - 0x035A60 23:9A50: 4C 79 99  JMP loc_9979
bra_9A53:
C - - - - 0x035A63 23:9A53: A9 80     LDA #con_btn_A
C - - - - 0x035A65 23:9A55: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035A68 23:9A58: F0 CB     BEQ bra_9A25
C - - - - 0x035A6A 23:9A5A: AD 25 06  LDA $0625
C - - - - 0x035A6D 23:9A5D: 18        CLC
C - - - - 0x035A6E 23:9A5E: 69 16     ADC #$16
C - - - - 0x035A70 23:9A60: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035A73 23:9A63: A5 34     LDA ram_plr_data
C - - - - 0x035A75 23:9A65: 85 3A     STA ram_003A
C - - - - 0x035A77 23:9A67: A5 35     LDA ram_plr_data + 1
C - - - - 0x035A79 23:9A69: 85 3B     STA ram_003B
C - - - - 0x035A7B 23:9A6B: AD 26 06  LDA $0626
C - - - - 0x035A7E 23:9A6E: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035A81 23:9A71: A0 00     LDY #$00
; con_игрок_номер
; con_игрок_энергия_lo
; con_игрок_энергия_hi
; con_игрок_уровень
bra_9A73_копирование_между_адресами:
C - - - - 0x035A83 23:9A73: B1 3A     LDA (ram_003A),Y
C - - - - 0x035A85 23:9A75: AA        TAX
C - - - - 0x035A86 23:9A76: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035A88 23:9A78: 91 3A     STA (ram_003A),Y
C - - - - 0x035A8A 23:9A7A: 8A        TXA
C - - - - 0x035A8B 23:9A7B: 91 34     STA (ram_plr_data),Y
C - - - - 0x035A8D 23:9A7D: C8        INY
C - - - - 0x035A8E 23:9A7E: C0 04     CPY #$04
C - - - - 0x035A90 23:9A80: D0 F1     BNE bra_9A73_копирование_между_адресами
C - - - - 0x035A92 23:9A82: A0 00     LDY #$00
C - - - - 0x035A94 23:9A84: B1 3A     LDA (ram_003A),Y
C - - - - 0x035A96 23:9A86: AE 50 04  LDX ram_счетчик_замен
C - - - - 0x035A99 23:9A89: 9D 51 04  STA $0451,X
C - - - - 0x035A9C 23:9A8C: E8        INX
C - - - - 0x035A9D 23:9A8D: 8E 50 04  STX ram_счетчик_замен
C - - - - 0x035AA0 23:9A90: A9 3B     LDA #$3B      ; whom_to_sub
C - - - - 0x035AA2 23:9A92: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9A95:
C - - - - 0x035AA5 23:9A95: A9 01     LDA #$01
C - - - - 0x035AA7 23:9A97: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035AAA 23:9A9A: AD 1C 00  LDA ram_удержанные
C - - - - 0x035AAD 23:9A9D: 29 C0     AND #con_btn_B + con_btn_A
C - - - - 0x035AAF 23:9A9F: F0 F4     BEQ bra_9A95
C - - - - 0x035AB1 23:9AA1: AE 50 04  LDX ram_счетчик_замен
C - - - - 0x035AB4 23:9AA4: E0 03     CPX #$03
C - - - - 0x035AB6 23:9AA6: B0 03     BCS bra_9AAB_выход
C - - - - 0x035AB8 23:9AA8: 4C 79 99  JMP loc_9979
bra_9AAB_выход:
- - - - - 0x035ABB 23:9AAB: 60        RTS

sub_9AAC:
C - - - - 0x035ABC 23:9AAC: 18        CLC
C - - - - 0x035ABD 23:9AAD: 69 16     ADC #$16
C - - - - 0x035ABF 23:9AAF: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035AC2 23:9AB2: A0 00     LDY #con_игрок_номер
C - - - - 0x035AC4 23:9AB4: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035AC6 23:9AB6: AE 50 04  LDX ram_счетчик_замен
C - - - - 0x035AC9 23:9AB9: F0 0A     BEQ bra_9AC5
bra_9ABB_цикл:
C - - - - 0x035ACB 23:9ABB: DD 50 04  CMP ram_забаненный_игрок - 1,X
C - - - - 0x035ACE 23:9ABE: D0 02     BNE bra_9AC2
C - - - - 0x035AD0 23:9AC0: 38        SEC
C - - - - 0x035AD1 23:9AC1: 60        RTS
bra_9AC2:
C - - - - 0x035AD2 23:9AC2: CA        DEX
C - - - - 0x035AD3 23:9AC3: D0 F6     BNE bra_9ABB_цикл
bra_9AC5:
C - - - - 0x035AD5 23:9AC5: 18        CLC
C - - - - 0x035AD6 23:9AC6: 60        RTS

loc_9AC7:
ofs_9AC7_01_swap_positions:
C D - - - 0x035AD7 23:9AC7: A9 00     LDA #$00
C - - - - 0x035AD9 23:9AC9: 8D 2D 06  STA $062D
C - - - - 0x035ADC 23:9ACC: A9 39     LDA #$39      ; swap_main_players
C - - - - 0x035ADE 23:9ACE: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035AE1 23:9AD1: A9 01     LDA #$01
C - - - - 0x035AE3 23:9AD3: 8D 25 06  STA $0625
C - - - - 0x035AE6 23:9AD6: A0 16     LDY #$16
C - - - - 0x035AE8 23:9AD8: 20 37 9F  JSR sub_9F37
loc_9ADB:
bra_9ADB_B_не_нажата:
C D - - - 0x035AEB 23:9ADB: A9 01     LDA #$01
C - - - - 0x035AED 23:9ADD: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035AF0 23:9AE0: AD 25 06  LDA $0625
C - - - - 0x035AF3 23:9AE3: 20 90 9B  JSR sub_9B90
C - - - - 0x035AF6 23:9AE6: 90 15     BCC bra_9AFD
C - - - - 0x035AF8 23:9AE8: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - 0x035AFB 23:9AEB: 48        PHA
C - - - - 0x035AFC 23:9AEC: AD 25 06  LDA $0625
C - - - - 0x035AFF 23:9AEF: A0 16     LDY #$16
C - - - - 0x035B01 23:9AF1: 20 3F 9F  JSR sub_9F3F
C - - - - 0x035B04 23:9AF4: 68        PLA
C - - - - 0x035B05 23:9AF5: 8D 25 06  STA $0625
C - - - - 0x035B08 23:9AF8: A0 16     LDY #$16
C - - - - 0x035B0A 23:9AFA: 20 37 9F  JSR sub_9F37
bra_9AFD:
C - - - - 0x035B0D 23:9AFD: A9 80     LDA #con_btn_A
C - - - - 0x035B0F 23:9AFF: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035B12 23:9B02: D0 0B     BNE bra_9B0F_нажата_A
C - - - - 0x035B14 23:9B04: A9 40     LDA #con_btn_B
C - - - - 0x035B16 23:9B06: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035B19 23:9B09: F0 D0     BEQ bra_9ADB_B_не_нажата
                                      LDA ram_твоя_команда
                                      CMP #$02
                                      BEQ @пропустить_затирание     ; иначе потом повторно будет затирание
C - - - - 0x035B1B 23:9B0B: 20 0C 99  JSR sub_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой
@пропустить_затирание:
C - - - - 0x035B1E 23:9B0E: 60        RTS
bra_9B0F_нажата_A:
C - - - - 0x035B1F 23:9B0F: A9 01     LDA #$01
C - - - - 0x035B21 23:9B11: CD 25 06  CMP $0625
C - - - - 0x035B24 23:9B14: D0 02     BNE bra_9B18
C - - - - 0x035B26 23:9B16: A9 02     LDA #$02
bra_9B18:
C - - - - 0x035B28 23:9B18: 8D 26 06  STA $0626
C - - - - 0x035B2B 23:9B1B: A0 16     LDY #$16
C - - - - 0x035B2D 23:9B1D: 20 37 9F  JSR sub_9F37
bra_9B20:
C - - - - 0x035B30 23:9B20: A9 01     LDA #$01
C - - - - 0x035B32 23:9B22: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035B35 23:9B25: AD 26 06  LDA $0626
C - - - - 0x035B38 23:9B28: 20 90 9B  JSR sub_9B90
C - - - - 0x035B3B 23:9B2B: 90 22     BCC bra_9B4F
C - - - - 0x035B3D 23:9B2D: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - 0x035B40 23:9B30: CD 25 06  CMP $0625
C - - - - 0x035B43 23:9B33: D0 08     BNE bra_9B3D
C - - - - 0x035B45 23:9B35: A6 3A     LDX ram_003A
C - - - - 0x035B47 23:9B37: 20 A4 9B  JSR sub_9BA4
C - - - - 0x035B4A 23:9B3A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
bra_9B3D:
C - - - - 0x035B4D 23:9B3D: 48        PHA
C - - - - 0x035B4E 23:9B3E: AD 26 06  LDA $0626
C - - - - 0x035B51 23:9B41: A0 16     LDY #$16
C - - - - 0x035B53 23:9B43: 20 3F 9F  JSR sub_9F3F
C - - - - 0x035B56 23:9B46: 68        PLA
C - - - - 0x035B57 23:9B47: 8D 26 06  STA $0626
C - - - - 0x035B5A 23:9B4A: A0 16     LDY #$16
C - - - - 0x035B5C 23:9B4C: 20 37 9F  JSR sub_9F37
bra_9B4F:
C - - - - 0x035B5F 23:9B4F: A9 80     LDA #con_btn_A
C - - - - 0x035B61 23:9B51: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035B64 23:9B54: D0 12     BNE bra_9B68
C - - - - 0x035B66 23:9B56: A9 40     LDA #con_btn_B
C - - - - 0x035B68 23:9B58: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035B6B 23:9B5B: F0 C3     BEQ bra_9B20
C - - - - 0x035B6D 23:9B5D: AD 26 06  LDA $0626
C - - - - 0x035B70 23:9B60: A0 16     LDY #$16
C - - - - 0x035B72 23:9B62: 20 3F 9F  JSR sub_9F3F
C - - - - 0x035B75 23:9B65: 4C DB 9A  JMP loc_9ADB
bra_9B68:
C - - - - 0x035B78 23:9B68: AD 25 06  LDA $0625
C - - - - 0x035B7B 23:9B6B: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035B7E 23:9B6E: A5 34     LDA ram_plr_data
C - - - - 0x035B80 23:9B70: 85 3A     STA ram_003A
C - - - - 0x035B82 23:9B72: A5 35     LDA ram_plr_data + 1
C - - - - 0x035B84 23:9B74: 85 3B     STA ram_003B
C - - - - 0x035B86 23:9B76: AD 26 06  LDA $0626
C - - - - 0x035B89 23:9B79: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035B8C 23:9B7C: A0 00     LDY #$00
; con_игрок_номер
; con_игрок_энергия_lo
; con_игрок_энергия_hi
; con_игрок_уровень
bra_9B7E_копирование_между_адресами:
C - - - - 0x035B8E 23:9B7E: B1 3A     LDA (ram_003A),Y
C - - - - 0x035B90 23:9B80: AA        TAX
C - - - - 0x035B91 23:9B81: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035B93 23:9B83: 91 3A     STA (ram_003A),Y
C - - - - 0x035B95 23:9B85: 8A        TXA
C - - - - 0x035B96 23:9B86: 91 34     STA (ram_plr_data),Y
C - - - - 0x035B98 23:9B88: C8        INY
C - - - - 0x035B99 23:9B89: C0 04     CPY #$04
C - - - - 0x035B9B 23:9B8B: D0 F1     BNE bra_9B7E_копирование_между_адресами
C - - - - 0x035B9D 23:9B8D: 4C C7 9A  JMP loc_9AC7

sub_9B90:
C - - - - 0x035BA0 23:9B90: 48        PHA
C - - - - 0x035BA1 23:9B91: A9 0F     LDA #con_btns_Dpad
C - - - - 0x035BA3 23:9B93: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035BA6 23:9B96: D0 03     BNE bra_9B9B
C - - - - 0x035BA8 23:9B98: 68        PLA
C - - - - 0x035BA9 23:9B99: 18        CLC
C - - - - 0x035BAA 23:9B9A: 60        RTS
bra_9B9B:
C - - - - 0x035BAB 23:9B9B: A2 00     LDX #$00
bra_9B9D:
C - - - - 0x035BAD 23:9B9D: 4A        LSR
C - - - - 0x035BAE 23:9B9E: B0 03     BCS bra_9BA3
C - - - - 0x035BB0 23:9BA0: E8        INX
C - - - - 0x035BB1 23:9BA1: D0 FA     BNE bra_9B9D
bra_9BA3:
C - - - - 0x035BB3 23:9BA3: 68        PLA
sub_9BA4:
C - - - - 0x035BB4 23:9BA4: 86 3A     STX ram_003A
C - - - - 0x035BB6 23:9BA6: 0A        ASL
C - - - - 0x035BB7 23:9BA7: 0A        ASL
C - - - - 0x035BB8 23:9BA8: 65 3A     ADC ram_003A
C - - - - 0x035BBA 23:9BAA: AA        TAX
C - - - - 0x035BBB 23:9BAB: 38        SEC
C - - - - 0x035BBC 23:9BAC: 60        RTS

bra_9BAD:
ofs_9BAD_03:
C - J - - 0x035BBD 23:9BAD: A9 00     LDA #$00
C - - - - 0x035BBF 23:9BAF: 8D 2D 06  STA $062D
C - - - - 0x035BC2 23:9BB2: A9 3C     LDA #$3C      ; stamina_fielded_players
C - - - - 0x035BC4 23:9BB4: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BB7:
C - - - - 0x035BC7 23:9BB7: A9 01     LDA #$01
C - - - - 0x035BC9 23:9BB9: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035BCC 23:9BBC: A9 80     LDA #con_btn_A
C - - - - 0x035BCE 23:9BBE: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035BD1 23:9BC1: D0 09     BNE bra_9BCC
C - - - - 0x035BD3 23:9BC3: A9 40     LDA #con_btn_B
C - - - - 0x035BD5 23:9BC5: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035BD8 23:9BC8: D0 21     BNE bra_9BEB
C - - - - 0x035BDA 23:9BCA: F0 EB     BEQ bra_9BB7
bra_9BCC:
C - - - - 0x035BDC 23:9BCC: AD 2A 00  LDA ram_твоя_команда
C - - - - 0x035BDF 23:9BCF: C9 02     CMP #$02
C - - - - 0x035BE1 23:9BD1: D0 18     BNE bra_9BEB
- - - - - 0x035BE3 23:9BD3: A9 3D     LDA #$3D      ; stamina_substitutes_bench
- - - - - 0x035BE5 23:9BD5: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
bra_9BD8:
- - - - - 0x035BE8 23:9BD8: A9 01     LDA #$01
- - - - - 0x035BEA 23:9BDA: 20 15 C5  JSR sub_0x03CB1F
- - - - - 0x035BED 23:9BDD: A9 40     LDA #con_btn_B
- - - - - 0x035BEF 23:9BDF: 2D 1E 00  AND ram_одноразовые
- - - - - 0x035BF2 23:9BE2: D0 C9     BNE bra_9BAD
- - - - - 0x035BF4 23:9BE4: A9 80     LDA #con_btn_A
- - - - - 0x035BF6 23:9BE6: 2D 1E 00  AND ram_одноразовые
- - - - - 0x035BF9 23:9BE9: F0 ED     BEQ bra_9BD8
bra_9BEB:
C - - - - 0x035BFB 23:9BEB: 4C 0C 99  JMP loc_990B_полностью_очистить_экран_и_вывести_будку_чарли_со_всей_инфой

sub_9BEE:
C - - - - 0x035BFE 23:9BEE: C9 FF     CMP #$FF
C - - - - 0x035C00 23:9BF0: F0 1C     BEQ bra_9C0E_выход
C - - - - 0x035C02 23:9BF2: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x035C05 23:9BF5: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x035C08 23:9BF8: F0 0A     BEQ bra_9C04
C - - - - 0x035C0A 23:9BFA: 98        TYA
C - - - - 0x035C0B 23:9BFB: 49 FF     EOR #$FF
C - - - - 0x035C0D 23:9BFD: A8        TAY
C - - - - 0x035C0E 23:9BFE: 8A        TXA
C - - - - 0x035C0F 23:9BFF: 49 FF     EOR #$FF
C - - - - 0x035C11 23:9C01: AA        TAX
C - - - - 0x035C12 23:9C02: C8        INY
C - - - - 0x035C13 23:9C03: E8        INX
bra_9C04:
C - - - - 0x035C14 23:9C04: 98        TYA
C - - - - 0x035C15 23:9C05: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x035C17 23:9C07: 91 34     STA (ram_plr_data),Y
C - - - - 0x035C19 23:9C09: 8A        TXA
C - - - - 0x035C1A 23:9C0A: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x035C1C 23:9C0C: 91 34     STA (ram_plr_data),Y
bra_9C0E_выход:
C - - - - 0x035C1E 23:9C0E: 60        RTS

sub_9C0F_перемещение_игроков:
C - - - - 0x035C1F 23:9C0F: AD FC 05  LDA ram_принимающий
C - - - - 0x035C22 23:9C12: 8D 26 06  STA $0626
C - - - - 0x035C25 23:9C15: 20 1F 9C  JSR sub_9C1F_перемещение_игроков
C - - - - 0x035C28 23:9C18: AD 26 06  LDA $0626
C - - - - 0x035C2B 23:9C1B: 8D FC 05  STA ram_принимающий
C - - - - 0x035C2E 23:9C1E: 60        RTS

sub_9C1F_перемещение_игроков:
C - - - - 0x035C2F 23:9C1F: A9 28     LDA #$28      ; rearrange_players_no_yes
C - - - - 0x035C31 23:9C21: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035C34 23:9C24: A9 00     LDA #$00
C - - - - 0x035C36 23:9C26: 8D 24 06  STA $0624
C - - - - 0x035C39 23:9C29: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C2C_ожидание_нажатия_A:
C - - - - 0x035C3C 23:9C2C: A9 01     LDA #$01
C - - - - 0x035C3E 23:9C2E: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035C41 23:9C31: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - 0x035C43 23:9C33: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035C46 23:9C36: F0 0B     BEQ bra_9C43_кнопки_не_нажаты
C - - - - 0x035C48 23:9C38: AD 24 06  LDA $0624
C - - - - 0x035C4B 23:9C3B: 49 40     EOR #$40
C - - - - 0x035C4D 23:9C3D: 8D 24 06  STA $0624
C - - - - 0x035C50 23:9C40: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C43_кнопки_не_нажаты:
C - - - - 0x035C53 23:9C43: A9 40     LDA #con_btn_B
C - - - - 0x035C55 23:9C45: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035C58 23:9C48: F0 02     BEQ bra_9C4C_B_не_нажата
C - - - - 0x035C5A 23:9C4A: 18        CLC
C - - - - 0x035C5B 23:9C4B: 60        RTS
bra_9C4C_B_не_нажата:
C - - - - 0x035C5C 23:9C4C: A9 80     LDA #con_btn_A
C - - - - 0x035C5E 23:9C4E: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035C61 23:9C51: F0 D9     BEQ bra_9C2C_ожидание_нажатия_A
C - - - - 0x035C63 23:9C53: 2C 24 06  BIT $0624
C - - - - 0x035C66 23:9C56: 70 02     BVS bra_9C5A
C - - - - 0x035C68 23:9C58: 38        SEC
C - - - - 0x035C69 23:9C59: 60        RTS
bra_9C5A:
C - - - - 0x035C6A 23:9C5A: A9 38     LDA #$38
C - - - - 0x035C6C 23:9C5C: 20 4E C5  JSR sub_0x03CBC0_запись_номера_сценария
C - - - - 0x035C6F 23:9C5F: A9 29     LDA #$29      ; rearrange_select_done
C - - - - 0x035C71 23:9C61: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035C74 23:9C64: A9 01     LDA #$01
C - - - - 0x035C76 23:9C66: 8D 25 06  STA $0625
C - - - - 0x035C79 23:9C69: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - 0x035C7C 23:9C6C: AD FE 05  LDA $05FE
C - - - - 0x035C7F 23:9C6F: 8D 24 06  STA $0624
loc_9C72_цикл:
bra_9C72_ожидание_нажатия_A:
C D - - - 0x035C82 23:9C72: A9 01     LDA #$01
C - - - - 0x035C84 23:9C74: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035C87 23:9C77: A9 84     LDA #$84
C - - - - 0x035C89 23:9C79: 8D 2D 06  STA $062D
C - - - - 0x035C8C 23:9C7C: A9 0C     LDA #con_btn_Down + con_btn_Up
C - - - - 0x035C8E 23:9C7E: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035C91 23:9C81: F0 0B     BEQ bra_9C8E
C - - - - 0x035C93 23:9C83: AD 25 06  LDA $0625
C - - - - 0x035C96 23:9C86: 49 40     EOR #$40
C - - - - 0x035C98 23:9C88: 8D 25 06  STA $0625
C - - - - 0x035C9B 23:9C8B: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
bra_9C8E:
C - - - - 0x035C9E 23:9C8E: A9 80     LDA #con_btn_A
C - - - - 0x035CA0 23:9C90: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035CA3 23:9C93: F0 DD     BEQ bra_9C72_ожидание_нажатия_A
C - - - - 0x035CA5 23:9C95: 2C 25 06  BIT $0625
C - - - - 0x035CA8 23:9C98: 50 07     BVC bra_9CA1
C - - - - 0x035CAA 23:9C9A: A9 00     LDA #$00
C - - - - 0x035CAC 23:9C9C: 8D 2D 06  STA $062D
C - - - - 0x035CAF 23:9C9F: 38        SEC
C - - - - 0x035CB0 23:9CA0: 60        RTS
bra_9CA1:
C - - - - 0x035CB1 23:9CA1: A9 81     LDA #$81
C - - - - 0x035CB3 23:9CA3: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - 0x035CB6 23:9CA6: A9 81     LDA #$81
C - - - - 0x035CB8 23:9CA8: 8D 2D 06  STA $062D
C - - - - 0x035CBB 23:9CAB: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
loc_9CAE_цикл:
bra_9CAE_цикл:
C - - - - 0x035CBE 23:9CAE: A9 01     LDA #$01
C - - - - 0x035CC0 23:9CB0: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035CC3 23:9CB3: 20 9B 9D  JSR sub_9D9B
C - - - - 0x035CC6 23:9CB6: CD 24 06  CMP $0624
C - - - - 0x035CC9 23:9CB9: 8D 24 06  STA $0624
C - - - - 0x035CCC 23:9CBC: F0 03     BEQ bra_9CC1
C - - - - 0x035CCE 23:9CBE: 20 D4 9D  JSR sub_9DD4_отобразить_или_затереть_статы_принимающего
bra_9CC1:
C - - - - 0x035CD1 23:9CC1: A9 40     LDA #con_btn_B
C - - - - 0x035CD3 23:9CC3: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035CD6 23:9CC6: F0 09     BEQ bra_9CD1_B_не_нажата
C - - - - 0x035CD8 23:9CC8: AD 25 06  LDA $0625
C - - - - 0x035CDB 23:9CCB: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - 0x035CDE 23:9CCE: 4C 72 9C  JMP loc_9C72_цикл
bra_9CD1_B_не_нажата:
C - - - - 0x035CE1 23:9CD1: A9 80     LDA #con_btn_A
C - - - - 0x035CE3 23:9CD3: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035CE6 23:9CD6: F0 D6     BEQ bra_9CAE_цикл
C - - - - 0x035CE8 23:9CD8: AD FC 05  LDA ram_принимающий
C - - - - 0x035CEB 23:9CDB: C9 FF     CMP #$FF
C - - - - 0x035CED 23:9CDD: F0 CF     BEQ bra_9CAE_цикл
C - - - - 0x035CEF 23:9CDF: AD 24 06  LDA $0624
C - - - - 0x035CF2 23:9CE2: 8D 16 06  STA ram_номер_защитника
bra_9CE5_ожидание_нажатия_A:
C - - - - 0x035CF5 23:9CE5: A9 01     LDA #$01
C - - - - 0x035CF7 23:9CE7: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035CFA 23:9CEA: 20 9B 9D  JSR sub_9D9B
C - - - - 0x035CFD 23:9CED: CD 24 06  CMP $0624
C - - - - 0x035D00 23:9CF0: 8D 24 06  STA $0624
C - - - - 0x035D03 23:9CF3: F0 03     BEQ bra_9CF8
C - - - - 0x035D05 23:9CF5: 20 BD 9D  JSR sub_9DBD
bra_9CF8:
C - - - - 0x035D08 23:9CF8: A9 40     LDA #con_btn_B
C - - - - 0x035D0A 23:9CFA: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035D0D 23:9CFD: F0 0C     BEQ bra_9D0B_B_не_нажата
- - - - - 0x035D0F 23:9CFF: AD 16 06  LDA ram_номер_защитника
- - - - - 0x035D12 23:9D02: 8D 24 06  STA $0624
- - - - - 0x035D15 23:9D05: 20 BD 9D  JSR sub_9DBD
- - - - - 0x035D18 23:9D08: 4C AE 9C  JMP loc_9CAE_цикл
bra_9D0B_B_не_нажата:
C - - - - 0x035D1B 23:9D0B: A9 80     LDA #con_btn_A
C - - - - 0x035D1D 23:9D0D: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035D20 23:9D10: F0 D3     BEQ bra_9CE5_ожидание_нажатия_A
C - - - - 0x035D22 23:9D12: AD 25 06  LDA $0625
C - - - - 0x035D25 23:9D15: 20 1B 9D  JSR sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча
C - - - - 0x035D28 23:9D18: 4C 72 9C  JMP loc_9C72_цикл

sub_9D1B_курсор_из_тайлов_для_меню_во_время_матча:
C - - - - 0x035D2B 23:9D1B: 48        PHA
bra_9D1C_ожидание_освобождения_буфера:
C - - - - 0x035D2C 23:9D1C: A9 01     LDA #$01
C - - - - 0x035D2E 23:9D1E: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035D31 23:9D21: AD 15 05  LDA $0515
C - - - - 0x035D34 23:9D24: D0 F6     BNE bra_9D1C_ожидание_освобождения_буфера
C - - - - 0x035D36 23:9D26: A9 01     LDA #$01
C - - - - 0x035D38 23:9D28: 8D 15 05  STA $0515
C - - - - 0x035D3B 23:9D2B: 68        PLA
C - - - - 0x035D3C 23:9D2C: 8D A5 04  STA $04A5
C - - - - 0x035D3F 23:9D2F: 29 0F     AND #$0F
C - - - - 0x035D41 23:9D31: 0A        ASL
C - - - - 0x035D42 23:9D32: 0A        ASL
C - - - - 0x035D43 23:9D33: AA        TAX
C - - - - 0x035D44 23:9D34: BD 82 9D  LDA tbl_9D82_адрес_ppu_курсора,X
C - - - - 0x035D47 23:9D37: 8D A6 04  STA $04A6
C - - - - 0x035D4A 23:9D3A: BD 83 9D  LDA tbl_9D82_адрес_ppu_курсора + 1,X
C - - - - 0x035D4D 23:9D3D: 8D A7 04  STA $04A7
C - - - - 0x035D50 23:9D40: BD 84 9D  LDA tbl_9D82_адрес_ppu_курсора + 2,X
C - - - - 0x035D53 23:9D43: 8D AA 04  STA $04AA
C - - - - 0x035D56 23:9D46: BD 85 9D  LDA tbl_9D82_адрес_ppu_курсора + 3,X
C - - - - 0x035D59 23:9D49: 8D AB 04  STA $04AB
C - - - - 0x035D5C 23:9D4C: AD A5 04  LDA $04A5
C - - - - 0x035D5F 23:9D4F: 29 0F     AND #$0F
C - - - - 0x035D61 23:9D51: AA        TAX
C - - - - 0x035D62 23:9D52: A9 00     LDA #$00
C - - - - 0x035D64 23:9D54: 2C A5 04  BIT $04A5
C - - - - 0x035D67 23:9D57: 30 05     BMI bra_9D5E
C - - - - 0x035D69 23:9D59: 70 03     BVS bra_9D5E
C - - - - 0x035D6B 23:9D5B: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D5E:
C - - - - 0x035D6E 23:9D5E: 8D A8 04  STA $04A8
C - - - - 0x035D71 23:9D61: A9 00     LDA #$00
C - - - - 0x035D73 23:9D63: 2C A5 04  BIT $04A5
C - - - - 0x035D76 23:9D66: 30 05     BMI bra_9D6D
C - - - - 0x035D78 23:9D68: 50 03     BVC bra_9D6D
C - - - - 0x035D7A 23:9D6A: BD 96 9D  LDA tbl_9D96_тайл_курсора,X
bra_9D6D:
C - - - - 0x035D7D 23:9D6D: 8D AC 04  STA $04AC
C - - - - 0x035D80 23:9D70: A2 01     LDX #$01
C - - - - 0x035D82 23:9D72: 8E A5 04  STX $04A5
C - - - - 0x035D85 23:9D75: 8E A9 04  STX $04A9
C - - - - 0x035D88 23:9D78: CA        DEX
C - - - - 0x035D89 23:9D79: 8E AD 04  STX $04AD
C - - - - 0x035D8C 23:9D7C: A9 80     LDA #$80
C - - - - 0x035D8E 23:9D7E: 8D 15 05  STA $0515
C - - - - 0x035D91 23:9D81: 60        RTS

tbl_9D82_адрес_ppu_курсора:
    .word $22ED, $232D      ; rearrange players no/yes
    .word $2288, $22C8      ; rearrange select/done
    .word $2288, $22C8      ; aim left/right
    .word $228A, $22CA      ; wall left/right
    .word $2289, $22C9      ; resume/edit team data

tbl_9D96_тайл_курсора:
    .byte $F6
    .byte $F6
    .byte $F6
    .byte $F6
    .byte $B1

sub_9D9B:
C - - - - 0x035DAB 23:9D9B: A9 0F     LDA #con_btns_Dpad
C - - - - 0x035DAD 23:9D9D: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035DB0 23:9DA0: F0 13     BEQ bra_9DB5
C - - - - 0x035DB2 23:9DA2: A2 00     LDX #$00
bra_9DA4:
C - - - - 0x035DB4 23:9DA4: 4A        LSR
C - - - - 0x035DB5 23:9DA5: B0 03     BCS bra_9DAA
C - - - - 0x035DB7 23:9DA7: E8        INX
C - - - - 0x035DB8 23:9DA8: D0 FA     BNE bra_9DA4
bra_9DAA:
C - - - - 0x035DBA 23:9DAA: BD B9 9D  LDA tbl_9DB9,X
C - - - - 0x035DBD 23:9DAD: 18        CLC
C - - - - 0x035DBE 23:9DAE: 6D 24 06  ADC $0624
C - - - - 0x035DC1 23:9DB1: C9 F0     CMP #$F0
C - - - - 0x035DC3 23:9DB3: 90 03     BCC bra_9DB8_выход
bra_9DB5:
C - - - - 0x035DC5 23:9DB5: AD 24 06  LDA $0624
bra_9DB8_выход:
C - - - - 0x035DC8 23:9DB8: 60        RTS

tbl_9DB9:
- D - - - 0x035DC9 23:9DB9: 0C        .byte $0C    ; <し>
- D - - - 0x035DCA 23:9DBA: F4        .byte $F4
- D - - - 0x035DCB 23:9DBB: 01        .byte $01    ; <あ>
- D - - - 0x035DCC 23:9DBC: FF        .byte $FF

sub_9DBD:
C - - - - 0x035DCD 23:9DBD: AD FC 05  LDA ram_принимающий
C - - - - 0x035DD0 23:9DC0: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035DD3 23:9DC3: AD 24 06  LDA $0624
C - - - - 0x035DD6 23:9DC6: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x035DD9 23:9DC9: 98        TYA
C - - - - 0x035DDA 23:9DCA: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x035DDC 23:9DCC: 91 34     STA (ram_plr_data),Y
C - - - - 0x035DDE 23:9DCE: 8A        TXA
C - - - - 0x035DDF 23:9DCF: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x035DE1 23:9DD1: 91 34     STA (ram_plr_data),Y
C - - - - 0x035DE3 23:9DD3: 60        RTS

sub_9DD4_отобразить_или_затереть_статы_принимающего:
C - - - - 0x035DE4 23:9DD4: A9 01     LDA #$01      ; не начинать поиск с кипера
C - - - - 0x035DE6 23:9DD6: 85 3A     STA ram_003A
bra_9DD8_цикл:
C - - - - 0x035DE8 23:9DD8: A5 3A     LDA ram_003A
C - - - - 0x035DEA 23:9DDA: CD 41 04  CMP ram_игрок_с_мячом
C - - - - 0x035DED 23:9DDD: F0 15     BEQ bra_9DF4_игнорировать_игрока_с_мячом_при_поиске
C - - - - 0x035DEF 23:9DDF: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035DF2 23:9DE2: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x035DF4 23:9DE4: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035DF6 23:9DE6: AA        TAX
C - - - - 0x035DF7 23:9DE7: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x035DF9 23:9DE9: B1 34     LDA (ram_plr_data),Y
C - - - - 0x035DFB 23:9DEB: A8        TAY
C - - - - 0x035DFC 23:9DEC: 20 39 C5  JSR sub_0x03CDF2
C - - - - 0x035DFF 23:9DEF: CD 24 06  CMP $0624
C - - - - 0x035E02 23:9DF2: F0 0E     BEQ bra_9E02_игрок_найден
bra_9DF4_игнорировать_игрока_с_мячом_при_поиске:
C - - - - 0x035E04 23:9DF4: E6 3A     INC ram_003A
C - - - - 0x035E06 23:9DF6: A5 3A     LDA ram_003A
C - - - - 0x035E08 23:9DF8: C9 0B     CMP #$0B
C - - - - 0x035E0A 23:9DFA: D0 DC     BNE bra_9DD8_цикл
C - - - - 0x035E0C 23:9DFC: A2 FF     LDX #$FF
C - - - - 0x035E0E 23:9DFE: A9 1C     LDA #$1C      ; clear_reciever_stats_window
C - - - - 0x035E10 23:9E00: D0 04     BNE bra_9E06_очистить_экран_справа
bra_9E02_игрок_найден:
C - - - - 0x035E12 23:9E02: A9 1D     LDA #$1D      ; reciever_dribble_pass_shoot
C - - - - 0x035E14 23:9E04: A6 3A     LDX ram_003A
bra_9E06_очистить_экран_справа:
C - - - - 0x035E16 23:9E06: 8E FC 05  STX ram_принимающий
C - - - - 0x035E19 23:9E09: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035E1C 23:9E0C: 60        RTS

sub_9E0D:
C - - - - 0x035E1D 23:9E0D: 85 3A     STA ram_003A
C - - - - 0x035E1F 23:9E0F: 0A        ASL
C - - - - 0x035E20 23:9E10: AA        TAX
C - - - - 0x035E21 23:9E11: BD F0 9F  LDA tbl_9FF0,X
C - - - - 0x035E24 23:9E14: 85 3C     STA ram_003C
C - - - - 0x035E26 23:9E16: BD F1 9F  LDA tbl_9FF0 + 1,X
C - - - - 0x035E29 23:9E19: 85 3D     STA ram_003D
C - - - - 0x035E2B 23:9E1B: A9 00     LDA #$00
C - - - - 0x035E2D 23:9E1D: 85 3B     STA ram_003B
bra_9E1F_цикл:
C - - - - 0x035E2F 23:9E1F: A5 3B     LDA ram_003B
C - - - - 0x035E31 23:9E21: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x035E34 23:9E24: A6 3B     LDX ram_003B
C - - - - 0x035E36 23:9E26: EC 41 04  CPX ram_игрок_с_мячом
C - - - - 0x035E39 23:9E29: F0 1B     BEQ bra_9E46
C - - - - 0x035E3B 23:9E2B: AC FB 05  LDY ram_команда_с_мячом
C - - - - 0x035E3E 23:9E2E: E0 0B     CPX #$0B
C - - - - 0x035E40 23:9E30: 90 08     BCC bra_9E3A
C - - - - 0x035E42 23:9E32: 8A        TXA
C - - - - 0x035E43 23:9E33: E9 0B     SBC #$0B
C - - - - 0x035E45 23:9E35: AA        TAX
C - - - - 0x035E46 23:9E36: 98        TYA
C - - - - 0x035E47 23:9E37: 49 0B     EOR #$0B
C - - - - 0x035E49 23:9E39: A8        TAY
bra_9E3A:
C - - - - 0x035E4A 23:9E3A: 86 3E     STX ram_003E
C - - - - 0x035E4C 23:9E3C: 98        TYA
C - - - - 0x035E4D 23:9E3D: 18        CLC
C - - - - 0x035E4E 23:9E3E: 65 3E     ADC ram_003E
C - - - - 0x035E50 23:9E40: A8        TAY
C - - - - 0x035E51 23:9E41: B1 3C     LDA (ram_003C),Y
C - - - - 0x035E53 23:9E43: 4C 4B 9E  JMP loc_9E4B
bra_9E46:
C - - - - 0x035E56 23:9E46: A6 3A     LDX ram_003A
C - - - - 0x035E58 23:9E48: BD F8 A0  LDA tbl_A0F8,X
loc_9E4B:
C D - - - 0x035E5B 23:9E4B: 20 EE 9B  JSR sub_9BEE
C - - - - 0x035E5E 23:9E4E: E6 3B     INC ram_003B
C - - - - 0x035E60 23:9E50: A5 3B     LDA ram_003B
C - - - - 0x035E62 23:9E52: C9 16     CMP #$16
C - - - - 0x035E64 23:9E54: D0 C9     BNE bra_9E1F_цикл
C - - - - 0x035E66 23:9E56: 20 45 C6  JSR sub_0x03E6FC
C - - - - 0x035E69 23:9E59: 60        RTS

sub_9E5A_отрисовка_меню_во_время_матча:
C - - - - 0x035E6A 23:9E5A: 48        PHA
C - - - - 0x035E6B 23:9E5B: A9 01     LDA #$01
C - - - - 0x035E6D 23:9E5D: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035E70 23:9E60: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - 0x035E73 23:9E63: 68        PLA
C - - - - 0x035E74 23:9E64: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x035E77 23:9E67: F0 06     BEQ bra_9E6F_мячом_владеет_команда_слева
C - - - - 0x035E79 23:9E69: A9 14     LDA #$14      ; у компа всегда пробивает 10й номер
C - - - - 0x035E7B 23:9E6B: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x035E7E 23:9E6E: 60        RTS
bra_9E6F_мячом_владеет_команда_слева:
C - - - - 0x035E7F 23:9E6F: 20 2A C5  JSR sub_0x03EF8F_отрисовка_меню_во_время_матча
C - - - - 0x035E82 23:9E72: A9 01     LDA #$01
C - - - - 0x035E84 23:9E74: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x035E87 23:9E77: A0 00     LDY #$00
C - - - - 0x035E89 23:9E79: 20 3B 9F  JSR sub_9F3B
bra_9E7C:
C - - - - 0x035E8C 23:9E7C: A9 01     LDA #$01
C - - - - 0x035E8E 23:9E7E: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035E91 23:9E81: A9 0F     LDA #con_btns_Dpad
C - - - - 0x035E93 23:9E83: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035E96 23:9E86: F0 27     BEQ bra_9EAF
C - - - - 0x035E98 23:9E88: A2 00     LDX #$00
bra_9E8A:
C - - - - 0x035E9A 23:9E8A: 4A        LSR
C - - - - 0x035E9B 23:9E8B: B0 03     BCS bra_9E90
C - - - - 0x035E9D 23:9E8D: E8        INX
C - - - - 0x035E9E 23:9E8E: D0 FA     BNE bra_9E8A
bra_9E90:
C - - - - 0x035EA0 23:9E90: 86 3A     STX ram_003A
C - - - - 0x035EA2 23:9E92: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x035EA5 23:9E95: 0A        ASL
C - - - - 0x035EA6 23:9E96: 0A        ASL
C - - - - 0x035EA7 23:9E97: 65 3A     ADC ram_003A
C - - - - 0x035EA9 23:9E99: AA        TAX
C - - - - 0x035EAA 23:9E9A: BD B7 9E  LDA tbl_9EB7_изменение_позиции_курсора_основных_игроков,X
C - - - - 0x035EAD 23:9E9D: 48        PHA
C - - - - 0x035EAE 23:9E9E: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x035EB1 23:9EA1: A0 00     LDY #$00
C - - - - 0x035EB3 23:9EA3: 20 3F 9F  JSR sub_9F3F
C - - - - 0x035EB6 23:9EA6: 68        PLA
C - - - - 0x035EB7 23:9EA7: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x035EBA 23:9EAA: A0 00     LDY #$00
C - - - - 0x035EBC 23:9EAC: 20 3B 9F  JSR sub_9F3B
bra_9EAF:
C - - - - 0x035EBF 23:9EAF: A9 80     LDA #con_btn_A
C - - - - 0x035EC1 23:9EB1: 2D 1E 00  AND ram_одноразовые
C - - - - 0x035EC4 23:9EB4: F0 C6     BEQ bra_9E7C
C - - - - 0x035EC6 23:9EB6: 60        RTS



tbl_9EB7_изменение_позиции_курсора_основных_игроков:
; также используется для выбора игрока на пенальти
    ; GK (unused)
    .byte $FF   ; right
    .byte $FF   ; left
    .byte $FF   ; down
    .byte $FF   ; up
    ; 2
    .byte $06   ; right
    .byte $06   ; left
    .byte $02   ; down
    .byte $05   ; up
    ; 3
    .byte $07   ; right
    .byte $07   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $05   ; down
    .byte $03   ; up
    ; 6
    .byte $0A   ; right
    .byte $0A   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 7
    .byte $01   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $0A   ; up
    ; 8
    .byte $02   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; 9
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; 10
    .byte $04   ; right
    .byte $04   ; left
    .byte $0A   ; down
    .byte $08   ; up
    ; 11
    .byte $05   ; right
    .byte $05   ; left
    .byte $06   ; down
    .byte $09   ; up



tbl_9F0F_изменение_позиции_курсора_запасных_игроков:
    ; 1
    .byte $05   ; right
    .byte $08   ; left
    .byte $01   ; down
    .byte $04   ; up
    ; 2
    .byte $06   ; right
    .byte $08   ; left
    .byte $02   ; down
    .byte $00   ; up
    ; 3
    .byte $07   ; right
    .byte $08   ; left
    .byte $03   ; down
    .byte $01   ; up
    ; 4
    .byte $08   ; right
    .byte $08   ; left
    .byte $04   ; down
    .byte $02   ; up
    ; 5
    .byte $09   ; right
    .byte $09   ; left
    .byte $00   ; down
    .byte $03   ; up
    ; 6
    .byte $08   ; right
    .byte $00   ; left
    .byte $06   ; down
    .byte $09   ; up
    ; 7
    .byte $08   ; right
    .byte $01   ; left
    .byte $07   ; down
    .byte $05   ; up
    ; 8
    .byte $09   ; right
    .byte $02   ; left
    .byte $08   ; down
    .byte $06   ; up
    ; GK1
    .byte $03   ; right
    .byte $03   ; left
    .byte $09   ; down
    .byte $07   ; up
    ; GK2
    .byte $04   ; right
    .byte $04   ; left
    .byte $05   ; down
    .byte $08   ; up



sub_9F37:
C - - - - 0x035F47 23:9F37: A2 B1     LDX #$B1
C - - - - 0x035F49 23:9F39: D0 06     BNE bra_9F41

sub_9F3B:
C - - - - 0x035F4B 23:9F3B: A2 F6     LDX #$F6
C - - - - 0x035F4D 23:9F3D: D0 02     BNE bra_9F41

sub_9F3F:
C - - - - 0x035F4F 23:9F3F: A2 00     LDX #$00
bra_9F41:
sub_9F41_позиция_курсора_при_замене_основного_состава:
C - - - - 0x035F51 23:9F41: 48        PHA
bra_9F42_ожидание_освобождения_буфера:
C - - - - 0x035F52 23:9F42: A9 01     LDA #$01
C - - - - 0x035F54 23:9F44: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x035F57 23:9F47: AD 15 05  LDA $0515
C - - - - 0x035F5A 23:9F4A: D0 F6     BNE bra_9F42_ожидание_освобождения_буфера
C - - - - 0x035F5C 23:9F4C: A9 01     LDA #$01
C - - - - 0x035F5E 23:9F4E: 8D 15 05  STA $0515
C - - - - 0x035F61 23:9F51: 8E A8 04  STX $04A8
C - - - - 0x035F64 23:9F54: 8C A5 04  STY $04A5
C - - - - 0x035F67 23:9F57: 68        PLA
C - - - - 0x035F68 23:9F58: 0A        ASL
C - - - - 0x035F69 23:9F59: 6D A5 04  ADC $04A5
C - - - - 0x035F6C 23:9F5C: AA        TAX
C - - - - 0x035F6D 23:9F5D: A9 01     LDA #$01
C - - - - 0x035F6F 23:9F5F: 8D A5 04  STA $04A5
C - - - - 0x035F72 23:9F62: BD 79 9F  LDA tbl_9F79_позиция_ppu_курсора,X
C - - - - 0x035F75 23:9F65: 8D A6 04  STA $04A6
C - - - - 0x035F78 23:9F68: BD 7A 9F  LDA tbl_9F79_позиция_ppu_курсора + 1,X
C - - - - 0x035F7B 23:9F6B: 8D A7 04  STA $04A7
C - - - - 0x035F7E 23:9F6E: A9 00     LDA #$00
C - - - - 0x035F80 23:9F70: 8D A9 04  STA $04A9
C - - - - 0x035F83 23:9F73: A9 80     LDA #$80
C - - - - 0x035F85 23:9F75: 8D 15 05  STA $0515
C - - - - 0x035F88 23:9F78: 60        RTS

tbl_9F79_позиция_ppu_курсора:
; выбор пробивающего нарушение
    .word $0000     ; unused
    .word $226A     ; 2
    .word $22AA     ; 3
    .word $22EA     ; 4
    .word $232A     ; 5
    .word $236A     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена между основными игроками
    .word $238D
    .word $2264     ; 2
    .word $22A4     ; 3
    .word $22E4     ; 4
    .word $2324     ; 5
    .word $2364     ; 6
    .word $2274     ; 7
    .word $22B4     ; 8
    .word $22F4     ; 9
    .word $2334     ; 10
    .word $2374     ; 11
; замена запасных игроков
    .word $2262     ; 1
    .word $22A2     ; 2
    .word $22E2     ; 3
    .word $2322     ; 4
    .word $2362     ; 5
    .word $226C     ; 6
    .word $22AC     ; 7
    .word $22EC     ; 8
    .word $2334     ; GK1
    .word $2374     ; GK2

tbl_9FB9:
- D - - - 0x035FC9 23:9FB9: C3 9F     .word off_9FC3_00
- D - - - 0x035FCB 23:9FBB: CD 9F     .word off_9FCD_01
- D - - - 0x035FCD 23:9FBD: D5 9F     .word off_9FD5_02
- D - - - 0x035FCF 23:9FBF: DE 9F     .word off_9FDE_03
- D - - - 0x035FD1 23:9FC1: E6 9F     .word off_9FE6_04

off_9FC3_00:
- D - I - 0x035FD3 23:9FC3: B4        .byte $B4    ; <ガ>
- D - I - 0x035FD4 23:9FC4: C0        .byte $C0    ; <ヅ>
- D - I - 0x035FD5 23:9FC5: C1        .byte $C1    ; <デ>
- D - I - 0x035FD6 23:9FC6: CC        .byte $CC    ; <ぽ>
- D - I - 0x035FD7 23:9FC7: CD        .byte $CD    ; <パ>
- D - I - 0x035FD8 23:9FC8: D8        .byte $D8
- D - I - 0x035FD9 23:9FC9: D9        .byte $D9
- D - I - 0x035FDA 23:9FCA: E4        .byte $E4
- D - I - 0x035FDB 23:9FCB: E5        .byte $E5
- D - I - 0x035FDC 23:9FCC: FF        .byte $FF

off_9FCD_01:
- D - I - 0x035FDD 23:9FCD: A8        .byte $A8    ; <ぜ>
- D - I - 0x035FDE 23:9FCE: A9        .byte $A9    ; <ぞ>
- D - I - 0x035FDF 23:9FCF: AA        .byte $AA    ; <だ>
- D - I - 0x035FE0 23:9FD0: AB        .byte $AB    ; <ぢ>
- D - I - 0x035FE1 23:9FD1: B5        .byte $B5    ; <ギ>
- D - I - 0x035FE2 23:9FD2: B6        .byte $B6    ; <グ>
- D - I - 0x035FE3 23:9FD3: B7        .byte $B7    ; <ゲ>
- D - I - 0x035FE4 23:9FD4: FF        .byte $FF

off_9FD5_02:
- D - I - 0x035FE5 23:9FD5: AC        .byte $AC    ; <づ>
- D - I - 0x035FE6 23:9FD6: AD        .byte $AD    ; <で>
- D - I - 0x035FE7 23:9FD7: AE        .byte $AE    ; <ど>
- D - I - 0x035FE8 23:9FD8: AF        .byte $AF    ; <ば>
- D - I - 0x035FE9 23:9FD9: B8        .byte $B8    ; <ゴ>
- D - I - 0x035FEA 23:9FDA: B9        .byte $B9    ; <ザ>
- D - I - 0x035FEB 23:9FDB: BA        .byte $BA    ; <ジ>
- D - I - 0x035FEC 23:9FDC: BB        .byte $BB    ; <ズ>
- D - I - 0x035FED 23:9FDD: FF        .byte $FF

off_9FDE_03:
- D - I - 0x035FEE 23:9FDE: B0        .byte $B0    ; <び>
- D - I - 0x035FEF 23:9FDF: B1        .byte $B1    ; <ぶ>
- D - I - 0x035FF0 23:9FE0: B2        .byte $B2    ; <べ>
- D - I - 0x035FF1 23:9FE1: B3        .byte $B3    ; <ぼ>
- D - I - 0x035FF2 23:9FE2: BC        .byte $BC    ; <ゼ>
- D - I - 0x035FF3 23:9FE3: BD        .byte $BD    ; <ゾ>
- D - I - 0x035FF4 23:9FE4: BE        .byte $BE    ; <ダ>
- D - I - 0x035FF5 23:9FE5: FF        .byte $FF

off_9FE6_04:
- D - I - 0x035FF6 23:9FE6: BF        .byte $BF    ; <ヂ>
- D - I - 0x035FF7 23:9FE7: CA        .byte $CA    ; <ぷ>
- D - I - 0x035FF8 23:9FE8: CB        .byte $CB    ; <ぺ>
- D - I - 0x035FF9 23:9FE9: D6        .byte $D6
- D - I - 0x035FFA 23:9FEA: D7        .byte $D7
- D - I - 0x035FFB 23:9FEB: E2        .byte $E2
- D - I - 0x035FFC 23:9FEC: E3        .byte $E3
- D - I - 0x035FFD 23:9FED: EE        .byte $EE
- D - I - 0x035FFE 23:9FEE: EF        .byte $EF
- D - I - 0x035FFF 23:9FEF: FF        .byte $FF



tbl_9FF0:
- - - - - 0x036000 23:9FF0: 06 A0     .word off_A006_00
- - - - - 0x036002 23:9FF2: 1C A0     .word off_A01C_01
- D - - - 0x036004 23:9FF4: 32 A0     .word off_A032_02
- D - - - 0x036006 23:9FF6: 48 A0     .word off_A048_03
- D - - - 0x036008 23:9FF8: 5E A0     .word off_A05E_04
- D - - - 0x03600A 23:9FFA: 74 A0     .word off_A074_05
- D - - - 0x03600C 23:9FFC: 8A A0     .word off_A08A_06
- D - - - 0x03600E 23:9FFE: A0 A0     .word off_A0A0_07
- D - - - 0x036010 23:A000: B6 A0     .word off_A0B6_08
- D - - - 0x036012 23:A002: CC A0     .word off_A0CC_09
- D - - - 0x036014 23:A004: E2 A0     .word off_A0E2_0A

off_A006_00:
- - - - - 0x036016 23:A006: FF        .byte $FF
- - - - - 0x036017 23:A007: 9D        .byte $9D
- - - - - 0x036018 23:A008: B2        .byte $B2    ; <べ>
- - - - - 0x036019 23:A009: 95        .byte $95
- - - - - 0x03601A 23:A00A: 7E        .byte $7E    ; <.>
- - - - - 0x03601B 23:A00B: C4        .byte $C4    ; <ビ>
- - - - - 0x03601C 23:A00C: E4        .byte $E4
- - - - - 0x03601D 23:A00D: DF        .byte $DF
- - - - - 0x03601E 23:A00E: E9        .byte $E9
- - - - - 0x03601F 23:A00F: DE        .byte $DE
- - - - - 0x036020 23:A010: E1        .byte $E1
- - - - - 0x036021 23:A011: FF        .byte $FF
- - - - - 0x036022 23:A012: EA        .byte $EA
- - - - - 0x036023 23:A013: E5        .byte $E5
- - - - - 0x036024 23:A014: E7        .byte $E7
- - - - - 0x036025 23:A015: DB        .byte $DB
- - - - - 0x036026 23:A016: CF        .byte $CF    ; <プ>
- - - - - 0x036027 23:A017: 84        .byte $84    ; <D>
- - - - - 0x036028 23:A018: D3        .byte $D3
- - - - - 0x036029 23:A019: 7D        .byte $7D    ; <ー>
- - - - - 0x03602A 23:A01A: D1        .byte $D1    ; <ポ>
- - - - - 0x03602B 23:A01B: A5        .byte $A5    ; <ざ>

off_A01C_01:
- - - - - 0x03602C 23:A01C: FF        .byte $FF
- - - - - 0x03602D 23:A01D: 91        .byte $91    ; <V>
- - - - - 0x03602E 23:A01E: A5        .byte $A5    ; <ざ>
- - - - - 0x03602F 23:A01F: 95        .byte $95
- - - - - 0x036030 23:A020: 7E        .byte $7E    ; <.>
- - - - - 0x036031 23:A021: B4        .byte $B4    ; <ガ>
- - - - - 0x036032 23:A022: E1        .byte $E1
- - - - - 0x036033 23:A023: D4        .byte $D4
- - - - - 0x036034 23:A024: D2        .byte $D2
- - - - - 0x036035 23:A025: BB        .byte $BB    ; <ズ>
- - - - - 0x036036 23:A026: CD        .byte $CD    ; <パ>
- - - - - 0x036037 23:A027: FF        .byte $FF
- - - - - 0x036038 23:A028: E0        .byte $E0
- - - - - 0x036039 23:A029: D9        .byte $D9
- - - - - 0x03603A 23:A02A: DB        .byte $DB
- - - - - 0x03603B 23:A02B: D0        .byte $D0    ; <ペ>
- - - - - 0x03603C 23:A02C: C5        .byte $C5    ; <ブ>
- - - - - 0x03603D 23:A02D: 90        .byte $90    ; <U>
- - - - - 0x03603E 23:A02E: A0        .byte $A0    ; <が>
- - - - - 0x03603F 23:A02F: 7D        .byte $7D    ; <ー>
- - - - - 0x036040 23:A030: BC        .byte $BC    ; <ゼ>
- - - - - 0x036041 23:A031: 9A        .byte $9A

off_A032_02:
- D - I - 0x036042 23:A032: FF        .byte $FF
- D - I - 0x036043 23:A033: 92        .byte $92    ; <W>
- D - I - 0x036044 23:A034: A5        .byte $A5    ; <ざ>
- D - I - 0x036045 23:A035: 95        .byte $95
- D - I - 0x036046 23:A036: 7E        .byte $7E    ; <.>
- D - I - 0x036047 23:A037: AB        .byte $AB    ; <ぢ>
- D - I - 0x036048 23:A038: E1        .byte $E1
- D - I - 0x036049 23:A039: C8        .byte $C8    ; <ぱ>
- D - I - 0x03604A 23:A03A: CF        .byte $CF    ; <プ>
- D - I - 0x03604B 23:A03B: AF        .byte $AF    ; <ば>
- D - I - 0x03604C 23:A03C: C1        .byte $C1    ; <デ>
- D - I - 0x03604D 23:A03D: FF        .byte $FF
- D - I - 0x03604E 23:A03E: E0        .byte $E0
- D - I - 0x03604F 23:A03F: CD        .byte $CD    ; <パ>
- D - I - 0x036050 23:A040: D0        .byte $D0    ; <ペ>
- D - I - 0x036051 23:A041: D1        .byte $D1    ; <ポ>
- D - I - 0x036052 23:A042: D2        .byte $D2
- D - I - 0x036053 23:A043: 91        .byte $91    ; <V>
- D - I - 0x036054 23:A044: B7        .byte $B7    ; <ゲ>
- D - I - 0x036055 23:A045: 7D        .byte $7D    ; <ー>
- D - I - 0x036056 23:A046: BC        .byte $BC    ; <ゼ>
- D - I - 0x036057 23:A047: 9A        .byte $9A

off_A048_03:
- D - I - 0x036058 23:A048: FF        .byte $FF
- D - I - 0x036059 23:A049: 91        .byte $91    ; <V>
- D - I - 0x03605A 23:A04A: 9A        .byte $9A
- D - I - 0x03605B 23:A04B: 95        .byte $95
- D - I - 0x03605C 23:A04C: 7E        .byte $7E    ; <.>
- D - I - 0x03605D 23:A04D: BF        .byte $BF    ; <ヂ>
- D - I - 0x03605E 23:A04E: D6        .byte $D6
- D - I - 0x03605F 23:A04F: CF        .byte $CF    ; <プ>
- D - I - 0x036060 23:A050: D1        .byte $D1    ; <ポ>
- - - - - 0x036061 23:A051: B8        .byte $B8    ; <ゴ>
- D - I - 0x036062 23:A052: DA        .byte $DA
- D - I - 0x036063 23:A053: FF        .byte $FF
- D - I - 0x036064 23:A054: E2        .byte $E2
- D - I - 0x036065 23:A055: DB        .byte $DB
- D - I - 0x036066 23:A056: C6        .byte $C6    ; <ベ>
- D - I - 0x036067 23:A057: D3        .byte $D3
- D - I - 0x036068 23:A058: E0        .byte $E0
- D - I - 0x036069 23:A059: 90        .byte $90    ; <U>
- D - I - 0x03606A 23:A05A: A2        .byte $A2    ; <ぐ>
- D - I - 0x03606B 23:A05B: 7D        .byte $7D    ; <ー>
- D - I - 0x03606C 23:A05C: B7        .byte $B7    ; <ゲ>
- D - I - 0x03606D 23:A05D: 9B        .byte $9B

off_A05E_04:
- D - I - 0x03606E 23:A05E: FF        .byte $FF
- D - I - 0x03606F 23:A05F: 9D        .byte $9D
- D - I - 0x036070 23:A060: A6        .byte $A6    ; <じ>
- D - I - 0x036071 23:A061: 95        .byte $95
- D - I - 0x036072 23:A062: 7E        .byte $7E    ; <.>
- - - - - 0x036073 23:A063: DC        .byte $DC
- D - I - 0x036074 23:A064: DA        .byte $DA
- D - I - 0x036075 23:A065: C7        .byte $C7    ; <ボ>
- D - I - 0x036076 23:A066: EA        .byte $EA
- D - I - 0x036077 23:A067: DD        .byte $DD
- D - I - 0x036078 23:A068: EF        .byte $EF
- D - I - 0x036079 23:A069: FF        .byte $FF
- D - I - 0x03607A 23:A06A: EE        .byte $EE
- D - I - 0x03607B 23:A06B: E9        .byte $E9
- D - I - 0x03607C 23:A06C: D4        .byte $D4
- D - I - 0x03607D 23:A06D: E0        .byte $E0
- D - I - 0x03607E 23:A06E: EC        .byte $EC
- D - I - 0x03607F 23:A06F: 90        .byte $90    ; <U>
- D - I - 0x036080 23:A070: D2        .byte $D2
- D - I - 0x036081 23:A071: 7D        .byte $7D    ; <ー>
- D - I - 0x036082 23:A072: D0        .byte $D0    ; <ペ>
- D - I - 0x036083 23:A073: 99        .byte $99

off_A074_05:
- D - I - 0x036084 23:A074: FF        .byte $FF
- D - I - 0x036085 23:A075: 91        .byte $91    ; <V>
- D - I - 0x036086 23:A076: 9A        .byte $9A
- D - I - 0x036087 23:A077: 95        .byte $95
- D - I - 0x036088 23:A078: 7E        .byte $7E    ; <.>
- D - I - 0x036089 23:A079: B7        .byte $B7    ; <ゲ>
- D - I - 0x03608A 23:A07A: D6        .byte $D6
- D - I - 0x03608B 23:A07B: AE        .byte $AE    ; <ど>
- D - I - 0x03608C 23:A07C: BC        .byte $BC    ; <ゼ>
- D - I - 0x03608D 23:A07D: B9        .byte $B9    ; <ザ>
- D - I - 0x03608E 23:A07E: CD        .byte $CD    ; <パ>
- D - I - 0x03608F 23:A07F: FF        .byte $FF
- D - I - 0x036090 23:A080: E2        .byte $E2
- D - I - 0x036091 23:A081: D9        .byte $D9
- D - I - 0x036092 23:A082: BB        .byte $BB    ; <ズ>
- D - I - 0x036093 23:A083: B8        .byte $B8    ; <ゴ>
- D - I - 0x036094 23:A084: BD        .byte $BD    ; <ゾ>
- D - I - 0x036095 23:A085: 9C        .byte $9C
- D - I - 0x036096 23:A086: C1        .byte $C1    ; <デ>
- D - I - 0x036097 23:A087: 7D        .byte $7D    ; <ー>
- D - I - 0x036098 23:A088: B6        .byte $B6    ; <グ>
- D - I - 0x036099 23:A089: A7        .byte $A7    ; <ず>

off_A08A_06:
- D - I - 0x03609A 23:A08A: FF        .byte $FF
- D - I - 0x03609B 23:A08B: A9        .byte $A9    ; <ぞ>
- D - I - 0x03609C 23:A08C: A5        .byte $A5    ; <ざ>
- D - I - 0x03609D 23:A08D: A1        .byte $A1    ; <ぎ>
- D - I - 0x03609E 23:A08E: 7E        .byte $7E    ; <.>
- D - I - 0x03609F 23:A08F: CF        .byte $CF    ; <プ>
- D - I - 0x0360A0 23:A090: D4        .byte $D4
- D - I - 0x0360A1 23:A091: D1        .byte $D1    ; <ポ>
- D - I - 0x0360A2 23:A092: E9        .byte $E9
- D - I - 0x0360A3 23:A093: DE        .byte $DE
- D - I - 0x0360A4 23:A094: D9        .byte $D9
- D - I - 0x0360A5 23:A095: FF        .byte $FF
- D - I - 0x0360A6 23:A096: DF        .byte $DF
- D - I - 0x0360A7 23:A097: E6        .byte $E6
- D - I - 0x0360A8 23:A098: E8        .byte $E8
- D - I - 0x0360A9 23:A099: EA        .byte $EA
- D - I - 0x0360AA 23:A09A: DD        .byte $DD
- D - I - 0x0360AB 23:A09B: C0        .byte $C0    ; <ヅ>
- D - I - 0x0360AC 23:A09C: DB        .byte $DB
- D - I - 0x0360AD 23:A09D: 89        .byte $89    ; <I>
- D - I - 0x0360AE 23:A09E: D2        .byte $D2
- D - I - 0x0360AF 23:A09F: C8        .byte $C8    ; <ぱ>

off_A0A0_07:
- D - I - 0x0360B0 23:A0A0: FF        .byte $FF
- D - I - 0x0360B1 23:A0A1: 9D        .byte $9D
- D - I - 0x0360B2 23:A0A2: B2        .byte $B2    ; <べ>
- D - I - 0x0360B3 23:A0A3: A2        .byte $A2    ; <ぐ>
- D - I - 0x0360B4 23:A0A4: 7D        .byte $7D    ; <ー>
- D - I - 0x0360B5 23:A0A5: D2        .byte $D2
- D - I - 0x0360B6 23:A0A6: E2        .byte $E2
- D - I - 0x0360B7 23:A0A7: D4        .byte $D4
- D - I - 0x0360B8 23:A0A8: EA        .byte $EA
- D - I - 0x0360B9 23:A0A9: DD        .byte $DD
- D - I - 0x0360BA 23:A0AA: CF        .byte $CF    ; <プ>
- D - I - 0x0360BB 23:A0AB: FF        .byte $FF
- D - I - 0x0360BC 23:A0AC: ED        .byte $ED
- D - I - 0x0360BD 23:A0AD: DC        .byte $DC
- D - I - 0x0360BE 23:A0AE: EB        .byte $EB
- D - I - 0x0360BF 23:A0AF: E9        .byte $E9
- D - I - 0x0360C0 23:A0B0: E0        .byte $E0
- D - I - 0x0360C1 23:A0B1: C3        .byte $C3    ; <バ>
- D - I - 0x0360C2 23:A0B2: DE        .byte $DE
- D - I - 0x0360C3 23:A0B3: 8A        .byte $8A    ; <N>
- D - I - 0x0360C4 23:A0B4: D1        .byte $D1    ; <ポ>
- D - I - 0x0360C5 23:A0B5: CB        .byte $CB    ; <ぺ>

off_A0B6_08:
- D - I - 0x0360C6 23:A0B6: FF        .byte $FF
- D - I - 0x0360C7 23:A0B7: 7E        .byte $7E    ; <.>
- D - I - 0x0360C8 23:A0B8: 87        .byte $87    ; <G>
- D - I - 0x0360C9 23:A0B9: DC        .byte $DC
- D - I - 0x0360CA 23:A0BA: DE        .byte $DE
- D - I - 0x0360CB 23:A0BB: CF        .byte $CF    ; <プ>
- D - I - 0x0360CC 23:A0BC: B1        .byte $B1    ; <ぶ>
- D - I - 0x0360CD 23:A0BD: C6        .byte $C6    ; <ベ>
- D - I - 0x0360CE 23:A0BE: E9        .byte $E9
- D - I - 0x0360CF 23:A0BF: D1        .byte $D1    ; <ポ>
- D - I - 0x0360D0 23:A0C0: AA        .byte $AA    ; <だ>
- D - I - 0x0360D1 23:A0C1: FF        .byte $FF
- D - I - 0x0360D2 23:A0C2: DF        .byte $DF
- D - I - 0x0360D3 23:A0C3: E6        .byte $E6
- D - I - 0x0360D4 23:A0C4: E8        .byte $E8
- D - I - 0x0360D5 23:A0C5: EA        .byte $EA
- D - I - 0x0360D6 23:A0C6: DD        .byte $DD
- D - I - 0x0360D7 23:A0C7: C0        .byte $C0    ; <ヅ>
- D - I - 0x0360D8 23:A0C8: DB        .byte $DB
- D - I - 0x0360D9 23:A0C9: 89        .byte $89    ; <I>
- D - I - 0x0360DA 23:A0CA: D2        .byte $D2
- D - I - 0x0360DB 23:A0CB: C8        .byte $C8    ; <ぱ>

off_A0CC_09:
- D - I - 0x0360DC 23:A0CC: FF        .byte $FF
- D - I - 0x0360DD 23:A0CD: 7D        .byte $7D    ; <ー>
- D - I - 0x0360DE 23:A0CE: A2        .byte $A2    ; <ぐ>
- D - I - 0x0360DF 23:A0CF: DF        .byte $DF
- D - I - 0x0360E0 23:A0D0: DD        .byte $DD
- D - I - 0x0360E1 23:A0D1: C5        .byte $C5    ; <ブ>
- D - I - 0x0360E2 23:A0D2: B1        .byte $B1    ; <ぶ>
- D - I - 0x0360E3 23:A0D3: D4        .byte $D4
- D - I - 0x0360E4 23:A0D4: EA        .byte $EA
- D - I - 0x0360E5 23:A0D5: D2        .byte $D2
- D - I - 0x0360E6 23:A0D6: AA        .byte $AA    ; <だ>
- D - I - 0x0360E7 23:A0D7: FF        .byte $FF
- D - I - 0x0360E8 23:A0D8: ED        .byte $ED
- D - I - 0x0360E9 23:A0D9: DC        .byte $DC
- D - I - 0x0360EA 23:A0DA: EB        .byte $EB
- D - I - 0x0360EB 23:A0DB: E9        .byte $E9
- D - I - 0x0360EC 23:A0DC: E0        .byte $E0
- D - I - 0x0360ED 23:A0DD: C3        .byte $C3    ; <バ>
- D - I - 0x0360EE 23:A0DE: DE        .byte $DE
- D - I - 0x0360EF 23:A0DF: 8A        .byte $8A    ; <N>
- D - I - 0x0360F0 23:A0E0: D1        .byte $D1    ; <ポ>
- D - I - 0x0360F1 23:A0E1: CB        .byte $CB    ; <ぺ>

off_A0E2_0A:
- - - - - 0x0360F2 23:A0E2: FF        .byte $FF
- D - I - 0x0360F3 23:A0E3: 19        .byte $19    ; <の>
- D - I - 0x0360F4 23:A0E4: 22        .byte $22    ; <め>
- D - I - 0x0360F5 23:A0E5: 34        .byte $34    ; <1>
- D - I - 0x0360F6 23:A0E6: 37        .byte $37    ; <4>
- D - I - 0x0360F7 23:A0E7: 4A        .byte $4A    ; <コ>
- D - I - 0x0360F8 23:A0E8: 6B        .byte $6B    ; <ロ>
- D - I - 0x0360F9 23:A0E9: 51        .byte $51    ; <チ>
- D - I - 0x0360FA 23:A0EA: 71        .byte $71    ; <ュ>
- D - I - 0x0360FB 23:A0EB: 5A        .byte $5A    ; <ハ>
- D - I - 0x0360FC 23:A0EC: 60        .byte $60    ; <ミ>
- D - I - 0x0360FD 23:A0ED: FF        .byte $FF
- D - I - 0x0360FE 23:A0EE: 9A        .byte $9A
- D - I - 0x0360FF 23:A0EF: 91        .byte $91    ; <V>
- D - I - 0x036100 23:A0F0: 96        .byte $96
- D - I - 0x036101 23:A0F1: A0        .byte $A0    ; <が>
- D - I - 0x036102 23:A0F2: 74        .byte $74    ; <ィ>
- D - I - 0x036103 23:A0F3: 55        .byte $55    ; <ナ>
- D - I - 0x036104 23:A0F4: 6F        .byte $6F    ; <ッ>
- D - I - 0x036105 23:A0F5: 4D        .byte $4D    ; <ス>
- D - I - 0x036106 23:A0F6: 7E        .byte $7E    ; <.>
- D - I - 0x036107 23:A0F7: 5D        .byte $5D    ; <ヘ>



tbl_A0F8:
- - - - - 0x036108 23:A0F8: CD        .byte $CD    ; <パ>
- - - - - 0x036109 23:A0F9: AA        .byte $AA    ; <だ>
- D - - - 0x03610A 23:A0FA: AD        .byte $AD    ; <で>
- D - - - 0x03610B 23:A0FB: B1        .byte $B1    ; <ぶ>
- D - - - 0x03610C 23:A0FC: D6        .byte $D6
- D - - - 0x03610D 23:A0FD: D1        .byte $D1    ; <ポ>
- D - - - 0x03610E 23:A0FE: E4        .byte $E4
- D - - - 0x03610F 23:A0FF: EF        .byte $EF
- D - - - 0x036110 23:A100: E4        .byte $E4
- D - - - 0x036111 23:A101: EF        .byte $EF
- D - - - 0x036112 23:A102: FF        .byte $FF

.export sub_0x036113
sub_0x036113:
C D - - - 0x036113 23:A103: 48        PHA
C - - - - 0x036114 23:A104: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x036117 23:A107: A2 00     LDX #$00
C - - - - 0x036119 23:A109: 86 3D     STX ram_003D
C - - - - 0x03611B 23:A10B: AD 2A 06  LDA $062A
C - - - - 0x03611E 23:A10E: 29 7F     AND #$7F
C - - - - 0x036120 23:A110: A8        TAY
C - - - - 0x036121 23:A111: 68        PLA
C - - - - 0x036122 23:A112: 48        PHA
C - - - - 0x036123 23:A113: C9 0B     CMP #$0B
C - - - - 0x036125 23:A115: 08        PHP
C - - - - 0x036126 23:A116: 90 0A     BCC bra_A122
C - - - - 0x036128 23:A118: E9 0B     SBC #$0B
C - - - - 0x03612A 23:A11A: 48        PHA
C - - - - 0x03612B 23:A11B: B9 DC A1  LDA tbl_A1DC,Y
C - - - - 0x03612E 23:A11E: A8        TAY
C - - - - 0x03612F 23:A11F: E8        INX
C - - - - 0x036130 23:A120: E8        INX
C - - - - 0x036131 23:A121: 68        PLA
bra_A122:
C - - - - 0x036132 23:A122: 48        PHA
C - - - - 0x036133 23:A123: 98        TYA
C - - - - 0x036134 23:A124: 0A        ASL
C - - - - 0x036135 23:A125: 0A        ASL
C - - - - 0x036136 23:A126: 85 3C     STA ram_003C
C - - - - 0x036138 23:A128: 0A        ASL
C - - - - 0x036139 23:A129: 0A        ASL
C - - - - 0x03613A 23:A12A: 65 3C     ADC ram_003C
C - - - - 0x03613C 23:A12C: 85 3C     STA ram_003C
C - - - - 0x03613E 23:A12E: 26 3D     ROL ram_003D
C - - - - 0x036140 23:A130: 68        PLA
C - - - - 0x036141 23:A131: 38        SEC
C - - - - 0x036142 23:A132: E9 01     SBC #$01
C - - - - 0x036144 23:A134: 4E E2 00  LSR ram_рандом_2
C - - - - 0x036147 23:A137: 2A        ROL
C - - - - 0x036148 23:A138: 85 3E     STA ram_003E
C - - - - 0x03614A 23:A13A: 28        PLP
C - - - - 0x03614B 23:A13B: 08        PHP
C - - - - 0x03614C 23:A13C: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x03614F 23:A13F: F0 06     BEQ bra_A147
C - - - - 0x036151 23:A141: 08        PHP
C - - - - 0x036152 23:A142: 68        PLA
C - - - - 0x036153 23:A143: 49 01     EOR #$01
C - - - - 0x036155 23:A145: 48        PHA
C - - - - 0x036156 23:A146: 28        PLP
bra_A147:
C - - - - 0x036157 23:A147: B0 13     BCS bra_A15C
C - - - - 0x036159 23:A149: A9 25     LDA #$25
C - - - - 0x03615B 23:A14B: 85 3F     STA ram_003F
C - - - - 0x03615D 23:A14D: BD 2C 00  LDA ram_расстановка_слева,X
C - - - - 0x036160 23:A150: 0A        ASL
C - - - - 0x036161 23:A151: AA        TAX
C - - - - 0x036162 23:A152: BD AE A6  LDA tbl_A6AD + 1,X
C - - - - 0x036165 23:A155: A8        TAY
C - - - - 0x036166 23:A156: BD AD A6  LDA tbl_A6AD,X
C - - - - 0x036169 23:A159: 4C 79 A1  JMP loc_A179
bra_A15C:
C - - - - 0x03616C 23:A15C: A9 26     LDA #$26
C - - - - 0x03616E 23:A15E: 85 3F     STA ram_003F
C - - - - 0x036170 23:A160: BD 2C 00  LDA ram_расстановка_слева,X
C - - - - 0x036173 23:A163: 0A        ASL
C - - - - 0x036174 23:A164: 85 3A     STA ram_003A
C - - - - 0x036176 23:A166: 0A        ASL
C - - - - 0x036177 23:A167: 65 3A     ADC ram_003A
C - - - - 0x036179 23:A169: 85 3A     STA ram_003A
C - - - - 0x03617B 23:A16B: BD 2D 00  LDA ram_защита_слева,X
C - - - - 0x03617E 23:A16E: 0A        ASL
C - - - - 0x03617F 23:A16F: 65 3A     ADC ram_003A
C - - - - 0x036181 23:A171: AA        TAX
C - - - - 0x036182 23:A172: BD 66 AB  LDA tbl_AB65 + 1,X
C - - - - 0x036185 23:A175: A8        TAY
C - - - - 0x036186 23:A176: BD 65 AB  LDA tbl_AB65,X
loc_A179:
C D - - - 0x036189 23:A179: 18        CLC
C - - - - 0x03618A 23:A17A: 65 3C     ADC ram_003C
C - - - - 0x03618C 23:A17C: 85 3A     STA ram_003A
C - - - - 0x03618E 23:A17E: 98        TYA
C - - - - 0x03618F 23:A17F: 65 3D     ADC ram_003D
C - - - - 0x036191 23:A181: 85 3B     STA ram_003B
C - - - - 0x036193 23:A183: A4 3E     LDY ram_003E
C - - - - 0x036195 23:A185: B1 3A     LDA (ram_003A),Y
C - - - - 0x036197 23:A187: 28        PLP
C - - - - 0x036198 23:A188: 90 14     BCC bra_A19E
C - - - - 0x03619A 23:A18A: C9 F0     CMP #$F0
C - - - - 0x03619C 23:A18C: F0 10     BEQ bra_A19E
C - - - - 0x03619E 23:A18E: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x0361A1 23:A191: 8A        TXA
C - - - - 0x0361A2 23:A192: 49 FF     EOR #$FF
C - - - - 0x0361A4 23:A194: AA        TAX
C - - - - 0x0361A5 23:A195: 98        TYA
C - - - - 0x0361A6 23:A196: 49 FF     EOR #$FF
C - - - - 0x0361A8 23:A198: A8        TAY
C - - - - 0x0361A9 23:A199: E8        INX
C - - - - 0x0361AA 23:A19A: C8        INY
C - - - - 0x0361AB 23:A19B: 20 39 C5  JSR sub_0x03CDF2
bra_A19E:
C - - - - 0x0361AE 23:A19E: A0 09     LDY #con_игрок_09
C - - - - 0x0361B0 23:A1A0: 91 34     STA (ram_plr_data),Y
C - - - - 0x0361B2 23:A1A2: 68        PLA
C - - - - 0x0361B3 23:A1A3: 48        PHA
C - - - - 0x0361B4 23:A1A4: A6 3F     LDX ram_003F
C - - - - 0x0361B6 23:A1A6: 20 27 C5  JSR sub_0x03CE18_банксвич_PRG_06_07_с_возвратом
C - - - - 0x0361B9 23:A1A9: 68        PLA
C - - - - 0x0361BA 23:A1AA: A6 32     LDX ram_0032
C - - - - 0x0361BC 23:A1AC: EC E2 00  CPX ram_рандом_2
C - - - - 0x0361BF 23:A1AF: B0 01     BCS bra_A1B2
C - - - - 0x0361C1 23:A1B1: 60        RTS
bra_A1B2:
C - - - - 0x0361C2 23:A1B2: A6 3F     LDX ram_003F
C - - - - 0x0361C4 23:A1B4: E0 25     CPX #$25
C - - - - 0x0361C6 23:A1B6: F0 04     BEQ bra_A1BC
C - - - - 0x0361C8 23:A1B8: A9 F0     LDA #$F0
C - - - - 0x0361CA 23:A1BA: D0 1B     BNE bra_A1D7
bra_A1BC:
C - - - - 0x0361CC 23:A1BC: C9 0B     CMP #$0B
C - - - - 0x0361CE 23:A1BE: 90 02     BCC bra_A1C2
C - - - - 0x0361D0 23:A1C0: E9 0B     SBC #$0B
bra_A1C2:
C - - - - 0x0361D2 23:A1C2: C9 05     CMP #$05
C - - - - 0x0361D4 23:A1C4: B0 15     BCS bra_A1DB_выход
C - - - - 0x0361D6 23:A1C6: A2 C8     LDX #$C8
C - - - - 0x0361D8 23:A1C8: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0361DB 23:A1CB: F0 02     BEQ bra_A1CF
C - - - - 0x0361DD 23:A1CD: A2 38     LDX #$38
bra_A1CF:
C - - - - 0x0361DF 23:A1CF: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x0361E1 23:A1D1: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0361E3 23:A1D3: A8        TAY
C - - - - 0x0361E4 23:A1D4: 20 39 C5  JSR sub_0x03CDF2
bra_A1D7:
C - - - - 0x0361E7 23:A1D7: A0 09     LDY #con_игрок_09
C - - - - 0x0361E9 23:A1D9: 91 34     STA (ram_plr_data),Y
bra_A1DB_выход:
C - - - - 0x0361EB 23:A1DB: 60        RTS

tbl_A1DC:
- D - - - 0x0361EC 23:A1DC: 0E        .byte $0E    ; <せ>
- D - - - 0x0361ED 23:A1DD: 0D        .byte $0D    ; <す>
- D - - - 0x0361EE 23:A1DE: 0C        .byte $0C    ; <し>
- D - - - 0x0361EF 23:A1DF: 0B        .byte $0B    ; <さ>
- D - - - 0x0361F0 23:A1E0: 0A        .byte $0A    ; <こ>
- D - - - 0x0361F1 23:A1E1: 09        .byte $09    ; <け>
- D - - - 0x0361F2 23:A1E2: 08        .byte $08    ; <く>
- D - - - 0x0361F3 23:A1E3: 07        .byte $07    ; <き>
- D - - - 0x0361F4 23:A1E4: 06        .byte $06    ; <か>
- D - - - 0x0361F5 23:A1E5: 05        .byte $05    ; <お>
- D - - - 0x0361F6 23:A1E6: 04        .byte $04    ; <え>
- D - - - 0x0361F7 23:A1E7: 03        .byte $03    ; <う>
- D - - - 0x0361F8 23:A1E8: 02        .byte $02    ; <い>
- D - - - 0x0361F9 23:A1E9: 01        .byte $01    ; <あ>
- D - - - 0x0361FA 23:A1EA: 00        .byte $00

.export sub_0x0361FB_отрисовка_чарли_на_фоне
sub_0x0361FB_отрисовка_чарли_на_фоне:
C D - - - 0x0361FB 23:A1EB: AD F4 05  LDA $05F4
C - - - - 0x0361FE 23:A1EE: D0 01     BNE bra_A1F1
C - - - - 0x036200 23:A1F0: 60        RTS
bra_A1F1:
C - - - - 0x036201 23:A1F1: 10 19     BPL bra_A20C
C - - - - 0x036203 23:A1F3: A9 01     LDA #$01
C - - - - 0x036205 23:A1F5: 8D F4 05  STA $05F4
C - - - - 0x036208 23:A1F8: AD F3 05  LDA $05F3
C - - - - 0x03620B 23:A1FB: 0A        ASL
C - - - - 0x03620C 23:A1FC: AA        TAX
C - - - - 0x03620D 23:A1FD: BD 92 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли,X
C - - - - 0x036210 23:A200: 85 63     STA ram_0063
C - - - - 0x036212 23:A202: BD 93 A2  LDA tbl_A292_номера_ppu_байтов_для_анимаций_чарли + 1,X
C - - - - 0x036215 23:A205: 85 64     STA ram_0064
C - - - - 0x036217 23:A207: A9 00     LDA #$00
C - - - - 0x036219 23:A209: 8D F5 05  STA $05F5
bra_A20C:
C - - - - 0x03621C 23:A20C: AD F5 05  LDA $05F5
C - - - - 0x03621F 23:A20F: F0 04     BEQ bra_A215_ожидание_освобождения_буфера
C - - - - 0x036221 23:A211: CE F5 05  DEC $05F5
C - - - - 0x036224 23:A214: 60        RTS
bra_A215_ожидание_освобождения_буфера:
C - - - - 0x036225 23:A215: A9 01     LDA #$01
C - - - - 0x036227 23:A217: 20 15 C5  JSR sub_0x03CB1F
C - - - - 0x03622A 23:A21A: AD 15 05  LDA $0515
C - - - - 0x03622D 23:A21D: D0 F6     BNE bra_A215_ожидание_освобождения_буфера
C - - - - 0x03622F 23:A21F: A9 01     LDA #$01
C - - - - 0x036231 23:A221: 8D 15 05  STA $0515
bra_A224_цикл:
loc_A224_цикл:
C D - - - 0x036234 23:A224: A0 00     LDY #$00
C - - - - 0x036236 23:A226: B1 63     LDA (ram_0063),Y
C - - - - 0x036238 23:A228: C9 FF     CMP #$FF
C - - - - 0x03623A 23:A22A: D0 16     BNE bra_A242_байты_еще_есть       ; иначе повторить цикл
C - - - - 0x03623C 23:A22C: C8        INY
C - - - - 0x03623D 23:A22D: B1 63     LDA (ram_0063),Y
C - - - - 0x03623F 23:A22F: AA        TAX
C - - - - 0x036240 23:A230: C8        INY
C - - - - 0x036241 23:A231: B1 63     LDA (ram_0063),Y
C - - - - 0x036243 23:A233: 85 64     STA ram_0064
C - - - - 0x036245 23:A235: 86 63     STX ram_0063
C - - - - 0x036247 23:A237: AD E3 05  LDA $05E3
C - - - - 0x03624A 23:A23A: D0 E8     BNE bra_A224_цикл
C - - - - 0x03624C 23:A23C: 8D F4 05  STA $05F4
C - - - - 0x03624F 23:A23F: 4C 24 A2  JMP loc_A224_цикл
bra_A242_байты_еще_есть:
C - - - - 0x036252 23:A242: 8D F5 05  STA $05F5
C - - - - 0x036255 23:A245: C8        INY
C - - - - 0x036256 23:A246: B1 63     LDA (ram_0063),Y
C - - - - 0x036258 23:A248: 0A        ASL
C - - - - 0x036259 23:A249: AA        TAX
C - - - - 0x03625A 23:A24A: BD 2A A4  LDA tbl_A42A_ppu_байты_анимаций_чарли,X
C - - - - 0x03625D 23:A24D: 85 3A     STA ram_003A
C - - - - 0x03625F 23:A24F: BD 2B A4  LDA tbl_A42A_ppu_байты_анимаций_чарли + 1,X
C - - - - 0x036262 23:A252: 85 3B     STA ram_003B
C - - - - 0x036264 23:A254: A0 00     LDY #$00
C - - - - 0x036266 23:A256: A2 00     LDX #$00
bra_A258_цикл:
C - - - - 0x036268 23:A258: B1 3A     LDA (ram_003A),Y
C - - - - 0x03626A 23:A25A: F0 22     BEQ bra_A27E_закончить_чтение_атрибутов
C - - - - 0x03626C 23:A25C: 9D A5 04  STA $04A5,X
C - - - - 0x03626F 23:A25F: 85 3C     STA ram_003C
C - - - - 0x036271 23:A261: C8        INY
C - - - - 0x036272 23:A262: B1 3A     LDA (ram_003A),Y
C - - - - 0x036274 23:A264: 9D A6 04  STA $04A6,X
C - - - - 0x036277 23:A267: C8        INY
C - - - - 0x036278 23:A268: B1 3A     LDA (ram_003A),Y
C - - - - 0x03627A 23:A26A: 9D A7 04  STA $04A7,X
C - - - - 0x03627D 23:A26D: C8        INY
C - - - - 0x03627E 23:A26E: E8        INX
C - - - - 0x03627F 23:A26F: E8        INX
C - - - - 0x036280 23:A270: E8        INX
bra_A271_цикл:
C - - - - 0x036281 23:A271: B1 3A     LDA (ram_003A),Y
C - - - - 0x036283 23:A273: 9D A5 04  STA $04A5,X
C - - - - 0x036286 23:A276: E8        INX
C - - - - 0x036287 23:A277: C8        INY
C - - - - 0x036288 23:A278: C6 3C     DEC ram_003C
C - - - - 0x03628A 23:A27A: D0 F5     BNE bra_A271_цикл
C - - - - 0x03628C 23:A27C: F0 DA     BEQ bra_A258_цикл
bra_A27E_закончить_чтение_атрибутов:
C - - - - 0x03628E 23:A27E: 9D A5 04  STA $04A5,X
C - - - - 0x036291 23:A281: A9 80     LDA #$80
C - - - - 0x036293 23:A283: 8D 15 05  STA $0515
C - - - - 0x036296 23:A286: A5 63     LDA ram_0063
C - - - - 0x036298 23:A288: 18        CLC
C - - - - 0x036299 23:A289: 69 02     ADC #$02
C - - - - 0x03629B 23:A28B: 85 63     STA ram_0063
C - - - - 0x03629D 23:A28D: 90 02     BCC bra_A291_выход
C - - - - 0x03629F 23:A28F: E6 64     INC ram_0064
bra_A291_выход:
C - - - - 0x0362A1 23:A291: 60        RTS



tbl_A292_номера_ppu_байтов_для_анимаций_чарли:
- D - - - 0x0362A2 23:A292: AE A2     .word off_A2AE_00
- D - - - 0x0362A4 23:A294: CB A2     .word off_A2CB_01
- D - - - 0x0362A6 23:A296: E8 A2     .word off_A2E8_02
- D - - - 0x0362A8 23:A298: FD A2     .word off_A2FD_03
- D - - - 0x0362AA 23:A29A: 1A A3     .word off_A31A_04
- D - - - 0x0362AC 23:A29C: 3F A3     .word off_A33F_05
- D - - - 0x0362AE 23:A29E: 5E A3     .word off_A35E_06
- D - - - 0x0362B0 23:A2A0: 6B A3     .word off_A36B_07
- D - - - 0x0362B2 23:A2A2: 72 A3     .word off_A372_08
- D - - - 0x0362B4 23:A2A4: 77 A3     .word off_A377_09
- D - - - 0x0362B6 23:A2A6: 92 A3     .word off_A392_0A
- D - - - 0x0362B8 23:A2A8: CB A3     .word off_A3CB_0B
- D - - - 0x0362BA 23:A2AA: F4 A3     .word off_A3F4_0C
- D - - - 0x0362BC 23:A2AC: 25 A4     .word off_A425_0D

    con_loop = $FF

off_A2AE_00:
- D - I - 0x0362BE 23:A2AE: 05        .byte $05    ; <お>
- D - I - 0x0362BF 23:A2AF: 00        .byte $00
- D - I - 0x0362C0 23:A2B0: 05        .byte $05    ; <お>
- D - I - 0x0362C1 23:A2B1: 01        .byte $01    ; <あ>
- D - I - 0x0362C2 23:A2B2: 05        .byte $05    ; <お>
- D - I - 0x0362C3 23:A2B3: 02        .byte $02    ; <い>
- D - I - 0x0362C4 23:A2B4: 05        .byte $05    ; <お>
- D - I - 0x0362C5 23:A2B5: 01        .byte $01    ; <あ>
- D - I - 0x0362C6 23:A2B6: 05        .byte $05    ; <お>
- D - I - 0x0362C7 23:A2B7: 02        .byte $02    ; <い>
- D - I - 0x0362C8 23:A2B8: 05        .byte $05    ; <お>
- D - I - 0x0362C9 23:A2B9: 03        .byte $03    ; <う>
- D - I - 0x0362CA 23:A2BA: 05        .byte $05    ; <お>
- D - I - 0x0362CB 23:A2BB: 02        .byte $02    ; <い>
- D - I - 0x0362CC 23:A2BC: 05        .byte $05    ; <お>
- D - I - 0x0362CD 23:A2BD: 01        .byte $01    ; <あ>
- D - I - 0x0362CE 23:A2BE: 05        .byte $05    ; <お>
- D - I - 0x0362CF 23:A2BF: 02        .byte $02    ; <い>
- D - I - 0x0362D0 23:A2C0: 05        .byte $05    ; <お>
- D - I - 0x0362D1 23:A2C1: 03        .byte $03    ; <う>
- D - I - 0x0362D2 23:A2C2: 05        .byte $05    ; <お>
- D - I - 0x0362D3 23:A2C3: 02        .byte $02    ; <い>
- D - I - 0x0362D4 23:A2C4: 05        .byte $05    ; <お>
- D - I - 0x0362D5 23:A2C5: 01        .byte $01    ; <あ>
- D - I - 0x0362D6 23:A2C6: 05        .byte $05    ; <お>
- D - I - 0x0362D7 23:A2C7: 00        .byte $00
- D - I - 0x0362D8 23:A2C8: FF        .byte con_loop
- D - I - 0x0362D9 23:A2C9: AE A2     .word off_A2AE_00

off_A2CB_01:
- D - I - 0x0362DB 23:A2CB: 05        .byte $05    ; <お>
- D - I - 0x0362DC 23:A2CC: 04        .byte $04    ; <え>
- D - I - 0x0362DD 23:A2CD: 05        .byte $05    ; <お>
- D - I - 0x0362DE 23:A2CE: 01        .byte $01    ; <あ>
- D - I - 0x0362DF 23:A2CF: 05        .byte $05    ; <お>
- D - I - 0x0362E0 23:A2D0: 02        .byte $02    ; <い>
- D - I - 0x0362E1 23:A2D1: 05        .byte $05    ; <お>
- D - I - 0x0362E2 23:A2D2: 01        .byte $01    ; <あ>
- D - I - 0x0362E3 23:A2D3: 05        .byte $05    ; <お>
- D - I - 0x0362E4 23:A2D4: 02        .byte $02    ; <い>
- D - I - 0x0362E5 23:A2D5: 05        .byte $05    ; <お>
- D - I - 0x0362E6 23:A2D6: 03        .byte $03    ; <う>
- D - I - 0x0362E7 23:A2D7: 05        .byte $05    ; <お>
- D - I - 0x0362E8 23:A2D8: 02        .byte $02    ; <い>
- D - I - 0x0362E9 23:A2D9: 05        .byte $05    ; <お>
- D - I - 0x0362EA 23:A2DA: 01        .byte $01    ; <あ>
- D - I - 0x0362EB 23:A2DB: 05        .byte $05    ; <お>
- D - I - 0x0362EC 23:A2DC: 02        .byte $02    ; <い>
- D - I - 0x0362ED 23:A2DD: 05        .byte $05    ; <お>
- D - I - 0x0362EE 23:A2DE: 03        .byte $03    ; <う>
- D - I - 0x0362EF 23:A2DF: 05        .byte $05    ; <お>
- D - I - 0x0362F0 23:A2E0: 02        .byte $02    ; <い>
- D - I - 0x0362F1 23:A2E1: 05        .byte $05    ; <お>
- D - I - 0x0362F2 23:A2E2: 01        .byte $01    ; <あ>
- D - I - 0x0362F3 23:A2E3: 05        .byte $05    ; <お>
- D - I - 0x0362F4 23:A2E4: 04        .byte $04    ; <え>
- D - I - 0x0362F5 23:A2E5: FF        .byte con_loop
- D - I - 0x0362F6 23:A2E6: CB A2     .word off_A2CB_01

off_A2E8_02:
- D - I - 0x0362F8 23:A2E8: 04        .byte $04    ; <え>
- D - I - 0x0362F9 23:A2E9: 05        .byte $05    ; <お>
- D - I - 0x0362FA 23:A2EA: 04        .byte $04    ; <え>
- D - I - 0x0362FB 23:A2EB: 06        .byte $06    ; <か>
- D - I - 0x0362FC 23:A2EC: 04        .byte $04    ; <え>
- D - I - 0x0362FD 23:A2ED: 07        .byte $07    ; <き>
- D - I - 0x0362FE 23:A2EE: 04        .byte $04    ; <え>
- D - I - 0x0362FF 23:A2EF: 06        .byte $06    ; <か>
- D - I - 0x036300 23:A2F0: 04        .byte $04    ; <え>
- D - I - 0x036301 23:A2F1: 07        .byte $07    ; <き>
- D - I - 0x036302 23:A2F2: 04        .byte $04    ; <え>
- D - I - 0x036303 23:A2F3: 06        .byte $06    ; <か>
- D - I - 0x036304 23:A2F4: 04        .byte $04    ; <え>
- D - I - 0x036305 23:A2F5: 07        .byte $07    ; <き>
- D - I - 0x036306 23:A2F6: 04        .byte $04    ; <え>
- D - I - 0x036307 23:A2F7: 06        .byte $06    ; <か>
- D - I - 0x036308 23:A2F8: 04        .byte $04    ; <え>
- D - I - 0x036309 23:A2F9: 05        .byte $05    ; <お>
- D - I - 0x03630A 23:A2FA: FF        .byte con_loop
- D - I - 0x03630B 23:A2FB: E8 A2     .word off_A2E8_02

off_A2FD_03:
- D - I - 0x03630D 23:A2FD: 05        .byte $05    ; <お>
- D - I - 0x03630E 23:A2FE: 08        .byte $08    ; <く>
- D - I - 0x03630F 23:A2FF: 05        .byte $05    ; <お>
- D - I - 0x036310 23:A300: 09        .byte $09    ; <け>
- D - I - 0x036311 23:A301: 05        .byte $05    ; <お>
- D - I - 0x036312 23:A302: 0A        .byte $0A    ; <こ>
- D - I - 0x036313 23:A303: 05        .byte $05    ; <お>
- D - I - 0x036314 23:A304: 09        .byte $09    ; <け>
- D - I - 0x036315 23:A305: 05        .byte $05    ; <お>
- D - I - 0x036316 23:A306: 0A        .byte $0A    ; <こ>
- D - I - 0x036317 23:A307: 05        .byte $05    ; <お>
- D - I - 0x036318 23:A308: 09        .byte $09    ; <け>
- D - I - 0x036319 23:A309: 05        .byte $05    ; <お>
- D - I - 0x03631A 23:A30A: 08        .byte $08    ; <く>
- D - I - 0x03631B 23:A30B: 05        .byte $05    ; <お>
- D - I - 0x03631C 23:A30C: 09        .byte $09    ; <け>
- D - I - 0x03631D 23:A30D: 05        .byte $05    ; <お>
- D - I - 0x03631E 23:A30E: 0A        .byte $0A    ; <こ>
- D - I - 0x03631F 23:A30F: 05        .byte $05    ; <お>
- D - I - 0x036320 23:A310: 09        .byte $09    ; <け>
- D - I - 0x036321 23:A311: 05        .byte $05    ; <お>
- D - I - 0x036322 23:A312: 0A        .byte $0A    ; <こ>
- D - I - 0x036323 23:A313: 05        .byte $05    ; <お>
- D - I - 0x036324 23:A314: 09        .byte $09    ; <け>
- D - I - 0x036325 23:A315: 05        .byte $05    ; <お>
- D - I - 0x036326 23:A316: 08        .byte $08    ; <く>
- D - I - 0x036327 23:A317: FF        .byte con_loop
- D - I - 0x036328 23:A318: FD A2     .word off_A2FD_03

off_A31A_04:
- D - I - 0x03632A 23:A31A: 08        .byte $08    ; <く>
- D - I - 0x03632B 23:A31B: 0B        .byte $0B    ; <さ>
- D - I - 0x03632C 23:A31C: 04        .byte $04    ; <え>
- D - I - 0x03632D 23:A31D: 02        .byte $02    ; <い>
- D - I - 0x03632E 23:A31E: 04        .byte $04    ; <え>
- D - I - 0x03632F 23:A31F: 03        .byte $03    ; <う>
- D - I - 0x036330 23:A320: 04        .byte $04    ; <え>
- D - I - 0x036331 23:A321: 02        .byte $02    ; <い>
- D - I - 0x036332 23:A322: 04        .byte $04    ; <え>
- D - I - 0x036333 23:A323: 03        .byte $03    ; <う>
- D - I - 0x036334 23:A324: 04        .byte $04    ; <え>
- D - I - 0x036335 23:A325: 02        .byte $02    ; <い>
- D - I - 0x036336 23:A326: 04        .byte $04    ; <え>
- D - I - 0x036337 23:A327: 03        .byte $03    ; <う>
- D - I - 0x036338 23:A328: 08        .byte $08    ; <く>
- D - I - 0x036339 23:A329: 0C        .byte $0C    ; <し>
- D - I - 0x03633A 23:A32A: 04        .byte $04    ; <え>
- D - I - 0x03633B 23:A32B: 02        .byte $02    ; <い>
- D - I - 0x03633C 23:A32C: 04        .byte $04    ; <え>
- D - I - 0x03633D 23:A32D: 03        .byte $03    ; <う>
- D - I - 0x03633E 23:A32E: 04        .byte $04    ; <え>
- D - I - 0x03633F 23:A32F: 02        .byte $02    ; <い>
- D - I - 0x036340 23:A330: 04        .byte $04    ; <え>
- D - I - 0x036341 23:A331: 0B        .byte $0B    ; <さ>
- D - I - 0x036342 23:A332: 04        .byte $04    ; <え>
- D - I - 0x036343 23:A333: 02        .byte $02    ; <い>
- D - I - 0x036344 23:A334: 08        .byte $08    ; <く>
- D - I - 0x036345 23:A335: 0C        .byte $0C    ; <し>
- D - I - 0x036346 23:A336: 04        .byte $04    ; <え>
- D - I - 0x036347 23:A337: 02        .byte $02    ; <い>
- D - I - 0x036348 23:A338: 04        .byte $04    ; <え>
- D - I - 0x036349 23:A339: 03        .byte $03    ; <う>
- D - I - 0x03634A 23:A33A: 04        .byte $04    ; <え>
- D - I - 0x03634B 23:A33B: 02        .byte $02    ; <い>
- D - I - 0x03634C 23:A33C: FF        .byte con_loop
- D - I - 0x03634D 23:A33D: 1A A3     .word off_A31A_04

off_A33F_05:
- D - I - 0x03634F 23:A33F: 05        .byte $05    ; <お>
- D - I - 0x036350 23:A340: 0F        .byte $0F    ; <そ>
- D - I - 0x036351 23:A341: 05        .byte $05    ; <お>
- D - I - 0x036352 23:A342: 10        .byte $10    ; <た>
- D - I - 0x036353 23:A343: 05        .byte $05    ; <お>
- D - I - 0x036354 23:A344: 11        .byte $11    ; <ち>
- D - I - 0x036355 23:A345: 05        .byte $05    ; <お>
- D - I - 0x036356 23:A346: 10        .byte $10    ; <た>
- D - I - 0x036357 23:A347: 05        .byte $05    ; <お>
- D - I - 0x036358 23:A348: 11        .byte $11    ; <ち>
- D - I - 0x036359 23:A349: 05        .byte $05    ; <お>
- D - I - 0x03635A 23:A34A: 10        .byte $10    ; <た>
- D - I - 0x03635B 23:A34B: 05        .byte $05    ; <お>
- D - I - 0x03635C 23:A34C: 0F        .byte $0F    ; <そ>
- D - I - 0x03635D 23:A34D: 05        .byte $05    ; <お>
- D - I - 0x03635E 23:A34E: 10        .byte $10    ; <た>
- D - I - 0x03635F 23:A34F: 05        .byte $05    ; <お>
- D - I - 0x036360 23:A350: 11        .byte $11    ; <ち>
- D - I - 0x036361 23:A351: 05        .byte $05    ; <お>
- D - I - 0x036362 23:A352: 10        .byte $10    ; <た>
- D - I - 0x036363 23:A353: 05        .byte $05    ; <お>
- D - I - 0x036364 23:A354: 11        .byte $11    ; <ち>
- D - I - 0x036365 23:A355: 05        .byte $05    ; <お>
- D - I - 0x036366 23:A356: 10        .byte $10    ; <た>
- D - I - 0x036367 23:A357: 05        .byte $05    ; <お>
- D - I - 0x036368 23:A358: 11        .byte $11    ; <ち>
- D - I - 0x036369 23:A359: 05        .byte $05    ; <お>
- D - I - 0x03636A 23:A35A: 10        .byte $10    ; <た>
- D - I - 0x03636B 23:A35B: FF        .byte con_loop
- D - I - 0x03636C 23:A35C: 3F A3     .word off_A33F_05

off_A35E_06:
- D - I - 0x03636E 23:A35E: 0A        .byte $0A    ; <こ>
- D - I - 0x03636F 23:A35F: 05        .byte $05    ; <お>
- D - I - 0x036370 23:A360: 0A        .byte $0A    ; <こ>
- D - I - 0x036371 23:A361: 06        .byte $06    ; <か>
- D - I - 0x036372 23:A362: 0F        .byte $0F    ; <そ>
- D - I - 0x036373 23:A363: 07        .byte $07    ; <き>
off_A364:
- D - I - 0x036374 23:A364: 05        .byte $05    ; <お>
- D - I - 0x036375 23:A365: 12        .byte $12    ; <つ>
- D - I - 0x036376 23:A366: 05        .byte $05    ; <お>
- D - I - 0x036377 23:A367: 13        .byte $13    ; <て>
- D - I - 0x036378 23:A368: FF        .byte con_loop
- D - I - 0x036379 23:A369: 64 A3     .word off_A364

off_A36B_07:
- D - I - 0x03637B 23:A36B: 08        .byte $08    ; <く>
- D - I - 0x03637C 23:A36C: 14        .byte $14    ; <と>
- D - I - 0x03637D 23:A36D: 08        .byte $08    ; <く>
- D - I - 0x03637E 23:A36E: 15        .byte $15    ; <な>
- D - I - 0x03637F 23:A36F: FF        .byte con_loop
- D - I - 0x036380 23:A370: 6B A3     .word off_A36B_07

off_A372_08:
- D - I - 0x036382 23:A372: 80        .byte $80
- D - I - 0x036383 23:A373: 00        .byte $00
- D - I - 0x036384 23:A374: FF        .byte con_loop
- D - I - 0x036385 23:A375: 72 A3     .word off_A372_08

off_A377_09:
- D - I - 0x036387 23:A377: 03        .byte $03    ; <う>
- D - I - 0x036388 23:A378: 16        .byte $16    ; <に>
- D - I - 0x036389 23:A379: 03        .byte $03    ; <う>
- D - I - 0x03638A 23:A37A: 17        .byte $17    ; <ぬ>
- D - I - 0x03638B 23:A37B: 03        .byte $03    ; <う>
- D - I - 0x03638C 23:A37C: 19        .byte $19    ; <の>
- D - I - 0x03638D 23:A37D: 03        .byte $03    ; <う>
- D - I - 0x03638E 23:A37E: 18        .byte $18    ; <ね>
- D - I - 0x03638F 23:A37F: 05        .byte $05    ; <お>
- D - I - 0x036390 23:A380: 16        .byte $16    ; <に>
- D - I - 0x036391 23:A381: 05        .byte $05    ; <お>
- D - I - 0x036392 23:A382: 17        .byte $17    ; <ぬ>
- D - I - 0x036393 23:A383: 05        .byte $05    ; <お>
- D - I - 0x036394 23:A384: 19        .byte $19    ; <の>
- D - I - 0x036395 23:A385: 05        .byte $05    ; <お>
- D - I - 0x036396 23:A386: 18        .byte $18    ; <ね>
- D - I - 0x036397 23:A387: 03        .byte $03    ; <う>
- D - I - 0x036398 23:A388: 16        .byte $16    ; <に>
- D - I - 0x036399 23:A389: 03        .byte $03    ; <う>
- D - I - 0x03639A 23:A38A: 17        .byte $17    ; <ぬ>
- D - I - 0x03639B 23:A38B: 03        .byte $03    ; <う>
- D - I - 0x03639C 23:A38C: 19        .byte $19    ; <の>
- D - I - 0x03639D 23:A38D: 03        .byte $03    ; <う>
- D - I - 0x03639E 23:A38E: 18        .byte $18    ; <ね>
- D - I - 0x03639F 23:A38F: FF        .byte con_loop
- D - I - 0x0363A0 23:A390: 77 A3     .word off_A377_09

off_A392_0A:
- D - I - 0x0363A2 23:A392: 07        .byte $07    ; <き>
- D - I - 0x0363A3 23:A393: 1A        .byte $1A    ; <は>
- D - I - 0x0363A4 23:A394: 05        .byte $05    ; <お>
- D - I - 0x0363A5 23:A395: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363A6 23:A396: 05        .byte $05    ; <お>
- D - I - 0x0363A7 23:A397: 1A        .byte $1A    ; <は>
- D - I - 0x0363A8 23:A398: 05        .byte $05    ; <お>
- D - I - 0x0363A9 23:A399: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363AA 23:A39A: 05        .byte $05    ; <お>
- D - I - 0x0363AB 23:A39B: 1A        .byte $1A    ; <は>
- D - I - 0x0363AC 23:A39C: 05        .byte $05    ; <お>
- D - I - 0x0363AD 23:A39D: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363AE 23:A39E: 05        .byte $05    ; <お>
- D - I - 0x0363AF 23:A39F: 1A        .byte $1A    ; <は>
- D - I - 0x0363B0 23:A3A0: 05        .byte $05    ; <お>
- D - I - 0x0363B1 23:A3A1: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363B2 23:A3A2: 05        .byte $05    ; <お>
- D - I - 0x0363B3 23:A3A3: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363B4 23:A3A4: 05        .byte $05    ; <お>
- D - I - 0x0363B5 23:A3A5: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363B6 23:A3A6: 05        .byte $05    ; <お>
- D - I - 0x0363B7 23:A3A7: 1A        .byte $1A    ; <は>
- D - I - 0x0363B8 23:A3A8: 07        .byte $07    ; <き>
- D - I - 0x0363B9 23:A3A9: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363BA 23:A3AA: 07        .byte $07    ; <き>
- D - I - 0x0363BB 23:A3AB: 1A        .byte $1A    ; <は>
- D - I - 0x0363BC 23:A3AC: 07        .byte $07    ; <き>
- D - I - 0x0363BD 23:A3AD: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363BE 23:A3AE: 07        .byte $07    ; <き>
- D - I - 0x0363BF 23:A3AF: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363C0 23:A3B0: 07        .byte $07    ; <き>
- D - I - 0x0363C1 23:A3B1: 1D        .byte $1D    ; <へ>
- D - I - 0x0363C2 23:A3B2: 07        .byte $07    ; <き>
- D - I - 0x0363C3 23:A3B3: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363C4 23:A3B4: 07        .byte $07    ; <き>
- D - I - 0x0363C5 23:A3B5: 1D        .byte $1D    ; <へ>
- D - I - 0x0363C6 23:A3B6: 07        .byte $07    ; <き>
- D - I - 0x0363C7 23:A3B7: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363C8 23:A3B8: 07        .byte $07    ; <き>
- D - I - 0x0363C9 23:A3B9: 1D        .byte $1D    ; <へ>
- D - I - 0x0363CA 23:A3BA: 05        .byte $05    ; <お>
- D - I - 0x0363CB 23:A3BB: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363CC 23:A3BC: 07        .byte $07    ; <き>
- D - I - 0x0363CD 23:A3BD: 1D        .byte $1D    ; <へ>
- D - I - 0x0363CE 23:A3BE: 05        .byte $05    ; <お>
- D - I - 0x0363CF 23:A3BF: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363D0 23:A3C0: 07        .byte $07    ; <き>
- D - I - 0x0363D1 23:A3C1: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363D2 23:A3C2: 07        .byte $07    ; <き>
- D - I - 0x0363D3 23:A3C3: 1D        .byte $1D    ; <へ>
- D - I - 0x0363D4 23:A3C4: 07        .byte $07    ; <き>
- D - I - 0x0363D5 23:A3C5: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363D6 23:A3C6: 07        .byte $07    ; <き>
- D - I - 0x0363D7 23:A3C7: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363D8 23:A3C8: FF        .byte con_loop
- D - I - 0x0363D9 23:A3C9: 92 A3     .word off_A392_0A

off_A3CB_0B:
- D - I - 0x0363DB 23:A3CB: 07        .byte $07    ; <き>
- D - I - 0x0363DC 23:A3CC: 1E        .byte $1E    ; <ほ>
- D - I - 0x0363DD 23:A3CD: 07        .byte $07    ; <き>
- D - I - 0x0363DE 23:A3CE: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363DF 23:A3CF: 07        .byte $07    ; <き>
- D - I - 0x0363E0 23:A3D0: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363E1 23:A3D1: 07        .byte $07    ; <き>
- D - I - 0x0363E2 23:A3D2: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363E3 23:A3D3: 07        .byte $07    ; <き>
- D - I - 0x0363E4 23:A3D4: 1D        .byte $1D    ; <へ>
- D - I - 0x0363E5 23:A3D5: 07        .byte $07    ; <き>
- D - I - 0x0363E6 23:A3D6: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363E7 23:A3D7: 07        .byte $07    ; <き>
- D - I - 0x0363E8 23:A3D8: 1E        .byte $1E    ; <ほ>
- D - I - 0x0363E9 23:A3D9: 05        .byte $05    ; <お>
- D - I - 0x0363EA 23:A3DA: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363EB 23:A3DB: 05        .byte $05    ; <お>
- D - I - 0x0363EC 23:A3DC: 1D        .byte $1D    ; <へ>
- D - I - 0x0363ED 23:A3DD: 07        .byte $07    ; <き>
- D - I - 0x0363EE 23:A3DE: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363EF 23:A3DF: 07        .byte $07    ; <き>
- D - I - 0x0363F0 23:A3E0: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363F1 23:A3E1: 07        .byte $07    ; <き>
- D - I - 0x0363F2 23:A3E2: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363F3 23:A3E3: 07        .byte $07    ; <き>
- D - I - 0x0363F4 23:A3E4: 1D        .byte $1D    ; <へ>
- D - I - 0x0363F5 23:A3E5: 07        .byte $07    ; <き>
- D - I - 0x0363F6 23:A3E6: 1B        .byte $1B    ; <ひ>
- D - I - 0x0363F7 23:A3E7: 05        .byte $05    ; <お>
- D - I - 0x0363F8 23:A3E8: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363F9 23:A3E9: 05        .byte $05    ; <お>
- D - I - 0x0363FA 23:A3EA: 1D        .byte $1D    ; <へ>
- D - I - 0x0363FB 23:A3EB: 05        .byte $05    ; <お>
- D - I - 0x0363FC 23:A3EC: 1C        .byte $1C    ; <ふ>
- D - I - 0x0363FD 23:A3ED: 05        .byte $05    ; <お>
- D - I - 0x0363FE 23:A3EE: 1D        .byte $1D    ; <へ>
- D - I - 0x0363FF 23:A3EF: 07        .byte $07    ; <き>
- D - I - 0x036400 23:A3F0: 1B        .byte $1B    ; <ひ>
- D - I - 0x036401 23:A3F1: FF        .byte con_loop
- D - I - 0x036402 23:A3F2: CB A3     .word off_A3CB_0B

off_A3F4_0C:
- D - I - 0x036404 23:A3F4: 07        .byte $07    ; <き>
- D - I - 0x036405 23:A3F5: 1F        .byte $1F    ; <ま>
- D - I - 0x036406 23:A3F6: 05        .byte $05    ; <お>
- D - I - 0x036407 23:A3F7: 02        .byte $02    ; <い>
- D - I - 0x036408 23:A3F8: 05        .byte $05    ; <お>
- D - I - 0x036409 23:A3F9: 03        .byte $03    ; <う>
- D - I - 0x03640A 23:A3FA: 05        .byte $05    ; <お>
- D - I - 0x03640B 23:A3FB: 02        .byte $02    ; <い>
- D - I - 0x03640C 23:A3FC: 05        .byte $05    ; <お>
- D - I - 0x03640D 23:A3FD: 03        .byte $03    ; <う>
- D - I - 0x03640E 23:A3FE: 05        .byte $05    ; <お>
- D - I - 0x03640F 23:A3FF: 02        .byte $02    ; <い>
- D - I - 0x036410 23:A400: 07        .byte $07    ; <き>
- D - I - 0x036411 23:A401: 0C        .byte $0C    ; <し>
- D - I - 0x036412 23:A402: 05        .byte $05    ; <お>
- D - I - 0x036413 23:A403: 03        .byte $03    ; <う>
- D - I - 0x036414 23:A404: 05        .byte $05    ; <お>
- D - I - 0x036415 23:A405: 0C        .byte $0C    ; <し>
- D - I - 0x036416 23:A406: 07        .byte $07    ; <き>
- D - I - 0x036417 23:A407: 03        .byte $03    ; <う>
- D - I - 0x036418 23:A408: 05        .byte $05    ; <お>
- D - I - 0x036419 23:A409: 02        .byte $02    ; <い>
- D - I - 0x03641A 23:A40A: 07        .byte $07    ; <き>
- D - I - 0x03641B 23:A40B: 1F        .byte $1F    ; <ま>
- D - I - 0x03641C 23:A40C: 05        .byte $05    ; <お>
- D - I - 0x03641D 23:A40D: 02        .byte $02    ; <い>
- D - I - 0x03641E 23:A40E: 07        .byte $07    ; <き>
- D - I - 0x03641F 23:A40F: 03        .byte $03    ; <う>
- D - I - 0x036420 23:A410: 07        .byte $07    ; <き>
- D - I - 0x036421 23:A411: 0C        .byte $0C    ; <し>
- D - I - 0x036422 23:A412: 05        .byte $05    ; <お>
- D - I - 0x036423 23:A413: 03        .byte $03    ; <う>
- D - I - 0x036424 23:A414: 07        .byte $07    ; <き>
- D - I - 0x036425 23:A415: 0C        .byte $0C    ; <し>
- D - I - 0x036426 23:A416: 05        .byte $05    ; <お>
- D - I - 0x036427 23:A417: 03        .byte $03    ; <う>
- D - I - 0x036428 23:A418: 07        .byte $07    ; <き>
- D - I - 0x036429 23:A419: 0C        .byte $0C    ; <し>
- D - I - 0x03642A 23:A41A: 05        .byte $05    ; <お>
- D - I - 0x03642B 23:A41B: 03        .byte $03    ; <う>
- D - I - 0x03642C 23:A41C: 07        .byte $07    ; <き>
- D - I - 0x03642D 23:A41D: 0C        .byte $0C    ; <し>
- D - I - 0x03642E 23:A41E: 05        .byte $05    ; <お>
- D - I - 0x03642F 23:A41F: 03        .byte $03    ; <う>
- D - I - 0x036430 23:A420: 05        .byte $05    ; <お>
- D - I - 0x036431 23:A421: 02        .byte $02    ; <い>
- D - I - 0x036432 23:A422: FF        .byte con_loop
- D - I - 0x036433 23:A423: F4 A3     .word off_A3F4_0C

off_A425_0D:
- D - I - 0x036435 23:A425: EF        .byte $EF
- D - I - 0x036436 23:A426: 00        .byte $00
- - - - - 0x036437 23:A427: FF        .byte con_loop
- - - - - 0x036438 23:A428: 25 A4     .word off_A425_0D



tbl_A42A_ppu_байты_анимаций_чарли:
    .word off_A46A_00
    .word off_A48F_01
    .word off_A494_02
    .word off_A499_03
    .word off_A49E_04
    .word off_A4C3_05
    .word off_A4E8_06
    .word off_A4ED_07
    .word off_A4F2_08
    .word off_A517_09
    .word off_A51C_0A
    .word off_A521_0B
    .word off_A546_0C
    .word $0000      ; unused
    .word $0000      ; unused
    .word off_A54B_0F
    .word off_A570_10
    .word off_A57A_11
    .word off_A584_12
    .word off_A5A9_13
    .word off_A5B8_14
    .word off_A5DD_15
    .word off_A5E6_16
    .word off_A60B_17
    .word off_A615_18
    .word off_A61F_19
    .word off_A629_1A
    .word off_A64E_1B
    .word off_A655_1C
    .word off_A65C_1D
    .word off_A663_1E
    .word off_A688_1F

    con_done = $00

off_A46A_00:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $B6, $B7, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A48F_01:
    .byte $01
    .word $2323
    .byte $DA
    
    .byte con_done



off_A494_02:
    .byte $01
    .word $2323
    .byte $F1
    
    .byte con_done



off_A499_03:
    .byte $01
    .word $2323
    .byte $D8
    
    .byte con_done



off_A49E_04:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $B7, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A4C3_05:
    .byte $03
    .word $2302
    .byte $B4, $E4, $E5
    
    .byte $03
    .word $2322
    .byte $B6, $E6, $E7
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A4E8_06:
    .byte $01
    .word $2323
    .byte $D9
    
    .byte con_done



off_A4ED_07:
    .byte $01
    .word $2323
    .byte $F2
    
    .byte con_done



off_A4F2_08:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A517_09:
    .byte $01
    .word $2323
    .byte $DB
    
    .byte con_done



off_A51C_0A:
    .byte $01
    .word $2323
    .byte $F0
    
    .byte con_done



off_A521_0B:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $DA, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A546_0C:
    .byte $01
    .word $2323
    .byte $F3
    
    .byte con_done



off_A54B_0F:
    .byte $03
    .word $2302
    .byte $F4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $F5, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $B0, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A570_10:
    .byte $01
    .word $2303
    .byte $E1
    
    .byte $02
    .word $2323
    .byte $E3, $DB
    
    .byte con_done



off_A57A_11:
    .byte $01
    .word $2303
    .byte $F4
    
    .byte $02
    .word $2323
    .byte $F5, $F0
    
    .byte con_done



off_A584_12:
    .byte $03
    .word $2302
    .byte $00, $00, $00
    
    .byte $03
    .word $2322
    .byte $00, $B2, $B3
    
    .byte $03
    .word $2342
    .byte $AD, $B8, $B9
    
    .byte $03
    .word $2362
    .byte $AF, $BA, $BB
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A5A9_13:
    .byte $02
    .word $2323
    .byte $A6, $A7
    
    .byte $01
    .word $2343
    .byte $AC
    
    .byte $01
    .word $2363
    .byte $AE
    
    .byte con_done



off_A5B8_14:
    .byte $03
    .word $2302
    .byte $00, $00, $F8
    
    .byte $03
    .word $2322
    .byte $00, $00, $FA
    
    .byte $03
    .word $2342
    .byte $AD, $B8, $B9
    
    .byte $03
    .word $2362
    .byte $AF, $BA, $BB
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A5DD_15:
    .byte $01
    .word $2304
    .byte $F9
    
    .byte $01
    .word $2324
    .byte $FB
    
    .byte con_done



off_A5E6_16:
    .byte $03
    .word $2302
    .byte $DC, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $DF, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $B0, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A60B_17:
    .byte $01
    .word $2303
    .byte $DD
    
    .byte $02
    .word $2323
    .byte $DF
    .byte $DB
    
    .byte con_done



off_A615_18:
    .byte $01
    .word $2303
    .byte $DD
    
    .byte $02
    .word $2323
    .byte $F5, $DB
    
    .byte con_done



off_A61F_19:
    .byte $01
    .word $2303
    .byte $DE
    
    .byte $02
    .word $2323
    .byte $F5, $F0
    
    .byte con_done



off_A629_1A:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $D6, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $D3, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A64E_1B:
    .byte $03
    .word $2322
    .byte $E9, $F7, $ED
    
    .byte con_done



off_A655_1C:
    .byte $03
    .word $2322
    .byte $D1, $D4, $D5
    
    .byte con_done



off_A65C_1D:
    .byte $03
    .word $2322
    .byte $D1, $D7, $D5
    
    .byte con_done



off_A663_1E:
    .byte $03
    .word $2302
    .byte $B4, $B5, $E0
    
    .byte $03
    .word $2322
    .byte $E9, $EC, $ED
    
    .byte $03
    .word $2342
    .byte $BC, $BD, $E8
    
    .byte $03
    .word $2362
    .byte $BE, $BF, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



off_A688_1F:
    .byte $03
    .word $2302
    .byte $EB, $EE, $EF
    
    .byte $03
    .word $2322
    .byte $B6, $DA, $E2
    
    .byte $03
    .word $2342
    .byte $BC, $D6, $E8
    
    .byte $03
    .word $2362
    .byte $AE, $D3, $EA
    
    .byte $02
    .word $23F0
    .byte $55, $55
    
    .byte con_done



tbl_A6AD:
- D - - - 0x0366BD 23:A6AD: B5 A6     .word off_A6B5_00
- D - - - 0x0366BF 23:A6AF: E1 A7     .word off_A7E1_01
- D - - - 0x0366C1 23:A6B1: 0D A9     .word off_A90D_02
- D - - - 0x0366C3 23:A6B3: 39 AA     .word off_AA39_03

off_A6B5_00:
- D - I - 0x0366C5 23:A6B5: 00        .byte $00
- D - I - 0x0366C6 23:A6B6: 24        .byte $24    ; <や>
- D - I - 0x0366C7 23:A6B7: 1E        .byte $1E    ; <ほ>
- D - I - 0x0366C8 23:A6B8: 1E        .byte $1E    ; <ほ>
- D - I - 0x0366C9 23:A6B9: 26        .byte $26    ; <よ>
- D - I - 0x0366CA 23:A6BA: 28        .byte $28    ; <り>
- D - I - 0x0366CB 23:A6BB: 03        .byte $03    ; <う>
- D - I - 0x0366CC 23:A6BC: 03        .byte $03    ; <う>
- D - I - 0x0366CD 23:A6BD: 4A        .byte $4A    ; <コ>
- D - I - 0x0366CE 23:A6BE: 4A        .byte $4A    ; <コ>
- D - I - 0x0366CF 23:A6BF: 6B        .byte $6B    ; <ロ>
- D - I - 0x0366D0 23:A6C0: 6B        .byte $6B    ; <ロ>
- D - I - 0x0366D1 23:A6C1: 28        .byte $28    ; <り>
- D - I - 0x0366D2 23:A6C2: 44        .byte $44    ; <エ>
- D - I - 0x0366D3 23:A6C3: 79        .byte $79    ; <!>
- D - I - 0x0366D4 23:A6C4: 7D        .byte $7D    ; <ー>
- D - I - 0x0366D5 23:A6C5: 40        .byte $40    ; <「>
- D - I - 0x0366D6 23:A6C6: 66        .byte $66    ; <ヨ>
- D - I - 0x0366D7 23:A6C7: 6C        .byte $6C    ; <ワ>
- D - I - 0x0366D8 23:A6C8: 6C        .byte $6C    ; <ワ>
- D - I - 0x0366D9 23:A6C9: 3C        .byte $3C    ; <9>
- D - I - 0x0366DA 23:A6CA: 3C        .byte $3C    ; <9>
- D - I - 0x0366DB 23:A6CB: 50        .byte $50    ; <タ>
- D - I - 0x0366DC 23:A6CC: 50        .byte $50    ; <タ>
- D - I - 0x0366DD 23:A6CD: 4C        .byte $4C    ; <シ>
- D - I - 0x0366DE 23:A6CE: 3F        .byte $3F    ; <•>
- D - I - 0x0366DF 23:A6CF: 28        .byte $28    ; <り>
- D - I - 0x0366E0 23:A6D0: 35        .byte $35    ; <2>
- D - I - 0x0366E1 23:A6D1: 62        .byte $62    ; <メ>
- D - I - 0x0366E2 23:A6D2: 7A        .byte $7A    ; <、>
- D - I - 0x0366E3 23:A6D3: 83        .byte $83    ; <C>
- D - I - 0x0366E4 23:A6D4: A7        .byte $A7    ; <ず>
- D - I - 0x0366E5 23:A6D5: 67        .byte $67    ; <ラ>
- D - I - 0x0366E6 23:A6D6: 67        .byte $67    ; <ラ>
- D - I - 0x0366E7 23:A6D7: A8        .byte $A8    ; <ぜ>
- D - I - 0x0366E8 23:A6D8: 95        .byte $95
- D - I - 0x0366E9 23:A6D9: 70        .byte $70    ; <ャ>
- D - I - 0x0366EA 23:A6DA: 98        .byte $98
- D - I - 0x0366EB 23:A6DB: 84        .byte $84    ; <D>
- D - I - 0x0366EC 23:A6DC: 87        .byte $87    ; <G>
- D - I - 0x0366ED 23:A6DD: 54        .byte $54    ; <ト>
- D - I - 0x0366EE 23:A6DE: 6C        .byte $6C    ; <ワ>
- D - I - 0x0366EF 23:A6DF: 80        .byte $80
- D - I - 0x0366F0 23:A6E0: 80        .byte $80
- D - I - 0x0366F1 23:A6E1: 6F        .byte $6F    ; <ッ>
- D - I - 0x0366F2 23:A6E2: 7C        .byte $7C    ; <~>
- D - I - 0x0366F3 23:A6E3: 4B        .byte $4B    ; <サ>
- D - I - 0x0366F4 23:A6E4: 65        .byte $65    ; <ユ>
- D - I - 0x0366F5 23:A6E5: 9D        .byte $9D
- D - I - 0x0366F6 23:A6E6: AC        .byte $AC    ; <づ>
- D - I - 0x0366F7 23:A6E7: BF        .byte $BF    ; <ヂ>
- D - I - 0x0366F8 23:A6E8: BF        .byte $BF    ; <ヂ>
- D - I - 0x0366F9 23:A6E9: AE        .byte $AE    ; <ど>
- D - I - 0x0366FA 23:A6EA: C7        .byte $C7    ; <ボ>
- D - I - 0x0366FB 23:A6EB: C4        .byte $C4    ; <ビ>
- D - I - 0x0366FC 23:A6EC: C4        .byte $C4    ; <ビ>
- D - I - 0x0366FD 23:A6ED: 95        .byte $95
- D - I - 0x0366FE 23:A6EE: B6        .byte $B6    ; <グ>
- D - I - 0x0366FF 23:A6EF: B4        .byte $B4    ; <ガ>
- D - I - 0x036700 23:A6F0: C0        .byte $C0    ; <ヅ>
- D - I - 0x036701 23:A6F1: 90        .byte $90    ; <U>
- D - I - 0x036702 23:A6F2: 90        .byte $90    ; <U>
- D - I - 0x036703 23:A6F3: A5        .byte $A5    ; <ざ>
- D - I - 0x036704 23:A6F4: A5        .byte $A5    ; <ざ>
- D - I - 0x036705 23:A6F5: 94        .byte $94
- D - I - 0x036706 23:A6F6: 94        .byte $94
- D - I - 0x036707 23:A6F7: 7E        .byte $7E    ; <.>
- D - I - 0x036708 23:A6F8: 7E        .byte $7E    ; <.>
- D - I - 0x036709 23:A6F9: C3        .byte $C3    ; <バ>
- D - I - 0x03670A 23:A6FA: C3        .byte $C3    ; <バ>
- D - I - 0x03670B 23:A6FB: DF        .byte $DF
- D - I - 0x03670C 23:A6FC: DF        .byte $DF
- D - I - 0x03670D 23:A6FD: AD        .byte $AD    ; <で>
- D - I - 0x03670E 23:A6FE: C6        .byte $C6    ; <ベ>
- D - I - 0x03670F 23:A6FF: DC        .byte $DC
- D - I - 0x036710 23:A700: DC        .byte $DC
- D - I - 0x036711 23:A701: D1        .byte $D1    ; <ポ>
- D - I - 0x036712 23:A702: D1        .byte $D1    ; <ポ>
- D - I - 0x036713 23:A703: D8        .byte $D8
- D - I - 0x036714 23:A704: D8        .byte $D8
- D - I - 0x036715 23:A705: A8        .byte $A8    ; <ぜ>
- D - I - 0x036716 23:A706: A8        .byte $A8    ; <ぜ>
- D - I - 0x036717 23:A707: B1        .byte $B1    ; <ぶ>
- D - I - 0x036718 23:A708: B1        .byte $B1    ; <ぶ>
- D - I - 0x036719 23:A709: 95        .byte $95
- D - I - 0x03671A 23:A70A: 95        .byte $95
- D - I - 0x03671B 23:A70B: 7E        .byte $7E    ; <.>
- D - I - 0x03671C 23:A70C: 7E        .byte $7E    ; <.>
- D - I - 0x03671D 23:A70D: D1        .byte $D1    ; <ポ>
- D - I - 0x03671E 23:A70E: D1        .byte $D1    ; <ポ>
- D - I - 0x03671F 23:A70F: E0        .byte $E0
- D - I - 0x036720 23:A710: E0        .byte $E0
- D - I - 0x036721 23:A711: D3        .byte $D3
- D - I - 0x036722 23:A712: D3        .byte $D3
- D - I - 0x036723 23:A713: E9        .byte $E9
- D - I - 0x036724 23:A714: E9        .byte $E9
- D - I - 0x036725 23:A715: DE        .byte $DE
- D - I - 0x036726 23:A716: DE        .byte $DE
- D - I - 0x036727 23:A717: DC        .byte $DC
- D - I - 0x036728 23:A718: DC        .byte $DC
- D - I - 0x036729 23:A719: 03        .byte $03    ; <う>
- D - I - 0x03672A 23:A71A: 1B        .byte $1B    ; <ひ>
- D - I - 0x03672B 23:A71B: 08        .byte $08    ; <く>
- D - I - 0x03672C 23:A71C: 20        .byte $20    ; <み>
- D - I - 0x03672D 23:A71D: 1C        .byte $1C    ; <ふ>
- D - I - 0x03672E 23:A71E: 1D        .byte $1D    ; <へ>
- D - I - 0x03672F 23:A71F: 06        .byte $06    ; <か>
- D - I - 0x036730 23:A720: 11        .byte $11    ; <ち>
- D - I - 0x036731 23:A721: 25        .byte $25    ; <ゆ>
- D - I - 0x036732 23:A722: 33        .byte $33    ; <0>
- D - I - 0x036733 23:A723: 5F        .byte $5F    ; <マ>
- D - I - 0x036734 23:A724: 5F        .byte $5F    ; <マ>
- D - I - 0x036735 23:A725: 2B        .byte $2B    ; <ろ>
- D - I - 0x036736 23:A726: 44        .byte $44    ; <エ>
- D - I - 0x036737 23:A727: 72        .byte $72    ; <ョ>
- D - I - 0x036738 23:A728: 72        .byte $72    ; <ョ>
- D - I - 0x036739 23:A729: 35        .byte $35    ; <2>
- D - I - 0x03673A 23:A72A: 4E        .byte $4E    ; <セ>
- D - I - 0x03673B 23:A72B: 54        .byte $54    ; <ト>
- D - I - 0x03673C 23:A72C: 54        .byte $54    ; <ト>
- D - I - 0x03673D 23:A72D: 3C        .byte $3C    ; <9>
- D - I - 0x03673E 23:A72E: 48        .byte $48    ; <ク>
- D - I - 0x03673F 23:A72F: 47        .byte $47    ; <キ>
- D - I - 0x036740 23:A730: 53        .byte $53    ; <テ>
- D - I - 0x036741 23:A731: 41        .byte $41    ; <ア>
- D - I - 0x036742 23:A732: 41        .byte $41    ; <ア>
- D - I - 0x036743 23:A733: 37        .byte $37    ; <4>
- D - I - 0x036744 23:A734: 37        .byte $37    ; <4>
- D - I - 0x036745 23:A735: 57        .byte $57    ; <ヌ>
- D - I - 0x036746 23:A736: 7B        .byte $7B    ; <。>
- D - I - 0x036747 23:A737: 83        .byte $83    ; <C>
- D - I - 0x036748 23:A738: 8F        .byte $8F    ; <S>
- D - I - 0x036749 23:A739: 5C        .byte $5C    ; <フ>
- D - I - 0x03674A 23:A73A: 80        .byte $80
- D - I - 0x03674B 23:A73B: 8A        .byte $8A    ; <N>
- D - I - 0x03674C 23:A73C: A3        .byte $A3    ; <げ>
- D - I - 0x03674D 23:A73D: 71        .byte $71    ; <ュ>
- D - I - 0x03674E 23:A73E: 94        .byte $94
- D - I - 0x03674F 23:A73F: 78        .byte $78    ; <?>
- D - I - 0x036750 23:A740: 84        .byte $84    ; <D>
- D - I - 0x036751 23:A741: 6C        .byte $6C    ; <ワ>
- D - I - 0x036752 23:A742: 6C        .byte $6C    ; <ワ>
- D - I - 0x036753 23:A743: 77        .byte $77    ; <:>
- D - I - 0x036754 23:A744: 77        .byte $77    ; <:>
- D - I - 0x036755 23:A745: 71        .byte $71    ; <ュ>
- D - I - 0x036756 23:A746: 71        .byte $71    ; <ュ>
- D - I - 0x036757 23:A747: 66        .byte $66    ; <ヨ>
- D - I - 0x036758 23:A748: 66        .byte $66    ; <ヨ>
- D - I - 0x036759 23:A749: AA        .byte $AA    ; <だ>
- D - I - 0x03675A 23:A74A: 93        .byte $93    ; <Y>
- D - I - 0x03675B 23:A74B: CB        .byte $CB    ; <ぺ>
- D - I - 0x03675C 23:A74C: B3        .byte $B3    ; <ぼ>
- D - I - 0x03675D 23:A74D: B0        .byte $B0    ; <び>
- D - I - 0x03675E 23:A74E: 98        .byte $98
- D - I - 0x03675F 23:A74F: B8        .byte $B8    ; <ゴ>
- D - I - 0x036760 23:A750: C7        .byte $C7    ; <ボ>
- D - I - 0x036761 23:A751: 95        .byte $95
- D - I - 0x036762 23:A752: AE        .byte $AE    ; <ど>
- D - I - 0x036763 23:A753: A8        .byte $A8    ; <ぜ>
- D - I - 0x036764 23:A754: C0        .byte $C0    ; <ヅ>
- D - I - 0x036765 23:A755: 9C        .byte $9C
- D - I - 0x036766 23:A756: 9C        .byte $9C
- D - I - 0x036767 23:A757: A7        .byte $A7    ; <ず>
- D - I - 0x036768 23:A758: A7        .byte $A7    ; <ず>
- D - I - 0x036769 23:A759: 96        .byte $96
- D - I - 0x03676A 23:A75A: 96        .byte $96
- D - I - 0x03676B 23:A75B: 7D        .byte $7D    ; <ー>
- D - I - 0x03676C 23:A75C: 7D        .byte $7D    ; <ー>
- D - I - 0x03676D 23:A75D: B7        .byte $B7    ; <ゲ>
- D - I - 0x03676E 23:A75E: D0        .byte $D0    ; <ペ>
- D - I - 0x03676F 23:A75F: E3        .byte $E3
- D - I - 0x036770 23:A760: E3        .byte $E3
- D - I - 0x036771 23:A761: BC        .byte $BC    ; <ゼ>
- D - I - 0x036772 23:A762: D3        .byte $D3
- D - I - 0x036773 23:A763: DD        .byte $DD
- D - I - 0x036774 23:A764: DD        .byte $DD
- D - I - 0x036775 23:A765: C5        .byte $C5    ; <ブ>
- D - I - 0x036776 23:A766: DE        .byte $DE
- D - I - 0x036777 23:A767: D8        .byte $D8
- D - I - 0x036778 23:A768: D8        .byte $D8
- D - I - 0x036779 23:A769: 9C        .byte $9C
- D - I - 0x03677A 23:A76A: 9C        .byte $9C
- D - I - 0x03677B 23:A76B: A7        .byte $A7    ; <ず>
- D - I - 0x03677C 23:A76C: A7        .byte $A7    ; <ず>
- D - I - 0x03677D 23:A76D: AD        .byte $AD    ; <で>
- D - I - 0x03677E 23:A76E: AD        .byte $AD    ; <で>
- D - I - 0x03677F 23:A76F: 8A        .byte $8A    ; <N>
- D - I - 0x036780 23:A770: 8A        .byte $8A    ; <N>
- D - I - 0x036781 23:A771: CF        .byte $CF    ; <プ>
- D - I - 0x036782 23:A772: DC        .byte $DC
- D - I - 0x036783 23:A773: EF        .byte $EF
- D - I - 0x036784 23:A774: EF        .byte $EF
- D - I - 0x036785 23:A775: D4        .byte $D4
- D - I - 0x036786 23:A776: DF        .byte $DF
- D - I - 0x036787 23:A777: E9        .byte $E9
- D - I - 0x036788 23:A778: E9        .byte $E9
- D - I - 0x036789 23:A779: DE        .byte $DE
- D - I - 0x03678A 23:A77A: EA        .byte $EA
- D - I - 0x03678B 23:A77B: E4        .byte $E4
- D - I - 0x03678C 23:A77C: E4        .byte $E4
- D - I - 0x03678D 23:A77D: 1D        .byte $1D    ; <へ>
- D - I - 0x03678E 23:A77E: 1D        .byte $1D    ; <へ>
- D - I - 0x03678F 23:A77F: 0B        .byte $0B    ; <さ>
- D - I - 0x036790 23:A780: 2F        .byte $2F    ; <っ>
- D - I - 0x036791 23:A781: 2D        .byte $2D    ; <を>
- D - I - 0x036792 23:A782: 39        .byte $39    ; <6>
- D - I - 0x036793 23:A783: 08        .byte $08    ; <く>
- D - I - 0x036794 23:A784: 08        .byte $08    ; <く>
- D - I - 0x036795 23:A785: 2B        .byte $2B    ; <ろ>
- D - I - 0x036796 23:A786: 3F        .byte $3F    ; <•>
- D - I - 0x036797 23:A787: 77        .byte $77    ; <:>
- D - I - 0x036798 23:A788: 77        .byte $77    ; <:>
- D - I - 0x036799 23:A789: 51        .byte $51    ; <チ>
- D - I - 0x03679A 23:A78A: 51        .byte $51    ; <チ>
- D - I - 0x03679B 23:A78B: 7E        .byte $7E    ; <.>
- D - I - 0x03679C 23:A78C: 82        .byte $82    ; <B>
- D - I - 0x03679D 23:A78D: 43        .byte $43    ; <ウ>
- D - I - 0x03679E 23:A78E: 65        .byte $65    ; <ユ>
- D - I - 0x03679F 23:A78F: 60        .byte $60    ; <ミ>
- D - I - 0x0367A0 23:A790: 60        .byte $60    ; <ミ>
- D - I - 0x0367A1 23:A791: 4B        .byte $4B    ; <サ>
- D - I - 0x0367A2 23:A792: 4B        .byte $4B    ; <サ>
- D - I - 0x0367A3 23:A793: 47        .byte $47    ; <キ>
- D - I - 0x0367A4 23:A794: 47        .byte $47    ; <キ>
- D - I - 0x0367A5 23:A795: 4F        .byte $4F    ; <ソ>
- D - I - 0x0367A6 23:A796: 44        .byte $44    ; <エ>
- D - I - 0x0367A7 23:A797: 2B        .byte $2B    ; <ろ>
- D - I - 0x0367A8 23:A798: 36        .byte $36    ; <3>
- D - I - 0x0367A9 23:A799: 64        .byte $64    ; <ヤ>
- D - I - 0x0367AA 23:A79A: 64        .byte $64    ; <ヤ>
- D - I - 0x0367AB 23:A79B: 80        .byte $80
- D - I - 0x0367AC 23:A79C: 9B        .byte $9B
- D - I - 0x0367AD 23:A79D: 69        .byte $69    ; <ル>
- D - I - 0x0367AE 23:A79E: 82        .byte $82    ; <B>
- D - I - 0x0367AF 23:A79F: 97        .byte $97
- D - I - 0x0367B0 23:A7A0: B3        .byte $B3    ; <ぼ>
- D - I - 0x0367B1 23:A7A1: 73        .byte $73    ; <ヮ>
- D - I - 0x0367B2 23:A7A2: 94        .byte $94
- D - I - 0x0367B3 23:A7A3: 78        .byte $78    ; <?>
- D - I - 0x0367B4 23:A7A4: 9C        .byte $9C
- D - I - 0x0367B5 23:A7A5: 7B        .byte $7B    ; <。>
- D - I - 0x0367B6 23:A7A6: 7B        .byte $7B    ; <。>
- D - I - 0x0367B7 23:A7A7: 5F        .byte $5F    ; <マ>
- D - I - 0x0367B8 23:A7A8: 77        .byte $77    ; <:>
- D - I - 0x0367B9 23:A7A9: 74        .byte $74    ; <ィ>
- D - I - 0x0367BA 23:A7AA: 7F        .byte $7F    ; <,>
- D - I - 0x0367BB 23:A7AB: 50        .byte $50    ; <タ>
- D - I - 0x0367BC 23:A7AC: 66        .byte $66    ; <ヨ>
- D - I - 0x0367BD 23:A7AD: AD        .byte $AD    ; <で>
- D - I - 0x0367BE 23:A7AE: C4        .byte $C4    ; <ビ>
- D - I - 0x0367BF 23:A7AF: BF        .byte $BF    ; <ヂ>
- D - I - 0x0367C0 23:A7B0: CB        .byte $CB    ; <ぺ>
- D - I - 0x0367C1 23:A7B1: A6        .byte $A6    ; <じ>
- D - I - 0x0367C2 23:A7B2: AF        .byte $AF    ; <ば>
- D - I - 0x0367C3 23:A7B3: C7        .byte $C7    ; <ボ>
- D - I - 0x0367C4 23:A7B4: C7        .byte $C7    ; <ボ>
- D - I - 0x0367C5 23:A7B5: 96        .byte $96
- D - I - 0x0367C6 23:A7B6: BD        .byte $BD    ; <ゾ>
- D - I - 0x0367C7 23:A7B7: B4        .byte $B4    ; <ガ>
- D - I - 0x0367C8 23:A7B8: B4        .byte $B4    ; <ガ>
- D - I - 0x0367C9 23:A7B9: 9E        .byte $9E
- D - I - 0x0367CA 23:A7BA: 9E        .byte $9E
- D - I - 0x0367CB 23:A7BB: 9B        .byte $9B
- D - I - 0x0367CC 23:A7BC: 9B        .byte $9B
- D - I - 0x0367CD 23:A7BD: 97        .byte $97
- D - I - 0x0367CE 23:A7BE: 97        .byte $97
- D - I - 0x0367CF 23:A7BF: 7D        .byte $7D    ; <ー>
- D - I - 0x0367D0 23:A7C0: 7D        .byte $7D    ; <ー>
- D - I - 0x0367D1 23:A7C1: AE        .byte $AE    ; <ど>
- D - I - 0x0367D2 23:A7C2: C5        .byte $C5    ; <ブ>
- D - I - 0x0367D3 23:A7C3: E3        .byte $E3
- D - I - 0x0367D4 23:A7C4: E3        .byte $E3
- D - I - 0x0367D5 23:A7C5: C8        .byte $C8    ; <ぱ>
- D - I - 0x0367D6 23:A7C6: C8        .byte $C8    ; <ぱ>
- D - I - 0x0367D7 23:A7C7: DF        .byte $DF
- D - I - 0x0367D8 23:A7C8: DF        .byte $DF
- D - I - 0x0367D9 23:A7C9: D2        .byte $D2
- D - I - 0x0367DA 23:A7CA: D2        .byte $D2
- D - I - 0x0367DB 23:A7CB: DC        .byte $DC
- D - I - 0x0367DC 23:A7CC: DC        .byte $DC
- D - I - 0x0367DD 23:A7CD: AA        .byte $AA    ; <だ>
- D - I - 0x0367DE 23:A7CE: AA        .byte $AA    ; <だ>
- D - I - 0x0367DF 23:A7CF: B3        .byte $B3    ; <ぼ>
- D - I - 0x0367E0 23:A7D0: B3        .byte $B3    ; <ぼ>
- D - I - 0x0367E1 23:A7D1: A2        .byte $A2    ; <ぐ>
- D - I - 0x0367E2 23:A7D2: A2        .byte $A2    ; <ぐ>
- D - I - 0x0367E3 23:A7D3: 7D        .byte $7D    ; <ー>
- D - I - 0x0367E4 23:A7D4: 7D        .byte $7D    ; <ー>
- D - I - 0x0367E5 23:A7D5: D0        .byte $D0    ; <ペ>
- D - I - 0x0367E6 23:A7D6: D0        .byte $D0    ; <ペ>
- D - I - 0x0367E7 23:A7D7: DF        .byte $DF
- D - I - 0x0367E8 23:A7D8: DF        .byte $DF
- D - I - 0x0367E9 23:A7D9: D2        .byte $D2
- D - I - 0x0367EA 23:A7DA: D2        .byte $D2
- D - I - 0x0367EB 23:A7DB: EA        .byte $EA
- D - I - 0x0367EC 23:A7DC: EA        .byte $EA
- D - I - 0x0367ED 23:A7DD: DD        .byte $DD
- D - I - 0x0367EE 23:A7DE: DD        .byte $DD
- D - I - 0x0367EF 23:A7DF: DB        .byte $DB
- D - I - 0x0367F0 23:A7E0: DB        .byte $DB
off_A7E1_01:
- D - I - 0x0367F1 23:A7E1: 00        .byte $00
- D - I - 0x0367F2 23:A7E2: 24        .byte $24    ; <や>
- D - I - 0x0367F3 23:A7E3: 12        .byte $12    ; <つ>
- D - I - 0x0367F4 23:A7E4: 12        .byte $12    ; <つ>
- D - I - 0x0367F5 23:A7E5: 26        .byte $26    ; <よ>
- D - I - 0x0367F6 23:A7E6: 32        .byte $32    ; <ょ>
- D - I - 0x0367F7 23:A7E7: 03        .byte $03    ; <う>
- D - I - 0x0367F8 23:A7E8: 03        .byte $03    ; <う>
- D - I - 0x0367F9 23:A7E9: 49        .byte $49    ; <ケ>
- D - I - 0x0367FA 23:A7EA: 54        .byte $54    ; <ト>
- D - I - 0x0367FB 23:A7EB: 51        .byte $51    ; <チ>
- D - I - 0x0367FC 23:A7EC: 51        .byte $51    ; <チ>
- D - I - 0x0367FD 23:A7ED: 1D        .byte $1D    ; <へ>
- D - I - 0x0367FE 23:A7EE: 36        .byte $36    ; <3>
- D - I - 0x0367FF 23:A7EF: 7F        .byte $7F    ; <,>
- D - I - 0x036800 23:A7F0: 7F        .byte $7F    ; <,>
- D - I - 0x036801 23:A7F1: 40        .byte $40    ; <「>
- D - I - 0x036802 23:A7F2: 5A        .byte $5A    ; <ハ>
- D - I - 0x036803 23:A7F3: 6C        .byte $6C    ; <ワ>
- D - I - 0x036804 23:A7F4: 70        .byte $70    ; <ャ>
- D - I - 0x036805 23:A7F5: 30        .byte $30    ; <ゃ>
- D - I - 0x036806 23:A7F6: 6C        .byte $6C    ; <ワ>
- D - I - 0x036807 23:A7F7: 44        .byte $44    ; <エ>
- D - I - 0x036808 23:A7F8: 52        .byte $52    ; <ツ>
- D - I - 0x036809 23:A7F9: 26        .byte $26    ; <よ>
- D - I - 0x03680A 23:A7FA: 26        .byte $26    ; <よ>
- D - I - 0x03680B 23:A7FB: 29        .byte $29    ; <る>
- D - I - 0x03680C 23:A7FC: 29        .byte $29    ; <る>
- D - I - 0x03680D 23:A7FD: 84        .byte $84    ; <D>
- D - I - 0x03680E 23:A7FE: 79        .byte $79    ; <!>
- D - I - 0x03680F 23:A7FF: 75        .byte $75    ; <ェ>
- D - I - 0x036810 23:A800: 8E        .byte $8E    ; <L>
- D - I - 0x036811 23:A801: 67        .byte $67    ; <ラ>
- D - I - 0x036812 23:A802: 4D        .byte $4D    ; <ス>
- D - I - 0x036813 23:A803: 97        .byte $97
- D - I - 0x036814 23:A804: 97        .byte $97
- D - I - 0x036815 23:A805: 64        .byte $64    ; <ヤ>
- D - I - 0x036816 23:A806: 89        .byte $89    ; <I>
- D - I - 0x036817 23:A807: 9C        .byte $9C
- D - I - 0x036818 23:A808: 93        .byte $93    ; <Y>
- D - I - 0x036819 23:A809: 54        .byte $54    ; <ト>
- D - I - 0x03681A 23:A80A: 9C        .byte $9C
- D - I - 0x03681B 23:A80B: 68        .byte $68    ; <リ>
- D - I - 0x03681C 23:A80C: 82        .byte $82    ; <B>
- D - I - 0x03681D 23:A80D: 57        .byte $57    ; <ヌ>
- D - I - 0x03681E 23:A80E: 57        .byte $57    ; <ヌ>
- D - I - 0x03681F 23:A80F: 4D        .byte $4D    ; <ス>
- D - I - 0x036820 23:A810: 4D        .byte $4D    ; <ス>
- D - I - 0x036821 23:A811: B4        .byte $B4    ; <ガ>
- D - I - 0x036822 23:A812: A9        .byte $A9    ; <ぞ>
- D - I - 0x036823 23:A813: B2        .byte $B2    ; <べ>
- D - I - 0x036824 23:A814: B2        .byte $B2    ; <べ>
- D - I - 0x036825 23:A815: 89        .byte $89    ; <I>
- D - I - 0x036826 23:A816: A3        .byte $A3    ; <げ>
- D - I - 0x036827 23:A817: BB        .byte $BB    ; <ズ>
- D - I - 0x036828 23:A818: C6        .byte $C6    ; <ベ>
- D - I - 0x036829 23:A819: 9F        .byte $9F
- D - I - 0x03682A 23:A81A: AD        .byte $AD    ; <で>
- D - I - 0x03682B 23:A81B: CC        .byte $CC    ; <ぽ>
- D - I - 0x03682C 23:A81C: C4        .byte $C4    ; <ビ>
- D - I - 0x03682D 23:A81D: 79        .byte $79    ; <!>
- D - I - 0x03682E 23:A81E: CC        .byte $CC    ; <ぽ>
- D - I - 0x03682F 23:A81F: 8D        .byte $8D    ; <P>
- D - I - 0x036830 23:A820: B2        .byte $B2    ; <べ>
- D - I - 0x036831 23:A821: 7C        .byte $7C    ; <~>
- D - I - 0x036832 23:A822: 7C        .byte $7C    ; <~>
- D - I - 0x036833 23:A823: 71        .byte $71    ; <ュ>
- D - I - 0x036834 23:A824: 71        .byte $71    ; <ュ>
- D - I - 0x036835 23:A825: C3        .byte $C3    ; <バ>
- D - I - 0x036836 23:A826: E4        .byte $E4
- D - I - 0x036837 23:A827: C8        .byte $C8    ; <ぱ>
- D - I - 0x036838 23:A828: C8        .byte $C8    ; <ぱ>
- D - I - 0x036839 23:A829: A1        .byte $A1    ; <ぎ>
- D - I - 0x03683A 23:A82A: C6        .byte $C6    ; <ベ>
- D - I - 0x03683B 23:A82B: DE        .byte $DE
- D - I - 0x03683C 23:A82C: DE        .byte $DE
- D - I - 0x03683D 23:A82D: D1        .byte $D1    ; <ポ>
- D - I - 0x03683E 23:A82E: D1        .byte $D1    ; <ポ>
- D - I - 0x03683F 23:A82F: CE        .byte $CE    ; <ピ>
- D - I - 0x036840 23:A830: DC        .byte $DC
- D - I - 0x036841 23:A831: 9C        .byte $9C
- D - I - 0x036842 23:A832: 9C        .byte $9C
- D - I - 0x036843 23:A833: 99        .byte $99
- D - I - 0x036844 23:A834: 99        .byte $99
- D - I - 0x036845 23:A835: 88        .byte $88    ; <H>
- D - I - 0x036846 23:A836: 88        .byte $88    ; <H>
- D - I - 0x036847 23:A837: 71        .byte $71    ; <ュ>
- D - I - 0x036848 23:A838: 71        .byte $71    ; <ュ>
- D - I - 0x036849 23:A839: DC        .byte $DC
- D - I - 0x03684A 23:A83A: DC        .byte $DC
- D - I - 0x03684B 23:A83B: D4        .byte $D4
- D - I - 0x03684C 23:A83C: D4        .byte $D4
- D - I - 0x03684D 23:A83D: D1        .byte $D1    ; <ポ>
- D - I - 0x03684E 23:A83E: D1        .byte $D1    ; <ポ>
- D - I - 0x03684F 23:A83F: EA        .byte $EA
- D - I - 0x036850 23:A840: EA        .byte $EA
- D - I - 0x036851 23:A841: DE        .byte $DE
- D - I - 0x036852 23:A842: DE        .byte $DE
- D - I - 0x036853 23:A843: E9        .byte $E9
- D - I - 0x036854 23:A844: E9        .byte $E9
- D - I - 0x036855 23:A845: 0E        .byte $0E    ; <せ>
- D - I - 0x036856 23:A846: 0E        .byte $0E    ; <せ>
- D - I - 0x036857 23:A847: 15        .byte $15    ; <な>
- D - I - 0x036858 23:A848: 15        .byte $15    ; <な>
- D - I - 0x036859 23:A849: 10        .byte $10    ; <た>
- D - I - 0x03685A 23:A84A: 10        .byte $10    ; <た>
- D - I - 0x03685B 23:A84B: 06        .byte $06    ; <か>
- D - I - 0x03685C 23:A84C: 06        .byte $06    ; <か>
- D - I - 0x03685D 23:A84D: 60        .byte $60    ; <ミ>
- D - I - 0x03685E 23:A84E: 4A        .byte $4A    ; <コ>
- D - I - 0x03685F 23:A84F: 51        .byte $51    ; <チ>
- D - I - 0x036860 23:A850: 6B        .byte $6B    ; <ロ>
- D - I - 0x036861 23:A851: 37        .byte $37    ; <4>
- D - I - 0x036862 23:A852: 41        .byte $41    ; <ア>
- D - I - 0x036863 23:A853: 73        .byte $73    ; <ヮ>
- D - I - 0x036864 23:A854: 83        .byte $83    ; <C>
- D - I - 0x036865 23:A855: 34        .byte $34    ; <1>
- D - I - 0x036866 23:A856: 65        .byte $65    ; <ユ>
- D - I - 0x036867 23:A857: 70        .byte $70    ; <ャ>
- D - I - 0x036868 23:A858: 78        .byte $78    ; <?>
- D - I - 0x036869 23:A859: 3C        .byte $3C    ; <9>
- D - I - 0x03686A 23:A85A: 6C        .byte $6C    ; <ワ>
- D - I - 0x03686B 23:A85B: 47        .byte $47    ; <キ>
- D - I - 0x03686C 23:A85C: 77        .byte $77    ; <:>
- D - I - 0x03686D 23:A85D: 35        .byte $35    ; <2>
- D - I - 0x03686E 23:A85E: 35        .byte $35    ; <2>
- D - I - 0x03686F 23:A85F: 2B        .byte $2B    ; <ろ>
- D - I - 0x036870 23:A860: 2B        .byte $2B    ; <ろ>
- D - I - 0x036871 23:A861: 56        .byte $56    ; <ニ>
- D - I - 0x036872 23:A862: 84        .byte $84    ; <D>
- D - I - 0x036873 23:A863: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036874 23:A864: 8F        .byte $8F    ; <S>
- D - I - 0x036875 23:A865: 80        .byte $80
- D - I - 0x036876 23:A866: 67        .byte $67    ; <ラ>
- D - I - 0x036877 23:A867: 8A        .byte $8A    ; <N>
- D - I - 0x036878 23:A868: A7        .byte $A7    ; <ず>
- D - I - 0x036879 23:A869: 7B        .byte $7B    ; <。>
- D - I - 0x03687A 23:A86A: 71        .byte $71    ; <ュ>
- D - I - 0x03687B 23:A86B: 94        .byte $94
- D - I - 0x03687C 23:A86C: 9C        .byte $9C
- D - I - 0x03687D 23:A86D: 61        .byte $61    ; <ム>
- D - I - 0x03687E 23:A86E: 90        .byte $90    ; <U>
- D - I - 0x03687F 23:A86F: 6A        .byte $6A    ; <レ>
- D - I - 0x036880 23:A870: 9B        .byte $9B
- D - I - 0x036881 23:A871: 59        .byte $59    ; <ノ>
- D - I - 0x036882 23:A872: 6F        .byte $6F    ; <ッ>
- D - I - 0x036883 23:A873: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036884 23:A874: 74        .byte $74    ; <ィ>
- D - I - 0x036885 23:A875: 9D        .byte $9D
- D - I - 0x036886 23:A876: C0        .byte $C0    ; <ヅ>
- D - I - 0x036887 23:A877: A6        .byte $A6    ; <じ>
- D - I - 0x036888 23:A878: CB        .byte $CB    ; <ぺ>
- D - I - 0x036889 23:A879: 93        .byte $93    ; <Y>
- D - I - 0x03688A 23:A87A: 98        .byte $98
- D - I - 0x03688B 23:A87B: BC        .byte $BC    ; <ゼ>
- D - I - 0x03688C 23:A87C: BB        .byte $BB    ; <ズ>
- D - I - 0x03688D 23:A87D: A3        .byte $A3    ; <げ>
- D - I - 0x03688E 23:A87E: AD        .byte $AD    ; <で>
- D - I - 0x03688F 23:A87F: B7        .byte $B7    ; <ゲ>
- D - I - 0x036890 23:A880: B8        .byte $B8    ; <ゴ>
- D - I - 0x036891 23:A881: 85        .byte $85    ; <E>
- D - I - 0x036892 23:A882: CC        .byte $CC    ; <ぽ>
- D - I - 0x036893 23:A883: 8E        .byte $8E    ; <L>
- D - I - 0x036894 23:A884: D7        .byte $D7
- D - I - 0x036895 23:A885: 7D        .byte $7D    ; <ー>
- D - I - 0x036896 23:A886: 7D        .byte $7D    ; <ー>
- D - I - 0x036897 23:A887: 72        .byte $72    ; <ョ>
- D - I - 0x036898 23:A888: 72        .byte $72    ; <ョ>
- D - I - 0x036899 23:A889: D0        .byte $D0    ; <ペ>
- D - I - 0x03689A 23:A88A: E4        .byte $E4
- D - I - 0x03689B 23:A88B: D3        .byte $D3
- D - I - 0x03689C 23:A88C: EF        .byte $EF
- D - I - 0x03689D 23:A88D: C3        .byte $C3    ; <バ>
- D - I - 0x03689E 23:A88E: C8        .byte $C8    ; <ぱ>
- D - I - 0x03689F 23:A88F: DE        .byte $DE
- D - I - 0x0368A0 23:A890: E2        .byte $E2
- D - I - 0x0368A1 23:A891: D2        .byte $D2
- D - I - 0x0368A2 23:A892: E9        .byte $E9
- D - I - 0x0368A3 23:A893: D9        .byte $D9
- D - I - 0x0368A4 23:A894: DD        .byte $DD
- D - I - 0x0368A5 23:A895: 85        .byte $85    ; <E>
- D - I - 0x0368A6 23:A896: 85        .byte $85    ; <E>
- D - I - 0x0368A7 23:A897: 8E        .byte $8E    ; <L>
- D - I - 0x0368A8 23:A898: 8E        .byte $8E    ; <L>
- D - I - 0x0368A9 23:A899: 95        .byte $95
- D - I - 0x0368AA 23:A89A: 95        .byte $95
- D - I - 0x0368AB 23:A89B: 72        .byte $72    ; <ョ>
- D - I - 0x0368AC 23:A89C: 72        .byte $72    ; <ョ>
- D - I - 0x0368AD 23:A89D: DB        .byte $DB
- D - I - 0x0368AE 23:A89E: DB        .byte $DB
- D - I - 0x0368AF 23:A89F: E0        .byte $E0
- D - I - 0x0368B0 23:A8A0: E0        .byte $E0
- D - I - 0x0368B1 23:A8A1: C5        .byte $C5    ; <ブ>
- D - I - 0x0368B2 23:A8A2: C5        .byte $C5    ; <ブ>
- D - I - 0x0368B3 23:A8A3: EA        .byte $EA
- D - I - 0x0368B4 23:A8A4: EA        .byte $EA
- D - I - 0x0368B5 23:A8A5: DE        .byte $DE
- D - I - 0x0368B6 23:A8A6: DE        .byte $DE
- D - I - 0x0368B7 23:A8A7: E9        .byte $E9
- D - I - 0x0368B8 23:A8A8: E9        .byte $E9
- D - I - 0x0368B9 23:A8A9: 11        .byte $11    ; <ち>
- D - I - 0x0368BA 23:A8AA: 11        .byte $11    ; <ち>
- D - I - 0x0368BB 23:A8AB: 0B        .byte $0B    ; <さ>
- D - I - 0x0368BC 23:A8AC: 2F        .byte $2F    ; <っ>
- D - I - 0x0368BD 23:A8AD: 2D        .byte $2D    ; <を>
- D - I - 0x0368BE 23:A8AE: 39        .byte $39    ; <6>
- D - I - 0x0368BF 23:A8AF: 08        .byte $08    ; <く>
- D - I - 0x0368C0 23:A8B0: 08        .byte $08    ; <く>
- D - I - 0x0368C1 23:A8B1: 4A        .byte $4A    ; <コ>
- D - I - 0x0368C2 23:A8B2: 4A        .byte $4A    ; <コ>
- D - I - 0x0368C3 23:A8B3: 52        .byte $52    ; <ツ>
- D - I - 0x0368C4 23:A8B4: 5F        .byte $5F    ; <マ>
- D - I - 0x0368C5 23:A8B5: 1E        .byte $1E    ; <ほ>
- D - I - 0x0368C6 23:A8B6: 35        .byte $35    ; <2>
- D - I - 0x0368C7 23:A8B7: 73        .byte $73    ; <ヮ>
- D - I - 0x0368C8 23:A8B8: 77        .byte $77    ; <:>
- D - I - 0x0368C9 23:A8B9: 43        .byte $43    ; <ウ>
- D - I - 0x0368CA 23:A8BA: 59        .byte $59    ; <ノ>
- D - I - 0x0368CB 23:A8BB: 7C        .byte $7C    ; <~>
- D - I - 0x0368CC 23:A8BC: 7C        .byte $7C    ; <~>
- D - I - 0x0368CD 23:A8BD: 3F        .byte $3F    ; <•>
- D - I - 0x0368CE 23:A8BE: 4A        .byte $4A    ; <コ>
- D - I - 0x0368CF 23:A8BF: 3B        .byte $3B    ; <8>
- D - I - 0x0368D0 23:A8C0: 77        .byte $77    ; <:>
- D - I - 0x0368D1 23:A8C1: 2D        .byte $2D    ; <を>
- D - I - 0x0368D2 23:A8C2: 2D        .byte $2D    ; <を>
- D - I - 0x0368D3 23:A8C3: 2A        .byte $2A    ; <れ>
- D - I - 0x0368D4 23:A8C4: 2A        .byte $2A    ; <れ>
- D - I - 0x0368D5 23:A8C5: 6E        .byte $6E    ; <ン>
- D - I - 0x0368D6 23:A8C6: 85        .byte $85    ; <E>
- D - I - 0x0368D7 23:A8C7: 82        .byte $82    ; <B>
- D - I - 0x0368D8 23:A8C8: 8F        .byte $8F    ; <S>
- D - I - 0x0368D9 23:A8C9: 64        .byte $64    ; <ヤ>
- D - I - 0x0368DA 23:A8CA: 4E        .byte $4E    ; <セ>
- D - I - 0x0368DB 23:A8CB: 98        .byte $98
- D - I - 0x0368DC 23:A8CC: A7        .byte $A7    ; <ず>
- D - I - 0x0368DD 23:A8CD: 67        .byte $67    ; <ラ>
- D - I - 0x0368DE 23:A8CE: 8A        .byte $8A    ; <N>
- D - I - 0x0368DF 23:A8CF: 94        .byte $94
- D - I - 0x0368E0 23:A8D0: A1        .byte $A1    ; <ぎ>
- D - I - 0x0368E1 23:A8D1: 79        .byte $79    ; <!>
- D - I - 0x0368E2 23:A8D2: 63        .byte $63    ; <モ>
- D - I - 0x0368E3 23:A8D3: 5F        .byte $5F    ; <マ>
- D - I - 0x0368E4 23:A8D4: A7        .byte $A7    ; <ず>
- D - I - 0x0368E5 23:A8D5: 5C        .byte $5C    ; <フ>
- D - I - 0x0368E6 23:A8D6: 5C        .byte $5C    ; <フ>
- D - I - 0x0368E7 23:A8D7: 4E        .byte $4E    ; <セ>
- D - I - 0x0368E8 23:A8D8: 4E        .byte $4E    ; <セ>
- D - I - 0x0368E9 23:A8D9: A9        .byte $A9    ; <ぞ>
- D - I - 0x0368EA 23:A8DA: A9        .byte $A9    ; <ぞ>
- D - I - 0x0368EB 23:A8DB: B2        .byte $B2    ; <べ>
- D - I - 0x0368EC 23:A8DC: BF        .byte $BF    ; <ヂ>
- D - I - 0x0368ED 23:A8DD: A0        .byte $A0    ; <が>
- D - I - 0x0368EE 23:A8DE: 8A        .byte $8A    ; <N>
- D - I - 0x0368EF 23:A8DF: C7        .byte $C7    ; <ボ>
- D - I - 0x0368F0 23:A8E0: D7        .byte $D7
- D - I - 0x0368F1 23:A8E1: AE        .byte $AE    ; <ど>
- D - I - 0x0368F2 23:A8E2: A4        .byte $A4    ; <ご>
- D - I - 0x0368F3 23:A8E3: B8        .byte $B8    ; <ゴ>
- D - I - 0x0368F4 23:A8E4: C5        .byte $C5    ; <ブ>
- D - I - 0x0368F5 23:A8E5: 86        .byte $86    ; <F>
- D - I - 0x0368F6 23:A8E6: B5        .byte $B5    ; <ギ>
- D - I - 0x0368F7 23:A8E7: 82        .byte $82    ; <B>
- D - I - 0x0368F8 23:A8E8: D7        .byte $D7
- D - I - 0x0368F9 23:A8E9: 7F        .byte $7F    ; <,>
- D - I - 0x0368FA 23:A8EA: 7F        .byte $7F    ; <,>
- D - I - 0x0368FB 23:A8EB: 72        .byte $72    ; <ョ>
- D - I - 0x0368FC 23:A8EC: 72        .byte $72    ; <ョ>
- D - I - 0x0368FD 23:A8ED: C3        .byte $C3    ; <バ>
- D - I - 0x0368FE 23:A8EE: C3        .byte $C3    ; <バ>
- D - I - 0x0368FF 23:A8EF: C8        .byte $C8    ; <ぱ>
- D - I - 0x036900 23:A8F0: EF        .byte $EF
- D - I - 0x036901 23:A8F1: C5        .byte $C5    ; <ブ>
- D - I - 0x036902 23:A8F2: A2        .byte $A2    ; <ぐ>
- D - I - 0x036903 23:A8F3: D5        .byte $D5
- D - I - 0x036904 23:A8F4: DF        .byte $DF
- D - I - 0x036905 23:A8F5: D2        .byte $D2
- D - I - 0x036906 23:A8F6: D2        .byte $D2
- D - I - 0x036907 23:A8F7: DD        .byte $DD
- D - I - 0x036908 23:A8F8: DD        .byte $DD
- D - I - 0x036909 23:A8F9: 92        .byte $92    ; <W>
- D - I - 0x03690A 23:A8FA: 92        .byte $92    ; <W>
- D - I - 0x03690B 23:A8FB: A7        .byte $A7    ; <ず>
- D - I - 0x03690C 23:A8FC: A7        .byte $A7    ; <ず>
- D - I - 0x03690D 23:A8FD: 8B        .byte $8B    ; <K>
- D - I - 0x03690E 23:A8FE: 8B        .byte $8B    ; <K>
- D - I - 0x03690F 23:A8FF: 72        .byte $72    ; <ョ>
- D - I - 0x036910 23:A900: 72        .byte $72    ; <ョ>
- D - I - 0x036911 23:A901: CF        .byte $CF    ; <プ>
- D - I - 0x036912 23:A902: CF        .byte $CF    ; <プ>
- D - I - 0x036913 23:A903: DF        .byte $DF
- D - I - 0x036914 23:A904: DF        .byte $DF
- D - I - 0x036915 23:A905: D2        .byte $D2
- D - I - 0x036916 23:A906: D2        .byte $D2
- D - I - 0x036917 23:A907: EA        .byte $EA
- D - I - 0x036918 23:A908: EA        .byte $EA
- D - I - 0x036919 23:A909: DD        .byte $DD
- D - I - 0x03691A 23:A90A: DD        .byte $DD
- D - I - 0x03691B 23:A90B: E9        .byte $E9
- D - I - 0x03691C 23:A90C: E9        .byte $E9
off_A90D_02:
- D - I - 0x03691D 23:A90D: 0C        .byte $0C    ; <し>
- D - I - 0x03691E 23:A90E: 30        .byte $30    ; <ゃ>
- D - I - 0x03691F 23:A90F: 14        .byte $14    ; <と>
- D - I - 0x036920 23:A910: 14        .byte $14    ; <と>
- D - I - 0x036921 23:A911: 05        .byte $05    ; <お>
- D - I - 0x036922 23:A912: 05        .byte $05    ; <お>
- D - I - 0x036923 23:A913: 49        .byte $49    ; <ケ>
- D - I - 0x036924 23:A914: 27        .byte $27    ; <ら>
- D - I - 0x036925 23:A915: 54        .byte $54    ; <ト>
- D - I - 0x036926 23:A916: 56        .byte $56    ; <ニ>
- D - I - 0x036927 23:A917: 44        .byte $44    ; <エ>
- D - I - 0x036928 23:A918: 53        .byte $53    ; <テ>
- D - I - 0x036929 23:A919: 2A        .byte $2A    ; <れ>
- D - I - 0x03692A 23:A91A: 35        .byte $35    ; <2>
- D - I - 0x03692B 23:A91B: 73        .byte $73    ; <ヮ>
- D - I - 0x03692C 23:A91C: 7F        .byte $7F    ; <,>
- D - I - 0x03692D 23:A91D: 3F        .byte $3F    ; <•>
- D - I - 0x03692E 23:A91E: 5B        .byte $5B    ; <ヒ>
- D - I - 0x03692F 23:A91F: 6C        .byte $6C    ; <ワ>
- D - I - 0x036930 23:A920: 70        .byte $70    ; <ャ>
- D - I - 0x036931 23:A921: 25        .byte $25    ; <ゆ>
- D - I - 0x036932 23:A922: 25        .byte $25    ; <ゆ>
- D - I - 0x036933 23:A923: 38        .byte $38    ; <5>
- D - I - 0x036934 23:A924: 38        .byte $38    ; <5>
- D - I - 0x036935 23:A925: 28        .byte $28    ; <り>
- D - I - 0x036936 23:A926: 28        .byte $28    ; <り>
- D - I - 0x036937 23:A927: 78        .byte $78    ; <?>
- D - I - 0x036938 23:A928: 4C        .byte $4C    ; <シ>
- D - I - 0x036939 23:A929: 84        .byte $84    ; <D>
- D - I - 0x03693A 23:A92A: 62        .byte $62    ; <メ>
- D - I - 0x03693B 23:A92B: 5C        .byte $5C    ; <フ>
- D - I - 0x03693C 23:A92C: 83        .byte $83    ; <C>
- D - I - 0x03693D 23:A92D: 41        .byte $41    ; <ア>
- D - I - 0x03693E 23:A92E: 66        .byte $66    ; <ヨ>
- D - I - 0x03693F 23:A92F: 8B        .byte $8B    ; <K>
- D - I - 0x036940 23:A930: A2        .byte $A2    ; <ぐ>
- D - I - 0x036941 23:A931: 70        .byte $70    ; <ャ>
- D - I - 0x036942 23:A932: A0        .byte $A0    ; <が>
- D - I - 0x036943 23:A933: 87        .byte $87    ; <G>
- D - I - 0x036944 23:A934: 9C        .byte $9C
- D - I - 0x036945 23:A935: 55        .byte $55    ; <ナ>
- D - I - 0x036946 23:A936: 55        .byte $55    ; <ナ>
- D - I - 0x036947 23:A937: 69        .byte $69    ; <ル>
- D - I - 0x036948 23:A938: 69        .byte $69    ; <ル>
- D - I - 0x036949 23:A939: 4D        .byte $4D    ; <ス>
- D - I - 0x03694A 23:A93A: 4D        .byte $4D    ; <ス>
- D - I - 0x03694B 23:A93B: B4        .byte $B4    ; <ガ>
- D - I - 0x03694C 23:A93C: 88        .byte $88    ; <H>
- D - I - 0x03694D 23:A93D: 9D        .byte $9D
- D - I - 0x03694E 23:A93E: CC        .byte $CC    ; <ぽ>
- D - I - 0x03694F 23:A93F: B1        .byte $B1    ; <ぶ>
- D - I - 0x036950 23:A940: BF        .byte $BF    ; <ヂ>
- D - I - 0x036951 23:A941: C6        .byte $C6    ; <ベ>
- D - I - 0x036952 23:A942: BB        .byte $BB    ; <ズ>
- D - I - 0x036953 23:A943: C7        .byte $C7    ; <ボ>
- D - I - 0x036954 23:A944: D2        .byte $D2
- D - I - 0x036955 23:A945: B6        .byte $B6    ; <グ>
- D - I - 0x036956 23:A946: AD        .byte $AD    ; <で>
- D - I - 0x036957 23:A947: C4        .byte $C4    ; <ビ>
- D - I - 0x036958 23:A948: C4        .byte $C4    ; <ビ>
- D - I - 0x036959 23:A949: 79        .byte $79    ; <!>
- D - I - 0x03695A 23:A94A: 79        .byte $79    ; <!>
- D - I - 0x03695B 23:A94B: 8D        .byte $8D    ; <P>
- D - I - 0x03695C 23:A94C: 8D        .byte $8D    ; <P>
- D - I - 0x03695D 23:A94D: 71        .byte $71    ; <ュ>
- D - I - 0x03695E 23:A94E: 71        .byte $71    ; <ュ>
- D - I - 0x03695F 23:A94F: D8        .byte $D8
- D - I - 0x036960 23:A950: AC        .byte $AC    ; <づ>
- D - I - 0x036961 23:A951: C3        .byte $C3    ; <バ>
- D - I - 0x036962 23:A952: E4        .byte $E4
- D - I - 0x036963 23:A953: D4        .byte $D4
- D - I - 0x036964 23:A954: D4        .byte $D4
- D - I - 0x036965 23:A955: A2        .byte $A2    ; <ぐ>
- D - I - 0x036966 23:A956: C6        .byte $C6    ; <ベ>
- D - I - 0x036967 23:A957: DE        .byte $DE
- D - I - 0x036968 23:A958: DE        .byte $DE
- D - I - 0x036969 23:A959: D1        .byte $D1    ; <ポ>
- D - I - 0x03696A 23:A95A: D1        .byte $D1    ; <ポ>
- D - I - 0x03696B 23:A95B: DC        .byte $DC
- D - I - 0x03696C 23:A95C: DC        .byte $DC
- D - I - 0x03696D 23:A95D: 91        .byte $91    ; <V>
- D - I - 0x03696E 23:A95E: 91        .byte $91    ; <V>
- D - I - 0x03696F 23:A95F: 9A        .byte $9A
- D - I - 0x036970 23:A960: 9A        .byte $9A
- D - I - 0x036971 23:A961: 7E        .byte $7E    ; <.>
- D - I - 0x036972 23:A962: 7E        .byte $7E    ; <.>
- D - I - 0x036973 23:A963: AD        .byte $AD    ; <で>
- D - I - 0x036974 23:A964: C7        .byte $C7    ; <ボ>
- D - I - 0x036975 23:A965: D1        .byte $D1    ; <ポ>
- D - I - 0x036976 23:A966: D1        .byte $D1    ; <ポ>
- D - I - 0x036977 23:A967: E0        .byte $E0
- D - I - 0x036978 23:A968: E0        .byte $E0
- D - I - 0x036979 23:A969: DE        .byte $DE
- D - I - 0x03697A 23:A96A: DE        .byte $DE
- D - I - 0x03697B 23:A96B: E9        .byte $E9
- D - I - 0x03697C 23:A96C: E9        .byte $E9
- D - I - 0x03697D 23:A96D: EA        .byte $EA
- D - I - 0x03697E 23:A96E: EA        .byte $EA
- D - I - 0x03697F 23:A96F: DC        .byte $DC
- D - I - 0x036980 23:A970: DC        .byte $DC
- D - I - 0x036981 23:A971: 0F        .byte $0F    ; <そ>
- D - I - 0x036982 23:A972: 0F        .byte $0F    ; <そ>
- D - I - 0x036983 23:A973: 14        .byte $14    ; <と>
- D - I - 0x036984 23:A974: 14        .byte $14    ; <と>
- D - I - 0x036985 23:A975: 05        .byte $05    ; <お>
- D - I - 0x036986 23:A976: 05        .byte $05    ; <お>
- D - I - 0x036987 23:A977: 24        .byte $24    ; <や>
- D - I - 0x036988 23:A978: 33        .byte $33    ; <0>
- D - I - 0x036989 23:A979: 60        .byte $60    ; <ミ>
- D - I - 0x03698A 23:A97A: 4B        .byte $4B    ; <サ>
- D - I - 0x03698B 23:A97B: 51        .byte $51    ; <チ>
- D - I - 0x03698C 23:A97C: 43        .byte $43    ; <ウ>
- D - I - 0x03698D 23:A97D: 38        .byte $38    ; <5>
- D - I - 0x03698E 23:A97E: 2F        .byte $2F    ; <っ>
- D - I - 0x03698F 23:A97F: 73        .byte $73    ; <ヮ>
- D - I - 0x036990 23:A980: 83        .byte $83    ; <C>
- D - I - 0x036991 23:A981: 41        .byte $41    ; <ア>
- D - I - 0x036992 23:A982: 59        .byte $59    ; <ノ>
- D - I - 0x036993 23:A983: 70        .byte $70    ; <ャ>
- D - I - 0x036994 23:A984: 78        .byte $78    ; <?>
- D - I - 0x036995 23:A985: 32        .byte $32    ; <ょ>
- D - I - 0x036996 23:A986: 32        .byte $32    ; <ょ>
- D - I - 0x036997 23:A987: 39        .byte $39    ; <6>
- D - I - 0x036998 23:A988: 39        .byte $39    ; <6>
- D - I - 0x036999 23:A989: 29        .byte $29    ; <る>
- D - I - 0x03699A 23:A98A: 29        .byte $29    ; <る>
- D - I - 0x03699B 23:A98B: 49        .byte $49    ; <ケ>
- D - I - 0x03699C 23:A98C: 7A        .byte $7A    ; <、>
- D - I - 0x03699D 23:A98D: 63        .byte $63    ; <モ>
- D - I - 0x03699E 23:A98E: 84        .byte $84    ; <D>
- D - I - 0x03699F 23:A98F: 68        .byte $68    ; <リ>
- D - I - 0x0369A0 23:A990: 8F        .byte $8F    ; <S>
- D - I - 0x0369A1 23:A991: 52        .byte $52    ; <ツ>
- D - I - 0x0369A2 23:A992: 81        .byte $81    ; <A>
- D - I - 0x0369A3 23:A993: 8B        .byte $8B    ; <K>
- D - I - 0x0369A4 23:A994: A7        .byte $A7    ; <ず>
- D - I - 0x0369A5 23:A995: 71        .byte $71    ; <ュ>
- D - I - 0x0369A6 23:A996: A1        .byte $A1    ; <ぎ>
- D - I - 0x0369A7 23:A997: 88        .byte $88    ; <H>
- D - I - 0x0369A8 23:A998: 9C        .byte $9C
- D - I - 0x0369A9 23:A999: 62        .byte $62    ; <メ>
- D - I - 0x0369AA 23:A99A: 90        .byte $90    ; <U>
- D - I - 0x0369AB 23:A99B: 69        .byte $69    ; <ル>
- D - I - 0x0369AC 23:A99C: 9B        .byte $9B
- D - I - 0x0369AD 23:A99D: 59        .byte $59    ; <ノ>
- D - I - 0x0369AE 23:A99E: 59        .byte $59    ; <ノ>
- D - I - 0x0369AF 23:A99F: B4        .byte $B4    ; <ガ>
- D - I - 0x0369B0 23:A9A0: 7A        .byte $7A    ; <、>
- D - I - 0x0369B1 23:A9A1: 93        .byte $93    ; <Y>
- D - I - 0x0369B2 23:A9A2: C0        .byte $C0    ; <ヅ>
- D - I - 0x0369B3 23:A9A3: 98        .byte $98
- D - I - 0x0369B4 23:A9A4: CB        .byte $CB    ; <ぺ>
- D - I - 0x0369B5 23:A9A5: 81        .byte $81    ; <A>
- D - I - 0x0369B6 23:A9A6: BF        .byte $BF    ; <ヂ>
- D - I - 0x0369B7 23:A9A7: B0        .byte $B0    ; <び>
- D - I - 0x0369B8 23:A9A8: BC        .byte $BC    ; <ゼ>
- D - I - 0x0369B9 23:A9A9: A2        .byte $A2    ; <ぐ>
- D - I - 0x0369BA 23:A9AA: C5        .byte $C5    ; <ブ>
- D - I - 0x0369BB 23:A9AB: AB        .byte $AB    ; <ぢ>
- D - I - 0x0369BC 23:A9AC: B7        .byte $B7    ; <ゲ>
- D - I - 0x0369BD 23:A9AD: 79        .byte $79    ; <!>
- D - I - 0x0369BE 23:A9AE: 90        .byte $90    ; <U>
- D - I - 0x0369BF 23:A9AF: 82        .byte $82    ; <B>
- D - I - 0x0369C0 23:A9B0: 9B        .byte $9B
- D - I - 0x0369C1 23:A9B1: 71        .byte $71    ; <ュ>
- D - I - 0x0369C2 23:A9B2: 71        .byte $71    ; <ュ>
- D - I - 0x0369C3 23:A9B3: D0        .byte $D0    ; <ペ>
- D - I - 0x0369C4 23:A9B4: B6        .byte $B6    ; <グ>
- D - I - 0x0369C5 23:A9B5: C0        .byte $C0    ; <ヅ>
- D - I - 0x0369C6 23:A9B6: E4        .byte $E4
- D - I - 0x0369C7 23:A9B7: CB        .byte $CB    ; <ぺ>
- D - I - 0x0369C8 23:A9B8: EF        .byte $EF
- D - I - 0x0369C9 23:A9B9: D4        .byte $D4
- D - I - 0x0369CA 23:A9BA: BD        .byte $BD    ; <ゾ>
- D - I - 0x0369CB 23:A9BB: E0        .byte $E0
- D - I - 0x0369CC 23:A9BC: DE        .byte $DE
- D - I - 0x0369CD 23:A9BD: E9        .byte $E9
- D - I - 0x0369CE 23:A9BE: D2        .byte $D2
- D - I - 0x0369CF 23:A9BF: DB        .byte $DB
- D - I - 0x0369D0 23:A9C0: DD        .byte $DD
- D - I - 0x0369D1 23:A9C1: 9D        .byte $9D
- D - I - 0x0369D2 23:A9C2: 9D        .byte $9D
- D - I - 0x0369D3 23:A9C3: A6        .byte $A6    ; <じ>
- D - I - 0x0369D4 23:A9C4: A6        .byte $A6    ; <じ>
- D - I - 0x0369D5 23:A9C5: 7D        .byte $7D    ; <ー>
- D - I - 0x0369D6 23:A9C6: 7D        .byte $7D    ; <ー>
- D - I - 0x0369D7 23:A9C7: D0        .byte $D0    ; <ペ>
- D - I - 0x0369D8 23:A9C8: D0        .byte $D0    ; <ペ>
- D - I - 0x0369D9 23:A9C9: DB        .byte $DB
- D - I - 0x0369DA 23:A9CA: DB        .byte $DB
- D - I - 0x0369DB 23:A9CB: E0        .byte $E0
- D - I - 0x0369DC 23:A9CC: E0        .byte $E0
- D - I - 0x0369DD 23:A9CD: D3        .byte $D3
- D - I - 0x0369DE 23:A9CE: D3        .byte $D3
- D - I - 0x0369DF 23:A9CF: EA        .byte $EA
- D - I - 0x0369E0 23:A9D0: EA        .byte $EA
- D - I - 0x0369E1 23:A9D1: DE        .byte $DE
- D - I - 0x0369E2 23:A9D2: DE        .byte $DE
- D - I - 0x0369E3 23:A9D3: E9        .byte $E9
- D - I - 0x0369E4 23:A9D4: E9        .byte $E9
- D - I - 0x0369E5 23:A9D5: 0F        .byte $0F    ; <そ>
- D - I - 0x0369E6 23:A9D6: 0F        .byte $0F    ; <そ>
- D - I - 0x0369E7 23:A9D7: 17        .byte $17    ; <ぬ>
- D - I - 0x0369E8 23:A9D8: 3B        .byte $3B    ; <8>
- D - I - 0x0369E9 23:A9D9: 06        .byte $06    ; <か>
- D - I - 0x0369EA 23:A9DA: 06        .byte $06    ; <か>
- D - I - 0x0369EB 23:A9DB: 29        .byte $29    ; <る>
- D - I - 0x0369EC 23:A9DC: 36        .byte $36    ; <3>
- D - I - 0x0369ED 23:A9DD: 3F        .byte $3F    ; <•>
- D - I - 0x0369EE 23:A9DE: 48        .byte $48    ; <ク>
- D - I - 0x0369EF 23:A9DF: 5F        .byte $5F    ; <マ>
- D - I - 0x0369F0 23:A9E0: 5D        .byte $5D    ; <ヘ>
- D - I - 0x0369F1 23:A9E1: 2C        .byte $2C    ; <わ>
- D - I - 0x0369F2 23:A9E2: 52        .byte $52    ; <ツ>
- D - I - 0x0369F3 23:A9E3: 73        .byte $73    ; <ヮ>
- D - I - 0x0369F4 23:A9E4: 77        .byte $77    ; <:>
- D - I - 0x0369F5 23:A9E5: 59        .byte $59    ; <ノ>
- D - I - 0x0369F6 23:A9E6: 44        .byte $44    ; <エ>
- D - I - 0x0369F7 23:A9E7: 7C        .byte $7C    ; <~>
- D - I - 0x0369F8 23:A9E8: 7C        .byte $7C    ; <~>
- D - I - 0x0369F9 23:A9E9: 33        .byte $33    ; <0>
- D - I - 0x0369FA 23:A9EA: 33        .byte $33    ; <0>
- D - I - 0x0369FB 23:A9EB: 2E        .byte $2E    ; <ん>
- D - I - 0x0369FC 23:A9EC: 2E        .byte $2E    ; <ん>
- D - I - 0x0369FD 23:A9ED: 2B        .byte $2B    ; <ろ>
- D - I - 0x0369FE 23:A9EE: 2B        .byte $2B    ; <ろ>
- D - I - 0x0369FF 23:A9EF: 58        .byte $58    ; <ネ>
- D - I - 0x036A00 23:A9F0: 42        .byte $42    ; <イ>
- D - I - 0x036A01 23:A9F1: 78        .byte $78    ; <?>
- D - I - 0x036A02 23:A9F2: 62        .byte $62    ; <メ>
- D - I - 0x036A03 23:A9F3: 69        .byte $69    ; <ル>
- D - I - 0x036A04 23:A9F4: 8F        .byte $8F    ; <S>
- D - I - 0x036A05 23:A9F5: 4F        .byte $4F    ; <ソ>
- D - I - 0x036A06 23:A9F6: 83        .byte $83    ; <C>
- D - I - 0x036A07 23:A9F7: 8C        .byte $8C    ; <M>
- D - I - 0x036A08 23:A9F8: A7        .byte $A7    ; <ず>
- D - I - 0x036A09 23:A9F9: 67        .byte $67    ; <ラ>
- D - I - 0x036A0A 23:A9FA: A3        .byte $A3    ; <げ>
- D - I - 0x036A0B 23:A9FB: 88        .byte $88    ; <H>
- D - I - 0x036A0C 23:A9FC: A1        .byte $A1    ; <ぎ>
- D - I - 0x036A0D 23:A9FD: 62        .byte $62    ; <メ>
- D - I - 0x036A0E 23:A9FE: 62        .byte $62    ; <メ>
- D - I - 0x036A0F 23:A9FF: 5E        .byte $5E    ; <ホ>
- D - I - 0x036A10 23:AA00: 5E        .byte $5E    ; <ホ>
- D - I - 0x036A11 23:AA01: 4E        .byte $4E    ; <セ>
- D - I - 0x036A12 23:AA02: 4E        .byte $4E    ; <セ>
- D - I - 0x036A13 23:AA03: 7D        .byte $7D    ; <ー>
- D - I - 0x036A14 23:AA04: 94        .byte $94
- D - I - 0x036A15 23:AA05: B4        .byte $B4    ; <ガ>
- D - I - 0x036A16 23:AA06: AA        .byte $AA    ; <だ>
- D - I - 0x036A17 23:AA07: A6        .byte $A6    ; <じ>
- D - I - 0x036A18 23:AA08: D7        .byte $D7
- D - I - 0x036A19 23:AA09: BF        .byte $BF    ; <ヂ>
- D - I - 0x036A1A 23:AA0A: 8B        .byte $8B    ; <K>
- D - I - 0x036A1B 23:AA0B: C7        .byte $C7    ; <ボ>
- D - I - 0x036A1C 23:AA0C: C7        .byte $C7    ; <ボ>
- D - I - 0x036A1D 23:AA0D: AE        .byte $AE    ; <ど>
- D - I - 0x036A1E 23:AA0E: BD        .byte $BD    ; <ゾ>
- D - I - 0x036A1F 23:AA0F: B8        .byte $B8    ; <ゴ>
- D - I - 0x036A20 23:AA10: C5        .byte $C5    ; <ブ>
- D - I - 0x036A21 23:AA11: 86        .byte $86    ; <F>
- D - I - 0x036A22 23:AA12: 86        .byte $86    ; <F>
- D - I - 0x036A23 23:AA13: 82        .byte $82    ; <B>
- D - I - 0x036A24 23:AA14: 82        .byte $82    ; <B>
- D - I - 0x036A25 23:AA15: 72        .byte $72    ; <ョ>
- D - I - 0x036A26 23:AA16: 72        .byte $72    ; <ョ>
- D - I - 0x036A27 23:AA17: A1        .byte $A1    ; <ぎ>
- D - I - 0x036A28 23:AA18: C5        .byte $C5    ; <ブ>
- D - I - 0x036A29 23:AA19: CF        .byte $CF    ; <プ>
- D - I - 0x036A2A 23:AA1A: CF        .byte $CF    ; <プ>
- D - I - 0x036A2B 23:AA1B: C8        .byte $C8    ; <ぱ>
- D - I - 0x036A2C 23:AA1C: EF        .byte $EF
- D - I - 0x036A2D 23:AA1D: AF        .byte $AF    ; <ば>
- D - I - 0x036A2E 23:AA1E: E3        .byte $E3
- D - I - 0x036A2F 23:AA1F: DF        .byte $DF
- D - I - 0x036A30 23:AA20: DF        .byte $DF
- D - I - 0x036A31 23:AA21: D2        .byte $D2
- D - I - 0x036A32 23:AA22: D2        .byte $D2
- D - I - 0x036A33 23:AA23: DD        .byte $DD
- D - I - 0x036A34 23:AA24: DD        .byte $DD
- D - I - 0x036A35 23:AA25: 91        .byte $91    ; <V>
- D - I - 0x036A36 23:AA26: 91        .byte $91    ; <V>
- D - I - 0x036A37 23:AA27: 9A        .byte $9A
- D - I - 0x036A38 23:AA28: 9A        .byte $9A
- D - I - 0x036A39 23:AA29: 7D        .byte $7D    ; <ー>
- D - I - 0x036A3A 23:AA2A: 7D        .byte $7D    ; <ー>
- D - I - 0x036A3B 23:AA2B: DD        .byte $DD
- D - I - 0x036A3C 23:AA2C: DD        .byte $DD
- D - I - 0x036A3D 23:AA2D: DB        .byte $DB
- D - I - 0x036A3E 23:AA2E: DB        .byte $DB
- D - I - 0x036A3F 23:AA2F: D2        .byte $D2
- D - I - 0x036A40 23:AA30: D2        .byte $D2
- D - I - 0x036A41 23:AA31: AE        .byte $AE    ; <ど>
- D - I - 0x036A42 23:AA32: C4        .byte $C4    ; <ビ>
- D - I - 0x036A43 23:AA33: DF        .byte $DF
- D - I - 0x036A44 23:AA34: DF        .byte $DF
- D - I - 0x036A45 23:AA35: E9        .byte $E9
- D - I - 0x036A46 23:AA36: E9        .byte $E9
- D - I - 0x036A47 23:AA37: EA        .byte $EA
- D - I - 0x036A48 23:AA38: EA        .byte $EA
off_AA39_03:
- D - I - 0x036A49 23:AA39: 0C        .byte $0C    ; <し>
- D - I - 0x036A4A 23:AA3A: 48        .byte $48    ; <ク>
- D - I - 0x036A4B 23:AA3B: 20        .byte $20    ; <み>
- D - I - 0x036A4C 23:AA3C: 20        .byte $20    ; <み>
- D - I - 0x036A4D 23:AA3D: 1B        .byte $1B    ; <ひ>
- D - I - 0x036A4E 23:AA3E: 1B        .byte $1B    ; <ひ>
- D - I - 0x036A4F 23:AA3F: 11        .byte $11    ; <ち>
- D - I - 0x036A50 23:AA40: 11        .byte $11    ; <ち>
- D - I - 0x036A51 23:AA41: 40        .byte $40    ; <「>
- D - I - 0x036A52 23:AA42: 4D        .byte $4D    ; <ス>
- D - I - 0x036A53 23:AA43: 6B        .byte $6B    ; <ロ>
- D - I - 0x036A54 23:AA44: 6B        .byte $6B    ; <ロ>
- D - I - 0x036A55 23:AA45: 36        .byte $36    ; <3>
- D - I - 0x036A56 23:AA46: 36        .byte $36    ; <3>
- D - I - 0x036A57 23:AA47: 7E        .byte $7E    ; <.>
- D - I - 0x036A58 23:AA48: 7E        .byte $7E    ; <.>
- D - I - 0x036A59 23:AA49: 63        .byte $63    ; <モ>
- D - I - 0x036A5A 23:AA4A: 85        .byte $85    ; <E>
- D - I - 0x036A5B 23:AA4B: 3E        .byte $3E    ; <Jr>
- D - I - 0x036A5C 23:AA4C: 6C        .byte $6C    ; <ワ>
- D - I - 0x036A5D 23:AA4D: 30        .byte $30    ; <ゃ>
- D - I - 0x036A5E 23:AA4E: 90        .byte $90    ; <U>
- D - I - 0x036A5F 23:AA4F: 45        .byte $45    ; <オ>
- D - I - 0x036A60 23:AA50: 52        .byte $52    ; <ツ>
- D - I - 0x036A61 23:AA51: 33        .byte $33    ; <0>
- D - I - 0x036A62 23:AA52: 33        .byte $33    ; <0>
- D - I - 0x036A63 23:AA53: 36        .byte $36    ; <3>
- D - I - 0x036A64 23:AA54: 41        .byte $41    ; <ア>
- D - I - 0x036A65 23:AA55: 58        .byte $58    ; <ネ>
- D - I - 0x036A66 23:AA56: 7C        .byte $7C    ; <~>
- D - I - 0x036A67 23:AA57: 83        .byte $83    ; <C>
- D - I - 0x036A68 23:AA58: 83        .byte $83    ; <C>
- D - I - 0x036A69 23:AA59: 5A        .byte $5A    ; <ハ>
- D - I - 0x036A6A 23:AA5A: 67        .byte $67    ; <ラ>
- D - I - 0x036A6B 23:AA5B: A2        .byte $A2    ; <ぐ>
- D - I - 0x036A6C 23:AA5C: A2        .byte $A2    ; <ぐ>
- D - I - 0x036A6D 23:AA5D: 86        .byte $86    ; <F>
- - - - - 0x036A6E 23:AA5E: AB        .byte $AB    ; <ぢ>
- - - - - 0x036A6F 23:AA5F: 6D        .byte $6D    ; <ヲ>
- D - I - 0x036A70 23:AA60: A8        .byte $A8    ; <ぜ>
- D - I - 0x036A71 23:AA61: 60        .byte $60    ; <ミ>
- D - I - 0x036A72 23:AA62: B4        .byte $B4    ; <ガ>
- D - I - 0x036A73 23:AA63: 69        .byte $69    ; <ル>
- D - I - 0x036A74 23:AA64: 69        .byte $69    ; <ル>
- D - I - 0x036A75 23:AA65: 63        .byte $63    ; <モ>
- D - I - 0x036A76 23:AA66: 63        .byte $63    ; <モ>
- D - I - 0x036A77 23:AA67: 59        .byte $59    ; <ノ>
- D - I - 0x036A78 23:AA68: 7D        .byte $7D    ; <ー>
- D - I - 0x036A79 23:AA69: 94        .byte $94
- D - I - 0x036A7A 23:AA6A: A1        .byte $A1    ; <ぎ>
- D - I - 0x036A7B 23:AA6B: CB        .byte $CB    ; <ぺ>
- D - I - 0x036A7C 23:AA6C: CB        .byte $CB    ; <ぺ>
- D - I - 0x036A7D 23:AA6D: 8B        .byte $8B    ; <K>
- D - I - 0x036A7E 23:AA6E: A5        .byte $A5    ; <ざ>
- D - I - 0x036A7F 23:AA6F: C6        .byte $C6    ; <ベ>
- D - I - 0x036A80 23:AA70: C6        .byte $C6    ; <ベ>
- D - I - 0x036A81 23:AA71: B7        .byte $B7    ; <ゲ>
- D - I - 0x036A82 23:AA72: C3        .byte $C3    ; <バ>
- D - I - 0x036A83 23:AA73: 9D        .byte $9D
- D - I - 0x036A84 23:AA74: CC        .byte $CC    ; <ぽ>
- D - I - 0x036A85 23:AA75: A8        .byte $A8    ; <ぜ>
- D - I - 0x036A86 23:AA76: CC        .byte $CC    ; <ぽ>
- D - I - 0x036A87 23:AA77: B1        .byte $B1    ; <ぶ>
- D - I - 0x036A88 23:AA78: B1        .byte $B1    ; <ぶ>
- D - I - 0x036A89 23:AA79: 88        .byte $88    ; <H>
- D - I - 0x036A8A 23:AA7A: 88        .byte $88    ; <H>
- D - I - 0x036A8B 23:AA7B: 96        .byte $96
- D - I - 0x036A8C 23:AA7C: 96        .byte $96
- D - I - 0x036A8D 23:AA7D: AC        .byte $AC    ; <づ>
- D - I - 0x036A8E 23:AA7E: AC        .byte $AC    ; <づ>
- D - I - 0x036A8F 23:AA7F: DF        .byte $DF
- D - I - 0x036A90 23:AA80: DF        .byte $DF
- D - I - 0x036A91 23:AA81: BA        .byte $BA    ; <ジ>
- D - I - 0x036A92 23:AA82: C6        .byte $C6    ; <ベ>
- D - I - 0x036A93 23:AA83: DC        .byte $DC
- D - I - 0x036A94 23:AA84: DC        .byte $DC
- D - I - 0x036A95 23:AA85: D1        .byte $D1    ; <ポ>
- D - I - 0x036A96 23:AA86: D1        .byte $D1    ; <ポ>
- D - I - 0x036A97 23:AA87: C2        .byte $C2    ; <ド>
- D - I - 0x036A98 23:AA88: E4        .byte $E4
- D - I - 0x036A99 23:AA89: B4        .byte $B4    ; <ガ>
- D - I - 0x036A9A 23:AA8A: E4        .byte $E4
- D - I - 0x036A9B 23:AA8B: BE        .byte $BE    ; <ダ>
- D - I - 0x036A9C 23:AA8C: BE        .byte $BE    ; <ダ>
- D - I - 0x036A9D 23:AA8D: A0        .byte $A0    ; <が>
- D - I - 0x036A9E 23:AA8E: A0        .byte $A0    ; <が>
- D - I - 0x036A9F 23:AA8F: 97        .byte $97
- D - I - 0x036AA0 23:AA90: 97        .byte $97
- D - I - 0x036AA1 23:AA91: D1        .byte $D1    ; <ポ>
- D - I - 0x036AA2 23:AA92: D1        .byte $D1    ; <ポ>
- D - I - 0x036AA3 23:AA93: E0        .byte $E0
- D - I - 0x036AA4 23:AA94: E0        .byte $E0
- D - I - 0x036AA5 23:AA95: D3        .byte $D3
- D - I - 0x036AA6 23:AA96: D3        .byte $D3
- D - I - 0x036AA7 23:AA97: E9        .byte $E9
- D - I - 0x036AA8 23:AA98: E9        .byte $E9
- D - I - 0x036AA9 23:AA99: DE        .byte $DE
- D - I - 0x036AAA 23:AA9A: DE        .byte $DE
- - - - - 0x036AAB 23:AA9B: DC        .byte $DC
- D - I - 0x036AAC 23:AA9C: DC        .byte $DC
- D - I - 0x036AAD 23:AA9D: 0D        .byte $0D    ; <す>
- D - I - 0x036AAE 23:AA9E: 24        .byte $24    ; <や>
- D - I - 0x036AAF 23:AA9F: 16        .byte $16    ; <に>
- D - I - 0x036AB0 23:AAA0: 2F        .byte $2F    ; <っ>
- D - I - 0x036AB1 23:AAA1: 05        .byte $05    ; <お>
- D - I - 0x036AB2 23:AAA2: 0F        .byte $0F    ; <そ>
- D - I - 0x036AB3 23:AAA3: 06        .byte $06    ; <か>
- D - I - 0x036AB4 23:AAA4: 14        .byte $14    ; <と>
- D - I - 0x036AB5 23:AAA5: 35        .byte $35    ; <2>
- D - I - 0x036AB6 23:AAA6: 42        .byte $42    ; <イ>
- D - I - 0x036AB7 23:AAA7: 77        .byte $77    ; <:>
- D - I - 0x036AB8 23:AAA8: 77        .byte $77    ; <:>
- D - I - 0x036AB9 23:AAA9: 2C        .byte $2C    ; <わ>
- D - I - 0x036ABA 23:AAAA: 5C        .byte $5C    ; <フ>
- D - I - 0x036ABB 23:AAAB: 72        .byte $72    ; <ョ>
- D - I - 0x036ABC 23:AAAC: 8B        .byte $8B    ; <K>
- D - I - 0x036ABD 23:AAAD: 58        .byte $58    ; <ネ>
- D - I - 0x036ABE 23:AAAE: 86        .byte $86    ; <F>
- D - I - 0x036ABF 23:AAAF: 33        .byte $33    ; <0>
- D - I - 0x036AC0 23:AAB0: 6C        .byte $6C    ; <ワ>
- D - I - 0x036AC1 23:AAB1: 3C        .byte $3C    ; <9>
- D - I - 0x036AC2 23:AAB2: 6C        .byte $6C    ; <ワ>
- D - I - 0x036AC3 23:AAB3: 47        .byte $47    ; <キ>
- D - I - 0x036AC4 23:AAB4: 52        .byte $52    ; <ツ>
- D - I - 0x036AC5 23:AAB5: 28        .byte $28    ; <り>
- D - I - 0x036AC6 23:AAB6: 32        .byte $32    ; <ょ>
- D - I - 0x036AC7 23:AAB7: 2B        .byte $2B    ; <ろ>
- D - I - 0x036AC8 23:AAB8: 38        .byte $38    ; <5>
- D - I - 0x036AC9 23:AAB9: 7A        .byte $7A    ; <、>
- D - I - 0x036ACA 23:AABA: 72        .byte $72    ; <ョ>
- D - I - 0x036ACB 23:AABB: 8F        .byte $8F    ; <S>
- D - I - 0x036ACC 23:AABC: 8F        .byte $8F    ; <S>
- D - I - 0x036ACD 23:AABD: 5C        .byte $5C    ; <フ>
- D - I - 0x036ACE 23:AABE: 80        .byte $80
- D - I - 0x036ACF 23:AABF: A2        .byte $A2    ; <ぐ>
- D - I - 0x036AD0 23:AAC0: A2        .byte $A2    ; <ぐ>
- D - I - 0x036AD1 23:AAC1: 9E        .byte $9E
- D - I - 0x036AD2 23:AAC2: 88        .byte $88    ; <H>
- D - I - 0x036AD3 23:AAC3: 4B        .byte $4B    ; <サ>
- D - I - 0x036AD4 23:AAC4: 57        .byte $57    ; <ヌ>
- D - I - 0x036AD5 23:AAC5: 78        .byte $78    ; <?>
- D - I - 0x036AD6 23:AAC6: C2        .byte $C2    ; <ド>
- D - I - 0x036AD7 23:AAC7: 77        .byte $77    ; <:>
- D - I - 0x036AD8 23:AAC8: 5E        .byte $5E    ; <ホ>
- D - I - 0x036AD9 23:AAC9: 58        .byte $58    ; <ネ>
- D - I - 0x036ADA 23:AACA: 6F        .byte $6F    ; <ッ>
- D - I - 0x036ADB 23:AACB: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036ADC 23:AACC: 81        .byte $81    ; <A>
- D - I - 0x036ADD 23:AACD: A1        .byte $A1    ; <ぎ>
- D - I - 0x036ADE 23:AACE: AF        .byte $AF    ; <ば>
- D - I - 0x036ADF 23:AACF: CB        .byte $CB    ; <ぺ>
- D - I - 0x036AE0 23:AAD0: CB        .byte $CB    ; <ぺ>
- D - I - 0x036AE1 23:AAD1: 98        .byte $98
- D - I - 0x036AE2 23:AAD2: BD        .byte $BD    ; <ゾ>
- D - I - 0x036AE3 23:AAD3: C6        .byte $C6    ; <ベ>
- D - I - 0x036AE4 23:AAD4: C6        .byte $C6    ; <ベ>
- D - I - 0x036AE5 23:AAD5: AB        .byte $AB    ; <ぢ>
- D - I - 0x036AE6 23:AAD6: D0        .byte $D0    ; <ペ>
- D - I - 0x036AE7 23:AAD7: 92        .byte $92    ; <W>
- D - I - 0x036AE8 23:AAD8: CC        .byte $CC    ; <ぽ>
- D - I - 0x036AE9 23:AAD9: A8        .byte $A8    ; <ぜ>
- D - I - 0x036AEA 23:AADA: D8        .byte $D8
- D - I - 0x036AEB 23:AADB: B3        .byte $B3    ; <ぼ>
- D - I - 0x036AEC 23:AADC: B3        .byte $B3    ; <ぼ>
- D - I - 0x036AED 23:AADD: 7D        .byte $7D    ; <ー>
- D - I - 0x036AEE 23:AADE: 7D        .byte $7D    ; <ー>
- D - I - 0x036AEF 23:AADF: 7F        .byte $7F    ; <,>
- D - I - 0x036AF0 23:AAE0: 7F        .byte $7F    ; <,>
- D - I - 0x036AF1 23:AAE1: C6        .byte $C6    ; <ベ>
- D - I - 0x036AF2 23:AAE2: C6        .byte $C6    ; <ベ>
- D - I - 0x036AF3 23:AAE3: E3        .byte $E3
- D - I - 0x036AF4 23:AAE4: E3        .byte $E3
- D - I - 0x036AF5 23:AAE5: BC        .byte $BC    ; <ゼ>
- D - I - 0x036AF6 23:AAE6: D4        .byte $D4
- D - I - 0x036AF7 23:AAE7: DE        .byte $DE
- D - I - 0x036AF8 23:AAE8: DE        .byte $DE
- D - I - 0x036AF9 23:AAE9: D0        .byte $D0    ; <ペ>
- D - I - 0x036AFA 23:AAEA: DD        .byte $DD
- D - I - 0x036AFB 23:AAEB: C3        .byte $C3    ; <バ>
- D - I - 0x036AFC 23:AAEC: E4        .byte $E4
- D - I - 0x036AFD 23:AAED: A8        .byte $A8    ; <ぜ>
- D - I - 0x036AFE 23:AAEE: D8        .byte $D8
- D - I - 0x036AFF 23:AAEF: B3        .byte $B3    ; <ぼ>
- D - I - 0x036B00 23:AAF0: B3        .byte $B3    ; <ぼ>
- D - I - 0x036B01 23:AAF1: 88        .byte $88    ; <H>
- D - I - 0x036B02 23:AAF2: 88        .byte $88    ; <H>
- D - I - 0x036B03 23:AAF3: 8A        .byte $8A    ; <N>
- D - I - 0x036B04 23:AAF4: 8A        .byte $8A    ; <N>
- D - I - 0x036B05 23:AAF5: C4        .byte $C4    ; <ビ>
- D - I - 0x036B06 23:AAF6: C4        .byte $C4    ; <ビ>
- D - I - 0x036B07 23:AAF7: E2        .byte $E2
- D - I - 0x036B08 23:AAF8: E2        .byte $E2
- D - I - 0x036B09 23:AAF9: DE        .byte $DE
- D - I - 0x036B0A 23:AAFA: DE        .byte $DE
- D - I - 0x036B0B 23:AAFB: EA        .byte $EA
- D - I - 0x036B0C 23:AAFC: EA        .byte $EA
- D - I - 0x036B0D 23:AAFD: E9        .byte $E9
- D - I - 0x036B0E 23:AAFE: E9        .byte $E9
- D - I - 0x036B0F 23:AAFF: D0        .byte $D0    ; <ペ>
- D - I - 0x036B10 23:AB00: D0        .byte $D0    ; <ペ>
- D - I - 0x036B11 23:AB01: 3C        .byte $3C    ; <9>
- D - I - 0x036B12 23:AB02: 1C        .byte $1C    ; <ふ>
- D - I - 0x036B13 23:AB03: 0B        .byte $0B    ; <さ>
- D - I - 0x036B14 23:AB04: 2F        .byte $2F    ; <っ>
- D - I - 0x036B15 23:AB05: 12        .byte $12    ; <つ>
- D - I - 0x036B16 23:AB06: 12        .byte $12    ; <つ>
- D - I - 0x036B17 23:AB07: 08        .byte $08    ; <く>
- D - I - 0x036B18 23:AB08: 20        .byte $20    ; <み>
- D - I - 0x036B19 23:AB09: 37        .byte $37    ; <4>
- D - I - 0x036B1A 23:AB0A: 44        .byte $44    ; <エ>
- D - I - 0x036B1B 23:AB0B: 77        .byte $77    ; <:>
- D - I - 0x036B1C 23:AB0C: 5F        .byte $5F    ; <マ>
- D - I - 0x036B1D 23:AB0D: 46        .byte $46    ; <カ>
- D - I - 0x036B1E 23:AB0E: 69        .byte $69    ; <ル>
- D - I - 0x036B1F 23:AB0F: 7E        .byte $7E    ; <.>
- D - I - 0x036B20 23:AB10: 82        .byte $82    ; <B>
- D - I - 0x036B21 23:AB11: 61        .byte $61    ; <ム>
- D - I - 0x036B22 23:AB12: 70        .byte $70    ; <ャ>
- D - I - 0x036B23 23:AB13: 41        .byte $41    ; <ア>
- D - I - 0x036B24 23:AB14: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036B25 23:AB15: 30        .byte $30    ; <ゃ>
- D - I - 0x036B26 23:AB16: 90        .byte $90    ; <U>
- D - I - 0x036B27 23:AB17: 3B        .byte $3B    ; <8>
- D - I - 0x036B28 23:AB18: 6B        .byte $6B    ; <ロ>
- D - I - 0x036B29 23:AB19: 29        .byte $29    ; <る>
- D - I - 0x036B2A 23:AB1A: 3F        .byte $3F    ; <•>
- D - I - 0x036B2B 23:AB1B: 2B        .byte $2B    ; <ろ>
- D - I - 0x036B2C 23:AB1C: 43        .byte $43    ; <ウ>
- D - I - 0x036B2D 23:AB1D: 65        .byte $65    ; <ユ>
- D - I - 0x036B2E 23:AB1E: 5C        .byte $5C    ; <フ>
- D - I - 0x036B2F 23:AB1F: 9B        .byte $9B
- D - I - 0x036B30 23:AB20: B3        .byte $B3    ; <ぼ>
- D - I - 0x036B31 23:AB21: 8D        .byte $8D    ; <P>
- D - I - 0x036B32 23:AB22: 82        .byte $82    ; <B>
- D - I - 0x036B33 23:AB23: 8A        .byte $8A    ; <N>
- D - I - 0x036B34 23:AB24: B0        .byte $B0    ; <び>
- D - I - 0x036B35 23:AB25: 73        .byte $73    ; <ヮ>
- D - I - 0x036B36 23:AB26: 9F        .byte $9F
- D - I - 0x036B37 23:AB27: 4D        .byte $4D    ; <ス>
- D - I - 0x036B38 23:AB28: 60        .byte $60    ; <ミ>
- D - I - 0x036B39 23:AB29: 6C        .byte $6C    ; <ワ>
- D - I - 0x036B3A 23:AB2A: C0        .byte $C0    ; <ヅ>
- D - I - 0x036B3B 23:AB2B: 6B        .byte $6B    ; <ロ>
- D - I - 0x036B3C 23:AB2C: A7        .byte $A7    ; <ず>
- D - I - 0x036B3D 23:AB2D: 58        .byte $58    ; <ネ>
- D - I - 0x036B3E 23:AB2E: 63        .byte $63    ; <モ>
- D - I - 0x036B3F 23:AB2F: 4F        .byte $4F    ; <ソ>
- D - I - 0x036B40 23:AB30: 73        .byte $73    ; <ヮ>
- D - I - 0x036B41 23:AB31: A2        .byte $A2    ; <ぐ>
- D - I - 0x036B42 23:AB32: 95        .byte $95
- D - I - 0x036B43 23:AB33: CB        .byte $CB    ; <ぺ>
- D - I - 0x036B44 23:AB34: CB        .byte $CB    ; <ぺ>
- D - I - 0x036B45 23:AB35: A5        .byte $A5    ; <ざ>
- D - I - 0x036B46 23:AB36: B0        .byte $B0    ; <び>
- D - I - 0x036B47 23:AB37: C6        .byte $C6    ; <ベ>
- D - I - 0x036B48 23:AB38: C9        .byte $C9    ; <ぴ>
- D - I - 0x036B49 23:AB39: B8        .byte $B8    ; <ゴ>
- D - I - 0x036B4A 23:AB3A: C3        .byte $C3    ; <バ>
- D - I - 0x036B4B 23:AB3B: 7D        .byte $7D    ; <ー>
- D - I - 0x036B4C 23:AB3C: 9D        .byte $9D
- D - I - 0x036B4D 23:AB3D: 85        .byte $85    ; <E>
- D - I - 0x036B4E 23:AB3E: CF        .byte $CF    ; <プ>
- D - I - 0x036B4F 23:AB3F: 9B        .byte $9B
- D - I - 0x036B50 23:AB40: 9B        .byte $9B
- D - I - 0x036B51 23:AB41: 7C        .byte $7C    ; <~>
- D - I - 0x036B52 23:AB42: 93        .byte $93    ; <Y>
- D - I - 0x036B53 23:AB43: 74        .byte $74    ; <ィ>
- D - I - 0x036B54 23:AB44: A4        .byte $A4    ; <ご>
- D - I - 0x036B55 23:AB45: AE        .byte $AE    ; <ど>
- D - I - 0x036B56 23:AB46: C7        .byte $C7    ; <ボ>
- D - I - 0x036B57 23:AB47: EF        .byte $EF
- D - I - 0x036B58 23:AB48: EF        .byte $EF
- D - I - 0x036B59 23:AB49: D5        .byte $D5
- D - I - 0x036B5A 23:AB4A: D5        .byte $D5
- D - I - 0x036B5B 23:AB4B: DE        .byte $DE
- D - I - 0x036B5C 23:AB4C: DE        .byte $DE
- D - I - 0x036B5D 23:AB4D: D1        .byte $D1    ; <ポ>
- D - I - 0x036B5E 23:AB4E: D1        .byte $D1    ; <ポ>
- D - I - 0x036B5F 23:AB4F: B8        .byte $B8    ; <ゴ>
- D - I - 0x036B60 23:AB50: CC        .byte $CC    ; <ぽ>
- D - I - 0x036B61 23:AB51: 9D        .byte $9D
- D - I - 0x036B62 23:AB52: DB        .byte $DB
- D - I - 0x036B63 23:AB53: B3        .byte $B3    ; <ぼ>
- D - I - 0x036B64 23:AB54: B3        .byte $B3    ; <ぼ>
- D - I - 0x036B65 23:AB55: 88        .byte $88    ; <H>
- D - I - 0x036B66 23:AB56: 88        .byte $88    ; <H>
- D - I - 0x036B67 23:AB57: 7F        .byte $7F    ; <,>
- D - I - 0x036B68 23:AB58: 7F        .byte $7F    ; <,>
- D - I - 0x036B69 23:AB59: D0        .byte $D0    ; <ペ>
- D - I - 0x036B6A 23:AB5A: D0        .byte $D0    ; <ペ>
- D - I - 0x036B6B 23:AB5B: DF        .byte $DF
- D - I - 0x036B6C 23:AB5C: DF        .byte $DF
- D - I - 0x036B6D 23:AB5D: D2        .byte $D2
- D - I - 0x036B6E 23:AB5E: D2        .byte $D2
- D - I - 0x036B6F 23:AB5F: EA        .byte $EA
- D - I - 0x036B70 23:AB60: EA        .byte $EA
- D - I - 0x036B71 23:AB61: DD        .byte $DD
- D - I - 0x036B72 23:AB62: DD        .byte $DD
- D - I - 0x036B73 23:AB63: E9        .byte $E9
- D - I - 0x036B74 23:AB64: E9        .byte $E9



tbl_AB65:
- D - - - 0x036B75 23:AB65: 7D AB     .word off_AB7D_00
- D - - - 0x036B77 23:AB67: A9 AC     .word off_ACA9_01
- D - - - 0x036B79 23:AB69: D5 AD     .word off_ADD5_02
- D - - - 0x036B7B 23:AB6B: 01 AF     .word off_AF01_03
- D - - - 0x036B7D 23:AB6D: 2D B0     .word off_B02D_04
- D - - - 0x036B7F 23:AB6F: 59 B1     .word off_B159_05
- D - - - 0x036B81 23:AB71: 85 B2     .word off_B285_06
- D - - - 0x036B83 23:AB73: B1 B3     .word off_B3B1_07
- D - - - 0x036B85 23:AB75: DD B4     .word off_B4DD_08
- D - - - 0x036B87 23:AB77: 09 B6     .word off_B609_09
- D - - - 0x036B89 23:AB79: 35 B7     .word off_B735_0A
- D - - - 0x036B8B 23:AB7B: 61 B8     .word off_B861_0B

off_AB7D_00:
- D - I - 0x036B8D 23:AB7D: F0        .byte $F0
- D - I - 0x036B8E 23:AB7E: F0        .byte $F0
- D - I - 0x036B8F 23:AB7F: 07        .byte $07    ; <き>
- D - I - 0x036B90 23:AB80: 07        .byte $07    ; <き>
- D - I - 0x036B91 23:AB81: 04        .byte $04    ; <え>
- D - I - 0x036B92 23:AB82: 04        .byte $04    ; <え>
- D - I - 0x036B93 23:AB83: F0        .byte $F0
- D - I - 0x036B94 23:AB84: F0        .byte $F0
- D - I - 0x036B95 23:AB85: F0        .byte $F0
- D - I - 0x036B96 23:AB86: 1C        .byte $1C    ; <ふ>
- D - I - 0x036B97 23:AB87: 39        .byte $39    ; <6>
- D - I - 0x036B98 23:AB88: 6A        .byte $6A    ; <レ>
- D - I - 0x036B99 23:AB89: 11        .byte $11    ; <ち>
- D - I - 0x036B9A 23:AB8A: 11        .byte $11    ; <ち>
- D - I - 0x036B9B 23:AB8B: 71        .byte $71    ; <ュ>
- D - I - 0x036B9C 23:AB8C: 5A        .byte $5A    ; <ハ>
- D - I - 0x036B9D 23:AB8D: 1E        .byte $1E    ; <ほ>
- D - I - 0x036B9E 23:AB8E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036B9F 23:AB8F: F0        .byte $F0
- D - I - 0x036BA0 23:AB90: 60        .byte $60    ; <ミ>
- D - I - 0x036BA1 23:AB91: F0        .byte $F0
- D - I - 0x036BA2 23:AB92: F0        .byte $F0
- D - I - 0x036BA3 23:AB93: 06        .byte $06    ; <か>
- D - I - 0x036BA4 23:AB94: 1F        .byte $1F    ; <ま>
- D - I - 0x036BA5 23:AB95: 04        .byte $04    ; <え>
- D - I - 0x036BA6 23:AB96: 1C        .byte $1C    ; <ふ>
- D - I - 0x036BA7 23:AB97: 0F        .byte $0F    ; <そ>
- D - I - 0x036BA8 23:AB98: 24        .byte $24    ; <や>
- D - I - 0x036BA9 23:AB99: F0        .byte $F0
- D - I - 0x036BAA 23:AB9A: 33        .byte $33    ; <0>
- D - I - 0x036BAB 23:AB9B: 76        .byte $76    ; <ォ>
- D - I - 0x036BAC 23:AB9C: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036BAD 23:AB9D: 29        .byte $29    ; <る>
- D - I - 0x036BAE 23:AB9E: 36        .byte $36    ; <3>
- D - I - 0x036BAF 23:AB9F: 7C        .byte $7C    ; <~>
- D - I - 0x036BB0 23:ABA0: 62        .byte $62    ; <メ>
- D - I - 0x036BB1 23:ABA1: 4C        .byte $4C    ; <シ>
- D - I - 0x036BB2 23:ABA2: 66        .byte $66    ; <ヨ>
- D - I - 0x036BB3 23:ABA3: F0        .byte $F0
- D - I - 0x036BB4 23:ABA4: F0        .byte $F0
- D - I - 0x036BB5 23:ABA5: 3E        .byte $3E    ; <Jr>
- D - I - 0x036BB6 23:ABA6: 3C        .byte $3C    ; <9>
- D - I - 0x036BB7 23:ABA7: 1F        .byte $1F    ; <ま>
- D - I - 0x036BB8 23:ABA8: 3A        .byte $3A    ; <7>
- D - I - 0x036BB9 23:ABA9: 35        .byte $35    ; <2>
- D - I - 0x036BBA 23:ABAA: 34        .byte $34    ; <1>
- D - I - 0x036BBB 23:ABAB: 1B        .byte $1B    ; <ひ>
- D - I - 0x036BBC 23:ABAC: 11        .byte $11    ; <ち>
- D - I - 0x036BBD 23:ABAD: F0        .byte $F0
- D - I - 0x036BBE 23:ABAE: 4C        .byte $4C    ; <シ>
- D - I - 0x036BBF 23:ABAF: 69        .byte $69    ; <ル>
- D - I - 0x036BC0 23:ABB0: 8E        .byte $8E    ; <L>
- D - I - 0x036BC1 23:ABB1: 4E        .byte $4E    ; <セ>
- D - I - 0x036BC2 23:ABB2: 8B        .byte $8B    ; <K>
- D - I - 0x036BC3 23:ABB3: 88        .byte $88    ; <H>
- D - I - 0x036BC4 23:ABB4: A2        .byte $A2    ; <ぐ>
- D - I - 0x036BC5 23:ABB5: 63        .byte $63    ; <モ>
- D - I - 0x036BC6 23:ABB6: 71        .byte $71    ; <ュ>
- D - I - 0x036BC7 23:ABB7: F0        .byte $F0
- D - I - 0x036BC8 23:ABB8: F0        .byte $F0
- D - I - 0x036BC9 23:ABB9: 6C        .byte $6C    ; <ワ>
- D - I - 0x036BCA 23:ABBA: 6E        .byte $6E    ; <ン>
- D - I - 0x036BCB 23:ABBB: 36        .byte $36    ; <3>
- D - I - 0x036BCC 23:ABBC: 75        .byte $75    ; <ェ>
- D - I - 0x036BCD 23:ABBD: 4D        .byte $4D    ; <ス>
- D - I - 0x036BCE 23:ABBE: 57        .byte $57    ; <ヌ>
- D - I - 0x036BCF 23:ABBF: 32        .byte $32    ; <ょ>
- D - I - 0x036BD0 23:ABC0: 28        .byte $28    ; <り>
- D - I - 0x036BD1 23:ABC1: 64        .byte $64    ; <ヤ>
- D - I - 0x036BD2 23:ABC2: 90        .byte $90    ; <U>
- D - I - 0x036BD3 23:ABC3: BD        .byte $BD    ; <ゾ>
- D - I - 0x036BD4 23:ABC4: BD        .byte $BD    ; <ゾ>
- D - I - 0x036BD5 23:ABC5: 7E        .byte $7E    ; <.>
- D - I - 0x036BD6 23:ABC6: AE        .byte $AE    ; <ど>
- D - I - 0x036BD7 23:ABC7: C6        .byte $C6    ; <ベ>
- D - I - 0x036BD8 23:ABC8: C6        .byte $C6    ; <ベ>
- D - I - 0x036BD9 23:ABC9: 94        .byte $94
- D - I - 0x036BDA 23:ABCA: B7        .byte $B7    ; <ゲ>
- D - I - 0x036BDB 23:ABCB: F0        .byte $F0
- D - I - 0x036BDC 23:ABCC: F0        .byte $F0
- D - I - 0x036BDD 23:ABCD: 84        .byte $84    ; <D>
- D - I - 0x036BDE 23:ABCE: 6E        .byte $6E    ; <ン>
- D - I - 0x036BDF 23:ABCF: 8B        .byte $8B    ; <K>
- D - I - 0x036BE0 23:ABD0: 74        .byte $74    ; <ィ>
- D - I - 0x036BE1 23:ABD1: 7E        .byte $7E    ; <.>
- D - I - 0x036BE2 23:ABD2: 88        .byte $88    ; <H>
- D - I - 0x036BE3 23:ABD3: 4D        .byte $4D    ; <ス>
- D - I - 0x036BE4 23:ABD4: 65        .byte $65    ; <ユ>
- D - I - 0x036BE5 23:ABD5: F0        .byte $F0
- D - I - 0x036BE6 23:ABD6: F0        .byte $F0
- D - I - 0x036BE7 23:ABD7: D6        .byte $D6
- D - I - 0x036BE8 23:ABD8: D6        .byte $D6
- D - I - 0x036BE9 23:ABD9: C7        .byte $C7    ; <ボ>
- D - I - 0x036BEA 23:ABDA: D4        .byte $D4
- D - I - 0x036BEB 23:ABDB: F0        .byte $F0
- D - I - 0x036BEC 23:ABDC: EA        .byte $EA
- D - I - 0x036BED 23:ABDD: B7        .byte $B7    ; <ゲ>
- D - I - 0x036BEE 23:ABDE: DC        .byte $DC
- D - I - 0x036BEF 23:ABDF: F0        .byte $F0
- D - I - 0x036BF0 23:ABE0: F0        .byte $F0
- D - I - 0x036BF1 23:ABE1: F0        .byte $F0
- D - I - 0x036BF2 23:ABE2: 04        .byte $04    ; <え>
- D - I - 0x036BF3 23:ABE3: F0        .byte $F0
- D - I - 0x036BF4 23:ABE4: 07        .byte $07    ; <き>
- D - I - 0x036BF5 23:ABE5: F0        .byte $F0
- D - I - 0x036BF6 23:ABE6: F0        .byte $F0
- D - I - 0x036BF7 23:ABE7: F0        .byte $F0
- D - I - 0x036BF8 23:ABE8: F0        .byte $F0
- D - I - 0x036BF9 23:ABE9: F0        .byte $F0
- D - I - 0x036BFA 23:ABEA: 1D        .byte $1D    ; <へ>
- D - I - 0x036BFB 23:ABEB: 2E        .byte $2E    ; <ん>
- D - I - 0x036BFC 23:ABEC: 6B        .byte $6B    ; <ロ>
- D - I - 0x036BFD 23:ABED: F0        .byte $F0
- D - I - 0x036BFE 23:ABEE: 12        .byte $12    ; <つ>
- D - I - 0x036BFF 23:ABEF: 4D        .byte $4D    ; <ス>
- D - I - 0x036C00 23:ABF0: 71        .byte $71    ; <ュ>
- D - I - 0x036C01 23:ABF1: F0        .byte $F0
- D - I - 0x036C02 23:ABF2: F0        .byte $F0
- D - I - 0x036C03 23:ABF3: 25        .byte $25    ; <ゆ>
- D - I - 0x036C04 23:ABF4: 60        .byte $60    ; <ミ>
- D - I - 0x036C05 23:ABF5: 03        .byte $03    ; <う>
- D - I - 0x036C06 23:ABF6: 10        .byte $10    ; <た>
- D - I - 0x036C07 23:ABF7: 13        .byte $13    ; <て>
- D - I - 0x036C08 23:ABF8: 08        .byte $08    ; <く>
- D - I - 0x036C09 23:ABF9: F0        .byte $F0
- D - I - 0x036C0A 23:ABFA: 1E        .byte $1E    ; <ほ>
- D - I - 0x036C0B 23:ABFB: F0        .byte $F0
- D - I - 0x036C0C 23:ABFC: 05        .byte $05    ; <お>
- D - I - 0x036C0D 23:ABFD: F0        .byte $F0
- D - I - 0x036C0E 23:ABFE: 28        .byte $28    ; <り>
- D - I - 0x036C0F 23:ABFF: 45        .byte $45    ; <オ>
- D - I - 0x036C10 23:AC00: 77        .byte $77    ; <:>
- D - I - 0x036C11 23:AC01: F0        .byte $F0
- D - I - 0x036C12 23:AC02: 2B        .byte $2B    ; <ろ>
- D - I - 0x036C13 23:AC03: 71        .byte $71    ; <ュ>
- D - I - 0x036C14 23:AC04: 71        .byte $71    ; <ュ>
- D - I - 0x036C15 23:AC05: F0        .byte $F0
- D - I - 0x036C16 23:AC06: F0        .byte $F0
- D - I - 0x036C17 23:AC07: 3E        .byte $3E    ; <Jr>
- D - I - 0x036C18 23:AC08: 6C        .byte $6C    ; <ワ>
- D - I - 0x036C19 23:AC09: 1B        .byte $1B    ; <ひ>
- D - I - 0x036C1A 23:AC0A: 55        .byte $55    ; <ナ>
- D - I - 0x036C1B 23:AC0B: 20        .byte $20    ; <み>
- D - I - 0x036C1C 23:AC0C: 5E        .byte $5E    ; <ホ>
- D - I - 0x036C1D 23:AC0D: 1D        .byte $1D    ; <へ>
- D - I - 0x036C1E 23:AC0E: 35        .byte $35    ; <2>
- D - I - 0x036C1F 23:AC0F: 12        .byte $12    ; <つ>
- D - I - 0x036C20 23:AC10: 12        .byte $12    ; <つ>
- D - I - 0x036C21 23:AC11: F0        .byte $F0
- D - I - 0x036C22 23:AC12: 58        .byte $58    ; <ネ>
- D - I - 0x036C23 23:AC13: 68        .byte $68    ; <リ>
- D - I - 0x036C24 23:AC14: 82        .byte $82    ; <B>
- D - I - 0x036C25 23:AC15: 36        .byte $36    ; <3>
- D - I - 0x036C26 23:AC16: 4F        .byte $4F    ; <ソ>
- D - I - 0x036C27 23:AC17: F0        .byte $F0
- D - I - 0x036C28 23:AC18: F0        .byte $F0
- D - I - 0x036C29 23:AC19: F0        .byte $F0
- D - I - 0x036C2A 23:AC1A: F0        .byte $F0
- D - I - 0x036C2B 23:AC1B: 63        .byte $63    ; <モ>
- D - I - 0x036C2C 23:AC1C: 79        .byte $79    ; <!>
- D - I - 0x036C2D 23:AC1D: 58        .byte $58    ; <ネ>
- D - I - 0x036C2E 23:AC1E: 79        .byte $79    ; <!>
- D - I - 0x036C2F 23:AC1F: 50        .byte $50    ; <タ>
- D - I - 0x036C30 23:AC20: 82        .byte $82    ; <B>
- D - I - 0x036C31 23:AC21: 41        .byte $41    ; <ア>
- D - I - 0x036C32 23:AC22: 5A        .byte $5A    ; <ハ>
- D - I - 0x036C33 23:AC23: 1E        .byte $1E    ; <ほ>
- D - I - 0x036C34 23:AC24: 37        .byte $37    ; <4>
- D - I - 0x036C35 23:AC25: 71        .byte $71    ; <ュ>
- D - I - 0x036C36 23:AC26: 7B        .byte $7B    ; <。>
- D - I - 0x036C37 23:AC27: A5        .byte $A5    ; <ざ>
- D - I - 0x036C38 23:AC28: BE        .byte $BE    ; <ダ>
- D - I - 0x036C39 23:AC29: 73        .byte $73    ; <ヮ>
- D - I - 0x036C3A 23:AC2A: 80        .byte $80
- D - I - 0x036C3B 23:AC2B: F0        .byte $F0
- D - I - 0x036C3C 23:AC2C: F0        .byte $F0
- D - I - 0x036C3D 23:AC2D: 96        .byte $96
- D - I - 0x036C3E 23:AC2E: 96        .byte $96
- D - I - 0x036C3F 23:AC2F: 9E        .byte $9E
- D - I - 0x036C40 23:AC30: B5        .byte $B5    ; <ギ>
- D - I - 0x036C41 23:AC31: 9D        .byte $9D
- D - I - 0x036C42 23:AC32: 6E        .byte $6E    ; <ン>
- D - I - 0x036C43 23:AC33: 75        .byte $75    ; <ェ>
- D - I - 0x036C44 23:AC34: A6        .byte $A6    ; <じ>
- D - I - 0x036C45 23:AC35: 70        .byte $70    ; <ャ>
- D - I - 0x036C46 23:AC36: 89        .byte $89    ; <I>
- D - I - 0x036C47 23:AC37: 4F        .byte $4F    ; <ソ>
- D - I - 0x036C48 23:AC38: 66        .byte $66    ; <ヨ>
- D - I - 0x036C49 23:AC39: 94        .byte $94
- D - I - 0x036C4A 23:AC3A: B6        .byte $B6    ; <グ>
- D - I - 0x036C4B 23:AC3B: D6        .byte $D6
- D - I - 0x036C4C 23:AC3C: ED        .byte $ED
- D - I - 0x036C4D 23:AC3D: A2        .byte $A2    ; <ぐ>
- D - I - 0x036C4E 23:AC3E: 8B        .byte $8B    ; <K>
- D - I - 0x036C4F 23:AC3F: F0        .byte $F0
- D - I - 0x036C50 23:AC40: F0        .byte $F0
- D - I - 0x036C51 23:AC41: F0        .byte $F0
- D - I - 0x036C52 23:AC42: F0        .byte $F0
- D - I - 0x036C53 23:AC43: E6        .byte $E6
- D - I - 0x036C54 23:AC44: CD        .byte $CD    ; <パ>
- D - I - 0x036C55 23:AC45: 04        .byte $04    ; <え>
- D - I - 0x036C56 23:AC46: 04        .byte $04    ; <え>
- D - I - 0x036C57 23:AC47: F0        .byte $F0
- D - I - 0x036C58 23:AC48: F0        .byte $F0
- D - I - 0x036C59 23:AC49: 07        .byte $07    ; <き>
- D - I - 0x036C5A 23:AC4A: 07        .byte $07    ; <き>
- D - I - 0x036C5B 23:AC4B: F0        .byte $F0
- D - I - 0x036C5C 23:AC4C: F0        .byte $F0
- D - I - 0x036C5D 23:AC4D: 12        .byte $12    ; <つ>
- D - I - 0x036C5E 23:AC4E: 12        .byte $12    ; <つ>
- D - I - 0x036C5F 23:AC4F: F0        .byte $F0
- D - I - 0x036C60 23:AC50: 6B        .byte $6B    ; <ロ>
- D - I - 0x036C61 23:AC51: F0        .byte $F0
- D - I - 0x036C62 23:AC52: 1F        .byte $1F    ; <ま>
- D - I - 0x036C63 23:AC53: 59        .byte $59    ; <ノ>
- D - I - 0x036C64 23:AC54: 72        .byte $72    ; <ョ>
- D - I - 0x036C65 23:AC55: 1D        .byte $1D    ; <へ>
- D - I - 0x036C66 23:AC56: 1D        .byte $1D    ; <へ>
- D - I - 0x036C67 23:AC57: 32        .byte $32    ; <ょ>
- D - I - 0x036C68 23:AC58: 61        .byte $61    ; <ム>
- D - I - 0x036C69 23:AC59: 3C        .byte $3C    ; <9>
- D - I - 0x036C6A 23:AC5A: 1C        .byte $1C    ; <ふ>
- D - I - 0x036C6B 23:AC5B: F0        .byte $F0
- D - I - 0x036C6C 23:AC5C: F0        .byte $F0
- D - I - 0x036C6D 23:AC5D: 07        .byte $07    ; <き>
- D - I - 0x036C6E 23:AC5E: 1F        .byte $1F    ; <ま>
- D - I - 0x036C6F 23:AC5F: 14        .byte $14    ; <と>
- D - I - 0x036C70 23:AC60: 2F        .byte $2F    ; <っ>
- D - I - 0x036C71 23:AC61: 2A        .byte $2A    ; <れ>
- D - I - 0x036C72 23:AC62: 34        .byte $34    ; <1>
- D - I - 0x036C73 23:AC63: F0        .byte $F0
- D - I - 0x036C74 23:AC64: F0        .byte $F0
- D - I - 0x036C75 23:AC65: F0        .byte $F0
- D - I - 0x036C76 23:AC66: 38        .byte $38    ; <5>
- D - I - 0x036C77 23:AC67: 7F        .byte $7F    ; <,>
- D - I - 0x036C78 23:AC68: 69        .byte $69    ; <ル>
- D - I - 0x036C79 23:AC69: 4F        .byte $4F    ; <ソ>
- D - I - 0x036C7A 23:AC6A: 66        .byte $66    ; <ヨ>
- D - I - 0x036C7B 23:AC6B: 6D        .byte $6D    ; <ヲ>
- D - I - 0x036C7C 23:AC6C: 56        .byte $56    ; <ニ>
- D - I - 0x036C7D 23:AC6D: 1C        .byte $1C    ; <ふ>
- D - I - 0x036C7E 23:AC6E: 31        .byte $31    ; <ゅ>
- D - I - 0x036C7F 23:AC6F: 45        .byte $45    ; <オ>
- D - I - 0x036C80 23:AC70: 47        .byte $47    ; <キ>
- D - I - 0x036C81 23:AC71: 2A        .byte $2A    ; <れ>
- D - I - 0x036C82 23:AC72: 37        .byte $37    ; <4>
- D - I - 0x036C83 23:AC73: 12        .byte $12    ; <つ>
- D - I - 0x036C84 23:AC74: 20        .byte $20    ; <み>
- D - I - 0x036C85 23:AC75: 4D        .byte $4D    ; <ス>
- D - I - 0x036C86 23:AC76: 88        .byte $88    ; <H>
- D - I - 0x036C87 23:AC77: F0        .byte $F0
- D - I - 0x036C88 23:AC78: F0        .byte $F0
- D - I - 0x036C89 23:AC79: F0        .byte $F0
- D - I - 0x036C8A 23:AC7A: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036C8B 23:AC7B: 8B        .byte $8B    ; <K>
- D - I - 0x036C8C 23:AC7C: A1        .byte $A1    ; <ぎ>
- D - I - 0x036C8D 23:AC7D: 4F        .byte $4F    ; <ソ>
- D - I - 0x036C8E 23:AC7E: 68        .byte $68    ; <リ>
- D - I - 0x036C8F 23:AC7F: 62        .byte $62    ; <メ>
- D - I - 0x036C90 23:AC80: 85        .byte $85    ; <E>
- D - I - 0x036C91 23:AC81: 35        .byte $35    ; <2>
- D - I - 0x036C92 23:AC82: 6E        .byte $6E    ; <ン>
- D - I - 0x036C93 23:AC83: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036C94 23:AC84: 8F        .byte $8F    ; <S>
- D - I - 0x036C95 23:AC85: 4E        .byte $4E    ; <セ>
- D - I - 0x036C96 23:AC86: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036C97 23:AC87: 2B        .byte $2B    ; <ろ>
- D - I - 0x036C98 23:AC88: 38        .byte $38    ; <5>
- D - I - 0x036C99 23:AC89: 65        .byte $65    ; <ユ>
- D - I - 0x036C9A 23:AC8A: AD        .byte $AD    ; <で>
- D - I - 0x036C9B 23:AC8B: F0        .byte $F0
- D - I - 0x036C9C 23:AC8C: F0        .byte $F0
- D - I - 0x036C9D 23:AC8D: 8C        .byte $8C    ; <M>
- D - I - 0x036C9E 23:AC8E: 81        .byte $81    ; <A>
- D - I - 0x036C9F 23:AC8F: C4        .byte $C4    ; <ビ>
- D - I - 0x036CA0 23:AC90: C4        .byte $C4    ; <ビ>
- D - I - 0x036CA1 23:AC91: AF        .byte $AF    ; <ば>
- D - I - 0x036CA2 23:AC92: C8        .byte $C8    ; <ぱ>
- D - I - 0x036CA3 23:AC93: 91        .byte $91    ; <V>
- D - I - 0x036CA4 23:AC94: B6        .byte $B6    ; <グ>
- D - I - 0x036CA5 23:AC95: 6F        .byte $6F    ; <ッ>
- D - I - 0x036CA6 23:AC96: 91        .byte $91    ; <V>
- D - I - 0x036CA7 23:AC97: 75        .byte $75    ; <ェ>
- D - I - 0x036CA8 23:AC98: 8F        .byte $8F    ; <S>
- D - I - 0x036CA9 23:AC99: 7D        .byte $7D    ; <ー>
- D - I - 0x036CAA 23:AC9A: 8B        .byte $8B    ; <K>
- D - I - 0x036CAB 23:AC9B: 5A        .byte $5A    ; <ハ>
- D - I - 0x036CAC 23:AC9C: 50        .byte $50    ; <タ>
- D - I - 0x036CAD 23:AC9D: C4        .byte $C4    ; <ビ>
- D - I - 0x036CAE 23:AC9E: D0        .byte $D0    ; <ペ>
- D - I - 0x036CAF 23:AC9F: F0        .byte $F0
- D - I - 0x036CB0 23:ACA0: F0        .byte $F0
- D - I - 0x036CB1 23:ACA1: F0        .byte $F0
- D - I - 0x036CB2 23:ACA2: F0        .byte $F0
- D - I - 0x036CB3 23:ACA3: F0        .byte $F0
- D - I - 0x036CB4 23:ACA4: E9        .byte $E9
- D - I - 0x036CB5 23:ACA5: BC        .byte $BC    ; <ゼ>
- D - I - 0x036CB6 23:ACA6: DF        .byte $DF
- D - I - 0x036CB7 23:ACA7: CD        .byte $CD    ; <パ>
- D - I - 0x036CB8 23:ACA8: CD        .byte $CD    ; <パ>
off_ACA9_01:
- D - I - 0x036CB9 23:ACA9: F0        .byte $F0
- D - I - 0x036CBA 23:ACAA: F0        .byte $F0
- D - I - 0x036CBB 23:ACAB: 07        .byte $07    ; <き>
- D - I - 0x036CBC 23:ACAC: 07        .byte $07    ; <き>
- D - I - 0x036CBD 23:ACAD: 04        .byte $04    ; <え>
- D - I - 0x036CBE 23:ACAE: 04        .byte $04    ; <え>
- D - I - 0x036CBF 23:ACAF: F0        .byte $F0
- D - I - 0x036CC0 23:ACB0: F0        .byte $F0
- D - I - 0x036CC1 23:ACB1: F0        .byte $F0
- D - I - 0x036CC2 23:ACB2: 1C        .byte $1C    ; <ふ>
- D - I - 0x036CC3 23:ACB3: 21        .byte $21    ; <む>
- D - I - 0x036CC4 23:ACB4: 16        .byte $16    ; <に>
- D - I - 0x036CC5 23:ACB5: 11        .byte $11    ; <ち>
- D - I - 0x036CC6 23:ACB6: 11        .byte $11    ; <ち>
- D - I - 0x036CC7 23:ACB7: 40        .byte $40    ; <「>
- D - I - 0x036CC8 23:ACB8: 65        .byte $65    ; <ユ>
- D - I - 0x036CC9 23:ACB9: 1E        .byte $1E    ; <ほ>
- D - I - 0x036CCA 23:ACBA: 1E        .byte $1E    ; <ほ>
- D - I - 0x036CCB 23:ACBB: F0        .byte $F0
- D - I - 0x036CCC 23:ACBC: F0        .byte $F0
- D - I - 0x036CCD 23:ACBD: F0        .byte $F0
- D - I - 0x036CCE 23:ACBE: F0        .byte $F0
- D - I - 0x036CCF 23:ACBF: 06        .byte $06    ; <か>
- D - I - 0x036CD0 23:ACC0: 1F        .byte $1F    ; <ま>
- D - I - 0x036CD1 23:ACC1: 1C        .byte $1C    ; <ふ>
- D - I - 0x036CD2 23:ACC2: 05        .byte $05    ; <お>
- D - I - 0x036CD3 23:ACC3: F0        .byte $F0
- D - I - 0x036CD4 23:ACC4: 0F        .byte $0F    ; <そ>
- D - I - 0x036CD5 23:ACC5: F0        .byte $F0
- D - I - 0x036CD6 23:ACC6: 26        .byte $26    ; <よ>
- D - I - 0x036CD7 23:ACC7: 45        .byte $45    ; <オ>
- D - I - 0x036CD8 23:ACC8: 76        .byte $76    ; <ォ>
- D - I - 0x036CD9 23:ACC9: F0        .byte $F0
- D - I - 0x036CDA 23:ACCA: 29        .byte $29    ; <る>
- D - I - 0x036CDB 23:ACCB: F0        .byte $F0
- D - I - 0x036CDC 23:ACCC: F0        .byte $F0
- D - I - 0x036CDD 23:ACCD: F0        .byte $F0
- D - I - 0x036CDE 23:ACCE: 33        .byte $33    ; <0>
- D - I - 0x036CDF 23:ACCF: F0        .byte $F0
- D - I - 0x036CE0 23:ACD0: F0        .byte $F0
- D - I - 0x036CE1 23:ACD1: F0        .byte $F0
- D - I - 0x036CE2 23:ACD2: 3C        .byte $3C    ; <9>
- D - I - 0x036CE3 23:ACD3: 1D        .byte $1D    ; <へ>
- D - I - 0x036CE4 23:ACD4: 4E        .byte $4E    ; <セ>
- D - I - 0x036CE5 23:ACD5: 34        .byte $34    ; <1>
- D - I - 0x036CE6 23:ACD6: 35        .byte $35    ; <2>
- D - I - 0x036CE7 23:ACD7: 25        .byte $25    ; <ゆ>
- D - I - 0x036CE8 23:ACD8: 1B        .byte $1B    ; <ひ>
- D - I - 0x036CE9 23:ACD9: F0        .byte $F0
- D - I - 0x036CEA 23:ACDA: 3E        .byte $3E    ; <Jr>
- D - I - 0x036CEB 23:ACDB: 51        .byte $51    ; <チ>
- D - I - 0x036CEC 23:ACDC: 8E        .byte $8E    ; <L>
- D - I - 0x036CED 23:ACDD: F0        .byte $F0
- D - I - 0x036CEE 23:ACDE: 4C        .byte $4C    ; <シ>
- D - I - 0x036CEF 23:ACDF: F0        .byte $F0
- D - I - 0x036CF0 23:ACE0: F0        .byte $F0
- D - I - 0x036CF1 23:ACE1: F0        .byte $F0
- D - I - 0x036CF2 23:ACE2: 63        .byte $63    ; <モ>
- D - I - 0x036CF3 23:ACE3: F0        .byte $F0
- D - I - 0x036CF4 23:ACE4: F0        .byte $F0
- D - I - 0x036CF5 23:ACE5: 6C        .byte $6C    ; <ワ>
- D - I - 0x036CF6 23:ACE6: 6E        .byte $6E    ; <ン>
- D - I - 0x036CF7 23:ACE7: 72        .byte $72    ; <ョ>
- D - I - 0x036CF8 23:ACE8: 36        .byte $36    ; <3>
- D - I - 0x036CF9 23:ACE9: 57        .byte $57    ; <ヌ>
- D - I - 0x036CFA 23:ACEA: 4D        .byte $4D    ; <ス>
- D - I - 0x036CFB 23:ACEB: 3E        .byte $3E    ; <Jr>
- D - I - 0x036CFC 23:ACEC: 28        .byte $28    ; <り>
- D - I - 0x036CFD 23:ACED: F0        .byte $F0
- D - I - 0x036CFE 23:ACEE: F0        .byte $F0
- D - I - 0x036CFF 23:ACEF: 80        .byte $80
- D - I - 0x036D00 23:ACF0: BD        .byte $BD    ; <ゾ>
- D - I - 0x036D01 23:ACF1: 70        .byte $70    ; <ャ>
- D - I - 0x036D02 23:ACF2: 7D        .byte $7D    ; <ー>
- D - I - 0x036D03 23:ACF3: F0        .byte $F0
- D - I - 0x036D04 23:ACF4: 79        .byte $79    ; <!>
- D - I - 0x036D05 23:ACF5: F0        .byte $F0
- D - I - 0x036D06 23:ACF6: 87        .byte $87    ; <G>
- D - I - 0x036D07 23:ACF7: F0        .byte $F0
- D - I - 0x036D08 23:ACF8: F0        .byte $F0
- D - I - 0x036D09 23:ACF9: 84        .byte $84    ; <D>
- D - I - 0x036D0A 23:ACFA: 6E        .byte $6E    ; <ン>
- D - I - 0x036D0B 23:ACFB: 66        .byte $66    ; <ヨ>
- D - I - 0x036D0C 23:ACFC: A3        .byte $A3    ; <げ>
- D - I - 0x036D0D 23:ACFD: 87        .byte $87    ; <G>
- D - I - 0x036D0E 23:ACFE: 70        .byte $70    ; <ャ>
- D - I - 0x036D0F 23:ACFF: 57        .byte $57    ; <ヌ>
- D - I - 0x036D10 23:AD00: 4D        .byte $4D    ; <ス>
- D - I - 0x036D11 23:AD01: F0        .byte $F0
- D - I - 0x036D12 23:AD02: 91        .byte $91    ; <V>
- D - I - 0x036D13 23:AD03: 81        .byte $81    ; <A>
- D - I - 0x036D14 23:AD04: D6        .byte $D6
- D - I - 0x036D15 23:AD05: A0        .byte $A0    ; <が>
- D - I - 0x036D16 23:AD06: C5        .byte $C5    ; <ブ>
- D - I - 0x036D17 23:AD07: F0        .byte $F0
- D - I - 0x036D18 23:AD08: F0        .byte $F0
- D - I - 0x036D19 23:AD09: F0        .byte $F0
- D - I - 0x036D1A 23:AD0A: AA        .byte $AA    ; <だ>
- D - I - 0x036D1B 23:AD0B: F0        .byte $F0
- D - I - 0x036D1C 23:AD0C: F0        .byte $F0
- D - I - 0x036D1D 23:AD0D: F0        .byte $F0
- D - I - 0x036D1E 23:AD0E: 04        .byte $04    ; <え>
- D - I - 0x036D1F 23:AD0F: F0        .byte $F0
- D - I - 0x036D20 23:AD10: 07        .byte $07    ; <き>
- D - I - 0x036D21 23:AD11: F0        .byte $F0
- D - I - 0x036D22 23:AD12: F0        .byte $F0
- D - I - 0x036D23 23:AD13: F0        .byte $F0
- D - I - 0x036D24 23:AD14: F0        .byte $F0
- D - I - 0x036D25 23:AD15: F0        .byte $F0
- D - I - 0x036D26 23:AD16: 1D        .byte $1D    ; <へ>
- D - I - 0x036D27 23:AD17: 2D        .byte $2D    ; <を>
- D - I - 0x036D28 23:AD18: 5E        .byte $5E    ; <ホ>
- D - I - 0x036D29 23:AD19: F0        .byte $F0
- D - I - 0x036D2A 23:AD1A: 12        .byte $12    ; <つ>
- D - I - 0x036D2B 23:AD1B: 41        .byte $41    ; <ア>
- D - I - 0x036D2C 23:AD1C: 71        .byte $71    ; <ュ>
- D - I - 0x036D2D 23:AD1D: F0        .byte $F0
- D - I - 0x036D2E 23:AD1E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036D2F 23:AD1F: 26        .byte $26    ; <よ>
- D - I - 0x036D30 23:AD20: 55        .byte $55    ; <ナ>
- D - I - 0x036D31 23:AD21: 10        .byte $10    ; <た>
- D - I - 0x036D32 23:AD22: 03        .byte $03    ; <う>
- D - I - 0x036D33 23:AD23: 13        .byte $13    ; <て>
- D - I - 0x036D34 23:AD24: 08        .byte $08    ; <く>
- D - I - 0x036D35 23:AD25: F0        .byte $F0
- D - I - 0x036D36 23:AD26: F0        .byte $F0
- D - I - 0x036D37 23:AD27: F0        .byte $F0
- D - I - 0x036D38 23:AD28: 05        .byte $05    ; <お>
- D - I - 0x036D39 23:AD29: F0        .byte $F0
- D - I - 0x036D3A 23:AD2A: 28        .byte $28    ; <り>
- D - I - 0x036D3B 23:AD2B: F0        .byte $F0
- D - I - 0x036D3C 23:AD2C: 5E        .byte $5E    ; <ホ>
- D - I - 0x036D3D 23:AD2D: F0        .byte $F0
- D - I - 0x036D3E 23:AD2E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036D3F 23:AD2F: F0        .byte $F0
- D - I - 0x036D40 23:AD30: 65        .byte $65    ; <ユ>
- D - I - 0x036D41 23:AD31: F0        .byte $F0
- D - I - 0x036D42 23:AD32: F0        .byte $F0
- D - I - 0x036D43 23:AD33: F0        .byte $F0
- D - I - 0x036D44 23:AD34: 55        .byte $55    ; <ナ>
- D - I - 0x036D45 23:AD35: 1B        .byte $1B    ; <ひ>
- D - I - 0x036D46 23:AD36: 55        .byte $55    ; <ナ>
- D - I - 0x036D47 23:AD37: 2B        .byte $2B    ; <ろ>
- D - I - 0x036D48 23:AD38: 5E        .byte $5E    ; <ホ>
- D - I - 0x036D49 23:AD39: F0        .byte $F0
- D - I - 0x036D4A 23:AD3A: 36        .byte $36    ; <3>
- D - I - 0x036D4B 23:AD3B: 1D        .byte $1D    ; <へ>
- D - I - 0x036D4C 23:AD3C: 12        .byte $12    ; <つ>
- D - I - 0x036D4D 23:AD3D: 35        .byte $35    ; <2>
- D - I - 0x036D4E 23:AD3E: 4B        .byte $4B    ; <サ>
- D - I - 0x036D4F 23:AD3F: F0        .byte $F0
- D - I - 0x036D50 23:AD40: 68        .byte $68    ; <リ>
- D - I - 0x036D51 23:AD41: 4F        .byte $4F    ; <ソ>
- D - I - 0x036D52 23:AD42: 59        .byte $59    ; <ノ>
- D - I - 0x036D53 23:AD43: F0        .byte $F0
- D - I - 0x036D54 23:AD44: 8A        .byte $8A    ; <N>
- D - I - 0x036D55 23:AD45: F0        .byte $F0
- D - I - 0x036D56 23:AD46: F0        .byte $F0
- D - I - 0x036D57 23:AD47: F0        .byte $F0
- D - I - 0x036D58 23:AD48: 63        .byte $63    ; <モ>
- D - I - 0x036D59 23:AD49: 57        .byte $57    ; <ヌ>
- D - I - 0x036D5A 23:AD4A: 85        .byte $85    ; <E>
- D - I - 0x036D5B 23:AD4B: 50        .byte $50    ; <タ>
- D - I - 0x036D5C 23:AD4C: 82        .byte $82    ; <B>
- D - I - 0x036D5D 23:AD4D: 40        .byte $40    ; <「>
- D - I - 0x036D5E 23:AD4E: 59        .byte $59    ; <ノ>
- D - I - 0x036D5F 23:AD4F: 36        .byte $36    ; <3>
- D - I - 0x036D60 23:AD50: 2A        .byte $2A    ; <れ>
- D - I - 0x036D61 23:AD51: 70        .byte $70    ; <ャ>
- D - I - 0x036D62 23:AD52: 73        .byte $73    ; <ヮ>
- D - I - 0x036D63 23:AD53: F0        .byte $F0
- D - I - 0x036D64 23:AD54: A4        .byte $A4    ; <ご>
- D - I - 0x036D65 23:AD55: F0        .byte $F0
- D - I - 0x036D66 23:AD56: 8B        .byte $8B    ; <K>
- D - I - 0x036D67 23:AD57: F0        .byte $F0
- D - I - 0x036D68 23:AD58: F0        .byte $F0
- D - I - 0x036D69 23:AD59: F0        .byte $F0
- D - I - 0x036D6A 23:AD5A: 89        .byte $89    ; <I>
- D - I - 0x036D6B 23:AD5B: F0        .byte $F0
- D - I - 0x036D6C 23:AD5C: 9F        .byte $9F
- D - I - 0x036D6D 23:AD5D: 91        .byte $91    ; <V>
- D - I - 0x036D6E 23:AD5E: 6E        .byte $6E    ; <ン>
- D - I - 0x036D6F 23:AD5F: 74        .byte $74    ; <ィ>
- D - I - 0x036D70 23:AD60: 9A        .byte $9A
- D - I - 0x036D71 23:AD61: 70        .byte $70    ; <ャ>
- D - I - 0x036D72 23:AD62: 89        .byte $89    ; <I>
- D - I - 0x036D73 23:AD63: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036D74 23:AD64: 66        .byte $66    ; <ヨ>
- D - I - 0x036D75 23:AD65: 87        .byte $87    ; <G>
- D - I - 0x036D76 23:AD66: 8B        .byte $8B    ; <K>
- D - I - 0x036D77 23:AD67: F0        .byte $F0
- D - I - 0x036D78 23:AD68: B1        .byte $B1    ; <ぶ>
- D - I - 0x036D79 23:AD69: F0        .byte $F0
- D - I - 0x036D7A 23:AD6A: A2        .byte $A2    ; <ぐ>
- D - I - 0x036D7B 23:AD6B: F0        .byte $F0
- D - I - 0x036D7C 23:AD6C: F0        .byte $F0
- D - I - 0x036D7D 23:AD6D: F0        .byte $F0
- D - I - 0x036D7E 23:AD6E: F0        .byte $F0
- D - I - 0x036D7F 23:AD6F: F0        .byte $F0
- D - I - 0x036D80 23:AD70: AA        .byte $AA    ; <だ>
- D - I - 0x036D81 23:AD71: 04        .byte $04    ; <え>
- D - I - 0x036D82 23:AD72: 04        .byte $04    ; <え>
- D - I - 0x036D83 23:AD73: F0        .byte $F0
- D - I - 0x036D84 23:AD74: F0        .byte $F0
- D - I - 0x036D85 23:AD75: 07        .byte $07    ; <き>
- D - I - 0x036D86 23:AD76: 07        .byte $07    ; <き>
- D - I - 0x036D87 23:AD77: F0        .byte $F0
- D - I - 0x036D88 23:AD78: F0        .byte $F0
- D - I - 0x036D89 23:AD79: 12        .byte $12    ; <つ>
- D - I - 0x036D8A 23:AD7A: 12        .byte $12    ; <つ>
- D - I - 0x036D8B 23:AD7B: F0        .byte $F0
- D - I - 0x036D8C 23:AD7C: F0        .byte $F0
- D - I - 0x036D8D 23:AD7D: F0        .byte $F0
- D - I - 0x036D8E 23:AD7E: 1F        .byte $1F    ; <ま>
- D - I - 0x036D8F 23:AD7F: 66        .byte $66    ; <ヨ>
- D - I - 0x036D90 23:AD80: 43        .byte $43    ; <ウ>
- D - I - 0x036D91 23:AD81: 1D        .byte $1D    ; <へ>
- D - I - 0x036D92 23:AD82: 1D        .byte $1D    ; <へ>
- D - I - 0x036D93 23:AD83: 0D        .byte $0D    ; <す>
- D - I - 0x036D94 23:AD84: 1A        .byte $1A    ; <は>
- D - I - 0x036D95 23:AD85: 1C        .byte $1C    ; <ふ>
- D - I - 0x036D96 23:AD86: 05        .byte $05    ; <お>
- D - I - 0x036D97 23:AD87: F0        .byte $F0
- D - I - 0x036D98 23:AD88: F0        .byte $F0
- D - I - 0x036D99 23:AD89: 06        .byte $06    ; <か>
- D - I - 0x036D9A 23:AD8A: 1F        .byte $1F    ; <ま>
- D - I - 0x036D9B 23:AD8B: F0        .byte $F0
- D - I - 0x036D9C 23:AD8C: 14        .byte $14    ; <と>
- D - I - 0x036D9D 23:AD8D: F0        .byte $F0
- D - I - 0x036D9E 23:AD8E: 2A        .byte $2A    ; <れ>
- D - I - 0x036D9F 23:AD8F: F0        .byte $F0
- D - I - 0x036DA0 23:AD90: F0        .byte $F0
- D - I - 0x036DA1 23:AD91: F0        .byte $F0
- D - I - 0x036DA2 23:AD92: 38        .byte $38    ; <5>
- D - I - 0x036DA3 23:AD93: F0        .byte $F0
- D - I - 0x036DA4 23:AD94: F0        .byte $F0
- D - I - 0x036DA5 23:AD95: F0        .byte $F0
- D - I - 0x036DA6 23:AD96: 2B        .byte $2B    ; <ろ>
- D - I - 0x036DA7 23:AD97: 3F        .byte $3F    ; <•>
- D - I - 0x036DA8 23:AD98: 6D        .byte $6D    ; <ヲ>
- D - I - 0x036DA9 23:AD99: 4D        .byte $4D    ; <ス>
- D - I - 0x036DAA 23:AD9A: 1E        .byte $1E    ; <ほ>
- D - I - 0x036DAB 23:AD9B: F0        .byte $F0
- D - I - 0x036DAC 23:AD9C: 47        .byte $47    ; <キ>
- D - I - 0x036DAD 23:AD9D: 37        .byte $37    ; <4>
- D - I - 0x036DAE 23:AD9E: 36        .byte $36    ; <3>
- D - I - 0x036DAF 23:AD9F: 20        .byte $20    ; <み>
- D - I - 0x036DB0 23:ADA0: 2E        .byte $2E    ; <ん>
- D - I - 0x036DB1 23:ADA1: F0        .byte $F0
- D - I - 0x036DB2 23:ADA2: 4F        .byte $4F    ; <ソ>
- D - I - 0x036DB3 23:ADA3: F0        .byte $F0
- D - I - 0x036DB4 23:ADA4: 45        .byte $45    ; <オ>
- D - I - 0x036DB5 23:ADA5: F0        .byte $F0
- D - I - 0x036DB6 23:ADA6: 44        .byte $44    ; <エ>
- D - I - 0x036DB7 23:ADA7: F0        .byte $F0
- D - I - 0x036DB8 23:ADA8: F0        .byte $F0
- D - I - 0x036DB9 23:ADA9: F0        .byte $F0
- D - I - 0x036DBA 23:ADAA: F0        .byte $F0
- D - I - 0x036DBB 23:ADAB: 85        .byte $85    ; <E>
- D - I - 0x036DBC 23:ADAC: 4A        .byte $4A    ; <コ>
- D - I - 0x036DBD 23:ADAD: 34        .byte $34    ; <1>
- D - I - 0x036DBE 23:ADAE: 65        .byte $65    ; <ユ>
- D - I - 0x036DBF 23:ADAF: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036DC0 23:ADB0: 8F        .byte $8F    ; <S>
- D - I - 0x036DC1 23:ADB1: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036DC2 23:ADB2: 42        .byte $42    ; <イ>
- D - I - 0x036DC3 23:ADB3: 2A        .byte $2A    ; <れ>
- D - I - 0x036DC4 23:ADB4: 46        .byte $46    ; <カ>
- D - I - 0x036DC5 23:ADB5: 7E        .byte $7E    ; <.>
- D - I - 0x036DC6 23:ADB6: 72        .byte $72    ; <ョ>
- D - I - 0x036DC7 23:ADB7: F0        .byte $F0
- D - I - 0x036DC8 23:ADB8: F0        .byte $F0
- D - I - 0x036DC9 23:ADB9: F0        .byte $F0
- D - I - 0x036DCA 23:ADBA: 6A        .byte $6A    ; <レ>
- D - I - 0x036DCB 23:ADBB: F0        .byte $F0
- D - I - 0x036DCC 23:ADBC: F0        .byte $F0
- D - I - 0x036DCD 23:ADBD: F0        .byte $F0
- D - I - 0x036DCE 23:ADBE: 74        .byte $74    ; <ィ>
- D - I - 0x036DCF 23:ADBF: 7B        .byte $7B    ; <。>
- D - I - 0x036DD0 23:ADC0: B6        .byte $B6    ; <グ>
- D - I - 0x036DD1 23:ADC1: 65        .byte $65    ; <ユ>
- D - I - 0x036DD2 23:ADC2: 88        .byte $88    ; <H>
- D - I - 0x036DD3 23:ADC3: 75        .byte $75    ; <ェ>
- D - I - 0x036DD4 23:ADC4: 8F        .byte $8F    ; <S>
- D - I - 0x036DD5 23:ADC5: 8B        .byte $8B    ; <K>
- D - I - 0x036DD6 23:ADC6: 73        .byte $73    ; <ヮ>
- D - I - 0x036DD7 23:ADC7: 4E        .byte $4E    ; <セ>
- D - I - 0x036DD8 23:ADC8: 5C        .byte $5C    ; <フ>
- D - I - 0x036DD9 23:ADC9: C6        .byte $C6    ; <ベ>
- D - I - 0x036DDA 23:ADCA: 96        .byte $96
- D - I - 0x036DDB 23:ADCB: F0        .byte $F0
- D - I - 0x036DDC 23:ADCC: F0        .byte $F0
- D - I - 0x036DDD 23:ADCD: F0        .byte $F0
- D - I - 0x036DDE 23:ADCE: 9A        .byte $9A
- D - I - 0x036DDF 23:ADCF: F0        .byte $F0
- D - I - 0x036DE0 23:ADD0: F0        .byte $F0
- D - I - 0x036DE1 23:ADD1: F0        .byte $F0
- D - I - 0x036DE2 23:ADD2: A4        .byte $A4    ; <ご>
- D - I - 0x036DE3 23:ADD3: 7A        .byte $7A    ; <、>
- D - I - 0x036DE4 23:ADD4: CD        .byte $CD    ; <パ>
off_ADD5_02:
- D - I - 0x036DE5 23:ADD5: F0        .byte $F0
- D - I - 0x036DE6 23:ADD6: F0        .byte $F0
- D - I - 0x036DE7 23:ADD7: 07        .byte $07    ; <き>
- D - I - 0x036DE8 23:ADD8: 07        .byte $07    ; <き>
- D - I - 0x036DE9 23:ADD9: 04        .byte $04    ; <え>
- D - I - 0x036DEA 23:ADDA: 04        .byte $04    ; <え>
- D - I - 0x036DEB 23:ADDB: F0        .byte $F0
- D - I - 0x036DEC 23:ADDC: F0        .byte $F0
- D - I - 0x036DED 23:ADDD: F0        .byte $F0
- D - I - 0x036DEE 23:ADDE: 1C        .byte $1C    ; <ふ>
- D - I - 0x036DEF 23:ADDF: 51        .byte $51    ; <チ>
- D - I - 0x036DF0 23:ADE0: 77        .byte $77    ; <:>
- D - I - 0x036DF1 23:ADE1: 11        .byte $11    ; <ち>
- D - I - 0x036DF2 23:ADE2: 11        .byte $11    ; <ち>
- D - I - 0x036DF3 23:ADE3: 71        .byte $71    ; <ュ>
- D - I - 0x036DF4 23:ADE4: 73        .byte $73    ; <ヮ>
- D - I - 0x036DF5 23:ADE5: 1E        .byte $1E    ; <ほ>
- D - I - 0x036DF6 23:ADE6: 1E        .byte $1E    ; <ほ>
- D - I - 0x036DF7 23:ADE7: 54        .byte $54    ; <ト>
- D - I - 0x036DF8 23:ADE8: 6C        .byte $6C    ; <ワ>
- D - I - 0x036DF9 23:ADE9: F0        .byte $F0
- D - I - 0x036DFA 23:ADEA: 24        .byte $24    ; <や>
- D - I - 0x036DFB 23:ADEB: 1F        .byte $1F    ; <ま>
- D - I - 0x036DFC 23:ADEC: 06        .byte $06    ; <か>
- D - I - 0x036DFD 23:ADED: 04        .byte $04    ; <え>
- D - I - 0x036DFE 23:ADEE: 04        .byte $04    ; <え>
- D - I - 0x036DFF 23:ADEF: 0F        .byte $0F    ; <そ>
- D - I - 0x036E00 23:ADF0: 1B        .byte $1B    ; <ひ>
- D - I - 0x036E01 23:ADF1: F0        .byte $F0
- D - I - 0x036E02 23:ADF2: F0        .byte $F0
- D - I - 0x036E03 23:ADF3: 46        .byte $46    ; <カ>
- D - I - 0x036E04 23:ADF4: 76        .byte $76    ; <ォ>
- D - I - 0x036E05 23:ADF5: 29        .byte $29    ; <る>
- D - I - 0x036E06 23:ADF6: 36        .byte $36    ; <3>
- D - I - 0x036E07 23:ADF7: 7C        .byte $7C    ; <~>
- D - I - 0x036E08 23:ADF8: 7E        .byte $7E    ; <.>
- D - I - 0x036E09 23:ADF9: F0        .byte $F0
- D - I - 0x036E0A 23:ADFA: 1C        .byte $1C    ; <ふ>
- D - I - 0x036E0B 23:ADFB: F0        .byte $F0
- D - I - 0x036E0C 23:ADFC: F0        .byte $F0
- D - I - 0x036E0D 23:ADFD: 3C        .byte $3C    ; <9>
- D - I - 0x036E0E 23:ADFE: 19        .byte $19    ; <の>
- D - I - 0x036E0F 23:ADFF: 13        .byte $13    ; <て>
- D - I - 0x036E10 23:AE00: 39        .byte $39    ; <6>
- D - I - 0x036E11 23:AE01: 1C        .byte $1C    ; <ふ>
- D - I - 0x036E12 23:AE02: 33        .byte $33    ; <0>
- D - I - 0x036E13 23:AE03: 0F        .byte $0F    ; <そ>
- D - I - 0x036E14 23:AE04: 11        .byte $11    ; <ち>
- D - I - 0x036E15 23:AE05: F0        .byte $F0
- D - I - 0x036E16 23:AE06: 3E        .byte $3E    ; <Jr>
- D - I - 0x036E17 23:AE07: 5E        .byte $5E    ; <ホ>
- D - I - 0x036E18 23:AE08: 9B        .byte $9B
- D - I - 0x036E19 23:AE09: 36        .byte $36    ; <3>
- D - I - 0x036E1A 23:AE0A: 4F        .byte $4F    ; <ソ>
- D - I - 0x036E1B 23:AE0B: 9E        .byte $9E
- D - I - 0x036E1C 23:AE0C: A2        .byte $A2    ; <ぐ>
- D - I - 0x036E1D 23:AE0D: 4C        .byte $4C    ; <シ>
- D - I - 0x036E1E 23:AE0E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036E1F 23:AE0F: F0        .byte $F0
- D - I - 0x036E20 23:AE10: F0        .byte $F0
- D - I - 0x036E21 23:AE11: 30        .byte $30    ; <ゃ>
- D - I - 0x036E22 23:AE12: 49        .byte $49    ; <ケ>
- D - I - 0x036E23 23:AE13: 37        .byte $37    ; <4>
- D - I - 0x036E24 23:AE14: 51        .byte $51    ; <チ>
- D - I - 0x036E25 23:AE15: 58        .byte $58    ; <ネ>
- D - I - 0x036E26 23:AE16: 35        .byte $35    ; <2>
- D - I - 0x036E27 23:AE17: 32        .byte $32    ; <ょ>
- D - I - 0x036E28 23:AE18: 1C        .byte $1C    ; <ふ>
- D - I - 0x036E29 23:AE19: 6C        .byte $6C    ; <ワ>
- D - I - 0x036E2A 23:AE1A: 6E        .byte $6E    ; <ン>
- D - I - 0x036E2B 23:AE1B: 8E        .byte $8E    ; <L>
- D - I - 0x036E2C 23:AE1C: BE        .byte $BE    ; <ダ>
- D - I - 0x036E2D 23:AE1D: 4F        .byte $4F    ; <ソ>
- D - I - 0x036E2E 23:AE1E: 7F        .byte $7F    ; <,>
- - - - - 0x036E2F 23:AE1F: F0        .byte $F0
- D - I - 0x036E30 23:AE20: B8        .byte $B8    ; <ゴ>
- D - I - 0x036E31 23:AE21: 7C        .byte $7C    ; <~>
- D - I - 0x036E32 23:AE22: 59        .byte $59    ; <ノ>
- D - I - 0x036E33 23:AE23: F0        .byte $F0
- D - I - 0x036E34 23:AE24: F0        .byte $F0
- D - I - 0x036E35 23:AE25: 6C        .byte $6C    ; <ワ>
- D - I - 0x036E36 23:AE26: 55        .byte $55    ; <ナ>
- D - I - 0x036E37 23:AE27: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036E38 23:AE28: 82        .byte $82    ; <B>
- D - I - 0x036E39 23:AE29: 6F        .byte $6F    ; <ッ>
- D - I - 0x036E3A 23:AE2A: 65        .byte $65    ; <ユ>
- D - I - 0x036E3B 23:AE2B: 4C        .byte $4C    ; <シ>
- D - I - 0x036E3C 23:AE2C: 4E        .byte $4E    ; <セ>
- D - I - 0x036E3D 23:AE2D: F0        .byte $F0
- D - I - 0x036E3E 23:AE2E: 91        .byte $91    ; <V>
- D - I - 0x036E3F 23:AE2F: A6        .byte $A6    ; <じ>
- D - I - 0x036E40 23:AE30: D6        .byte $D6
- D - I - 0x036E41 23:AE31: 7E        .byte $7E    ; <.>
- D - I - 0x036E42 23:AE32: 98        .byte $98
- D - I - 0x036E43 23:AE33: F0        .byte $F0
- D - I - 0x036E44 23:AE34: DC        .byte $DC
- D - I - 0x036E45 23:AE35: 88        .byte $88    ; <H>
- D - I - 0x036E46 23:AE36: A0        .byte $A0    ; <が>
- D - I - 0x036E47 23:AE37: F0        .byte $F0
- D - I - 0x036E48 23:AE38: F0        .byte $F0
- D - I - 0x036E49 23:AE39: F0        .byte $F0
- D - I - 0x036E4A 23:AE3A: 04        .byte $04    ; <え>
- D - I - 0x036E4B 23:AE3B: F0        .byte $F0
- D - I - 0x036E4C 23:AE3C: 07        .byte $07    ; <き>
- D - I - 0x036E4D 23:AE3D: F0        .byte $F0
- D - I - 0x036E4E 23:AE3E: F0        .byte $F0
- D - I - 0x036E4F 23:AE3F: F0        .byte $F0
- D - I - 0x036E50 23:AE40: F0        .byte $F0
- D - I - 0x036E51 23:AE41: F0        .byte $F0
- D - I - 0x036E52 23:AE42: 1D        .byte $1D    ; <へ>
- D - I - 0x036E53 23:AE43: 46        .byte $46    ; <カ>
- D - I - 0x036E54 23:AE44: 77        .byte $77    ; <:>
- D - I - 0x036E55 23:AE45: F0        .byte $F0
- D - I - 0x036E56 23:AE46: 12        .byte $12    ; <つ>
- D - I - 0x036E57 23:AE47: 71        .byte $71    ; <ュ>
- D - I - 0x036E58 23:AE48: 66        .byte $66    ; <ヨ>
- D - I - 0x036E59 23:AE49: F0        .byte $F0
- D - I - 0x036E5A 23:AE4A: F0        .byte $F0
- D - I - 0x036E5B 23:AE4B: 3D        .byte $3D    ; <+>
- D - I - 0x036E5C 23:AE4C: 6C        .byte $6C    ; <ワ>
- D - I - 0x036E5D 23:AE4D: 03        .byte $03    ; <う>
- D - I - 0x036E5E 23:AE4E: 10        .byte $10    ; <た>
- D - I - 0x036E5F 23:AE4F: 13        .byte $13    ; <て>
- D - I - 0x036E60 23:AE50: 08        .byte $08    ; <く>
- D - I - 0x036E61 23:AE51: F0        .byte $F0
- D - I - 0x036E62 23:AE52: 1E        .byte $1E    ; <ほ>
- D - I - 0x036E63 23:AE53: F0        .byte $F0
- D - I - 0x036E64 23:AE54: 05        .byte $05    ; <お>
- D - I - 0x036E65 23:AE55: F0        .byte $F0
- D - I - 0x036E66 23:AE56: 28        .byte $28    ; <り>
- D - I - 0x036E67 23:AE57: 2E        .byte $2E    ; <ん>
- D - I - 0x036E68 23:AE58: 77        .byte $77    ; <:>
- D - I - 0x036E69 23:AE59: F0        .byte $F0
- D - I - 0x036E6A 23:AE5A: 2B        .byte $2B    ; <ろ>
- D - I - 0x036E6B 23:AE5B: 6F        .byte $6F    ; <ッ>
- D - I - 0x036E6C 23:AE5C: 73        .byte $73    ; <ヮ>
- D - I - 0x036E6D 23:AE5D: F0        .byte $F0
- D - I - 0x036E6E 23:AE5E: F0        .byte $F0
- D - I - 0x036E6F 23:AE5F: 25        .byte $25    ; <ゆ>
- D - I - 0x036E70 23:AE60: 6C        .byte $6C    ; <ワ>
- D - I - 0x036E71 23:AE61: 55        .byte $55    ; <ナ>
- D - I - 0x036E72 23:AE62: 0F        .byte $0F    ; <そ>
- D - I - 0x036E73 23:AE63: 14        .byte $14    ; <と>
- D - I - 0x036E74 23:AE64: 5E        .byte $5E    ; <ホ>
- D - I - 0x036E75 23:AE65: 35        .byte $35    ; <2>
- D - I - 0x036E76 23:AE66: 1D        .byte $1D    ; <へ>
- D - I - 0x036E77 23:AE67: 12        .byte $12    ; <つ>
- D - I - 0x036E78 23:AE68: 05        .byte $05    ; <お>
- D - I - 0x036E79 23:AE69: 27        .byte $27    ; <ら>
- D - I - 0x036E7A 23:AE6A: 4B        .byte $4B    ; <サ>
- D - I - 0x036E7B 23:AE6B: 39        .byte $39    ; <6>
- D - I - 0x036E7C 23:AE6C: 8F        .byte $8F    ; <S>
- D - I - 0x036E7D 23:AE6D: 2B        .byte $2B    ; <ろ>
- D - I - 0x036E7E 23:AE6E: 36        .byte $36    ; <3>
- D - I - 0x036E7F 23:AE6F: F0        .byte $F0
- D - I - 0x036E80 23:AE70: F0        .byte $F0
- D - I - 0x036E81 23:AE71: F0        .byte $F0
- D - I - 0x036E82 23:AE72: F0        .byte $F0
- D - I - 0x036E83 23:AE73: 3E        .byte $3E    ; <Jr>
- D - I - 0x036E84 23:AE74: 84        .byte $84    ; <D>
- D - I - 0x036E85 23:AE75: 31        .byte $31    ; <ゅ>
- D - I - 0x036E86 23:AE76: 61        .byte $61    ; <ム>
- D - I - 0x036E87 23:AE77: 3A        .byte $3A    ; <7>
- D - I - 0x036E88 23:AE78: 6A        .byte $6A    ; <レ>
- D - I - 0x036E89 23:AE79: 3F        .byte $3F    ; <•>
- D - I - 0x036E8A 23:AE7A: 44        .byte $44    ; <エ>
- D - I - 0x036E8B 23:AE7B: 28        .byte $28    ; <り>
- D - I - 0x036E8C 23:AE7C: 2B        .byte $2B    ; <ろ>
- D - I - 0x036E8D 23:AE7D: 57        .byte $57    ; <ヌ>
- D - I - 0x036E8E 23:AE7E: 7B        .byte $7B    ; <。>
- D - I - 0x036E8F 23:AE7F: A5        .byte $A5    ; <ざ>
- D - I - 0x036E90 23:AE80: CA        .byte $CA    ; <ぷ>
- D - I - 0x036E91 23:AE81: 73        .byte $73    ; <ヮ>
- D - I - 0x036E92 23:AE82: 5C        .byte $5C    ; <フ>
- D - I - 0x036E93 23:AE83: F0        .byte $F0
- D - I - 0x036E94 23:AE84: F0        .byte $F0
- D - I - 0x036E95 23:AE85: 59        .byte $59    ; <ノ>
- D - I - 0x036E96 23:AE86: 71        .byte $71    ; <ュ>
- D - I - 0x036E97 23:AE87: 9E        .byte $9E
- D - I - 0x036E98 23:AE88: C0        .byte $C0    ; <ヅ>
- D - I - 0x036E99 23:AE89: 79        .byte $79    ; <!>
- D - I - 0x036E9A 23:AE8A: 56        .byte $56    ; <ニ>
- D - I - 0x036E9B 23:AE8B: 5D        .byte $5D    ; <ヘ>
- D - I - 0x036E9C 23:AE8C: 82        .byte $82    ; <B>
- D - I - 0x036E9D 23:AE8D: 70        .byte $70    ; <ャ>
- D - I - 0x036E9E 23:AE8E: 66        .byte $66    ; <ヨ>
- D - I - 0x036E9F 23:AE8F: 41        .byte $41    ; <ア>
- D - I - 0x036EA0 23:AE90: 4E        .byte $4E    ; <セ>
- D - I - 0x036EA1 23:AE91: 9D        .byte $9D
- D - I - 0x036EA2 23:AE92: 88        .byte $88    ; <H>
- D - I - 0x036EA3 23:AE93: B0        .byte $B0    ; <び>
- D - I - 0x036EA4 23:AE94: D6        .byte $D6
- D - I - 0x036EA5 23:AE95: 8B        .byte $8B    ; <K>
- D - I - 0x036EA6 23:AE96: A6        .byte $A6    ; <じ>
- D - I - 0x036EA7 23:AE97: F0        .byte $F0
- D - I - 0x036EA8 23:AE98: F0        .byte $F0
- D - I - 0x036EA9 23:AE99: F0        .byte $F0
- D - I - 0x036EAA 23:AE9A: 89        .byte $89    ; <I>
- D - I - 0x036EAB 23:AE9B: 9F        .byte $9F
- D - I - 0x036EAC 23:AE9C: CD        .byte $CD    ; <パ>
- D - I - 0x036EAD 23:AE9D: 04        .byte $04    ; <え>
- D - I - 0x036EAE 23:AE9E: 04        .byte $04    ; <え>
- D - I - 0x036EAF 23:AE9F: F0        .byte $F0
- D - I - 0x036EB0 23:AEA0: F0        .byte $F0
- D - I - 0x036EB1 23:AEA1: 07        .byte $07    ; <き>
- D - I - 0x036EB2 23:AEA2: 07        .byte $07    ; <き>
- D - I - 0x036EB3 23:AEA3: F0        .byte $F0
- D - I - 0x036EB4 23:AEA4: F0        .byte $F0
- D - I - 0x036EB5 23:AEA5: 12        .byte $12    ; <つ>
- D - I - 0x036EB6 23:AEA6: 12        .byte $12    ; <つ>
- D - I - 0x036EB7 23:AEA7: 5F        .byte $5F    ; <マ>
- D - I - 0x036EB8 23:AEA8: 77        .byte $77    ; <:>
- D - I - 0x036EB9 23:AEA9: F0        .byte $F0
- D - I - 0x036EBA 23:AEAA: 1F        .byte $1F    ; <ま>
- D - I - 0x036EBB 23:AEAB: 70        .byte $70    ; <ャ>
- D - I - 0x036EBC 23:AEAC: 73        .byte $73    ; <ヮ>
- D - I - 0x036EBD 23:AEAD: 1D        .byte $1D    ; <へ>
- D - I - 0x036EBE 23:AEAE: 1D        .byte $1D    ; <へ>
- D - I - 0x036EBF 23:AEAF: 6C        .byte $6C    ; <ワ>
- D - I - 0x036EC0 23:AEB0: 4A        .byte $4A    ; <コ>
- D - I - 0x036EC1 23:AEB1: 1C        .byte $1C    ; <ふ>
- D - I - 0x036EC2 23:AEB2: 05        .byte $05    ; <お>
- D - I - 0x036EC3 23:AEB3: F0        .byte $F0
- D - I - 0x036EC4 23:AEB4: 2F        .byte $2F    ; <っ>
- D - I - 0x036EC5 23:AEB5: 07        .byte $07    ; <き>
- D - I - 0x036EC6 23:AEB6: 07        .byte $07    ; <き>
- D - I - 0x036EC7 23:AEB7: 14        .byte $14    ; <と>
- D - I - 0x036EC8 23:AEB8: 20        .byte $20    ; <み>
- D - I - 0x036EC9 23:AEB9: 2A        .byte $2A    ; <れ>
- D - I - 0x036ECA 23:AEBA: 36        .byte $36    ; <3>
- D - I - 0x036ECB 23:AEBB: F0        .byte $F0
- D - I - 0x036ECC 23:AEBC: F0        .byte $F0
- D - I - 0x036ECD 23:AEBD: F0        .byte $F0
- D - I - 0x036ECE 23:AEBE: F0        .byte $F0
- D - I - 0x036ECF 23:AEBF: 7D        .byte $7D    ; <ー>
- D - I - 0x036ED0 23:AEC0: 7F        .byte $7F    ; <,>
- D - I - 0x036ED1 23:AEC1: F0        .byte $F0
- D - I - 0x036ED2 23:AEC2: 1F        .byte $1F    ; <ま>
- D - I - 0x036ED3 23:AEC3: 49        .byte $49    ; <ケ>
- D - I - 0x036ED4 23:AEC4: 6D        .byte $6D    ; <ヲ>
- D - I - 0x036ED5 23:AEC5: 10        .byte $10    ; <た>
- D - I - 0x036ED6 23:AEC6: 32        .byte $32    ; <ょ>
- D - I - 0x036ED7 23:AEC7: 22        .byte $22    ; <め>
- D - I - 0x036ED8 23:AEC8: 47        .byte $47    ; <キ>
- D - I - 0x036ED9 23:AEC9: 1F        .byte $1F    ; <ま>
- D - I - 0x036EDA 23:AECA: 37        .byte $37    ; <4>
- D - I - 0x036EDB 23:AECB: 12        .byte $12    ; <つ>
- D - I - 0x036EDC 23:AECC: 14        .byte $14    ; <と>
- D - I - 0x036EDD 23:AECD: 40        .byte $40    ; <「>
- D - I - 0x036EDE 23:AECE: 35        .byte $35    ; <2>
- D - I - 0x036EDF 23:AECF: F0        .byte $F0
- D - I - 0x036EE0 23:AED0: F0        .byte $F0
- D - I - 0x036EE1 23:AED1: F0        .byte $F0
- D - I - 0x036EE2 23:AED2: 45        .byte $45    ; <オ>
- D - I - 0x036EE3 23:AED3: A1        .byte $A1    ; <ぎ>
- D - I - 0x036EE4 23:AED4: A5        .byte $A5    ; <ざ>
- D - I - 0x036EE5 23:AED5: 1D        .byte $1D    ; <へ>
- D - I - 0x036EE6 23:AED6: 4F        .byte $4F    ; <ソ>
- D - I - 0x036EE7 23:AED7: 90        .byte $90    ; <U>
- D - I - 0x036EE8 23:AED8: 55        .byte $55    ; <ナ>
- D - I - 0x036EE9 23:AED9: 4A        .byte $4A    ; <コ>
- D - I - 0x036EEA 23:AEDA: 34        .byte $34    ; <1>
- D - I - 0x036EEB 23:AEDB: 3B        .byte $3B    ; <8>
- D - I - 0x036EEC 23:AEDC: 3B        .byte $3B    ; <8>
- D - I - 0x036EED 23:AEDD: 36        .byte $36    ; <3>
- D - I - 0x036EEE 23:AEDE: 5B        .byte $5B    ; <ヒ>
- D - I - 0x036EEF 23:AEDF: 1F        .byte $1F    ; <ま>
- D - I - 0x036EF0 23:AEE0: 39        .byte $39    ; <6>
- D - I - 0x036EF1 23:AEE1: 4C        .byte $4C    ; <シ>
- D - I - 0x036EF2 23:AEE2: 70        .byte $70    ; <ャ>
- D - I - 0x036EF3 23:AEE3: F0        .byte $F0
- D - I - 0x036EF4 23:AEE4: F0        .byte $F0
- D - I - 0x036EF5 23:AEE5: 50        .byte $50    ; <タ>
- D - I - 0x036EF6 23:AEE6: 6A        .byte $6A    ; <レ>
- D - I - 0x036EF7 23:AEE7: F0        .byte $F0
- D - I - 0x036EF8 23:AEE8: BB        .byte $BB    ; <ズ>
- D - I - 0x036EF9 23:AEE9: 59        .byte $59    ; <ノ>
- D - I - 0x036EFA 23:AEEA: 80        .byte $80
- D - I - 0x036EFB 23:AEEB: 85        .byte $85    ; <E>
- D - I - 0x036EFC 23:AEEC: B5        .byte $B5    ; <ギ>
- D - I - 0x036EFD 23:AEED: 79        .byte $79    ; <!>
- D - I - 0x036EFE 23:AEEE: 55        .byte $55    ; <ナ>
- D - I - 0x036EFF 23:AEEF: 5E        .byte $5E    ; <ホ>
- D - I - 0x036F00 23:AEF0: 77        .byte $77    ; <:>
- D - I - 0x036F01 23:AEF1: 66        .byte $66    ; <ヨ>
- D - I - 0x036F02 23:AEF2: 74        .byte $74    ; <ィ>
- D - I - 0x036F03 23:AEF3: 4D        .byte $4D    ; <ス>
- D - I - 0x036F04 23:AEF4: 4F        .byte $4F    ; <ソ>
- D - I - 0x036F05 23:AEF5: F0        .byte $F0
- D - I - 0x036F06 23:AEF6: 8D        .byte $8D    ; <P>
- D - I - 0x036F07 23:AEF7: F0        .byte $F0
- D - I - 0x036F08 23:AEF8: F0        .byte $F0
- D - I - 0x036F09 23:AEF9: 93        .byte $93    ; <Y>
- D - I - 0x036F0A 23:AEFA: 7C        .byte $7C    ; <~>
- D - I - 0x036F0B 23:AEFB: F0        .byte $F0
- D - I - 0x036F0C 23:AEFC: DF        .byte $DF
- D - I - 0x036F0D 23:AEFD: 7E        .byte $7E    ; <.>
- D - I - 0x036F0E 23:AEFE: A3        .byte $A3    ; <げ>
- D - I - 0x036F0F 23:AEFF: 9D        .byte $9D
- D - I - 0x036F10 23:AF00: CD        .byte $CD    ; <パ>
off_AF01_03:
- D - I - 0x036F11 23:AF01: F0        .byte $F0
- D - I - 0x036F12 23:AF02: F0        .byte $F0
- - - - - 0x036F13 23:AF03: 07        .byte $07    ; <き>
- D - I - 0x036F14 23:AF04: 07        .byte $07    ; <き>
- D - I - 0x036F15 23:AF05: 04        .byte $04    ; <え>
- D - I - 0x036F16 23:AF06: 04        .byte $04    ; <え>
- D - I - 0x036F17 23:AF07: F0        .byte $F0
- D - I - 0x036F18 23:AF08: F0        .byte $F0
- D - I - 0x036F19 23:AF09: F0        .byte $F0
- D - I - 0x036F1A 23:AF0A: 1C        .byte $1C    ; <ふ>
- D - I - 0x036F1B 23:AF0B: 13        .byte $13    ; <て>
- D - I - 0x036F1C 23:AF0C: 13        .byte $13    ; <て>
- D - I - 0x036F1D 23:AF0D: 1E        .byte $1E    ; <ほ>
- D - I - 0x036F1E 23:AF0E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036F1F 23:AF0F: 4E        .byte $4E    ; <セ>
- D - I - 0x036F20 23:AF10: 73        .byte $73    ; <ヮ>
- D - I - 0x036F21 23:AF11: 11        .byte $11    ; <ち>
- D - I - 0x036F22 23:AF12: 11        .byte $11    ; <ち>
- D - I - 0x036F23 23:AF13: 7B        .byte $7B    ; <。>
- D - I - 0x036F24 23:AF14: 3E        .byte $3E    ; <Jr>
- D - I - 0x036F25 23:AF15: F0        .byte $F0
- D - I - 0x036F26 23:AF16: F0        .byte $F0
- D - I - 0x036F27 23:AF17: 05        .byte $05    ; <お>
- D - I - 0x036F28 23:AF18: 05        .byte $05    ; <お>
- D - I - 0x036F29 23:AF19: 1C        .byte $1C    ; <ふ>
- D - I - 0x036F2A 23:AF1A: 04        .byte $04    ; <え>
- D - I - 0x036F2B 23:AF1B: 0F        .byte $0F    ; <そ>
- D - I - 0x036F2C 23:AF1C: 24        .byte $24    ; <や>
- D - I - 0x036F2D 23:AF1D: F0        .byte $F0
- D - I - 0x036F2E 23:AF1E: 33        .byte $33    ; <0>
- D - I - 0x036F2F 23:AF1F: 1F        .byte $1F    ; <ま>
- D - I - 0x036F30 23:AF20: 36        .byte $36    ; <3>
- D - I - 0x036F31 23:AF21: 29        .byte $29    ; <る>
- D - I - 0x036F32 23:AF22: 29        .byte $29    ; <る>
- D - I - 0x036F33 23:AF23: 7C        .byte $7C    ; <~>
- D - I - 0x036F34 23:AF24: 75        .byte $75    ; <ェ>
- D - I - 0x036F35 23:AF25: 26        .byte $26    ; <よ>
- D - I - 0x036F36 23:AF26: 65        .byte $65    ; <ユ>
- D - I - 0x036F37 23:AF27: F0        .byte $F0
- D - I - 0x036F38 23:AF28: F0        .byte $F0
- D - I - 0x036F39 23:AF29: 3E        .byte $3E    ; <Jr>
- D - I - 0x036F3A 23:AF2A: 3C        .byte $3C    ; <9>
- D - I - 0x036F3B 23:AF2B: 1F        .byte $1F    ; <ま>
- D - I - 0x036F3C 23:AF2C: 3A        .byte $3A    ; <7>
- D - I - 0x036F3D 23:AF2D: 1D        .byte $1D    ; <へ>
- D - I - 0x036F3E 23:AF2E: 34        .byte $34    ; <1>
- D - I - 0x036F3F 23:AF2F: 19        .byte $19    ; <の>
- D - I - 0x036F40 23:AF30: 10        .byte $10    ; <た>
- D - I - 0x036F41 23:AF31: F0        .byte $F0
- D - I - 0x036F42 23:AF32: F0        .byte $F0
- D - I - 0x036F43 23:AF33: 82        .byte $82    ; <B>
- D - I - 0x036F44 23:AF34: 69        .byte $69    ; <ル>
- D - I - 0x036F45 23:AF35: 36        .byte $36    ; <3>
- D - I - 0x036F46 23:AF36: 5A        .byte $5A    ; <ハ>
- D - I - 0x036F47 23:AF37: 7E        .byte $7E    ; <.>
- D - I - 0x036F48 23:AF38: 98        .byte $98
- D - I - 0x036F49 23:AF39: 4B        .byte $4B    ; <サ>
- D - I - 0x036F4A 23:AF3A: 58        .byte $58    ; <ネ>
- D - I - 0x036F4B 23:AF3B: F0        .byte $F0
- D - I - 0x036F4C 23:AF3C: 92        .byte $92    ; <W>
- D - I - 0x036F4D 23:AF3D: 6C        .byte $6C    ; <ワ>
- D - I - 0x036F4E 23:AF3E: 55        .byte $55    ; <ナ>
- D - I - 0x036F4F 23:AF3F: 37        .byte $37    ; <4>
- D - I - 0x036F50 23:AF40: 75        .byte $75    ; <ェ>
- D - I - 0x036F51 23:AF41: 57        .byte $57    ; <ヌ>
- D - I - 0x036F52 23:AF42: 41        .byte $41    ; <ア>
- D - I - 0x036F53 23:AF43: 32        .byte $32    ; <ょ>
- D - I - 0x036F54 23:AF44: 28        .byte $28    ; <り>
- D - I - 0x036F55 23:AF45: 90        .byte $90    ; <U>
- D - I - 0x036F56 23:AF46: 6E        .byte $6E    ; <ン>
- D - I - 0x036F57 23:AF47: 7F        .byte $7F    ; <,>
- D - I - 0x036F58 23:AF48: B1        .byte $B1    ; <ぶ>
- D - I - 0x036F59 23:AF49: 5A        .byte $5A    ; <ハ>
- D - I - 0x036F5A 23:AF4A: AE        .byte $AE    ; <ど>
- D - I - 0x036F5B 23:AF4B: C7        .byte $C7    ; <ボ>
- D - I - 0x036F5C 23:AF4C: CA        .byte $CA    ; <ぷ>
- D - I - 0x036F5D 23:AF4D: 64        .byte $64    ; <ヤ>
- D - I - 0x036F5E 23:AF4E: B7        .byte $B7    ; <ゲ>
- D - I - 0x036F5F 23:AF4F: F0        .byte $F0
- D - I - 0x036F60 23:AF50: F0        .byte $F0
- D - I - 0x036F61 23:AF51: 84        .byte $84    ; <D>
- D - I - 0x036F62 23:AF52: 6E        .byte $6E    ; <ン>
- D - I - 0x036F63 23:AF53: 74        .byte $74    ; <ィ>
- D - I - 0x036F64 23:AF54: 9A        .byte $9A
- - - - - 0x036F65 23:AF55: 88        .byte $88    ; <H>
- D - I - 0x036F66 23:AF56: 7D        .byte $7D    ; <ー>
- D - I - 0x036F67 23:AF57: 4B        .byte $4B    ; <サ>
- D - I - 0x036F68 23:AF58: 59        .byte $59    ; <ノ>
- D - I - 0x036F69 23:AF59: F0        .byte $F0
- D - I - 0x036F6A 23:AF5A: F0        .byte $F0
- D - I - 0x036F6B 23:AF5B: BB        .byte $BB    ; <ズ>
- D - I - 0x036F6C 23:AF5C: D5        .byte $D5
- D - I - 0x036F6D 23:AF5D: 9F        .byte $9F
- D - I - 0x036F6E 23:AF5E: A1        .byte $A1    ; <ぎ>
- - - - - 0x036F6F 23:AF5F: EA        .byte $EA
- D - I - 0x036F70 23:AF60: EA        .byte $EA
- D - I - 0x036F71 23:AF61: A8        .byte $A8    ; <ぜ>
- D - I - 0x036F72 23:AF62: D0        .byte $D0    ; <ペ>
- D - I - 0x036F73 23:AF63: F0        .byte $F0
- D - I - 0x036F74 23:AF64: F0        .byte $F0
- D - I - 0x036F75 23:AF65: F0        .byte $F0
- D - I - 0x036F76 23:AF66: F0        .byte $F0
- D - I - 0x036F77 23:AF67: F0        .byte $F0
- D - I - 0x036F78 23:AF68: F0        .byte $F0
- D - I - 0x036F79 23:AF69: F0        .byte $F0
- D - I - 0x036F7A 23:AF6A: 12        .byte $12    ; <つ>
- D - I - 0x036F7B 23:AF6B: F0        .byte $F0
- D - I - 0x036F7C 23:AF6C: 04        .byte $04    ; <え>
- D - I - 0x036F7D 23:AF6D: F0        .byte $F0
- D - I - 0x036F7E 23:AF6E: 1D        .byte $1D    ; <へ>
- D - I - 0x036F7F 23:AF6F: F0        .byte $F0
- D - I - 0x036F80 23:AF70: 07        .byte $07    ; <き>
- D - I - 0x036F81 23:AF71: F0        .byte $F0
- D - I - 0x036F82 23:AF72: 1E        .byte $1E    ; <ほ>
- D - I - 0x036F83 23:AF73: 73        .byte $73    ; <ヮ>
- D - I - 0x036F84 23:AF74: 5E        .byte $5E    ; <ホ>
- D - I - 0x036F85 23:AF75: F0        .byte $F0
- D - I - 0x036F86 23:AF76: F0        .byte $F0
- D - I - 0x036F87 23:AF77: 70        .byte $70    ; <ャ>
- D - I - 0x036F88 23:AF78: 4A        .byte $4A    ; <コ>
- D - I - 0x036F89 23:AF79: 03        .byte $03    ; <う>
- D - I - 0x036F8A 23:AF7A: 10        .byte $10    ; <た>
- D - I - 0x036F8B 23:AF7B: 08        .byte $08    ; <く>
- D - I - 0x036F8C 23:AF7C: 13        .byte $13    ; <て>
- D - I - 0x036F8D 23:AF7D: F0        .byte $F0
- D - I - 0x036F8E 23:AF7E: 1E        .byte $1E    ; <ほ>
- D - I - 0x036F8F 23:AF7F: 05        .byte $05    ; <お>
- D - I - 0x036F90 23:AF80: 05        .byte $05    ; <お>
- D - I - 0x036F91 23:AF81: F0        .byte $F0
- D - I - 0x036F92 23:AF82: 28        .byte $28    ; <り>
- D - I - 0x036F93 23:AF83: F0        .byte $F0
- D - I - 0x036F94 23:AF84: 45        .byte $45    ; <オ>
- D - I - 0x036F95 23:AF85: F0        .byte $F0
- D - I - 0x036F96 23:AF86: 2B        .byte $2B    ; <ろ>
- D - I - 0x036F97 23:AF87: 73        .byte $73    ; <ヮ>
- D - I - 0x036F98 23:AF88: 69        .byte $69    ; <ル>
- D - I - 0x036F99 23:AF89: F0        .byte $F0
- D - I - 0x036F9A 23:AF8A: F0        .byte $F0
- D - I - 0x036F9B 23:AF8B: 6F        .byte $6F    ; <ッ>
- D - I - 0x036F9C 23:AF8C: 62        .byte $62    ; <メ>
- D - I - 0x036F9D 23:AF8D: 1B        .byte $1B    ; <ひ>
- D - I - 0x036F9E 23:AF8E: 55        .byte $55    ; <ナ>
- D - I - 0x036F9F 23:AF8F: 20        .byte $20    ; <み>
- D - I - 0x036FA0 23:AF90: 5E        .byte $5E    ; <ホ>
- D - I - 0x036FA1 23:AF91: 1D        .byte $1D    ; <へ>
- D - I - 0x036FA2 23:AF92: 35        .byte $35    ; <2>
- D - I - 0x036FA3 23:AF93: 12        .byte $12    ; <つ>
- D - I - 0x036FA4 23:AF94: 12        .byte $12    ; <つ>
- D - I - 0x036FA5 23:AF95: 6C        .byte $6C    ; <ワ>
- D - I - 0x036FA6 23:AF96: 63        .byte $63    ; <モ>
- D - I - 0x036FA7 23:AF97: 68        .byte $68    ; <リ>
- D - I - 0x036FA8 23:AF98: 81        .byte $81    ; <A>
- D - I - 0x036FA9 23:AF99: 36        .byte $36    ; <3>
- D - I - 0x036FAA 23:AF9A: 4F        .byte $4F    ; <ソ>
- D - I - 0x036FAB 23:AF9B: F0        .byte $F0
- D - I - 0x036FAC 23:AF9C: F0        .byte $F0
- D - I - 0x036FAD 23:AF9D: F0        .byte $F0
- D - I - 0x036FAE 23:AF9E: 58        .byte $58    ; <ネ>
- D - I - 0x036FAF 23:AF9F: F0        .byte $F0
- D - I - 0x036FB0 23:AFA0: F0        .byte $F0
- D - I - 0x036FB1 23:AFA1: 58        .byte $58    ; <ネ>
- D - I - 0x036FB2 23:AFA2: 79        .byte $79    ; <!>
- D - I - 0x036FB3 23:AFA3: 50        .byte $50    ; <タ>
- D - I - 0x036FB4 23:AFA4: 82        .byte $82    ; <B>
- D - I - 0x036FB5 23:AFA5: 41        .byte $41    ; <ア>
- D - I - 0x036FB6 23:AFA6: 5A        .byte $5A    ; <ハ>
- D - I - 0x036FB7 23:AFA7: 1E        .byte $1E    ; <ほ>
- D - I - 0x036FB8 23:AFA8: 37        .byte $37    ; <4>
- D - I - 0x036FB9 23:AFA9: B5        .byte $B5    ; <ギ>
- D - I - 0x036FBA 23:AFAA: 9E        .byte $9E
- D - I - 0x036FBB 23:AFAB: A5        .byte $A5    ; <ざ>
- D - I - 0x036FBC 23:AFAC: BE        .byte $BE    ; <ダ>
- D - I - 0x036FBD 23:AFAD: 73        .byte $73    ; <ヮ>
- D - I - 0x036FBE 23:AFAE: 80        .byte $80
- D - I - 0x036FBF 23:AFAF: F0        .byte $F0
- D - I - 0x036FC0 23:AFB0: F0        .byte $F0
- D - I - 0x036FC1 23:AFB1: 7B        .byte $7B    ; <。>
- D - I - 0x036FC2 23:AFB2: 71        .byte $71    ; <ュ>
- D - I - 0x036FC3 23:AFB3: F0        .byte $F0
- D - I - 0x036FC4 23:AFB4: C3        .byte $C3    ; <バ>
- D - I - 0x036FC5 23:AFB5: 9D        .byte $9D
- D - I - 0x036FC6 23:AFB6: 6E        .byte $6E    ; <ン>
- D - I - 0x036FC7 23:AFB7: 75        .byte $75    ; <ェ>
- D - I - 0x036FC8 23:AFB8: A6        .byte $A6    ; <じ>
- D - I - 0x036FC9 23:AFB9: 70        .byte $70    ; <ャ>
- D - I - 0x036FCA 23:AFBA: 89        .byte $89    ; <I>
- D - I - 0x036FCB 23:AFBB: 4E        .byte $4E    ; <セ>
- D - I - 0x036FCC 23:AFBC: 67        .byte $67    ; <ラ>
- D - I - 0x036FCD 23:AFBD: E6        .byte $E6
- D - I - 0x036FCE 23:AFBE: CD        .byte $CD    ; <パ>
- D - I - 0x036FCF 23:AFBF: D6        .byte $D6
- D - I - 0x036FD0 23:AFC0: ED        .byte $ED
- - - - - 0x036FD1 23:AFC1: A2        .byte $A2    ; <ぐ>
- D - I - 0x036FD2 23:AFC2: 8B        .byte $8B    ; <K>
- D - I - 0x036FD3 23:AFC3: F0        .byte $F0
- D - I - 0x036FD4 23:AFC4: F0        .byte $F0
- D - I - 0x036FD5 23:AFC5: B6        .byte $B6    ; <グ>
- D - I - 0x036FD6 23:AFC6: 94        .byte $94
- D - I - 0x036FD7 23:AFC7: F0        .byte $F0
- D - I - 0x036FD8 23:AFC8: F0        .byte $F0
- D - I - 0x036FD9 23:AFC9: 04        .byte $04    ; <え>
- D - I - 0x036FDA 23:AFCA: 04        .byte $04    ; <え>
- D - I - 0x036FDB 23:AFCB: F0        .byte $F0
- D - I - 0x036FDC 23:AFCC: F0        .byte $F0
- D - I - 0x036FDD 23:AFCD: 07        .byte $07    ; <き>
- D - I - 0x036FDE 23:AFCE: 07        .byte $07    ; <き>
- D - I - 0x036FDF 23:AFCF: F0        .byte $F0
- D - I - 0x036FE0 23:AFD0: F0        .byte $F0
- D - I - 0x036FE1 23:AFD1: 10        .byte $10    ; <た>
- D - I - 0x036FE2 23:AFD2: 10        .byte $10    ; <た>
- D - I - 0x036FE3 23:AFD3: F0        .byte $F0
- D - I - 0x036FE4 23:AFD4: 1F        .byte $1F    ; <ま>
- D - I - 0x036FE5 23:AFD5: 12        .byte $12    ; <つ>
- D - I - 0x036FE6 23:AFD6: 12        .byte $12    ; <つ>
- D - I - 0x036FE7 23:AFD7: 75        .byte $75    ; <ェ>
- D - I - 0x036FE8 23:AFD8: 44        .byte $44    ; <エ>
- D - I - 0x036FE9 23:AFD9: 1D        .byte $1D    ; <へ>
- D - I - 0x036FEA 23:AFDA: 1D        .byte $1D    ; <へ>
- D - I - 0x036FEB 23:AFDB: 70        .byte $70    ; <ャ>
- D - I - 0x036FEC 23:AFDC: 4D        .byte $4D    ; <ス>
- D - I - 0x036FED 23:AFDD: 06        .byte $06    ; <か>
- D - I - 0x036FEE 23:AFDE: 06        .byte $06    ; <か>
- D - I - 0x036FEF 23:AFDF: F0        .byte $F0
- D - I - 0x036FF0 23:AFE0: F0        .byte $F0
- D - I - 0x036FF1 23:AFE1: 1F        .byte $1F    ; <ま>
- D - I - 0x036FF2 23:AFE2: 07        .byte $07    ; <き>
- D - I - 0x036FF3 23:AFE3: 14        .byte $14    ; <と>
- D - I - 0x036FF4 23:AFE4: 2F        .byte $2F    ; <っ>
- D - I - 0x036FF5 23:AFE5: 1C        .byte $1C    ; <ふ>
- D - I - 0x036FF6 23:AFE6: 34        .byte $34    ; <1>
- D - I - 0x036FF7 23:AFE7: F0        .byte $F0
- D - I - 0x036FF8 23:AFE8: 38        .byte $38    ; <5>
- D - I - 0x036FF9 23:AFE9: 20        .byte $20    ; <み>
- D - I - 0x036FFA 23:AFEA: 66        .byte $66    ; <ヨ>
- D - I - 0x036FFB 23:AFEB: F0        .byte $F0
- D - I - 0x036FFC 23:AFEC: F0        .byte $F0
- D - I - 0x036FFD 23:AFED: 2A        .byte $2A    ; <れ>
- D - I - 0x036FFE 23:AFEE: 2A        .byte $2A    ; <れ>
- D - I - 0x036FFF 23:AFEF: 7F        .byte $7F    ; <,>
- D - I - 0x037000 23:AFF0: 6E        .byte $6E    ; <ン>
- D - I - 0x037001 23:AFF1: 1C        .byte $1C    ; <ふ>
- D - I - 0x037002 23:AFF2: 31        .byte $31    ; <ゅ>
- D - I - 0x037003 23:AFF3: 45        .byte $45    ; <オ>
- D - I - 0x037004 23:AFF4: 47        .byte $47    ; <キ>
- D - I - 0x037005 23:AFF5: 1E        .byte $1E    ; <ほ>
- D - I - 0x037006 23:AFF6: 37        .byte $37    ; <4>
- D - I - 0x037007 23:AFF7: 13        .byte $13    ; <て>
- D - I - 0x037008 23:AFF8: 22        .byte $22    ; <め>
- D - I - 0x037009 23:AFF9: 79        .byte $79    ; <!>
- D - I - 0x03700A 23:AFFA: 62        .byte $62    ; <メ>
- D - I - 0x03700B 23:AFFB: F0        .byte $F0
- D - I - 0x03700C 23:AFFC: F0        .byte $F0
- D - I - 0x03700D 23:AFFD: 4F        .byte $4F    ; <ソ>
- D - I - 0x03700E 23:AFFE: 5C        .byte $5C    ; <フ>
- D - I - 0x03700F 23:AFFF: F0        .byte $F0
- D - I - 0x037010 23:B000: 99        .byte $99
- D - I - 0x037011 23:B001: 35        .byte $35    ; <2>
- D - I - 0x037012 23:B002: 4D        .byte $4D    ; <ス>
- D - I - 0x037013 23:B003: 93        .byte $93    ; <Y>
- D - I - 0x037014 23:B004: 7D        .byte $7D    ; <ー>
- D - I - 0x037015 23:B005: 6E        .byte $6E    ; <ン>
- D - I - 0x037016 23:B006: 34        .byte $34    ; <1>
- D - I - 0x037017 23:B007: 5E        .byte $5E    ; <ホ>
- D - I - 0x037018 23:B008: 8F        .byte $8F    ; <S>
- - - - - 0x037019 23:B009: 42        .byte $42    ; <イ>
- D - I - 0x03701A 23:B00A: 50        .byte $50    ; <タ>
- D - I - 0x03701B 23:B00B: 2B        .byte $2B    ; <ろ>
- D - I - 0x03701C 23:B00C: 39        .byte $39    ; <6>
- D - I - 0x03701D 23:B00D: 87        .byte $87    ; <G>
- D - I - 0x03701E 23:B00E: 9E        .byte $9E
- D - I - 0x03701F 23:B00F: 81        .byte $81    ; <A>
- D - I - 0x037020 23:B010: A7        .byte $A7    ; <ず>
- D - I - 0x037021 23:B011: 67        .byte $67    ; <ラ>
- D - I - 0x037022 23:B012: BB        .byte $BB    ; <ズ>
- D - I - 0x037023 23:B013: F0        .byte $F0
- D - I - 0x037024 23:B014: F0        .byte $F0
- D - I - 0x037025 23:B015: AD        .byte $AD    ; <で>
- - - - - 0x037026 23:B016: 59        .byte $59    ; <ノ>
- D - I - 0x037027 23:B017: C1        .byte $C1    ; <デ>
- D - I - 0x037028 23:B018: C4        .byte $C4    ; <ビ>
- - - - - 0x037029 23:B019: 6F        .byte $6F    ; <ッ>
- - - - - 0x03702A 23:B01A: 91        .byte $91    ; <V>
- - - - - 0x03702B 23:B01B: 8F        .byte $8F    ; <S>
- - - - - 0x03702C 23:B01C: 75        .byte $75    ; <ェ>
- - - - - 0x03702D 23:B01D: 8B        .byte $8B    ; <K>
- - - - - 0x03702E 23:B01E: 7E        .byte $7E    ; <.>
- - - - - 0x03702F 23:B01F: 5A        .byte $5A    ; <ハ>
- - - - - 0x037030 23:B020: 50        .byte $50    ; <タ>
- - - - - 0x037031 23:B021: B8        .byte $B8    ; <ゴ>
- - - - - 0x037032 23:B022: CE        .byte $CE    ; <ピ>
- - - - - 0x037033 23:B023: F0        .byte $F0
- - - - - 0x037034 23:B024: F0        .byte $F0
- - - - - 0x037035 23:B025: B3        .byte $B3    ; <ぼ>
- - - - - 0x037036 23:B026: D3        .byte $D3
- - - - - 0x037037 23:B027: F0        .byte $F0
- - - - - 0x037038 23:B028: F0        .byte $F0
- - - - - 0x037039 23:B029: AE        .byte $AE    ; <ど>
- - - - - 0x03703A 23:B02A: A4        .byte $A4    ; <ご>
- - - - - 0x03703B 23:B02B: E9        .byte $E9
- - - - - 0x03703C 23:B02C: E9        .byte $E9
off_B02D_04:
- D - I - 0x03703D 23:B02D: F0        .byte $F0
- D - I - 0x03703E 23:B02E: F0        .byte $F0
- D - I - 0x03703F 23:B02F: 07        .byte $07    ; <き>
- D - I - 0x037040 23:B030: 07        .byte $07    ; <き>
- D - I - 0x037041 23:B031: 04        .byte $04    ; <え>
- D - I - 0x037042 23:B032: 04        .byte $04    ; <え>
- D - I - 0x037043 23:B033: F0        .byte $F0
- D - I - 0x037044 23:B034: F0        .byte $F0
- D - I - 0x037045 23:B035: F0        .byte $F0
- D - I - 0x037046 23:B036: 1C        .byte $1C    ; <ふ>
- D - I - 0x037047 23:B037: 13        .byte $13    ; <て>
- D - I - 0x037048 23:B038: 13        .byte $13    ; <て>
- D - I - 0x037049 23:B039: 1E        .byte $1E    ; <ほ>
- D - I - 0x03704A 23:B03A: 1E        .byte $1E    ; <ほ>
- D - I - 0x03704B 23:B03B: 37        .byte $37    ; <4>
- D - I - 0x03704C 23:B03C: 68        .byte $68    ; <リ>
- D - I - 0x03704D 23:B03D: 11        .byte $11    ; <ち>
- D - I - 0x03704E 23:B03E: 11        .byte $11    ; <ち>
- D - I - 0x03704F 23:B03F: F0        .byte $F0
- D - I - 0x037050 23:B040: F0        .byte $F0
- D - I - 0x037051 23:B041: F0        .byte $F0
- D - I - 0x037052 23:B042: F0        .byte $F0
- D - I - 0x037053 23:B043: 05        .byte $05    ; <お>
- D - I - 0x037054 23:B044: 05        .byte $05    ; <お>
- D - I - 0x037055 23:B045: 04        .byte $04    ; <え>
- D - I - 0x037056 23:B046: 1C        .byte $1C    ; <ふ>
- D - I - 0x037057 23:B047: F0        .byte $F0
- D - I - 0x037058 23:B048: 0F        .byte $0F    ; <そ>
- D - I - 0x037059 23:B049: F0        .byte $F0
- D - I - 0x03705A 23:B04A: F0        .byte $F0
- D - I - 0x03705B 23:B04B: 29        .byte $29    ; <る>
- D - I - 0x03705C 23:B04C: 36        .byte $36    ; <3>
- D - I - 0x03705D 23:B04D: F0        .byte $F0
- D - I - 0x03705E 23:B04E: 33        .byte $33    ; <0>
- D - I - 0x03705F 23:B04F: 7E        .byte $7E    ; <.>
- D - I - 0x037060 23:B050: 5C        .byte $5C    ; <フ>
- D - I - 0x037061 23:B051: F0        .byte $F0
- D - I - 0x037062 23:B052: 26        .byte $26    ; <よ>
- D - I - 0x037063 23:B053: F0        .byte $F0
- D - I - 0x037064 23:B054: F0        .byte $F0
- D - I - 0x037065 23:B055: F0        .byte $F0
- D - I - 0x037066 23:B056: 3C        .byte $3C    ; <9>
- D - I - 0x037067 23:B057: 1D        .byte $1D    ; <へ>
- D - I - 0x037068 23:B058: 4E        .byte $4E    ; <セ>
- D - I - 0x037069 23:B059: 34        .byte $34    ; <1>
- D - I - 0x03706A 23:B05A: 35        .byte $35    ; <2>
- D - I - 0x03706B 23:B05B: 25        .byte $25    ; <ゆ>
- D - I - 0x03706C 23:B05C: 1B        .byte $1B    ; <ひ>
- D - I - 0x03706D 23:B05D: F0        .byte $F0
- D - I - 0x03706E 23:B05E: 3E        .byte $3E    ; <Jr>
- D - I - 0x03706F 23:B05F: F0        .byte $F0
- D - I - 0x037070 23:B060: 4C        .byte $4C    ; <シ>
- D - I - 0x037071 23:B061: F0        .byte $F0
- D - I - 0x037072 23:B062: 57        .byte $57    ; <ヌ>
- D - I - 0x037073 23:B063: 51        .byte $51    ; <チ>
- D - I - 0x037074 23:B064: 8C        .byte $8C    ; <M>
- D - I - 0x037075 23:B065: F0        .byte $F0
- D - I - 0x037076 23:B066: F0        .byte $F0
- D - I - 0x037077 23:B067: F0        .byte $F0
- D - I - 0x037078 23:B068: F0        .byte $F0
- D - I - 0x037079 23:B069: 6C        .byte $6C    ; <ワ>
- D - I - 0x03707A 23:B06A: 6E        .byte $6E    ; <ン>
- D - I - 0x03707B 23:B06B: 36        .byte $36    ; <3>
- D - I - 0x03707C 23:B06C: 72        .byte $72    ; <ョ>
- D - I - 0x03707D 23:B06D: 57        .byte $57    ; <ヌ>
- D - I - 0x03707E 23:B06E: 4D        .byte $4D    ; <ス>
- D - I - 0x03707F 23:B06F: 3E        .byte $3E    ; <Jr>
- D - I - 0x037080 23:B070: 28        .byte $28    ; <り>
- D - I - 0x037081 23:B071: F0        .byte $F0
- D - I - 0x037082 23:B072: F0        .byte $F0
- D - I - 0x037083 23:B073: 70        .byte $70    ; <ャ>
- D - I - 0x037084 23:B074: 7D        .byte $7D    ; <ー>
- D - I - 0x037085 23:B075: F0        .byte $F0
- D - I - 0x037086 23:B076: 87        .byte $87    ; <G>
- D - I - 0x037087 23:B077: 80        .byte $80
- D - I - 0x037088 23:B078: C7        .byte $C7    ; <ボ>
- D - I - 0x037089 23:B079: F0        .byte $F0
- D - I - 0x03708A 23:B07A: C7        .byte $C7    ; <ボ>
- D - I - 0x03708B 23:B07B: F0        .byte $F0
- D - I - 0x03708C 23:B07C: F0        .byte $F0
- D - I - 0x03708D 23:B07D: 84        .byte $84    ; <D>
- D - I - 0x03708E 23:B07E: 6E        .byte $6E    ; <ン>
- D - I - 0x03708F 23:B07F: 66        .byte $66    ; <ヨ>
- D - I - 0x037090 23:B080: A3        .byte $A3    ; <げ>
- D - I - 0x037091 23:B081: 87        .byte $87    ; <G>
- D - I - 0x037092 23:B082: 70        .byte $70    ; <ャ>
- D - I - 0x037093 23:B083: 57        .byte $57    ; <ヌ>
- D - I - 0x037094 23:B084: 4D        .byte $4D    ; <ス>
- D - I - 0x037095 23:B085: F0        .byte $F0
- D - I - 0x037096 23:B086: 91        .byte $91    ; <V>
- D - I - 0x037097 23:B087: 95        .byte $95
- D - I - 0x037098 23:B088: AD        .byte $AD    ; <で>
- D - I - 0x037099 23:B089: F0        .byte $F0
- D - I - 0x03709A 23:B08A: B7        .byte $B7    ; <ゲ>
- D - I - 0x03709B 23:B08B: F0        .byte $F0
- D - I - 0x03709C 23:B08C: D0        .byte $D0    ; <ペ>
- D - I - 0x03709D 23:B08D: F0        .byte $F0
- D - I - 0x03709E 23:B08E: F0        .byte $F0
- D - I - 0x03709F 23:B08F: F0        .byte $F0
- D - I - 0x0370A0 23:B090: F0        .byte $F0
- D - I - 0x0370A1 23:B091: F0        .byte $F0
- D - I - 0x0370A2 23:B092: 04        .byte $04    ; <え>
- D - I - 0x0370A3 23:B093: F0        .byte $F0
- D - I - 0x0370A4 23:B094: 07        .byte $07    ; <き>
- D - I - 0x0370A5 23:B095: F0        .byte $F0
- D - I - 0x0370A6 23:B096: F0        .byte $F0
- D - I - 0x0370A7 23:B097: F0        .byte $F0
- D - I - 0x0370A8 23:B098: F0        .byte $F0
- D - I - 0x0370A9 23:B099: F0        .byte $F0
- D - I - 0x0370AA 23:B09A: 1D        .byte $1D    ; <へ>
- D - I - 0x0370AB 23:B09B: F0        .byte $F0
- D - I - 0x0370AC 23:B09C: 1E        .byte $1E    ; <ほ>
- D - I - 0x0370AD 23:B09D: F0        .byte $F0
- D - I - 0x0370AE 23:B09E: 12        .byte $12    ; <つ>
- D - I - 0x0370AF 23:B09F: 68        .byte $68    ; <リ>
- D - I - 0x0370B0 23:B0A0: 44        .byte $44    ; <エ>
- D - I - 0x0370B1 23:B0A1: F0        .byte $F0
- D - I - 0x0370B2 23:B0A2: F0        .byte $F0
- D - I - 0x0370B3 23:B0A3: 3F        .byte $3F    ; <•>
- D - I - 0x0370B4 23:B0A4: 63        .byte $63    ; <モ>
- D - I - 0x0370B5 23:B0A5: 10        .byte $10    ; <た>
- D - I - 0x0370B6 23:B0A6: 03        .byte $03    ; <う>
- D - I - 0x0370B7 23:B0A7: 13        .byte $13    ; <て>
- D - I - 0x0370B8 23:B0A8: 08        .byte $08    ; <く>
- D - I - 0x0370B9 23:B0A9: F0        .byte $F0
- D - I - 0x0370BA 23:B0AA: F0        .byte $F0
- D - I - 0x0370BB 23:B0AB: F0        .byte $F0
- D - I - 0x0370BC 23:B0AC: 05        .byte $05    ; <お>
- D - I - 0x0370BD 23:B0AD: F0        .byte $F0
- D - I - 0x0370BE 23:B0AE: 28        .byte $28    ; <り>
- D - I - 0x0370BF 23:B0AF: F0        .byte $F0
- D - I - 0x0370C0 23:B0B0: 2B        .byte $2B    ; <ろ>
- D - I - 0x0370C1 23:B0B1: F0        .byte $F0
- D - I - 0x0370C2 23:B0B2: 1E        .byte $1E    ; <ほ>
- D - I - 0x0370C3 23:B0B3: F0        .byte $F0
- D - I - 0x0370C4 23:B0B4: 69        .byte $69    ; <ル>
- D - I - 0x0370C5 23:B0B5: F0        .byte $F0
- D - I - 0x0370C6 23:B0B6: F0        .byte $F0
- D - I - 0x0370C7 23:B0B7: F0        .byte $F0
- D - I - 0x0370C8 23:B0B8: 62        .byte $62    ; <メ>
- D - I - 0x0370C9 23:B0B9: 55        .byte $55    ; <ナ>
- D - I - 0x0370CA 23:B0BA: 1B        .byte $1B    ; <ひ>
- D - I - 0x0370CB 23:B0BB: 20        .byte $20    ; <み>
- D - I - 0x0370CC 23:B0BC: 56        .byte $56    ; <ニ>
- D - I - 0x0370CD 23:B0BD: F0        .byte $F0
- D - I - 0x0370CE 23:B0BE: 35        .byte $35    ; <2>
- D - I - 0x0370CF 23:B0BF: 1D        .byte $1D    ; <へ>
- D - I - 0x0370D0 23:B0C0: 12        .byte $12    ; <つ>
- D - I - 0x0370D1 23:B0C1: F0        .byte $F0
- D - I - 0x0370D2 23:B0C2: 63        .byte $63    ; <モ>
- D - I - 0x0370D3 23:B0C3: F0        .byte $F0
- D - I - 0x0370D4 23:B0C4: 68        .byte $68    ; <リ>
- D - I - 0x0370D5 23:B0C5: 36        .byte $36    ; <3>
- D - I - 0x0370D6 23:B0C6: 4F        .byte $4F    ; <ソ>
- D - I - 0x0370D7 23:B0C7: F0        .byte $F0
- D - I - 0x0370D8 23:B0C8: F0        .byte $F0
- D - I - 0x0370D9 23:B0C9: F0        .byte $F0
- D - I - 0x0370DA 23:B0CA: 59        .byte $59    ; <ノ>
- D - I - 0x0370DB 23:B0CB: F0        .byte $F0
- D - I - 0x0370DC 23:B0CC: F0        .byte $F0
- D - I - 0x0370DD 23:B0CD: 57        .byte $57    ; <ヌ>
- D - I - 0x0370DE 23:B0CE: 85        .byte $85    ; <E>
- D - I - 0x0370DF 23:B0CF: 50        .byte $50    ; <タ>
- D - I - 0x0370E0 23:B0D0: 82        .byte $82    ; <B>
- D - I - 0x0370E1 23:B0D1: 40        .byte $40    ; <「>
- D - I - 0x0370E2 23:B0D2: 59        .byte $59    ; <ノ>
- D - I - 0x0370E3 23:B0D3: 2A        .byte $2A    ; <れ>
- D - I - 0x0370E4 23:B0D4: 36        .byte $36    ; <3>
- D - I - 0x0370E5 23:B0D5: F0        .byte $F0
- D - I - 0x0370E6 23:B0D6: 9E        .byte $9E
- D - I - 0x0370E7 23:B0D7: F0        .byte $F0
- D - I - 0x0370E8 23:B0D8: A5        .byte $A5    ; <ざ>
- D - I - 0x0370E9 23:B0D9: F0        .byte $F0
- D - I - 0x0370EA 23:B0DA: 73        .byte $73    ; <ヮ>
- D - I - 0x0370EB 23:B0DB: F0        .byte $F0
- D - I - 0x0370EC 23:B0DC: F0        .byte $F0
- D - I - 0x0370ED 23:B0DD: F0        .byte $F0
- D - I - 0x0370EE 23:B0DE: 70        .byte $70    ; <ャ>
- D - I - 0x0370EF 23:B0DF: F0        .byte $F0
- D - I - 0x0370F0 23:B0E0: F0        .byte $F0
- D - I - 0x0370F1 23:B0E1: 91        .byte $91    ; <V>
- D - I - 0x0370F2 23:B0E2: 6E        .byte $6E    ; <ン>
- D - I - 0x0370F3 23:B0E3: 74        .byte $74    ; <ィ>
- D - I - 0x0370F4 23:B0E4: 9A        .byte $9A
- D - I - 0x0370F5 23:B0E5: 70        .byte $70    ; <ャ>
- D - I - 0x0370F6 23:B0E6: 89        .byte $89    ; <I>
- D - I - 0x0370F7 23:B0E7: 66        .byte $66    ; <ヨ>
- D - I - 0x0370F8 23:B0E8: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0370F9 23:B0E9: F0        .byte $F0
- D - I - 0x0370FA 23:B0EA: C2        .byte $C2    ; <ド>
- D - I - 0x0370FB 23:B0EB: F0        .byte $F0
- D - I - 0x0370FC 23:B0EC: C9        .byte $C9    ; <ぴ>
- D - I - 0x0370FD 23:B0ED: F0        .byte $F0
- D - I - 0x0370FE 23:B0EE: A3        .byte $A3    ; <げ>
- D - I - 0x0370FF 23:B0EF: F0        .byte $F0
- D - I - 0x037100 23:B0F0: F0        .byte $F0
- D - I - 0x037101 23:B0F1: F0        .byte $F0
- D - I - 0x037102 23:B0F2: A0        .byte $A0    ; <が>
- D - I - 0x037103 23:B0F3: F0        .byte $F0
- D - I - 0x037104 23:B0F4: F0        .byte $F0
- D - I - 0x037105 23:B0F5: 04        .byte $04    ; <え>
- D - I - 0x037106 23:B0F6: 04        .byte $04    ; <え>
- D - I - 0x037107 23:B0F7: F0        .byte $F0
- D - I - 0x037108 23:B0F8: F0        .byte $F0
- D - I - 0x037109 23:B0F9: 07        .byte $07    ; <き>
- D - I - 0x03710A 23:B0FA: 07        .byte $07    ; <き>
- D - I - 0x03710B 23:B0FB: F0        .byte $F0
- D - I - 0x03710C 23:B0FC: F0        .byte $F0
- D - I - 0x03710D 23:B0FD: 10        .byte $10    ; <た>
- D - I - 0x03710E 23:B0FE: 10        .byte $10    ; <た>
- D - I - 0x03710F 23:B0FF: F0        .byte $F0
- D - I - 0x037110 23:B100: 1F        .byte $1F    ; <ま>
- D - I - 0x037111 23:B101: 12        .byte $12    ; <つ>
- D - I - 0x037112 23:B102: 12        .byte $12    ; <つ>
- D - I - 0x037113 23:B103: F0        .byte $F0
- D - I - 0x037114 23:B104: F0        .byte $F0
- D - I - 0x037115 23:B105: 1D        .byte $1D    ; <へ>
- D - I - 0x037116 23:B106: 1D        .byte $1D    ; <へ>
- D - I - 0x037117 23:B107: 34        .byte $34    ; <1>
- D - I - 0x037118 23:B108: 63        .byte $63    ; <モ>
- D - I - 0x037119 23:B109: 06        .byte $06    ; <か>
- D - I - 0x03711A 23:B10A: 06        .byte $06    ; <か>
- D - I - 0x03711B 23:B10B: F0        .byte $F0
- D - I - 0x03711C 23:B10C: F0        .byte $F0
- D - I - 0x03711D 23:B10D: 07        .byte $07    ; <き>
- D - I - 0x03711E 23:B10E: 1F        .byte $1F    ; <ま>
- D - I - 0x03711F 23:B10F: F0        .byte $F0
- D - I - 0x037120 23:B110: 14        .byte $14    ; <と>
- D - I - 0x037121 23:B111: 1D        .byte $1D    ; <へ>
- D - I - 0x037122 23:B112: 1D        .byte $1D    ; <へ>
- D - I - 0x037123 23:B113: F0        .byte $F0
- D - I - 0x037124 23:B114: F0        .byte $F0
- D - I - 0x037125 23:B115: F0        .byte $F0
- D - I - 0x037126 23:B116: 38        .byte $38    ; <5>
- D - I - 0x037127 23:B117: F0        .byte $F0
- D - I - 0x037128 23:B118: F0        .byte $F0
- D - I - 0x037129 23:B119: F0        .byte $F0
- D - I - 0x03712A 23:B11A: 2A        .byte $2A    ; <れ>
- D - I - 0x03712B 23:B11B: 4B        .byte $4B    ; <サ>
- D - I - 0x03712C 23:B11C: 7D        .byte $7D    ; <ー>
- D - I - 0x03712D 23:B11D: 4D        .byte $4D    ; <ス>
- D - I - 0x03712E 23:B11E: 1E        .byte $1E    ; <ほ>
- D - I - 0x03712F 23:B11F: F0        .byte $F0
- D - I - 0x037130 23:B120: 47        .byte $47    ; <キ>
- D - I - 0x037131 23:B121: 36        .byte $36    ; <3>
- D - I - 0x037132 23:B122: 37        .byte $37    ; <4>
- D - I - 0x037133 23:B123: 20        .byte $20    ; <み>
- D - I - 0x037134 23:B124: 2E        .byte $2E    ; <ん>
- D - I - 0x037135 23:B125: F0        .byte $F0
- D - I - 0x037136 23:B126: 4F        .byte $4F    ; <ソ>
- D - I - 0x037137 23:B127: F0        .byte $F0
- D - I - 0x037138 23:B128: 45        .byte $45    ; <オ>
- D - I - 0x037139 23:B129: F0        .byte $F0
- D - I - 0x03713A 23:B12A: F0        .byte $F0
- D - I - 0x03713B 23:B12B: F0        .byte $F0
- D - I - 0x03713C 23:B12C: F0        .byte $F0
- D - I - 0x03713D 23:B12D: F0        .byte $F0
- D - I - 0x03713E 23:B12E: 5C        .byte $5C    ; <フ>
- D - I - 0x03713F 23:B12F: 4A        .byte $4A    ; <コ>
- D - I - 0x037140 23:B130: 93        .byte $93    ; <Y>
- D - I - 0x037141 23:B131: 35        .byte $35    ; <2>
- D - I - 0x037142 23:B132: 71        .byte $71    ; <ュ>
- D - I - 0x037143 23:B133: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037144 23:B134: 8F        .byte $8F    ; <S>
- D - I - 0x037145 23:B135: 4E        .byte $4E    ; <セ>
- D - I - 0x037146 23:B136: 43        .byte $43    ; <ウ>
- D - I - 0x037147 23:B137: 2B        .byte $2B    ; <ろ>
- D - I - 0x037148 23:B138: 45        .byte $45    ; <オ>
- D - I - 0x037149 23:B139: 7E        .byte $7E    ; <.>
- D - I - 0x03714A 23:B13A: 67        .byte $67    ; <ラ>
- D - I - 0x03714B 23:B13B: F0        .byte $F0
- D - I - 0x03714C 23:B13C: F0        .byte $F0
- D - I - 0x03714D 23:B13D: F0        .byte $F0
- D - I - 0x03714E 23:B13E: 6A        .byte $6A    ; <レ>
- D - I - 0x03714F 23:B13F: F0        .byte $F0
- D - I - 0x037150 23:B140: F0        .byte $F0
- D - I - 0x037151 23:B141: F0        .byte $F0
- D - I - 0x037152 23:B142: 8C        .byte $8C    ; <M>
- D - I - 0x037153 23:B143: 7B        .byte $7B    ; <。>
- D - I - 0x037154 23:B144: C4        .byte $C4    ; <ビ>
- D - I - 0x037155 23:B145: A0        .byte $A0    ; <が>
- D - I - 0x037156 23:B146: 65        .byte $65    ; <ユ>
- D - I - 0x037157 23:B147: 75        .byte $75    ; <ェ>
- D - I - 0x037158 23:B148: 8F        .byte $8F    ; <S>
- D - I - 0x037159 23:B149: 73        .byte $73    ; <ヮ>
- D - I - 0x03715A 23:B14A: 8B        .byte $8B    ; <K>
- - - - - 0x03715B 23:B14B: 4E        .byte $4E    ; <セ>
- D - I - 0x03715C 23:B14C: 5C        .byte $5C    ; <フ>
- D - I - 0x03715D 23:B14D: 96        .byte $96
- D - I - 0x03715E 23:B14E: AE        .byte $AE    ; <ど>
- D - I - 0x03715F 23:B14F: F0        .byte $F0
- D - I - 0x037160 23:B150: 9A        .byte $9A
- D - I - 0x037161 23:B151: F0        .byte $F0
- D - I - 0x037162 23:B152: F0        .byte $F0
- D - I - 0x037163 23:B153: F0        .byte $F0
- D - I - 0x037164 23:B154: F0        .byte $F0
- D - I - 0x037165 23:B155: F0        .byte $F0
- D - I - 0x037166 23:B156: BC        .byte $BC    ; <ゼ>
- D - I - 0x037167 23:B157: F0        .byte $F0
- D - I - 0x037168 23:B158: D3        .byte $D3
off_B159_05:
- D - I - 0x037169 23:B159: F0        .byte $F0
- D - I - 0x03716A 23:B15A: F0        .byte $F0
- D - I - 0x03716B 23:B15B: 07        .byte $07    ; <き>
- D - I - 0x03716C 23:B15C: 07        .byte $07    ; <き>
- D - I - 0x03716D 23:B15D: 04        .byte $04    ; <え>
- D - I - 0x03716E 23:B15E: 04        .byte $04    ; <え>
- D - I - 0x03716F 23:B15F: F0        .byte $F0
- D - I - 0x037170 23:B160: F0        .byte $F0
- D - I - 0x037171 23:B161: F0        .byte $F0
- D - I - 0x037172 23:B162: 1C        .byte $1C    ; <ふ>
- D - I - 0x037173 23:B163: 13        .byte $13    ; <て>
- D - I - 0x037174 23:B164: 13        .byte $13    ; <て>
- D - I - 0x037175 23:B165: 1E        .byte $1E    ; <ほ>
- D - I - 0x037176 23:B166: 1E        .byte $1E    ; <ほ>
- D - I - 0x037177 23:B167: 5B        .byte $5B    ; <ヒ>
- D - I - 0x037178 23:B168: 7F        .byte $7F    ; <,>
- D - I - 0x037179 23:B169: 11        .byte $11    ; <ち>
- D - I - 0x03717A 23:B16A: 11        .byte $11    ; <ち>
- D - I - 0x03717B 23:B16B: 57        .byte $57    ; <ヌ>
- D - I - 0x03717C 23:B16C: 7B        .byte $7B    ; <。>
- D - I - 0x03717D 23:B16D: F0        .byte $F0
- D - I - 0x03717E 23:B16E: 24        .byte $24    ; <や>
- D - I - 0x03717F 23:B16F: 05        .byte $05    ; <お>
- D - I - 0x037180 23:B170: 05        .byte $05    ; <お>
- D - I - 0x037181 23:B171: 04        .byte $04    ; <え>
- D - I - 0x037182 23:B172: 04        .byte $04    ; <え>
- D - I - 0x037183 23:B173: 1B        .byte $1B    ; <ひ>
- D - I - 0x037184 23:B174: 0F        .byte $0F    ; <そ>
- D - I - 0x037185 23:B175: F0        .byte $F0
- D - I - 0x037186 23:B176: F0        .byte $F0
- D - I - 0x037187 23:B177: 1F        .byte $1F    ; <ま>
- D - I - 0x037188 23:B178: 36        .byte $36    ; <3>
- D - I - 0x037189 23:B179: 1C        .byte $1C    ; <ふ>
- D - I - 0x03718A 23:B17A: 29        .byte $29    ; <る>
- D - I - 0x03718B 23:B17B: 7C        .byte $7C    ; <~>
- D - I - 0x03718C 23:B17C: 7F        .byte $7F    ; <,>
- D - I - 0x03718D 23:B17D: 26        .byte $26    ; <よ>
- D - I - 0x03718E 23:B17E: 34        .byte $34    ; <1>
- D - I - 0x03718F 23:B17F: F0        .byte $F0
- D - I - 0x037190 23:B180: F0        .byte $F0
- D - I - 0x037191 23:B181: 19        .byte $19    ; <の>
- D - I - 0x037192 23:B182: 3C        .byte $3C    ; <9>
- D - I - 0x037193 23:B183: 13        .byte $13    ; <て>
- D - I - 0x037194 23:B184: 39        .byte $39    ; <6>
- D - I - 0x037195 23:B185: 33        .byte $33    ; <0>
- D - I - 0x037196 23:B186: 1C        .byte $1C    ; <ふ>
- D - I - 0x037197 23:B187: 0F        .byte $0F    ; <そ>
- D - I - 0x037198 23:B188: 11        .byte $11    ; <ち>
- D - I - 0x037199 23:B189: F0        .byte $F0
- D - I - 0x03719A 23:B18A: F0        .byte $F0
- D - I - 0x03719B 23:B18B: 43        .byte $43    ; <ウ>
- D - I - 0x03719C 23:B18C: 69        .byte $69    ; <ル>
- D - I - 0x03719D 23:B18D: 1D        .byte $1D    ; <へ>
- D - I - 0x03719E 23:B18E: 36        .byte $36    ; <3>
- D - I - 0x03719F 23:B18F: 7E        .byte $7E    ; <.>
- D - I - 0x0371A0 23:B190: A2        .byte $A2    ; <ぐ>
- D - I - 0x0371A1 23:B191: 3E        .byte $3E    ; <Jr>
- D - I - 0x0371A2 23:B192: 4C        .byte $4C    ; <シ>
- D - I - 0x0371A3 23:B193: F0        .byte $F0
- D - I - 0x0371A4 23:B194: 9D        .byte $9D
- D - I - 0x0371A5 23:B195: 30        .byte $30    ; <ゃ>
- D - I - 0x0371A6 23:B196: 49        .byte $49    ; <ケ>
- D - I - 0x0371A7 23:B197: 51        .byte $51    ; <チ>
- D - I - 0x0371A8 23:B198: 37        .byte $37    ; <4>
- D - I - 0x0371A9 23:B199: 57        .byte $57    ; <ヌ>
- D - I - 0x0371AA 23:B19A: 35        .byte $35    ; <2>
- D - I - 0x0371AB 23:B19B: 32        .byte $32    ; <ょ>
- D - I - 0x0371AC 23:B19C: 1C        .byte $1C    ; <ふ>
- D - I - 0x0371AD 23:B19D: 6C        .byte $6C    ; <ワ>
- D - I - 0x0371AE 23:B19E: 6E        .byte $6E    ; <ン>
- D - I - 0x0371AF 23:B19F: 73        .byte $73    ; <ヮ>
- D - I - 0x0371B0 23:B1A0: A5        .byte $A5    ; <ざ>
- D - I - 0x0371B1 23:B1A1: 59        .byte $59    ; <ノ>
- D - I - 0x0371B2 23:B1A2: 7E        .byte $7E    ; <.>
- D - I - 0x0371B3 23:B1A3: B8        .byte $B8    ; <ゴ>
- D - I - 0x0371B4 23:B1A4: C7        .byte $C7    ; <ボ>
- D - I - 0x0371B5 23:B1A5: F0        .byte $F0
- D - I - 0x0371B6 23:B1A6: 70        .byte $70    ; <ャ>
- D - I - 0x0371B7 23:B1A7: F0        .byte $F0
- D - I - 0x0371B8 23:B1A8: F0        .byte $F0
- D - I - 0x0371B9 23:B1A9: 6C        .byte $6C    ; <ワ>
- - - - - 0x0371BA 23:B1AA: 55        .byte $55    ; <ナ>
- D - I - 0x0371BB 23:B1AB: 5D        .byte $5D    ; <ヘ>
- D - I - 0x0371BC 23:B1AC: 82        .byte $82    ; <B>
- D - I - 0x0371BD 23:B1AD: 6F        .byte $6F    ; <ッ>
- D - I - 0x0371BE 23:B1AE: 65        .byte $65    ; <ユ>
- D - I - 0x0371BF 23:B1AF: 4C        .byte $4C    ; <シ>
- D - I - 0x0371C0 23:B1B0: 4E        .byte $4E    ; <セ>
- D - I - 0x0371C1 23:B1B1: F0        .byte $F0
- D - I - 0x0371C2 23:B1B2: 84        .byte $84    ; <D>
- D - I - 0x0371C3 23:B1B3: 97        .byte $97
- D - I - 0x0371C4 23:B1B4: BD        .byte $BD    ; <ゾ>
- - - - - 0x0371C5 23:B1B5: 93        .byte $93    ; <Y>
- D - I - 0x0371C6 23:B1B6: 7D        .byte $7D    ; <ー>
- D - I - 0x0371C7 23:B1B7: F0        .byte $F0
- D - I - 0x0371C8 23:B1B8: EA        .byte $EA
- D - I - 0x0371C9 23:B1B9: 7A        .byte $7A    ; <、>
- D - I - 0x0371CA 23:B1BA: AA        .byte $AA    ; <だ>
- D - I - 0x0371CB 23:B1BB: F0        .byte $F0
- D - I - 0x0371CC 23:B1BC: F0        .byte $F0
- D - I - 0x0371CD 23:B1BD: F0        .byte $F0
- D - I - 0x0371CE 23:B1BE: 04        .byte $04    ; <え>
- D - I - 0x0371CF 23:B1BF: F0        .byte $F0
- D - I - 0x0371D0 23:B1C0: F0        .byte $F0
- D - I - 0x0371D1 23:B1C1: F0        .byte $F0
- D - I - 0x0371D2 23:B1C2: 12        .byte $12    ; <つ>
- D - I - 0x0371D3 23:B1C3: F0        .byte $F0
- D - I - 0x0371D4 23:B1C4: F0        .byte $F0
- D - I - 0x0371D5 23:B1C5: F0        .byte $F0
- D - I - 0x0371D6 23:B1C6: 1D        .byte $1D    ; <へ>
- D - I - 0x0371D7 23:B1C7: F0        .byte $F0
- D - I - 0x0371D8 23:B1C8: 07        .byte $07    ; <き>
- D - I - 0x0371D9 23:B1C9: F0        .byte $F0
- D - I - 0x0371DA 23:B1CA: 1E        .byte $1E    ; <ほ>
- D - I - 0x0371DB 23:B1CB: 73        .byte $73    ; <ヮ>
- D - I - 0x0371DC 23:B1CC: 5D        .byte $5D    ; <ヘ>
- D - I - 0x0371DD 23:B1CD: F0        .byte $F0
- D - I - 0x0371DE 23:B1CE: F0        .byte $F0
- D - I - 0x0371DF 23:B1CF: 56        .byte $56    ; <ニ>
- D - I - 0x0371E0 23:B1D0: 70        .byte $70    ; <ャ>
- D - I - 0x0371E1 23:B1D1: 03        .byte $03    ; <う>
- D - I - 0x0371E2 23:B1D2: 10        .byte $10    ; <た>
- D - I - 0x0371E3 23:B1D3: 13        .byte $13    ; <て>
- D - I - 0x0371E4 23:B1D4: 08        .byte $08    ; <く>
- D - I - 0x0371E5 23:B1D5: F0        .byte $F0
- D - I - 0x0371E6 23:B1D6: 1E        .byte $1E    ; <ほ>
- D - I - 0x0371E7 23:B1D7: 05        .byte $05    ; <お>
- D - I - 0x0371E8 23:B1D8: 05        .byte $05    ; <お>
- D - I - 0x0371E9 23:B1D9: F0        .byte $F0
- D - I - 0x0371EA 23:B1DA: 28        .byte $28    ; <り>
- D - I - 0x0371EB 23:B1DB: F0        .byte $F0
- D - I - 0x0371EC 23:B1DC: 44        .byte $44    ; <エ>
- D - I - 0x0371ED 23:B1DD: F0        .byte $F0
- D - I - 0x0371EE 23:B1DE: 2B        .byte $2B    ; <ろ>
- D - I - 0x0371EF 23:B1DF: 73        .byte $73    ; <ヮ>
- D - I - 0x0371F0 23:B1E0: 69        .byte $69    ; <ル>
- D - I - 0x0371F1 23:B1E1: F0        .byte $F0
- D - I - 0x0371F2 23:B1E2: F0        .byte $F0
- D - I - 0x0371F3 23:B1E3: 56        .byte $56    ; <ニ>
- D - I - 0x0371F4 23:B1E4: 6F        .byte $6F    ; <ッ>
- D - I - 0x0371F5 23:B1E5: 55        .byte $55    ; <ナ>
- D - I - 0x0371F6 23:B1E6: 0F        .byte $0F    ; <そ>
- D - I - 0x0371F7 23:B1E7: 14        .byte $14    ; <と>
- D - I - 0x0371F8 23:B1E8: 5E        .byte $5E    ; <ホ>
- D - I - 0x0371F9 23:B1E9: 1D        .byte $1D    ; <へ>
- D - I - 0x0371FA 23:B1EA: 35        .byte $35    ; <2>
- D - I - 0x0371FB 23:B1EB: 05        .byte $05    ; <お>
- D - I - 0x0371FC 23:B1EC: 12        .byte $12    ; <つ>
- D - I - 0x0371FD 23:B1ED: 26        .byte $26    ; <よ>
- D - I - 0x0371FE 23:B1EE: 62        .byte $62    ; <メ>
- D - I - 0x0371FF 23:B1EF: 39        .byte $39    ; <6>
- D - I - 0x037200 23:B1F0: 69        .byte $69    ; <ル>
- D - I - 0x037201 23:B1F1: 59        .byte $59    ; <ノ>
- D - I - 0x037202 23:B1F2: 2B        .byte $2B    ; <ろ>
- D - I - 0x037203 23:B1F3: F0        .byte $F0
- D - I - 0x037204 23:B1F4: F0        .byte $F0
- D - I - 0x037205 23:B1F5: F0        .byte $F0
- D - I - 0x037206 23:B1F6: 4B        .byte $4B    ; <サ>
- D - I - 0x037207 23:B1F7: F0        .byte $F0
- D - I - 0x037208 23:B1F8: F0        .byte $F0
- D - I - 0x037209 23:B1F9: 31        .byte $31    ; <ゅ>
- D - I - 0x03720A 23:B1FA: 61        .byte $61    ; <ム>
- D - I - 0x03720B 23:B1FB: 3A        .byte $3A    ; <7>
- D - I - 0x03720C 23:B1FC: 6A        .byte $6A    ; <レ>
- D - I - 0x03720D 23:B1FD: 3F        .byte $3F    ; <•>
- D - I - 0x03720E 23:B1FE: 44        .byte $44    ; <エ>
- D - I - 0x03720F 23:B1FF: 28        .byte $28    ; <り>
- D - I - 0x037210 23:B200: 2B        .byte $2B    ; <ろ>
- D - I - 0x037211 23:B201: 90        .byte $90    ; <U>
- D - I - 0x037212 23:B202: 57        .byte $57    ; <ヌ>
- D - I - 0x037213 23:B203: 4F        .byte $4F    ; <ソ>
- D - I - 0x037214 23:B204: 9B        .byte $9B
- D - I - 0x037215 23:B205: 59        .byte $59    ; <ノ>
- D - I - 0x037216 23:B206: 68        .byte $68    ; <リ>
- D - I - 0x037217 23:B207: F0        .byte $F0
- D - I - 0x037218 23:B208: F0        .byte $F0
- D - I - 0x037219 23:B209: 7B        .byte $7B    ; <。>
- D - I - 0x03721A 23:B20A: 72        .byte $72    ; <ョ>
- D - I - 0x03721B 23:B20B: F0        .byte $F0
- D - I - 0x03721C 23:B20C: 9F        .byte $9F
- D - I - 0x03721D 23:B20D: 79        .byte $79    ; <!>
- D - I - 0x03721E 23:B20E: 56        .byte $56    ; <ニ>
- D - I - 0x03721F 23:B20F: 82        .byte $82    ; <B>
- D - I - 0x037220 23:B210: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037221 23:B211: 67        .byte $67    ; <ラ>
- D - I - 0x037222 23:B212: 70        .byte $70    ; <ャ>
- D - I - 0x037223 23:B213: 4D        .byte $4D    ; <ス>
- D - I - 0x037224 23:B214: 42        .byte $42    ; <イ>
- D - I - 0x037225 23:B215: 92        .byte $92    ; <W>
- D - I - 0x037226 23:B216: B5        .byte $B5    ; <ギ>
- D - I - 0x037227 23:B217: 99        .byte $99
- D - I - 0x037228 23:B218: BE        .byte $BE    ; <ダ>
- D - I - 0x037229 23:B219: B0        .byte $B0    ; <び>
- D - I - 0x03722A 23:B21A: 8B        .byte $8B    ; <K>
- D - I - 0x03722B 23:B21B: F0        .byte $F0
- D - I - 0x03722C 23:B21C: F0        .byte $F0
- D - I - 0x03722D 23:B21D: 88        .byte $88    ; <H>
- D - I - 0x03722E 23:B21E: A0        .byte $A0    ; <が>
- D - I - 0x03722F 23:B21F: F0        .byte $F0
- D - I - 0x037230 23:B220: F0        .byte $F0
- D - I - 0x037231 23:B221: 04        .byte $04    ; <え>
- D - I - 0x037232 23:B222: 04        .byte $04    ; <え>
- D - I - 0x037233 23:B223: F0        .byte $F0
- D - I - 0x037234 23:B224: F0        .byte $F0
- D - I - 0x037235 23:B225: 07        .byte $07    ; <き>
- D - I - 0x037236 23:B226: 07        .byte $07    ; <き>
- D - I - 0x037237 23:B227: F0        .byte $F0
- D - I - 0x037238 23:B228: F0        .byte $F0
- D - I - 0x037239 23:B229: 10        .byte $10    ; <た>
- D - I - 0x03723A 23:B22A: 10        .byte $10    ; <た>
- D - I - 0x03723B 23:B22B: F0        .byte $F0
- D - I - 0x03723C 23:B22C: 1F        .byte $1F    ; <ま>
- D - I - 0x03723D 23:B22D: 12        .byte $12    ; <つ>
- D - I - 0x03723E 23:B22E: 12        .byte $12    ; <つ>
- D - I - 0x03723F 23:B22F: 5B        .byte $5B    ; <ヒ>
- D - I - 0x037240 23:B230: 7E        .byte $7E    ; <.>
- D - I - 0x037241 23:B231: 1D        .byte $1D    ; <へ>
- D - I - 0x037242 23:B232: 1D        .byte $1D    ; <へ>
- D - I - 0x037243 23:B233: 64        .byte $64    ; <ヤ>
- D - I - 0x037244 23:B234: 7C        .byte $7C    ; <~>
- D - I - 0x037245 23:B235: 06        .byte $06    ; <か>
- D - I - 0x037246 23:B236: 06        .byte $06    ; <か>
- D - I - 0x037247 23:B237: F0        .byte $F0
- D - I - 0x037248 23:B238: 2F        .byte $2F    ; <っ>
- D - I - 0x037249 23:B239: 07        .byte $07    ; <き>
- D - I - 0x03724A 23:B23A: 07        .byte $07    ; <き>
- D - I - 0x03724B 23:B23B: 14        .byte $14    ; <と>
- D - I - 0x03724C 23:B23C: 20        .byte $20    ; <み>
- D - I - 0x03724D 23:B23D: 1C        .byte $1C    ; <ふ>
- D - I - 0x03724E 23:B23E: 34        .byte $34    ; <1>
- D - I - 0x03724F 23:B23F: F0        .byte $F0
- D - I - 0x037250 23:B240: F0        .byte $F0
- D - I - 0x037251 23:B241: 37        .byte $37    ; <4>
- D - I - 0x037252 23:B242: 39        .byte $39    ; <6>
- D - I - 0x037253 23:B243: F0        .byte $F0
- D - I - 0x037254 23:B244: F0        .byte $F0
- D - I - 0x037255 23:B245: 2A        .byte $2A    ; <れ>
- D - I - 0x037256 23:B246: 1F        .byte $1F    ; <ま>
- D - I - 0x037257 23:B247: 7C        .byte $7C    ; <~>
- D - I - 0x037258 23:B248: 7F        .byte $7F    ; <,>
- D - I - 0x037259 23:B249: 32        .byte $32    ; <ょ>
- D - I - 0x03725A 23:B24A: 10        .byte $10    ; <た>
- D - I - 0x03725B 23:B24B: 22        .byte $22    ; <め>
- D - I - 0x03725C 23:B24C: 47        .byte $47    ; <キ>
- D - I - 0x03725D 23:B24D: 1F        .byte $1F    ; <ま>
- D - I - 0x03725E 23:B24E: 37        .byte $37    ; <4>
- D - I - 0x03725F 23:B24F: 14        .byte $14    ; <と>
- D - I - 0x037260 23:B250: 12        .byte $12    ; <つ>
- D - I - 0x037261 23:B251: 62        .byte $62    ; <メ>
- D - I - 0x037262 23:B252: 40        .byte $40    ; <「>
- D - I - 0x037263 23:B253: F0        .byte $F0
- D - I - 0x037264 23:B254: F0        .byte $F0
- D - I - 0x037265 23:B255: 4F        .byte $4F    ; <ソ>
- D - I - 0x037266 23:B256: 45        .byte $45    ; <オ>
- D - I - 0x037267 23:B257: 7D        .byte $7D    ; <ー>
- D - I - 0x037268 23:B258: A1        .byte $A1    ; <ぎ>
- D - I - 0x037269 23:B259: 1E        .byte $1E    ; <ほ>
- D - I - 0x03726A 23:B25A: 59        .byte $59    ; <ノ>
- D - I - 0x03726B 23:B25B: F0        .byte $F0
- D - I - 0x03726C 23:B25C: A6        .byte $A6    ; <じ>
- D - I - 0x03726D 23:B25D: 4A        .byte $4A    ; <コ>
- D - I - 0x03726E 23:B25E: 34        .byte $34    ; <1>
- D - I - 0x03726F 23:B25F: 3B        .byte $3B    ; <8>
- D - I - 0x037270 23:B260: 3B        .byte $3B    ; <8>
- D - I - 0x037271 23:B261: 36        .byte $36    ; <3>
- D - I - 0x037272 23:B262: 5B        .byte $5B    ; <ヒ>
- D - I - 0x037273 23:B263: 39        .byte $39    ; <6>
- D - I - 0x037274 23:B264: 1F        .byte $1F    ; <ま>
- D - I - 0x037275 23:B265: 9E        .byte $9E
- D - I - 0x037276 23:B266: 70        .byte $70    ; <ャ>
- D - I - 0x037277 23:B267: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037278 23:B268: 8F        .byte $8F    ; <S>
- D - I - 0x037279 23:B269: F0        .byte $F0
- D - I - 0x03727A 23:B26A: 74        .byte $74    ; <ィ>
- D - I - 0x03727B 23:B26B: F0        .byte $F0
- D - I - 0x03727C 23:B26C: F0        .byte $F0
- D - I - 0x03727D 23:B26D: 4E        .byte $4E    ; <セ>
- D - I - 0x03727E 23:B26E: 7D        .byte $7D    ; <ー>
- D - I - 0x03727F 23:B26F: BB        .byte $BB    ; <ズ>
- D - I - 0x037280 23:B270: C5        .byte $C5    ; <ブ>
- D - I - 0x037281 23:B271: 79        .byte $79    ; <!>
- D - I - 0x037282 23:B272: 56        .byte $56    ; <ニ>
- D - I - 0x037283 23:B273: 5E        .byte $5E    ; <ホ>
- D - I - 0x037284 23:B274: 77        .byte $77    ; <:>
- D - I - 0x037285 23:B275: 66        .byte $66    ; <ヨ>
- D - I - 0x037286 23:B276: 74        .byte $74    ; <ィ>
- D - I - 0x037287 23:B277: 4D        .byte $4D    ; <ス>
- D - I - 0x037288 23:B278: 4F        .byte $4F    ; <ソ>
- D - I - 0x037289 23:B279: B6        .byte $B6    ; <グ>
- D - I - 0x03728A 23:B27A: 94        .byte $94
- D - I - 0x03728B 23:B27B: F0        .byte $F0
- D - I - 0x03728C 23:B27C: 8F        .byte $8F    ; <S>
- D - I - 0x03728D 23:B27D: 81        .byte $81    ; <A>
- D - I - 0x03728E 23:B27E: B2        .byte $B2    ; <べ>
- D - I - 0x03728F 23:B27F: F0        .byte $F0
- D - I - 0x037290 23:B280: F0        .byte $F0
- D - I - 0x037291 23:B281: 7D        .byte $7D    ; <ー>
- D - I - 0x037292 23:B282: 98        .byte $98
- D - I - 0x037293 23:B283: F0        .byte $F0
- D - I - 0x037294 23:B284: E9        .byte $E9
off_B285_06:
- D - I - 0x037295 23:B285: F0        .byte $F0
- D - I - 0x037296 23:B286: F0        .byte $F0
- D - I - 0x037297 23:B287: 07        .byte $07    ; <き>
- D - I - 0x037298 23:B288: 07        .byte $07    ; <き>
- D - I - 0x037299 23:B289: 04        .byte $04    ; <え>
- D - I - 0x03729A 23:B28A: 04        .byte $04    ; <え>
- D - I - 0x03729B 23:B28B: F0        .byte $F0
- D - I - 0x03729C 23:B28C: 0F        .byte $0F    ; <そ>
- D - I - 0x03729D 23:B28D: F0        .byte $F0
- D - I - 0x03729E 23:B28E: F0        .byte $F0
- D - I - 0x03729F 23:B28F: 1E        .byte $1E    ; <ほ>
- D - I - 0x0372A0 23:B290: 1E        .byte $1E    ; <ほ>
- D - I - 0x0372A1 23:B291: 11        .byte $11    ; <ち>
- D - I - 0x0372A2 23:B292: 11        .byte $11    ; <ち>
- D - I - 0x0372A3 23:B293: 75        .byte $75    ; <ェ>
- D - I - 0x0372A4 23:B294: 4E        .byte $4E    ; <セ>
- D - I - 0x0372A5 23:B295: 1C        .byte $1C    ; <ふ>
- D - I - 0x0372A6 23:B296: 1C        .byte $1C    ; <ふ>
- D - I - 0x0372A7 23:B297: 3F        .byte $3F    ; <•>
- D - I - 0x0372A8 23:B298: 78        .byte $78    ; <?>
- D - I - 0x0372A9 23:B299: 0E        .byte $0E    ; <せ>
- D - I - 0x0372AA 23:B29A: 24        .byte $24    ; <や>
- D - I - 0x0372AB 23:B29B: 06        .byte $06    ; <か>
- D - I - 0x0372AC 23:B29C: 06        .byte $06    ; <か>
- D - I - 0x0372AD 23:B29D: 1C        .byte $1C    ; <ふ>
- D - I - 0x0372AE 23:B29E: 04        .byte $04    ; <え>
- D - I - 0x0372AF 23:B29F: F0        .byte $F0
- D - I - 0x0372B0 23:B2A0: 26        .byte $26    ; <よ>
- D - I - 0x0372B1 23:B2A1: F0        .byte $F0
- D - I - 0x0372B2 23:B2A2: F0        .byte $F0
- D - I - 0x0372B3 23:B2A3: 1F        .byte $1F    ; <ま>
- D - I - 0x0372B4 23:B2A4: 36        .byte $36    ; <3>
- D - I - 0x0372B5 23:B2A5: 29        .byte $29    ; <る>
- D - I - 0x0372B6 23:B2A6: 29        .byte $29    ; <る>
- D - I - 0x0372B7 23:B2A7: 7A        .byte $7A    ; <、>
- D - I - 0x0372B8 23:B2A8: 75        .byte $75    ; <ェ>
- D - I - 0x0372B9 23:B2A9: 33        .byte $33    ; <0>
- D - I - 0x0372BA 23:B2AA: 66        .byte $66    ; <ヨ>
- D - I - 0x0372BB 23:B2AB: F0        .byte $F0
- D - I - 0x0372BC 23:B2AC: F0        .byte $F0
- D - I - 0x0372BD 23:B2AD: 1A        .byte $1A    ; <は>
- D - I - 0x0372BE 23:B2AE: 3C        .byte $3C    ; <9>
- D - I - 0x0372BF 23:B2AF: 1F        .byte $1F    ; <ま>
- D - I - 0x0372C0 23:B2B0: 3A        .byte $3A    ; <7>
- D - I - 0x0372C1 23:B2B1: 1C        .byte $1C    ; <ふ>
- D - I - 0x0372C2 23:B2B2: 11        .byte $11    ; <ち>
- D - I - 0x0372C3 23:B2B3: 3E        .byte $3E    ; <Jr>
- D - I - 0x0372C4 23:B2B4: 58        .byte $58    ; <ネ>
- D - I - 0x0372C5 23:B2B5: F0        .byte $F0
- D - I - 0x0372C6 23:B2B6: F0        .byte $F0
- D - I - 0x0372C7 23:B2B7: 82        .byte $82    ; <B>
- D - I - 0x0372C8 23:B2B8: 69        .byte $69    ; <ル>
- D - I - 0x0372C9 23:B2B9: 34        .byte $34    ; <1>
- D - I - 0x0372CA 23:B2BA: 36        .byte $36    ; <3>
- D - I - 0x0372CB 23:B2BB: 98        .byte $98
- D - I - 0x0372CC 23:B2BC: 98        .byte $98
- D - I - 0x0372CD 23:B2BD: 7D        .byte $7D    ; <ー>
- D - I - 0x0372CE 23:B2BE: 66        .byte $66    ; <ヨ>
- D - I - 0x0372CF 23:B2BF: F0        .byte $F0
- D - I - 0x0372D0 23:B2C0: 92        .byte $92    ; <W>
- D - I - 0x0372D1 23:B2C1: 6C        .byte $6C    ; <ワ>
- D - I - 0x0372D2 23:B2C2: 3E        .byte $3E    ; <Jr>
- D - I - 0x0372D3 23:B2C3: 37        .byte $37    ; <4>
- D - I - 0x0372D4 23:B2C4: 75        .byte $75    ; <ェ>
- D - I - 0x0372D5 23:B2C5: 34        .byte $34    ; <1>
- D - I - 0x0372D6 23:B2C6: 29        .byte $29    ; <る>
- D - I - 0x0372D7 23:B2C7: 57        .byte $57    ; <ヌ>
- D - I - 0x0372D8 23:B2C8: 64        .byte $64    ; <ヤ>
- D - I - 0x0372D9 23:B2C9: 90        .byte $90    ; <U>
- D - I - 0x0372DA 23:B2CA: 6E        .byte $6E    ; <ン>
- D - I - 0x0372DB 23:B2CB: B1        .byte $B1    ; <ぶ>
- D - I - 0x0372DC 23:B2CC: 98        .byte $98
- D - I - 0x0372DD 23:B2CD: 72        .byte $72    ; <ョ>
- D - I - 0x0372DE 23:B2CE: 4D        .byte $4D    ; <ス>
- D - I - 0x0372DF 23:B2CF: C7        .byte $C7    ; <ボ>
- D - I - 0x0372E0 23:B2D0: C9        .byte $C9    ; <ぴ>
- D - I - 0x0372E1 23:B2D1: B7        .byte $B7    ; <ゲ>
- D - I - 0x0372E2 23:B2D2: 95        .byte $95
- D - I - 0x0372E3 23:B2D3: F0        .byte $F0
- D - I - 0x0372E4 23:B2D4: F0        .byte $F0
- D - I - 0x0372E5 23:B2D5: 84        .byte $84    ; <D>
- - - - - 0x0372E6 23:B2D6: 62        .byte $62    ; <メ>
- D - I - 0x0372E7 23:B2D7: 68        .byte $68    ; <リ>
- - - - - 0x0372E8 23:B2D8: 9A        .byte $9A
- D - I - 0x0372E9 23:B2D9: 4B        .byte $4B    ; <サ>
- - - - - 0x0372EA 23:B2DA: 59        .byte $59    ; <ノ>
- - - - - 0x0372EB 23:B2DB: 87        .byte $87    ; <G>
- D - I - 0x0372EC 23:B2DC: AA        .byte $AA    ; <だ>
- - - - - 0x0372ED 23:B2DD: F0        .byte $F0
- D - I - 0x0372EE 23:B2DE: F0        .byte $F0
- - - - - 0x0372EF 23:B2DF: BB        .byte $BB    ; <ズ>
- D - I - 0x0372F0 23:B2E0: D5        .byte $D5
- D - I - 0x0372F1 23:B2E1: 7D        .byte $7D    ; <ー>
- - - - - 0x0372F2 23:B2E2: A2        .byte $A2    ; <ぐ>
- D - I - 0x0372F3 23:B2E3: EA        .byte $EA
- - - - - 0x0372F4 23:B2E4: EA        .byte $EA
- D - I - 0x0372F5 23:B2E5: A8        .byte $A8    ; <ぜ>
- - - - - 0x0372F6 23:B2E6: D0        .byte $D0    ; <ペ>
- D - I - 0x0372F7 23:B2E7: F0        .byte $F0
- - - - - 0x0372F8 23:B2E8: F0        .byte $F0
- D - I - 0x0372F9 23:B2E9: F0        .byte $F0
- D - I - 0x0372FA 23:B2EA: 04        .byte $04    ; <え>
- D - I - 0x0372FB 23:B2EB: F0        .byte $F0
- D - I - 0x0372FC 23:B2EC: 07        .byte $07    ; <き>
- D - I - 0x0372FD 23:B2ED: F0        .byte $F0
- D - I - 0x0372FE 23:B2EE: F0        .byte $F0
- D - I - 0x0372FF 23:B2EF: F0        .byte $F0
- D - I - 0x037300 23:B2F0: 1D        .byte $1D    ; <へ>
- D - I - 0x037301 23:B2F1: F0        .byte $F0
- D - I - 0x037302 23:B2F2: F0        .byte $F0
- D - I - 0x037303 23:B2F3: F0        .byte $F0
- D - I - 0x037304 23:B2F4: F0        .byte $F0
- D - I - 0x037305 23:B2F5: F0        .byte $F0
- D - I - 0x037306 23:B2F6: 12        .byte $12    ; <つ>
- D - I - 0x037307 23:B2F7: 4F        .byte $4F    ; <ソ>
- D - I - 0x037308 23:B2F8: 73        .byte $73    ; <ヮ>
- D - I - 0x037309 23:B2F9: 41        .byte $41    ; <ア>
- D - I - 0x03730A 23:B2FA: 41        .byte $41    ; <ア>
- D - I - 0x03730B 23:B2FB: 3F        .byte $3F    ; <•>
- D - I - 0x03730C 23:B2FC: 7B        .byte $7B    ; <。>
- D - I - 0x03730D 23:B2FD: 10        .byte $10    ; <た>
- D - I - 0x03730E 23:B2FE: 03        .byte $03    ; <う>
- D - I - 0x03730F 23:B2FF: 13        .byte $13    ; <て>
- D - I - 0x037310 23:B300: 08        .byte $08    ; <く>
- D - I - 0x037311 23:B301: F0        .byte $F0
- D - I - 0x037312 23:B302: 05        .byte $05    ; <お>
- D - I - 0x037313 23:B303: F0        .byte $F0
- D - I - 0x037314 23:B304: 28        .byte $28    ; <り>
- D - I - 0x037315 23:B305: F0        .byte $F0
- D - I - 0x037316 23:B306: 3E        .byte $3E    ; <Jr>
- D - I - 0x037317 23:B307: F0        .byte $F0
- D - I - 0x037318 23:B308: 2B        .byte $2B    ; <ろ>
- D - I - 0x037319 23:B309: F0        .byte $F0
- D - I - 0x03731A 23:B30A: 1E        .byte $1E    ; <ほ>
- D - I - 0x03731B 23:B30B: 73        .byte $73    ; <ヮ>
- D - I - 0x03731C 23:B30C: 45        .byte $45    ; <オ>
- D - I - 0x03731D 23:B30D: F0        .byte $F0
- D - I - 0x03731E 23:B30E: F0        .byte $F0
- D - I - 0x03731F 23:B30F: 62        .byte $62    ; <メ>
- D - I - 0x037320 23:B310: 6F        .byte $6F    ; <ッ>
- D - I - 0x037321 23:B311: 1B        .byte $1B    ; <ひ>
- D - I - 0x037322 23:B312: 48        .byte $48    ; <ク>
- D - I - 0x037323 23:B313: 20        .byte $20    ; <み>
- D - I - 0x037324 23:B314: 53        .byte $53    ; <テ>
- D - I - 0x037325 23:B315: 11        .byte $11    ; <ち>
- D - I - 0x037326 23:B316: 12        .byte $12    ; <つ>
- D - I - 0x037327 23:B317: 4A        .byte $4A    ; <コ>
- D - I - 0x037328 23:B318: 35        .byte $35    ; <2>
- D - I - 0x037329 23:B319: 6C        .byte $6C    ; <ワ>
- D - I - 0x03732A 23:B31A: 63        .byte $63    ; <モ>
- D - I - 0x03732B 23:B31B: 68        .byte $68    ; <リ>
- D - I - 0x03732C 23:B31C: 81        .byte $81    ; <A>
- D - I - 0x03732D 23:B31D: 2B        .byte $2B    ; <ろ>
- D - I - 0x03732E 23:B31E: 4F        .byte $4F    ; <ソ>
- D - I - 0x03732F 23:B31F: F0        .byte $F0
- D - I - 0x037330 23:B320: F0        .byte $F0
- D - I - 0x037331 23:B321: F0        .byte $F0
- D - I - 0x037332 23:B322: 59        .byte $59    ; <ノ>
- D - I - 0x037333 23:B323: F0        .byte $F0
- D - I - 0x037334 23:B324: F0        .byte $F0
- D - I - 0x037335 23:B325: 3F        .byte $3F    ; <•>
- D - I - 0x037336 23:B326: 79        .byte $79    ; <!>
- D - I - 0x037337 23:B327: 44        .byte $44    ; <エ>
- D - I - 0x037338 23:B328: 82        .byte $82    ; <B>
- D - I - 0x037339 23:B329: 35        .byte $35    ; <2>
- D - I - 0x03733A 23:B32A: 2A        .byte $2A    ; <れ>
- D - I - 0x03733B 23:B32B: 7B        .byte $7B    ; <。>
- D - I - 0x03733C 23:B32C: 58        .byte $58    ; <ネ>
- D - I - 0x03733D 23:B32D: B5        .byte $B5    ; <ギ>
- D - I - 0x03733E 23:B32E: 9E        .byte $9E
- D - I - 0x03733F 23:B32F: BE        .byte $BE    ; <ダ>
- D - I - 0x037340 23:B330: A5        .byte $A5    ; <ざ>
- D - I - 0x037341 23:B331: 5A        .byte $5A    ; <ハ>
- D - I - 0x037342 23:B332: 73        .byte $73    ; <ヮ>
- D - I - 0x037343 23:B333: F0        .byte $F0
- D - I - 0x037344 23:B334: F0        .byte $F0
- D - I - 0x037345 23:B335: 89        .byte $89    ; <I>
- D - I - 0x037346 23:B336: 8A        .byte $8A    ; <N>
- D - I - 0x037347 23:B337: F0        .byte $F0
- D - I - 0x037348 23:B338: C3        .byte $C3    ; <バ>
- D - I - 0x037349 23:B339: 9D        .byte $9D
- D - I - 0x03734A 23:B33A: 62        .byte $62    ; <メ>
- D - I - 0x03734B 23:B33B: 68        .byte $68    ; <リ>
- D - I - 0x03734C 23:B33C: A6        .byte $A6    ; <じ>
- D - I - 0x03734D 23:B33D: 59        .byte $59    ; <ノ>
- D - I - 0x03734E 23:B33E: 42        .byte $42    ; <イ>
- D - I - 0x03734F 23:B33F: 70        .byte $70    ; <ャ>
- D - I - 0x037350 23:B340: 9F        .byte $9F
- D - I - 0x037351 23:B341: E6        .byte $E6
- D - I - 0x037352 23:B342: CD        .byte $CD    ; <パ>
- D - I - 0x037353 23:B343: ED        .byte $ED
- D - I - 0x037354 23:B344: D6        .byte $D6
- D - I - 0x037355 23:B345: 72        .byte $72    ; <ョ>
- D - I - 0x037356 23:B346: A3        .byte $A3    ; <げ>
- D - I - 0x037357 23:B347: F0        .byte $F0
- D - I - 0x037358 23:B348: F0        .byte $F0
- D - I - 0x037359 23:B349: B9        .byte $B9    ; <ザ>
- D - I - 0x03735A 23:B34A: C6        .byte $C6    ; <ベ>
- D - I - 0x03735B 23:B34B: F0        .byte $F0
- D - I - 0x03735C 23:B34C: F0        .byte $F0
- D - I - 0x03735D 23:B34D: 04        .byte $04    ; <え>
- D - I - 0x03735E 23:B34E: 04        .byte $04    ; <え>
- D - I - 0x03735F 23:B34F: F0        .byte $F0
- D - I - 0x037360 23:B350: F0        .byte $F0
- D - I - 0x037361 23:B351: 07        .byte $07    ; <き>
- D - I - 0x037362 23:B352: 07        .byte $07    ; <き>
- D - I - 0x037363 23:B353: 12        .byte $12    ; <つ>
- D - I - 0x037364 23:B354: 12        .byte $12    ; <つ>
- D - I - 0x037365 23:B355: 1D        .byte $1D    ; <へ>
- D - I - 0x037366 23:B356: 1D        .byte $1D    ; <へ>
- D - I - 0x037367 23:B357: F0        .byte $F0
- D - I - 0x037368 23:B358: F0        .byte $F0
- D - I - 0x037369 23:B359: F0        .byte $F0
- D - I - 0x03736A 23:B35A: 14        .byte $14    ; <と>
- - - - - 0x03736B 23:B35B: 72        .byte $72    ; <ョ>
- D - I - 0x03736C 23:B35C: 76        .byte $76    ; <ォ>
- D - I - 0x03736D 23:B35D: 1F        .byte $1F    ; <ま>
- D - I - 0x03736E 23:B35E: 1F        .byte $1F    ; <ま>
- D - I - 0x03736F 23:B35F: 42        .byte $42    ; <イ>
- D - I - 0x037370 23:B360: 6F        .byte $6F    ; <ッ>
- D - I - 0x037371 23:B361: 05        .byte $05    ; <お>
- D - I - 0x037372 23:B362: 1C        .byte $1C    ; <ふ>
- D - I - 0x037373 23:B363: 15        .byte $15    ; <な>
- D - I - 0x037374 23:B364: 2F        .byte $2F    ; <っ>
- D - I - 0x037375 23:B365: 07        .byte $07    ; <き>
- D - I - 0x037376 23:B366: 1F        .byte $1F    ; <ま>
- D - I - 0x037377 23:B367: 2A        .byte $2A    ; <れ>
- D - I - 0x037378 23:B368: 2A        .byte $2A    ; <れ>
- D - I - 0x037379 23:B369: 1C        .byte $1C    ; <ふ>
- D - I - 0x03737A 23:B36A: 33        .byte $33    ; <0>
- D - I - 0x03737B 23:B36B: F0        .byte $F0
- D - I - 0x03737C 23:B36C: F0        .byte $F0
- D - I - 0x03737D 23:B36D: F0        .byte $F0
- D - I - 0x03737E 23:B36E: 38        .byte $38    ; <5>
- D - I - 0x03737F 23:B36F: F0        .byte $F0
- D - I - 0x037380 23:B370: F0        .byte $F0
- D - I - 0x037381 23:B371: 65        .byte $65    ; <ユ>
- D - I - 0x037382 23:B372: 4F        .byte $4F    ; <ソ>
- D - I - 0x037383 23:B373: 6E        .byte $6E    ; <ン>
- D - I - 0x037384 23:B374: 81        .byte $81    ; <A>
- D - I - 0x037385 23:B375: 1C        .byte $1C    ; <ふ>
- D - I - 0x037386 23:B376: 31        .byte $31    ; <ゅ>
- D - I - 0x037387 23:B377: 21        .byte $21    ; <む>
- D - I - 0x037388 23:B378: 47        .byte $47    ; <キ>
- D - I - 0x037389 23:B379: 12        .byte $12    ; <つ>
- D - I - 0x03738A 23:B37A: 1F        .byte $1F    ; <ま>
- D - I - 0x03738B 23:B37B: 35        .byte $35    ; <2>
- D - I - 0x03738C 23:B37C: 37        .byte $37    ; <4>
- D - I - 0x03738D 23:B37D: 79        .byte $79    ; <!>
- D - I - 0x03738E 23:B37E: 57        .byte $57    ; <ヌ>
- D - I - 0x03738F 23:B37F: F0        .byte $F0
- D - I - 0x037390 23:B380: F0        .byte $F0
- D - I - 0x037391 23:B381: 5C        .byte $5C    ; <フ>
- D - I - 0x037392 23:B382: 51        .byte $51    ; <チ>
- D - I - 0x037393 23:B383: F0        .byte $F0
- D - I - 0x037394 23:B384: 99        .byte $99
- D - I - 0x037395 23:B385: 65        .byte $65    ; <ユ>
- D - I - 0x037396 23:B386: 7E        .byte $7E    ; <.>
- D - I - 0x037397 23:B387: 94        .byte $94
- D - I - 0x037398 23:B388: 94        .byte $94
- D - I - 0x037399 23:B389: 6E        .byte $6E    ; <ン>
- D - I - 0x03739A 23:B38A: 34        .byte $34    ; <1>
- D - I - 0x03739B 23:B38B: 45        .byte $45    ; <オ>
- D - I - 0x03739C 23:B38C: 5D        .byte $5D    ; <ヘ>
- D - I - 0x03739D 23:B38D: 2A        .byte $2A    ; <れ>
- D - I - 0x03739E 23:B38E: 37        .byte $37    ; <4>
- D - I - 0x03739F 23:B38F: 87        .byte $87    ; <G>
- D - I - 0x0373A0 23:B390: 59        .byte $59    ; <ノ>
- D - I - 0x0373A1 23:B391: B6        .byte $B6    ; <グ>
- D - I - 0x0373A2 23:B392: A0        .byte $A0    ; <が>
- D - I - 0x0373A3 23:B393: 74        .byte $74    ; <ィ>
- D - I - 0x0373A4 23:B394: 8F        .byte $8F    ; <S>
- D - I - 0x0373A5 23:B395: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0373A6 23:B396: 8C        .byte $8C    ; <M>
- D - I - 0x0373A7 23:B397: F0        .byte $F0
- D - I - 0x0373A8 23:B398: F0        .byte $F0
- D - I - 0x0373A9 23:B399: 96        .byte $96
- D - I - 0x0373AA 23:B39A: BB        .byte $BB    ; <ズ>
- D - I - 0x0373AB 23:B39B: C3        .byte $C3    ; <バ>
- D - I - 0x0373AC 23:B39C: C5        .byte $C5    ; <ブ>
- - - - - 0x0373AD 23:B39D: 63        .byte $63    ; <モ>
- - - - - 0x0373AE 23:B39E: 91        .byte $91    ; <V>
- - - - - 0x0373AF 23:B39F: 69        .byte $69    ; <ル>
- - - - - 0x0373B0 23:B3A0: 8F        .byte $8F    ; <S>
- - - - - 0x0373B1 23:B3A1: 5A        .byte $5A    ; <ハ>
- - - - - 0x0373B2 23:B3A2: 50        .byte $50    ; <タ>
- - - - - 0x0373B3 23:B3A3: 7E        .byte $7E    ; <.>
- - - - - 0x0373B4 23:B3A4: A1        .byte $A1    ; <ぎ>
- - - - - 0x0373B5 23:B3A5: B8        .byte $B8    ; <ゴ>
- - - - - 0x0373B6 23:B3A6: CE        .byte $CE    ; <ピ>
- - - - - 0x0373B7 23:B3A7: F0        .byte $F0
- - - - - 0x0373B8 23:B3A8: F0        .byte $F0
- - - - - 0x0373B9 23:B3A9: 97        .byte $97
- - - - - 0x0373BA 23:B3AA: 8D        .byte $8D    ; <P>
- - - - - 0x0373BB 23:B3AB: F0        .byte $F0
- - - - - 0x0373BC 23:B3AC: F0        .byte $F0
- - - - - 0x0373BD 23:B3AD: B3        .byte $B3    ; <ぼ>
- - - - - 0x0373BE 23:B3AE: D3        .byte $D3
- - - - - 0x0373BF 23:B3AF: E9        .byte $E9
- - - - - 0x0373C0 23:B3B0: E9        .byte $E9
off_B3B1_07:
- D - I - 0x0373C1 23:B3B1: F0        .byte $F0
- D - I - 0x0373C2 23:B3B2: F0        .byte $F0
- D - I - 0x0373C3 23:B3B3: 07        .byte $07    ; <き>
- D - I - 0x0373C4 23:B3B4: 07        .byte $07    ; <き>
- D - I - 0x0373C5 23:B3B5: 04        .byte $04    ; <え>
- D - I - 0x0373C6 23:B3B6: 04        .byte $04    ; <え>
- D - I - 0x0373C7 23:B3B7: F0        .byte $F0
- D - I - 0x0373C8 23:B3B8: 0F        .byte $0F    ; <そ>
- D - I - 0x0373C9 23:B3B9: F0        .byte $F0
- D - I - 0x0373CA 23:B3BA: F0        .byte $F0
- D - I - 0x0373CB 23:B3BB: 1E        .byte $1E    ; <ほ>
- D - I - 0x0373CC 23:B3BC: 1E        .byte $1E    ; <ほ>
- D - I - 0x0373CD 23:B3BD: 11        .byte $11    ; <ち>
- - - - - 0x0373CE 23:B3BE: 11        .byte $11    ; <ち>
- D - I - 0x0373CF 23:B3BF: 34        .byte $34    ; <1>
- D - I - 0x0373D0 23:B3C0: 5A        .byte $5A    ; <ハ>
- D - I - 0x0373D1 23:B3C1: 1C        .byte $1C    ; <ふ>
- D - I - 0x0373D2 23:B3C2: 1C        .byte $1C    ; <ふ>
- D - I - 0x0373D3 23:B3C3: F0        .byte $F0
- D - I - 0x0373D4 23:B3C4: F0        .byte $F0
- D - I - 0x0373D5 23:B3C5: F0        .byte $F0
- D - I - 0x0373D6 23:B3C6: 24        .byte $24    ; <や>
- D - I - 0x0373D7 23:B3C7: 05        .byte $05    ; <お>
- D - I - 0x0373D8 23:B3C8: 05        .byte $05    ; <お>
- D - I - 0x0373D9 23:B3C9: 1C        .byte $1C    ; <ふ>
- D - I - 0x0373DA 23:B3CA: 04        .byte $04    ; <え>
- D - I - 0x0373DB 23:B3CB: F0        .byte $F0
- D - I - 0x0373DC 23:B3CC: 1B        .byte $1B    ; <ひ>
- D - I - 0x0373DD 23:B3CD: F0        .byte $F0
- D - I - 0x0373DE 23:B3CE: F0        .byte $F0
- D - I - 0x0373DF 23:B3CF: 29        .byte $29    ; <る>
- D - I - 0x0373E0 23:B3D0: 36        .byte $36    ; <3>
- D - I - 0x0373E1 23:B3D1: F0        .byte $F0
- - - - - 0x0373E2 23:B3D2: 33        .byte $33    ; <0>
- D - I - 0x0373E3 23:B3D3: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0373E4 23:B3D4: 80        .byte $80
- D - I - 0x0373E5 23:B3D5: F0        .byte $F0
- D - I - 0x0373E6 23:B3D6: F0        .byte $F0
- D - I - 0x0373E7 23:B3D7: F0        .byte $F0
- D - I - 0x0373E8 23:B3D8: F0        .byte $F0
- D - I - 0x0373E9 23:B3D9: F0        .byte $F0
- D - I - 0x0373EA 23:B3DA: 3C        .byte $3C    ; <9>
- D - I - 0x0373EB 23:B3DB: 1D        .byte $1D    ; <へ>
- D - I - 0x0373EC 23:B3DC: 43        .byte $43    ; <ウ>
- D - I - 0x0373ED 23:B3DD: 1B        .byte $1B    ; <ひ>
- D - I - 0x0373EE 23:B3DE: 1C        .byte $1C    ; <ふ>
- D - I - 0x0373EF 23:B3DF: F0        .byte $F0
- D - I - 0x0373F0 23:B3E0: 3E        .byte $3E    ; <Jr>
- D - I - 0x0373F1 23:B3E1: F0        .byte $F0
- D - I - 0x0373F2 23:B3E2: F0        .byte $F0
- D - I - 0x0373F3 23:B3E3: F0        .byte $F0
- D - I - 0x0373F4 23:B3E4: 65        .byte $65    ; <ユ>
- D - I - 0x0373F5 23:B3E5: 34        .byte $34    ; <1>
- D - I - 0x0373F6 23:B3E6: 4C        .byte $4C    ; <シ>
- D - I - 0x0373F7 23:B3E7: F0        .byte $F0
- D - I - 0x0373F8 23:B3E8: 7E        .byte $7E    ; <.>
- D - I - 0x0373F9 23:B3E9: 57        .byte $57    ; <ヌ>
- D - I - 0x0373FA 23:B3EA: 57        .byte $57    ; <ヌ>
- D - I - 0x0373FB 23:B3EB: F0        .byte $F0
- D - I - 0x0373FC 23:B3EC: F0        .byte $F0
- D - I - 0x0373FD 23:B3ED: 6C        .byte $6C    ; <ワ>
- D - I - 0x0373FE 23:B3EE: 4A        .byte $4A    ; <コ>
- D - I - 0x0373FF 23:B3EF: 36        .byte $36    ; <3>
- D - I - 0x037400 23:B3F0: 72        .byte $72    ; <ョ>
- D - I - 0x037401 23:B3F1: 33        .byte $33    ; <0>
- D - I - 0x037402 23:B3F2: 28        .byte $28    ; <り>
- D - I - 0x037403 23:B3F3: F0        .byte $F0
- D - I - 0x037404 23:B3F4: 57        .byte $57    ; <ヌ>
- - - - - 0x037405 23:B3F5: F0        .byte $F0
- D - I - 0x037406 23:B3F6: 79        .byte $79    ; <!>
- D - I - 0x037407 23:B3F7: F0        .byte $F0
- D - I - 0x037408 23:B3F8: 89        .byte $89    ; <I>
- D - I - 0x037409 23:B3F9: 59        .byte $59    ; <ノ>
- D - I - 0x03740A 23:B3FA: 70        .byte $70    ; <ャ>
- D - I - 0x03740B 23:B3FB: F0        .byte $F0
- D - I - 0x03740C 23:B3FC: AE        .byte $AE    ; <ど>
- D - I - 0x03740D 23:B3FD: F0        .byte $F0
- - - - - 0x03740E 23:B3FE: F0        .byte $F0
- - - - - 0x03740F 23:B3FF: F0        .byte $F0
- D - I - 0x037410 23:B400: F0        .byte $F0
- D - I - 0x037411 23:B401: 84        .byte $84    ; <D>
- - - - - 0x037412 23:B402: 62        .byte $62    ; <メ>
- - - - - 0x037413 23:B403: 67        .byte $67    ; <ラ>
- D - I - 0x037414 23:B404: 97        .byte $97
- D - I - 0x037415 23:B405: 4B        .byte $4B    ; <サ>
- - - - - 0x037416 23:B406: 59        .byte $59    ; <ノ>
- D - I - 0x037417 23:B407: F0        .byte $F0
- - - - - 0x037418 23:B408: 87        .byte $87    ; <G>
- D - I - 0x037419 23:B409: F0        .byte $F0
- - - - - 0x03741A 23:B40A: F0        .byte $F0
- - - - - 0x03741B 23:B40B: F0        .byte $F0
- D - I - 0x03741C 23:B40C: A0        .byte $A0    ; <が>
- D - I - 0x03741D 23:B40D: 70        .byte $70    ; <ャ>
- - - - - 0x03741E 23:B40E: 7D        .byte $7D    ; <ー>
- - - - - 0x03741F 23:B40F: D0        .byte $D0    ; <ペ>
- D - I - 0x037420 23:B410: D0        .byte $D0    ; <ペ>
- - - - - 0x037421 23:B411: F0        .byte $F0
- D - I - 0x037422 23:B412: 91        .byte $91    ; <V>
- D - I - 0x037423 23:B413: F0        .byte $F0
- - - - - 0x037424 23:B414: F0        .byte $F0
- D - I - 0x037425 23:B415: F0        .byte $F0
- D - I - 0x037426 23:B416: 04        .byte $04    ; <え>
- D - I - 0x037427 23:B417: F0        .byte $F0
- D - I - 0x037428 23:B418: 07        .byte $07    ; <き>
- D - I - 0x037429 23:B419: F0        .byte $F0
- D - I - 0x03742A 23:B41A: F0        .byte $F0
- D - I - 0x03742B 23:B41B: F0        .byte $F0
- D - I - 0x03742C 23:B41C: 1D        .byte $1D    ; <へ>
- D - I - 0x03742D 23:B41D: F0        .byte $F0
- D - I - 0x03742E 23:B41E: F0        .byte $F0
- D - I - 0x03742F 23:B41F: F0        .byte $F0
- D - I - 0x037430 23:B420: F0        .byte $F0
- D - I - 0x037431 23:B421: F0        .byte $F0
- D - I - 0x037432 23:B422: 12        .byte $12    ; <つ>
- D - I - 0x037433 23:B423: 38        .byte $38    ; <5>
- D - I - 0x037434 23:B424: 74        .byte $74    ; <ィ>
- D - I - 0x037435 23:B425: F0        .byte $F0
- D - I - 0x037436 23:B426: 1E        .byte $1E    ; <ほ>
- D - I - 0x037437 23:B427: 33        .byte $33    ; <0>
- D - I - 0x037438 23:B428: 6F        .byte $6F    ; <ッ>
- D - I - 0x037439 23:B429: 03        .byte $03    ; <う>
- D - I - 0x03743A 23:B42A: 10        .byte $10    ; <た>
- D - I - 0x03743B 23:B42B: 13        .byte $13    ; <て>
- D - I - 0x03743C 23:B42C: 08        .byte $08    ; <く>
- D - I - 0x03743D 23:B42D: F0        .byte $F0
- D - I - 0x03743E 23:B42E: 05        .byte $05    ; <お>
- D - I - 0x03743F 23:B42F: F0        .byte $F0
- D - I - 0x037440 23:B430: 28        .byte $28    ; <り>
- D - I - 0x037441 23:B431: F0        .byte $F0
- D - I - 0x037442 23:B432: 3F        .byte $3F    ; <•>
- D - I - 0x037443 23:B433: F0        .byte $F0
- D - I - 0x037444 23:B434: 2B        .byte $2B    ; <ろ>
- D - I - 0x037445 23:B435: F0        .byte $F0
- D - I - 0x037446 23:B436: 1E        .byte $1E    ; <ほ>
- D - I - 0x037447 23:B437: F0        .byte $F0
- D - I - 0x037448 23:B438: 44        .byte $44    ; <エ>
- D - I - 0x037449 23:B439: F0        .byte $F0
- D - I - 0x03744A 23:B43A: F0        .byte $F0
- D - I - 0x03744B 23:B43B: F0        .byte $F0
- D - I - 0x03744C 23:B43C: 5A        .byte $5A    ; <ハ>
- D - I - 0x03744D 23:B43D: 55        .byte $55    ; <ナ>
- D - I - 0x03744E 23:B43E: 1B        .byte $1B    ; <ひ>
- D - I - 0x03744F 23:B43F: 20        .byte $20    ; <み>
- D - I - 0x037450 23:B440: 5E        .byte $5E    ; <ホ>
- D - I - 0x037451 23:B441: 11        .byte $11    ; <ち>
- D - I - 0x037452 23:B442: 12        .byte $12    ; <つ>
- D - I - 0x037453 23:B443: 4B        .byte $4B    ; <サ>
- D - I - 0x037454 23:B444: 35        .byte $35    ; <2>
- D - I - 0x037455 23:B445: F0        .byte $F0
- D - I - 0x037456 23:B446: 63        .byte $63    ; <モ>
- D - I - 0x037457 23:B447: F0        .byte $F0
- D - I - 0x037458 23:B448: 68        .byte $68    ; <リ>
- D - I - 0x037459 23:B449: 36        .byte $36    ; <3>
- D - I - 0x03745A 23:B44A: 4F        .byte $4F    ; <ソ>
- D - I - 0x03745B 23:B44B: F0        .byte $F0
- D - I - 0x03745C 23:B44C: F0        .byte $F0
- D - I - 0x03745D 23:B44D: F0        .byte $F0
- D - I - 0x03745E 23:B44E: 59        .byte $59    ; <ノ>
- D - I - 0x03745F 23:B44F: F0        .byte $F0
- D - I - 0x037460 23:B450: F0        .byte $F0
- D - I - 0x037461 23:B451: 79        .byte $79    ; <!>
- D - I - 0x037462 23:B452: 3F        .byte $3F    ; <•>
- D - I - 0x037463 23:B453: 44        .byte $44    ; <エ>
- D - I - 0x037464 23:B454: 82        .byte $82    ; <B>
- D - I - 0x037465 23:B455: 4D        .byte $4D    ; <ス>
- D - I - 0x037466 23:B456: 5A        .byte $5A    ; <ハ>
- D - I - 0x037467 23:B457: F0        .byte $F0
- D - I - 0x037468 23:B458: 58        .byte $58    ; <ネ>
- D - I - 0x037469 23:B459: F0        .byte $F0
- D - I - 0x03746A 23:B45A: 9F        .byte $9F
- D - I - 0x03746B 23:B45B: F0        .byte $F0
- D - I - 0x03746C 23:B45C: A4        .byte $A4    ; <ご>
- D - I - 0x03746D 23:B45D: F0        .byte $F0
- D - I - 0x03746E 23:B45E: 5A        .byte $5A    ; <ハ>
- D - I - 0x03746F 23:B45F: F0        .byte $F0
- D - I - 0x037470 23:B460: F0        .byte $F0
- D - I - 0x037471 23:B461: F0        .byte $F0
- D - I - 0x037472 23:B462: 71        .byte $71    ; <ュ>
- D - I - 0x037473 23:B463: F0        .byte $F0
- D - I - 0x037474 23:B464: F0        .byte $F0
- D - I - 0x037475 23:B465: 9D        .byte $9D
- - - - - 0x037476 23:B466: 62        .byte $62    ; <メ>
- - - - - 0x037477 23:B467: 68        .byte $68    ; <リ>
- D - I - 0x037478 23:B468: A6        .byte $A6    ; <じ>
- - - - - 0x037479 23:B469: 4D        .byte $4D    ; <ス>
- D - I - 0x03747A 23:B46A: 5A        .byte $5A    ; <ハ>
- D - I - 0x03747B 23:B46B: 94        .byte $94
- - - - - 0x03747C 23:B46C: 88        .byte $88    ; <H>
- D - I - 0x03747D 23:B46D: F0        .byte $F0
- - - - - 0x03747E 23:B46E: B6        .byte $B6    ; <グ>
- - - - - 0x03747F 23:B46F: F0        .byte $F0
- D - I - 0x037480 23:B470: BD        .byte $BD    ; <ゾ>
- - - - - 0x037481 23:B471: 8B        .byte $8B    ; <K>
- D - I - 0x037482 23:B472: 98        .byte $98
- D - I - 0x037483 23:B473: F0        .byte $F0
- - - - - 0x037484 23:B474: F0        .byte $F0
- - - - - 0x037485 23:B475: F0        .byte $F0
- D - I - 0x037486 23:B476: B9        .byte $B9    ; <ザ>
- D - I - 0x037487 23:B477: F0        .byte $F0
- - - - - 0x037488 23:B478: F0        .byte $F0
- D - I - 0x037489 23:B479: 04        .byte $04    ; <え>
- D - I - 0x03748A 23:B47A: 04        .byte $04    ; <え>
- D - I - 0x03748B 23:B47B: F0        .byte $F0
- D - I - 0x03748C 23:B47C: F0        .byte $F0
- D - I - 0x03748D 23:B47D: 07        .byte $07    ; <き>
- D - I - 0x03748E 23:B47E: 07        .byte $07    ; <き>
- D - I - 0x03748F 23:B47F: 12        .byte $12    ; <つ>
- D - I - 0x037490 23:B480: 12        .byte $12    ; <つ>
- D - I - 0x037491 23:B481: 1D        .byte $1D    ; <へ>
- D - I - 0x037492 23:B482: 1D        .byte $1D    ; <へ>
- D - I - 0x037493 23:B483: F0        .byte $F0
- D - I - 0x037494 23:B484: F0        .byte $F0
- - - - - 0x037495 23:B485: F0        .byte $F0
- D - I - 0x037496 23:B486: 14        .byte $14    ; <と>
- D - I - 0x037497 23:B487: F0        .byte $F0
- D - I - 0x037498 23:B488: F0        .byte $F0
- D - I - 0x037499 23:B489: 1F        .byte $1F    ; <ま>
- D - I - 0x03749A 23:B48A: 1F        .byte $1F    ; <ま>
- D - I - 0x03749B 23:B48B: 57        .byte $57    ; <ヌ>
- D - I - 0x03749C 23:B48C: 37        .byte $37    ; <4>
- D - I - 0x03749D 23:B48D: 06        .byte $06    ; <か>
- D - I - 0x03749E 23:B48E: 06        .byte $06    ; <か>
- D - I - 0x03749F 23:B48F: F0        .byte $F0
- D - I - 0x0374A0 23:B490: 2F        .byte $2F    ; <っ>
- D - I - 0x0374A1 23:B491: 07        .byte $07    ; <き>
- D - I - 0x0374A2 23:B492: 1F        .byte $1F    ; <ま>
- D - I - 0x0374A3 23:B493: F0        .byte $F0
- D - I - 0x0374A4 23:B494: 2B        .byte $2B    ; <ろ>
- D - I - 0x0374A5 23:B495: 1D        .byte $1D    ; <へ>
- D - I - 0x0374A6 23:B496: 1D        .byte $1D    ; <へ>
- D - I - 0x0374A7 23:B497: F0        .byte $F0
- D - I - 0x0374A8 23:B498: F0        .byte $F0
- D - I - 0x0374A9 23:B499: F0        .byte $F0
- D - I - 0x0374AA 23:B49A: 20        .byte $20    ; <み>
- D - I - 0x0374AB 23:B49B: F0        .byte $F0
- D - I - 0x0374AC 23:B49C: F0        .byte $F0
- D - I - 0x0374AD 23:B49D: F0        .byte $F0
- D - I - 0x0374AE 23:B49E: 38        .byte $38    ; <5>
- D - I - 0x0374AF 23:B49F: 63        .byte $63    ; <モ>
- D - I - 0x0374B0 23:B4A0: 4C        .byte $4C    ; <シ>
- D - I - 0x0374B1 23:B4A1: 40        .byte $40    ; <「>
- D - I - 0x0374B2 23:B4A2: 1E        .byte $1E    ; <ほ>
- D - I - 0x0374B3 23:B4A3: F0        .byte $F0
- D - I - 0x0374B4 23:B4A4: 47        .byte $47    ; <キ>
- D - I - 0x0374B5 23:B4A5: 1F        .byte $1F    ; <ま>
- D - I - 0x0374B6 23:B4A6: 20        .byte $20    ; <み>
- D - I - 0x0374B7 23:B4A7: 37        .byte $37    ; <4>
- D - I - 0x0374B8 23:B4A8: 4F        .byte $4F    ; <ソ>
- D - I - 0x0374B9 23:B4A9: F0        .byte $F0
- D - I - 0x0374BA 23:B4AA: 59        .byte $59    ; <ノ>
- D - I - 0x0374BB 23:B4AB: F0        .byte $F0
- D - I - 0x0374BC 23:B4AC: F0        .byte $F0
- D - I - 0x0374BD 23:B4AD: F0        .byte $F0
- D - I - 0x0374BE 23:B4AE: 45        .byte $45    ; <オ>
- D - I - 0x0374BF 23:B4AF: F0        .byte $F0
- D - I - 0x0374C0 23:B4B0: F0        .byte $F0
- D - I - 0x0374C1 23:B4B1: F0        .byte $F0
- D - I - 0x0374C2 23:B4B2: 5C        .byte $5C    ; <フ>
- D - I - 0x0374C3 23:B4B3: F0        .byte $F0
- D - I - 0x0374C4 23:B4B4: 7E        .byte $7E    ; <.>
- D - I - 0x0374C5 23:B4B5: 71        .byte $71    ; <ュ>
- D - I - 0x0374C6 23:B4B6: 35        .byte $35    ; <2>
- D - I - 0x0374C7 23:B4B7: 51        .byte $51    ; <チ>
- D - I - 0x0374C8 23:B4B8: 8F        .byte $8F    ; <S>
- D - I - 0x0374C9 23:B4B9: 2B        .byte $2B    ; <ろ>
- D - I - 0x0374CA 23:B4BA: 38        .byte $38    ; <5>
- D - I - 0x0374CB 23:B4BB: 4E        .byte $4E    ; <セ>
- D - I - 0x0374CC 23:B4BC: 7E        .byte $7E    ; <.>
- D - I - 0x0374CD 23:B4BD: F0        .byte $F0
- D - I - 0x0374CE 23:B4BE: 96        .byte $96
- D - I - 0x0374CF 23:B4BF: F0        .byte $F0
- D - I - 0x0374D0 23:B4C0: 81        .byte $81    ; <A>
- D - I - 0x0374D1 23:B4C1: F0        .byte $F0
- D - I - 0x0374D2 23:B4C2: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0374D3 23:B4C3: F0        .byte $F0
- D - I - 0x0374D4 23:B4C4: F0        .byte $F0
- D - I - 0x0374D5 23:B4C5: F0        .byte $F0
- D - I - 0x0374D6 23:B4C6: F0        .byte $F0
- D - I - 0x0374D7 23:B4C7: F0        .byte $F0
- D - I - 0x0374D8 23:B4C8: BB        .byte $BB    ; <ズ>
- - - - - 0x0374D9 23:B4C9: 64        .byte $64    ; <ヤ>
- - - - - 0x0374DA 23:B4CA: 94        .byte $94
- - - - - 0x0374DB 23:B4CB: 69        .byte $69    ; <ル>
- - - - - 0x0374DC 23:B4CC: 8F        .byte $8F    ; <S>
- - - - - 0x0374DD 23:B4CD: 5A        .byte $5A    ; <ハ>
- - - - - 0x0374DE 23:B4CE: 50        .byte $50    ; <タ>
- - - - - 0x0374DF 23:B4CF: 8A        .byte $8A    ; <N>
- - - - - 0x0374E0 23:B4D0: A4        .byte $A4    ; <ご>
- - - - - 0x0374E1 23:B4D1: F0        .byte $F0
- - - - - 0x0374E2 23:B4D2: AE        .byte $AE    ; <ど>
- - - - - 0x0374E3 23:B4D3: F0        .byte $F0
- - - - - 0x0374E4 23:B4D4: F0        .byte $F0
- - - - - 0x0374E5 23:B4D5: F0        .byte $F0
- - - - - 0x0374E6 23:B4D6: 80        .byte $80
- - - - - 0x0374E7 23:B4D7: F0        .byte $F0
- - - - - 0x0374E8 23:B4D8: F0        .byte $F0
- - - - - 0x0374E9 23:B4D9: F0        .byte $F0
- - - - - 0x0374EA 23:B4DA: B2        .byte $B2    ; <べ>
- - - - - 0x0374EB 23:B4DB: F0        .byte $F0
- - - - - 0x0374EC 23:B4DC: D3        .byte $D3
off_B4DD_08:
- D - I - 0x0374ED 23:B4DD: F0        .byte $F0
- D - I - 0x0374EE 23:B4DE: F0        .byte $F0
- D - I - 0x0374EF 23:B4DF: 07        .byte $07    ; <き>
- D - I - 0x0374F0 23:B4E0: 07        .byte $07    ; <き>
- D - I - 0x0374F1 23:B4E1: 04        .byte $04    ; <え>
- D - I - 0x0374F2 23:B4E2: 04        .byte $04    ; <え>
- D - I - 0x0374F3 23:B4E3: F0        .byte $F0
- D - I - 0x0374F4 23:B4E4: 0F        .byte $0F    ; <そ>
- D - I - 0x0374F5 23:B4E5: F0        .byte $F0
- D - I - 0x0374F6 23:B4E6: F0        .byte $F0
- D - I - 0x0374F7 23:B4E7: 1E        .byte $1E    ; <ほ>
- D - I - 0x0374F8 23:B4E8: 1E        .byte $1E    ; <ほ>
- D - I - 0x0374F9 23:B4E9: 11        .byte $11    ; <ち>
- D - I - 0x0374FA 23:B4EA: 11        .byte $11    ; <ち>
- D - I - 0x0374FB 23:B4EB: 7E        .byte $7E    ; <.>
- D - I - 0x0374FC 23:B4EC: 59        .byte $59    ; <ノ>
- D - I - 0x0374FD 23:B4ED: 1C        .byte $1C    ; <ふ>
- D - I - 0x0374FE 23:B4EE: 1C        .byte $1C    ; <ふ>
- D - I - 0x0374FF 23:B4EF: 56        .byte $56    ; <ニ>
- D - I - 0x037500 23:B4F0: 7A        .byte $7A    ; <、>
- D - I - 0x037501 23:B4F1: 0D        .byte $0D    ; <す>
- D - I - 0x037502 23:B4F2: 0F        .byte $0F    ; <そ>
- D - I - 0x037503 23:B4F3: 05        .byte $05    ; <お>
- D - I - 0x037504 23:B4F4: 05        .byte $05    ; <お>
- D - I - 0x037505 23:B4F5: 04        .byte $04    ; <え>
- D - I - 0x037506 23:B4F6: 04        .byte $04    ; <え>
- D - I - 0x037507 23:B4F7: F0        .byte $F0
- D - I - 0x037508 23:B4F8: 26        .byte $26    ; <よ>
- D - I - 0x037509 23:B4F9: F0        .byte $F0
- D - I - 0x03750A 23:B4FA: F0        .byte $F0
- D - I - 0x03750B 23:B4FB: 29        .byte $29    ; <る>
- D - I - 0x03750C 23:B4FC: 1F        .byte $1F    ; <ま>
- D - I - 0x03750D 23:B4FD: 1B        .byte $1B    ; <ひ>
- D - I - 0x03750E 23:B4FE: 1C        .byte $1C    ; <ふ>
- D - I - 0x03750F 23:B4FF: 7C        .byte $7C    ; <~>
- D - I - 0x037510 23:B500: 80        .byte $80
- D - I - 0x037511 23:B501: 33        .byte $33    ; <0>
- D - I - 0x037512 23:B502: 36        .byte $36    ; <3>
- D - I - 0x037513 23:B503: F0        .byte $F0
- D - I - 0x037514 23:B504: F0        .byte $F0
- D - I - 0x037515 23:B505: 3C        .byte $3C    ; <9>
- D - I - 0x037516 23:B506: 19        .byte $19    ; <の>
- D - I - 0x037517 23:B507: 13        .byte $13    ; <て>
- D - I - 0x037518 23:B508: 39        .byte $39    ; <6>
- D - I - 0x037519 23:B509: 03        .byte $03    ; <う>
- D - I - 0x03751A 23:B50A: 10        .byte $10    ; <た>
- D - I - 0x03751B 23:B50B: 1B        .byte $1B    ; <ひ>
- D - I - 0x03751C 23:B50C: 33        .byte $33    ; <0>
- D - I - 0x03751D 23:B50D: F0        .byte $F0
- D - I - 0x03751E 23:B50E: F0        .byte $F0
- D - I - 0x03751F 23:B50F: 43        .byte $43    ; <ウ>
- D - I - 0x037520 23:B510: 69        .byte $69    ; <ル>
- D - I - 0x037521 23:B511: 35        .byte $35    ; <2>
- D - I - 0x037522 23:B512: 1D        .byte $1D    ; <へ>
- D - I - 0x037523 23:B513: 96        .byte $96
- D - I - 0x037524 23:B514: 7F        .byte $7F    ; <,>
- D - I - 0x037525 23:B515: 3E        .byte $3E    ; <Jr>
- D - I - 0x037526 23:B516: 4E        .byte $4E    ; <セ>
- D - I - 0x037527 23:B517: F0        .byte $F0
- D - I - 0x037528 23:B518: F0        .byte $F0
- - - - - 0x037529 23:B519: 30        .byte $30    ; <ゃ>
- D - I - 0x03752A 23:B51A: 49        .byte $49    ; <ケ>
- D - I - 0x03752B 23:B51B: 51        .byte $51    ; <チ>
- D - I - 0x03752C 23:B51C: 37        .byte $37    ; <4>
- D - I - 0x03752D 23:B51D: 27        .byte $27    ; <ら>
- D - I - 0x03752E 23:B51E: 1D        .byte $1D    ; <へ>
- D - I - 0x03752F 23:B51F: 3E        .byte $3E    ; <Jr>
- D - I - 0x037530 23:B520: 57        .byte $57    ; <ヌ>
- D - I - 0x037531 23:B521: 6C        .byte $6C    ; <ワ>
- D - I - 0x037532 23:B522: 6E        .byte $6E    ; <ン>
- D - I - 0x037533 23:B523: 74        .byte $74    ; <ィ>
- D - I - 0x037534 23:B524: A5        .byte $A5    ; <ざ>
- D - I - 0x037535 23:B525: 35        .byte $35    ; <2>
- D - I - 0x037536 23:B526: 66        .byte $66    ; <ヨ>
- D - I - 0x037537 23:B527: B8        .byte $B8    ; <ゴ>
- D - I - 0x037538 23:B528: BB        .byte $BB    ; <ズ>
- D - I - 0x037539 23:B529: F0        .byte $F0
- D - I - 0x03753A 23:B52A: 70        .byte $70    ; <ャ>
- D - I - 0x03753B 23:B52B: F0        .byte $F0
- D - I - 0x03753C 23:B52C: F0        .byte $F0
- D - I - 0x03753D 23:B52D: 6C        .byte $6C    ; <ワ>
- - - - - 0x03753E 23:B52E: 56        .byte $56    ; <ニ>
- D - I - 0x03753F 23:B52F: 5C        .byte $5C    ; <フ>
- D - I - 0x037540 23:B530: 82        .byte $82    ; <B>
- D - I - 0x037541 23:B531: 3F        .byte $3F    ; <•>
- D - I - 0x037542 23:B532: 4D        .byte $4D    ; <ス>
- D - I - 0x037543 23:B533: 85        .byte $85    ; <E>
- D - I - 0x037544 23:B534: 6F        .byte $6F    ; <ッ>
- D - I - 0x037545 23:B535: F0        .byte $F0
- D - I - 0x037546 23:B536: 9C        .byte $9C
- D - I - 0x037547 23:B537: 97        .byte $97
- D - I - 0x037548 23:B538: BD        .byte $BD    ; <ゾ>
- D - I - 0x037549 23:B539: 65        .byte $65    ; <ユ>
- D - I - 0x03754A 23:B53A: 89        .byte $89    ; <I>
- D - I - 0x03754B 23:B53B: EA        .byte $EA
- D - I - 0x03754C 23:B53C: EA        .byte $EA
- D - I - 0x03754D 23:B53D: 93        .byte $93    ; <Y>
- D - I - 0x03754E 23:B53E: AD        .byte $AD    ; <で>
- D - I - 0x03754F 23:B53F: F0        .byte $F0
- - - - - 0x037550 23:B540: F0        .byte $F0
- D - I - 0x037551 23:B541: F0        .byte $F0
- D - I - 0x037552 23:B542: 04        .byte $04    ; <え>
- D - I - 0x037553 23:B543: F0        .byte $F0
- D - I - 0x037554 23:B544: 07        .byte $07    ; <き>
- D - I - 0x037555 23:B545: F0        .byte $F0
- D - I - 0x037556 23:B546: F0        .byte $F0
- D - I - 0x037557 23:B547: F0        .byte $F0
- D - I - 0x037558 23:B548: F0        .byte $F0
- D - I - 0x037559 23:B549: F0        .byte $F0
- D - I - 0x03755A 23:B54A: 1D        .byte $1D    ; <へ>
- D - I - 0x03755B 23:B54B: F0        .byte $F0
- D - I - 0x03755C 23:B54C: 12        .byte $12    ; <つ>
- D - I - 0x03755D 23:B54D: F0        .byte $F0
- D - I - 0x03755E 23:B54E: F0        .byte $F0
- D - I - 0x03755F 23:B54F: 44        .byte $44    ; <エ>
- D - I - 0x037560 23:B550: 80        .byte $80
- D - I - 0x037561 23:B551: F0        .byte $F0
- D - I - 0x037562 23:B552: 1E        .byte $1E    ; <ほ>
- D - I - 0x037563 23:B553: 4B        .byte $4B    ; <サ>
- D - I - 0x037564 23:B554: 6F        .byte $6F    ; <ッ>
- D - I - 0x037565 23:B555: 03        .byte $03    ; <う>
- D - I - 0x037566 23:B556: 10        .byte $10    ; <た>
- D - I - 0x037567 23:B557: 13        .byte $13    ; <て>
- D - I - 0x037568 23:B558: 08        .byte $08    ; <く>
- D - I - 0x037569 23:B559: F0        .byte $F0
- D - I - 0x03756A 23:B55A: 05        .byte $05    ; <お>
- D - I - 0x03756B 23:B55B: F0        .byte $F0
- D - I - 0x03756C 23:B55C: 28        .byte $28    ; <り>
- D - I - 0x03756D 23:B55D: F0        .byte $F0
- D - I - 0x03756E 23:B55E: 3F        .byte $3F    ; <•>
- D - I - 0x03756F 23:B55F: F0        .byte $F0
- D - I - 0x037570 23:B560: 2B        .byte $2B    ; <ろ>
- D - I - 0x037571 23:B561: F0        .byte $F0
- D - I - 0x037572 23:B562: 1E        .byte $1E    ; <ほ>
- D - I - 0x037573 23:B563: 73        .byte $73    ; <ヮ>
- D - I - 0x037574 23:B564: 69        .byte $69    ; <ル>
- D - I - 0x037575 23:B565: F0        .byte $F0
- D - I - 0x037576 23:B566: F0        .byte $F0
- D - I - 0x037577 23:B567: 56        .byte $56    ; <ニ>
- D - I - 0x037578 23:B568: 6F        .byte $6F    ; <ッ>
- D - I - 0x037579 23:B569: 48        .byte $48    ; <ク>
- D - I - 0x03757A 23:B56A: 0F        .byte $0F    ; <そ>
- D - I - 0x03757B 23:B56B: 14        .byte $14    ; <と>
- D - I - 0x03757C 23:B56C: 53        .byte $53    ; <テ>
- D - I - 0x03757D 23:B56D: 05        .byte $05    ; <お>
- D - I - 0x03757E 23:B56E: 06        .byte $06    ; <か>
- D - I - 0x03757F 23:B56F: 1C        .byte $1C    ; <ふ>
- D - I - 0x037580 23:B570: 35        .byte $35    ; <2>
- D - I - 0x037581 23:B571: 26        .byte $26    ; <よ>
- D - I - 0x037582 23:B572: 62        .byte $62    ; <メ>
- D - I - 0x037583 23:B573: 39        .byte $39    ; <6>
- D - I - 0x037584 23:B574: 69        .byte $69    ; <ル>
- D - I - 0x037585 23:B575: 1E        .byte $1E    ; <ほ>
- D - I - 0x037586 23:B576: 4F        .byte $4F    ; <ソ>
- D - I - 0x037587 23:B577: F0        .byte $F0
- D - I - 0x037588 23:B578: F0        .byte $F0
- D - I - 0x037589 23:B579: F0        .byte $F0
- D - I - 0x03758A 23:B57A: 59        .byte $59    ; <ノ>
- D - I - 0x03758B 23:B57B: F0        .byte $F0
- D - I - 0x03758C 23:B57C: F0        .byte $F0
- D - I - 0x03758D 23:B57D: 61        .byte $61    ; <ム>
- D - I - 0x03758E 23:B57E: 32        .byte $32    ; <ょ>
- D - I - 0x03758F 23:B57F: 39        .byte $39    ; <6>
- D - I - 0x037590 23:B580: 6A        .byte $6A    ; <レ>
- D - I - 0x037591 23:B581: 28        .byte $28    ; <り>
- D - I - 0x037592 23:B582: 2B        .byte $2B    ; <ろ>
- D - I - 0x037593 23:B583: 36        .byte $36    ; <3>
- D - I - 0x037594 23:B584: 59        .byte $59    ; <ノ>
- D - I - 0x037595 23:B585: 57        .byte $57    ; <ヌ>
- D - I - 0x037596 23:B586: 90        .byte $90    ; <U>
- D - I - 0x037597 23:B587: 5C        .byte $5C    ; <フ>
- D - I - 0x037598 23:B588: 9B        .byte $9B
- D - I - 0x037599 23:B589: 40        .byte $40    ; <「>
- D - I - 0x03759A 23:B58A: 4F        .byte $4F    ; <ソ>
- D - I - 0x03759B 23:B58B: F0        .byte $F0
- D - I - 0x03759C 23:B58C: 9F        .byte $9F
- D - I - 0x03759D 23:B58D: 70        .byte $70    ; <ャ>
- D - I - 0x03759E 23:B58E: 73        .byte $73    ; <ヮ>
- D - I - 0x03759F 23:B58F: F0        .byte $F0
- D - I - 0x0375A0 23:B590: F0        .byte $F0
- D - I - 0x0375A1 23:B591: 79        .byte $79    ; <!>
- D - I - 0x0375A2 23:B592: 57        .byte $57    ; <ヌ>
- D - I - 0x0375A3 23:B593: 5C        .byte $5C    ; <フ>
- D - I - 0x0375A4 23:B594: 82        .byte $82    ; <B>
- D - I - 0x0375A5 23:B595: 4E        .byte $4E    ; <セ>
- D - I - 0x0375A6 23:B596: 35        .byte $35    ; <2>
- D - I - 0x0375A7 23:B597: 59        .byte $59    ; <ノ>
- D - I - 0x0375A8 23:B598: 88        .byte $88    ; <H>
- D - I - 0x0375A9 23:B599: B5        .byte $B5    ; <ギ>
- D - I - 0x0375AA 23:B59A: 92        .byte $92    ; <W>
- D - I - 0x0375AB 23:B59B: 99        .byte $99
- - - - - 0x0375AC 23:B59C: BE        .byte $BE    ; <ダ>
- D - I - 0x0375AD 23:B59D: 66        .byte $66    ; <ヨ>
- D - I - 0x0375AE 23:B59E: 8B        .byte $8B    ; <K>
- D - I - 0x0375AF 23:B59F: F0        .byte $F0
- D - I - 0x0375B0 23:B5A0: F0        .byte $F0
- D - I - 0x0375B1 23:B5A1: B9        .byte $B9    ; <ザ>
- D - I - 0x0375B2 23:B5A2: A2        .byte $A2    ; <ぐ>
- D - I - 0x0375B3 23:B5A3: F0        .byte $F0
- D - I - 0x0375B4 23:B5A4: F0        .byte $F0
- D - I - 0x0375B5 23:B5A5: 04        .byte $04    ; <え>
- D - I - 0x0375B6 23:B5A6: 04        .byte $04    ; <え>
- D - I - 0x0375B7 23:B5A7: F0        .byte $F0
- D - I - 0x0375B8 23:B5A8: F0        .byte $F0
- D - I - 0x0375B9 23:B5A9: 07        .byte $07    ; <き>
- D - I - 0x0375BA 23:B5AA: 07        .byte $07    ; <き>
- D - I - 0x0375BB 23:B5AB: 12        .byte $12    ; <つ>
- D - I - 0x0375BC 23:B5AC: 12        .byte $12    ; <つ>
- D - I - 0x0375BD 23:B5AD: 1D        .byte $1D    ; <へ>
- D - I - 0x0375BE 23:B5AE: 1D        .byte $1D    ; <へ>
- D - I - 0x0375BF 23:B5AF: F0        .byte $F0
- D - I - 0x0375C0 23:B5B0: F0        .byte $F0
- D - I - 0x0375C1 23:B5B1: F0        .byte $F0
- D - I - 0x0375C2 23:B5B2: 14        .byte $14    ; <と>
- D - I - 0x0375C3 23:B5B3: 74        .byte $74    ; <ィ>
- D - I - 0x0375C4 23:B5B4: 6A        .byte $6A    ; <レ>
- D - I - 0x0375C5 23:B5B5: 1F        .byte $1F    ; <ま>
- D - I - 0x0375C6 23:B5B6: 1F        .byte $1F    ; <ま>
- D - I - 0x0375C7 23:B5B7: 70        .byte $70    ; <ャ>
- D - I - 0x0375C8 23:B5B8: 4E        .byte $4E    ; <セ>
- D - I - 0x0375C9 23:B5B9: 06        .byte $06    ; <か>
- D - I - 0x0375CA 23:B5BA: 06        .byte $06    ; <か>
- D - I - 0x0375CB 23:B5BB: 14        .byte $14    ; <と>
- D - I - 0x0375CC 23:B5BC: 16        .byte $16    ; <に>
- D - I - 0x0375CD 23:B5BD: 07        .byte $07    ; <き>
- D - I - 0x0375CE 23:B5BE: 07        .byte $07    ; <き>
- D - I - 0x0375CF 23:B5BF: 1F        .byte $1F    ; <ま>
- D - I - 0x0375D0 23:B5C0: 20        .byte $20    ; <み>
- D - I - 0x0375D1 23:B5C1: 1C        .byte $1C    ; <ふ>
- D - I - 0x0375D2 23:B5C2: 2A        .byte $2A    ; <れ>
- D - I - 0x0375D3 23:B5C3: F0        .byte $F0
- D - I - 0x0375D4 23:B5C4: F0        .byte $F0
- D - I - 0x0375D5 23:B5C5: F0        .byte $F0
- D - I - 0x0375D6 23:B5C6: 39        .byte $39    ; <6>
- D - I - 0x0375D7 23:B5C7: F0        .byte $F0
- D - I - 0x0375D8 23:B5C8: F0        .byte $F0
- D - I - 0x0375D9 23:B5C9: 34        .byte $34    ; <1>
- D - I - 0x0375DA 23:B5CA: 37        .byte $37    ; <4>
- D - I - 0x0375DB 23:B5CB: 7C        .byte $7C    ; <~>
- D - I - 0x0375DC 23:B5CC: 7F        .byte $7F    ; <,>
- D - I - 0x0375DD 23:B5CD: 32        .byte $32    ; <ょ>
- D - I - 0x0375DE 23:B5CE: 10        .byte $10    ; <た>
- D - I - 0x0375DF 23:B5CF: 22        .byte $22    ; <め>
- D - I - 0x0375E0 23:B5D0: 47        .byte $47    ; <キ>
- D - I - 0x0375E1 23:B5D1: 13        .byte $13    ; <て>
- D - I - 0x0375E2 23:B5D2: 08        .byte $08    ; <く>
- D - I - 0x0375E3 23:B5D3: 1E        .byte $1E    ; <ほ>
- D - I - 0x0375E4 23:B5D4: 36        .byte $36    ; <3>
- D - I - 0x0375E5 23:B5D5: 62        .byte $62    ; <メ>
- D - I - 0x0375E6 23:B5D6: 40        .byte $40    ; <「>
- D - I - 0x0375E7 23:B5D7: F0        .byte $F0
- D - I - 0x0375E8 23:B5D8: F0        .byte $F0
- D - I - 0x0375E9 23:B5D9: 20        .byte $20    ; <み>
- D - I - 0x0375EA 23:B5DA: 44        .byte $44    ; <エ>
- D - I - 0x0375EB 23:B5DB: F0        .byte $F0
- D - I - 0x0375EC 23:B5DC: 99        .byte $99
- D - I - 0x0375ED 23:B5DD: 59        .byte $59    ; <ノ>
- D - I - 0x0375EE 23:B5DE: 51        .byte $51    ; <チ>
- D - I - 0x0375EF 23:B5DF: 7C        .byte $7C    ; <~>
- D - I - 0x0375F0 23:B5E0: 95        .byte $95
- D - I - 0x0375F1 23:B5E1: 4A        .byte $4A    ; <コ>
- D - I - 0x0375F2 23:B5E2: 34        .byte $34    ; <1>
- D - I - 0x0375F3 23:B5E3: 52        .byte $52    ; <ツ>
- D - I - 0x0375F4 23:B5E4: 3B        .byte $3B    ; <8>
- D - I - 0x0375F5 23:B5E5: 1E        .byte $1E    ; <ほ>
- D - I - 0x0375F6 23:B5E6: 2C        .byte $2C    ; <わ>
- D - I - 0x0375F7 23:B5E7: 36        .byte $36    ; <3>
- D - I - 0x0375F8 23:B5E8: 65        .byte $65    ; <ユ>
- D - I - 0x0375F9 23:B5E9: 9E        .byte $9E
- D - I - 0x0375FA 23:B5EA: 6F        .byte $6F    ; <ッ>
- - - - - 0x0375FB 23:B5EB: 74        .byte $74    ; <ィ>
- D - I - 0x0375FC 23:B5EC: 8F        .byte $8F    ; <S>
- D - I - 0x0375FD 23:B5ED: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0375FE 23:B5EE: 45        .byte $45    ; <オ>
- D - I - 0x0375FF 23:B5EF: F0        .byte $F0
- D - I - 0x037600 23:B5F0: F0        .byte $F0
- D - I - 0x037601 23:B5F1: F0        .byte $F0
- D - I - 0x037602 23:B5F2: 7E        .byte $7E    ; <.>
- D - I - 0x037603 23:B5F3: B8        .byte $B8    ; <ゴ>
- D - I - 0x037604 23:B5F4: BB        .byte $BB    ; <ズ>
- - - - - 0x037605 23:B5F5: 79        .byte $79    ; <!>
- D - I - 0x037606 23:B5F6: 57        .byte $57    ; <ヌ>
- - - - - 0x037607 23:B5F7: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037608 23:B5F8: 77        .byte $77    ; <:>
- - - - - 0x037609 23:B5F9: 4E        .byte $4E    ; <セ>
- D - I - 0x03760A 23:B5FA: 44        .byte $44    ; <エ>
- - - - - 0x03760B 23:B5FB: 66        .byte $66    ; <ヨ>
- D - I - 0x03760C 23:B5FC: 8A        .byte $8A    ; <N>
- - - - - 0x03760D 23:B5FD: B6        .byte $B6    ; <グ>
- D - I - 0x03760E 23:B5FE: 94        .byte $94
- D - I - 0x03760F 23:B5FF: F0        .byte $F0
- - - - - 0x037610 23:B600: B3        .byte $B3    ; <ぼ>
- D - I - 0x037611 23:B601: 74        .byte $74    ; <ィ>
- - - - - 0x037612 23:B602: 8E        .byte $8E    ; <L>
- - - - - 0x037613 23:B603: F0        .byte $F0
- D - I - 0x037614 23:B604: F0        .byte $F0
- - - - - 0x037615 23:B605: AE        .byte $AE    ; <ど>
- D - I - 0x037616 23:B606: 98        .byte $98
- D - I - 0x037617 23:B607: E9        .byte $E9
- - - - - 0x037618 23:B608: E9        .byte $E9
off_B609_09:
- D - I - 0x037619 23:B609: F0        .byte $F0
- D - I - 0x03761A 23:B60A: F0        .byte $F0
- D - I - 0x03761B 23:B60B: 07        .byte $07    ; <き>
- D - I - 0x03761C 23:B60C: 07        .byte $07    ; <き>
- D - I - 0x03761D 23:B60D: F0        .byte $F0
- D - I - 0x03761E 23:B60E: F0        .byte $F0
- D - I - 0x03761F 23:B60F: 04        .byte $04    ; <え>
- D - I - 0x037620 23:B610: 04        .byte $04    ; <え>
- - - - - 0x037621 23:B611: 11        .byte $11    ; <ち>
- D - I - 0x037622 23:B612: 11        .byte $11    ; <ち>
- D - I - 0x037623 23:B613: 4F        .byte $4F    ; <ソ>
- D - I - 0x037624 23:B614: 6A        .byte $6A    ; <レ>
- D - I - 0x037625 23:B615: 1E        .byte $1E    ; <ほ>
- D - I - 0x037626 23:B616: 1E        .byte $1E    ; <ほ>
- D - I - 0x037627 23:B617: 56        .byte $56    ; <ニ>
- D - I - 0x037628 23:B618: 71        .byte $71    ; <ュ>
- D - I - 0x037629 23:B619: 1C        .byte $1C    ; <ふ>
- D - I - 0x03762A 23:B61A: 1C        .byte $1C    ; <ふ>
- D - I - 0x03762B 23:B61B: F0        .byte $F0
- D - I - 0x03762C 23:B61C: 0F        .byte $0F    ; <そ>
- D - I - 0x03762D 23:B61D: F0        .byte $F0
- D - I - 0x03762E 23:B61E: F0        .byte $F0
- D - I - 0x03762F 23:B61F: 07        .byte $07    ; <き>
- D - I - 0x037630 23:B620: 1F        .byte $1F    ; <ま>
- D - I - 0x037631 23:B621: 24        .byte $24    ; <や>
- D - I - 0x037632 23:B622: 0F        .byte $0F    ; <そ>
- D - I - 0x037633 23:B623: 05        .byte $05    ; <お>
- D - I - 0x037634 23:B624: 05        .byte $05    ; <お>
- D - I - 0x037635 23:B625: 1C        .byte $1C    ; <ふ>
- D - I - 0x037636 23:B626: 1C        .byte $1C    ; <ふ>
- D - I - 0x037637 23:B627: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037638 23:B628: 76        .byte $76    ; <ォ>
- D - I - 0x037639 23:B629: 29        .byte $29    ; <る>
- D - I - 0x03763A 23:B62A: 36        .byte $36    ; <3>
- D - I - 0x03763B 23:B62B: 78        .byte $78    ; <?>
- D - I - 0x03763C 23:B62C: 7C        .byte $7C    ; <~>
- D - I - 0x03763D 23:B62D: F0        .byte $F0
- D - I - 0x03763E 23:B62E: 32        .byte $32    ; <ょ>
- D - I - 0x03763F 23:B62F: F0        .byte $F0
- D - I - 0x037640 23:B630: F0        .byte $F0
- D - I - 0x037641 23:B631: 3C        .byte $3C    ; <9>
- D - I - 0x037642 23:B632: 3E        .byte $3E    ; <Jr>
- D - I - 0x037643 23:B633: 1F        .byte $1F    ; <ま>
- D - I - 0x037644 23:B634: 3A        .byte $3A    ; <7>
- D - I - 0x037645 23:B635: 19        .byte $19    ; <の>
- D - I - 0x037646 23:B636: 1C        .byte $1C    ; <ふ>
- D - I - 0x037647 23:B637: 35        .byte $35    ; <2>
- D - I - 0x037648 23:B638: 12        .byte $12    ; <つ>
- D - I - 0x037649 23:B639: 56        .byte $56    ; <ニ>
- D - I - 0x03764A 23:B63A: 4C        .byte $4C    ; <シ>
- D - I - 0x03764B 23:B63B: 5D        .byte $5D    ; <ヘ>
- D - I - 0x03764C 23:B63C: 8E        .byte $8E    ; <L>
- D - I - 0x03764D 23:B63D: 4E        .byte $4E    ; <セ>
- D - I - 0x03764E 23:B63E: 8B        .byte $8B    ; <K>
- D - I - 0x03764F 23:B63F: 9E        .byte $9E
- D - I - 0x037650 23:B640: A2        .byte $A2    ; <ぐ>
- D - I - 0x037651 23:B641: F0        .byte $F0
- D - I - 0x037652 23:B642: 6F        .byte $6F    ; <ッ>
- D - I - 0x037653 23:B643: F0        .byte $F0
- D - I - 0x037654 23:B644: F0        .byte $F0
- D - I - 0x037655 23:B645: 6C        .byte $6C    ; <ワ>
- D - I - 0x037656 23:B646: 6E        .byte $6E    ; <ン>
- D - I - 0x037657 23:B647: 44        .byte $44    ; <エ>
- D - I - 0x037658 23:B648: 75        .byte $75    ; <ェ>
- D - I - 0x037659 23:B649: 3D        .byte $3D    ; <+>
- D - I - 0x03765A 23:B64A: 27        .byte $27    ; <ら>
- D - I - 0x03765B 23:B64B: 35        .byte $35    ; <2>
- D - I - 0x03765C 23:B64C: 2A        .byte $2A    ; <れ>
- D - I - 0x03765D 23:B64D: 57        .byte $57    ; <ヌ>
- D - I - 0x03765E 23:B64E: 64        .byte $64    ; <ヤ>
- D - I - 0x03765F 23:B64F: BD        .byte $BD    ; <ゾ>
- D - I - 0x037660 23:B650: 9A        .byte $9A
- D - I - 0x037661 23:B651: AE        .byte $AE    ; <ど>
- D - I - 0x037662 23:B652: 7E        .byte $7E    ; <.>
- D - I - 0x037663 23:B653: C3        .byte $C3    ; <バ>
- D - I - 0x037664 23:B654: C7        .byte $C7    ; <ボ>
- D - I - 0x037665 23:B655: F0        .byte $F0
- D - I - 0x037666 23:B656: F0        .byte $F0
- D - I - 0x037667 23:B657: 90        .byte $90    ; <U>
- D - I - 0x037668 23:B658: 87        .byte $87    ; <G>
- D - I - 0x037669 23:B659: 84        .byte $84    ; <D>
- D - I - 0x03766A 23:B65A: 6E        .byte $6E    ; <ン>
- - - - - 0x03766B 23:B65B: 74        .byte $74    ; <ィ>
- D - I - 0x03766C 23:B65C: 9A        .byte $9A
- D - I - 0x03766D 23:B65D: 4C        .byte $4C    ; <シ>
- D - I - 0x03766E 23:B65E: 57        .byte $57    ; <ヌ>
- D - I - 0x03766F 23:B65F: 65        .byte $65    ; <ユ>
- D - I - 0x037670 23:B660: 4E        .byte $4E    ; <セ>
- - - - - 0x037671 23:B661: AA        .byte $AA    ; <だ>
- D - I - 0x037672 23:B662: 87        .byte $87    ; <G>
- D - I - 0x037673 23:B663: D6        .byte $D6
- - - - - 0x037674 23:B664: D6        .byte $D6
- D - I - 0x037675 23:B665: A1        .byte $A1    ; <ぎ>
- D - I - 0x037676 23:B666: C7        .byte $C7    ; <ボ>
- D - I - 0x037677 23:B667: E8        .byte $E8
- D - I - 0x037678 23:B668: EA        .byte $EA
- D - I - 0x037679 23:B669: F0        .byte $F0
- D - I - 0x03767A 23:B66A: F0        .byte $F0
- D - I - 0x03767B 23:B66B: F0        .byte $F0
- - - - - 0x03767C 23:B66C: F0        .byte $F0
- D - I - 0x03767D 23:B66D: F0        .byte $F0
- D - I - 0x03767E 23:B66E: 04        .byte $04    ; <え>
- D - I - 0x03767F 23:B66F: F0        .byte $F0
- D - I - 0x037680 23:B670: 07        .byte $07    ; <き>
- D - I - 0x037681 23:B671: F0        .byte $F0
- D - I - 0x037682 23:B672: F0        .byte $F0
- D - I - 0x037683 23:B673: F0        .byte $F0
- D - I - 0x037684 23:B674: F0        .byte $F0
- D - I - 0x037685 23:B675: F0        .byte $F0
- D - I - 0x037686 23:B676: F0        .byte $F0
- D - I - 0x037687 23:B677: 51        .byte $51    ; <チ>
- D - I - 0x037688 23:B678: 6B        .byte $6B    ; <ロ>
- D - I - 0x037689 23:B679: F0        .byte $F0
- D - I - 0x03768A 23:B67A: 12        .byte $12    ; <つ>
- D - I - 0x03768B 23:B67B: 6F        .byte $6F    ; <ッ>
- D - I - 0x03768C 23:B67C: 74        .byte $74    ; <ィ>
- D - I - 0x03768D 23:B67D: F0        .byte $F0
- D - I - 0x03768E 23:B67E: 3F        .byte $3F    ; <•>
- D - I - 0x03768F 23:B67F: F0        .byte $F0
- D - I - 0x037690 23:B680: F0        .byte $F0
- D - I - 0x037691 23:B681: 03        .byte $03    ; <う>
- D - I - 0x037692 23:B682: 10        .byte $10    ; <た>
- D - I - 0x037693 23:B683: 13        .byte $13    ; <て>
- D - I - 0x037694 23:B684: 08        .byte $08    ; <く>
- D - I - 0x037695 23:B685: F0        .byte $F0
- D - I - 0x037696 23:B686: 05        .byte $05    ; <お>
- D - I - 0x037697 23:B687: F0        .byte $F0
- D - I - 0x037698 23:B688: 1E        .byte $1E    ; <ほ>
- D - I - 0x037699 23:B689: F0        .byte $F0
- D - I - 0x03769A 23:B68A: F0        .byte $F0
- D - I - 0x03769B 23:B68B: 45        .byte $45    ; <オ>
- D - I - 0x03769C 23:B68C: 77        .byte $77    ; <:>
- D - I - 0x03769D 23:B68D: F0        .byte $F0
- D - I - 0x03769E 23:B68E: 2B        .byte $2B    ; <ろ>
- D - I - 0x03769F 23:B68F: 74        .byte $74    ; <ィ>
- D - I - 0x0376A0 23:B690: 71        .byte $71    ; <ュ>
- D - I - 0x0376A1 23:B691: F0        .byte $F0
- D - I - 0x0376A2 23:B692: 56        .byte $56    ; <ニ>
- D - I - 0x0376A3 23:B693: F0        .byte $F0
- D - I - 0x0376A4 23:B694: 28        .byte $28    ; <り>
- D - I - 0x0376A5 23:B695: 55        .byte $55    ; <ナ>
- D - I - 0x0376A6 23:B696: 27        .byte $27    ; <ら>
- D - I - 0x0376A7 23:B697: 2C        .byte $2C    ; <わ>
- D - I - 0x0376A8 23:B698: 5E        .byte $5E    ; <ホ>
- D - I - 0x0376A9 23:B699: 1C        .byte $1C    ; <ふ>
- D - I - 0x0376AA 23:B69A: 10        .byte $10    ; <た>
- D - I - 0x0376AB 23:B69B: 1E        .byte $1E    ; <ほ>
- D - I - 0x0376AC 23:B69C: 13        .byte $13    ; <て>
- D - I - 0x0376AD 23:B69D: 35        .byte $35    ; <2>
- D - I - 0x0376AE 23:B69E: 59        .byte $59    ; <ノ>
- D - I - 0x0376AF 23:B69F: 82        .byte $82    ; <B>
- D - I - 0x0376B0 23:B6A0: 8F        .byte $8F    ; <S>
- D - I - 0x0376B1 23:B6A1: 4F        .byte $4F    ; <ソ>
- D - I - 0x0376B2 23:B6A2: 74        .byte $74    ; <ィ>
- D - I - 0x0376B3 23:B6A3: F0        .byte $F0
- D - I - 0x0376B4 23:B6A4: F0        .byte $F0
- D - I - 0x0376B5 23:B6A5: F0        .byte $F0
- D - I - 0x0376B6 23:B6A6: F0        .byte $F0
- D - I - 0x0376B7 23:B6A7: F0        .byte $F0
- D - I - 0x0376B8 23:B6A8: 4B        .byte $4B    ; <サ>
- D - I - 0x0376B9 23:B6A9: 79        .byte $79    ; <!>
- D - I - 0x0376BA 23:B6AA: 4B        .byte $4B    ; <サ>
- D - I - 0x0376BB 23:B6AB: 51        .byte $51    ; <チ>
- D - I - 0x0376BC 23:B6AC: 82        .byte $82    ; <B>
- D - I - 0x0376BD 23:B6AD: 28        .byte $28    ; <り>
- D - I - 0x0376BE 23:B6AE: 40        .byte $40    ; <「>
- D - I - 0x0376BF 23:B6AF: 2B        .byte $2B    ; <ろ>
- D - I - 0x0376C0 23:B6B0: 42        .byte $42    ; <イ>
- D - I - 0x0376C1 23:B6B1: 59        .byte $59    ; <ノ>
- D - I - 0x0376C2 23:B6B2: 5A        .byte $5A    ; <ハ>
- D - I - 0x0376C3 23:B6B3: A5        .byte $A5    ; <ざ>
- D - I - 0x0376C4 23:B6B4: BE        .byte $BE    ; <ダ>
- D - I - 0x0376C5 23:B6B5: 73        .byte $73    ; <ヮ>
- D - I - 0x0376C6 23:B6B6: 80        .byte $80
- D - I - 0x0376C7 23:B6B7: F0        .byte $F0
- D - I - 0x0376C8 23:B6B8: F0        .byte $F0
- D - I - 0x0376C9 23:B6B9: 9E        .byte $9E
- D - I - 0x0376CA 23:B6BA: A0        .byte $A0    ; <が>
- D - I - 0x0376CB 23:B6BB: 7B        .byte $7B    ; <。>
- D - I - 0x0376CC 23:B6BC: 71        .byte $71    ; <ュ>
- D - I - 0x0376CD 23:B6BD: 9D        .byte $9D
- D - I - 0x0376CE 23:B6BE: 6E        .byte $6E    ; <ン>
- D - I - 0x0376CF 23:B6BF: 75        .byte $75    ; <ェ>
- D - I - 0x0376D0 23:B6C0: A6        .byte $A6    ; <じ>
- D - I - 0x0376D1 23:B6C1: 4C        .byte $4C    ; <シ>
- D - I - 0x0376D2 23:B6C2: 70        .byte $70    ; <ャ>
- D - I - 0x0376D3 23:B6C3: 4F        .byte $4F    ; <ソ>
- D - I - 0x0376D4 23:B6C4: 67        .byte $67    ; <ラ>
- D - I - 0x0376D5 23:B6C5: 89        .byte $89    ; <I>
- D - I - 0x0376D6 23:B6C6: B9        .byte $B9    ; <ザ>
- D - I - 0x0376D7 23:B6C7: ED        .byte $ED
- D - I - 0x0376D8 23:B6C8: D6        .byte $D6
- D - I - 0x0376D9 23:B6C9: 7E        .byte $7E    ; <.>
- D - I - 0x0376DA 23:B6CA: B0        .byte $B0    ; <び>
- D - I - 0x0376DB 23:B6CB: F0        .byte $F0
- D - I - 0x0376DC 23:B6CC: F0        .byte $F0
- D - I - 0x0376DD 23:B6CD: F0        .byte $F0
- D - I - 0x0376DE 23:B6CE: F0        .byte $F0
- D - I - 0x0376DF 23:B6CF: CD        .byte $CD    ; <パ>
- D - I - 0x0376E0 23:B6D0: 9F        .byte $9F
- D - I - 0x0376E1 23:B6D1: 04        .byte $04    ; <え>
- D - I - 0x0376E2 23:B6D2: 04        .byte $04    ; <え>
- D - I - 0x0376E3 23:B6D3: F0        .byte $F0
- D - I - 0x0376E4 23:B6D4: F0        .byte $F0
- D - I - 0x0376E5 23:B6D5: 07        .byte $07    ; <き>
- D - I - 0x0376E6 23:B6D6: 07        .byte $07    ; <き>
- D - I - 0x0376E7 23:B6D7: F0        .byte $F0
- D - I - 0x0376E8 23:B6D8: F0        .byte $F0
- D - I - 0x0376E9 23:B6D9: 12        .byte $12    ; <つ>
- D - I - 0x0376EA 23:B6DA: 12        .byte $12    ; <つ>
- D - I - 0x0376EB 23:B6DB: 52        .byte $52    ; <ツ>
- D - I - 0x0376EC 23:B6DC: 77        .byte $77    ; <:>
- D - I - 0x0376ED 23:B6DD: F0        .byte $F0
- D - I - 0x0376EE 23:B6DE: 1F        .byte $1F    ; <ま>
- D - I - 0x0376EF 23:B6DF: 72        .byte $72    ; <ョ>
- D - I - 0x0376F0 23:B6E0: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0376F1 23:B6E1: 34        .byte $34    ; <1>
- D - I - 0x0376F2 23:B6E2: 62        .byte $62    ; <メ>
- D - I - 0x0376F3 23:B6E3: 1D        .byte $1D    ; <へ>
- D - I - 0x0376F4 23:B6E4: 1D        .byte $1D    ; <へ>
- D - I - 0x0376F5 23:B6E5: 1C        .byte $1C    ; <ふ>
- D - I - 0x0376F6 23:B6E6: 04        .byte $04    ; <え>
- D - I - 0x0376F7 23:B6E7: F0        .byte $F0
- D - I - 0x0376F8 23:B6E8: F0        .byte $F0
- D - I - 0x0376F9 23:B6E9: 06        .byte $06    ; <か>
- D - I - 0x0376FA 23:B6EA: 12        .byte $12    ; <つ>
- D - I - 0x0376FB 23:B6EB: 14        .byte $14    ; <と>
- D - I - 0x0376FC 23:B6EC: 2F        .byte $2F    ; <っ>
- D - I - 0x0376FD 23:B6ED: 2A        .byte $2A    ; <れ>
- D - I - 0x0376FE 23:B6EE: 1F        .byte $1F    ; <ま>
- D - I - 0x0376FF 23:B6EF: F0        .byte $F0
- D - I - 0x037700 23:B6F0: F0        .byte $F0
- D - I - 0x037701 23:B6F1: F0        .byte $F0
- D - I - 0x037702 23:B6F2: 38        .byte $38    ; <5>
- D - I - 0x037703 23:B6F3: 7F        .byte $7F    ; <,>
- D - I - 0x037704 23:B6F4: 83        .byte $83    ; <C>
- D - I - 0x037705 23:B6F5: 57        .byte $57    ; <ヌ>
- D - I - 0x037706 23:B6F6: 6E        .byte $6E    ; <ン>
- D - I - 0x037707 23:B6F7: 32        .byte $32    ; <ょ>
- D - I - 0x037708 23:B6F8: 34        .byte $34    ; <1>
- D - I - 0x037709 23:B6F9: 31        .byte $31    ; <ゅ>
- D - I - 0x03770A 23:B6FA: 33        .byte $33    ; <0>
- D - I - 0x03770B 23:B6FB: 45        .byte $45    ; <オ>
- D - I - 0x03770C 23:B6FC: 47        .byte $47    ; <キ>
- D - I - 0x03770D 23:B6FD: 1C        .byte $1C    ; <ふ>
- D - I - 0x03770E 23:B6FE: 11        .byte $11    ; <ち>
- D - I - 0x03770F 23:B6FF: 1F        .byte $1F    ; <ま>
- D - I - 0x037710 23:B700: 16        .byte $16    ; <に>
- D - I - 0x037711 23:B701: 36        .byte $36    ; <3>
- D - I - 0x037712 23:B702: 4F        .byte $4F    ; <ソ>
- D - I - 0x037713 23:B703: F0        .byte $F0
- D - I - 0x037714 23:B704: F0        .byte $F0
- D - I - 0x037715 23:B705: F0        .byte $F0
- D - I - 0x037716 23:B706: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037717 23:B707: A1        .byte $A1    ; <ぎ>
- D - I - 0x037718 23:B708: A5        .byte $A5    ; <ざ>
- D - I - 0x037719 23:B709: 6E        .byte $6E    ; <ン>
- D - I - 0x03771A 23:B70A: 91        .byte $91    ; <V>
- D - I - 0x03771B 23:B70B: 4D        .byte $4D    ; <ス>
- D - I - 0x03771C 23:B70C: 7C        .byte $7C    ; <~>
- D - I - 0x03771D 23:B70D: 32        .byte $32    ; <ょ>
- D - I - 0x03771E 23:B70E: 6E        .byte $6E    ; <ン>
- D - I - 0x03771F 23:B70F: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037720 23:B710: 8F        .byte $8F    ; <S>
- D - I - 0x037721 23:B711: 40        .byte $40    ; <「>
- D - I - 0x037722 23:B712: 29        .byte $29    ; <る>
- D - I - 0x037723 23:B713: 38        .byte $38    ; <5>
- D - I - 0x037724 23:B714: 2E        .byte $2E    ; <ん>
- D - I - 0x037725 23:B715: 72        .byte $72    ; <ョ>
- D - I - 0x037726 23:B716: 5B        .byte $5B    ; <ヒ>
- D - I - 0x037727 23:B717: F0        .byte $F0
- D - I - 0x037728 23:B718: F0        .byte $F0
- D - I - 0x037729 23:B719: 8C        .byte $8C    ; <M>
- D - I - 0x03772A 23:B71A: 81        .byte $81    ; <A>
- D - I - 0x03772B 23:B71B: C4        .byte $C4    ; <ビ>
- D - I - 0x03772C 23:B71C: C8        .byte $C8    ; <ぱ>
- D - I - 0x03772D 23:B71D: 85        .byte $85    ; <E>
- D - I - 0x03772E 23:B71E: B6        .byte $B6    ; <グ>
- D - I - 0x03772F 23:B71F: 70        .byte $70    ; <ャ>
- D - I - 0x037730 23:B720: AD        .byte $AD    ; <で>
- - - - - 0x037731 23:B721: 91        .byte $91    ; <V>
- D - I - 0x037732 23:B722: 6F        .byte $6F    ; <ッ>
- - - - - 0x037733 23:B723: 75        .byte $75    ; <ェ>
- D - I - 0x037734 23:B724: 8F        .byte $8F    ; <S>
- - - - - 0x037735 23:B725: 4C        .byte $4C    ; <シ>
- D - I - 0x037736 23:B726: 65        .byte $65    ; <ユ>
- D - I - 0x037737 23:B727: 5B        .byte $5B    ; <ヒ>
- - - - - 0x037738 23:B728: 50        .byte $50    ; <タ>
- - - - - 0x037739 23:B729: 7E        .byte $7E    ; <.>
- D - I - 0x03773A 23:B72A: BC        .byte $BC    ; <ゼ>
- - - - - 0x03773B 23:B72B: F0        .byte $F0
- D - I - 0x03773C 23:B72C: F0        .byte $F0
- D - I - 0x03773D 23:B72D: F0        .byte $F0
- - - - - 0x03773E 23:B72E: F0        .byte $F0
- - - - - 0x03773F 23:B72F: F0        .byte $F0
- D - I - 0x037740 23:B730: E9        .byte $E9
- - - - - 0x037741 23:B731: AA        .byte $AA    ; <だ>
- D - I - 0x037742 23:B732: D3        .byte $D3
- D - I - 0x037743 23:B733: D0        .byte $D0    ; <ペ>
- - - - - 0x037744 23:B734: A1        .byte $A1    ; <ぎ>
off_B735_0A:
- D - I - 0x037745 23:B735: F0        .byte $F0
- D - I - 0x037746 23:B736: F0        .byte $F0
- D - I - 0x037747 23:B737: 07        .byte $07    ; <き>
- D - I - 0x037748 23:B738: 07        .byte $07    ; <き>
- D - I - 0x037749 23:B739: F0        .byte $F0
- D - I - 0x03774A 23:B73A: F0        .byte $F0
- D - I - 0x03774B 23:B73B: 04        .byte $04    ; <え>
- D - I - 0x03774C 23:B73C: 04        .byte $04    ; <え>
- D - I - 0x03774D 23:B73D: 11        .byte $11    ; <ち>
- D - I - 0x03774E 23:B73E: 11        .byte $11    ; <ち>
- D - I - 0x03774F 23:B73F: 21        .byte $21    ; <む>
- D - I - 0x037750 23:B740: 37        .byte $37    ; <4>
- D - I - 0x037751 23:B741: 1E        .byte $1E    ; <ほ>
- D - I - 0x037752 23:B742: 1E        .byte $1E    ; <ほ>
- D - I - 0x037753 23:B743: 40        .byte $40    ; <「>
- D - I - 0x037754 23:B744: 65        .byte $65    ; <ユ>
- D - I - 0x037755 23:B745: 1C        .byte $1C    ; <ふ>
- D - I - 0x037756 23:B746: 1C        .byte $1C    ; <ふ>
- D - I - 0x037757 23:B747: 0F        .byte $0F    ; <そ>
- D - I - 0x037758 23:B748: 0F        .byte $0F    ; <そ>
- D - I - 0x037759 23:B749: F0        .byte $F0
- D - I - 0x03775A 23:B74A: F0        .byte $F0
- D - I - 0x03775B 23:B74B: 06        .byte $06    ; <か>
- D - I - 0x03775C 23:B74C: 1F        .byte $1F    ; <ま>
- D - I - 0x03775D 23:B74D: F0        .byte $F0
- D - I - 0x03775E 23:B74E: 0F        .byte $0F    ; <そ>
- D - I - 0x03775F 23:B74F: 1C        .byte $1C    ; <ふ>
- D - I - 0x037760 23:B750: 05        .byte $05    ; <お>
- D - I - 0x037761 23:B751: F0        .byte $F0
- D - I - 0x037762 23:B752: 1B        .byte $1B    ; <ひ>
- D - I - 0x037763 23:B753: 45        .byte $45    ; <オ>
- D - I - 0x037764 23:B754: 76        .byte $76    ; <ォ>
- D - I - 0x037765 23:B755: F0        .byte $F0
- D - I - 0x037766 23:B756: 34        .byte $34    ; <1>
- D - I - 0x037767 23:B757: F0        .byte $F0
- D - I - 0x037768 23:B758: F0        .byte $F0
- D - I - 0x037769 23:B759: F0        .byte $F0
- D - I - 0x03776A 23:B75A: 26        .byte $26    ; <よ>
- D - I - 0x03776B 23:B75B: F0        .byte $F0
- D - I - 0x03776C 23:B75C: F0        .byte $F0
- D - I - 0x03776D 23:B75D: F0        .byte $F0
- D - I - 0x03776E 23:B75E: 3C        .byte $3C    ; <9>
- D - I - 0x03776F 23:B75F: 1F        .byte $1F    ; <ま>
- D - I - 0x037770 23:B760: 4F        .byte $4F    ; <ソ>
- D - I - 0x037771 23:B761: 25        .byte $25    ; <ゆ>
- D - I - 0x037772 23:B762: 1B        .byte $1B    ; <ひ>
- D - I - 0x037773 23:B763: 1C        .byte $1C    ; <ふ>
- D - I - 0x037774 23:B764: 1D        .byte $1D    ; <へ>
- D - I - 0x037775 23:B765: F0        .byte $F0
- D - I - 0x037776 23:B766: 33        .byte $33    ; <0>
- D - I - 0x037777 23:B767: 50        .byte $50    ; <タ>
- D - I - 0x037778 23:B768: 8E        .byte $8E    ; <L>
- D - I - 0x037779 23:B769: F0        .byte $F0
- D - I - 0x03777A 23:B76A: 4C        .byte $4C    ; <シ>
- D - I - 0x03777B 23:B76B: F0        .byte $F0
- D - I - 0x03777C 23:B76C: F0        .byte $F0
- D - I - 0x03777D 23:B76D: F0        .byte $F0
- D - I - 0x03777E 23:B76E: 56        .byte $56    ; <ニ>
- D - I - 0x03777F 23:B76F: F0        .byte $F0
- D - I - 0x037780 23:B770: F0        .byte $F0
- D - I - 0x037781 23:B771: 6C        .byte $6C    ; <ワ>
- D - I - 0x037782 23:B772: 6E        .byte $6E    ; <ン>
- D - I - 0x037783 23:B773: 42        .byte $42    ; <イ>
- D - I - 0x037784 23:B774: 73        .byte $73    ; <ヮ>
- D - I - 0x037785 23:B775: 49        .byte $49    ; <ケ>
- D - I - 0x037786 23:B776: 33        .byte $33    ; <0>
- D - I - 0x037787 23:B777: 29        .byte $29    ; <る>
- D - I - 0x037788 23:B778: 35        .byte $35    ; <2>
- D - I - 0x037789 23:B779: F0        .byte $F0
- D - I - 0x03778A 23:B77A: 64        .byte $64    ; <ヤ>
- D - I - 0x03778B 23:B77B: 80        .byte $80
- D - I - 0x03778C 23:B77C: BD        .byte $BD    ; <ゾ>
- D - I - 0x03778D 23:B77D: F0        .byte $F0
- D - I - 0x03778E 23:B77E: 95        .byte $95
- D - I - 0x03778F 23:B77F: F0        .byte $F0
- - - - - 0x037790 23:B780: F0        .byte $F0
- D - I - 0x037791 23:B781: F0        .byte $F0
- D - I - 0x037792 23:B782: F0        .byte $F0
- D - I - 0x037793 23:B783: F0        .byte $F0
- D - I - 0x037794 23:B784: 79        .byte $79    ; <!>
- D - I - 0x037795 23:B785: 84        .byte $84    ; <D>
- - - - - 0x037796 23:B786: 6E        .byte $6E    ; <ン>
- D - I - 0x037797 23:B787: 67        .byte $67    ; <ラ>
- D - I - 0x037798 23:B788: A4        .byte $A4    ; <ご>
- D - I - 0x037799 23:B789: 57        .byte $57    ; <ヌ>
- D - I - 0x03779A 23:B78A: 4C        .byte $4C    ; <シ>
- D - I - 0x03779B 23:B78B: 65        .byte $65    ; <ユ>
- D - I - 0x03779C 23:B78C: 4E        .byte $4E    ; <セ>
- D - I - 0x03779D 23:B78D: F0        .byte $F0
- D - I - 0x03779E 23:B78E: 87        .byte $87    ; <G>
- D - I - 0x03779F 23:B78F: 81        .byte $81    ; <A>
- D - I - 0x0377A0 23:B790: D6        .byte $D6
- D - I - 0x0377A1 23:B791: A0        .byte $A0    ; <が>
- D - I - 0x0377A2 23:B792: C5        .byte $C5    ; <ブ>
- D - I - 0x0377A3 23:B793: F0        .byte $F0
- D - I - 0x0377A4 23:B794: F0        .byte $F0
- D - I - 0x0377A5 23:B795: F0        .byte $F0
- D - I - 0x0377A6 23:B796: B5        .byte $B5    ; <ギ>
- D - I - 0x0377A7 23:B797: F0        .byte $F0
- D - I - 0x0377A8 23:B798: F0        .byte $F0
- D - I - 0x0377A9 23:B799: F0        .byte $F0
- D - I - 0x0377AA 23:B79A: 04        .byte $04    ; <え>
- D - I - 0x0377AB 23:B79B: F0        .byte $F0
- D - I - 0x0377AC 23:B79C: 07        .byte $07    ; <き>
- D - I - 0x0377AD 23:B79D: F0        .byte $F0
- D - I - 0x0377AE 23:B79E: F0        .byte $F0
- D - I - 0x0377AF 23:B79F: F0        .byte $F0
- D - I - 0x0377B0 23:B7A0: F0        .byte $F0
- D - I - 0x0377B1 23:B7A1: F0        .byte $F0
- D - I - 0x0377B2 23:B7A2: F0        .byte $F0
- D - I - 0x0377B3 23:B7A3: 2D        .byte $2D    ; <を>
- D - I - 0x0377B4 23:B7A4: 5E        .byte $5E    ; <ホ>
- D - I - 0x0377B5 23:B7A5: F0        .byte $F0
- D - I - 0x0377B6 23:B7A6: 12        .byte $12    ; <つ>
- D - I - 0x0377B7 23:B7A7: 4B        .byte $4B    ; <サ>
- D - I - 0x0377B8 23:B7A8: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0377B9 23:B7A9: F0        .byte $F0
- D - I - 0x0377BA 23:B7AA: 28        .byte $28    ; <り>
- D - I - 0x0377BB 23:B7AB: F0        .byte $F0
- D - I - 0x0377BC 23:B7AC: 1D        .byte $1D    ; <へ>
- D - I - 0x0377BD 23:B7AD: 03        .byte $03    ; <う>
- D - I - 0x0377BE 23:B7AE: 10        .byte $10    ; <た>
- D - I - 0x0377BF 23:B7AF: 08        .byte $08    ; <く>
- D - I - 0x0377C0 23:B7B0: 13        .byte $13    ; <て>
- D - I - 0x0377C1 23:B7B1: F0        .byte $F0
- D - I - 0x0377C2 23:B7B2: 05        .byte $05    ; <お>
- D - I - 0x0377C3 23:B7B3: F0        .byte $F0
- D - I - 0x0377C4 23:B7B4: 1E        .byte $1E    ; <ほ>
- D - I - 0x0377C5 23:B7B5: F0        .byte $F0
- D - I - 0x0377C6 23:B7B6: 35        .byte $35    ; <2>
- D - I - 0x0377C7 23:B7B7: F0        .byte $F0
- D - I - 0x0377C8 23:B7B8: 51        .byte $51    ; <チ>
- D - I - 0x0377C9 23:B7B9: F0        .byte $F0
- D - I - 0x0377CA 23:B7BA: F0        .byte $F0
- D - I - 0x0377CB 23:B7BB: F0        .byte $F0
- D - I - 0x0377CC 23:B7BC: 66        .byte $66    ; <ヨ>
- D - I - 0x0377CD 23:B7BD: F0        .byte $F0
- D - I - 0x0377CE 23:B7BE: 3F        .byte $3F    ; <•>
- D - I - 0x0377CF 23:B7BF: F0        .byte $F0
- D - I - 0x0377D0 23:B7C0: F0        .byte $F0
- D - I - 0x0377D1 23:B7C1: 55        .byte $55    ; <ナ>
- D - I - 0x0377D2 23:B7C2: 1B        .byte $1B    ; <ひ>
- D - I - 0x0377D3 23:B7C3: 2B        .byte $2B    ; <ろ>
- D - I - 0x0377D4 23:B7C4: 5E        .byte $5E    ; <ホ>
- D - I - 0x0377D5 23:B7C5: 10        .byte $10    ; <た>
- D - I - 0x0377D6 23:B7C6: 1D        .byte $1D    ; <へ>
- D - I - 0x0377D7 23:B7C7: 12        .byte $12    ; <つ>
- D - I - 0x0377D8 23:B7C8: 1E        .byte $1E    ; <ほ>
- D - I - 0x0377D9 23:B7C9: 35        .byte $35    ; <2>
- D - I - 0x0377DA 23:B7CA: 36        .byte $36    ; <3>
- D - I - 0x0377DB 23:B7CB: F0        .byte $F0
- D - I - 0x0377DC 23:B7CC: 74        .byte $74    ; <ィ>
- D - I - 0x0377DD 23:B7CD: F0        .byte $F0
- D - I - 0x0377DE 23:B7CE: 5B        .byte $5B    ; <ヒ>
- D - I - 0x0377DF 23:B7CF: F0        .byte $F0
- D - I - 0x0377E0 23:B7D0: F0        .byte $F0
- D - I - 0x0377E1 23:B7D1: F0        .byte $F0
- D - I - 0x0377E2 23:B7D2: 6F        .byte $6F    ; <ッ>
- D - I - 0x0377E3 23:B7D3: F0        .byte $F0
- D - I - 0x0377E4 23:B7D4: 58        .byte $58    ; <ネ>
- D - I - 0x0377E5 23:B7D5: 79        .byte $79    ; <!>
- D - I - 0x0377E6 23:B7D6: 4B        .byte $4B    ; <サ>
- D - I - 0x0377E7 23:B7D7: 50        .byte $50    ; <タ>
- D - I - 0x0377E8 23:B7D8: 82        .byte $82    ; <B>
- D - I - 0x0377E9 23:B7D9: 34        .byte $34    ; <1>
- - - - - 0x0377EA 23:B7DA: 41        .byte $41    ; <ア>
- D - I - 0x0377EB 23:B7DB: 42        .byte $42    ; <イ>
- D - I - 0x0377EC 23:B7DC: 37        .byte $37    ; <4>
- D - I - 0x0377ED 23:B7DD: 59        .byte $59    ; <ノ>
- - - - - 0x0377EE 23:B7DE: 72        .byte $72    ; <ョ>
- D - I - 0x0377EF 23:B7DF: F0        .byte $F0
- D - I - 0x0377F0 23:B7E0: A4        .byte $A4    ; <ご>
- D - I - 0x0377F1 23:B7E1: F0        .byte $F0
- D - I - 0x0377F2 23:B7E2: 8B        .byte $8B    ; <K>
- D - I - 0x0377F3 23:B7E3: F0        .byte $F0
- D - I - 0x0377F4 23:B7E4: F0        .byte $F0
- D - I - 0x0377F5 23:B7E5: F0        .byte $F0
- D - I - 0x0377F6 23:B7E6: 9F        .byte $9F
- D - I - 0x0377F7 23:B7E7: F0        .byte $F0
- D - I - 0x0377F8 23:B7E8: 7C        .byte $7C    ; <~>
- D - I - 0x0377F9 23:B7E9: 91        .byte $91    ; <V>
- D - I - 0x0377FA 23:B7EA: 63        .byte $63    ; <モ>
- D - I - 0x0377FB 23:B7EB: 74        .byte $74    ; <ィ>
- D - I - 0x0377FC 23:B7EC: 9A        .byte $9A
- D - I - 0x0377FD 23:B7ED: 70        .byte $70    ; <ャ>
- D - I - 0x0377FE 23:B7EE: 59        .byte $59    ; <ノ>
- D - I - 0x0377FF 23:B7EF: 66        .byte $66    ; <ヨ>
- D - I - 0x037800 23:B7F0: 4E        .byte $4E    ; <セ>
- D - I - 0x037801 23:B7F1: F0        .byte $F0
- D - I - 0x037802 23:B7F2: 89        .byte $89    ; <I>
- D - I - 0x037803 23:B7F3: F0        .byte $F0
- D - I - 0x037804 23:B7F4: B0        .byte $B0    ; <び>
- D - I - 0x037805 23:B7F5: F0        .byte $F0
- D - I - 0x037806 23:B7F6: A2        .byte $A2    ; <ぐ>
- D - I - 0x037807 23:B7F7: F0        .byte $F0
- D - I - 0x037808 23:B7F8: F0        .byte $F0
- D - I - 0x037809 23:B7F9: F0        .byte $F0
- D - I - 0x03780A 23:B7FA: F0        .byte $F0
- D - I - 0x03780B 23:B7FB: F0        .byte $F0
- D - I - 0x03780C 23:B7FC: 9F        .byte $9F
- D - I - 0x03780D 23:B7FD: 04        .byte $04    ; <え>
- D - I - 0x03780E 23:B7FE: 04        .byte $04    ; <え>
- D - I - 0x03780F 23:B7FF: F0        .byte $F0
- D - I - 0x037810 23:B800: F0        .byte $F0
- D - I - 0x037811 23:B801: 07        .byte $07    ; <き>
- D - I - 0x037812 23:B802: 07        .byte $07    ; <き>
- D - I - 0x037813 23:B803: F0        .byte $F0
- D - I - 0x037814 23:B804: F0        .byte $F0
- D - I - 0x037815 23:B805: 12        .byte $12    ; <つ>
- D - I - 0x037816 23:B806: 12        .byte $12    ; <つ>
- D - I - 0x037817 23:B807: F0        .byte $F0
- D - I - 0x037818 23:B808: F0        .byte $F0
- D - I - 0x037819 23:B809: F0        .byte $F0
- D - I - 0x03781A 23:B80A: 1F        .byte $1F    ; <ま>
- D - I - 0x03781B 23:B80B: 33        .byte $33    ; <0>
- D - I - 0x03781C 23:B80C: 65        .byte $65    ; <ユ>
- D - I - 0x03781D 23:B80D: 29        .byte $29    ; <る>
- D - I - 0x03781E 23:B80E: 2A        .byte $2A    ; <れ>
- D - I - 0x03781F 23:B80F: 1D        .byte $1D    ; <へ>
- D - I - 0x037820 23:B810: 1D        .byte $1D    ; <へ>
- D - I - 0x037821 23:B811: 1C        .byte $1C    ; <ふ>
- D - I - 0x037822 23:B812: 05        .byte $05    ; <お>
- D - I - 0x037823 23:B813: F0        .byte $F0
- D - I - 0x037824 23:B814: F0        .byte $F0
- D - I - 0x037825 23:B815: 06        .byte $06    ; <か>
- D - I - 0x037826 23:B816: 12        .byte $12    ; <つ>
- D - I - 0x037827 23:B817: F0        .byte $F0
- D - I - 0x037828 23:B818: 14        .byte $14    ; <と>
- D - I - 0x037829 23:B819: F0        .byte $F0
- D - I - 0x03782A 23:B81A: 1F        .byte $1F    ; <ま>
- D - I - 0x03782B 23:B81B: F0        .byte $F0
- D - I - 0x03782C 23:B81C: F0        .byte $F0
- D - I - 0x03782D 23:B81D: F0        .byte $F0
- D - I - 0x03782E 23:B81E: 38        .byte $38    ; <5>
- D - I - 0x03782F 23:B81F: F0        .byte $F0
- D - I - 0x037830 23:B820: F0        .byte $F0
- D - I - 0x037831 23:B821: 41        .byte $41    ; <ア>
- D - I - 0x037832 23:B822: 64        .byte $64    ; <ヤ>
- D - I - 0x037833 23:B823: F0        .byte $F0
- D - I - 0x037834 23:B824: 2A        .byte $2A    ; <れ>
- D - I - 0x037835 23:B825: 28        .byte $28    ; <り>
- D - I - 0x037836 23:B826: 57        .byte $57    ; <ヌ>
- D - I - 0x037837 23:B827: F0        .byte $F0
- D - I - 0x037838 23:B828: 47        .byte $47    ; <キ>
- D - I - 0x037839 23:B829: 1D        .byte $1D    ; <へ>
- D - I - 0x03783A 23:B82A: 2A        .byte $2A    ; <れ>
- D - I - 0x03783B 23:B82B: 1F        .byte $1F    ; <ま>
- D - I - 0x03783C 23:B82C: 2D        .byte $2D    ; <を>
- D - I - 0x03783D 23:B82D: F0        .byte $F0
- D - I - 0x03783E 23:B82E: 4F        .byte $4F    ; <ソ>
- D - I - 0x03783F 23:B82F: F0        .byte $F0
- D - I - 0x037840 23:B830: F0        .byte $F0
- D - I - 0x037841 23:B831: F0        .byte $F0
- D - I - 0x037842 23:B832: F0        .byte $F0
- D - I - 0x037843 23:B833: F0        .byte $F0
- D - I - 0x037844 23:B834: F0        .byte $F0
- D - I - 0x037845 23:B835: F0        .byte $F0
- D - I - 0x037846 23:B836: 7F        .byte $7F    ; <,>
- D - I - 0x037847 23:B837: F0        .byte $F0
- D - I - 0x037848 23:B838: 4D        .byte $4D    ; <ス>
- D - I - 0x037849 23:B839: 3F        .byte $3F    ; <•>
- D - I - 0x03784A 23:B83A: 6F        .byte $6F    ; <ッ>
- D - I - 0x03784B 23:B83B: 5D        .byte $5D    ; <ヘ>
- D - I - 0x03784C 23:B83C: 8F        .byte $8F    ; <S>
- D - I - 0x03784D 23:B83D: 4C        .byte $4C    ; <シ>
- D - I - 0x03784E 23:B83E: 35        .byte $35    ; <2>
- D - I - 0x03784F 23:B83F: 42        .byte $42    ; <イ>
- D - I - 0x037850 23:B840: 39        .byte $39    ; <6>
- D - I - 0x037851 23:B841: F0        .byte $F0
- D - I - 0x037852 23:B842: 67        .byte $67    ; <ラ>
- D - I - 0x037853 23:B843: F0        .byte $F0
- D - I - 0x037854 23:B844: F0        .byte $F0
- D - I - 0x037855 23:B845: F0        .byte $F0
- D - I - 0x037856 23:B846: 6A        .byte $6A    ; <レ>
- D - I - 0x037857 23:B847: F0        .byte $F0
- D - I - 0x037858 23:B848: F0        .byte $F0
- D - I - 0x037859 23:B849: F0        .byte $F0
- D - I - 0x03785A 23:B84A: AF        .byte $AF    ; <ば>
- D - I - 0x03785B 23:B84B: F0        .byte $F0
- D - I - 0x03785C 23:B84C: 8A        .byte $8A    ; <N>
- - - - - 0x03785D 23:B84D: 63        .byte $63    ; <モ>
- - - - - 0x03785E 23:B84E: 87        .byte $87    ; <G>
- - - - - 0x03785F 23:B84F: 75        .byte $75    ; <ェ>
- - - - - 0x037860 23:B850: 8F        .byte $8F    ; <S>
- - - - - 0x037861 23:B851: 4C        .byte $4C    ; <シ>
- - - - - 0x037862 23:B852: 65        .byte $65    ; <ユ>
- - - - - 0x037863 23:B853: 5A        .byte $5A    ; <ハ>
- - - - - 0x037864 23:B854: 50        .byte $50    ; <タ>
- - - - - 0x037865 23:B855: 7E        .byte $7E    ; <.>
- - - - - 0x037866 23:B856: 97        .byte $97
- - - - - 0x037867 23:B857: F0        .byte $F0
- - - - - 0x037868 23:B858: F0        .byte $F0
- - - - - 0x037869 23:B859: F0        .byte $F0
- - - - - 0x03786A 23:B85A: 9A        .byte $9A
- - - - - 0x03786B 23:B85B: F0        .byte $F0
- - - - - 0x03786C 23:B85C: F0        .byte $F0
- - - - - 0x03786D 23:B85D: AA        .byte $AA    ; <だ>
- - - - - 0x03786E 23:B85E: D3        .byte $D3
- - - - - 0x03786F 23:B85F: F0        .byte $F0
- - - - - 0x037870 23:B860: AE        .byte $AE    ; <ど>
off_B861_0B:
- D - I - 0x037871 23:B861: F0        .byte $F0
- D - I - 0x037872 23:B862: F0        .byte $F0
- D - I - 0x037873 23:B863: 07        .byte $07    ; <き>
- D - I - 0x037874 23:B864: 07        .byte $07    ; <き>
- D - I - 0x037875 23:B865: F0        .byte $F0
- D - I - 0x037876 23:B866: F0        .byte $F0
- D - I - 0x037877 23:B867: 04        .byte $04    ; <え>
- D - I - 0x037878 23:B868: 04        .byte $04    ; <え>
- D - I - 0x037879 23:B869: 11        .byte $11    ; <ち>
- D - I - 0x03787A 23:B86A: 11        .byte $11    ; <ち>
- D - I - 0x03787B 23:B86B: 69        .byte $69    ; <ル>
- D - I - 0x03787C 23:B86C: 3A        .byte $3A    ; <7>
- D - I - 0x03787D 23:B86D: 1E        .byte $1E    ; <ほ>
- D - I - 0x03787E 23:B86E: 1E        .byte $1E    ; <ほ>
- D - I - 0x03787F 23:B86F: 49        .byte $49    ; <ケ>
- D - I - 0x037880 23:B870: 71        .byte $71    ; <ュ>
- D - I - 0x037881 23:B871: 1C        .byte $1C    ; <ふ>
- D - I - 0x037882 23:B872: 1C        .byte $1C    ; <ふ>
- D - I - 0x037883 23:B873: F0        .byte $F0
- D - I - 0x037884 23:B874: 0F        .byte $0F    ; <そ>
- D - I - 0x037885 23:B875: F0        .byte $F0
- D - I - 0x037886 23:B876: 24        .byte $24    ; <や>
- D - I - 0x037887 23:B877: 07        .byte $07    ; <き>
- D - I - 0x037888 23:B878: 1F        .byte $1F    ; <ま>
- D - I - 0x037889 23:B879: 0F        .byte $0F    ; <そ>
- D - I - 0x03788A 23:B87A: 1B        .byte $1B    ; <ひ>
- D - I - 0x03788B 23:B87B: 05        .byte $05    ; <お>
- D - I - 0x03788C 23:B87C: 05        .byte $05    ; <お>
- D - I - 0x03788D 23:B87D: F0        .byte $F0
- D - I - 0x03788E 23:B87E: 1C        .byte $1C    ; <ふ>
- D - I - 0x03788F 23:B87F: 76        .byte $76    ; <ォ>
- D - I - 0x037890 23:B880: 46        .byte $46    ; <カ>
- D - I - 0x037891 23:B881: 29        .byte $29    ; <る>
- D - I - 0x037892 23:B882: 36        .byte $36    ; <3>
- D - I - 0x037893 23:B883: 7C        .byte $7C    ; <~>
- D - I - 0x037894 23:B884: 7E        .byte $7E    ; <.>
- D - I - 0x037895 23:B885: F0        .byte $F0
- D - I - 0x037896 23:B886: F0        .byte $F0
- D - I - 0x037897 23:B887: F0        .byte $F0
- D - I - 0x037898 23:B888: F0        .byte $F0
- D - I - 0x037899 23:B889: 3C        .byte $3C    ; <9>
- D - I - 0x03789A 23:B88A: 25        .byte $25    ; <ゆ>
- D - I - 0x03789B 23:B88B: 1F        .byte $1F    ; <ま>
- D - I - 0x03789C 23:B88C: 39        .byte $39    ; <6>
- D - I - 0x03789D 23:B88D: 1B        .byte $1B    ; <ひ>
- D - I - 0x03789E 23:B88E: 10        .byte $10    ; <た>
- D - I - 0x03789F 23:B88F: 1D        .byte $1D    ; <へ>
- D - I - 0x0378A0 23:B890: 12        .byte $12    ; <つ>
- D - I - 0x0378A1 23:B891: 57        .byte $57    ; <ヌ>
- D - I - 0x0378A2 23:B892: 34        .byte $34    ; <1>
- D - I - 0x0378A3 23:B893: 5D        .byte $5D    ; <ヘ>
- D - I - 0x0378A4 23:B894: 9B        .byte $9B
- D - I - 0x0378A5 23:B895: 36        .byte $36    ; <3>
- D - I - 0x0378A6 23:B896: 4F        .byte $4F    ; <ソ>
- D - I - 0x0378A7 23:B897: 9E        .byte $9E
- D - I - 0x0378A8 23:B898: A2        .byte $A2    ; <ぐ>
- D - I - 0x0378A9 23:B899: F0        .byte $F0
- D - I - 0x0378AA 23:B89A: F0        .byte $F0
- D - I - 0x0378AB 23:B89B: F0        .byte $F0
- D - I - 0x0378AC 23:B89C: 3E        .byte $3E    ; <Jr>
- D - I - 0x0378AD 23:B89D: 30        .byte $30    ; <ゃ>
- D - I - 0x0378AE 23:B89E: 49        .byte $49    ; <ケ>
- D - I - 0x0378AF 23:B89F: 2B        .byte $2B    ; <ろ>
- D - I - 0x0378B0 23:B8A0: 51        .byte $51    ; <チ>
- D - I - 0x0378B1 23:B8A1: 32        .byte $32    ; <ょ>
- D - I - 0x0378B2 23:B8A2: 28        .byte $28    ; <り>
- D - I - 0x0378B3 23:B8A3: 1E        .byte $1E    ; <ほ>
- D - I - 0x0378B4 23:B8A4: 42        .byte $42    ; <イ>
- D - I - 0x0378B5 23:B8A5: 57        .byte $57    ; <ヌ>
- D - I - 0x0378B6 23:B8A6: 40        .byte $40    ; <「>
- D - I - 0x0378B7 23:B8A7: 99        .byte $99
- D - I - 0x0378B8 23:B8A8: BE        .byte $BE    ; <ダ>
- D - I - 0x0378B9 23:B8A9: 59        .byte $59    ; <ノ>
- D - I - 0x0378BA 23:B8AA: 7F        .byte $7F    ; <,>
- D - I - 0x0378BB 23:B8AB: C3        .byte $C3    ; <バ>
- D - I - 0x0378BC 23:B8AC: C7        .byte $C7    ; <ボ>
- D - I - 0x0378BD 23:B8AD: F0        .byte $F0
- D - I - 0x0378BE 23:B8AE: 6E        .byte $6E    ; <ン>
- D - I - 0x0378BF 23:B8AF: F0        .byte $F0
- D - I - 0x0378C0 23:B8B0: F0        .byte $F0
- D - I - 0x0378C1 23:B8B1: 6C        .byte $6C    ; <ワ>
- - - - - 0x0378C2 23:B8B2: 55        .byte $55    ; <ナ>
- D - I - 0x0378C3 23:B8B3: 5D        .byte $5D    ; <ヘ>
- - - - - 0x0378C4 23:B8B4: 82        .byte $82    ; <B>
- D - I - 0x0378C5 23:B8B5: 3E        .byte $3E    ; <Jr>
- - - - - 0x0378C6 23:B8B6: 57        .byte $57    ; <ヌ>
- - - - - 0x0378C7 23:B8B7: 59        .byte $59    ; <ノ>
- D - I - 0x0378C8 23:B8B8: 4F        .byte $4F    ; <ソ>
- D - I - 0x0378C9 23:B8B9: 9F        .byte $9F
- - - - - 0x0378CA 23:B8BA: 70        .byte $70    ; <ャ>
- D - I - 0x0378CB 23:B8BB: A6        .byte $A6    ; <じ>
- - - - - 0x0378CC 23:B8BC: D6        .byte $D6
- - - - - 0x0378CD 23:B8BD: 7E        .byte $7E    ; <.>
- D - I - 0x0378CE 23:B8BE: 98        .byte $98
- - - - - 0x0378CF 23:B8BF: F0        .byte $F0
- D - I - 0x0378D0 23:B8C0: DC        .byte $DC
- - - - - 0x0378D1 23:B8C1: F0        .byte $F0
- D - I - 0x0378D2 23:B8C2: F0        .byte $F0
- D - I - 0x0378D3 23:B8C3: 91        .byte $91    ; <V>
- - - - - 0x0378D4 23:B8C4: 7A        .byte $7A    ; <、>
- D - I - 0x0378D5 23:B8C5: F0        .byte $F0
- D - I - 0x0378D6 23:B8C6: 69        .byte $69    ; <ル>
- D - I - 0x0378D7 23:B8C7: F0        .byte $F0
- D - I - 0x0378D8 23:B8C8: 69        .byte $69    ; <ル>
- D - I - 0x0378D9 23:B8C9: F0        .byte $F0
- D - I - 0x0378DA 23:B8CA: F0        .byte $F0
- D - I - 0x0378DB 23:B8CB: F0        .byte $F0
- D - I - 0x0378DC 23:B8CC: F0        .byte $F0
- D - I - 0x0378DD 23:B8CD: F0        .byte $F0
- D - I - 0x0378DE 23:B8CE: F0        .byte $F0
- D - I - 0x0378DF 23:B8CF: 51        .byte $51    ; <チ>
- D - I - 0x0378E0 23:B8D0: 6B        .byte $6B    ; <ロ>
- D - I - 0x0378E1 23:B8D1: F0        .byte $F0
- D - I - 0x0378E2 23:B8D2: 12        .byte $12    ; <つ>
- D - I - 0x0378E3 23:B8D3: 6F        .byte $6F    ; <ッ>
- D - I - 0x0378E4 23:B8D4: 74        .byte $74    ; <ィ>
- D - I - 0x0378E5 23:B8D5: F0        .byte $F0
- D - I - 0x0378E6 23:B8D6: 3F        .byte $3F    ; <•>
- D - I - 0x0378E7 23:B8D7: F0        .byte $F0
- D - I - 0x0378E8 23:B8D8: 1D        .byte $1D    ; <へ>
- D - I - 0x0378E9 23:B8D9: 03        .byte $03    ; <う>
- D - I - 0x0378EA 23:B8DA: 10        .byte $10    ; <た>
- D - I - 0x0378EB 23:B8DB: 08        .byte $08    ; <く>
- D - I - 0x0378EC 23:B8DC: 13        .byte $13    ; <て>
- D - I - 0x0378ED 23:B8DD: F0        .byte $F0
- D - I - 0x0378EE 23:B8DE: 05        .byte $05    ; <お>
- D - I - 0x0378EF 23:B8DF: F0        .byte $F0
- D - I - 0x0378F0 23:B8E0: 1E        .byte $1E    ; <ほ>
- D - I - 0x0378F1 23:B8E1: F0        .byte $F0
- D - I - 0x0378F2 23:B8E2: F0        .byte $F0
- D - I - 0x0378F3 23:B8E3: 51        .byte $51    ; <チ>
- D - I - 0x0378F4 23:B8E4: 6B        .byte $6B    ; <ロ>
- D - I - 0x0378F5 23:B8E5: F0        .byte $F0
- D - I - 0x0378F6 23:B8E6: 2B        .byte $2B    ; <ろ>
- D - I - 0x0378F7 23:B8E7: 6F        .byte $6F    ; <ッ>
- D - I - 0x0378F8 23:B8E8: 74        .byte $74    ; <ィ>
- D - I - 0x0378F9 23:B8E9: F0        .byte $F0
- D - I - 0x0378FA 23:B8EA: 3F        .byte $3F    ; <•>
- D - I - 0x0378FB 23:B8EB: F0        .byte $F0
- D - I - 0x0378FC 23:B8EC: 28        .byte $28    ; <り>
- D - I - 0x0378FD 23:B8ED: 55        .byte $55    ; <ナ>
- D - I - 0x0378FE 23:B8EE: 0F        .byte $0F    ; <そ>
- D - I - 0x0378FF 23:B8EF: 14        .byte $14    ; <と>
- D - I - 0x037900 23:B8F0: 5E        .byte $5E    ; <ホ>
- D - I - 0x037901 23:B8F1: 05        .byte $05    ; <お>
- D - I - 0x037902 23:B8F2: 1D        .byte $1D    ; <へ>
- D - I - 0x037903 23:B8F3: 06        .byte $06    ; <か>
- D - I - 0x037904 23:B8F4: 12        .byte $12    ; <つ>
- D - I - 0x037905 23:B8F5: 35        .byte $35    ; <2>
- D - I - 0x037906 23:B8F6: 36        .byte $36    ; <3>
- D - I - 0x037907 23:B8F7: 39        .byte $39    ; <6>
- D - I - 0x037908 23:B8F8: 69        .byte $69    ; <ル>
- D - I - 0x037909 23:B8F9: 2B        .byte $2B    ; <ろ>
- D - I - 0x03790A 23:B8FA: 4F        .byte $4F    ; <ソ>
- D - I - 0x03790B 23:B8FB: F0        .byte $F0
- D - I - 0x03790C 23:B8FC: F0        .byte $F0
- D - I - 0x03790D 23:B8FD: F0        .byte $F0
- D - I - 0x03790E 23:B8FE: F0        .byte $F0
- D - I - 0x03790F 23:B8FF: F0        .byte $F0
- D - I - 0x037910 23:B900: 4B        .byte $4B    ; <サ>
- D - I - 0x037911 23:B901: 61        .byte $61    ; <ム>
- D - I - 0x037912 23:B902: 31        .byte $31    ; <ゅ>
- D - I - 0x037913 23:B903: 39        .byte $39    ; <6>
- D - I - 0x037914 23:B904: 6A        .byte $6A    ; <レ>
- D - I - 0x037915 23:B905: 29        .byte $29    ; <る>
- D - I - 0x037916 23:B906: 34        .byte $34    ; <1>
- D - I - 0x037917 23:B907: 2A        .byte $2A    ; <れ>
- D - I - 0x037918 23:B908: 37        .byte $37    ; <4>
- D - I - 0x037919 23:B909: 4B        .byte $4B    ; <サ>
- D - I - 0x03791A 23:B90A: 50        .byte $50    ; <タ>
- D - I - 0x03791B 23:B90B: A5        .byte $A5    ; <ざ>
- D - I - 0x03791C 23:B90C: CA        .byte $CA    ; <ぷ>
- D - I - 0x03791D 23:B90D: 66        .byte $66    ; <ヨ>
- D - I - 0x03791E 23:B90E: 80        .byte $80
- D - I - 0x03791F 23:B90F: F0        .byte $F0
- D - I - 0x037920 23:B910: F0        .byte $F0
- D - I - 0x037921 23:B911: 9E        .byte $9E
- D - I - 0x037922 23:B912: 95        .byte $95
- - - - - 0x037923 23:B913: 7B        .byte $7B    ; <。>
- D - I - 0x037924 23:B914: 59        .byte $59    ; <ノ>
- D - I - 0x037925 23:B915: 79        .byte $79    ; <!>
- D - I - 0x037926 23:B916: 56        .byte $56    ; <ニ>
- D - I - 0x037927 23:B917: 5D        .byte $5D    ; <ヘ>
- D - I - 0x037928 23:B918: 82        .byte $82    ; <B>
- D - I - 0x037929 23:B919: 4C        .byte $4C    ; <シ>
- D - I - 0x03792A 23:B91A: 41        .byte $41    ; <ア>
- D - I - 0x03792B 23:B91B: 5A        .byte $5A    ; <ハ>
- D - I - 0x03792C 23:B91C: 4F        .byte $4F    ; <ソ>
- D - I - 0x03792D 23:B91D: 71        .byte $71    ; <ュ>
- D - I - 0x03792E 23:B91E: 8B        .byte $8B    ; <K>
- D - I - 0x03792F 23:B91F: B0        .byte $B0    ; <び>
- D - I - 0x037930 23:B920: D6        .byte $D6
- D - I - 0x037931 23:B921: 74        .byte $74    ; <ィ>
- D - I - 0x037932 23:B922: 99        .byte $99
- D - I - 0x037933 23:B923: F0        .byte $F0
- D - I - 0x037934 23:B924: F0        .byte $F0
- D - I - 0x037935 23:B925: F0        .byte $F0
- D - I - 0x037936 23:B926: B6        .byte $B6    ; <グ>
- D - I - 0x037937 23:B927: 9D        .byte $9D
- D - I - 0x037938 23:B928: 7C        .byte $7C    ; <~>
- D - I - 0x037939 23:B929: 04        .byte $04    ; <え>
- D - I - 0x03793A 23:B92A: 04        .byte $04    ; <え>
- D - I - 0x03793B 23:B92B: F0        .byte $F0
- D - I - 0x03793C 23:B92C: F0        .byte $F0
- D - I - 0x03793D 23:B92D: 07        .byte $07    ; <き>
- D - I - 0x03793E 23:B92E: 07        .byte $07    ; <き>
- D - I - 0x03793F 23:B92F: F0        .byte $F0
- D - I - 0x037940 23:B930: F0        .byte $F0
- D - I - 0x037941 23:B931: 12        .byte $12    ; <つ>
- D - I - 0x037942 23:B932: 12        .byte $12    ; <つ>
- D - I - 0x037943 23:B933: 52        .byte $52    ; <ツ>
- D - I - 0x037944 23:B934: 77        .byte $77    ; <:>
- D - I - 0x037945 23:B935: F0        .byte $F0
- D - I - 0x037946 23:B936: 14        .byte $14    ; <と>
- D - I - 0x037947 23:B937: 72        .byte $72    ; <ョ>
- D - I - 0x037948 23:B938: 5B        .byte $5B    ; <ヒ>
- D - I - 0x037949 23:B939: 63        .byte $63    ; <モ>
- D - I - 0x03794A 23:B93A: 1D        .byte $1D    ; <へ>
- D - I - 0x03794B 23:B93B: 1F        .byte $1F    ; <ま>
- D - I - 0x03794C 23:B93C: 1F        .byte $1F    ; <ま>
- D - I - 0x03794D 23:B93D: 04        .byte $04    ; <え>
- D - I - 0x03794E 23:B93E: 1C        .byte $1C    ; <ふ>
- D - I - 0x03794F 23:B93F: F0        .byte $F0
- D - I - 0x037950 23:B940: 2F        .byte $2F    ; <っ>
- D - I - 0x037951 23:B941: 06        .byte $06    ; <か>
- D - I - 0x037952 23:B942: 06        .byte $06    ; <か>
- D - I - 0x037953 23:B943: 20        .byte $20    ; <み>
- D - I - 0x037954 23:B944: 14        .byte $14    ; <と>
- D - I - 0x037955 23:B945: F0        .byte $F0
- D - I - 0x037956 23:B946: 2B        .byte $2B    ; <ろ>
- D - I - 0x037957 23:B947: F0        .byte $F0
- D - I - 0x037958 23:B948: F0        .byte $F0
- D - I - 0x037959 23:B949: F0        .byte $F0
- D - I - 0x03795A 23:B94A: F0        .byte $F0
- D - I - 0x03795B 23:B94B: 72        .byte $72    ; <ョ>
- D - I - 0x03795C 23:B94C: 76        .byte $76    ; <ォ>
- D - I - 0x03795D 23:B94D: 6E        .byte $6E    ; <ン>
- D - I - 0x03795E 23:B94E: 58        .byte $58    ; <ネ>
- D - I - 0x03795F 23:B94F: 34        .byte $34    ; <1>
- D - I - 0x037960 23:B950: 1D        .byte $1D    ; <へ>
- D - I - 0x037961 23:B951: 32        .byte $32    ; <ょ>
- D - I - 0x037962 23:B952: 1C        .byte $1C    ; <ふ>
- D - I - 0x037963 23:B953: 2E        .byte $2E    ; <ん>
- D - I - 0x037964 23:B954: 47        .byte $47    ; <キ>
- D - I - 0x037965 23:B955: 11        .byte $11    ; <ち>
- - - - - 0x037966 23:B956: 1E        .byte $1E    ; <ほ>
- D - I - 0x037967 23:B957: 13        .byte $13    ; <て>
- D - I - 0x037968 23:B958: 20        .byte $20    ; <み>
- D - I - 0x037969 23:B959: 37        .byte $37    ; <4>
- D - I - 0x03796A 23:B95A: 5C        .byte $5C    ; <フ>
- - - - - 0x03796B 23:B95B: F0        .byte $F0
- D - I - 0x03796C 23:B95C: F0        .byte $F0
- D - I - 0x03796D 23:B95D: F0        .byte $F0
- - - - - 0x03796E 23:B95E: 45        .byte $45    ; <オ>
- D - I - 0x03796F 23:B95F: 95        .byte $95
- D - I - 0x037970 23:B960: 8B        .byte $8B    ; <K>
- D - I - 0x037971 23:B961: 7A        .byte $7A    ; <、>
- D - I - 0x037972 23:B962: 57        .byte $57    ; <ヌ>
- D - I - 0x037973 23:B963: 35        .byte $35    ; <2>
- D - I - 0x037974 23:B964: 59        .byte $59    ; <ノ>
- D - I - 0x037975 23:B965: 28        .byte $28    ; <り>
- D - I - 0x037976 23:B966: 4A        .byte $4A    ; <コ>
- D - I - 0x037977 23:B967: 52        .byte $52    ; <ツ>
- - - - - 0x037978 23:B968: 3B        .byte $3B    ; <8>
- D - I - 0x037979 23:B969: 1D        .byte $1D    ; <へ>
- D - I - 0x03797A 23:B96A: 41        .byte $41    ; <ア>
- D - I - 0x03797B 23:B96B: 2B        .byte $2B    ; <ろ>
- D - I - 0x03797C 23:B96C: 39        .byte $39    ; <6>
- D - I - 0x03797D 23:B96D: 67        .byte $67    ; <ラ>
- D - I - 0x03797E 23:B96E: 43        .byte $43    ; <ウ>
- - - - - 0x03797F 23:B96F: F0        .byte $F0
- D - I - 0x037980 23:B970: F0        .byte $F0
- D - I - 0x037981 23:B971: F0        .byte $F0
- D - I - 0x037982 23:B972: 81        .byte $81    ; <A>
- D - I - 0x037983 23:B973: BB        .byte $BB    ; <ズ>
- D - I - 0x037984 23:B974: BB        .byte $BB    ; <ズ>
- D - I - 0x037985 23:B975: 9F        .byte $9F
- - - - - 0x037986 23:B976: A1        .byte $A1    ; <ぎ>
- D - I - 0x037987 23:B977: 59        .byte $59    ; <ノ>
- D - I - 0x037988 23:B978: 7B        .byte $7B    ; <。>
- - - - - 0x037989 23:B979: 79        .byte $79    ; <!>
- - - - - 0x03798A 23:B97A: 56        .byte $56    ; <ニ>
- - - - - 0x03798B 23:B97B: 5E        .byte $5E    ; <ホ>
- - - - - 0x03798C 23:B97C: 77        .byte $77    ; <:>
- - - - - 0x03798D 23:B97D: 4C        .byte $4C    ; <シ>
- - - - - 0x03798E 23:B97E: 5A        .byte $5A    ; <ハ>
- - - - - 0x03798F 23:B97F: 5C        .byte $5C    ; <フ>
- - - - - 0x037990 23:B980: 45        .byte $45    ; <オ>
- - - - - 0x037991 23:B981: 73        .byte $73    ; <ヮ>
- - - - - 0x037992 23:B982: A4        .byte $A4    ; <ご>
- - - - - 0x037993 23:B983: F0        .byte $F0
- - - - - 0x037994 23:B984: F0        .byte $F0
- - - - - 0x037995 23:B985: 81        .byte $81    ; <A>
- - - - - 0x037996 23:B986: 9A        .byte $9A
- - - - - 0x037997 23:B987: F0        .byte $F0
- - - - - 0x037998 23:B988: DF        .byte $DF
- - - - - 0x037999 23:B989: C4        .byte $C4    ; <ビ>
- - - - - 0x03799A 23:B98A: 96        .byte $96
- - - - - 0x03799B 23:B98B: 93        .byte $93    ; <Y>
- - - - - 0x03799C 23:B98C: 7D        .byte $7D    ; <ー>
- - - - - 0x03799D 23:B98D: FF        .byte $FF
