.segment "BANK_0C"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
; звуковой движок
; bzk зачем-то проверяются 6 адресов и каждый раз меняется номер банка. можно сразу проверить первый адрес
; вероятно нужны только 0700 и 0701, судя по найденному, да и 0701 возможно нахрен не нужен



.export sub_0x018010_звуковой_движок



sub_0x018010_звуковой_движок:
C D - - - - 0x018010 13:8000: A2 05     LDX #$05
bra_8002_loop:
C - - - - - 0x018012 13:8002: BC 00 07  LDY ram_звук,X
C - - - - - 0x018015 13:8005: C0 32     CPY #$32
C - - - - - 0x018017 13:8007: B0 0E     BCS bra_8017
C - - - - - 0x01801E 13:800E: AC FC 07  LDY ram_prg_07_музыка
C - - - - - 0x018021 13:8011: 8C 01 80  STY $5115
C - - - - - 0x018024 13:8014: 4C 5E 80  JMP loc_805E
bra_8017:
C - - - - - 0x018027 13:8017: C0 44     CPY #$44
C - - - - - 0x018029 13:8019: B0 10     BCS bra_802B
C - - - - - 0x018030 13:8020: A0 0D     LDY #con_prg_bank + $8D
C - - - - - 0x018032 13:8022: 8C 01 80  STY $5115
C - - - - - 0x018035 13:8025: 8C FC 07  STY ram_prg_07_музыка
C - - - - - 0x018038 13:8028: 4C 5E 80  JMP loc_805E
bra_802B:
C - - - - - 0x01803B 13:802B: C0 51     CPY #$51
C - - - - - 0x01803D 13:802D: B0 10     BCS bra_803F
C - - - - - 0x018044 13:8034: A0 0E     LDY #con_prg_bank + $8E
C - - - - - 0x018046 13:8036: 8C 01 80  STY $5115
C - - - - - 0x018049 13:8039: 8C FC 07  STY ram_prg_07_музыка
C - - - - - 0x01804C 13:803C: 4C 5E 80  JMP loc_805E
bra_803F:
C - - - - - 0x01804F 13:803F: C0 5C     CPY #$5C
C - - - - - 0x018051 13:8041: B0 10     BCS bra_8053
C - - - - - 0x018058 13:8048: A0 0F     LDY #con_prg_bank + $8F
C - - - - - 0x01805A 13:804A: 8C 01 80  STY $5115
C - - - - - 0x01805D 13:804D: 8C FC 07  STY ram_prg_07_музыка
C - - - - - 0x018060 13:8050: 4C 5E 80  JMP loc_805E
bra_8053:
C - - - - - 0x018068 13:8058: AC FC 07  LDY ram_prg_07_музыка
C - - - - - 0x01806B 13:805B: 8C 01 80  STY $5115
; bzk заменить на bxx
; в целом цикл можно сделать попроще, типа сравнивать номер звука на байты из таблицы и постоянно увеличивать Y, начав например с 0D
; но возможно вообще этот цикл нахрен и не нужен
loc_805E:
C D - - - - 0x01806E 13:805E: CA        DEX
C - - - - - 0x01806F 13:805F: 10 A1     BPL bra_8002_loop
C - - - - - 0x018071 13:8061: A2 05     LDX #$05
bra_8063:
C - - - - - 0x018073 13:8063: BC 00 07  LDY ram_звук,X
C - - - - - 0x018076 13:8066: F0 4F     BEQ bra_80B7
C - - - - - 0x018078 13:8068: C0 72     CPY #$72
C - - - - - 0x01807A 13:806A: B0 4B     BCS bra_80B7
C - - - - - 0x01807C 13:806C: C0 31     CPY #$31
C - - - - - 0x01807E 13:806E: D0 3F     BNE bra_80AF
C - - - - - 0x018080 13:8070: A9 19     LDA #$19
C - - - - - 0x018082 13:8072: 8D DF 07  STA ram_07DF
C - - - - - 0x018085 13:8075: 8D CF 07  STA ram_07CF
C - - - - - 0x018088 13:8078: 8D D1 07  STA ram_07D1
C - - - - - 0x01808B 13:807B: 8D D2 07  STA ram_07D2
C - - - - - 0x01808E 13:807E: 8D D3 07  STA ram_07D3
C - - - - - 0x018091 13:8081: 8D D5 07  STA ram_07D5
C - - - - - 0x018094 13:8084: 8D D6 07  STA ram_07D6
C - - - - - 0x018097 13:8087: 8D D7 07  STA ram_07D7
C - - - - - 0x01809A 13:808A: 8D D9 07  STA ram_07D9
C - - - - - 0x01809D 13:808D: 8D DA 07  STA ram_07DA
C - - - - - 0x0180A0 13:8090: 8D DB 07  STA ram_07DB
C - - - - - 0x0180A3 13:8093: 8D DD 07  STA ram_07DD
C - - - - - 0x0180A6 13:8096: 8D DE 07  STA ram_07DE
C - - - - - 0x0180A9 13:8099: A9 0A     LDA #$0A
C - - - - - 0x0180AB 13:809B: 8D D0 07  STA ram_07D0
C - - - - - 0x0180AE 13:809E: 8D D4 07  STA ram_07D4
C - - - - - 0x0180B1 13:80A1: 8D D8 07  STA ram_07D8
C - - - - - 0x0180B4 13:80A4: 8D DC 07  STA ram_07DC
C - - - - - 0x0180B7 13:80A7: A9 00     LDA #$00
C - - - - - 0x0180B9 13:80A9: 9D 00 07  STA ram_звук,X
C - - - - - 0x0180BC 13:80AC: 4C B7 80  JMP loc_80B7
bra_80AF:
C - - - - - 0x0180BF 13:80AF: 20 49 83  JSR sub_8349_прочитать_поинтеры_звука
C - - - - - 0x0180C2 13:80B2: A9 00     LDA #$00
C - - - - - 0x0180C4 13:80B4: 9D 00 07  STA ram_звук,X
bra_80B7:
loc_80B7:
C D - - - - 0x0180C7 13:80B7: CA        DEX
C - - - - - 0x0180C8 13:80B8: 10 A9     BPL bra_8063
C - - - - - 0x0180CA 13:80BA: A9 27     LDA #$27
C - - - - - 0x0180CC 13:80BC: 85 F0     STA ram_00F0
C - - - - - 0x0180CE 13:80BE: A9 07     LDA #$07
C - - - - - 0x0180D0 13:80C0: 85 F1     STA ram_00F1
C - - - - - 0x0180D2 13:80C2: A9 00     LDA #$00
C - - - - - 0x0180D4 13:80C4: 85 F2     STA ram_00F2
C - - - - - 0x0180D6 13:80C6: A0 08     LDY #$08
C - - - - - 0x0180D8 13:80C8: 84 F3     STY ram_00F3
bra_80CA:
C - - - - - 0x0180DA 13:80CA: AD 06 07  LDA ram_0706
C - - - - - 0x0180DD 13:80CD: 4A        LSR
C - - - - - 0x0180DE 13:80CE: 90 02     BCC bra_80D2
C - - - - - 0x0180E0 13:80D0: 09 80     ORA #$80
bra_80D2:
C - - - - - 0x0180E2 13:80D2: 8D 06 07  STA ram_0706
C - - - - - 0x0180E5 13:80D5: 90 35     BCC bra_810C
C - - - - - 0x0180E7 13:80D7: A6 F2     LDX ram_00F2
C - - - - - 0x0180E9 13:80D9: DE 07 07  DEC ram_0707,X
C - - - - - 0x0180EC 13:80DC: D0 03     BNE bra_80E1
C - - - - - 0x0180EE 13:80DE: 20 CB 83  JSR sub_83CB
bra_80E1:
C - - - - - 0x0180F1 13:80E1: A6 F2     LDX ram_00F2
C - - - - - 0x0180F3 13:80E3: DE 09 07  DEC ram_0709,X
C - - - - - 0x0180F6 13:80E6: D0 21     BNE bra_8109
C - - - - - 0x0180F8 13:80E8: A0 02     LDY #$02
C - - - - - 0x0180FA 13:80EA: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0180FC 13:80EC: 85 F6     STA ram_00F6
C - - - - - 0x0180FE 13:80EE: C8        INY
C - - - - - 0x0180FF 13:80EF: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018101 13:80F1: 85 F7     STA ram_00F7
C - - - - - 0x018103 13:80F3: C8        INY
C - - - - - 0x018104 13:80F4: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018106 13:80F6: 48        PHA
C - - - - - 0x018107 13:80F7: 18        CLC
C - - - - - 0x018108 13:80F8: 69 02     ADC #$02
C - - - - - 0x01810A 13:80FA: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01810C 13:80FC: 68        PLA
C - - - - - 0x01810D 13:80FD: A8        TAY
C - - - - - 0x01810E 13:80FE: B1 F6     LDA (ram_00F6),Y
C - - - - - 0x018110 13:8100: 9D 09 07  STA ram_0709,X
C - - - - - 0x018113 13:8103: C8        INY
C - - - - - 0x018114 13:8104: B1 F6     LDA (ram_00F6),Y
C - - - - - 0x018116 13:8106: 9D 0A 07  STA ram_070A,X
bra_8109:
C - - - - - 0x018119 13:8109: 20 DB 81  JSR sub_81DB
bra_810C:
C - - - - - 0x01811C 13:810C: 18        CLC
C - - - - - 0x01811D 13:810D: A9 10     LDA #$10
C - - - - - 0x01811F 13:810F: 65 F0     ADC ram_00F0
C - - - - - 0x018121 13:8111: 85 F0     STA ram_00F0
C - - - - - 0x018123 13:8113: A9 04     LDA #$04
C - - - - - 0x018125 13:8115: 65 F2     ADC ram_00F2
C - - - - - 0x018127 13:8117: 85 F2     STA ram_00F2
C - - - - - 0x018129 13:8119: C6 F3     DEC ram_00F3
C - - - - - 0x01812B 13:811B: D0 AD     BNE bra_80CA
C - - - - - 0x01812D 13:811D: A9 27     LDA #$27
C - - - - - 0x01812F 13:811F: 85 F0     STA ram_00F0
C - - - - - 0x018131 13:8121: 85 FC     STA ram_00FC
C - - - - - 0x018133 13:8123: A9 07     LDA #$07
C - - - - - 0x018135 13:8125: 85 F1     STA ram_00F1
C - - - - - 0x018137 13:8127: 85 FD     STA ram_00FD
C - - - - - 0x018139 13:8129: A9 03     LDA #$03
C - - - - - 0x01813B 13:812B: 85 F2     STA ram_00F2
C - - - - - 0x01813D 13:812D: A9 11     LDA #$11
C - - - - - 0x01813F 13:812F: 85 F3     STA ram_00F3
bra_8131:
C - - - - - 0x018141 13:8131: AD 06 07  LDA ram_0706
C - - - - - 0x018144 13:8134: 25 F3     AND ram_00F3
C - - - - - 0x018146 13:8136: F0 14     BEQ bra_814C
C - - - - - 0x018148 13:8138: 29 0F     AND #$0F
C - - - - - 0x01814A 13:813A: D0 0D     BNE bra_8149
C - - - - - 0x01814C 13:813C: 18        CLC
C - - - - - 0x01814D 13:813D: A9 40     LDA #$40
C - - - - - 0x01814F 13:813F: 65 F0     ADC ram_00F0
C - - - - - 0x018151 13:8141: 85 F0     STA ram_00F0
C - - - - - 0x018153 13:8143: A9 00     LDA #$00
C - - - - - 0x018155 13:8145: 65 F1     ADC ram_00F1
C - - - - - 0x018157 13:8147: 85 F1     STA ram_00F1
bra_8149:
C - - - - - 0x018159 13:8149: 20 6E 81  JSR sub_816E
bra_814C:
C - - - - - 0x01815C 13:814C: 18        CLC
C - - - - - 0x01815D 13:814D: A9 10     LDA #$10
C - - - - - 0x01815F 13:814F: 65 FC     ADC ram_00FC
C - - - - - 0x018161 13:8151: 85 FC     STA ram_00FC
C - - - - - 0x018163 13:8153: 85 F0     STA ram_00F0
C - - - - - 0x018165 13:8155: A9 00     LDA #$00
C - - - - - 0x018167 13:8157: 65 FD     ADC ram_00FD
C - - - - - 0x018169 13:8159: 85 FD     STA ram_00FD
C - - - - - 0x01816B 13:815B: 85 F1     STA ram_00F1
C - - - - - 0x01816D 13:815D: 06 F3     ASL ram_00F3
C - - - - - 0x01816F 13:815F: C6 F2     DEC ram_00F2
C - - - - - 0x018171 13:8161: 10 CE     BPL bra_8131
C - - - - - 0x018173 13:8163: AD E9 07  LDA ram_07E9
C - - - - - 0x018176 13:8166: F0 05     BEQ bra_816D_RTS
- - - - - - 0x018178 13:8168: A9 00     LDA #$00
- - - - - - 0x01817A 13:816A: 8D 15 40  STA $4015
bra_816D_RTS:
C - - - - - 0x01817D 13:816D: 60        RTS

sub_816E:
C - - - - - 0x01817E 13:816E: A9 03     LDA #$03
C - - - - - 0x018180 13:8170: 45 F2     EOR ram_00F2
C - - - - - 0x018182 13:8172: 0A        ASL
C - - - - - 0x018183 13:8173: 0A        ASL
C - - - - - 0x018184 13:8174: AA        TAX
C - - - - - 0x018185 13:8175: A0 06     LDY #$06
C - - - - - 0x018187 13:8177: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018189 13:8179: 48        PHA
C - - - - - 0x01818A 13:817A: A5 F2     LDA ram_00F2
C - - - - - 0x01818C 13:817C: 85 FB     STA ram_00FB
C - - - - - 0x01818E 13:817E: C9 01     CMP #$01
C - - - - - 0x018190 13:8180: D0 07     BNE bra_8189
C - - - - - 0x018192 13:8182: 68        PLA
C - - - - - 0x018193 13:8183: 29 0F     AND #$0F
C - - - - - 0x018195 13:8185: 09 80     ORA #$80
C - - - - - 0x018197 13:8187: D0 1B     BNE bra_81A4
bra_8189:
C - - - - - 0x018199 13:8189: 68        PLA
C - - - - - 0x01819A 13:818A: 09 30     ORA #$30
C - - - - - 0x01819C 13:818C: 9D 00 40  STA $4000,X
C - - - - - 0x01819F 13:818F: A9 10     LDA #$10
C - - - - - 0x0181A1 13:8191: A0 05     LDY #$05
C - - - - - 0x0181A3 13:8193: 31 F0     AND (ram_00F0),Y
C - - - - - 0x0181A5 13:8195: D0 10     BNE bra_81A7
C - - - - - 0x0181A7 13:8197: A9 08     LDA #$08
C - - - - - 0x0181A9 13:8199: A4 FB     LDY ram_00FB
C - - - - - 0x0181AB 13:819B: 99 E4 07  STA ram_07E4,Y
C - - - - - 0x0181AE 13:819E: 9D 01 40  STA $4001,X
C - - - - - 0x0181B1 13:81A1: 4C B1 81  JMP loc_81B1
bra_81A4:
C - - - - - 0x0181B4 13:81A4: 9D 00 40  STA $4000,X
bra_81A7:
C - - - - - 0x0181B7 13:81A7: A0 08     LDY #$08
C - - - - - 0x0181B9 13:81A9: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0181BB 13:81AB: 10 2D     BPL bra_81DA_RTS
C - - - - - 0x0181BD 13:81AD: 29 7F     AND #$7F
C - - - - - 0x0181BF 13:81AF: 91 F0     STA (ram_00F0),Y
loc_81B1:
C D - - - - 0x0181C1 13:81B1: A0 07     LDY #$07
C - - - - - 0x0181C3 13:81B3: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0181C5 13:81B5: 9D 02 40  STA $4002,X
C - - - - - 0x0181C8 13:81B8: C8        INY
C - - - - - 0x0181C9 13:81B9: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0181CB 13:81BB: 09 18     ORA #$18
C - - - - - 0x0181CD 13:81BD: A4 FB     LDY ram_00FB
C - - - - - 0x0181CF 13:81BF: F0 09     BEQ bra_81CA
C - - - - - 0x0181D1 13:81C1: C0 01     CPY #$01
C - - - - - 0x0181D3 13:81C3: F0 05     BEQ bra_81CA
C - - - - - 0x0181D5 13:81C5: D9 E0 07  CMP ram_07E0,Y
C - - - - - 0x0181D8 13:81C8: F0 10     BEQ bra_81DA_RTS
bra_81CA:
C - - - - - 0x0181DA 13:81CA: 9D 03 40  STA $4003,X
C - - - - - 0x0181DD 13:81CD: 99 E0 07  STA ram_07E0,Y
C - - - - - 0x0181E0 13:81D0: B9 E4 07  LDA ram_07E4,Y
C - - - - - 0x0181E3 13:81D3: D0 05     BNE bra_81DA_RTS
C - - - - - 0x0181E5 13:81D5: A9 00     LDA #$00
C - - - - - 0x0181E7 13:81D7: 99 E0 07  STA ram_07E0,Y
bra_81DA_RTS:
C - - - - - 0x0181EA 13:81DA: 60        RTS

sub_81DB:
C - - - - - 0x0181EB 13:81DB: A0 05     LDY #$05
C - - - - - 0x0181ED 13:81DD: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0181EF 13:81DF: AA        TAX
C - - - - - 0x0181F0 13:81E0: 29 F0     AND #$F0
C - - - - - 0x0181F2 13:81E2: 85 F6     STA ram_00F6
C - - - - - 0x0181F4 13:81E4: 29 20     AND #$20
C - - - - - 0x0181F6 13:81E6: F0 06     BEQ bra_81EE
C - - - - - 0x0181F8 13:81E8: A9 0F     LDA #$0F
C - - - - - 0x0181FA 13:81EA: 85 F7     STA ram_00F7
C - - - - - 0x0181FC 13:81EC: D0 45     BNE bra_8233
bra_81EE:
C - - - - - 0x0181FE 13:81EE: 8A        TXA
C - - - - - 0x0181FF 13:81EF: 29 0F     AND #$0F
C - - - - - 0x018201 13:81F1: 85 F7     STA ram_00F7
C - - - - - 0x018203 13:81F3: A4 F3     LDY ram_00F3
C - - - - - 0x018205 13:81F5: 88        DEY
C - - - - - 0x018206 13:81F6: BE CF 07  LDX ram_07CF,Y
C - - - - - 0x018209 13:81F9: F0 38     BEQ bra_8233
C - - - - - 0x01820B 13:81FB: CA        DEX
C - - - - - 0x01820C 13:81FC: 8A        TXA
C - - - - - 0x01820D 13:81FD: 99 CF 07  STA ram_07CF,Y
C - - - - - 0x018210 13:8200: D0 31     BNE bra_8233
C - - - - - 0x018212 13:8202: A5 F7     LDA ram_00F7
C - - - - - 0x018214 13:8204: 18        CLC
C - - - - - 0x018215 13:8205: 69 01     ADC #$01
C - - - - - 0x018217 13:8207: C9 0F     CMP #$0F
C - - - - - 0x018219 13:8209: 85 F7     STA ram_00F7
C - - - - - 0x01821B 13:820B: D0 0A     BNE bra_8217
C - - - - - 0x01821D 13:820D: A9 00     LDA #$00
C - - - - - 0x01821F 13:820F: 99 D7 07  STA ram_07D7,Y
C - - - - - 0x018222 13:8212: A9 80     LDA #$80
C - - - - - 0x018224 13:8214: 8D E8 07  STA ram_07E8
bra_8217:
C - - - - - 0x018227 13:8217: A5 F7     LDA ram_00F7
C - - - - - 0x018229 13:8219: 05 F6     ORA ram_00F6
C - - - - - 0x01822B 13:821B: AA        TAX
C - - - - - 0x01822C 13:821C: A0 05     LDY #$05
C - - - - - 0x01822E 13:821E: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018230 13:8220: 8A        TXA
C - - - - - 0x018231 13:8221: 29 0F     AND #$0F
C - - - - - 0x018233 13:8223: 85 F7     STA ram_00F7
C - - - - - 0x018235 13:8225: A4 F3     LDY ram_00F3
C - - - - - 0x018237 13:8227: 88        DEY
C - - - - - 0x018238 13:8228: BE CF 07  LDX ram_07CF,Y
C - - - - - 0x01823B 13:822B: D0 06     BNE bra_8233
C - - - - - 0x01823D 13:822D: B9 D7 07  LDA ram_07D7,Y
C - - - - - 0x018240 13:8230: 99 CF 07  STA ram_07CF,Y
bra_8233:
C - - - - - 0x018243 13:8233: A6 F2     LDX ram_00F2
C - - - - - 0x018245 13:8235: BD 0A 07  LDA ram_070A,X
C - - - - - 0x018248 13:8238: 38        SEC
C - - - - - 0x018249 13:8239: E5 F7     SBC ram_00F7
C - - - - - 0x01824B 13:823B: 10 02     BPL bra_823F
C - - - - - 0x01824D 13:823D: A9 00     LDA #$00
bra_823F:
C - - - - - 0x01824F 13:823F: 05 F6     ORA ram_00F6
C - - - - - 0x018251 13:8241: A0 06     LDY #$06
C - - - - - 0x018253 13:8243: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018255 13:8245: A6 F3     LDX ram_00F3
C - - - - - 0x018257 13:8247: CA        DEX
C - - - - - 0x018258 13:8248: BD AF 07  LDA ram_07AF,X
C - - - - - 0x01825B 13:824B: C9 01     CMP #$01
C - - - - - 0x01825D 13:824D: F0 08     BEQ bra_8257
C - - - - - 0x01825F 13:824F: C9 02     CMP #$02
C - - - - - 0x018261 13:8251: D0 03     BNE bra_8256_RTS
C - - - - - 0x018263 13:8253: 4C D2 82  JMP loc_82D2
bra_8256_RTS:
C - - - - - 0x018266 13:8256: 60        RTS
bra_8257:
C - - - - - 0x018267 13:8257: BD C7 07  LDA ram_07C7,X
C - - - - - 0x01826A 13:825A: 0A        ASL
C - - - - - 0x01826B 13:825B: A8        TAY
C - - - - - 0x01826C 13:825C: B9 69 82  LDA tbl_8269,Y
C - - - - - 0x01826F 13:825F: 85 F9     STA ram_00F9
C - - - - - 0x018271 13:8261: B9 6A 82  LDA tbl_8269 + 1,Y
C - - - - - 0x018274 13:8264: 85 FA     STA ram_00FA
C - - - - - 0x018276 13:8266: 6C F9 00  JMP (ram_00F9)

tbl_8269:
- D - - - - 0x018279 13:8269: 97 82     .word ofs_011_8297_00
- D - - - - 0x01827B 13:826B: 97 82     .word ofs_011_8297_01
- D - - - - 0x01827D 13:826D: B4 82     .word ofs_011_82B4_02
- D - - - - 0x01827F 13:826F: C9 82     .word ofs_011_82C9_03
- D - - - - 0x018281 13:8271: B4 82     .word ofs_011_82B4_04
- D - - - - 0x018283 13:8273: 97 82     .word ofs_011_8297_05
- D - - - - 0x018285 13:8275: 97 82     .word ofs_011_8297_06
- D - - - - 0x018287 13:8277: 7D 82     .word ofs_011_827D_07
- D - - - - 0x018289 13:8279: 92 82     .word ofs_011_8292_08
- D - - - - 0x01828B 13:827B: 7D 82     .word ofs_011_827D_09

ofs_011_827D_07:
ofs_011_827D_09:
C - J - - - 0x01828D 13:827D: A9 01     LDA #$01
loc_827F:
C D - - - - 0x01828F 13:827F: 18        CLC
C - - - - - 0x018290 13:8280: 7D B7 07  ADC ram_07B7,X
C - - - - - 0x018293 13:8283: A0 07     LDY #$07
C - - - - - 0x018295 13:8285: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018297 13:8287: BD BF 07  LDA ram_07BF,X
C - - - - - 0x01829A 13:828A: 69 00     ADC #$00
C - - - - - 0x01829C 13:828C: C8        INY
C - - - - - 0x01829D 13:828D: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01829F 13:828F: 4C A4 82  JMP loc_82A4

ofs_011_8292_08:
C - J - - - 0x0182A2 13:8292: A9 02     LDA #$02
C - - - - - 0x0182A4 13:8294: 4C 7F 82  JMP loc_827F

ofs_011_8297_00:
ofs_011_8297_01:
ofs_011_8297_05:
ofs_011_8297_06:
C - J - - - 0x0182A7 13:8297: BD B7 07  LDA ram_07B7,X
C - - - - - 0x0182AA 13:829A: A0 07     LDY #$07
C - - - - - 0x0182AC 13:829C: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0182AE 13:829E: BD BF 07  LDA ram_07BF,X
C - - - - - 0x0182B1 13:82A1: C8        INY
C - - - - - 0x0182B2 13:82A2: 91 F0     STA (ram_00F0),Y
loc_82A4:
C D - - - - 0x0182B4 13:82A4: BD C7 07  LDA ram_07C7,X
C - - - - - 0x0182B7 13:82A7: 18        CLC
C - - - - - 0x0182B8 13:82A8: 69 01     ADC #$01
C - - - - - 0x0182BA 13:82AA: C9 0A     CMP #$0A
C - - - - - 0x0182BC 13:82AC: D0 02     BNE bra_82B0
C - - - - - 0x0182BE 13:82AE: A9 00     LDA #$00
bra_82B0:
C - - - - - 0x0182C0 13:82B0: 9D C7 07  STA ram_07C7,X
C - - - - - 0x0182C3 13:82B3: 60        RTS

ofs_011_82B4_02:
ofs_011_82B4_04:
C - J - - - 0x0182C4 13:82B4: BD B7 07  LDA ram_07B7,X
C - - - - - 0x0182C7 13:82B7: 38        SEC
C - - - - - 0x0182C8 13:82B8: E9 01     SBC #$01
loc_82BA:
C D - - - - 0x0182CA 13:82BA: A0 07     LDY #$07
C - - - - - 0x0182CC 13:82BC: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0182CE 13:82BE: BD BF 07  LDA ram_07BF,X
C - - - - - 0x0182D1 13:82C1: E9 00     SBC #$00
C - - - - - 0x0182D3 13:82C3: C8        INY
C - - - - - 0x0182D4 13:82C4: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0182D6 13:82C6: 4C A4 82  JMP loc_82A4

ofs_011_82C9_03:
C - J - - - 0x0182D9 13:82C9: BD B7 07  LDA ram_07B7,X
C - - - - - 0x0182DC 13:82CC: 38        SEC
C - - - - - 0x0182DD 13:82CD: E9 02     SBC #$02
C - - - - - 0x0182DF 13:82CF: 4C BA 82  JMP loc_82BA
loc_82D2:
C D - - - - 0x0182E2 13:82D2: BD C7 07  LDA ram_07C7,X
C - - - - - 0x0182E5 13:82D5: 0A        ASL
C - - - - - 0x0182E6 13:82D6: A8        TAY
C - - - - - 0x0182E7 13:82D7: B9 E4 82  LDA tbl_82E4,Y
C - - - - - 0x0182EA 13:82DA: 85 F9     STA ram_00F9
C - - - - - 0x0182EC 13:82DC: B9 E5 82  LDA tbl_82E4 + 1,Y
C - - - - - 0x0182EF 13:82DF: 85 FA     STA ram_00FA
C - - - - - 0x0182F1 13:82E1: 6C F9 00  JMP (ram_00F9)

tbl_82E4:
- D - - - - 0x0182F4 13:82E4: 0E 83     .word ofs_012_830E_00
- D - - - - 0x0182F6 13:82E6: 2B 83     .word ofs_012_832B_01
- D - - - - 0x0182F8 13:82E8: 40 83     .word ofs_012_8340_02
- D - - - - 0x0182FA 13:82EA: 2B 83     .word ofs_012_832B_03
- D - - - - 0x0182FC 13:82EC: 0E 83     .word ofs_012_830E_04
- D - - - - 0x0182FE 13:82EE: F4 82     .word ofs_012_82F4_05
- D - - - - 0x018300 13:82F0: 09 83     .word ofs_012_8309_06
- D - - - - 0x018302 13:82F2: F4 82     .word ofs_012_82F4_07

ofs_012_82F4_05:
ofs_012_82F4_07:
C - J - - - 0x018304 13:82F4: A9 03     LDA #$03
loc_82F6:
C D - - - - 0x018306 13:82F6: 18        CLC
C - - - - - 0x018307 13:82F7: 7D B7 07  ADC ram_07B7,X
C - - - - - 0x01830A 13:82FA: A0 07     LDY #$07
C - - - - - 0x01830C 13:82FC: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01830E 13:82FE: BD BF 07  LDA ram_07BF,X
C - - - - - 0x018311 13:8301: 69 00     ADC #$00
C - - - - - 0x018313 13:8303: C8        INY
C - - - - - 0x018314 13:8304: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018316 13:8306: 4C 1B 83  JMP loc_831B

ofs_012_8309_06:
C - J - - - 0x018319 13:8309: A9 06     LDA #$06
C - - - - - 0x01831B 13:830B: 4C F6 82  JMP loc_82F6

ofs_012_830E_00:
ofs_012_830E_04:
C - J - - - 0x01831E 13:830E: BD B7 07  LDA ram_07B7,X
C - - - - - 0x018321 13:8311: A0 07     LDY #$07
C - - - - - 0x018323 13:8313: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018325 13:8315: BD BF 07  LDA ram_07BF,X
C - - - - - 0x018328 13:8318: C8        INY
C - - - - - 0x018329 13:8319: 91 F0     STA (ram_00F0),Y
loc_831B:
C D - - - - 0x01832B 13:831B: BD C7 07  LDA ram_07C7,X
C - - - - - 0x01832E 13:831E: 18        CLC
C - - - - - 0x01832F 13:831F: 69 01     ADC #$01
C - - - - - 0x018331 13:8321: C9 08     CMP #$08
C - - - - - 0x018333 13:8323: D0 02     BNE bra_8327
C - - - - - 0x018335 13:8325: A9 00     LDA #$00
bra_8327:
C - - - - - 0x018337 13:8327: 9D C7 07  STA ram_07C7,X
C - - - - - 0x01833A 13:832A: 60        RTS

ofs_012_832B_01:
ofs_012_832B_03:
C - J - - - 0x01833B 13:832B: BD B7 07  LDA ram_07B7,X
C - - - - - 0x01833E 13:832E: 38        SEC
C - - - - - 0x01833F 13:832F: E9 03     SBC #$03
loc_8331:
C D - - - - 0x018341 13:8331: A0 07     LDY #$07
C - - - - - 0x018343 13:8333: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018345 13:8335: BD BF 07  LDA ram_07BF,X
C - - - - - 0x018348 13:8338: E9 00     SBC #$00
C - - - - - 0x01834A 13:833A: C8        INY
C - - - - - 0x01834B 13:833B: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01834D 13:833D: 4C 1B 83  JMP loc_831B

ofs_012_8340_02:
C - J - - - 0x018350 13:8340: BD B7 07  LDA ram_07B7,X
C - - - - - 0x018353 13:8343: 38        SEC
C - - - - - 0x018354 13:8344: E9 06     SBC #$06
C - - - - - 0x018356 13:8346: 4C 31 83  JMP loc_8331

sub_8349_прочитать_поинтеры_звука:
C - - - - - 0x018359 13:8349: 86 F5     STX ram_00F5
C - - - - - 0x01835B 13:834B: A9 00     LDA #$00
C - - - - - 0x01835D 13:834D: 9D 00 07  STA ram_звук,X
C - - - - - 0x018360 13:8350: 88        DEY
C - - - - - 0x018361 13:8351: 98        TYA
C - - - - - 0x018362 13:8352: 0A        ASL
C - - - - - 0x018363 13:8353: A8        TAY
C - - - - - 0x018364 13:8354: B9 DA 8B  LDA tbl_8BDA_таблица_звуков,Y
C - - - - - 0x018367 13:8357: 85 F0     STA ram_00F0
C - - - - - 0x018369 13:8359: B9 DB 8B  LDA tbl_8BDA_таблица_звуков + 1,Y
C - - - - - 0x01836C 13:835C: 85 F1     STA ram_00F1
C - - - - - 0x01836E 13:835E: A0 00     LDY #$00
bra_8360_продолжить_чтение_поинтеров_звука:
C - - - - - 0x018370 13:8360: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018372 13:8362: 10 08     BPL bra_836C_прочитать_поинтеры_звука
; в противном случае полностью отключить DMC канал
C - - - - - 0x018374 13:8364: A2 0F     LDX #$0F
C - - - - - 0x018376 13:8366: 8E 15 40  STX $4015
C - - - - - 0x018379 13:8369: A6 F5     LDX ram_00F5
C - - - - - 0x01837B 13:836B: 60        RTS
bra_836C_прочитать_поинтеры_звука:
C - - - - - 0x01837C 13:836C: 85 F4     STA ram_00F4
C - - - - - 0x01837E 13:836E: A9 08     LDA #$08
C - - - - - 0x018380 13:8370: 18        CLC
C - - - - - 0x018381 13:8371: E5 F4     SBC ram_00F4
C - - - - - 0x018383 13:8373: AA        TAX
C - - - - - 0x018384 13:8374: A9 00     LDA #$00
C - - - - - 0x018386 13:8376: 9D A7 07  STA ram_07A7,X
C - - - - - 0x018389 13:8379: 9D AF 07  STA ram_07AF,X
C - - - - - 0x01838C 13:837C: 8D E3 07  STA ram_07E3
C - - - - - 0x01838F 13:837F: 8D E2 07  STA ram_07E2
C - - - - - 0x018392 13:8382: 9D EA 07  STA ram_07EA,X
C - - - - - 0x018395 13:8385: 9D CF 07  STA ram_07CF,X
C - - - - - 0x018398 13:8388: 9D D7 07  STA ram_07D7,X
C - - - - - 0x01839B 13:838B: 8D DF 07  STA ram_07DF
C - - - - - 0x01839E 13:838E: 9D F4 07  STA ram_07F4,X
C - - - - - 0x0183A1 13:8391: 8D E8 07  STA ram_07E8
C - - - - - 0x0183A4 13:8394: A5 F4     LDA ram_00F4
C - - - - - 0x0183A6 13:8396: 0A        ASL
C - - - - - 0x0183A7 13:8397: 0A        ASL
C - - - - - 0x0183A8 13:8398: 0A        ASL
C - - - - - 0x0183A9 13:8399: 0A        ASL
C - - - - - 0x0183AA 13:839A: AA        TAX
C - - - - - 0x0183AB 13:839B: C8        INY
C - - - - - 0x0183AC 13:839C: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0183AE 13:839E: 9D 27 07  STA ram_0727,X
C - - - - - 0x0183B1 13:83A1: C8        INY
C - - - - - 0x0183B2 13:83A2: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0183B4 13:83A4: 9D 28 07  STA ram_0728,X
C - - - - - 0x0183B7 13:83A7: A9 00     LDA #$00
C - - - - - 0x0183B9 13:83A9: 9D 2C 07  STA ram_072C,X
C - - - - - 0x0183BC 13:83AC: A9 0F     LDA #$0F
C - - - - - 0x0183BE 13:83AE: 9D 30 07  STA ram_0730,X
C - - - - - 0x0183C1 13:83B1: A5 F4     LDA ram_00F4
C - - - - - 0x0183C3 13:83B3: 0A        ASL
C - - - - - 0x0183C4 13:83B4: 0A        ASL
C - - - - - 0x0183C5 13:83B5: AA        TAX
C - - - - - 0x0183C6 13:83B6: A9 01     LDA #$01
C - - - - - 0x0183C8 13:83B8: 9D 07 07  STA ram_0707,X
C - - - - - 0x0183CB 13:83BB: 4A        LSR
C - - - - - 0x0183CC 13:83BC: A6 F4     LDX ram_00F4
bra_83BE:
C - - - - - 0x0183CE 13:83BE: 2A        ROL
C - - - - - 0x0183CF 13:83BF: CA        DEX
C - - - - - 0x0183D0 13:83C0: 10 FC     BPL bra_83BE
C - - - - - 0x0183D2 13:83C2: 0D 06 07  ORA ram_0706
C - - - - - 0x0183D5 13:83C5: 8D 06 07  STA ram_0706
C - - - - - 0x0183D8 13:83C8: C8        INY
C - - - - - 0x0183D9 13:83C9: 10 95     BPL bra_8360_продолжить_чтение_поинтеров_звука

sub_83CB:
C - - - - - 0x0183DB 13:83CB: A9 CF     LDA #$CF
C - - - - - 0x0183DD 13:83CD: A0 05     LDY #$05
C - - - - - 0x0183DF 13:83CF: 31 F0     AND (ram_00F0),Y
C - - - - - 0x0183E1 13:83D1: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0183E3 13:83D3: A0 00     LDY #$00
C - - - - - 0x0183E5 13:83D5: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0183E7 13:83D7: 85 F4     STA ram_00F4
C - - - - - 0x0183E9 13:83D9: C8        INY
C - - - - - 0x0183EA 13:83DA: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0183EC 13:83DC: 85 F5     STA ram_00F5
C - - - - - 0x0183EE 13:83DE: 88        DEY
bra_83DF:
C - - - - - 0x0183EF 13:83DF: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x0183F1 13:83E1: 10 21     BPL bra_8404_меньше_80
C - - - - - 0x0183F3 13:83E3: C8        INY
C - - - - - 0x0183F4 13:83E4: C9 E0     CMP #$E0
C - - - - - 0x0183F6 13:83E6: 90 05     BCC bra_83ED_80_и_выше
C - - - - - 0x0183F8 13:83E8: 20 C9 84  JSR sub_84C9_E0_и_выше
C - - - - - 0x0183FB 13:83EB: 10 F2     BPL bra_83DF
bra_83ED_80_и_выше:
C - - - - - 0x0183FD 13:83ED: C9 B0     CMP #$B0
C - - - - - 0x0183FF 13:83EF: 90 03     BCC bra_83F4_80_AF
- - - - - - 0x018401 13:83F1: C8        INY
- - - - - - 0x018402 13:83F2: D0 EB     BNE bra_83DF
bra_83F4_80_AF:
C - - - - - 0x018404 13:83F4: 29 3F     AND #$3F
C - - - - - 0x018406 13:83F6: AA        TAX
C - - - - - 0x018407 13:83F7: BD 25 87  LDA tbl_8725,X
C - - - - - 0x01840A 13:83FA: A6 F2     LDX ram_00F2
C - - - - - 0x01840C 13:83FC: 9D 07 07  STA ram_0707,X
C - - - - - 0x01840F 13:83FF: 9D 08 07  STA ram_0708,X
C - - - - - 0x018412 13:8402: 10 DB     BPL bra_83DF
bra_8404_меньше_80:
C - - - - - 0x018414 13:8404: C8        INY
C - - - - - 0x018415 13:8405: 48        PHA
C - - - - - 0x018416 13:8406: 98        TYA
C - - - - - 0x018417 13:8407: A0 00     LDY #$00
C - - - - - 0x018419 13:8409: 18        CLC
C - - - - - 0x01841A 13:840A: 65 F4     ADC ram_00F4
C - - - - - 0x01841C 13:840C: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01841E 13:840E: C8        INY
C - - - - - 0x01841F 13:840F: A9 00     LDA #$00
C - - - - - 0x018421 13:8411: 65 F5     ADC ram_00F5
C - - - - - 0x018423 13:8413: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018425 13:8415: 68        PLA
C - - - - - 0x018426 13:8416: A2 05     LDX #$05
C - - - - - 0x018428 13:8418: E4 F3     CPX ram_00F3
C - - - - - 0x01842A 13:841A: F0 06     BEQ bra_8422
C - - - - - 0x01842C 13:841C: A2 01     LDX #$01
C - - - - - 0x01842E 13:841E: E4 F3     CPX ram_00F3
C - - - - - 0x018430 13:8420: 90 0C     BCC bra_842E
bra_8422:
C - - - - - 0x018432 13:8422: C9 10     CMP #$10
C - - - - - 0x018434 13:8424: F0 0F     BEQ bra_8435
C - - - - - 0x018436 13:8426: 85 F4     STA ram_00F4
C - - - - - 0x018438 13:8428: A9 00     LDA #$00
C - - - - - 0x01843A 13:842A: 85 F5     STA ram_00F5
C - - - - - 0x01843C 13:842C: F0 2E     BEQ bra_845C
bra_842E:
C - - - - - 0x01843E 13:842E: AA        TAX
C - - - - - 0x01843F 13:842F: 29 0F     AND #$0F
C - - - - - 0x018441 13:8431: C9 0C     CMP #$0C
C - - - - - 0x018443 13:8433: D0 0A     BNE bra_843F
bra_8435:
C - - - - - 0x018445 13:8435: A0 05     LDY #$05
C - - - - - 0x018447 13:8437: A9 20     LDA #$20
C - - - - - 0x018449 13:8439: 11 F0     ORA (ram_00F0),Y
C - - - - - 0x01844B 13:843B: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01844D 13:843D: D0 67     BNE bra_84A6
bra_843F:
C - - - - - 0x01844F 13:843F: 0A        ASL
C - - - - - 0x018450 13:8440: A8        TAY
C - - - - - 0x018451 13:8441: B9 0D 87  LDA tbl_870D,Y
C - - - - - 0x018454 13:8444: 85 F4     STA ram_00F4
C - - - - - 0x018456 13:8446: B9 0E 87  LDA tbl_870D + 1,Y
C - - - - - 0x018459 13:8449: 85 F5     STA ram_00F5
C - - - - - 0x01845B 13:844B: 8A        TXA
C - - - - - 0x01845C 13:844C: 29 F0     AND #$F0
C - - - - - 0x01845E 13:844E: 4A        LSR
C - - - - - 0x01845F 13:844F: 4A        LSR
C - - - - - 0x018460 13:8450: 4A        LSR
C - - - - - 0x018461 13:8451: 4A        LSR
C - - - - - 0x018462 13:8452: AA        TAX
C - - - - - 0x018463 13:8453: F0 07     BEQ bra_845C
bra_8455:
C - - - - - 0x018465 13:8455: 46 F5     LSR ram_00F5
C - - - - - 0x018467 13:8457: 66 F4     ROR ram_00F4
C - - - - - 0x018469 13:8459: CA        DEX
C - - - - - 0x01846A 13:845A: D0 F9     BNE bra_8455
bra_845C:
C - - - - - 0x01846C 13:845C: A5 F4     LDA ram_00F4
C - - - - - 0x01846E 13:845E: A6 F3     LDX ram_00F3
C - - - - - 0x018470 13:8460: CA        DEX
C - - - - - 0x018471 13:8461: BC F4 07  LDY ram_07F4,X
C - - - - - 0x018474 13:8464: F0 29     BEQ bra_848F
C - - - - - 0x018476 13:8466: 38        SEC
C - - - - - 0x018477 13:8467: FD A7 07  SBC ram_07A7,X
C - - - - - 0x01847A 13:846A: 90 0C     BCC bra_8478
C - - - - - 0x01847C 13:846C: A0 07     LDY #$07
C - - - - - 0x01847E 13:846E: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018480 13:8470: 9D B7 07  STA ram_07B7,X
C - - - - - 0x018483 13:8473: A5 F5     LDA ram_00F5
C - - - - - 0x018485 13:8475: 4C 84 84  JMP loc_8484
bra_8478:
C - - - - - 0x018488 13:8478: A0 07     LDY #$07
C - - - - - 0x01848A 13:847A: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01848C 13:847C: 9D B7 07  STA ram_07B7,X
C - - - - - 0x01848F 13:847F: A5 F5     LDA ram_00F5
C - - - - - 0x018491 13:8481: 38        SEC
C - - - - - 0x018492 13:8482: E9 01     SBC #$01
loc_8484:
C D - - - - 0x018494 13:8484: 09 80     ORA #$80
C - - - - - 0x018496 13:8486: C8        INY
C - - - - - 0x018497 13:8487: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018499 13:8489: 9D BF 07  STA ram_07BF,X
C - - - - - 0x01849C 13:848C: 4C A6 84  JMP loc_84A6
bra_848F:
C - - - - - 0x01849F 13:848F: 18        CLC
C - - - - - 0x0184A0 13:8490: 7D A7 07  ADC ram_07A7,X
C - - - - - 0x0184A3 13:8493: A0 07     LDY #$07
C - - - - - 0x0184A5 13:8495: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0184A7 13:8497: 9D B7 07  STA ram_07B7,X
C - - - - - 0x0184AA 13:849A: C8        INY
C - - - - - 0x0184AB 13:849B: A5 F5     LDA ram_00F5
C - - - - - 0x0184AD 13:849D: 69 00     ADC #$00
C - - - - - 0x0184AF 13:849F: 09 80     ORA #$80
C - - - - - 0x0184B1 13:84A1: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0184B3 13:84A3: 9D BF 07  STA ram_07BF,X
bra_84A6:
loc_84A6:
C D - - - - 0x0184B6 13:84A6: A6 F3     LDX ram_00F3
C - - - - - 0x0184B8 13:84A8: CA        DEX
C - - - - - 0x0184B9 13:84A9: A9 00     LDA #$00
C - - - - - 0x0184BB 13:84AB: 9D F4 07  STA ram_07F4,X
C - - - - - 0x0184BE 13:84AE: BD EA 07  LDA ram_07EA,X
C - - - - - 0x0184C1 13:84B1: D0 0D     BNE bra_84C0
C - - - - - 0x0184C3 13:84B3: A6 F2     LDX ram_00F2
C - - - - - 0x0184C5 13:84B5: A9 01     LDA #$01
C - - - - - 0x0184C7 13:84B7: 9D 09 07  STA ram_0709,X
C - - - - - 0x0184CA 13:84BA: A9 00     LDA #$00
C - - - - - 0x0184CC 13:84BC: A0 04     LDY #$04
C - - - - - 0x0184CE 13:84BE: 91 F0     STA (ram_00F0),Y
bra_84C0:
C - - - - - 0x0184D0 13:84C0: A6 F2     LDX ram_00F2
C - - - - - 0x0184D2 13:84C2: BD 08 07  LDA ram_0708,X
C - - - - - 0x0184D5 13:84C5: 9D 07 07  STA ram_0707,X
C - - - - - 0x0184D8 13:84C8: 60        RTS



sub_84C9_E0_и_выше:
C - - - - - 0x0184D9 13:84C9: 29 1F     AND #$1F
C - - - - - 0x0184DB 13:84CB: 0A        ASL
C - - - - - 0x0184DC 13:84CC: AA        TAX
C - - - - - 0x0184DD 13:84CD: BD DA 84  LDA tbl_84DA,X
C - - - - - 0x0184E0 13:84D0: 85 F6     STA ram_00F6
C - - - - - 0x0184E2 13:84D2: BD DB 84  LDA tbl_84DA + 1,X
C - - - - - 0x0184E5 13:84D5: 85 F7     STA ram_00F7
C - - - - - 0x0184E7 13:84D7: 6C F6 00  JMP (ram_00F6)

tbl_84DA:
- D - - - - 0x0184EA 13:84DA: 44 85     .word ofs_013_8544_E0
- - - - - - 0x0184EC 13:84DC: 07 87     .word ofs_013_8707_E1___INY
- D - - - - 0x0184EE 13:84DE: 41 86     .word ofs_013_8641_E2
- D - - - - 0x0184F0 13:84E0: 5F 85     .word ofs_013_855F_E3_громкость
- D - - - - 0x0184F2 13:84E2: 17 86     .word ofs_013_8617_E4
- D - - - - 0x0184F4 13:84E4: 70 86     .word ofs_013_8670_E5
- - - - - - 0x0184F6 13:84E6: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x0184F8 13:84E8: 07 87     .word ofs_013_8707_E1___INY
- D - - - - 0x0184FA 13:84EA: 78 85     .word ofs_013_8578_E8_прыжок
- D - - - - 0x0184FC 13:84EC: 85 85     .word ofs_013_8585_E9_прочитать_отрезок
- D - - - - 0x0184FE 13:84EE: AF 85     .word ofs_013_85AF_EA
- D - - - - 0x018500 13:84F0: C6 85     .word ofs_013_85C6_EB
- D - - - - 0x018502 13:84F2: EF 85     .word ofs_013_85EF_EC
- D - - - - 0x018504 13:84F4: 81 86     .word ofs_013_8681_ED
- - - - - - 0x018506 13:84F6: 07 87     .word ofs_013_8707_E1___INY
- D - - - - 0x018508 13:84F8: 90 86     .word ofs_013_8690_EF
- - - - - - 0x01850A 13:84FA: 09 87     .word ofs_013_8707_F0___INYx3
- - - - - - 0x01850C 13:84FC: 07 87     .word ofs_013_8707_E1___INY
- D - - - - 0x01850E 13:84FE: 1A 85     .word ofs_013_851A_F2_очистить_адреса_с_номерами_звуков
- D - - - - 0x018510 13:8500: 3B 85     .word ofs_013_853B_F3
- D - - - - 0x018512 13:8502: 32 85     .word ofs_013_8532_F4
- - - - - - 0x018514 13:8504: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x018516 13:8506: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x018518 13:8508: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x01851A 13:850A: 07 87     .word ofs_013_8707_E1___INY
- D - - - - 0x01851C 13:850C: 99 86     .word ofs_013_8699_F9
- D - - - - 0x01851E 13:850E: B8 86     .word ofs_013_86B8_FA
- D - - - - 0x018520 13:8510: D7 86     .word ofs_013_86D7_FB
- - - - - - 0x018522 13:8512: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x018524 13:8514: 07 87     .word ofs_013_8707_E1___INY
- - - - - - 0x018526 13:8516: F6 86     .word ofs_013_86F6_FE
- D - - - - 0x018528 13:8518: 55 86     .word ofs_013_8655_FF_выход

ofs_013_851A_F2_очистить_адреса_с_номерами_звуков:
; bzk адрес 07F2 нигде не используется
C - J - - - 0x01852A 13:851A: A9 00     LDA #$00
C - - - - - 0x01852C 13:851C: 8D F2 07  STA ram_07F2
C - - - - - 0x01852F 13:851F: 8D 00 07  STA ram_звук
C - - - - - 0x018532 13:8522: 8D 01 07  STA ram_звук + 1
C - - - - - 0x018535 13:8525: 8D 02 07  STA ram_звук + 2
C - - - - - 0x018538 13:8528: 8D 03 07  STA ram_звук + 3
C - - - - - 0x01853B 13:852B: 8D 04 07  STA ram_звук + 4
C - - - - - 0x01853E 13:852E: 8D 05 07  STA ram_звук + 5
C - - - - - 0x018541 13:8531: 60        RTS

ofs_013_8532_F4:
C - J - - - 0x018542 13:8532: A6 F3     LDX ram_00F3
C - - - - - 0x018544 13:8534: CA        DEX
C - - - - - 0x018545 13:8535: A9 00     LDA #$00
C - - - - - 0x018547 13:8537: 9D EA 07  STA ram_07EA,X
C - - - - - 0x01854A 13:853A: 60        RTS

ofs_013_853B_F3:
C - J - - - 0x01854B 13:853B: A6 F3     LDX ram_00F3
C - - - - - 0x01854D 13:853D: CA        DEX
C - - - - - 0x01854E 13:853E: A9 0F     LDA #$0F
C - - - - - 0x018550 13:8540: 9D EA 07  STA ram_07EA,X
C - - - - - 0x018553 13:8543: 60        RTS

ofs_013_8544_E0:
C - J - - - 0x018554 13:8544: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018556 13:8546: C8        INY
C - - - - - 0x018557 13:8547: 84 F6     STY ram_00F6
C - - - - - 0x018559 13:8549: 0A        ASL
C - - - - - 0x01855A 13:854A: AA        TAX
C - - - - - 0x01855B 13:854B: BD 54 87  LDA tbl_8754,X
C - - - - - 0x01855E 13:854E: A8        TAY
C - - - - - 0x01855F 13:854F: BD 55 87  LDA tbl_8754 + 1,X
C - - - - - 0x018562 13:8552: AA        TAX
C - - - - - 0x018563 13:8553: 98        TYA
C - - - - - 0x018564 13:8554: A0 02     LDY #$02
C - - - - - 0x018566 13:8556: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018568 13:8558: C8        INY
C - - - - - 0x018569 13:8559: 8A        TXA
C - - - - - 0x01856A 13:855A: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01856C 13:855C: A4 F6     LDY ram_00F6
C - - - - - 0x01856E 13:855E: 60        RTS

ofs_013_855F_E3_громкость:
C - J - - - 0x01856F 13:855F: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018571 13:8561: C8        INY
C - - - - - 0x018572 13:8562: 84 F6     STY ram_00F6
C - - - - - 0x018574 13:8564: AC DF 07  LDY ram_07DF
C - - - - - 0x018577 13:8567: D0 0C     BNE bra_8575
C - - - - - 0x018579 13:8569: 85 F7     STA ram_00F7
C - - - - - 0x01857B 13:856B: A9 F0     LDA #$F0
C - - - - - 0x01857D 13:856D: A0 05     LDY #$05
C - - - - - 0x01857F 13:856F: 31 F0     AND (ram_00F0),Y
C - - - - - 0x018581 13:8571: 05 F7     ORA ram_00F7
C - - - - - 0x018583 13:8573: 91 F0     STA (ram_00F0),Y
bra_8575:
C - - - - - 0x018585 13:8575: A4 F6     LDY ram_00F6
C - - - - - 0x018587 13:8577: 60        RTS

ofs_013_8578_E8_прыжок:
; используется для циклов, когда нужно бесконечно повторять какой-то участок для музыки
C - J - - - 0x018588 13:8578: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x01858A 13:857A: C8        INY
C - - - - - 0x01858B 13:857B: AA        TAX
C - - - - - 0x01858C 13:857C: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x01858E 13:857E: 86 F4     STX ram_00F4
C - - - - - 0x018590 13:8580: 85 F5     STA ram_00F5
C - - - - - 0x018592 13:8582: A0 00     LDY #$00
C - - - - - 0x018594 13:8584: 60        RTS

ofs_013_8585_E9_прочитать_отрезок:
C - J - - - 0x018595 13:8585: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018597 13:8587: C8        INY
C - - - - - 0x018598 13:8588: AA        TAX
C - - - - - 0x018599 13:8589: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x01859B 13:858B: C8        INY
C - - - - - 0x01859C 13:858C: 48        PHA
C - - - - - 0x01859D 13:858D: 98        TYA
C - - - - - 0x01859E 13:858E: 48        PHA
C - - - - - 0x01859F 13:858F: A0 09     LDY #$09
C - - - - - 0x0185A1 13:8591: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0185A3 13:8593: A8        TAY
C - - - - - 0x0185A4 13:8594: 68        PLA
C - - - - - 0x0185A5 13:8595: 18        CLC
C - - - - - 0x0185A6 13:8596: 65 F4     ADC ram_00F4
C - - - - - 0x0185A8 13:8598: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185AA 13:859A: 88        DEY
C - - - - - 0x0185AB 13:859B: A9 00     LDA #$00
C - - - - - 0x0185AD 13:859D: 65 F5     ADC ram_00F5
C - - - - - 0x0185AF 13:859F: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185B1 13:85A1: 88        DEY
C - - - - - 0x0185B2 13:85A2: 98        TYA
C - - - - - 0x0185B3 13:85A3: A0 09     LDY #$09
C - - - - - 0x0185B5 13:85A5: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185B7 13:85A7: 86 F4     STX ram_00F4
C - - - - - 0x0185B9 13:85A9: 68        PLA
C - - - - - 0x0185BA 13:85AA: 85 F5     STA ram_00F5
C - - - - - 0x0185BC 13:85AC: A0 00     LDY #$00
C - - - - - 0x0185BE 13:85AE: 60        RTS

ofs_013_85AF_EA:
C - J - - - 0x0185BF 13:85AF: A0 09     LDY #$09
C - - - - - 0x0185C1 13:85B1: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0185C3 13:85B3: A8        TAY
C - - - - - 0x0185C4 13:85B4: C8        INY
C - - - - - 0x0185C5 13:85B5: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0185C7 13:85B7: C8        INY
C - - - - - 0x0185C8 13:85B8: 85 F5     STA ram_00F5
C - - - - - 0x0185CA 13:85BA: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0185CC 13:85BC: 85 F4     STA ram_00F4
C - - - - - 0x0185CE 13:85BE: 98        TYA
C - - - - - 0x0185CF 13:85BF: A0 09     LDY #$09
C - - - - - 0x0185D1 13:85C1: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185D3 13:85C3: A0 00     LDY #$00
C - - - - - 0x0185D5 13:85C5: 60        RTS

ofs_013_85C6_EB:
C - J - - - 0x0185D6 13:85C6: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x0185D8 13:85C8: C8        INY
C - - - - - 0x0185D9 13:85C9: AA        TAX
C - - - - - 0x0185DA 13:85CA: 98        TYA
C - - - - - 0x0185DB 13:85CB: 48        PHA
C - - - - - 0x0185DC 13:85CC: A0 09     LDY #$09
C - - - - - 0x0185DE 13:85CE: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x0185E0 13:85D0: A8        TAY
C - - - - - 0x0185E1 13:85D1: 68        PLA
C - - - - - 0x0185E2 13:85D2: 18        CLC
C - - - - - 0x0185E3 13:85D3: 65 F4     ADC ram_00F4
C - - - - - 0x0185E5 13:85D5: 85 F4     STA ram_00F4
C - - - - - 0x0185E7 13:85D7: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185E9 13:85D9: 88        DEY
C - - - - - 0x0185EA 13:85DA: A9 00     LDA #$00
C - - - - - 0x0185EC 13:85DC: 65 F5     ADC ram_00F5
C - - - - - 0x0185EE 13:85DE: 85 F5     STA ram_00F5
C - - - - - 0x0185F0 13:85E0: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185F2 13:85E2: 88        DEY
C - - - - - 0x0185F3 13:85E3: 8A        TXA
C - - - - - 0x0185F4 13:85E4: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185F6 13:85E6: 88        DEY
C - - - - - 0x0185F7 13:85E7: 98        TYA
C - - - - - 0x0185F8 13:85E8: A0 09     LDY #$09
C - - - - - 0x0185FA 13:85EA: 91 F0     STA (ram_00F0),Y
C - - - - - 0x0185FC 13:85EC: A0 00     LDY #$00
C - - - - - 0x0185FE 13:85EE: 60        RTS

ofs_013_85EF_EC:
C - J - - - 0x0185FF 13:85EF: 84 F6     STY ram_00F6
C - - - - - 0x018601 13:85F1: A0 09     LDY #$09
C - - - - - 0x018603 13:85F3: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018605 13:85F5: A8        TAY
C - - - - - 0x018606 13:85F6: C8        INY
C - - - - - 0x018607 13:85F7: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018609 13:85F9: 38        SEC
C - - - - - 0x01860A 13:85FA: E9 01     SBC #$01
C - - - - - 0x01860C 13:85FC: 91 F0     STA (ram_00F0),Y
C - - - - - 0x01860E 13:85FE: F0 0D     BEQ bra_860D
C - - - - - 0x018610 13:8600: C8        INY
C - - - - - 0x018611 13:8601: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018613 13:8603: C8        INY
C - - - - - 0x018614 13:8604: 85 F5     STA ram_00F5
C - - - - - 0x018616 13:8606: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x018618 13:8608: 85 F4     STA ram_00F4
C - - - - - 0x01861A 13:860A: A0 00     LDY #$00
C - - - - - 0x01861C 13:860C: 60        RTS
bra_860D:
C - - - - - 0x01861D 13:860D: C8        INY
C - - - - - 0x01861E 13:860E: C8        INY
C - - - - - 0x01861F 13:860F: 98        TYA
C - - - - - 0x018620 13:8610: A0 09     LDY #$09
C - - - - - 0x018622 13:8612: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018624 13:8614: A4 F6     LDY ram_00F6
C - - - - - 0x018626 13:8616: 60        RTS

ofs_013_8617_E4:
C - J - - - 0x018627 13:8617: 84 F6     STY ram_00F6
C - - - - - 0x018629 13:8619: A0 05     LDY #$05
C - - - - - 0x01862B 13:861B: B1 F0     LDA (ram_00F0),Y
C - - - - - 0x01862D 13:861D: 09 10     ORA #$10
C - - - - - 0x01862F 13:861F: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018631 13:8621: A6 F3     LDX ram_00F3
C - - - - - 0x018633 13:8623: CA        DEX
C - - - - - 0x018634 13:8624: 8A        TXA
C - - - - - 0x018635 13:8625: 49 07     EOR #$07
C - - - - - 0x018637 13:8627: 0A        ASL
C - - - - - 0x018638 13:8628: 0A        ASL
C - - - - - 0x018639 13:8629: 29 0F     AND #$0F
C - - - - - 0x01863B 13:862B: AA        TAX
C - - - - - 0x01863C 13:862C: A4 F6     LDY ram_00F6
C - - - - - 0x01863E 13:862E: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018640 13:8630: 9D 01 40  STA $4001,X
C - - - - - 0x018643 13:8633: C8        INY
C - - - - - 0x018644 13:8634: A6 F3     LDX ram_00F3
C - - - - - 0x018646 13:8636: CA        DEX
C - - - - - 0x018647 13:8637: 8A        TXA
C - - - - - 0x018648 13:8638: 29 03     AND #$03
C - - - - - 0x01864A 13:863A: AA        TAX
C - - - - - 0x01864B 13:863B: A9 00     LDA #$00
C - - - - - 0x01864D 13:863D: 9D E4 07  STA ram_07E4,X
C - - - - - 0x018650 13:8640: 60        RTS

ofs_013_8641_E2:
C - J - - - 0x018651 13:8641: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018653 13:8643: C8        INY
C - - - - - 0x018654 13:8644: 84 F6     STY ram_00F6
C - - - - - 0x018656 13:8646: 85 F7     STA ram_00F7
C - - - - - 0x018658 13:8648: A0 05     LDY #$05
C - - - - - 0x01865A 13:864A: A9 3F     LDA #$3F
C - - - - - 0x01865C 13:864C: 31 F0     AND (ram_00F0),Y
C - - - - - 0x01865E 13:864E: 05 F7     ORA ram_00F7
C - - - - - 0x018660 13:8650: 91 F0     STA (ram_00F0),Y
C - - - - - 0x018662 13:8652: A4 F6     LDY ram_00F6
C - - - - - 0x018664 13:8654: 60        RTS

ofs_013_8655_FF_выход:
C - J - - - 0x018665 13:8655: A9 7F     LDA #$7F
C - - - - - 0x018667 13:8657: 2D 06 07  AND ram_0706
C - - - - - 0x01866A 13:865A: 8D 06 07  STA ram_0706
C - - - - - 0x01866D 13:865D: A6 F3     LDX ram_00F3
C - - - - - 0x01866F 13:865F: CA        DEX
C - - - - - 0x018670 13:8660: 8A        TXA
C - - - - - 0x018671 13:8661: 49 07     EOR #$07
C - - - - - 0x018673 13:8663: 0A        ASL
C - - - - - 0x018674 13:8664: 0A        ASL
C - - - - - 0x018675 13:8665: 29 0F     AND #$0F
C - - - - - 0x018677 13:8667: AA        TAX
C - - - - - 0x018678 13:8668: A9 30     LDA #$30
C - - - - - 0x01867A 13:866A: 9D 00 40  STA $4000,X
C - - - - - 0x01867D 13:866D: 68        PLA
C - - - - - 0x01867E 13:866E: 68        PLA
C - - - - - 0x01867F 13:866F: 60        RTS

ofs_013_8670_E5:
C - J - - - 0x018680 13:8670: A6 F3     LDX ram_00F3
C - - - - - 0x018682 13:8672: CA        DEX
C - - - - - 0x018683 13:8673: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018685 13:8675: C8        INY
C - - - - - 0x018686 13:8676: 0A        ASL
C - - - - - 0x018687 13:8677: B0 03     BCS bra_867C
C - - - - - 0x018689 13:8679: 9D F4 07  STA ram_07F4,X
bra_867C:
C - - - - - 0x01868C 13:867C: 4A        LSR
C - - - - - 0x01868D 13:867D: 9D A7 07  STA ram_07A7,X
C - - - - - 0x018690 13:8680: 60        RTS

ofs_013_8681_ED:
C - J - - - 0x018691 13:8681: A6 F3     LDX ram_00F3
C - - - - - 0x018693 13:8683: CA        DEX
C - - - - - 0x018694 13:8684: B1 F4     LDA (ram_00F4),Y
C - - - - - 0x018696 13:8686: 9D AF 07  STA ram_07AF,X
C - - - - - 0x018699 13:8689: A9 00     LDA #$00
C - - - - - 0x01869B 13:868B: 9D C7 07  STA ram_07C7,X
C - - - - - 0x01869E 13:868E: C8        INY
C - - - - - 0x01869F 13:868F: 60        RTS

ofs_013_8690_EF:
C - J - - - 0x0186A0 13:8690: A6 F3     LDX ram_00F3
C - - - - - 0x0186A2 13:8692: CA        DEX
C - - - - - 0x0186A3 13:8693: A9 00     LDA #$00
C - - - - - 0x0186A5 13:8695: 9D AF 07  STA ram_07AF,X
C - - - - - 0x0186A8 13:8698: 60        RTS

ofs_013_8699_F9:
; bzk если есть возможность использовать X или Y
; тогда сначала LDX 0F, потом проверка 07E8, если Z = 0 то прыгать на STA 4015
C - J - - - 0x0186A9 13:8699: A9 0F     LDA #$0F
; отключить DMC канал
C - - - - - 0x0186AB 13:869B: 8D 15 40  STA $4015
C - - - - - 0x0186AE 13:869E: AD E8 07  LDA ram_07E8
C - - - - - 0x0186B1 13:86A1: D0 14     BNE bra_86B7_RTS
C - - - - - 0x0186B3 13:86A3: A9 0F     LDA #$0F
C - - - - - 0x0186B5 13:86A5: 8D 10 40  STA $4010
C - - - - - 0x0186B8 13:86A8: A9 00     LDA #$80
C - - - - - 0x0186BA 13:86AA: 8D 12 40  STA $4012
C - - - - - 0x0186BD 13:86AD: A9 0C     LDA #$0C
C - - - - - 0x0186BF 13:86AF: 8D 13 40  STA $4013
; включить DMC канал
C - - - - - 0x0186C2 13:86B2: A9 1F     LDA #$1F
C - - - - - 0x0186C4 13:86B4: 8D 15 40  STA $4015
bra_86B7_RTS:
C - - - - - 0x0186C7 13:86B7: 60        RTS

ofs_013_86B8_FA:
C - J - - - 0x0186C8 13:86B8: A9 0F     LDA #$0F
C - - - - - 0x0186CA 13:86BA: 8D 15 40  STA $4015
C - - - - - 0x0186CD 13:86BD: AD E8 07  LDA ram_07E8
C - - - - - 0x0186D0 13:86C0: D0 14     BNE bra_86D6_RTS
C - - - - - 0x0186D2 13:86C2: A9 0F     LDA #$0F
C - - - - - 0x0186D4 13:86C4: 8D 10 40  STA $4010
C - - - - - 0x0186D7 13:86C7: A9 03     LDA #$83
C - - - - - 0x0186D9 13:86C9: 8D 12 40  STA $4012
C - - - - - 0x0186DC 13:86CC: A9 20     LDA #$20
C - - - - - 0x0186DE 13:86CE: 8D 13 40  STA $4013
C - - - - - 0x0186E1 13:86D1: A9 1F     LDA #$1F
C - - - - - 0x0186E3 13:86D3: 8D 15 40  STA $4015
bra_86D6_RTS:
C - - - - - 0x0186E6 13:86D6: 60        RTS

ofs_013_86D7_FB:
C - J - - - 0x0186E7 13:86D7: A9 0F     LDA #$0F
C - - - - - 0x0186E9 13:86D9: 8D 15 40  STA $4015
C - - - - - 0x0186EC 13:86DC: AD E8 07  LDA ram_07E8
C - - - - - 0x0186EF 13:86DF: D0 14     BNE bra_86F5_RTS
C - - - - - 0x0186F1 13:86E1: A9 0F     LDA #$0F
C - - - - - 0x0186F3 13:86E3: 8D 10 40  STA $4010
C - - - - - 0x0186F6 13:86E6: A9 0B     LDA #$8B
C - - - - - 0x0186F8 13:86E8: 8D 12 40  STA $4012
C - - - - - 0x0186FB 13:86EB: A9 13     LDA #$13
C - - - - - 0x0186FD 13:86ED: 8D 13 40  STA $4013
C - - - - - 0x018700 13:86F0: A9 1F     LDA #$1F
C - - - - - 0x018702 13:86F2: 8D 15 40  STA $4015
bra_86F5_RTS:
C - - - - - 0x018705 13:86F5: 60        RTS

ofs_013_86F6_FE:
- - - - - - 0x018706 13:86F6: B1 F4     LDA (ram_00F4),Y
- - - - - - 0x018708 13:86F8: C8        INY
- - - - - - 0x018709 13:86F9: 84 F6     STY ram_00F6
- - - - - - 0x01870B 13:86FB: A6 F3     LDX ram_00F3
- - - - - - 0x01870D 13:86FD: CA        DEX
- - - - - - 0x01870E 13:86FE: 9D CF 07  STA ram_07CF,X
- - - - - - 0x018711 13:8701: 9D D7 07  STA ram_07D7,X
- - - - - - 0x018714 13:8704: A4 F6     LDY ram_00F6
- - - - - - 0x018716 13:8706: 60        RTS

ofs_013_8707_F0___INYx3:
- - - - - - 0x018719 13:8709: C8        INY
- - - - - - 0x01871A 13:870A: C8        INY
ofs_013_8707_E1___INY:  ; предположительно не используется
- - - - - - 0x01871B 13:870B: C8        INY
- - - - - - 0x01871C 13:870C: 60        RTS

tbl_870D:
- D - - - - 0x01871D 13:870D: AE 06     .word $06AE
- D - - - - 0x01871F 13:870F: 4E 06     .word $064E
- D - - - - 0x018721 13:8711: F3 05     .word $05F3
- D - - - - 0x018723 13:8713: 9E 05     .word $059E
- D - - - - 0x018725 13:8715: 4D 05     .word $054D
- D - - - - 0x018727 13:8717: 01 05     .word $0501
- D - - - - 0x018729 13:8719: B9 04     .word $04B9
- D - - - - 0x01872B 13:871B: 75 04     .word $0475
- D - - - - 0x01872D 13:871D: 35 04     .word $0435
- D - - - - 0x01872F 13:871F: F8 03     .word $03F8
- D - - - - 0x018731 13:8721: BF 03     .word $03BF
- D - - - - 0x018733 13:8723: 89 03     .word $0389

tbl_8725:
- D - - - - 0x018735 13:8725: 00        .byte $00
- D - - - - 0x018736 13:8726: 01        .byte $01    ; <あ>
- D - - - - 0x018737 13:8727: 02        .byte $02    ; <い>
- D - - - - 0x018738 13:8728: 03        .byte $03    ; <う>
- D - - - - 0x018739 13:8729: 04        .byte $04    ; <え>
- D - - - - 0x01873A 13:872A: 05        .byte $05    ; <お>
- D - - - - 0x01873B 13:872B: 06        .byte $06    ; <か>
- D - - - - 0x01873C 13:872C: 07        .byte $07    ; <き>
- D - - - - 0x01873D 13:872D: 08        .byte $08    ; <く>
- D - - - - 0x01873E 13:872E: 09        .byte $09    ; <け>
- D - - - - 0x01873F 13:872F: 0A        .byte $0A    ; <こ>
- D - - - - 0x018740 13:8730: 0C        .byte $0C    ; <し>
- D - - - - 0x018741 13:8731: 0E        .byte $0E    ; <せ>
- D - - - - 0x018742 13:8732: 0F        .byte $0F    ; <そ>
- D - - - - 0x018743 13:8733: 10        .byte $10    ; <た>
- D - - - - 0x018744 13:8734: 12        .byte $12    ; <つ>
- D - - - - 0x018745 13:8735: 14        .byte $14    ; <と>
- D - - - - 0x018746 13:8736: 15        .byte $15    ; <な>
- D - - - - 0x018747 13:8737: 18        .byte $18    ; <ね>
- D - - - - 0x018748 13:8738: 1B        .byte $1B    ; <ひ>
- D - - - - 0x018749 13:8739: 1C        .byte $1C    ; <ふ>
- D - - - - 0x01874A 13:873A: 1E        .byte $1E    ; <ほ>
- D - - - - 0x01874B 13:873B: 20        .byte $20    ; <み>
- D - - - - 0x01874C 13:873C: 24        .byte $24    ; <や>
- D - - - - 0x01874D 13:873D: 28        .byte $28    ; <り>
- D - - - - 0x01874E 13:873E: 2A        .byte $2A    ; <れ>
- D - - - - 0x01874F 13:873F: 30        .byte $30    ; <ゃ>
- D - - - - 0x018750 13:8740: 36        .byte $36    ; <3>
- D - - - - 0x018751 13:8741: 38        .byte $38    ; <5>
- D - - - - 0x018752 13:8742: 3C        .byte $3C    ; <9>
- D - - - - 0x018753 13:8743: 40        .byte $40    ; <「>
- D - - - - 0x018754 13:8744: 48        .byte $48    ; <ク>
- D - - - - 0x018755 13:8745: 50        .byte $50    ; <タ>
- D - - - - 0x018756 13:8746: 54        .byte $54    ; <ト>
- D - - - - 0x018757 13:8747: 60        .byte $60    ; <ミ>
- D - - - - 0x018758 13:8748: 6C        .byte $6C    ; <ワ>
- D - - - - 0x018759 13:8749: 70        .byte $70    ; <ャ>
- D - - - - 0x01875A 13:874A: 80        .byte $80
- D - - - - 0x01875B 13:874B: 90        .byte $90    ; <U>
- - - - - - 0x01875C 13:874C: A0        .byte $A0    ; <が>
- - - - - - 0x01875D 13:874D: C0        .byte $C0    ; <ヅ>
- - - - - - 0x01875E 13:874E: E0        .byte $E0
- - - - - - 0x01875F 13:874F: 0B        .byte $0B    ; <さ>
- - - - - - 0x018760 13:8750: 85        .byte $85    ; <E>
- - - - - - 0x018761 13:8751: A8        .byte $A8    ; <ぜ>
- D - - - - 0x018762 13:8752: FF        .byte $FF
- D - - - - 0x018763 13:8753: F0        .byte $F0



tbl_8754:
- D - - - - 0x018764 13:8754: 52 89     .word off_8952_00
- D - - - - 0x018766 13:8756: 5C 89     .word off_895C_01
- D - - - - 0x018768 13:8758: 6A 89     .word off_896A_02
- D - - - - 0x01876A 13:875A: 78 89     .word off_8978_03
- D - - - - 0x01876C 13:875C: 88 89     .word off_8988_04
- D - - - - 0x01876E 13:875E: A0 89     .word off_89A0_05
- - - - - - 0x018770 13:8760: B8 89     .word off_89B8_06
- D - - - - 0x018772 13:8762: C0 89     .word off_89C0_07
- D - - - - 0x018774 13:8764: C8 89     .word off_89C8_08
- D - - - - 0x018776 13:8766: D0 89     .word off_89D0_09
- - - - - - 0x018778 13:8768: DA 89     .word off_89DA_0A
- D - - - - 0x01877A 13:876A: E6 89     .word off_89E6_0B
- D - - - - 0x01877C 13:876C: F4 89     .word off_89F4_0C
- D - - - - 0x01877E 13:876E: 08 8A     .word off_8A08_0D
- D - - - - 0x018780 13:8770: 20 8A     .word off_8A20_0E
- D - - - - 0x018782 13:8772: 28 8A     .word off_8A28_0F
- D - - - - 0x018784 13:8774: 30 8A     .word off_8A30_10
- D - - - - 0x018786 13:8776: 8C 8A     .word off_8A8C_11
- D - - - - 0x018788 13:8778: AC 8A     .word off_8AAC_12
- D - - - - 0x01878A 13:877A: CC 8A     .word off_8ACC_13
- D - - - - 0x01878C 13:877C: EC 8A     .word off_8AEC_14
- D - - - - 0x01878E 13:877E: 0C 8B     .word off_8B0C_15
- D - - - - 0x018790 13:8780: 1E 8B     .word off_8B1E_16
- D - - - - 0x018792 13:8782: 30 8B     .word off_8B30_17
- D - - - - 0x018794 13:8784: B6 8B     .word off_8BB6_18
- D - - - - 0x018796 13:8786: BA 8B     .word off_8BBA_19
- D - - - - 0x018798 13:8788: BE 8B     .word off_8BBE_1A
- D - - - - 0x01879A 13:878A: C2 8B     .word off_8BC2_1B
- D - - - - 0x01879C 13:878C: C6 8B     .word off_8BC6_1C
- D - - - - 0x01879E 13:878E: CA 8B     .word off_8BCA_1D
- D - - - - 0x0187A0 13:8790: CE 8B     .word off_8BCE_1E
- D - - - - 0x0187A2 13:8792: D2 8B     .word off_8BD2_1F
- D - - - - 0x0187A4 13:8794: D6 8B     .word off_8BD6_20
- D - - - - 0x0187A6 13:8796: 34 8B     .word off_8B34_21
- D - - - - 0x0187A8 13:8798: 92 88     .word off_8892_22
- D - - - - 0x0187AA 13:879A: 9C 88     .word off_889C_23
- D - - - - 0x0187AC 13:879C: A8 88     .word off_88A8_24
- D - - - - 0x0187AE 13:879E: B4 88     .word off_88B4_25
- D - - - - 0x0187B0 13:87A0: C4 88     .word off_88C4_26
- D - - - - 0x0187B2 13:87A2: DC 88     .word off_88DC_27
- D - - - - 0x0187B4 13:87A4: 42 89     .word off_8942_28
- D - - - - 0x0187B6 13:87A6: 4A 89     .word off_894A_29
- D - - - - 0x0187B8 13:87A8: 32 8A     .word off_8A32_2A
- D - - - - 0x0187BA 13:87AA: 5A 88     .word off_885A_2B
- D - - - - 0x0187BC 13:87AC: 9E 88     .word off_889E_2C
- D - - - - 0x0187BE 13:87AE: 70 88     .word off_8870_2D
- D - - - - 0x0187C0 13:87B0: 2E 88     .word off_882E_2E
- D - - - - 0x0187C2 13:87B2: 4E 88     .word off_884E_2F
- D - - - - 0x0187C4 13:87B4: 76 8B     .word off_8B76_30
- D - - - - 0x0187C6 13:87B6: E2 87     .word off_87E2_31
- D - - - - 0x0187C8 13:87B8: FC 87     .word off_87FC_32
- D - - - - 0x0187CA 13:87BA: F2 87     .word off_87F2_33
- D - - - - 0x0187CC 13:87BC: 1C 88     .word off_881C_34
- D - - - - 0x0187CE 13:87BE: D2 87     .word off_87D2_35
; для мелодии 50 (18 на муз экране)
- D - - - - 0x0187D0 13:87C0: 93 BA     .word off_0x01DAA3_36
- D - - - - 0x0187D2 13:87C2: 9F BA     .word off_0x01DAAF_37
- D - - - - 0x0187D4 13:87C4: AD BA     .word off_0x01DABD_38
- D - - - - 0x0187D6 13:87C6: BB BA     .word off_0x01DACB_39
- D - - - - 0x0187D8 13:87C8: C9 BA     .word off_0x01DAD9_3A
- D - - - - 0x0187DA 13:87CA: D7 BA     .word off_0x01DAE7_3B
- - - - - - 0x0187DC 13:87CC: E5 BA     .word off_0x01DAF5_3C
- D - - - - 0x0187DE 13:87CE: F3 BA     .word off_0x01DB03_3D
; для мелодии 53 (04 на муз экране)
- D - - - - 0x0187E0 13:87D0: D2 A5     .word off_0x01E5E2_3E

off_87D2_35:
- D - I - - 0x0187E2 13:87D2: 01        .byte $01    ; <あ>
- D - I - - 0x0187E3 13:87D3: 0C        .byte $0C    ; <し>
- D - I - - 0x0187E4 13:87D4: 03        .byte $03    ; <う>
- D - I - - 0x0187E5 13:87D5: 0F        .byte $0F    ; <そ>
- D - I - - 0x0187E6 13:87D6: 01        .byte $01    ; <あ>
- D - I - - 0x0187E7 13:87D7: 0D        .byte $0D    ; <す>
- D - I - - 0x0187E8 13:87D8: 01        .byte $01    ; <あ>
- D - I - - 0x0187E9 13:87D9: 0B        .byte $0B    ; <さ>
- D - I - - 0x0187EA 13:87DA: 02        .byte $02    ; <い>
- D - I - - 0x0187EB 13:87DB: 09        .byte $09    ; <け>
- D - I - - 0x0187EC 13:87DC: 03        .byte $03    ; <う>
- D - I - - 0x0187ED 13:87DD: 0C        .byte $0C    ; <し>
- D - I - - 0x0187EE 13:87DE: 01        .byte $01    ; <あ>
- D - I - - 0x0187EF 13:87DF: 0B        .byte $0B    ; <さ>
- D - I - - 0x0187F0 13:87E0: FF        .byte $FF
- D - I - - 0x0187F1 13:87E1: 0A        .byte $0A    ; <こ>

off_87E2_31:
- D - I - - 0x0187F2 13:87E2: 01        .byte $01    ; <あ>
- D - I - - 0x0187F3 13:87E3: 0D        .byte $0D    ; <す>
- D - I - - 0x0187F4 13:87E4: 01        .byte $01    ; <あ>
- D - I - - 0x0187F5 13:87E5: 0F        .byte $0F    ; <そ>
- D - I - - 0x0187F6 13:87E6: 01        .byte $01    ; <あ>
- D - I - - 0x0187F7 13:87E7: 09        .byte $09    ; <け>
- D - I - - 0x0187F8 13:87E8: 01        .byte $01    ; <あ>
- D - I - - 0x0187F9 13:87E9: 0A        .byte $0A    ; <こ>
- D - I - - 0x0187FA 13:87EA: 0C        .byte $0C    ; <し>
- D - I - - 0x0187FB 13:87EB: 0C        .byte $0C    ; <し>
- D - I - - 0x0187FC 13:87EC: 0D        .byte $0D    ; <す>
- D - I - - 0x0187FD 13:87ED: 0B        .byte $0B    ; <さ>
- D - I - - 0x0187FE 13:87EE: 0E        .byte $0E    ; <せ>
- D - I - - 0x0187FF 13:87EF: 0A        .byte $0A    ; <こ>
- D - I - - 0x018800 13:87F0: FF        .byte $FF
- D - I - - 0x018801 13:87F1: 09        .byte $09    ; <け>

off_87F2_33:
- D - I - - 0x018802 13:87F2: 01        .byte $01    ; <あ>
- D - I - - 0x018803 13:87F3: 09        .byte $09    ; <け>
- D - I - - 0x018804 13:87F4: 01        .byte $01    ; <あ>
- D - I - - 0x018805 13:87F5: 0F        .byte $0F    ; <そ>
- D - I - - 0x018806 13:87F6: 1A        .byte $1A    ; <は>
- D - I - - 0x018807 13:87F7: 0B        .byte $0B    ; <さ>
- D - I - - 0x018808 13:87F8: 1B        .byte $1B    ; <ひ>
- D - I - - 0x018809 13:87F9: 0A        .byte $0A    ; <こ>
- D - I - - 0x01880A 13:87FA: FF        .byte $FF
- D - I - - 0x01880B 13:87FB: 09        .byte $09    ; <け>

off_87FC_32:
- D - I - - 0x01880C 13:87FC: 02        .byte $02    ; <い>
- D - I - - 0x01880D 13:87FD: 0F        .byte $0F    ; <そ>
- D - I - - 0x01880E 13:87FE: 02        .byte $02    ; <い>
- D - I - - 0x01880F 13:87FF: 0E        .byte $0E    ; <せ>
- D - I - - 0x018810 13:8800: 02        .byte $02    ; <い>
- D - I - - 0x018811 13:8801: 0D        .byte $0D    ; <す>
- D - I - - 0x018812 13:8802: 02        .byte $02    ; <い>
- D - I - - 0x018813 13:8803: 0C        .byte $0C    ; <し>
- D - I - - 0x018814 13:8804: 01        .byte $01    ; <あ>
- D - I - - 0x018815 13:8805: 0B        .byte $0B    ; <さ>
- D - I - - 0x018816 13:8806: 01        .byte $01    ; <あ>
- D - I - - 0x018817 13:8807: 0A        .byte $0A    ; <こ>
- D - I - - 0x018818 13:8808: 01        .byte $01    ; <あ>
- D - I - - 0x018819 13:8809: 09        .byte $09    ; <け>
- D - I - - 0x01881A 13:880A: 01        .byte $01    ; <あ>
- D - I - - 0x01881B 13:880B: 08        .byte $08    ; <く>
- D - I - - 0x01881C 13:880C: 01        .byte $01    ; <あ>
- D - I - - 0x01881D 13:880D: 07        .byte $07    ; <き>
- D - I - - 0x01881E 13:880E: 01        .byte $01    ; <あ>
- D - I - - 0x01881F 13:880F: 06        .byte $06    ; <か>
- D - I - - 0x018820 13:8810: 01        .byte $01    ; <あ>
- D - I - - 0x018821 13:8811: 05        .byte $05    ; <お>
- D - I - - 0x018822 13:8812: 01        .byte $01    ; <あ>
- D - I - - 0x018823 13:8813: 04        .byte $04    ; <え>
- D - I - - 0x018824 13:8814: 01        .byte $01    ; <あ>
- D - I - - 0x018825 13:8815: 03        .byte $03    ; <う>
- D - I - - 0x018826 13:8816: 01        .byte $01    ; <あ>
- D - I - - 0x018827 13:8817: 02        .byte $02    ; <い>
- D - I - - 0x018828 13:8818: 01        .byte $01    ; <あ>
- D - I - - 0x018829 13:8819: 01        .byte $01    ; <あ>
- D - I - - 0x01882A 13:881A: FF        .byte $FF
- D - I - - 0x01882B 13:881B: 00        .byte $00

off_881C_34:
- D - I - - 0x01882C 13:881C: 03        .byte $03    ; <う>
- D - I - - 0x01882D 13:881D: 0F        .byte $0F    ; <そ>
- D - I - - 0x01882E 13:881E: 01        .byte $01    ; <あ>
- D - I - - 0x01882F 13:881F: 0C        .byte $0C    ; <し>
- D - I - - 0x018830 13:8820: 01        .byte $01    ; <あ>
- D - I - - 0x018831 13:8821: 09        .byte $09    ; <け>
- D - I - - 0x018832 13:8822: 01        .byte $01    ; <あ>
- D - I - - 0x018833 13:8823: 04        .byte $04    ; <え>
- D - I - - 0x018834 13:8824: 01        .byte $01    ; <あ>
- D - I - - 0x018835 13:8825: 0C        .byte $0C    ; <し>
- D - I - - 0x018836 13:8826: 01        .byte $01    ; <あ>
- D - I - - 0x018837 13:8827: 0B        .byte $0B    ; <さ>
- D - I - - 0x018838 13:8828: 01        .byte $01    ; <あ>
- D - I - - 0x018839 13:8829: 0A        .byte $0A    ; <こ>
- D - I - - 0x01883A 13:882A: 01        .byte $01    ; <あ>
- D - I - - 0x01883B 13:882B: 09        .byte $09    ; <け>
- D - I - - 0x01883C 13:882C: FF        .byte $FF
- D - I - - 0x01883D 13:882D: 08        .byte $08    ; <く>

off_882E_2E:
- D - I - - 0x01883E 13:882E: 09        .byte $09    ; <け>
- D - I - - 0x01883F 13:882F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018840 13:8830: 09        .byte $09    ; <け>
- D - I - - 0x018841 13:8831: 0E        .byte $0E    ; <せ>
- D - I - - 0x018842 13:8832: 09        .byte $09    ; <け>
- D - I - - 0x018843 13:8833: 0D        .byte $0D    ; <す>
- D - I - - 0x018844 13:8834: 09        .byte $09    ; <け>
- D - I - - 0x018845 13:8835: 0C        .byte $0C    ; <し>
- D - I - - 0x018846 13:8836: 09        .byte $09    ; <け>
- D - I - - 0x018847 13:8837: 0B        .byte $0B    ; <さ>
- D - I - - 0x018848 13:8838: 09        .byte $09    ; <け>
- D - I - - 0x018849 13:8839: 0A        .byte $0A    ; <こ>
- D - I - - 0x01884A 13:883A: 09        .byte $09    ; <け>
- D - I - - 0x01884B 13:883B: 09        .byte $09    ; <け>
- D - I - - 0x01884C 13:883C: 09        .byte $09    ; <け>
- D - I - - 0x01884D 13:883D: 08        .byte $08    ; <く>
- D - I - - 0x01884E 13:883E: 09        .byte $09    ; <け>
- D - I - - 0x01884F 13:883F: 07        .byte $07    ; <き>
- D - I - - 0x018850 13:8840: 09        .byte $09    ; <け>
- D - I - - 0x018851 13:8841: 06        .byte $06    ; <か>
- D - I - - 0x018852 13:8842: 09        .byte $09    ; <け>
- D - I - - 0x018853 13:8843: 05        .byte $05    ; <お>
- D - I - - 0x018854 13:8844: 09        .byte $09    ; <け>
- D - I - - 0x018855 13:8845: 04        .byte $04    ; <え>
- D - I - - 0x018856 13:8846: 09        .byte $09    ; <け>
- D - I - - 0x018857 13:8847: 03        .byte $03    ; <う>
- D - I - - 0x018858 13:8848: 09        .byte $09    ; <け>
- D - I - - 0x018859 13:8849: 02        .byte $02    ; <い>
- D - I - - 0x01885A 13:884A: 09        .byte $09    ; <け>
- D - I - - 0x01885B 13:884B: 01        .byte $01    ; <あ>
- D - I - - 0x01885C 13:884C: FF        .byte $FF
- D - I - - 0x01885D 13:884D: 00        .byte $00

off_884E_2F:
- D - I - - 0x01885E 13:884E: 02        .byte $02    ; <い>
- D - I - - 0x01885F 13:884F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018860 13:8850: 02        .byte $02    ; <い>
- D - I - - 0x018861 13:8851: 08        .byte $08    ; <く>
- D - I - - 0x018862 13:8852: 02        .byte $02    ; <い>
- D - I - - 0x018863 13:8853: 0F        .byte $0F    ; <そ>
- - - - - - 0x018864 13:8854: 02        .byte $02    ; <い>
- - - - - - 0x018865 13:8855: 08        .byte $08    ; <く>
- - - - - - 0x018866 13:8856: 02        .byte $02    ; <い>
- - - - - - 0x018867 13:8857: 0F        .byte $0F    ; <そ>
- - - - - - 0x018868 13:8858: FF        .byte $FF
- - - - - - 0x018869 13:8859: 00        .byte $00

off_885A_2B:
- D - I - - 0x01886A 13:885A: 28        .byte $28    ; <り>
- D - I - - 0x01886B 13:885B: 0F        .byte $0F    ; <そ>
- D - I - - 0x01886C 13:885C: 0B        .byte $0B    ; <さ>
- D - I - - 0x01886D 13:885D: 0E        .byte $0E    ; <せ>
- D - I - - 0x01886E 13:885E: 0B        .byte $0B    ; <さ>
- D - I - - 0x01886F 13:885F: 0D        .byte $0D    ; <す>
- D - I - - 0x018870 13:8860: 0B        .byte $0B    ; <さ>
- D - I - - 0x018871 13:8861: 0C        .byte $0C    ; <し>
- D - I - - 0x018872 13:8862: 0B        .byte $0B    ; <さ>
- D - I - - 0x018873 13:8863: 0B        .byte $0B    ; <さ>
- - - - - - 0x018874 13:8864: 0B        .byte $0B    ; <さ>
- - - - - - 0x018875 13:8865: 0A        .byte $0A    ; <こ>
- - - - - - 0x018876 13:8866: 1F        .byte $1F    ; <ま>
- - - - - - 0x018877 13:8867: 09        .byte $09    ; <け>
- - - - - - 0x018878 13:8868: 21        .byte $21    ; <む>
- - - - - - 0x018879 13:8869: 08        .byte $08    ; <く>
- - - - - - 0x01887A 13:886A: 23        .byte $23    ; <も>
- - - - - - 0x01887B 13:886B: 07        .byte $07    ; <き>
- - - - - - 0x01887C 13:886C: 25        .byte $25    ; <ゆ>
- - - - - - 0x01887D 13:886D: 06        .byte $06    ; <か>
- - - - - - 0x01887E 13:886E: 26        .byte $26    ; <よ>
- - - - - - 0x01887F 13:886F: 05        .byte $05    ; <お>

off_8870_2D:
- D - I - - 0x018880 13:8870: 02        .byte $02    ; <い>
- D - I - - 0x018881 13:8871: 09        .byte $09    ; <け>
- D - I - - 0x018882 13:8872: 02        .byte $02    ; <い>
- D - I - - 0x018883 13:8873: 0A        .byte $0A    ; <こ>
- D - I - - 0x018884 13:8874: 02        .byte $02    ; <い>
- D - I - - 0x018885 13:8875: 0B        .byte $0B    ; <さ>
- D - I - - 0x018886 13:8876: 02        .byte $02    ; <い>
- D - I - - 0x018887 13:8877: 0C        .byte $0C    ; <し>
- D - I - - 0x018888 13:8878: 01        .byte $01    ; <あ>
- D - I - - 0x018889 13:8879: 0D        .byte $0D    ; <す>
- D - I - - 0x01888A 13:887A: 01        .byte $01    ; <あ>
- D - I - - 0x01888B 13:887B: 0E        .byte $0E    ; <せ>
- D - I - - 0x01888C 13:887C: 09        .byte $09    ; <け>
- D - I - - 0x01888D 13:887D: 0F        .byte $0F    ; <そ>
- D - I - - 0x01888E 13:887E: 01        .byte $01    ; <あ>
- D - I - - 0x01888F 13:887F: 0E        .byte $0E    ; <せ>
- D - I - - 0x018890 13:8880: 01        .byte $01    ; <あ>
- D - I - - 0x018891 13:8881: 0F        .byte $0F    ; <そ>
- D - I - - 0x018892 13:8882: 01        .byte $01    ; <あ>
- D - I - - 0x018893 13:8883: 0E        .byte $0E    ; <せ>
- D - I - - 0x018894 13:8884: 01        .byte $01    ; <あ>
- D - I - - 0x018895 13:8885: 0F        .byte $0F    ; <そ>
- D - I - - 0x018896 13:8886: 01        .byte $01    ; <あ>
- D - I - - 0x018897 13:8887: 0E        .byte $0E    ; <せ>
- D - I - - 0x018898 13:8888: 01        .byte $01    ; <あ>
- D - I - - 0x018899 13:8889: 0F        .byte $0F    ; <そ>
- D - I - - 0x01889A 13:888A: 01        .byte $01    ; <あ>
- D - I - - 0x01889B 13:888B: 0E        .byte $0E    ; <せ>
- D - I - - 0x01889C 13:888C: 01        .byte $01    ; <あ>
- D - I - - 0x01889D 13:888D: 0F        .byte $0F    ; <そ>
- D - I - - 0x01889E 13:888E: 01        .byte $01    ; <あ>
- D - I - - 0x01889F 13:888F: 0A        .byte $0A    ; <こ>
- D - I - - 0x0188A0 13:8890: FF        .byte $FF
- D - I - - 0x0188A1 13:8891: 0C        .byte $0C    ; <し>

off_8892_22:
- D - I - - 0x0188A2 13:8892: 01        .byte $01    ; <あ>
- D - I - - 0x0188A3 13:8893: 0C        .byte $0C    ; <し>
- D - I - - 0x0188A4 13:8894: 02        .byte $02    ; <い>
- D - I - - 0x0188A5 13:8895: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188A6 13:8896: 01        .byte $01    ; <あ>
- D - I - - 0x0188A7 13:8897: 0C        .byte $0C    ; <し>
- D - I - - 0x0188A8 13:8898: 01        .byte $01    ; <あ>
- D - I - - 0x0188A9 13:8899: 09        .byte $09    ; <け>
- D - I - - 0x0188AA 13:889A: FF        .byte $FF
- D - I - - 0x0188AB 13:889B: 0C        .byte $0C    ; <し>

off_889C_23:
- D - I - - 0x0188AC 13:889C: 01        .byte $01    ; <あ>
- D - I - - 0x0188AD 13:889D: 0C        .byte $0C    ; <し>

off_889E_2C:
- D - I - - 0x0188AE 13:889E: 03        .byte $03    ; <う>
- D - I - - 0x0188AF 13:889F: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188B0 13:88A0: 01        .byte $01    ; <あ>
- D - I - - 0x0188B1 13:88A1: 0D        .byte $0D    ; <す>
- D - I - - 0x0188B2 13:88A2: 01        .byte $01    ; <あ>
- D - I - - 0x0188B3 13:88A3: 0B        .byte $0B    ; <さ>
- D - I - - 0x0188B4 13:88A4: 02        .byte $02    ; <い>
- D - I - - 0x0188B5 13:88A5: 09        .byte $09    ; <け>
- D - I - - 0x0188B6 13:88A6: FF        .byte $FF
- D - I - - 0x0188B7 13:88A7: 0C        .byte $0C    ; <し>

off_88A8_24:
- D - I - - 0x0188B8 13:88A8: 01        .byte $01    ; <あ>
- D - I - - 0x0188B9 13:88A9: 0C        .byte $0C    ; <し>
- D - I - - 0x0188BA 13:88AA: 06        .byte $06    ; <か>
- D - I - - 0x0188BB 13:88AB: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188BC 13:88AC: 02        .byte $02    ; <い>
- D - I - - 0x0188BD 13:88AD: 0D        .byte $0D    ; <す>
- D - I - - 0x0188BE 13:88AE: 01        .byte $01    ; <あ>
- D - I - - 0x0188BF 13:88AF: 0B        .byte $0B    ; <さ>
- D - I - - 0x0188C0 13:88B0: 02        .byte $02    ; <い>
- D - I - - 0x0188C1 13:88B1: 09        .byte $09    ; <け>
- D - I - - 0x0188C2 13:88B2: FF        .byte $FF
- D - I - - 0x0188C3 13:88B3: 0C        .byte $0C    ; <し>

off_88B4_25:
- D - I - - 0x0188C4 13:88B4: 01        .byte $01    ; <あ>
- D - I - - 0x0188C5 13:88B5: 0C        .byte $0C    ; <し>
- D - I - - 0x0188C6 13:88B6: 09        .byte $09    ; <け>
- D - I - - 0x0188C7 13:88B7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188C8 13:88B8: 01        .byte $01    ; <あ>
- D - I - - 0x0188C9 13:88B9: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188CA 13:88BA: 01        .byte $01    ; <あ>
- D - I - - 0x0188CB 13:88BB: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188CC 13:88BC: 01        .byte $01    ; <あ>
- D - I - - 0x0188CD 13:88BD: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188CE 13:88BE: 01        .byte $01    ; <あ>
- D - I - - 0x0188CF 13:88BF: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188D0 13:88C0: 01        .byte $01    ; <あ>
- D - I - - 0x0188D1 13:88C1: 09        .byte $09    ; <け>
- D - I - - 0x0188D2 13:88C2: FF        .byte $FF
- D - I - - 0x0188D3 13:88C3: 0C        .byte $0C    ; <し>

off_88C4_26:
- D - I - - 0x0188D4 13:88C4: 01        .byte $01    ; <あ>
- D - I - - 0x0188D5 13:88C5: 0C        .byte $0C    ; <し>
- D - I - - 0x0188D6 13:88C6: 0C        .byte $0C    ; <し>
- D - I - - 0x0188D7 13:88C7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188D8 13:88C8: 01        .byte $01    ; <あ>
- D - I - - 0x0188D9 13:88C9: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188DA 13:88CA: 01        .byte $01    ; <あ>
- D - I - - 0x0188DB 13:88CB: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188DC 13:88CC: 01        .byte $01    ; <あ>
- D - I - - 0x0188DD 13:88CD: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188DE 13:88CE: 01        .byte $01    ; <あ>
- D - I - - 0x0188DF 13:88CF: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188E0 13:88D0: 01        .byte $01    ; <あ>
- D - I - - 0x0188E1 13:88D1: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188E2 13:88D2: 01        .byte $01    ; <あ>
- D - I - - 0x0188E3 13:88D3: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188E4 13:88D4: 01        .byte $01    ; <あ>
- D - I - - 0x0188E5 13:88D5: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188E6 13:88D6: 01        .byte $01    ; <あ>
- D - I - - 0x0188E7 13:88D7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188E8 13:88D8: 01        .byte $01    ; <あ>
- D - I - - 0x0188E9 13:88D9: 09        .byte $09    ; <け>
- D - I - - 0x0188EA 13:88DA: FF        .byte $FF
- D - I - - 0x0188EB 13:88DB: 0C        .byte $0C    ; <し>

off_88DC_27:
- D - I - - 0x0188EC 13:88DC: 01        .byte $01    ; <あ>
- D - I - - 0x0188ED 13:88DD: 0C        .byte $0C    ; <し>
- D - I - - 0x0188EE 13:88DE: 13        .byte $13    ; <て>
- D - I - - 0x0188EF 13:88DF: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188F0 13:88E0: 01        .byte $01    ; <あ>
- D - I - - 0x0188F1 13:88E1: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188F2 13:88E2: 01        .byte $01    ; <あ>
- D - I - - 0x0188F3 13:88E3: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188F4 13:88E4: 01        .byte $01    ; <あ>
- D - I - - 0x0188F5 13:88E5: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188F6 13:88E6: 01        .byte $01    ; <あ>
- D - I - - 0x0188F7 13:88E7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188F8 13:88E8: 01        .byte $01    ; <あ>
- D - I - - 0x0188F9 13:88E9: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188FA 13:88EA: 01        .byte $01    ; <あ>
- D - I - - 0x0188FB 13:88EB: 0F        .byte $0F    ; <そ>
- D - I - - 0x0188FC 13:88EC: 01        .byte $01    ; <あ>
- D - I - - 0x0188FD 13:88ED: 0E        .byte $0E    ; <せ>
- D - I - - 0x0188FE 13:88EE: 01        .byte $01    ; <あ>
- D - I - - 0x0188FF 13:88EF: 0F        .byte $0F    ; <そ>
- D - I - - 0x018900 13:88F0: 01        .byte $01    ; <あ>
- D - I - - 0x018901 13:88F1: 0E        .byte $0E    ; <せ>
- D - I - - 0x018902 13:88F2: 02        .byte $02    ; <い>
- D - I - - 0x018903 13:88F3: 0D        .byte $0D    ; <す>
- D - I - - 0x018904 13:88F4: 02        .byte $02    ; <い>
- D - I - - 0x018905 13:88F5: 0C        .byte $0C    ; <し>
- D - I - - 0x018906 13:88F6: 02        .byte $02    ; <い>
- D - I - - 0x018907 13:88F7: 0D        .byte $0D    ; <す>
- D - I - - 0x018908 13:88F8: 02        .byte $02    ; <い>
- D - I - - 0x018909 13:88F9: 0C        .byte $0C    ; <し>
- D - I - - 0x01890A 13:88FA: 02        .byte $02    ; <い>
- D - I - - 0x01890B 13:88FB: 0D        .byte $0D    ; <す>
- D - I - - 0x01890C 13:88FC: 02        .byte $02    ; <い>
- D - I - - 0x01890D 13:88FD: 0C        .byte $0C    ; <し>
- D - I - - 0x01890E 13:88FE: 02        .byte $02    ; <い>
- D - I - - 0x01890F 13:88FF: 0D        .byte $0D    ; <す>
- D - I - - 0x018910 13:8900: 02        .byte $02    ; <い>
- D - I - - 0x018911 13:8901: 0C        .byte $0C    ; <し>
- D - I - - 0x018912 13:8902: 02        .byte $02    ; <い>
- D - I - - 0x018913 13:8903: 0D        .byte $0D    ; <す>
- D - I - - 0x018914 13:8904: 02        .byte $02    ; <い>
- D - I - - 0x018915 13:8905: 0C        .byte $0C    ; <し>
- D - I - - 0x018916 13:8906: 02        .byte $02    ; <い>
- D - I - - 0x018917 13:8907: 0D        .byte $0D    ; <す>
- D - I - - 0x018918 13:8908: 02        .byte $02    ; <い>
- D - I - - 0x018919 13:8909: 0C        .byte $0C    ; <し>
- D - I - - 0x01891A 13:890A: 02        .byte $02    ; <い>
- D - I - - 0x01891B 13:890B: 0D        .byte $0D    ; <す>
- D - I - - 0x01891C 13:890C: 02        .byte $02    ; <い>
- D - I - - 0x01891D 13:890D: 0C        .byte $0C    ; <し>
- D - I - - 0x01891E 13:890E: 02        .byte $02    ; <い>
- D - I - - 0x01891F 13:890F: 0D        .byte $0D    ; <す>
- D - I - - 0x018920 13:8910: 02        .byte $02    ; <い>
- D - I - - 0x018921 13:8911: 0C        .byte $0C    ; <し>
- D - I - - 0x018922 13:8912: 02        .byte $02    ; <い>
- D - I - - 0x018923 13:8913: 0D        .byte $0D    ; <す>
- D - I - - 0x018924 13:8914: 02        .byte $02    ; <い>
- D - I - - 0x018925 13:8915: 0C        .byte $0C    ; <し>
- D - I - - 0x018926 13:8916: 02        .byte $02    ; <い>
- D - I - - 0x018927 13:8917: 0D        .byte $0D    ; <す>
- D - I - - 0x018928 13:8918: 02        .byte $02    ; <い>
- D - I - - 0x018929 13:8919: 0C        .byte $0C    ; <し>
- D - I - - 0x01892A 13:891A: 02        .byte $02    ; <い>
- D - I - - 0x01892B 13:891B: 0D        .byte $0D    ; <す>
- D - I - - 0x01892C 13:891C: 02        .byte $02    ; <い>
- D - I - - 0x01892D 13:891D: 0C        .byte $0C    ; <し>
- D - I - - 0x01892E 13:891E: 02        .byte $02    ; <い>
- D - I - - 0x01892F 13:891F: 0D        .byte $0D    ; <す>
- D - I - - 0x018930 13:8920: 02        .byte $02    ; <い>
- D - I - - 0x018931 13:8921: 0C        .byte $0C    ; <し>
- D - I - - 0x018932 13:8922: 02        .byte $02    ; <い>
- D - I - - 0x018933 13:8923: 0D        .byte $0D    ; <す>
- D - I - - 0x018934 13:8924: 02        .byte $02    ; <い>
- D - I - - 0x018935 13:8925: 0C        .byte $0C    ; <し>
- D - I - - 0x018936 13:8926: 02        .byte $02    ; <い>
- D - I - - 0x018937 13:8927: 0D        .byte $0D    ; <す>
- D - I - - 0x018938 13:8928: 02        .byte $02    ; <い>
- D - I - - 0x018939 13:8929: 0C        .byte $0C    ; <し>
- D - I - - 0x01893A 13:892A: 02        .byte $02    ; <い>
- D - I - - 0x01893B 13:892B: 0D        .byte $0D    ; <す>
- D - I - - 0x01893C 13:892C: 02        .byte $02    ; <い>
- D - I - - 0x01893D 13:892D: 0C        .byte $0C    ; <し>
- D - I - - 0x01893E 13:892E: 02        .byte $02    ; <い>
- D - I - - 0x01893F 13:892F: 0D        .byte $0D    ; <す>
- D - I - - 0x018940 13:8930: 02        .byte $02    ; <い>
- D - I - - 0x018941 13:8931: 0C        .byte $0C    ; <し>
- D - I - - 0x018942 13:8932: 02        .byte $02    ; <い>
- D - I - - 0x018943 13:8933: 0D        .byte $0D    ; <す>
- D - I - - 0x018944 13:8934: 02        .byte $02    ; <い>
- D - I - - 0x018945 13:8935: 0C        .byte $0C    ; <し>
- D - I - - 0x018946 13:8936: 02        .byte $02    ; <い>
- D - I - - 0x018947 13:8937: 0D        .byte $0D    ; <す>
- D - I - - 0x018948 13:8938: 02        .byte $02    ; <い>
- D - I - - 0x018949 13:8939: 0C        .byte $0C    ; <し>
- D - I - - 0x01894A 13:893A: 02        .byte $02    ; <い>
- D - I - - 0x01894B 13:893B: 0D        .byte $0D    ; <す>
- D - I - - 0x01894C 13:893C: 02        .byte $02    ; <い>
- D - I - - 0x01894D 13:893D: 0C        .byte $0C    ; <し>
- D - I - - 0x01894E 13:893E: 02        .byte $02    ; <い>
- D - I - - 0x01894F 13:893F: 0D        .byte $0D    ; <す>
- D - I - - 0x018950 13:8940: FF        .byte $FF
- D - I - - 0x018951 13:8941: 0C        .byte $0C    ; <し>

off_8942_28:
- D - I - - 0x018952 13:8942: 01        .byte $01    ; <あ>
- D - I - - 0x018953 13:8943: 0C        .byte $0C    ; <し>
- D - I - - 0x018954 13:8944: 03        .byte $03    ; <う>
- D - I - - 0x018955 13:8945: 0F        .byte $0F    ; <そ>
- D - I - - 0x018956 13:8946: 01        .byte $01    ; <あ>
- D - I - - 0x018957 13:8947: 09        .byte $09    ; <け>
- D - I - - 0x018958 13:8948: FF        .byte $FF
- D - I - - 0x018959 13:8949: 0C        .byte $0C    ; <し>

off_894A_29:
- D - I - - 0x01895A 13:894A: 01        .byte $01    ; <あ>
- D - I - - 0x01895B 13:894B: 0C        .byte $0C    ; <し>
- D - I - - 0x01895C 13:894C: 08        .byte $08    ; <く>
- D - I - - 0x01895D 13:894D: 0F        .byte $0F    ; <そ>
- D - I - - 0x01895E 13:894E: 01        .byte $01    ; <あ>
- D - I - - 0x01895F 13:894F: 09        .byte $09    ; <け>
- D - I - - 0x018960 13:8950: FF        .byte $FF
- D - I - - 0x018961 13:8951: 0C        .byte $0C    ; <し>

off_8952_00:
- D - I - - 0x018962 13:8952: 01        .byte $01    ; <あ>
- D - I - - 0x018963 13:8953: 0D        .byte $0D    ; <す>
- D - I - - 0x018964 13:8954: 01        .byte $01    ; <あ>
- D - I - - 0x018965 13:8955: 0F        .byte $0F    ; <そ>
- D - I - - 0x018966 13:8956: 01        .byte $01    ; <あ>
- D - I - - 0x018967 13:8957: 0E        .byte $0E    ; <せ>
- D - I - - 0x018968 13:8958: 01        .byte $01    ; <あ>
- D - I - - 0x018969 13:8959: 04        .byte $04    ; <え>
- D - I - - 0x01896A 13:895A: FF        .byte $FF
- D - I - - 0x01896B 13:895B: 0C        .byte $0C    ; <し>

off_895C_01:
- D - I - - 0x01896C 13:895C: 01        .byte $01    ; <あ>
- D - I - - 0x01896D 13:895D: 0D        .byte $0D    ; <す>
- D - I - - 0x01896E 13:895E: 02        .byte $02    ; <い>
- D - I - - 0x01896F 13:895F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018970 13:8960: 01        .byte $01    ; <あ>
- D - I - - 0x018971 13:8961: 0D        .byte $0D    ; <す>
- D - I - - 0x018972 13:8962: 01        .byte $01    ; <あ>
- D - I - - 0x018973 13:8963: 0B        .byte $0B    ; <さ>
- D - I - - 0x018974 13:8964: 01        .byte $01    ; <あ>
- D - I - - 0x018975 13:8965: 09        .byte $09    ; <け>
- D - I - - 0x018976 13:8966: 01        .byte $01    ; <あ>
- D - I - - 0x018977 13:8967: 04        .byte $04    ; <え>
- D - I - - 0x018978 13:8968: FF        .byte $FF
- D - I - - 0x018979 13:8969: 0C        .byte $0C    ; <し>

off_896A_02:
- D - I - - 0x01897A 13:896A: 01        .byte $01    ; <あ>
- D - I - - 0x01897B 13:896B: 0D        .byte $0D    ; <す>
- D - I - - 0x01897C 13:896C: 05        .byte $05    ; <お>
- D - I - - 0x01897D 13:896D: 0F        .byte $0F    ; <そ>
- D - I - - 0x01897E 13:896E: 01        .byte $01    ; <あ>
- D - I - - 0x01897F 13:896F: 0D        .byte $0D    ; <す>
- D - I - - 0x018980 13:8970: 01        .byte $01    ; <あ>
- D - I - - 0x018981 13:8971: 0B        .byte $0B    ; <さ>
- D - I - - 0x018982 13:8972: 01        .byte $01    ; <あ>
- D - I - - 0x018983 13:8973: 09        .byte $09    ; <け>
- D - I - - 0x018984 13:8974: 01        .byte $01    ; <あ>
- D - I - - 0x018985 13:8975: 04        .byte $04    ; <え>
- D - I - - 0x018986 13:8976: FF        .byte $FF
- D - I - - 0x018987 13:8977: 0C        .byte $0C    ; <し>

off_8978_03:
- D - I - - 0x018988 13:8978: 01        .byte $01    ; <あ>
- D - I - - 0x018989 13:8979: 0D        .byte $0D    ; <す>
- D - I - - 0x01898A 13:897A: 07        .byte $07    ; <き>
- D - I - - 0x01898B 13:897B: 0F        .byte $0F    ; <そ>
- D - I - - 0x01898C 13:897C: 01        .byte $01    ; <あ>
- D - I - - 0x01898D 13:897D: 0E        .byte $0E    ; <せ>
- D - I - - 0x01898E 13:897E: 01        .byte $01    ; <あ>
- D - I - - 0x01898F 13:897F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018990 13:8980: 01        .byte $01    ; <あ>
- D - I - - 0x018991 13:8981: 0E        .byte $0E    ; <せ>
- D - I - - 0x018992 13:8982: 01        .byte $01    ; <あ>
- D - I - - 0x018993 13:8983: 0F        .byte $0F    ; <そ>
- D - I - - 0x018994 13:8984: 01        .byte $01    ; <あ>
- D - I - - 0x018995 13:8985: 04        .byte $04    ; <え>
- D - I - - 0x018996 13:8986: FF        .byte $FF
- D - I - - 0x018997 13:8987: 0C        .byte $0C    ; <し>

off_8988_04:
- D - I - - 0x018998 13:8988: 01        .byte $01    ; <あ>
- D - I - - 0x018999 13:8989: 0D        .byte $0D    ; <す>
- D - I - - 0x01899A 13:898A: 09        .byte $09    ; <け>
- D - I - - 0x01899B 13:898B: 0F        .byte $0F    ; <そ>
- D - I - - 0x01899C 13:898C: 01        .byte $01    ; <あ>
- D - I - - 0x01899D 13:898D: 0E        .byte $0E    ; <せ>
- D - I - - 0x01899E 13:898E: 01        .byte $01    ; <あ>
- D - I - - 0x01899F 13:898F: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189A0 13:8990: 01        .byte $01    ; <あ>
- D - I - - 0x0189A1 13:8991: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189A2 13:8992: 01        .byte $01    ; <あ>
- D - I - - 0x0189A3 13:8993: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189A4 13:8994: 01        .byte $01    ; <あ>
- D - I - - 0x0189A5 13:8995: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189A6 13:8996: 01        .byte $01    ; <あ>
- D - I - - 0x0189A7 13:8997: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189A8 13:8998: 01        .byte $01    ; <あ>
- D - I - - 0x0189A9 13:8999: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189AA 13:899A: 01        .byte $01    ; <あ>
- D - I - - 0x0189AB 13:899B: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189AC 13:899C: 01        .byte $01    ; <あ>
- D - I - - 0x0189AD 13:899D: 04        .byte $04    ; <え>
- D - I - - 0x0189AE 13:899E: FF        .byte $FF
- D - I - - 0x0189AF 13:899F: 0C        .byte $0C    ; <し>

off_89A0_05:
- D - I - - 0x0189B0 13:89A0: 01        .byte $01    ; <あ>
- D - I - - 0x0189B1 13:89A1: 0D        .byte $0D    ; <す>
- D - I - - 0x0189B2 13:89A2: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189B3 13:89A3: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189B4 13:89A4: 01        .byte $01    ; <あ>
- D - I - - 0x0189B5 13:89A5: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189B6 13:89A6: 01        .byte $01    ; <あ>
- D - I - - 0x0189B7 13:89A7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189B8 13:89A8: 01        .byte $01    ; <あ>
- D - I - - 0x0189B9 13:89A9: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189BA 13:89AA: 01        .byte $01    ; <あ>
- D - I - - 0x0189BB 13:89AB: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189BC 13:89AC: 01        .byte $01    ; <あ>
- D - I - - 0x0189BD 13:89AD: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189BE 13:89AE: 01        .byte $01    ; <あ>
- D - I - - 0x0189BF 13:89AF: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189C0 13:89B0: 01        .byte $01    ; <あ>
- D - I - - 0x0189C1 13:89B1: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189C2 13:89B2: 01        .byte $01    ; <あ>
- D - I - - 0x0189C3 13:89B3: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189C4 13:89B4: 01        .byte $01    ; <あ>
- D - I - - 0x0189C5 13:89B5: 04        .byte $04    ; <え>
- D - I - - 0x0189C6 13:89B6: FF        .byte $FF
- D - I - - 0x0189C7 13:89B7: 0C        .byte $0C    ; <し>

off_89B8_06:
- - - - - - 0x0189C8 13:89B8: 01        .byte $01    ; <あ>
- - - - - - 0x0189C9 13:89B9: 0D        .byte $0D    ; <す>
- - - - - - 0x0189CA 13:89BA: 03        .byte $03    ; <う>
- - - - - - 0x0189CB 13:89BB: 0F        .byte $0F    ; <そ>
- - - - - - 0x0189CC 13:89BC: 01        .byte $01    ; <あ>
- - - - - - 0x0189CD 13:89BD: 04        .byte $04    ; <え>
- - - - - - 0x0189CE 13:89BE: FF        .byte $FF
- - - - - - 0x0189CF 13:89BF: 0C        .byte $0C    ; <し>

off_89C0_07:
- D - I - - 0x0189D0 13:89C0: 01        .byte $01    ; <あ>
- D - I - - 0x0189D1 13:89C1: 0D        .byte $0D    ; <す>
- D - I - - 0x0189D2 13:89C2: 07        .byte $07    ; <き>
- D - I - - 0x0189D3 13:89C3: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189D4 13:89C4: 01        .byte $01    ; <あ>
- D - I - - 0x0189D5 13:89C5: 04        .byte $04    ; <え>
- D - I - - 0x0189D6 13:89C6: FF        .byte $FF
- D - I - - 0x0189D7 13:89C7: 0C        .byte $0C    ; <し>

off_89C8_08:
- D - I - - 0x0189D8 13:89C8: 02        .byte $02    ; <い>
- D - I - - 0x0189D9 13:89C9: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189DA 13:89CA: 01        .byte $01    ; <あ>
- D - I - - 0x0189DB 13:89CB: 0E        .byte $0E    ; <せ>
- D - I - - 0x0189DC 13:89CC: 01        .byte $01    ; <あ>
- D - I - - 0x0189DD 13:89CD: 04        .byte $04    ; <え>
- D - I - - 0x0189DE 13:89CE: FF        .byte $FF
- D - I - - 0x0189DF 13:89CF: 0C        .byte $0C    ; <し>

off_89D0_09:
- D - I - - 0x0189E0 13:89D0: 03        .byte $03    ; <う>
- D - I - - 0x0189E1 13:89D1: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189E2 13:89D2: 01        .byte $01    ; <あ>
- D - I - - 0x0189E3 13:89D3: 0C        .byte $0C    ; <し>
- D - I - - 0x0189E4 13:89D4: 01        .byte $01    ; <あ>
- D - I - - 0x0189E5 13:89D5: 09        .byte $09    ; <け>
- D - I - - 0x0189E6 13:89D6: 01        .byte $01    ; <あ>
- D - I - - 0x0189E7 13:89D7: 04        .byte $04    ; <え>
- D - I - - 0x0189E8 13:89D8: FF        .byte $FF
- D - I - - 0x0189E9 13:89D9: 0C        .byte $0C    ; <し>

off_89DA_0A:
- - - - - - 0x0189EA 13:89DA: 05        .byte $05    ; <お>
- - - - - - 0x0189EB 13:89DB: 0F        .byte $0F    ; <そ>
- - - - - - 0x0189EC 13:89DC: 01        .byte $01    ; <あ>
- - - - - - 0x0189ED 13:89DD: 0D        .byte $0D    ; <す>
- - - - - - 0x0189EE 13:89DE: 01        .byte $01    ; <あ>
- - - - - - 0x0189EF 13:89DF: 0B        .byte $0B    ; <さ>
- - - - - - 0x0189F0 13:89E0: 01        .byte $01    ; <あ>
- - - - - - 0x0189F1 13:89E1: 09        .byte $09    ; <け>
- - - - - - 0x0189F2 13:89E2: 01        .byte $01    ; <あ>
- - - - - - 0x0189F3 13:89E3: 04        .byte $04    ; <え>
- - - - - - 0x0189F4 13:89E4: FF        .byte $FF
- - - - - - 0x0189F5 13:89E5: 0C        .byte $0C    ; <し>

off_89E6_0B:
- D - I - - 0x0189F6 13:89E6: 06        .byte $06    ; <か>
- D - I - - 0x0189F7 13:89E7: 0F        .byte $0F    ; <そ>
- D - I - - 0x0189F8 13:89E8: 01        .byte $01    ; <あ>
- D - I - - 0x0189F9 13:89E9: 0D        .byte $0D    ; <す>
- D - I - - 0x0189FA 13:89EA: 01        .byte $01    ; <あ>
- D - I - - 0x0189FB 13:89EB: 0B        .byte $0B    ; <さ>
- D - I - - 0x0189FC 13:89EC: 01        .byte $01    ; <あ>
- D - I - - 0x0189FD 13:89ED: 0A        .byte $0A    ; <こ>
- D - I - - 0x0189FE 13:89EE: 01        .byte $01    ; <あ>
- D - I - - 0x0189FF 13:89EF: 09        .byte $09    ; <け>
- D - I - - 0x018A00 13:89F0: 01        .byte $01    ; <あ>
- D - I - - 0x018A01 13:89F1: 04        .byte $04    ; <え>
- D - I - - 0x018A02 13:89F2: FF        .byte $FF
- D - I - - 0x018A03 13:89F3: 0C        .byte $0C    ; <し>

off_89F4_0C:
- D - I - - 0x018A04 13:89F4: 01        .byte $01    ; <あ>
- D - I - - 0x018A05 13:89F5: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A06 13:89F6: 08        .byte $08    ; <く>
- D - I - - 0x018A07 13:89F7: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A08 13:89F8: 01        .byte $01    ; <あ>
- D - I - - 0x018A09 13:89F9: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A0A 13:89FA: 01        .byte $01    ; <あ>
- D - I - - 0x018A0B 13:89FB: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A0C 13:89FC: 01        .byte $01    ; <あ>
- D - I - - 0x018A0D 13:89FD: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A0E 13:89FE: 01        .byte $01    ; <あ>
- D - I - - 0x018A0F 13:89FF: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A10 13:8A00: 01        .byte $01    ; <あ>
- D - I - - 0x018A11 13:8A01: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A12 13:8A02: 01        .byte $01    ; <あ>
- D - I - - 0x018A13 13:8A03: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A14 13:8A04: 01        .byte $01    ; <あ>
- D - I - - 0x018A15 13:8A05: 04        .byte $04    ; <え>
- D - I - - 0x018A16 13:8A06: FF        .byte $FF
- D - I - - 0x018A17 13:8A07: 0C        .byte $0C    ; <し>

off_8A08_0D:
- D - I - - 0x018A18 13:8A08: 01        .byte $01    ; <あ>
- D - I - - 0x018A19 13:8A09: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A1A 13:8A0A: 0A        .byte $0A    ; <こ>
- D - I - - 0x018A1B 13:8A0B: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A1C 13:8A0C: 01        .byte $01    ; <あ>
- D - I - - 0x018A1D 13:8A0D: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A1E 13:8A0E: 01        .byte $01    ; <あ>
- D - I - - 0x018A1F 13:8A0F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A20 13:8A10: 01        .byte $01    ; <あ>
- D - I - - 0x018A21 13:8A11: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A22 13:8A12: 01        .byte $01    ; <あ>
- D - I - - 0x018A23 13:8A13: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A24 13:8A14: 01        .byte $01    ; <あ>
- D - I - - 0x018A25 13:8A15: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A26 13:8A16: 01        .byte $01    ; <あ>
- D - I - - 0x018A27 13:8A17: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A28 13:8A18: 01        .byte $01    ; <あ>
- D - I - - 0x018A29 13:8A19: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A2A 13:8A1A: 01        .byte $01    ; <あ>
- D - I - - 0x018A2B 13:8A1B: 0D        .byte $0D    ; <す>
- D - I - - 0x018A2C 13:8A1C: 01        .byte $01    ; <あ>
- D - I - - 0x018A2D 13:8A1D: 0A        .byte $0A    ; <こ>
- D - I - - 0x018A2E 13:8A1E: FF        .byte $FF
- D - I - - 0x018A2F 13:8A1F: 0C        .byte $0C    ; <し>

off_8A20_0E:
- D - I - - 0x018A30 13:8A20: 01        .byte $01    ; <あ>
- D - I - - 0x018A31 13:8A21: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A32 13:8A22: 03        .byte $03    ; <う>
- D - I - - 0x018A33 13:8A23: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A34 13:8A24: 01        .byte $01    ; <あ>
- D - I - - 0x018A35 13:8A25: 04        .byte $04    ; <え>
- D - I - - 0x018A36 13:8A26: FF        .byte $FF
- D - I - - 0x018A37 13:8A27: 0C        .byte $0C    ; <し>

off_8A28_0F:
- D - I - - 0x018A38 13:8A28: 01        .byte $01    ; <あ>
- D - I - - 0x018A39 13:8A29: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A3A 13:8A2A: 06        .byte $06    ; <か>
- D - I - - 0x018A3B 13:8A2B: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A3C 13:8A2C: 01        .byte $01    ; <あ>
- D - I - - 0x018A3D 13:8A2D: 04        .byte $04    ; <え>
- D - I - - 0x018A3E 13:8A2E: FF        .byte $FF
- D - I - - 0x018A3F 13:8A2F: 0C        .byte $0C    ; <し>

off_8A30_10:
- D - I - - 0x018A40 13:8A30: 01        .byte $01    ; <あ>
- D - I - - 0x018A41 13:8A31: 0D        .byte $0D    ; <す>

off_8A32_2A:
- D - I - - 0x018A42 13:8A32: 12        .byte $12    ; <つ>
- D - I - - 0x018A43 13:8A33: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A44 13:8A34: 03        .byte $03    ; <う>
- D - I - - 0x018A45 13:8A35: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A46 13:8A36: 03        .byte $03    ; <う>
- D - I - - 0x018A47 13:8A37: 0D        .byte $0D    ; <す>
- D - I - - 0x018A48 13:8A38: 03        .byte $03    ; <う>
- D - I - - 0x018A49 13:8A39: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A4A 13:8A3A: 03        .byte $03    ; <う>
- D - I - - 0x018A4B 13:8A3B: 0D        .byte $0D    ; <す>
- D - I - - 0x018A4C 13:8A3C: 03        .byte $03    ; <う>
- D - I - - 0x018A4D 13:8A3D: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A4E 13:8A3E: 03        .byte $03    ; <う>
- D - I - - 0x018A4F 13:8A3F: 0D        .byte $0D    ; <す>
- D - I - - 0x018A50 13:8A40: 03        .byte $03    ; <う>
- D - I - - 0x018A51 13:8A41: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A52 13:8A42: 03        .byte $03    ; <う>
- D - I - - 0x018A53 13:8A43: 0D        .byte $0D    ; <す>
- D - I - - 0x018A54 13:8A44: 04        .byte $04    ; <え>
- D - I - - 0x018A55 13:8A45: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A56 13:8A46: 04        .byte $04    ; <え>
- D - I - - 0x018A57 13:8A47: 0D        .byte $0D    ; <す>
- D - I - - 0x018A58 13:8A48: 04        .byte $04    ; <え>
- D - I - - 0x018A59 13:8A49: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A5A 13:8A4A: 04        .byte $04    ; <え>
- D - I - - 0x018A5B 13:8A4B: 0D        .byte $0D    ; <す>
- D - I - - 0x018A5C 13:8A4C: 04        .byte $04    ; <え>
- D - I - - 0x018A5D 13:8A4D: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A5E 13:8A4E: 05        .byte $05    ; <お>
- D - I - - 0x018A5F 13:8A4F: 0D        .byte $0D    ; <す>
- D - I - - 0x018A60 13:8A50: 05        .byte $05    ; <お>
- D - I - - 0x018A61 13:8A51: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A62 13:8A52: 05        .byte $05    ; <お>
- D - I - - 0x018A63 13:8A53: 0D        .byte $0D    ; <す>
- D - I - - 0x018A64 13:8A54: 05        .byte $05    ; <お>
- D - I - - 0x018A65 13:8A55: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A66 13:8A56: 05        .byte $05    ; <お>
- D - I - - 0x018A67 13:8A57: 0D        .byte $0D    ; <す>
- D - I - - 0x018A68 13:8A58: 06        .byte $06    ; <か>
- D - I - - 0x018A69 13:8A59: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A6A 13:8A5A: 06        .byte $06    ; <か>
- D - I - - 0x018A6B 13:8A5B: 0D        .byte $0D    ; <す>
- D - I - - 0x018A6C 13:8A5C: 06        .byte $06    ; <か>
- D - I - - 0x018A6D 13:8A5D: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A6E 13:8A5E: 06        .byte $06    ; <か>
- D - I - - 0x018A6F 13:8A5F: 0D        .byte $0D    ; <す>
- D - I - - 0x018A70 13:8A60: 06        .byte $06    ; <か>
- D - I - - 0x018A71 13:8A61: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A72 13:8A62: 07        .byte $07    ; <き>
- D - I - - 0x018A73 13:8A63: 0D        .byte $0D    ; <す>
- D - I - - 0x018A74 13:8A64: 07        .byte $07    ; <き>
- D - I - - 0x018A75 13:8A65: 0E        .byte $0E    ; <せ>
- D - I - - 0x018A76 13:8A66: 07        .byte $07    ; <き>
- D - I - - 0x018A77 13:8A67: 0D        .byte $0D    ; <す>
- D - I - - 0x018A78 13:8A68: 07        .byte $07    ; <き>
- D - I - - 0x018A79 13:8A69: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A7A 13:8A6A: 07        .byte $07    ; <き>
- - - - - - 0x018A7B 13:8A6B: 0D        .byte $0D    ; <す>
- - - - - - 0x018A7C 13:8A6C: 07        .byte $07    ; <き>
- - - - - - 0x018A7D 13:8A6D: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A7E 13:8A6E: 07        .byte $07    ; <き>
- - - - - - 0x018A7F 13:8A6F: 0D        .byte $0D    ; <す>
- - - - - - 0x018A80 13:8A70: 07        .byte $07    ; <き>
- - - - - - 0x018A81 13:8A71: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A82 13:8A72: 07        .byte $07    ; <き>
- - - - - - 0x018A83 13:8A73: 0D        .byte $0D    ; <す>
- - - - - - 0x018A84 13:8A74: 07        .byte $07    ; <き>
- - - - - - 0x018A85 13:8A75: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A86 13:8A76: 07        .byte $07    ; <き>
- - - - - - 0x018A87 13:8A77: 0D        .byte $0D    ; <す>
- - - - - - 0x018A88 13:8A78: 07        .byte $07    ; <き>
- - - - - - 0x018A89 13:8A79: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A8A 13:8A7A: 07        .byte $07    ; <き>
- - - - - - 0x018A8B 13:8A7B: 0D        .byte $0D    ; <す>
- - - - - - 0x018A8C 13:8A7C: 07        .byte $07    ; <き>
- - - - - - 0x018A8D 13:8A7D: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A8E 13:8A7E: 07        .byte $07    ; <き>
- - - - - - 0x018A8F 13:8A7F: 0D        .byte $0D    ; <す>
- - - - - - 0x018A90 13:8A80: 07        .byte $07    ; <き>
- - - - - - 0x018A91 13:8A81: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A92 13:8A82: 07        .byte $07    ; <き>
- - - - - - 0x018A93 13:8A83: 0D        .byte $0D    ; <す>
- - - - - - 0x018A94 13:8A84: 07        .byte $07    ; <き>
- - - - - - 0x018A95 13:8A85: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A96 13:8A86: 07        .byte $07    ; <き>
- - - - - - 0x018A97 13:8A87: 0D        .byte $0D    ; <す>
- - - - - - 0x018A98 13:8A88: 07        .byte $07    ; <き>
- - - - - - 0x018A99 13:8A89: 0E        .byte $0E    ; <せ>
- - - - - - 0x018A9A 13:8A8A: FF        .byte $FF
- - - - - - 0x018A9B 13:8A8B: 0E        .byte $0E    ; <せ>

off_8A8C_11:
- D - I - - 0x018A9C 13:8A8C: 01        .byte $01    ; <あ>
- D - I - - 0x018A9D 13:8A8D: 0F        .byte $0F    ; <そ>
- D - I - - 0x018A9E 13:8A8E: 01        .byte $01    ; <あ>
- D - I - - 0x018A9F 13:8A8F: 0E        .byte $0E    ; <せ>
- D - I - - 0x018AA0 13:8A90: 01        .byte $01    ; <あ>
- D - I - - 0x018AA1 13:8A91: 0D        .byte $0D    ; <す>
- D - I - - 0x018AA2 13:8A92: 01        .byte $01    ; <あ>
- D - I - - 0x018AA3 13:8A93: 0C        .byte $0C    ; <し>
- D - I - - 0x018AA4 13:8A94: 01        .byte $01    ; <あ>
- D - I - - 0x018AA5 13:8A95: 0B        .byte $0B    ; <さ>
- D - I - - 0x018AA6 13:8A96: 01        .byte $01    ; <あ>
- D - I - - 0x018AA7 13:8A97: 0A        .byte $0A    ; <こ>
- D - I - - 0x018AA8 13:8A98: 01        .byte $01    ; <あ>
- D - I - - 0x018AA9 13:8A99: 09        .byte $09    ; <け>
- D - I - - 0x018AAA 13:8A9A: 01        .byte $01    ; <あ>
- D - I - - 0x018AAB 13:8A9B: 08        .byte $08    ; <く>
- D - I - - 0x018AAC 13:8A9C: 01        .byte $01    ; <あ>
- D - I - - 0x018AAD 13:8A9D: 07        .byte $07    ; <き>
- D - I - - 0x018AAE 13:8A9E: 01        .byte $01    ; <あ>
- D - I - - 0x018AAF 13:8A9F: 06        .byte $06    ; <か>
- D - I - - 0x018AB0 13:8AA0: 01        .byte $01    ; <あ>
- D - I - - 0x018AB1 13:8AA1: 05        .byte $05    ; <お>
- D - I - - 0x018AB2 13:8AA2: 01        .byte $01    ; <あ>
- D - I - - 0x018AB3 13:8AA3: 04        .byte $04    ; <え>
- D - I - - 0x018AB4 13:8AA4: 01        .byte $01    ; <あ>
- D - I - - 0x018AB5 13:8AA5: 03        .byte $03    ; <う>
- D - I - - 0x018AB6 13:8AA6: 01        .byte $01    ; <あ>
- D - I - - 0x018AB7 13:8AA7: 02        .byte $02    ; <い>
- D - I - - 0x018AB8 13:8AA8: 01        .byte $01    ; <あ>
- D - I - - 0x018AB9 13:8AA9: 01        .byte $01    ; <あ>
- D - I - - 0x018ABA 13:8AAA: FF        .byte $FF
- D - I - - 0x018ABB 13:8AAB: 00        .byte $00

off_8AAC_12:
- D - I - - 0x018ABC 13:8AAC: 02        .byte $02    ; <い>
- D - I - - 0x018ABD 13:8AAD: 0F        .byte $0F    ; <そ>
- D - I - - 0x018ABE 13:8AAE: 02        .byte $02    ; <い>
- D - I - - 0x018ABF 13:8AAF: 0E        .byte $0E    ; <せ>
- D - I - - 0x018AC0 13:8AB0: 02        .byte $02    ; <い>
- D - I - - 0x018AC1 13:8AB1: 0D        .byte $0D    ; <す>
- D - I - - 0x018AC2 13:8AB2: 02        .byte $02    ; <い>
- D - I - - 0x018AC3 13:8AB3: 0C        .byte $0C    ; <し>
- D - I - - 0x018AC4 13:8AB4: 02        .byte $02    ; <い>
- D - I - - 0x018AC5 13:8AB5: 0B        .byte $0B    ; <さ>
- D - I - - 0x018AC6 13:8AB6: 02        .byte $02    ; <い>
- D - I - - 0x018AC7 13:8AB7: 0A        .byte $0A    ; <こ>
- D - I - - 0x018AC8 13:8AB8: 02        .byte $02    ; <い>
- D - I - - 0x018AC9 13:8AB9: 09        .byte $09    ; <け>
- D - I - - 0x018ACA 13:8ABA: 02        .byte $02    ; <い>
- D - I - - 0x018ACB 13:8ABB: 08        .byte $08    ; <く>
- D - I - - 0x018ACC 13:8ABC: 02        .byte $02    ; <い>
- D - I - - 0x018ACD 13:8ABD: 07        .byte $07    ; <き>
- D - I - - 0x018ACE 13:8ABE: 02        .byte $02    ; <い>
- D - I - - 0x018ACF 13:8ABF: 06        .byte $06    ; <か>
- D - I - - 0x018AD0 13:8AC0: 02        .byte $02    ; <い>
- D - I - - 0x018AD1 13:8AC1: 05        .byte $05    ; <お>
- D - I - - 0x018AD2 13:8AC2: 02        .byte $02    ; <い>
- D - I - - 0x018AD3 13:8AC3: 04        .byte $04    ; <え>
- D - I - - 0x018AD4 13:8AC4: 02        .byte $02    ; <い>
- D - I - - 0x018AD5 13:8AC5: 03        .byte $03    ; <う>
- D - I - - 0x018AD6 13:8AC6: 02        .byte $02    ; <い>
- D - I - - 0x018AD7 13:8AC7: 02        .byte $02    ; <い>
- D - I - - 0x018AD8 13:8AC8: 02        .byte $02    ; <い>
- D - I - - 0x018AD9 13:8AC9: 01        .byte $01    ; <あ>
- D - I - - 0x018ADA 13:8ACA: FF        .byte $FF
- D - I - - 0x018ADB 13:8ACB: 00        .byte $00

off_8ACC_13:
- D - I - - 0x018ADC 13:8ACC: 03        .byte $03    ; <う>
- D - I - - 0x018ADD 13:8ACD: 0F        .byte $0F    ; <そ>
- D - I - - 0x018ADE 13:8ACE: 03        .byte $03    ; <う>
- D - I - - 0x018ADF 13:8ACF: 0E        .byte $0E    ; <せ>
- D - I - - 0x018AE0 13:8AD0: 03        .byte $03    ; <う>
- D - I - - 0x018AE1 13:8AD1: 0D        .byte $0D    ; <す>
- D - I - - 0x018AE2 13:8AD2: 03        .byte $03    ; <う>
- D - I - - 0x018AE3 13:8AD3: 0C        .byte $0C    ; <し>
- D - I - - 0x018AE4 13:8AD4: 03        .byte $03    ; <う>
- D - I - - 0x018AE5 13:8AD5: 0B        .byte $0B    ; <さ>
- D - I - - 0x018AE6 13:8AD6: 03        .byte $03    ; <う>
- D - I - - 0x018AE7 13:8AD7: 0A        .byte $0A    ; <こ>
- D - I - - 0x018AE8 13:8AD8: 03        .byte $03    ; <う>
- D - I - - 0x018AE9 13:8AD9: 09        .byte $09    ; <け>
- D - I - - 0x018AEA 13:8ADA: 03        .byte $03    ; <う>
- D - I - - 0x018AEB 13:8ADB: 08        .byte $08    ; <く>
- D - I - - 0x018AEC 13:8ADC: 03        .byte $03    ; <う>
- D - I - - 0x018AED 13:8ADD: 07        .byte $07    ; <き>
- D - I - - 0x018AEE 13:8ADE: 03        .byte $03    ; <う>
- D - I - - 0x018AEF 13:8ADF: 06        .byte $06    ; <か>
- D - I - - 0x018AF0 13:8AE0: 03        .byte $03    ; <う>
- D - I - - 0x018AF1 13:8AE1: 05        .byte $05    ; <お>
- D - I - - 0x018AF2 13:8AE2: 03        .byte $03    ; <う>
- D - I - - 0x018AF3 13:8AE3: 04        .byte $04    ; <え>
- D - I - - 0x018AF4 13:8AE4: 03        .byte $03    ; <う>
- D - I - - 0x018AF5 13:8AE5: 03        .byte $03    ; <う>
- D - I - - 0x018AF6 13:8AE6: 03        .byte $03    ; <う>
- D - I - - 0x018AF7 13:8AE7: 02        .byte $02    ; <い>
- D - I - - 0x018AF8 13:8AE8: 03        .byte $03    ; <う>
- D - I - - 0x018AF9 13:8AE9: 01        .byte $01    ; <あ>
- D - I - - 0x018AFA 13:8AEA: FF        .byte $FF
- D - I - - 0x018AFB 13:8AEB: 00        .byte $00

off_8AEC_14:
- D - I - - 0x018AFC 13:8AEC: 01        .byte $01    ; <あ>
- D - I - - 0x018AFD 13:8AED: 0F        .byte $0F    ; <そ>
- D - I - - 0x018AFE 13:8AEE: 02        .byte $02    ; <い>
- D - I - - 0x018AFF 13:8AEF: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B00 13:8AF0: 03        .byte $03    ; <う>
- D - I - - 0x018B01 13:8AF1: 0D        .byte $0D    ; <す>
- D - I - - 0x018B02 13:8AF2: 04        .byte $04    ; <え>
- D - I - - 0x018B03 13:8AF3: 0C        .byte $0C    ; <し>
- D - I - - 0x018B04 13:8AF4: 05        .byte $05    ; <お>
- D - I - - 0x018B05 13:8AF5: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B06 13:8AF6: 06        .byte $06    ; <か>
- D - I - - 0x018B07 13:8AF7: 0A        .byte $0A    ; <こ>
- D - I - - 0x018B08 13:8AF8: 07        .byte $07    ; <き>
- D - I - - 0x018B09 13:8AF9: 09        .byte $09    ; <け>
- D - I - - 0x018B0A 13:8AFA: 08        .byte $08    ; <く>
- D - I - - 0x018B0B 13:8AFB: 08        .byte $08    ; <く>
- D - I - - 0x018B0C 13:8AFC: 09        .byte $09    ; <け>
- D - I - - 0x018B0D 13:8AFD: 07        .byte $07    ; <き>
- D - I - - 0x018B0E 13:8AFE: 0A        .byte $0A    ; <こ>
- D - I - - 0x018B0F 13:8AFF: 06        .byte $06    ; <か>
- D - I - - 0x018B10 13:8B00: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B11 13:8B01: 05        .byte $05    ; <お>
- D - I - - 0x018B12 13:8B02: 0C        .byte $0C    ; <し>
- D - I - - 0x018B13 13:8B03: 04        .byte $04    ; <え>
- D - I - - 0x018B14 13:8B04: 0D        .byte $0D    ; <す>
- D - I - - 0x018B15 13:8B05: 03        .byte $03    ; <う>
- D - I - - 0x018B16 13:8B06: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B17 13:8B07: 02        .byte $02    ; <い>
- D - I - - 0x018B18 13:8B08: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B19 13:8B09: 01        .byte $01    ; <あ>
- - - - - - 0x018B1A 13:8B0A: FF        .byte $FF
- - - - - - 0x018B1B 13:8B0B: 00        .byte $00

off_8B0C_15:
- D - I - - 0x018B1C 13:8B0C: 02        .byte $02    ; <い>
- D - I - - 0x018B1D 13:8B0D: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B1E 13:8B0E: 02        .byte $02    ; <い>
- D - I - - 0x018B1F 13:8B0F: 0D        .byte $0D    ; <す>
- D - I - - 0x018B20 13:8B10: 02        .byte $02    ; <い>
- D - I - - 0x018B21 13:8B11: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B22 13:8B12: 02        .byte $02    ; <い>
- D - I - - 0x018B23 13:8B13: 09        .byte $09    ; <け>
- D - I - - 0x018B24 13:8B14: 02        .byte $02    ; <い>
- D - I - - 0x018B25 13:8B15: 07        .byte $07    ; <き>
- D - I - - 0x018B26 13:8B16: 02        .byte $02    ; <い>
- D - I - - 0x018B27 13:8B17: 05        .byte $05    ; <お>
- D - I - - 0x018B28 13:8B18: 02        .byte $02    ; <い>
- D - I - - 0x018B29 13:8B19: 03        .byte $03    ; <う>
- D - I - - 0x018B2A 13:8B1A: 02        .byte $02    ; <い>
- D - I - - 0x018B2B 13:8B1B: 01        .byte $01    ; <あ>
- D - I - - 0x018B2C 13:8B1C: FF        .byte $FF
- D - I - - 0x018B2D 13:8B1D: 00        .byte $00

off_8B1E_16:
- D - I - - 0x018B2E 13:8B1E: 01        .byte $01    ; <あ>
- D - I - - 0x018B2F 13:8B1F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B30 13:8B20: 01        .byte $01    ; <あ>
- D - I - - 0x018B31 13:8B21: 0D        .byte $0D    ; <す>
- D - I - - 0x018B32 13:8B22: 01        .byte $01    ; <あ>
- D - I - - 0x018B33 13:8B23: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B34 13:8B24: 01        .byte $01    ; <あ>
- D - I - - 0x018B35 13:8B25: 09        .byte $09    ; <け>
- D - I - - 0x018B36 13:8B26: 01        .byte $01    ; <あ>
- D - I - - 0x018B37 13:8B27: 07        .byte $07    ; <き>
- D - I - - 0x018B38 13:8B28: 01        .byte $01    ; <あ>
- D - I - - 0x018B39 13:8B29: 05        .byte $05    ; <お>
- D - I - - 0x018B3A 13:8B2A: 01        .byte $01    ; <あ>
- D - I - - 0x018B3B 13:8B2B: 03        .byte $03    ; <う>
- D - I - - 0x018B3C 13:8B2C: 01        .byte $01    ; <あ>
- D - I - - 0x018B3D 13:8B2D: 01        .byte $01    ; <あ>
- D - I - - 0x018B3E 13:8B2E: FF        .byte $FF
- D - I - - 0x018B3F 13:8B2F: 00        .byte $00

off_8B30_17:
- D - I - - 0x018B40 13:8B30: FF        .byte $FF
- D - I - - 0x018B41 13:8B31: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B42 13:8B32: FF        .byte $FF
- D - I - - 0x018B43 13:8B33: 00        .byte $00

off_8B34_21:
- D - I - - 0x018B44 13:8B34: 0C        .byte $0C    ; <し>
- D - I - - 0x018B45 13:8B35: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B46 13:8B36: 03        .byte $03    ; <う>
- D - I - - 0x018B47 13:8B37: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B48 13:8B38: 03        .byte $03    ; <う>
- D - I - - 0x018B49 13:8B39: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B4A 13:8B3A: 03        .byte $03    ; <う>
- D - I - - 0x018B4B 13:8B3B: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B4C 13:8B3C: 04        .byte $04    ; <え>
- D - I - - 0x018B4D 13:8B3D: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B4E 13:8B3E: 04        .byte $04    ; <え>
- D - I - - 0x018B4F 13:8B3F: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B50 13:8B40: 04        .byte $04    ; <え>
- D - I - - 0x018B51 13:8B41: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B52 13:8B42: 04        .byte $04    ; <え>
- D - I - - 0x018B53 13:8B43: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B54 13:8B44: 05        .byte $05    ; <お>
- D - I - - 0x018B55 13:8B45: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B56 13:8B46: 05        .byte $05    ; <お>
- D - I - - 0x018B57 13:8B47: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B58 13:8B48: 05        .byte $05    ; <お>
- D - I - - 0x018B59 13:8B49: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B5A 13:8B4A: 05        .byte $05    ; <お>
- - - - - - 0x018B5B 13:8B4B: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B5C 13:8B4C: 05        .byte $05    ; <お>
- - - - - - 0x018B5D 13:8B4D: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B5E 13:8B4E: 05        .byte $05    ; <お>
- - - - - - 0x018B5F 13:8B4F: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B60 13:8B50: 05        .byte $05    ; <お>
- - - - - - 0x018B61 13:8B51: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B62 13:8B52: 05        .byte $05    ; <お>
- - - - - - 0x018B63 13:8B53: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B64 13:8B54: 05        .byte $05    ; <お>
- - - - - - 0x018B65 13:8B55: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B66 13:8B56: 05        .byte $05    ; <お>
- - - - - - 0x018B67 13:8B57: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B68 13:8B58: 05        .byte $05    ; <お>
- - - - - - 0x018B69 13:8B59: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B6A 13:8B5A: 05        .byte $05    ; <お>
- - - - - - 0x018B6B 13:8B5B: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B6C 13:8B5C: 05        .byte $05    ; <お>
- - - - - - 0x018B6D 13:8B5D: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B6E 13:8B5E: 05        .byte $05    ; <お>
- - - - - - 0x018B6F 13:8B5F: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B70 13:8B60: 05        .byte $05    ; <お>
- - - - - - 0x018B71 13:8B61: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B72 13:8B62: 05        .byte $05    ; <お>
- - - - - - 0x018B73 13:8B63: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B74 13:8B64: 06        .byte $06    ; <か>
- - - - - - 0x018B75 13:8B65: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B76 13:8B66: 06        .byte $06    ; <か>
- - - - - - 0x018B77 13:8B67: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B78 13:8B68: 06        .byte $06    ; <か>
- - - - - - 0x018B79 13:8B69: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B7A 13:8B6A: 06        .byte $06    ; <か>
- - - - - - 0x018B7B 13:8B6B: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B7C 13:8B6C: 07        .byte $07    ; <き>
- - - - - - 0x018B7D 13:8B6D: 0F        .byte $0F    ; <そ>
- - - - - - 0x018B7E 13:8B6E: 07        .byte $07    ; <き>
- - - - - - 0x018B7F 13:8B6F: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B80 13:8B70: 07        .byte $07    ; <き>
- - - - - - 0x018B81 13:8B71: 0D        .byte $0D    ; <す>
- - - - - - 0x018B82 13:8B72: 08        .byte $08    ; <く>
- - - - - - 0x018B83 13:8B73: 0C        .byte $0C    ; <し>
- - - - - - 0x018B84 13:8B74: FF        .byte $FF
- - - - - - 0x018B85 13:8B75: 00        .byte $00

off_8B76_30:
- D - I - - 0x018B86 13:8B76: 01        .byte $01    ; <あ>
- D - I - - 0x018B87 13:8B77: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B88 13:8B78: 01        .byte $01    ; <あ>
- D - I - - 0x018B89 13:8B79: 0C        .byte $0C    ; <し>
- D - I - - 0x018B8A 13:8B7A: 01        .byte $01    ; <あ>
- D - I - - 0x018B8B 13:8B7B: 0D        .byte $0D    ; <す>
- D - I - - 0x018B8C 13:8B7C: 01        .byte $01    ; <あ>
- D - I - - 0x018B8D 13:8B7D: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B8E 13:8B7E: 01        .byte $01    ; <あ>
- D - I - - 0x018B8F 13:8B7F: 0F        .byte $0F    ; <そ>
- D - I - - 0x018B90 13:8B80: 01        .byte $01    ; <あ>
- D - I - - 0x018B91 13:8B81: 0E        .byte $0E    ; <せ>
- D - I - - 0x018B92 13:8B82: 01        .byte $01    ; <あ>
- D - I - - 0x018B93 13:8B83: 0D        .byte $0D    ; <す>
- D - I - - 0x018B94 13:8B84: 01        .byte $01    ; <あ>
- D - I - - 0x018B95 13:8B85: 0C        .byte $0C    ; <し>
- D - I - - 0x018B96 13:8B86: 01        .byte $01    ; <あ>
- D - I - - 0x018B97 13:8B87: 0B        .byte $0B    ; <さ>
- D - I - - 0x018B98 13:8B88: 01        .byte $01    ; <あ>
- D - I - - 0x018B99 13:8B89: 0C        .byte $0C    ; <し>
- D - I - - 0x018B9A 13:8B8A: 01        .byte $01    ; <あ>
- D - I - - 0x018B9B 13:8B8B: 0D        .byte $0D    ; <す>
- - - - - - 0x018B9C 13:8B8C: 01        .byte $01    ; <あ>
- - - - - - 0x018B9D 13:8B8D: 0E        .byte $0E    ; <せ>
- - - - - - 0x018B9E 13:8B8E: 01        .byte $01    ; <あ>
- - - - - - 0x018B9F 13:8B8F: 0F        .byte $0F    ; <そ>
- - - - - - 0x018BA0 13:8B90: 01        .byte $01    ; <あ>
- - - - - - 0x018BA1 13:8B91: 0E        .byte $0E    ; <せ>
- - - - - - 0x018BA2 13:8B92: 01        .byte $01    ; <あ>
- - - - - - 0x018BA3 13:8B93: 0D        .byte $0D    ; <す>
- - - - - - 0x018BA4 13:8B94: 01        .byte $01    ; <あ>
- - - - - - 0x018BA5 13:8B95: 0C        .byte $0C    ; <し>
- - - - - - 0x018BA6 13:8B96: 01        .byte $01    ; <あ>
- - - - - - 0x018BA7 13:8B97: 0B        .byte $0B    ; <さ>
- - - - - - 0x018BA8 13:8B98: 01        .byte $01    ; <あ>
- - - - - - 0x018BA9 13:8B99: 0C        .byte $0C    ; <し>
- - - - - - 0x018BAA 13:8B9A: 01        .byte $01    ; <あ>
- - - - - - 0x018BAB 13:8B9B: 0D        .byte $0D    ; <す>
- - - - - - 0x018BAC 13:8B9C: 01        .byte $01    ; <あ>
- - - - - - 0x018BAD 13:8B9D: 0E        .byte $0E    ; <せ>
- - - - - - 0x018BAE 13:8B9E: 01        .byte $01    ; <あ>
- - - - - - 0x018BAF 13:8B9F: 0F        .byte $0F    ; <そ>
- - - - - - 0x018BB0 13:8BA0: 01        .byte $01    ; <あ>
- - - - - - 0x018BB1 13:8BA1: 0E        .byte $0E    ; <せ>
- - - - - - 0x018BB2 13:8BA2: 01        .byte $01    ; <あ>
- - - - - - 0x018BB3 13:8BA3: 0D        .byte $0D    ; <す>
- - - - - - 0x018BB4 13:8BA4: 01        .byte $01    ; <あ>
- - - - - - 0x018BB5 13:8BA5: 0C        .byte $0C    ; <し>
- - - - - - 0x018BB6 13:8BA6: 01        .byte $01    ; <あ>
- - - - - - 0x018BB7 13:8BA7: 0B        .byte $0B    ; <さ>
- - - - - - 0x018BB8 13:8BA8: 01        .byte $01    ; <あ>
- - - - - - 0x018BB9 13:8BA9: 0C        .byte $0C    ; <し>
- - - - - - 0x018BBA 13:8BAA: 01        .byte $01    ; <あ>
- - - - - - 0x018BBB 13:8BAB: 0D        .byte $0D    ; <す>
- - - - - - 0x018BBC 13:8BAC: 01        .byte $01    ; <あ>
- - - - - - 0x018BBD 13:8BAD: 0E        .byte $0E    ; <せ>
- - - - - - 0x018BBE 13:8BAE: 01        .byte $01    ; <あ>
- - - - - - 0x018BBF 13:8BAF: 0F        .byte $0F    ; <そ>
- - - - - - 0x018BC0 13:8BB0: 01        .byte $01    ; <あ>
- - - - - - 0x018BC1 13:8BB1: 0E        .byte $0E    ; <せ>
- - - - - - 0x018BC2 13:8BB2: 01        .byte $01    ; <あ>
- - - - - - 0x018BC3 13:8BB3: 0D        .byte $0D    ; <す>
- - - - - - 0x018BC4 13:8BB4: 01        .byte $01    ; <あ>
- - - - - - 0x018BC5 13:8BB5: 0C        .byte $0C    ; <し>

off_8BB6_18:
- D - I - - 0x018BC6 13:8BB6: 03        .byte $03    ; <う>
- D - I - - 0x018BC7 13:8BB7: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BC8 13:8BB8: FF        .byte $FF
- D - I - - 0x018BC9 13:8BB9: 00        .byte $00

off_8BBA_19:
- D - I - - 0x018BCA 13:8BBA: 04        .byte $04    ; <え>
- D - I - - 0x018BCB 13:8BBB: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BCC 13:8BBC: FF        .byte $FF
- D - I - - 0x018BCD 13:8BBD: 00        .byte $00

off_8BBE_1A:
- D - I - - 0x018BCE 13:8BBE: 05        .byte $05    ; <お>
- D - I - - 0x018BCF 13:8BBF: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BD0 13:8BC0: FF        .byte $FF
- D - I - - 0x018BD1 13:8BC1: 00        .byte $00

off_8BC2_1B:
- D - I - - 0x018BD2 13:8BC2: 06        .byte $06    ; <か>
- D - I - - 0x018BD3 13:8BC3: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BD4 13:8BC4: FF        .byte $FF
- D - I - - 0x018BD5 13:8BC5: 00        .byte $00

off_8BC6_1C:
- D - I - - 0x018BD6 13:8BC6: 07        .byte $07    ; <き>
- D - I - - 0x018BD7 13:8BC7: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BD8 13:8BC8: FF        .byte $FF
- D - I - - 0x018BD9 13:8BC9: 00        .byte $00

off_8BCA_1D:
- D - I - - 0x018BDA 13:8BCA: 08        .byte $08    ; <く>
- D - I - - 0x018BDB 13:8BCB: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BDC 13:8BCC: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BDD 13:8BCD: 00        .byte $00

off_8BCE_1E:
- D - I - - 0x018BDE 13:8BCE: 0A        .byte $0A    ; <こ>
- D - I - - 0x018BDF 13:8BCF: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BE0 13:8BD0: FF        .byte $FF
- D - I - - 0x018BE1 13:8BD1: 00        .byte $00

off_8BD2_1F:
- D - I - - 0x018BE2 13:8BD2: 0C        .byte $0C    ; <し>
- D - I - - 0x018BE3 13:8BD3: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BE4 13:8BD4: FF        .byte $FF
- D - I - - 0x018BE5 13:8BD5: 00        .byte $00

off_8BD6_20:
- D - I - - 0x018BE6 13:8BD6: 0E        .byte $0E    ; <せ>
- D - I - - 0x018BE7 13:8BD7: 0F        .byte $0F    ; <そ>
- D - I - - 0x018BE8 13:8BD8: FF        .byte $FF
- D - I - - 0x018BE9 13:8BD9: 00        .byte $00



tbl_8BDA_таблица_звуков:
; номера звуков начинаются с 01, а не с 00, но перед чтением таблицы номер звука уменьшается на 01
- D - - - - 0x018BEA 13:8BDA: 42 8E     .word _off001_8E42_01_выключить_музыку_и_звуки
- D - - - - 0x018BEC 13:8BDC: 5B 8E     .word _off000_8E5B_02_выключить_звуки
- D - - - - 0x018BEE 13:8BDE: 68 8E     .word _off000_8E68_03_обычный_полет_мяча
- D - - - - 0x018BF0 13:8BE0: 89 8E     .word _off000_8E89_04_полет_спешала
- D - - - - 0x018BF2 13:8BE2: CF 8E     .word _off000_8ECF_05_полет_спешала
- D - - - - 0x018BF4 13:8BE4: AD 8F     .word _off000_8FAD_06_полет_спешала
- D - - - - 0x018BF6 13:8BE6: 14 8F     .word _off000_8F14_07_полет_спешала
- D - - - - 0x018BF8 13:8BE8: A4 90     .word _off000_90A4_08_полет_спешала
- D - - - - 0x018BFA 13:8BEA: 35 92     .word _off000_9235_09_полет_спешала
- D - - - - 0x018BFC 13:8BEC: CC 96     .word _off000_96CC_0A_полет_спешала
- D - - - - 0x018BFE 13:8BEE: 49 97     .word _off000_9749_0B_полет_спешала
- D - - - - 0x018C00 13:8BF0: 81 91     .word _off000_9181_0C_полет_спешала
- D - - - - 0x018C02 13:8BF2: EA 91     .word _off000_91EA_0D_исчезновение_мяча
- D - - - - 0x018C04 13:8BF4: 1D 91     .word _off000_911D_0E_полет_спешала
- D - - - - 0x018C06 13:8BF6: 79 90     .word _off000_9079_0F_полет_спешала
- D - - - - 0x018C08 13:8BF8: 5A 8F     .word _off000_8F5A_10_полет_спешала
- D - - - - 0x018C0A 13:8BFA: BB 8F     .word _off000_8FBB_11_полет_спешала
- D - - - - 0x018C0C 13:8BFC: 2D 94     .word _off000_942D_12_обычный_удар_с_земли
- D - - - - 0x018C0E 13:8BFE: 62 94     .word _off000_9462_13_сильный_удар_с_земли
- D - - - - 0x018C10 13:8C00: C6 94     .word _off000_94C6_14_удар_с_ноги
- D - - - - 0x018C12 13:8C02: E4 9D     .word _off000_9DE4_15_замах_мацуямы
- D - - - - 0x018C14 13:8C04: FD 9D     .word _off000_9DFD_16_замах_цубасы
- D - - - - 0x018C16 13:8C06: 59 93     .word _off000_9359_17_замах_соды
- D - - - - 0x018C18 13:8C08: 53 96     .word _off000_9653_18_замах_с_красным_фоном
- D - - - - 0x018C1A 13:8C0A: 7F 9E     .word _off000_9E7F_19_замах_удар_с_земли
- D - - - - 0x018C1C 13:8C0C: 77 97     .word _off000_9777_1A_удар_оверхед
- D - - - - 0x018C1E 13:8C0E: 1E 9B     .word _off000_9B1E_1B_удар_головой
- D - - - - 0x018C20 13:8C10: D3 9E     .word _off000_9ED3_1C
- D - - - - 0x018C22 13:8C12: CD 9A     .word _off000_9ACD_1D_удар_соды
- D - - - - 0x018C24 13:8C14: 50 9B     .word _off000_9B50_1E
- D - - - - 0x018C26 13:8C16: 9D 9B     .word _off000_9B9D_1F
- D - - - - 0x018C28 13:8C18: 98 9E     .word _off000_9E98_20
- D - - - - 0x018C2A 13:8C1A: B4 BF     .word _off000_0x01BFC4_21
- D - - - - 0x018C2C 13:8C1C: F7 9E     .word _off000_9EF7_22
- D - - - - 0x018C2E 13:8C1E: 2D 95     .word _off000_952D_23_мощный_удар_с_земли
- D - - - - 0x018C30 13:8C20: 57 95     .word _off000_9557_24_полет_циклона
- D - - - - 0x018C32 13:8C22: EE 9C     .word _off000_9CEE_25_прыжок
- D - - - - 0x018C34 13:8C24: 58 9D     .word _off000_9D58_26_разгон_перед_подкатом
- D - - - - 0x018C36 13:8C26: 73 9D     .word _off000_9D73_27_силовой_дриблинг
- D - - - - 0x018C38 13:8C28: 55 9A     .word _off000_9A55_28_подкат
- D - - - - 0x018C3A 13:8C2A: D6 97     .word _off000_97D6_29
- D - - - - 0x018C3C 13:8C2C: 77 9A     .word _off000_9A77_2A_ловля_мяча          ; также перехват мяча ногой когда он приклеивается
- D - - - - 0x018C3E 13:8C2E: 53 94     .word _off000_9453_2B_отбитие_мяча        ; также принятие на ногу
- D - - - - 0x018C40 13:8C30: 03 98     .word _off000_9803_2C_принятие_мяча
- D - - - - 0x018C42 13:8C32: 9A 9A     .word _off000_9A9A_2D_удар_мяча_об_живот
- D - - - - 0x018C44 13:8C34: 9D 97     .word _off000_979D_2E
- D - - - - 0x018C46 13:8C36: 1B 98     .word _off000_981B_2F
- D - - - - 0x018C48 13:8C38: 13 9C     .word _off000_9C13_30_гроза
- - - - - - 0x018C4A 13:8C3A: FE 9F     .word $0000
; музыка
- D - - - - 0x018C4C 13:8C3C: 00 A0     .word _off001_0x01A010_32_музыка_добавочное_время
- D - - - - 0x018C4E 13:8C3E: AA A2     .word _off001_0x01A2BA_33_музыка_пенальти
- D - - - - 0x018C50 13:8C40: 0B A4     .word _off001_0x01A41B_34_музыка_соперник_национальный_чемпионат
- D - - - - 0x018C52 13:8C42: C6 A5     .word _off001_0x01A5D6_35_музыка_соперник_кубок_рио
- D - - - - 0x018C54 13:8C44: 8D B6     .word _off001_0x01B69D_36_музыка_соперник_4_1
- D - - - - 0x018C56 13:8C46: 61 A7     .word _off001_0x01A771_37_музыка_тохо
- D - - - - 0x018C58 13:8C48: 79 AC     .word _off001_0x01AC89_38_музыка_германия
- D - - - - 0x018C5A 13:8C4A: FA AF     .word _off001_0x01B00A_39_музыка_нанкацу
- D - - - - 0x018C5C 13:8C4C: E0 B1     .word _off001_0x01B1F0_3A_музыка_соперник_азия
- D - - - - 0x018C5E 13:8C4E: 2D B3     .word _off001_0x01B33D_3B_музыка_соперник_кубок_японии
- D - - - - 0x018C60 13:8C50: 14 B5     .word _off001_0x01B524_3C_музыка_сан_паулу
- D - - - - 0x018C62 13:8C52: 2C B9     .word _off001_0x01B93C_3D_музыка_соперник_кубок_мира
- D - - - - 0x018C64 13:8C54: 9E BB     .word _off001_0x01BBAE_3E_музыка_соперник_бразилия
- D - - - - 0x018C66 13:8C56: 29 B7     .word _off001_0x01B739_3F_музыка_япония
- D - - - - 0x018C68 13:8C58: B3 BD     .word _off001_0x01BDC3_40_музыка_соперник_фламенго
- D - - - - 0x018C6A 13:8C5A: 2A AB     .word _off001_0x01AB3A_41_музыка_гол_в_ворота_соперника
- D - - - - 0x018C6C 13:8C5C: D5 AB     .word _off001_0x01ABE5_42_музыка_гол_в_ворота_команды
- D - - - - 0x018C6E 13:8C5E: EA B8     .word _off001_0x01B8FA_43_музыка_нарушение
- D - - - - 0x018C70 13:8C60: C0 8C     .word _off001_8CC0_44_музыка_ожидание_разводки
- D - - - - 0x018C72 13:8C62: 64 A9     .word _off001_0x01C974_45_музыка_логотипа
- D - - - - 0x018C74 13:8C64: 85 AA     .word _off001_0x01CA95_46_музыка_поля
- D - - - - 0x018C76 13:8C66: 2A AC     .word _off001_0x01CC3A_47
- D - - - - 0x018C78 13:8C68: 7A B0     .word _off001_0x01D08A_48_музыка_романтика
- D - - - - 0x018C7A 13:8C6A: F3 B2     .word _off001_0x01D303_49_музыка_тревожная
- - - - - - 0x018C7C 13:8C6C: 42 8E     .word _off001_8E42_01_выключить_музыку_и_звуки
- D - - - - 0x018C7E 13:8C6E: E8 AD     .word _off001_0x01CDF8_4B_музыка_дождь
- D - - - - 0x018C80 13:8C70: 99 A3     .word _off001_0x01C3A9_4C_музыка_последний_матч
- D - - - - 0x018C82 13:8C72: 00 A0     .word _off001_0x01C010_4D
- D - - - - 0x018C84 13:8C74: 1F B8     .word _off001_0x01D82F_4E
- D - - - - 0x018C86 13:8C76: 9C B3     .word _off001_0x01D3AC_4F_музыка_победа_над_бразилией
- D - - - - 0x018C88 13:8C78: 01 BB     .word _off001_0x01DB11_50_музыка_романтика
- D - - - - 0x018C8A 13:8C7A: A8 AA     .word _off001_0x01EAB8_51_музыка_поле
- D - - - - 0x018C8C 13:8C7C: 57 A1     .word _off001_0x01E167_52_мелодия_неожиданность
- D - - - - 0x018C8E 13:8C7E: E0 A5     .word _off001_0x01E5F0_53
- D - - - - 0x018C90 13:8C80: 48 A8     .word _off001_0x01E858_54_музыка_коимбра
- D - - - - 0x018C92 13:8C82: 0F A3     .word _off001_0x01E31F_55_музыка_меню
- D - - - - 0x018C94 13:8C84: D9 A7     .word _off001_0x01E7E9_56_мелодия_проигрыш
- D - - - - 0x018C96 13:8C86: F8 A1     .word _off001_0x01E208_57
- D - - - - 0x018C98 13:8C88: AD B7     .word _off001_0x01F7BD_58_музыка_заставка
- D - - - - 0x018C9A 13:8C8A: 59 AC     .word _off001_0x01EC69_59_музыка_титры
- D - - - - 0x018C9C 13:8C8C: 00 A0     .word _off001_0x01E010_5A
- - - - - - 0x018C9E 13:8C8E: FE 9F     .word $0000
- - - - - - 0x018CA0 13:8C90: FE 9F     .word $0000
; звуки
- D - - - - 0x018CA2 13:8C92: 74 98     .word _off000_9874_5D_звук_гол
- D - - - - 0x018CA4 13:8C94: F6 90     .word _off000_90F6_5E_полет_спешала
- D - - - - 0x018CA6 13:8C96: 46 9F     .word _off000_9F46_5F_полет_спешала
- D - - - - 0x018CA8 13:8C98: 7E 98     .word _off000_987E_60_звук_гол
- D - - - - 0x018CAA 13:8C9A: BD 98     .word _off000_98BD_61_звук_рваная_сетка
- D - - - - 0x018CAC 13:8C9C: 44 99     .word _off000_9944_62_звук_громкие_зрители
- D - - - - 0x018CAE 13:8C9E: 8E 99     .word _off000_998E_63_звук_штанга
- D - - - - 0x018CB0 13:8CA0: CB 9C     .word _off000_9CCB_64_звук_отскок_мяча_от_земли
- D - - - - 0x018CB2 13:8CA2: B4 99     .word _off000_99B4_65_звук_рваный_мяч
- D - - - - 0x018CB4 13:8CA4: FC 99     .word _off000_99FC_66_звук_свисток
- D - - - - 0x018CB6 13:8CA6: 1E 9A     .word _off000_9A1E_67_свисток_с_нарушением
- D - - - - 0x018CB8 13:8CA8: E7 99     .word _off000_99E7_68_звук_дриблинг
- D - - - - 0x018CBA 13:8CAA: 9C 9F     .word _off000_9F9C_69_звук_тихие_зрители
- D - - - - 0x018CBC 13:8CAC: 35 9C     .word _off000_9C35_6A_звук_самолет
- D - - - - 0x018CBE 13:8CAE: CA 9F     .word _off000_9FCA_6B_звук_замах_джаиро
- D - - - - 0x018CC0 13:8CB0: F3 9B     .word _off000_9BF3_6C_звук_часы_конец
- D - - - - 0x018CC2 13:8CB2: 08 9D     .word _off000_9D08_6D
- D - - - - 0x018CC4 13:8CB4: 5D 9E     .word _off000_9E5D_6E_звук_часы_тикают
- D - - - - 0x018CC6 13:8CB6: 21 9E     .word _off000_9E21_6F_мелодия_новый_уровень
- D - - - - 0x018CC8 13:8CB8: B5 9C     .word _off000_9CB5_70
- - - - - - 0x018CCA 13:8CBA: B5 9C     .word _off000_9CB5_70
- - - - - - 0x018CCC 13:8CBC: B5 9C     .word _off000_9CB5_70
- - - - - - 0x018CCE 13:8CBE: 42 8E     .word _off001_8E42_01_выключить_музыку_и_звуки

; прыжки в 0x0184EA
; E0 - 
; E1 - 
; E2 - 
; E3 - громкость
; E4 - 
; E5 - 
; E6 - 
; E7 - 
; E8 - повторить цикл (для бесконечной музыки)
; E9 - повторить отрезок
; EA - 
; EB - 
; EC - 
; ED - 
; EE - 
; EF - 
; F0 - 
; F1 - 
; F2 - 
; F3 - 
; F4 - 
; F5 - 
; F6 - 
; F7 - 
; F8 - 
; F9 - 
; FA - 
; FB - 
; FC - 
; FD - 
; FE - 
; FF - 

_off001_8CC0_44_музыка_ожидание_разводки:
- D - I - - 0x018CD0 13:8CC0: 00        .byte $00
- D - I - - 0x018CD1 13:8CC1: D2 8C     .word off_8CD2_выкл
- D - I - - 0x018CD3 13:8CC3: 01        .byte $01
- D - I - - 0x018CD4 13:8CC4: D2 8C     .word off_8CD2_выкл
- D - I - - 0x018CD6 13:8CC6: 04        .byte $04
- D - I - - 0x018CD7 13:8CC7: D3 8C     .word off_8CD3_44_04
- D - I - - 0x018CD9 13:8CC9: 05        .byte $05
- D - I - - 0x018CDA 13:8CCA: ED BE     .word off_0x01DEFD_44_05
- D - I - - 0x018CDC 13:8CCC: 06        .byte $06
- D - I - - 0x018CDD 13:8CCD: 46 BF     .word off_0x01DF56_44_06
- D - I - - 0x018CDF 13:8CCF: 07        .byte $07
- D - I - - 0x018CE0 13:8CD0: B7 BF     .word off_0x01DFC7_44_07
off_8CD2_выкл:
- D - I - - 0x018CE2 13:8CD2: FF        .byte $FF



off_8CD3_44_04:
- D - I - - 0x018CE3 13:8CD3: E0        .byte $E0
- D - I - - 0x018CE4 13:8CD4: 31        .byte $31
- D - I - - 0x018CE5 13:8CD5: E2        .byte $E2
- D - I - - 0x018CE6 13:8CD6: 00        .byte $00
- D - I - - 0x018CE7 13:8CD7: E3        .byte $E3
- D - I - - 0x018CE8 13:8CD8: 0F        .byte $0F
- D - I - - 0x018CE9 13:8CD9: AE        .byte $AE
- D - I - - 0x018CEA 13:8CDA: 0C        .byte $0C
off_8CDB_повтор:
- D - I - - 0x018CEB 13:8CDB: E0        .byte $E0
- D - I - - 0x018CEC 13:8CDC: 31        .byte $31
- D - I - - 0x018CED 13:8CDD: 90        .byte $90
- D - I - - 0x018CEE 13:8CDE: 0C        .byte $0C
- D - I - - 0x018CEF 13:8CDF: E3        .byte $E3
- D - I - - 0x018CF0 13:8CE0: 06        .byte $06
- D - I - - 0x018CF1 13:8CE1: 84        .byte $84
- D - I - - 0x018CF2 13:8CE2: 33        .byte $33
- D - I - - 0x018CF3 13:8CE3: F3        .byte $F3
- D - I - - 0x018CF4 13:8CE4: 8E        .byte $8E
- D - I - - 0x018CF5 13:8CE5: 34        .byte $34
- D - I - - 0x018CF6 13:8CE6: F4        .byte $F4
- D - I - - 0x018CF7 13:8CE7: 83        .byte $83
- D - I - - 0x018CF8 13:8CE8: 34        .byte $34
- D - I - - 0x018CF9 13:8CE9: F3        .byte $F3
- D - I - - 0x018CFA 13:8CEA: 87        .byte $87
- D - I - - 0x018CFB 13:8CEB: 34        .byte $34
- D - I - - 0x018CFC 13:8CEC: ED        .byte $ED
- D - I - - 0x018CFD 13:8CED: 01        .byte $01
- D - I - - 0x018CFE 13:8CEE: 8A        .byte $8A
- D - I - - 0x018CFF 13:8CEF: 34        .byte $34
- D - I - - 0x018D00 13:8CF0: ED        .byte $ED
- D - I - - 0x018D01 13:8CF1: 02        .byte $02
- D - I - - 0x018D02 13:8CF2: 90        .byte $90
- D - I - - 0x018D03 13:8CF3: 34        .byte $34
- D - I - - 0x018D04 13:8CF4: F4        .byte $F4
- D - I - - 0x018D05 13:8CF5: EF        .byte $EF
- D - I - - 0x018D06 13:8CF6: 83        .byte $83
- D - I - - 0x018D07 13:8CF7: 33        .byte $33
- D - I - - 0x018D08 13:8CF8: F3        .byte $F3
- D - I - - 0x018D09 13:8CF9: 87        .byte $87
- D - I - - 0x018D0A 13:8CFA: 34        .byte $34
- D - I - - 0x018D0B 13:8CFB: F4        .byte $F4
- D - I - - 0x018D0C 13:8CFC: 8A        .byte $8A
- D - I - - 0x018D0D 13:8CFD: 34        .byte $34
- D - I - - 0x018D0E 13:8CFE: 34        .byte $34
- D - I - - 0x018D0F 13:8CFF: 34        .byte $34
- D - I - - 0x018D10 13:8D00: 34        .byte $34
- D - I - - 0x018D11 13:8D01: 34        .byte $34
- D - I - - 0x018D12 13:8D02: 37        .byte $37
- D - I - - 0x018D13 13:8D03: 34        .byte $34
- D - I - - 0x018D14 13:8D04: 0C        .byte $0C
- D - I - - 0x018D15 13:8D05: 83        .byte $83
- D - I - - 0x018D16 13:8D06: 33        .byte $33
- D - I - - 0x018D17 13:8D07: F3        .byte $F3
- D - I - - 0x018D18 13:8D08: 87        .byte $87
- D - I - - 0x018D19 13:8D09: 34        .byte $34
- D - I - - 0x018D1A 13:8D0A: F4        .byte $F4
- D - I - - 0x018D1B 13:8D0B: 8A        .byte $8A
- D - I - - 0x018D1C 13:8D0C: 34        .byte $34
- D - I - - 0x018D1D 13:8D0D: 34        .byte $34
- D - I - - 0x018D1E 13:8D0E: 83        .byte $83
- D - I - - 0x018D1F 13:8D0F: 33        .byte $33
- D - I - - 0x018D20 13:8D10: F3        .byte $F3
- D - I - - 0x018D21 13:8D11: 87        .byte $87
- D - I - - 0x018D22 13:8D12: 34        .byte $34
- D - I - - 0x018D23 13:8D13: ED        .byte $ED
- D - I - - 0x018D24 13:8D14: 01        .byte $01
- D - I - - 0x018D25 13:8D15: 8A        .byte $8A
- D - I - - 0x018D26 13:8D16: 34        .byte $34
- D - I - - 0x018D27 13:8D17: ED        .byte $ED
- D - I - - 0x018D28 13:8D18: 02        .byte $02
- D - I - - 0x018D29 13:8D19: 90        .byte $90
- D - I - - 0x018D2A 13:8D1A: 34        .byte $34
- D - I - - 0x018D2B 13:8D1B: F4        .byte $F4
- D - I - - 0x018D2C 13:8D1C: EF        .byte $EF
- D - I - - 0x018D2D 13:8D1D: 8A        .byte $8A
- D - I - - 0x018D2E 13:8D1E: 34        .byte $34
- D - I - - 0x018D2F 13:8D1F: 34        .byte $34
- D - I - - 0x018D30 13:8D20: 83        .byte $83
- D - I - - 0x018D31 13:8D21: 36        .byte $36
- D - I - - 0x018D32 13:8D22: F3        .byte $F3
- D - I - - 0x018D33 13:8D23: 87        .byte $87
- D - I - - 0x018D34 13:8D24: 37        .byte $37
- D - I - - 0x018D35 13:8D25: F4        .byte $F4
- D - I - - 0x018D36 13:8D26: 8A        .byte $8A
- D - I - - 0x018D37 13:8D27: 34        .byte $34
- D - I - - 0x018D38 13:8D28: F3        .byte $F3
- D - I - - 0x018D39 13:8D29: ED        .byte $ED
- D - I - - 0x018D3A 13:8D2A: 01        .byte $01
- D - I - - 0x018D3B 13:8D2B: 34        .byte $34
- D - I - - 0x018D3C 13:8D2C: ED        .byte $ED
- D - I - - 0x018D3D 13:8D2D: 02        .byte $02
- D - I - - 0x018D3E 13:8D2E: 90        .byte $90
- D - I - - 0x018D3F 13:8D2F: 34        .byte $34
- D - I - - 0x018D40 13:8D30: F4        .byte $F4
- D - I - - 0x018D41 13:8D31: EF        .byte $EF
- D - I - - 0x018D42 13:8D32: 95        .byte $95
- D - I - - 0x018D43 13:8D33: 0C        .byte $0C
- D - I - - 0x018D44 13:8D34: 8A        .byte $8A
- D - I - - 0x018D45 13:8D35: 35        .byte $35
- D - I - - 0x018D46 13:8D36: 35        .byte $35
- D - I - - 0x018D47 13:8D37: 35        .byte $35
- D - I - - 0x018D48 13:8D38: 90        .byte $90
- D - I - - 0x018D49 13:8D39: 35        .byte $35
- D - I - - 0x018D4A 13:8D3A: 8A        .byte $8A
- D - I - - 0x018D4B 13:8D3B: 0C        .byte $0C
- D - I - - 0x018D4C 13:8D3C: 83        .byte $83
- D - I - - 0x018D4D 13:8D3D: 36        .byte $36
- D - I - - 0x018D4E 13:8D3E: F3        .byte $F3
- D - I - - 0x018D4F 13:8D3F: 87        .byte $87
- D - I - - 0x018D50 13:8D40: 37        .byte $37
- D - I - - 0x018D51 13:8D41: F4        .byte $F4
- D - I - - 0x018D52 13:8D42: 8A        .byte $8A
- D - I - - 0x018D53 13:8D43: 35        .byte $35
- D - I - - 0x018D54 13:8D44: 34        .byte $34
- D - I - - 0x018D55 13:8D45: 35        .byte $35
- D - I - - 0x018D56 13:8D46: F3        .byte $F3
- D - I - - 0x018D57 13:8D47: ED        .byte $ED
- D - I - - 0x018D58 13:8D48: 01        .byte $01
- D - I - - 0x018D59 13:8D49: 35        .byte $35
- D - I - - 0x018D5A 13:8D4A: ED        .byte $ED
- D - I - - 0x018D5B 13:8D4B: 02        .byte $02
- D - I - - 0x018D5C 13:8D4C: 90        .byte $90
- D - I - - 0x018D5D 13:8D4D: 35        .byte $35
- D - I - - 0x018D5E 13:8D4E: F4        .byte $F4
- D - I - - 0x018D5F 13:8D4F: EF        .byte $EF
- D - I - - 0x018D60 13:8D50: 95        .byte $95
- D - I - - 0x018D61 13:8D51: 0C        .byte $0C
- D - I - - 0x018D62 13:8D52: 84        .byte $84
- D - I - - 0x018D63 13:8D53: 38        .byte $38
- D - I - - 0x018D64 13:8D54: F3        .byte $F3
- D - I - - 0x018D65 13:8D55: 8E        .byte $8E
- D - I - - 0x018D66 13:8D56: 39        .byte $39
- D - I - - 0x018D67 13:8D57: F4        .byte $F4
- D - I - - 0x018D68 13:8D58: 90        .byte $90
- D - I - - 0x018D69 13:8D59: 37        .byte $37
- D - I - - 0x018D6A 13:8D5A: 35        .byte $35
- D - I - - 0x018D6B 13:8D5B: 83        .byte $83
- D - I - - 0x018D6C 13:8D5C: 36        .byte $36
- D - I - - 0x018D6D 13:8D5D: F3        .byte $F3
- D - I - - 0x018D6E 13:8D5E: 87        .byte $87
- D - I - - 0x018D6F 13:8D5F: 37        .byte $37
- D - I - - 0x018D70 13:8D60: F4        .byte $F4
- D - I - - 0x018D71 13:8D61: 90        .byte $90
- D - I - - 0x018D72 13:8D62: 35        .byte $35
- D - I - - 0x018D73 13:8D63: 34        .byte $34
- D - I - - 0x018D74 13:8D64: 32        .byte $32
- D - I - - 0x018D75 13:8D65: 8A        .byte $8A
- D - I - - 0x018D76 13:8D66: 0C        .byte $0C
- D - I - - 0x018D77 13:8D67: 83        .byte $83
- D - I - - 0x018D78 13:8D68: 2B        .byte $2B
- D - I - - 0x018D79 13:8D69: F3        .byte $F3
- D - I - - 0x018D7A 13:8D6A: 87        .byte $87
- D - I - - 0x018D7B 13:8D6B: 30        .byte $30
- D - I - - 0x018D7C 13:8D6C: F4        .byte $F4
- D - I - - 0x018D7D 13:8D6D: 90        .byte $90
- D - I - - 0x018D7E 13:8D6E: 32        .byte $32
- D - I - - 0x018D7F 13:8D6F: 39        .byte $39
- D - I - - 0x018D80 13:8D70: 37        .byte $37
- D - I - - 0x018D81 13:8D71: 8A        .byte $8A
- D - I - - 0x018D82 13:8D72: 0C        .byte $0C
- D - I - - 0x018D83 13:8D73: 83        .byte $83
- D - I - - 0x018D84 13:8D74: 3A        .byte $3A
- D - I - - 0x018D85 13:8D75: F3        .byte $F3
- D - I - - 0x018D86 13:8D76: 93        .byte $93
- D - I - - 0x018D87 13:8D77: 3B        .byte $3B
- D - I - - 0x018D88 13:8D78: F4        .byte $F4
- D - I - - 0x018D89 13:8D79: 95        .byte $95
- D - I - - 0x018D8A 13:8D7A: 37        .byte $37
- D - I - - 0x018D8B 13:8D7B: 90        .byte $90
- D - I - - 0x018D8C 13:8D7C: 42        .byte $42
- D - I - - 0x018D8D 13:8D7D: 40        .byte $40
- D - I - - 0x018D8E 13:8D7E: F3        .byte $F3
- D - I - - 0x018D8F 13:8D7F: ED        .byte $ED
- D - I - - 0x018D90 13:8D80: 01        .byte $01
- D - I - - 0x018D91 13:8D81: 40        .byte $40
- D - I - - 0x018D92 13:8D82: ED        .byte $ED
- D - I - - 0x018D93 13:8D83: 02        .byte $02
- D - I - - 0x018D94 13:8D84: 98        .byte $98
- D - I - - 0x018D95 13:8D85: 40        .byte $40
- D - I - - 0x018D96 13:8D86: F4        .byte $F4
- D - I - - 0x018D97 13:8D87: EF        .byte $EF
- D - I - - 0x018D98 13:8D88: A0        .byte $A0
- D - I - - 0x018D99 13:8D89: 0C        .byte $0C
- D - I - - 0x018D9A 13:8D8A: 8A        .byte $8A
- D - I - - 0x018D9B 13:8D8B: 0C        .byte $0C
- D - I - - 0x018D9C 13:8D8C: 30        .byte $30
- D - I - - 0x018D9D 13:8D8D: 32        .byte $32
- D - I - - 0x018D9E 13:8D8E: 34        .byte $34
- D - I - - 0x018D9F 13:8D8F: 32        .byte $32
- D - I - - 0x018DA0 13:8D90: 34        .byte $34
- D - I - - 0x018DA1 13:8D91: 35        .byte $35
- D - I - - 0x018DA2 13:8D92: 84        .byte $84
- D - I - - 0x018DA3 13:8D93: 36        .byte $36
- D - I - - 0x018DA4 13:8D94: F3        .byte $F3
- D - I - - 0x018DA5 13:8D95: 8E        .byte $8E
- D - I - - 0x018DA6 13:8D96: 37        .byte $37
- D - I - - 0x018DA7 13:8D97: F4        .byte $F4
- D - I - - 0x018DA8 13:8D98: 8A        .byte $8A
- D - I - - 0x018DA9 13:8D99: 37        .byte $37
- D - I - - 0x018DAA 13:8D9A: 90        .byte $90
- D - I - - 0x018DAB 13:8D9B: 35        .byte $35
- D - I - - 0x018DAC 13:8D9C: 87        .byte $87
- D - I - - 0x018DAD 13:8D9D: 34        .byte $34
- D - I - - 0x018DAE 13:8D9E: 86        .byte $86
- D - I - - 0x018DAF 13:8D9F: 35        .byte $35
- D - I - - 0x018DB0 13:8DA0: 87        .byte $87
- D - I - - 0x018DB1 13:8DA1: 34        .byte $34
- D - I - - 0x018DB2 13:8DA2: 8A        .byte $8A
- D - I - - 0x018DB3 13:8DA3: 32        .byte $32
- D - I - - 0x018DB4 13:8DA4: 30        .byte $30
- D - I - - 0x018DB5 13:8DA5: 0C        .byte $0C
- D - I - - 0x018DB6 13:8DA6: 29        .byte $29
- D - I - - 0x018DB7 13:8DA7: 2B        .byte $2B
- D - I - - 0x018DB8 13:8DA8: 30        .byte $30
- D - I - - 0x018DB9 13:8DA9: 87        .byte $87
- D - I - - 0x018DBA 13:8DAA: 32        .byte $32
- D - I - - 0x018DBB 13:8DAB: 86        .byte $86
- D - I - - 0x018DBC 13:8DAC: 34        .byte $34
- D - I - - 0x018DBD 13:8DAD: 87        .byte $87
- D - I - - 0x018DBE 13:8DAE: 32        .byte $32
- D - I - - 0x018DBF 13:8DAF: 8A        .byte $8A
- D - I - - 0x018DC0 13:8DB0: 30        .byte $30
- D - I - - 0x018DC1 13:8DB1: 2B        .byte $2B
- D - I - - 0x018DC2 13:8DB2: 30        .byte $30
- D - I - - 0x018DC3 13:8DB3: 27        .byte $27
- D - I - - 0x018DC4 13:8DB4: 29        .byte $29
- D - I - - 0x018DC5 13:8DB5: 2B        .byte $2B
- D - I - - 0x018DC6 13:8DB6: 30        .byte $30
- D - I - - 0x018DC7 13:8DB7: 32        .byte $32
- D - I - - 0x018DC8 13:8DB8: 34        .byte $34
- D - I - - 0x018DC9 13:8DB9: 35        .byte $35
- D - I - - 0x018DCA 13:8DBA: 0C        .byte $0C
- D - I - - 0x018DCB 13:8DBB: EB        .byte $EB
- D - I - - 0x018DCC 13:8DBC: 02        .byte $02
- D - I - - 0x018DCD 13:8DBD: 83        .byte $83
- D - I - - 0x018DCE 13:8DBE: 36        .byte $36
- D - I - - 0x018DCF 13:8DBF: F3        .byte $F3
- D - I - - 0x018DD0 13:8DC0: 87        .byte $87
- D - I - - 0x018DD1 13:8DC1: 37        .byte $37
- D - I - - 0x018DD2 13:8DC2: F4        .byte $F4
- D - I - - 0x018DD3 13:8DC3: 8A        .byte $8A
- D - I - - 0x018DD4 13:8DC4: 35        .byte $35
- D - I - - 0x018DD5 13:8DC5: 34        .byte $34
- D - I - - 0x018DD6 13:8DC6: EC        .byte $EC
- D - I - - 0x018DD7 13:8DC7: 84        .byte $84
- D - I - - 0x018DD8 13:8DC8: 38        .byte $38
- D - I - - 0x018DD9 13:8DC9: F3        .byte $F3
- D - I - - 0x018DDA 13:8DCA: 8E        .byte $8E
- D - I - - 0x018DDB 13:8DCB: 39        .byte $39
- D - I - - 0x018DDC 13:8DCC: F4        .byte $F4
- D - I - - 0x018DDD 13:8DCD: 8A        .byte $8A
- D - I - - 0x018DDE 13:8DCE: 39        .byte $39
- D - I - - 0x018DDF 13:8DCF: 90        .byte $90
- D - I - - 0x018DE0 13:8DD0: 37        .byte $37
- D - I - - 0x018DE1 13:8DD1: 87        .byte $87
- D - I - - 0x018DE2 13:8DD2: 35        .byte $35
- D - I - - 0x018DE3 13:8DD3: 86        .byte $86
- D - I - - 0x018DE4 13:8DD4: 37        .byte $37
- D - I - - 0x018DE5 13:8DD5: 87        .byte $87
- D - I - - 0x018DE6 13:8DD6: 35        .byte $35
- D - I - - 0x018DE7 13:8DD7: 8A        .byte $8A
- D - I - - 0x018DE8 13:8DD8: 34        .byte $34
- D - I - - 0x018DE9 13:8DD9: 32        .byte $32
- D - I - - 0x018DEA 13:8DDA: 31        .byte $31
- D - I - - 0x018DEB 13:8DDB: 32        .byte $32
- D - I - - 0x018DEC 13:8DDC: 34        .byte $34
- D - I - - 0x018DED 13:8DDD: 32        .byte $32
- D - I - - 0x018DEE 13:8DDE: 34        .byte $34
- D - I - - 0x018DEF 13:8DDF: 35        .byte $35
- D - I - - 0x018DF0 13:8DE0: 34        .byte $34
- D - I - - 0x018DF1 13:8DE1: 35        .byte $35
- D - I - - 0x018DF2 13:8DE2: 37        .byte $37
- D - I - - 0x018DF3 13:8DE3: 35        .byte $35
- D - I - - 0x018DF4 13:8DE4: 37        .byte $37
- D - I - - 0x018DF5 13:8DE5: 39        .byte $39
- D - I - - 0x018DF6 13:8DE6: 37        .byte $37
- D - I - - 0x018DF7 13:8DE7: 39        .byte $39
- D - I - - 0x018DF8 13:8DE8: 3B        .byte $3B
- D - I - - 0x018DF9 13:8DE9: 40        .byte $40
- D - I - - 0x018DFA 13:8DEA: EB        .byte $EB
- D - I - - 0x018DFB 13:8DEB: 02        .byte $02
- D - I - - 0x018DFC 13:8DEC: E9        .byte $E9
- D - I - - 0x018DFD 13:8DED: 25 8E     .word off_8E25_отрезок
- D - I - - 0x018DFF 13:8DEF: 8A        .byte $8A
- D - I - - 0x018E00 13:8DF0: 40        .byte $40
- D - I - - 0x018E01 13:8DF1: 40        .byte $40
- D - I - - 0x018E02 13:8DF2: E9        .byte $E9
- D - I - - 0x018E03 13:8DF3: 25 8E     .word off_8E25_отрезок
- D - I - - 0x018E05 13:8DF5: 8A        .byte $8A
- D - I - - 0x018E06 13:8DF6: 40        .byte $40
- D - I - - 0x018E07 13:8DF7: 40        .byte $40
- D - I - - 0x018E08 13:8DF8: E9        .byte $E9
- D - I - - 0x018E09 13:8DF9: 25 8E     .word off_8E25_отрезок
- D - I - - 0x018E0B 13:8DFB: 8A        .byte $8A
- D - I - - 0x018E0C 13:8DFC: 40        .byte $40
- D - I - - 0x018E0D 13:8DFD: EC        .byte $EC
- D - I - - 0x018E0E 13:8DFE: 90        .byte $90
- D - I - - 0x018E0F 13:8DFF: 40        .byte $40
- D - I - - 0x018E10 13:8E00: F3        .byte $F3
- D - I - - 0x018E11 13:8E01: ED        .byte $ED
- D - I - - 0x018E12 13:8E02: 01        .byte $01
- D - I - - 0x018E13 13:8E03: 40        .byte $40
- D - I - - 0x018E14 13:8E04: ED        .byte $ED
- D - I - - 0x018E15 13:8E05: 02        .byte $02
- D - I - - 0x018E16 13:8E06: 98        .byte $98
- D - I - - 0x018E17 13:8E07: 40        .byte $40
- D - I - - 0x018E18 13:8E08: F4        .byte $F4
- D - I - - 0x018E19 13:8E09: EF        .byte $EF
- D - I - - 0x018E1A 13:8E0A: E0        .byte $E0
- D - I - - 0x018E1B 13:8E0B: 17        .byte $17
- D - I - - 0x018E1C 13:8E0C: E3        .byte $E3
- D - I - - 0x018E1D 13:8E0D: 0A        .byte $0A
- D - I - - 0x018E1E 13:8E0E: 82        .byte $82
- D - I - - 0x018E1F 13:8E0F: 50        .byte $50
- D - I - - 0x018E20 13:8E10: 4B        .byte $4B
- D - I - - 0x018E21 13:8E11: 49        .byte $49
- D - I - - 0x018E22 13:8E12: 47        .byte $47
- D - I - - 0x018E23 13:8E13: 45        .byte $45
- D - I - - 0x018E24 13:8E14: 44        .byte $44
- D - I - - 0x018E25 13:8E15: 42        .byte $42
- D - I - - 0x018E26 13:8E16: 40        .byte $40
- D - I - - 0x018E27 13:8E17: 83        .byte $83
- D - I - - 0x018E28 13:8E18: 3B        .byte $3B
- D - I - - 0x018E29 13:8E19: 39        .byte $39
- D - I - - 0x018E2A 13:8E1A: 37        .byte $37
- D - I - - 0x018E2B 13:8E1B: 35        .byte $35
- D - I - - 0x018E2C 13:8E1C: 34        .byte $34
- D - I - - 0x018E2D 13:8E1D: 32        .byte $32
- D - I - - 0x018E2E 13:8E1E: 30        .byte $30
- D - I - - 0x018E2F 13:8E1F: 2B        .byte $2B
- D - I - - 0x018E30 13:8E20: 98        .byte $98
- D - I - - 0x018E31 13:8E21: 0C        .byte $0C
- D - I - - 0x018E32 13:8E22: E8        .byte $E8
- D - I - - 0x018E33 13:8E23: DB 8C     .word off_8CDB_повтор
off_8E25_отрезок:
- D - I - - 0x018E35 13:8E25: 82        .byte $82
- D - I - - 0x018E36 13:8E26: 3B        .byte $3B
- D - I - - 0x018E37 13:8E27: F3        .byte $F3
- D - I - - 0x018E38 13:8E28: E5        .byte $E5
- D - I - - 0x018E39 13:8E29: 01        .byte $01
- D - I - - 0x018E3A 13:8E2A: 81        .byte $81
- D - I - - 0x018E3B 13:8E2B: 3B        .byte $3B
- D - I - - 0x018E3C 13:8E2C: E5        .byte $E5
- D - I - - 0x018E3D 13:8E2D: 02        .byte $02
- D - I - - 0x018E3E 13:8E2E: 3B        .byte $3B
- D - I - - 0x018E3F 13:8E2F: E5        .byte $E5
- D - I - - 0x018E40 13:8E30: 03        .byte $03
- D - I - - 0x018E41 13:8E31: 3B        .byte $3B
- D - I - - 0x018E42 13:8E32: E5        .byte $E5
- D - I - - 0x018E43 13:8E33: 04        .byte $04
- D - I - - 0x018E44 13:8E34: 82        .byte $82
- D - I - - 0x018E45 13:8E35: 3B        .byte $3B
- D - I - - 0x018E46 13:8E36: E5        .byte $E5
- D - I - - 0x018E47 13:8E37: 05        .byte $05
- D - I - - 0x018E48 13:8E38: 81        .byte $81
- D - I - - 0x018E49 13:8E39: 3B        .byte $3B
- D - I - - 0x018E4A 13:8E3A: E5        .byte $E5
- D - I - - 0x018E4B 13:8E3B: 06        .byte $06
- D - I - - 0x018E4C 13:8E3C: 3B        .byte $3B
- D - I - - 0x018E4D 13:8E3D: E5        .byte $E5
- D - I - - 0x018E4E 13:8E3E: 00        .byte $00
- D - I - - 0x018E4F 13:8E3F: 40        .byte $40
- D - I - - 0x018E50 13:8E40: F4        .byte $F4
- D - I - - 0x018E51 13:8E41: EA        .byte $EA



_off001_8E42_01_выключить_музыку_и_звуки:
- D - I - - 0x018E52 13:8E42: 00        .byte $00
- D - I - - 0x018E53 13:8E43: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E55 13:8E45: 01        .byte $01
- D - I - - 0x018E56 13:8E46: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E58 13:8E48: 02        .byte $02
- D - I - - 0x018E59 13:8E49: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E5B 13:8E4B: 03        .byte $03
- D - I - - 0x018E5C 13:8E4C: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E5E 13:8E4E: 04        .byte $04
- D - I - - 0x018E5F 13:8E4F: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E61 13:8E51: 05        .byte $05
- D - I - - 0x018E62 13:8E52: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E64 13:8E54: 06        .byte $06
- D - I - - 0x018E65 13:8E55: 5A 8E     .word off_8E5A_выкл
- D - I - - 0x018E67 13:8E57: 07        .byte $07
- D - I - - 0x018E68 13:8E58: 5A 8E     .word off_8E5A_выкл
off_8E5A_выкл:
- D - I - - 0x018E6A 13:8E5A: FF        .byte $FF



_off000_8E5B_02_выключить_звуки:
- D - I - - 0x018E6B 13:8E5B: 00        .byte $00
- D - I - - 0x018E6C 13:8E5C: 67 8E     .word off_8E67_выкл
- D - I - - 0x018E6E 13:8E5E: 01        .byte $01
- D - I - - 0x018E6F 13:8E5F: 67 8E     .word off_8E67_выкл
- D - I - - 0x018E71 13:8E61: 02        .byte $02
- D - I - - 0x018E72 13:8E62: 67 8E     .word off_8E67_выкл
- D - I - - 0x018E74 13:8E64: 03        .byte $03
- D - I - - 0x018E75 13:8E65: 67 8E     .word off_8E67_выкл
off_8E67_выкл:
- D - I - - 0x018E77 13:8E67: FF        .byte $FF



_off000_8E68_03_обычный_полет_мяча:
- D - I - - 0x018E78 13:8E68: 00        .byte $00
- D - I - - 0x018E79 13:8E69: 71 8E     .word off_8E71_выкл
- D - I - - 0x018E7B 13:8E6B: 01        .byte $01
- D - I - - 0x018E7C 13:8E6C: 71 8E     .word off_8E71_выкл
- D - I - - 0x018E7E 13:8E6E: 03        .byte $03
- D - I - - 0x018E7F 13:8E6F: 72 8E     .word off_8E72_03_03
off_8E71_выкл:
- D - I - - 0x018E81 13:8E71: FF        .byte $FF



off_8E72_03_03:
- D - I - - 0x018E82 13:8E72: E0        .byte $E0
- D - I - - 0x018E83 13:8E73: 12        .byte $12
- D - I - - 0x018E84 13:8E74: E3        .byte $E3
- D - I - - 0x018E85 13:8E75: 00        .byte $00
- D - I - - 0x018E86 13:8E76: 81        .byte $81
- D - I - - 0x018E87 13:8E77: 00        .byte $00
- D - I - - 0x018E88 13:8E78: 82        .byte $82
- D - I - - 0x018E89 13:8E79: 01        .byte $01
- D - I - - 0x018E8A 13:8E7A: 83        .byte $83
- D - I - - 0x018E8B 13:8E7B: 02        .byte $02
- D - I - - 0x018E8C 13:8E7C: 03        .byte $03
- D - I - - 0x018E8D 13:8E7D: 04        .byte $04
- D - I - - 0x018E8E 13:8E7E: 84        .byte $84
- D - I - - 0x018E8F 13:8E7F: 05        .byte $05
- D - I - - 0x018E90 13:8E80: 06        .byte $06
- D - I - - 0x018E91 13:8E81: 85        .byte $85
- D - I - - 0x018E92 13:8E82: 07        .byte $07
- D - I - - 0x018E93 13:8E83: 08        .byte $08
- D - I - - 0x018E94 13:8E84: 09        .byte $09
- D - I - - 0x018E95 13:8E85: 0A        .byte $0A
- D - I - - 0x018E96 13:8E86: 95        .byte $95
- D - I - - 0x018E97 13:8E87: 0B        .byte $0B
- D - I - - 0x018E98 13:8E88: FF        .byte $FF



_off000_8E89_04_полет_спешала:
- D - I - - 0x018E99 13:8E89: 00        .byte $00
- D - I - - 0x018E9A 13:8E8A: 92 8E     .word off_8E92_выкл
- D - I - - 0x018E9C 13:8E8C: 01        .byte $01
- D - I - - 0x018E9D 13:8E8D: 92 8E     .word off_8E92_выкл
- D - I - - 0x018E9F 13:8E8F: 03        .byte $03
- D - I - - 0x018EA0 13:8E90: 93 8E     .word off_8E93_04_03
off_8E92_выкл:
- D - I - - 0x018EA2 13:8E92: FF        .byte $FF



off_8E93_04_03:
- D - I - - 0x018EA3 13:8E93: 81        .byte $81
off_8E94_повтор:
- D - I - - 0x018EA4 13:8E94: E0        .byte $E0
- D - I - - 0x018EA5 13:8E95: 12        .byte $12
- D - I - - 0x018EA6 13:8E96: E3        .byte $E3
- D - I - - 0x018EA7 13:8E97: 00        .byte $00
- D - I - - 0x018EA8 13:8E98: 0F        .byte $0F
- D - I - - 0x018EA9 13:8E99: 0E        .byte $0E
- D - I - - 0x018EAA 13:8E9A: 0D        .byte $0D
- D - I - - 0x018EAB 13:8E9B: 0C        .byte $0C
- D - I - - 0x018EAC 13:8E9C: 0E        .byte $0E
- D - I - - 0x018EAD 13:8E9D: 0D        .byte $0D
- D - I - - 0x018EAE 13:8E9E: 0C        .byte $0C
- D - I - - 0x018EAF 13:8E9F: 0B        .byte $0B
- D - I - - 0x018EB0 13:8EA0: 0D        .byte $0D
- D - I - - 0x018EB1 13:8EA1: 0C        .byte $0C
- D - I - - 0x018EB2 13:8EA2: 0B        .byte $0B
- D - I - - 0x018EB3 13:8EA3: 0A        .byte $0A
- D - I - - 0x018EB4 13:8EA4: 81        .byte $81
- D - I - - 0x018EB5 13:8EA5: 0C        .byte $0C
- D - I - - 0x018EB6 13:8EA6: 0B        .byte $0B
- D - I - - 0x018EB7 13:8EA7: 0A        .byte $0A
- D - I - - 0x018EB8 13:8EA8: 09        .byte $09
- D - I - - 0x018EB9 13:8EA9: 0B        .byte $0B
- D - I - - 0x018EBA 13:8EAA: 0A        .byte $0A
- D - I - - 0x018EBB 13:8EAB: 09        .byte $09
- D - I - - 0x018EBC 13:8EAC: 08        .byte $08
- D - I - - 0x018EBD 13:8EAD: 0A        .byte $0A
- D - I - - 0x018EBE 13:8EAE: 09        .byte $09
- D - I - - 0x018EBF 13:8EAF: 08        .byte $08
- D - I - - 0x018EC0 13:8EB0: 07        .byte $07
- D - I - - 0x018EC1 13:8EB1: 09        .byte $09
- D - I - - 0x018EC2 13:8EB2: 08        .byte $08
- D - I - - 0x018EC3 13:8EB3: 07        .byte $07
- D - I - - 0x018EC4 13:8EB4: 06        .byte $06
- D - I - - 0x018EC5 13:8EB5: 08        .byte $08
- D - I - - 0x018EC6 13:8EB6: 07        .byte $07
- D - I - - 0x018EC7 13:8EB7: 06        .byte $06
- D - I - - 0x018EC8 13:8EB8: 05        .byte $05
- D - I - - 0x018EC9 13:8EB9: 07        .byte $07
- D - I - - 0x018ECA 13:8EBA: 06        .byte $06
- D - I - - 0x018ECB 13:8EBB: 05        .byte $05
- D - I - - 0x018ECC 13:8EBC: 04        .byte $04
- D - I - - 0x018ECD 13:8EBD: 06        .byte $06
- D - I - - 0x018ECE 13:8EBE: 05        .byte $05
- D - I - - 0x018ECF 13:8EBF: 04        .byte $04
- D - I - - 0x018ED0 13:8EC0: 03        .byte $03
- D - I - - 0x018ED1 13:8EC1: 05        .byte $05
- D - I - - 0x018ED2 13:8EC2: 04        .byte $04
- D - I - - 0x018ED3 13:8EC3: 03        .byte $03
- D - I - - 0x018ED4 13:8EC4: 02        .byte $02
- D - I - - 0x018ED5 13:8EC5: 04        .byte $04
- D - I - - 0x018ED6 13:8EC6: 03        .byte $03
- D - I - - 0x018ED7 13:8EC7: 02        .byte $02
- D - I - - 0x018ED8 13:8EC8: 01        .byte $01
- D - I - - 0x018ED9 13:8EC9: 03        .byte $03
- D - I - - 0x018EDA 13:8ECA: 02        .byte $02
- D - I - - 0x018EDB 13:8ECB: 01        .byte $01
- D - I - - 0x018EDC 13:8ECC: 96        .byte $96
- D - I - - 0x018EDD 13:8ECD: 00        .byte $00
- D - I - - 0x018EDE 13:8ECE: FF        .byte $FF



_off000_8ECF_05_полет_спешала:
- D - I - - 0x018EDF 13:8ECF: 00        .byte $00
- D - I - - 0x018EE0 13:8ED0: D8 8E     .word off_8ED8_выкл
- D - I - - 0x018EE2 13:8ED2: 01        .byte $01
- D - I - - 0x018EE3 13:8ED3: D8 8E     .word off_8ED8_выкл
- D - I - - 0x018EE5 13:8ED5: 03        .byte $03
- D - I - - 0x018EE6 13:8ED6: D9 8E     .word off_8ED9_05_03
off_8ED8_выкл:
- D - I - - 0x018EE8 13:8ED8: FF        .byte $FF



off_8ED9_05_03:
- D - I - - 0x018EE9 13:8ED9: E0        .byte $E0
- D - I - - 0x018EEA 13:8EDA: 12        .byte $12
- D - I - - 0x018EEB 13:8EDB: E3        .byte $E3
- D - I - - 0x018EEC 13:8EDC: 00        .byte $00
- D - I - - 0x018EED 13:8EDD: 81        .byte $81
- D - I - - 0x018EEE 13:8EDE: 00        .byte $00
- D - I - - 0x018EEF 13:8EDF: 01        .byte $01
- D - I - - 0x018EF0 13:8EE0: 02        .byte $02
- D - I - - 0x018EF1 13:8EE1: 03        .byte $03
- D - I - - 0x018EF2 13:8EE2: 01        .byte $01
- D - I - - 0x018EF3 13:8EE3: 02        .byte $02
- D - I - - 0x018EF4 13:8EE4: 03        .byte $03
- D - I - - 0x018EF5 13:8EE5: 04        .byte $04
- D - I - - 0x018EF6 13:8EE6: 02        .byte $02
- D - I - - 0x018EF7 13:8EE7: 03        .byte $03
- D - I - - 0x018EF8 13:8EE8: 04        .byte $04
- D - I - - 0x018EF9 13:8EE9: 05        .byte $05
- D - I - - 0x018EFA 13:8EEA: 03        .byte $03
- D - I - - 0x018EFB 13:8EEB: 04        .byte $04
- D - I - - 0x018EFC 13:8EEC: 05        .byte $05
- D - I - - 0x018EFD 13:8EED: 06        .byte $06
- D - I - - 0x018EFE 13:8EEE: 04        .byte $04
- D - I - - 0x018EFF 13:8EEF: 05        .byte $05
- D - I - - 0x018F00 13:8EF0: 06        .byte $06
- D - I - - 0x018F01 13:8EF1: 07        .byte $07
- D - I - - 0x018F02 13:8EF2: 05        .byte $05
- D - I - - 0x018F03 13:8EF3: 06        .byte $06
- D - I - - 0x018F04 13:8EF4: 07        .byte $07
- D - I - - 0x018F05 13:8EF5: 08        .byte $08
- D - I - - 0x018F06 13:8EF6: 06        .byte $06
- D - I - - 0x018F07 13:8EF7: 07        .byte $07
- D - I - - 0x018F08 13:8EF8: 08        .byte $08
- D - I - - 0x018F09 13:8EF9: 09        .byte $09
- D - I - - 0x018F0A 13:8EFA: 07        .byte $07
- D - I - - 0x018F0B 13:8EFB: 08        .byte $08
- D - I - - 0x018F0C 13:8EFC: 09        .byte $09
- D - I - - 0x018F0D 13:8EFD: 0A        .byte $0A
- D - I - - 0x018F0E 13:8EFE: 08        .byte $08
- D - I - - 0x018F0F 13:8EFF: 09        .byte $09
- D - I - - 0x018F10 13:8F00: 0A        .byte $0A
- D - I - - 0x018F11 13:8F01: 0B        .byte $0B
- D - I - - 0x018F12 13:8F02: 09        .byte $09
- D - I - - 0x018F13 13:8F03: 0A        .byte $0A
- D - I - - 0x018F14 13:8F04: 0B        .byte $0B
- D - I - - 0x018F15 13:8F05: 0C        .byte $0C
- D - I - - 0x018F16 13:8F06: 0A        .byte $0A
- D - I - - 0x018F17 13:8F07: 0B        .byte $0B
- D - I - - 0x018F18 13:8F08: 0C        .byte $0C
- D - I - - 0x018F19 13:8F09: 0D        .byte $0D
- D - I - - 0x018F1A 13:8F0A: 0B        .byte $0B
- D - I - - 0x018F1B 13:8F0B: 0C        .byte $0C
- D - I - - 0x018F1C 13:8F0C: 0D        .byte $0D
- D - I - - 0x018F1D 13:8F0D: 0E        .byte $0E
- D - I - - 0x018F1E 13:8F0E: 0C        .byte $0C
- D - I - - 0x018F1F 13:8F0F: 0D        .byte $0D
- D - I - - 0x018F20 13:8F10: 0E        .byte $0E
- D - I - - 0x018F21 13:8F11: 96        .byte $96
- D - I - - 0x018F22 13:8F12: 0F        .byte $0F
- D - I - - 0x018F23 13:8F13: FF        .byte $FF



_off000_8F14_07_полет_спешала:
- D - I - - 0x018F24 13:8F14: 00        .byte $00
- D - I - - 0x018F25 13:8F15: 1D 8F     .word off_8F1D_выкл
- D - I - - 0x018F27 13:8F17: 01        .byte $01
- D - I - - 0x018F28 13:8F18: 47 8F     .word off_8F47_07_01
- D - I - - 0x018F2A 13:8F1A: 03        .byte $03
- D - I - - 0x018F2B 13:8F1B: 1E 8F     .word off_8F1E_07_03
off_8F1D_выкл:
- D - I - - 0x018F2D 13:8F1D: FF        .byte $FF



off_8F1E_07_03:
- D - I - - 0x018F2E 13:8F1E: E0        .byte $E0
- D - I - - 0x018F2F 13:8F1F: 14        .byte $14
- D - I - - 0x018F30 13:8F20: E3        .byte $E3
- D - I - - 0x018F31 13:8F21: 00        .byte $00
- D - I - - 0x018F32 13:8F22: 81        .byte $81
- D - I - - 0x018F33 13:8F23: 00        .byte $00
- D - I - - 0x018F34 13:8F24: 0F        .byte $0F
- D - I - - 0x018F35 13:8F25: 00        .byte $00
- D - I - - 0x018F36 13:8F26: 0F        .byte $0F
- D - I - - 0x018F37 13:8F27: 01        .byte $01
- D - I - - 0x018F38 13:8F28: 0E        .byte $0E
- D - I - - 0x018F39 13:8F29: 01        .byte $01
- D - I - - 0x018F3A 13:8F2A: 0E        .byte $0E
- D - I - - 0x018F3B 13:8F2B: 02        .byte $02
- D - I - - 0x018F3C 13:8F2C: 0D        .byte $0D
- D - I - - 0x018F3D 13:8F2D: 02        .byte $02
- D - I - - 0x018F3E 13:8F2E: 0D        .byte $0D
- D - I - - 0x018F3F 13:8F2F: 03        .byte $03
- D - I - - 0x018F40 13:8F30: 0C        .byte $0C
- D - I - - 0x018F41 13:8F31: 03        .byte $03
- D - I - - 0x018F42 13:8F32: 0C        .byte $0C
- D - I - - 0x018F43 13:8F33: 04        .byte $04
- D - I - - 0x018F44 13:8F34: 0B        .byte $0B
- D - I - - 0x018F45 13:8F35: 04        .byte $04
- D - I - - 0x018F46 13:8F36: 0B        .byte $0B
- D - I - - 0x018F47 13:8F37: 05        .byte $05
- D - I - - 0x018F48 13:8F38: 0A        .byte $0A
- D - I - - 0x018F49 13:8F39: 05        .byte $05
- D - I - - 0x018F4A 13:8F3A: 0A        .byte $0A
- D - I - - 0x018F4B 13:8F3B: 06        .byte $06
- D - I - - 0x018F4C 13:8F3C: 09        .byte $09
- D - I - - 0x018F4D 13:8F3D: 06        .byte $06
- D - I - - 0x018F4E 13:8F3E: 09        .byte $09
- D - I - - 0x018F4F 13:8F3F: 08        .byte $08
- D - I - - 0x018F50 13:8F40: 07        .byte $07
- D - I - - 0x018F51 13:8F41: 08        .byte $08
- D - I - - 0x018F52 13:8F42: E0        .byte $E0
- D - I - - 0x018F53 13:8F43: 12        .byte $12
- D - I - - 0x018F54 13:8F44: 96        .byte $96
- D - I - - 0x018F55 13:8F45: 07        .byte $07
- D - I - - 0x018F56 13:8F46: FF        .byte $FF



off_8F47_07_01:
- D - I - - 0x018F57 13:8F47: E0        .byte $E0
- D - I - - 0x018F58 13:8F48: 14        .byte $14
- D - I - - 0x018F59 13:8F49: E2        .byte $E2
- D - I - - 0x018F5A 13:8F4A: 40        .byte $40
- D - I - - 0x018F5B 13:8F4B: E3        .byte $E3
- D - I - - 0x018F5C 13:8F4C: 06        .byte $06
- D - I - - 0x018F5D 13:8F4D: 81        .byte $81
- D - I - - 0x018F5E 13:8F4E: EB        .byte $EB
- D - I - - 0x018F5F 13:8F4F: 04        .byte $04
- D - I - - 0x018F60 13:8F50: 01        .byte $01
- D - I - - 0x018F61 13:8F51: 12        .byte $12
- D - I - - 0x018F62 13:8F52: 00        .byte $00
- D - I - - 0x018F63 13:8F53: 13        .byte $13
- D - I - - 0x018F64 13:8F54: 01        .byte $01
- D - I - - 0x018F65 13:8F55: 12        .byte $12
- D - I - - 0x018F66 13:8F56: 02        .byte $02
- D - I - - 0x018F67 13:8F57: 11        .byte $11
- D - I - - 0x018F68 13:8F58: EC        .byte $EC
- D - I - - 0x018F69 13:8F59: FF        .byte $FF



_off000_8F5A_10_полет_спешала:
- D - I - - 0x018F6A 13:8F5A: 00        .byte $00
- D - I - - 0x018F6B 13:8F5B: A4 8F     .word off_8FA4_10_00
- D - I - - 0x018F6D 13:8F5D: 01        .byte $01
- D - I - - 0x018F6E 13:8F5E: 89 8F     .word off_8F89_10_01
- D - I - - 0x018F70 13:8F60: 03        .byte $03
- D - I - - 0x018F71 13:8F61: 64 8F     .word off_8F64_10_03
- D - I - - 0x018F73 13:8F63: FF        .byte $FF



off_8F64_10_03:
- D - I - - 0x018F74 13:8F64: E0        .byte $E0
- D - I - - 0x018F75 13:8F65: 12        .byte $12
- D - I - - 0x018F76 13:8F66: E3        .byte $E3
- D - I - - 0x018F77 13:8F67: 00        .byte $00
- D - I - - 0x018F78 13:8F68: 82        .byte $82
- D - I - - 0x018F79 13:8F69: 07        .byte $07
- D - I - - 0x018F7A 13:8F6A: 08        .byte $08
- D - I - - 0x018F7B 13:8F6B: 06        .byte $06
- D - I - - 0x018F7C 13:8F6C: 09        .byte $09
- D - I - - 0x018F7D 13:8F6D: 81        .byte $81
- D - I - - 0x018F7E 13:8F6E: 05        .byte $05
- D - I - - 0x018F7F 13:8F6F: 0A        .byte $0A
- D - I - - 0x018F80 13:8F70: F3        .byte $F3
- D - I - - 0x018F81 13:8F71: 04        .byte $04
- D - I - - 0x018F82 13:8F72: 0B        .byte $0B
- D - I - - 0x018F83 13:8F73: 03        .byte $03
- D - I - - 0x018F84 13:8F74: 0C        .byte $0C
- D - I - - 0x018F85 13:8F75: 02        .byte $02
- D - I - - 0x018F86 13:8F76: F4        .byte $F4
- D - I - - 0x018F87 13:8F77: 00        .byte $00
- D - I - - 0x018F88 13:8F78: 01        .byte $01
- D - I - - 0x018F89 13:8F79: 02        .byte $02
- D - I - - 0x018F8A 13:8F7A: 03        .byte $03
- D - I - - 0x018F8B 13:8F7B: 04        .byte $04
- D - I - - 0x018F8C 13:8F7C: 05        .byte $05
- D - I - - 0x018F8D 13:8F7D: 06        .byte $06
- D - I - - 0x018F8E 13:8F7E: 07        .byte $07
- D - I - - 0x018F8F 13:8F7F: 08        .byte $08
- D - I - - 0x018F90 13:8F80: 09        .byte $09
- D - I - - 0x018F91 13:8F81: 0A        .byte $0A
- D - I - - 0x018F92 13:8F82: 0B        .byte $0B
- D - I - - 0x018F93 13:8F83: 0C        .byte $0C
- D - I - - 0x018F94 13:8F84: 0D        .byte $0D
- D - I - - 0x018F95 13:8F85: 0E        .byte $0E
- D - I - - 0x018F96 13:8F86: 96        .byte $96
- D - I - - 0x018F97 13:8F87: 0F        .byte $0F
- D - I - - 0x018F98 13:8F88: FF        .byte $FF



off_8F89_10_01:
- D - I - - 0x018F99 13:8F89: E3        .byte $E3
- D - I - - 0x018F9A 13:8F8A: 05        .byte $05
off_8F8B_повтор:
- D - I - - 0x018F9B 13:8F8B: E0        .byte $E0
- D - I - - 0x018F9C 13:8F8C: 12        .byte $12
- D - I - - 0x018F9D 13:8F8D: E2        .byte $E2
- D - I - - 0x018F9E 13:8F8E: 00        .byte $00
- D - I - - 0x018F9F 13:8F8F: 8D        .byte $8D
- D - I - - 0x018FA0 13:8F90: 0C        .byte $0C
- D - I - - 0x018FA1 13:8F91: 81        .byte $81
- D - I - - 0x018FA2 13:8F92: 30        .byte $30
- D - I - - 0x018FA3 13:8F93: F3        .byte $F3
- D - I - - 0x018FA4 13:8F94: 2B        .byte $2B
- D - I - - 0x018FA5 13:8F95: 2A        .byte $2A
- D - I - - 0x018FA6 13:8F96: 29        .byte $29
- D - I - - 0x018FA7 13:8F97: 28        .byte $28
- D - I - - 0x018FA8 13:8F98: 27        .byte $27
- D - I - - 0x018FA9 13:8F99: 26        .byte $26
- D - I - - 0x018FAA 13:8F9A: 25        .byte $25
- D - I - - 0x018FAB 13:8F9B: 24        .byte $24
- D - I - - 0x018FAC 13:8F9C: 23        .byte $23
- D - I - - 0x018FAD 13:8F9D: 22        .byte $22
- D - I - - 0x018FAE 13:8F9E: 21        .byte $21
- D - I - - 0x018FAF 13:8F9F: 20        .byte $20
- D - I - - 0x018FB0 13:8FA0: 1B        .byte $1B
- D - I - - 0x018FB1 13:8FA1: 1A        .byte $1A
- D - I - - 0x018FB2 13:8FA2: F4        .byte $F4
- D - I - - 0x018FB3 13:8FA3: FF        .byte $FF



off_8FA4_10_00:
- D - I - - 0x018FB4 13:8FA4: E3        .byte $E3
- D - I - - 0x018FB5 13:8FA5: 09        .byte $09
- D - I - - 0x018FB6 13:8FA6: 82        .byte $82
- D - I - - 0x018FB7 13:8FA7: 0C        .byte $0C
- D - I - - 0x018FB8 13:8FA8: E5        .byte $E5
- D - I - - 0x018FB9 13:8FA9: 02        .byte $02
- D - I - - 0x018FBA 13:8FAA: E8        .byte $E8
- D - I - - 0x018FBB 13:8FAB: 8B 8F     .word off_8F8B_повтор



_off000_8FAD_06_полет_спешала:
- D - I - - 0x018FBD 13:8FAD: 00        .byte $00
- D - I - - 0x018FBE 13:8FAE: B6 8F     .word off_8FB6_выкл
- D - I - - 0x018FC0 13:8FB0: 01        .byte $01
- D - I - - 0x018FC1 13:8FB1: B6 8F     .word off_8FB6_выкл
- D - I - - 0x018FC3 13:8FB3: 03        .byte $03
- D - I - - 0x018FC4 13:8FB4: B7 8F     .word off_8FB7_06_03
off_8FB6_выкл:
- D - I - - 0x018FC6 13:8FB6: FF        .byte $FF



off_8FB7_06_03:
- D - I - - 0x018FC7 13:8FB7: 82        .byte $82
- D - I - - 0x018FC8 13:8FB8: E8        .byte $E8
- D - I - - 0x018FC9 13:8FB9: 94 8E     .word off_8E94_повтор



_off000_8FBB_11_полет_спешала:
- D - I - - 0x018FCB 13:8FBB: 00        .byte $00
- D - I - - 0x018FCC 13:8FBC: C5 8F     .word off_8FC5_11_00_повтор
- D - I - - 0x018FCE 13:8FBE: 01        .byte $01
- D - I - - 0x018FCF 13:8FBF: 41 90     .word off_9041_11_01
- D - I - - 0x018FD1 13:8FC1: 03        .byte $03
- D - I - - 0x018FD2 13:8FC2: 46 90     .word off_9046_11_03
- D - I - - 0x018FD4 13:8FC4: FF        .byte $FF



off_8FC5_11_00_повтор:
- D - I - - 0x018FD5 13:8FC5: E0        .byte $E0
- D - I - - 0x018FD6 13:8FC6: 11        .byte $11
- D - I - - 0x018FD7 13:8FC7: E2        .byte $E2
- D - I - - 0x018FD8 13:8FC8: C0        .byte $C0
- D - I - - 0x018FD9 13:8FC9: E3        .byte $E3
- D - I - - 0x018FDA 13:8FCA: 00        .byte $00
- D - I - - 0x018FDB 13:8FCB: 81        .byte $81
- D - I - - 0x018FDC 13:8FCC: E5        .byte $E5
- D - I - - 0x018FDD 13:8FCD: 10        .byte $10
- D - I - - 0x018FDE 13:8FCE: 48        .byte $48
- D - I - - 0x018FDF 13:8FCF: E5        .byte $E5
- D - I - - 0x018FE0 13:8FD0: 0E        .byte $0E
- D - I - - 0x018FE1 13:8FD1: 48        .byte $48
- D - I - - 0x018FE2 13:8FD2: E5        .byte $E5
- D - I - - 0x018FE3 13:8FD3: 0C        .byte $0C
- D - I - - 0x018FE4 13:8FD4: 48        .byte $48
- D - I - - 0x018FE5 13:8FD5: E5        .byte $E5
- D - I - - 0x018FE6 13:8FD6: 0A        .byte $0A
- D - I - - 0x018FE7 13:8FD7: 48        .byte $48
- D - I - - 0x018FE8 13:8FD8: E5        .byte $E5
- D - I - - 0x018FE9 13:8FD9: 08        .byte $08
- D - I - - 0x018FEA 13:8FDA: 48        .byte $48
- D - I - - 0x018FEB 13:8FDB: E3        .byte $E3
- D - I - - 0x018FEC 13:8FDC: 08        .byte $08
- D - I - - 0x018FED 13:8FDD: E5        .byte $E5
- D - I - - 0x018FEE 13:8FDE: 10        .byte $10
- D - I - - 0x018FEF 13:8FDF: 49        .byte $49
- D - I - - 0x018FF0 13:8FE0: E5        .byte $E5
- D - I - - 0x018FF1 13:8FE1: 0E        .byte $0E
- D - I - - 0x018FF2 13:8FE2: 49        .byte $49
- D - I - - 0x018FF3 13:8FE3: E5        .byte $E5
- D - I - - 0x018FF4 13:8FE4: 0C        .byte $0C
- D - I - - 0x018FF5 13:8FE5: 49        .byte $49
- D - I - - 0x018FF6 13:8FE6: E5        .byte $E5
- D - I - - 0x018FF7 13:8FE7: 0A        .byte $0A
- D - I - - 0x018FF8 13:8FE8: 49        .byte $49
- D - I - - 0x018FF9 13:8FE9: E5        .byte $E5
- D - I - - 0x018FFA 13:8FEA: 08        .byte $08
- D - I - - 0x018FFB 13:8FEB: 49        .byte $49
- D - I - - 0x018FFC 13:8FEC: E5        .byte $E5
- D - I - - 0x018FFD 13:8FED: 06        .byte $06
- D - I - - 0x018FFE 13:8FEE: 49        .byte $49
- D - I - - 0x018FFF 13:8FEF: E3        .byte $E3
- D - I - - 0x019000 13:8FF0: 0A        .byte $0A
- D - I - - 0x019001 13:8FF1: E5        .byte $E5
- D - I - - 0x019002 13:8FF2: 10        .byte $10
- D - I - - 0x019003 13:8FF3: 4A        .byte $4A
- D - I - - 0x019004 13:8FF4: E5        .byte $E5
- D - I - - 0x019005 13:8FF5: 0E        .byte $0E
- D - I - - 0x019006 13:8FF6: 4A        .byte $4A
- D - I - - 0x019007 13:8FF7: E5        .byte $E5
- D - I - - 0x019008 13:8FF8: 0C        .byte $0C
- D - I - - 0x019009 13:8FF9: 4A        .byte $4A
- D - I - - 0x01900A 13:8FFA: E5        .byte $E5
- D - I - - 0x01900B 13:8FFB: 0A        .byte $0A
- D - I - - 0x01900C 13:8FFC: 4A        .byte $4A
- D - I - - 0x01900D 13:8FFD: E5        .byte $E5
- D - I - - 0x01900E 13:8FFE: 08        .byte $08
- D - I - - 0x01900F 13:8FFF: 4A        .byte $4A
- D - I - - 0x019010 13:9000: E5        .byte $E5
- D - I - - 0x019011 13:9001: 06        .byte $06
- D - I - - 0x019012 13:9002: 4A        .byte $4A
- D - I - - 0x019013 13:9003: E5        .byte $E5
- D - I - - 0x019014 13:9004: 04        .byte $04
- D - I - - 0x019015 13:9005: 4A        .byte $4A
- D - I - - 0x019016 13:9006: E3        .byte $E3
- D - I - - 0x019017 13:9007: 0C        .byte $0C
- D - I - - 0x019018 13:9008: E5        .byte $E5
- D - I - - 0x019019 13:9009: 10        .byte $10
- D - I - - 0x01901A 13:900A: 4B        .byte $4B
- D - I - - 0x01901B 13:900B: E5        .byte $E5
- D - I - - 0x01901C 13:900C: 0E        .byte $0E
- D - I - - 0x01901D 13:900D: 4B        .byte $4B
- D - I - - 0x01901E 13:900E: E5        .byte $E5
- D - I - - 0x01901F 13:900F: 0C        .byte $0C
- D - I - - 0x019020 13:9010: 4B        .byte $4B
- D - I - - 0x019021 13:9011: E5        .byte $E5
- D - I - - 0x019022 13:9012: 0A        .byte $0A
- D - I - - 0x019023 13:9013: 4B        .byte $4B
- D - I - - 0x019024 13:9014: E5        .byte $E5
- D - I - - 0x019025 13:9015: 08        .byte $08
- D - I - - 0x019026 13:9016: 4B        .byte $4B
- D - I - - 0x019027 13:9017: E5        .byte $E5
- D - I - - 0x019028 13:9018: 06        .byte $06
- D - I - - 0x019029 13:9019: 4B        .byte $4B
- D - I - - 0x01902A 13:901A: E5        .byte $E5
- D - I - - 0x01902B 13:901B: 04        .byte $04
- D - I - - 0x01902C 13:901C: 4B        .byte $4B
- D - I - - 0x01902D 13:901D: E5        .byte $E5
- D - I - - 0x01902E 13:901E: 02        .byte $02
- D - I - - 0x01902F 13:901F: 4B        .byte $4B
- D - I - - 0x019030 13:9020: E3        .byte $E3
- D - I - - 0x019031 13:9021: 0E        .byte $0E
- D - I - - 0x019032 13:9022: E5        .byte $E5
- D - I - - 0x019033 13:9023: 10        .byte $10
- D - I - - 0x019034 13:9024: 50        .byte $50
- D - I - - 0x019035 13:9025: E5        .byte $E5
- D - I - - 0x019036 13:9026: 0E        .byte $0E
- D - I - - 0x019037 13:9027: 50        .byte $50
- D - I - - 0x019038 13:9028: E5        .byte $E5
- D - I - - 0x019039 13:9029: 0C        .byte $0C
- D - I - - 0x01903A 13:902A: 50        .byte $50
- D - I - - 0x01903B 13:902B: E5        .byte $E5
- D - I - - 0x01903C 13:902C: 0A        .byte $0A
- D - I - - 0x01903D 13:902D: 50        .byte $50
- D - I - - 0x01903E 13:902E: E5        .byte $E5
- D - I - - 0x01903F 13:902F: 08        .byte $08
- D - I - - 0x019040 13:9030: 50        .byte $50
- D - I - - 0x019041 13:9031: E5        .byte $E5
- D - I - - 0x019042 13:9032: 06        .byte $06
- D - I - - 0x019043 13:9033: 50        .byte $50
- D - I - - 0x019044 13:9034: E5        .byte $E5
- D - I - - 0x019045 13:9035: 04        .byte $04
- D - I - - 0x019046 13:9036: 50        .byte $50
- D - I - - 0x019047 13:9037: E5        .byte $E5
- D - I - - 0x019048 13:9038: 02        .byte $02
- D - I - - 0x019049 13:9039: 50        .byte $50
- D - I - - 0x01904A 13:903A: E5        .byte $E5
- D - I - - 0x01904B 13:903B: 01        .byte $01
- D - I - - 0x01904C 13:903C: 50        .byte $50
- D - I - - 0x01904D 13:903D: E5        .byte $E5
- D - I - - 0x01904E 13:903E: 00        .byte $00
- D - I - - 0x01904F 13:903F: 50        .byte $50
- D - I - - 0x019050 13:9040: FF        .byte $FF



off_9041_11_01:
- D - I - - 0x019051 13:9041: 84        .byte $84
- D - I - - 0x019052 13:9042: 0C        .byte $0C
- D - I - - 0x019053 13:9043: E8        .byte $E8
- D - I - - 0x019054 13:9044: C5 8F     .word off_8FC5_11_00_повтор



off_9046_11_03:
- D - I - - 0x019056 13:9046: E0        .byte $E0
- D - I - - 0x019057 13:9047: 14        .byte $14
- D - I - - 0x019058 13:9048: E3        .byte $E3
- D - I - - 0x019059 13:9049: 00        .byte $00
- D - I - - 0x01905A 13:904A: EB        .byte $EB
- D - I - - 0x01905B 13:904B: 03        .byte $03
- D - I - - 0x01905C 13:904C: 81        .byte $81
- D - I - - 0x01905D 13:904D: 0F        .byte $0F
- D - I - - 0x01905E 13:904E: 00        .byte $00
- D - I - - 0x01905F 13:904F: 0E        .byte $0E
- D - I - - 0x019060 13:9050: 01        .byte $01
- D - I - - 0x019061 13:9051: EC        .byte $EC
- D - I - - 0x019062 13:9052: EB        .byte $EB
- D - I - - 0x019063 13:9053: 05        .byte $05
- D - I - - 0x019064 13:9054: 0D        .byte $0D
- D - I - - 0x019065 13:9055: 00        .byte $00
- D - I - - 0x019066 13:9056: 0C        .byte $0C
- D - I - - 0x019067 13:9057: 01        .byte $01
- D - I - - 0x019068 13:9058: EC        .byte $EC
- D - I - - 0x019069 13:9059: EB        .byte $EB
- D - I - - 0x01906A 13:905A: 04        .byte $04
- D - I - - 0x01906B 13:905B: 0B        .byte $0B
- D - I - - 0x01906C 13:905C: 00        .byte $00
- D - I - - 0x01906D 13:905D: 0A        .byte $0A
- D - I - - 0x01906E 13:905E: 01        .byte $01
- D - I - - 0x01906F 13:905F: EC        .byte $EC
- D - I - - 0x019070 13:9060: 09        .byte $09
- D - I - - 0x019071 13:9061: 00        .byte $00
- D - I - - 0x019072 13:9062: 08        .byte $08
- D - I - - 0x019073 13:9063: 01        .byte $01
- D - I - - 0x019074 13:9064: 07        .byte $07
- D - I - - 0x019075 13:9065: 00        .byte $00
- D - I - - 0x019076 13:9066: 06        .byte $06
- D - I - - 0x019077 13:9067: 01        .byte $01
- D - I - - 0x019078 13:9068: 05        .byte $05
- D - I - - 0x019079 13:9069: 00        .byte $00
- D - I - - 0x01907A 13:906A: 04        .byte $04
- D - I - - 0x01907B 13:906B: 01        .byte $01
- D - I - - 0x01907C 13:906C: 03        .byte $03
- D - I - - 0x01907D 13:906D: 00        .byte $00
- D - I - - 0x01907E 13:906E: 02        .byte $02
- D - I - - 0x01907F 13:906F: 01        .byte $01
- D - I - - 0x019080 13:9070: 02        .byte $02
- D - I - - 0x019081 13:9071: 00        .byte $00
- D - I - - 0x019082 13:9072: 01        .byte $01
- D - I - - 0x019083 13:9073: 01        .byte $01
- D - I - - 0x019084 13:9074: E0        .byte $E0
- D - I - - 0x019085 13:9075: 12        .byte $12
- D - I - - 0x019086 13:9076: 96        .byte $96
- D - I - - 0x019087 13:9077: 00        .byte $00
- D - I - - 0x019088 13:9078: FF        .byte $FF



_off000_9079_0F_полет_спешала:
- D - I - - 0x019089 13:9079: 00        .byte $00
- D - I - - 0x01908A 13:907A: 82 90     .word off_9082_выкл
- D - I - - 0x01908C 13:907C: 01        .byte $01
- D - I - - 0x01908D 13:907D: 82 90     .word off_9082_выкл
- D - I - - 0x01908F 13:907F: 03        .byte $03
- D - I - - 0x019090 13:9080: 83 90     .word off_9083_0F_03
off_9082_выкл:
- D - I - - 0x019092 13:9082: FF        .byte $FF



off_9083_0F_03:
- D - I - - 0x019093 13:9083: E0        .byte $E0
- D - I - - 0x019094 13:9084: 12        .byte $12
- D - I - - 0x019095 13:9085: E3        .byte $E3
- D - I - - 0x019096 13:9086: 00        .byte $00
- D - I - - 0x019097 13:9087: 81        .byte $81
- D - I - - 0x019098 13:9088: 00        .byte $00
- D - I - - 0x019099 13:9089: 01        .byte $01
- D - I - - 0x01909A 13:908A: 02        .byte $02
- D - I - - 0x01909B 13:908B: 03        .byte $03
- D - I - - 0x01909C 13:908C: 04        .byte $04
- D - I - - 0x01909D 13:908D: 05        .byte $05
- D - I - - 0x01909E 13:908E: 06        .byte $06
- D - I - - 0x01909F 13:908F: EB        .byte $EB
- D - I - - 0x0190A0 13:9090: 02        .byte $02
- D - I - - 0x0190A1 13:9091: 00        .byte $00
- D - I - - 0x0190A2 13:9092: 01        .byte $01
- D - I - - 0x0190A3 13:9093: 02        .byte $02
- D - I - - 0x0190A4 13:9094: 03        .byte $03
- D - I - - 0x0190A5 13:9095: 04        .byte $04
- D - I - - 0x0190A6 13:9096: 05        .byte $05
- D - I - - 0x0190A7 13:9097: 06        .byte $06
- D - I - - 0x0190A8 13:9098: 07        .byte $07
- D - I - - 0x0190A9 13:9099: 08        .byte $08
- D - I - - 0x0190AA 13:909A: 09        .byte $09
- D - I - - 0x0190AB 13:909B: 0A        .byte $0A
- D - I - - 0x0190AC 13:909C: EC        .byte $EC
- D - I - - 0x0190AD 13:909D: 0B        .byte $0B
- D - I - - 0x0190AE 13:909E: 0C        .byte $0C
- D - I - - 0x0190AF 13:909F: 0D        .byte $0D
- D - I - - 0x0190B0 13:90A0: 0E        .byte $0E
- D - I - - 0x0190B1 13:90A1: 96        .byte $96
- D - I - - 0x0190B2 13:90A2: 0F        .byte $0F
- D - I - - 0x0190B3 13:90A3: FF        .byte $FF



_off000_90A4_08_полет_спешала:
- D - I - - 0x0190B4 13:90A4: 00        .byte $00
- D - I - - 0x0190B5 13:90A5: AD 90     .word off_90AD_выкл
- D - I - - 0x0190B7 13:90A7: 01        .byte $01
- D - I - - 0x0190B8 13:90A8: DD 90     .word off_90DD_08_5E_01
- D - I - - 0x0190BA 13:90AA: 03        .byte $03
- D - I - - 0x0190BB 13:90AB: AE 90     .word off_90AE_08_03
off_90AD_выкл:
- D - I - - 0x0190BD 13:90AD: FF        .byte $FF



off_90AE_08_03:
- D - I - - 0x0190BE 13:90AE: E0        .byte $E0
- D - I - - 0x0190BF 13:90AF: 12        .byte $12
- D - I - - 0x0190C0 13:90B0: E3        .byte $E3
- D - I - - 0x0190C1 13:90B1: 00        .byte $00
- D - I - - 0x0190C2 13:90B2: EB        .byte $EB
- D - I - - 0x0190C3 13:90B3: 04        .byte $04
- D - I - - 0x0190C4 13:90B4: 81        .byte $81
- D - I - - 0x0190C5 13:90B5: 00        .byte $00
- D - I - - 0x0190C6 13:90B6: 0F        .byte $0F
- D - I - - 0x0190C7 13:90B7: 01        .byte $01
- D - I - - 0x0190C8 13:90B8: 0E        .byte $0E
- D - I - - 0x0190C9 13:90B9: EC        .byte $EC
- D - I - - 0x0190CA 13:90BA: EB        .byte $EB
- D - I - - 0x0190CB 13:90BB: 03        .byte $03
- D - I - - 0x0190CC 13:90BC: 02        .byte $02
- D - I - - 0x0190CD 13:90BD: 0F        .byte $0F
- D - I - - 0x0190CE 13:90BE: 03        .byte $03
- D - I - - 0x0190CF 13:90BF: 0E        .byte $0E
- D - I - - 0x0190D0 13:90C0: EC        .byte $EC
- D - I - - 0x0190D1 13:90C1: EB        .byte $EB
- D - I - - 0x0190D2 13:90C2: 02        .byte $02
- D - I - - 0x0190D3 13:90C3: 04        .byte $04
- D - I - - 0x0190D4 13:90C4: 0F        .byte $0F
- D - I - - 0x0190D5 13:90C5: 05        .byte $05
- D - I - - 0x0190D6 13:90C6: 0E        .byte $0E
- D - I - - 0x0190D7 13:90C7: EC        .byte $EC
off_90C8_повтор:
- D - I - - 0x0190D8 13:90C8: 06        .byte $06
- D - I - - 0x0190D9 13:90C9: 0F        .byte $0F
- D - I - - 0x0190DA 13:90CA: 07        .byte $07
- D - I - - 0x0190DB 13:90CB: 0E        .byte $0E
- D - I - - 0x0190DC 13:90CC: 08        .byte $08
- D - I - - 0x0190DD 13:90CD: 0F        .byte $0F
- D - I - - 0x0190DE 13:90CE: 09        .byte $09
- D - I - - 0x0190DF 13:90CF: 0E        .byte $0E
- D - I - - 0x0190E0 13:90D0: 0A        .byte $0A
- D - I - - 0x0190E1 13:90D1: 0F        .byte $0F
- D - I - - 0x0190E2 13:90D2: 0B        .byte $0B
- D - I - - 0x0190E3 13:90D3: 0E        .byte $0E
- D - I - - 0x0190E4 13:90D4: 0C        .byte $0C
- D - I - - 0x0190E5 13:90D5: 0F        .byte $0F
- D - I - - 0x0190E6 13:90D6: 0D        .byte $0D
- D - I - - 0x0190E7 13:90D7: 0E        .byte $0E
- D - I - - 0x0190E8 13:90D8: E0        .byte $E0
- D - I - - 0x0190E9 13:90D9: 12        .byte $12
- D - I - - 0x0190EA 13:90DA: 96        .byte $96
- D - I - - 0x0190EB 13:90DB: 0F        .byte $0F
- D - I - - 0x0190EC 13:90DC: FF        .byte $FF



off_90DD_08_5E_01:
- D - I - - 0x0190ED 13:90DD: E0        .byte $E0
- D - I - - 0x0190EE 13:90DE: 14        .byte $14
- D - I - - 0x0190EF 13:90DF: E2        .byte $E2
- D - I - - 0x0190F0 13:90E0: 80        .byte $80
- D - I - - 0x0190F1 13:90E1: E3        .byte $E3
- D - I - - 0x0190F2 13:90E2: 06        .byte $06
- D - I - - 0x0190F3 13:90E3: 81        .byte $81
- D - I - - 0x0190F4 13:90E4: EB        .byte $EB
- D - I - - 0x0190F5 13:90E5: 06        .byte $06
- D - I - - 0x0190F6 13:90E6: 01        .byte $01
- D - I - - 0x0190F7 13:90E7: 12        .byte $12
- D - I - - 0x0190F8 13:90E8: 00        .byte $00
- D - I - - 0x0190F9 13:90E9: 13        .byte $13
- D - I - - 0x0190FA 13:90EA: 01        .byte $01
- D - I - - 0x0190FB 13:90EB: 12        .byte $12
- D - I - - 0x0190FC 13:90EC: 02        .byte $02
- D - I - - 0x0190FD 13:90ED: 11        .byte $11
- D - I - - 0x0190FE 13:90EE: EC        .byte $EC
- D - I - - 0x0190FF 13:90EF: 00        .byte $00
- D - I - - 0x019100 13:90F0: 13        .byte $13
- D - I - - 0x019101 13:90F1: 01        .byte $01
- D - I - - 0x019102 13:90F2: 12        .byte $12
- D - I - - 0x019103 13:90F3: 02        .byte $02
- D - I - - 0x019104 13:90F4: 11        .byte $11
- D - I - - 0x019105 13:90F5: FF        .byte $FF



_off000_90F6_5E_полет_спешала:
- D - I - - 0x019106 13:90F6: 00        .byte $00
- D - I - - 0x019107 13:90F7: FF 90     .word off_90FF_выкл
- D - I - - 0x019109 13:90F9: 01        .byte $01
- D - I - - 0x01910A 13:90FA: DD 90     .word off_90DD_08_5E_01
- D - I - - 0x01910C 13:90FC: 03        .byte $03
- D - I - - 0x01910D 13:90FD: 00 91     .word off_9100_5E_03
off_90FF_выкл:
- D - I - - 0x01910F 13:90FF: FF        .byte $FF



off_9100_5E_03:
- D - I - - 0x019110 13:9100: E0        .byte $E0
- D - I - - 0x019111 13:9101: 14        .byte $14
- D - I - - 0x019112 13:9102: E3        .byte $E3
- D - I - - 0x019113 13:9103: 00        .byte $00
- D - I - - 0x019114 13:9104: EB        .byte $EB
- D - I - - 0x019115 13:9105: 03        .byte $03
- D - I - - 0x019116 13:9106: 81        .byte $81
- D - I - - 0x019117 13:9107: 00        .byte $00
- D - I - - 0x019118 13:9108: 0F        .byte $0F
- D - I - - 0x019119 13:9109: 01        .byte $01
- D - I - - 0x01911A 13:910A: 0E        .byte $0E
- D - I - - 0x01911B 13:910B: EC        .byte $EC
- D - I - - 0x01911C 13:910C: EB        .byte $EB
- D - I - - 0x01911D 13:910D: 05        .byte $05
- D - I - - 0x01911E 13:910E: 02        .byte $02
- D - I - - 0x01911F 13:910F: 0F        .byte $0F
- D - I - - 0x019120 13:9110: 03        .byte $03
- D - I - - 0x019121 13:9111: 0E        .byte $0E
- D - I - - 0x019122 13:9112: EC        .byte $EC
- D - I - - 0x019123 13:9113: EB        .byte $EB
- D - I - - 0x019124 13:9114: 04        .byte $04
- D - I - - 0x019125 13:9115: 04        .byte $04
- D - I - - 0x019126 13:9116: 0F        .byte $0F
- D - I - - 0x019127 13:9117: 05        .byte $05
- D - I - - 0x019128 13:9118: 0E        .byte $0E
- D - I - - 0x019129 13:9119: EC        .byte $EC
- D - I - - 0x01912A 13:911A: E8        .byte $E8
- D - I - - 0x01912B 13:911B: C8 90     .word off_90C8_повтор



_off000_911D_0E_полет_спешала:
- D - I - - 0x01912D 13:911D: 00        .byte $00
- D - I - - 0x01912E 13:911E: 26 91     .word off_9126_выкл
- D - I - - 0x019130 13:9120: 01        .byte $01
- D - I - - 0x019131 13:9121: 27 91     .word off_9127_0E_01
- D - I - - 0x019133 13:9123: 03        .byte $03
- D - I - - 0x019134 13:9124: 57 91     .word off_9157_0E_03
off_9126_выкл:
- D - I - - 0x019136 13:9126: FF        .byte $FF



off_9127_0E_01:
- D - I - - 0x019137 13:9127: E0        .byte $E0
- D - I - - 0x019138 13:9128: 12        .byte $12
- D - I - - 0x019139 13:9129: E2        .byte $E2
- D - I - - 0x01913A 13:912A: 80        .byte $80
- D - I - - 0x01913B 13:912B: E3        .byte $E3
- D - I - - 0x01913C 13:912C: 05        .byte $05
- D - I - - 0x01913D 13:912D: 81        .byte $81
- D - I - - 0x01913E 13:912E: 10        .byte $10
- D - I - - 0x01913F 13:912F: 20        .byte $20
- D - I - - 0x019140 13:9130: 0B        .byte $0B
- D - I - - 0x019141 13:9131: 1B        .byte $1B
- D - I - - 0x019142 13:9132: 11        .byte $11
- D - I - - 0x019143 13:9133: 21        .byte $21
- D - I - - 0x019144 13:9134: 0A        .byte $0A
- D - I - - 0x019145 13:9135: 1A        .byte $1A
- D - I - - 0x019146 13:9136: 12        .byte $12
- D - I - - 0x019147 13:9137: 22        .byte $22
- D - I - - 0x019148 13:9138: 09        .byte $09
- D - I - - 0x019149 13:9139: 19        .byte $19
- D - I - - 0x01914A 13:913A: 13        .byte $13
- D - I - - 0x01914B 13:913B: 23        .byte $23
- D - I - - 0x01914C 13:913C: 08        .byte $08
- D - I - - 0x01914D 13:913D: 18        .byte $18
- D - I - - 0x01914E 13:913E: 14        .byte $14
- D - I - - 0x01914F 13:913F: 24        .byte $24
- D - I - - 0x019150 13:9140: 07        .byte $07
- D - I - - 0x019151 13:9141: 17        .byte $17
- D - I - - 0x019152 13:9142: 15        .byte $15
- D - I - - 0x019153 13:9143: 25        .byte $25
- D - I - - 0x019154 13:9144: 06        .byte $06
- D - I - - 0x019155 13:9145: 16        .byte $16
- D - I - - 0x019156 13:9146: 16        .byte $16
- D - I - - 0x019157 13:9147: 26        .byte $26
- D - I - - 0x019158 13:9148: 05        .byte $05
- D - I - - 0x019159 13:9149: 15        .byte $15
- D - I - - 0x01915A 13:914A: 17        .byte $17
- D - I - - 0x01915B 13:914B: 27        .byte $27
- D - I - - 0x01915C 13:914C: 04        .byte $04
- D - I - - 0x01915D 13:914D: 14        .byte $14
- D - I - - 0x01915E 13:914E: 18        .byte $18
- D - I - - 0x01915F 13:914F: 28        .byte $28
- D - I - - 0x019160 13:9150: 03        .byte $03
- D - I - - 0x019161 13:9151: 13        .byte $13
- D - I - - 0x019162 13:9152: 19        .byte $19
- D - I - - 0x019163 13:9153: 29        .byte $29
- D - I - - 0x019164 13:9154: 02        .byte $02
- D - I - - 0x019165 13:9155: 12        .byte $12
- D - I - - 0x019166 13:9156: FF        .byte $FF



off_9157_0E_03:
- D - I - - 0x019167 13:9157: E0        .byte $E0
- D - I - - 0x019168 13:9158: 12        .byte $12
- D - I - - 0x019169 13:9159: E3        .byte $E3
- D - I - - 0x01916A 13:915A: 00        .byte $00
- D - I - - 0x01916B 13:915B: 82        .byte $82
- D - I - - 0x01916C 13:915C: 0C        .byte $0C
- D - I - - 0x01916D 13:915D: 81        .byte $81
- D - I - - 0x01916E 13:915E: 0F        .byte $0F
- D - I - - 0x01916F 13:915F: 0E        .byte $0E
- D - I - - 0x019170 13:9160: 0C        .byte $0C
- D - I - - 0x019171 13:9161: 0D        .byte $0D
- D - I - - 0x019172 13:9162: 0C        .byte $0C
- D - I - - 0x019173 13:9163: 82        .byte $82
- D - I - - 0x019174 13:9164: 0C        .byte $0C
- D - I - - 0x019175 13:9165: 81        .byte $81
- D - I - - 0x019176 13:9166: 0B        .byte $0B
- D - I - - 0x019177 13:9167: 0A        .byte $0A
- D - I - - 0x019178 13:9168: 83        .byte $83
- D - I - - 0x019179 13:9169: 0C        .byte $0C
- D - I - - 0x01917A 13:916A: 81        .byte $81
- D - I - - 0x01917B 13:916B: 09        .byte $09
- D - I - - 0x01917C 13:916C: 08        .byte $08
- D - I - - 0x01917D 13:916D: 82        .byte $82
- D - I - - 0x01917E 13:916E: 0C        .byte $0C
- D - I - - 0x01917F 13:916F: 81        .byte $81
- D - I - - 0x019180 13:9170: 08        .byte $08
- D - I - - 0x019181 13:9171: 09        .byte $09
- D - I - - 0x019182 13:9172: 0C        .byte $0C
- D - I - - 0x019183 13:9173: 0A        .byte $0A
- D - I - - 0x019184 13:9174: 0B        .byte $0B
- D - I - - 0x019185 13:9175: 0C        .byte $0C
- D - I - - 0x019186 13:9176: 0D        .byte $0D
- D - I - - 0x019187 13:9177: 0C        .byte $0C
- D - I - - 0x019188 13:9178: 0B        .byte $0B
- D - I - - 0x019189 13:9179: 0A        .byte $0A
- D - I - - 0x01918A 13:917A: 0B        .byte $0B
- D - I - - 0x01918B 13:917B: 0C        .byte $0C
- D - I - - 0x01918C 13:917C: 0D        .byte $0D
- D - I - - 0x01918D 13:917D: 0E        .byte $0E
- D - I - - 0x01918E 13:917E: 96        .byte $96
- D - I - - 0x01918F 13:917F: 0D        .byte $0D
- D - I - - 0x019190 13:9180: FF        .byte $FF



_off000_9181_0C_полет_спешала:
- D - I - - 0x019191 13:9181: 00        .byte $00
- D - I - - 0x019192 13:9182: 8A 91     .word off_918A_выкл
- D - I - - 0x019194 13:9184: 01        .byte $01
- D - I - - 0x019195 13:9185: 8B 91     .word off_918B_0C_01
- D - I - - 0x019197 13:9187: 03        .byte $03
- D - I - - 0x019198 13:9188: A4 91     .word off_91A4_0C_03
off_918A_выкл:
- D - I - - 0x01919A 13:918A: FF        .byte $FF



off_918B_0C_01:
- D - I - - 0x01919B 13:918B: E0        .byte $E0
- D - I - - 0x01919C 13:918C: 14        .byte $14
- D - I - - 0x01919D 13:918D: E2        .byte $E2
- D - I - - 0x01919E 13:918E: C0        .byte $C0
- D - I - - 0x01919F 13:918F: E3        .byte $E3
- D - I - - 0x0191A0 13:9190: 00        .byte $00
- D - I - - 0x0191A1 13:9191: 81        .byte $81
- D - I - - 0x0191A2 13:9192: EB        .byte $EB
- D - I - - 0x0191A3 13:9193: 05        .byte $05
- D - I - - 0x0191A4 13:9194: 01        .byte $01
- D - I - - 0x0191A5 13:9195: 50        .byte $50
- D - I - - 0x0191A6 13:9196: 02        .byte $02
- D - I - - 0x0191A7 13:9197: 51        .byte $51
- D - I - - 0x0191A8 13:9198: 03        .byte $03
- D - I - - 0x0191A9 13:9199: 52        .byte $52
- D - I - - 0x0191AA 13:919A: 04        .byte $04
- D - I - - 0x0191AB 13:919B: 53        .byte $53
- D - I - - 0x0191AC 13:919C: 03        .byte $03
- D - I - - 0x0191AD 13:919D: 52        .byte $52
- D - I - - 0x0191AE 13:919E: 02        .byte $02
- D - I - - 0x0191AF 13:919F: 51        .byte $51
- D - I - - 0x0191B0 13:91A0: 01        .byte $01
- D - I - - 0x0191B1 13:91A1: 50        .byte $50
- D - I - - 0x0191B2 13:91A2: EC        .byte $EC
- D - I - - 0x0191B3 13:91A3: FF        .byte $FF



off_91A4_0C_03:
- D - I - - 0x0191B4 13:91A4: E0        .byte $E0
- D - I - - 0x0191B5 13:91A5: 12        .byte $12
- D - I - - 0x0191B6 13:91A6: E3        .byte $E3
- D - I - - 0x0191B7 13:91A7: 00        .byte $00
- D - I - - 0x0191B8 13:91A8: 81        .byte $81
- D - I - - 0x0191B9 13:91A9: 00        .byte $00
- D - I - - 0x0191BA 13:91AA: 01        .byte $01
- D - I - - 0x0191BB 13:91AB: 02        .byte $02
- D - I - - 0x0191BC 13:91AC: 03        .byte $03
- D - I - - 0x0191BD 13:91AD: 04        .byte $04
- D - I - - 0x0191BE 13:91AE: 03        .byte $03
- D - I - - 0x0191BF 13:91AF: 02        .byte $02
- D - I - - 0x0191C0 13:91B0: 01        .byte $01
- D - I - - 0x0191C1 13:91B1: 01        .byte $01
- D - I - - 0x0191C2 13:91B2: 02        .byte $02
- D - I - - 0x0191C3 13:91B3: 03        .byte $03
- D - I - - 0x0191C4 13:91B4: 04        .byte $04
- D - I - - 0x0191C5 13:91B5: 05        .byte $05
- D - I - - 0x0191C6 13:91B6: 04        .byte $04
- D - I - - 0x0191C7 13:91B7: 03        .byte $03
- D - I - - 0x0191C8 13:91B8: 02        .byte $02
- D - I - - 0x0191C9 13:91B9: 02        .byte $02
- D - I - - 0x0191CA 13:91BA: 03        .byte $03
- D - I - - 0x0191CB 13:91BB: 04        .byte $04
- D - I - - 0x0191CC 13:91BC: 05        .byte $05
- D - I - - 0x0191CD 13:91BD: 06        .byte $06
- D - I - - 0x0191CE 13:91BE: 05        .byte $05
- D - I - - 0x0191CF 13:91BF: 04        .byte $04
- D - I - - 0x0191D0 13:91C0: 03        .byte $03
- D - I - - 0x0191D1 13:91C1: 03        .byte $03
- D - I - - 0x0191D2 13:91C2: 04        .byte $04
- D - I - - 0x0191D3 13:91C3: 05        .byte $05
- D - I - - 0x0191D4 13:91C4: 06        .byte $06
- D - I - - 0x0191D5 13:91C5: 07        .byte $07
- D - I - - 0x0191D6 13:91C6: 06        .byte $06
- D - I - - 0x0191D7 13:91C7: 05        .byte $05
- D - I - - 0x0191D8 13:91C8: 04        .byte $04
- D - I - - 0x0191D9 13:91C9: 04        .byte $04
- D - I - - 0x0191DA 13:91CA: 05        .byte $05
- D - I - - 0x0191DB 13:91CB: 06        .byte $06
- D - I - - 0x0191DC 13:91CC: 07        .byte $07
- D - I - - 0x0191DD 13:91CD: 08        .byte $08
- D - I - - 0x0191DE 13:91CE: 07        .byte $07
- D - I - - 0x0191DF 13:91CF: 06        .byte $06
- D - I - - 0x0191E0 13:91D0: 05        .byte $05
- D - I - - 0x0191E1 13:91D1: 05        .byte $05
- D - I - - 0x0191E2 13:91D2: 06        .byte $06
- D - I - - 0x0191E3 13:91D3: 07        .byte $07
- D - I - - 0x0191E4 13:91D4: 08        .byte $08
- D - I - - 0x0191E5 13:91D5: 09        .byte $09
- D - I - - 0x0191E6 13:91D6: 08        .byte $08
- D - I - - 0x0191E7 13:91D7: 07        .byte $07
- D - I - - 0x0191E8 13:91D8: 06        .byte $06
- D - I - - 0x0191E9 13:91D9: 06        .byte $06
- D - I - - 0x0191EA 13:91DA: 07        .byte $07
- D - I - - 0x0191EB 13:91DB: 08        .byte $08
- D - I - - 0x0191EC 13:91DC: 09        .byte $09
- D - I - - 0x0191ED 13:91DD: 0A        .byte $0A
- D - I - - 0x0191EE 13:91DE: 09        .byte $09
- D - I - - 0x0191EF 13:91DF: 08        .byte $08
- D - I - - 0x0191F0 13:91E0: 07        .byte $07
- D - I - - 0x0191F1 13:91E1: 07        .byte $07
- D - I - - 0x0191F2 13:91E2: 08        .byte $08
- D - I - - 0x0191F3 13:91E3: 09        .byte $09
- D - I - - 0x0191F4 13:91E4: 0A        .byte $0A
- D - I - - 0x0191F5 13:91E5: 0B        .byte $0B
- D - I - - 0x0191F6 13:91E6: 0A        .byte $0A
- D - I - - 0x0191F7 13:91E7: 09        .byte $09
- D - I - - 0x0191F8 13:91E8: 08        .byte $08
- D - I - - 0x0191F9 13:91E9: FF        .byte $FF



_off000_91EA_0D_исчезновение_мяча:
- D - I - - 0x0191FA 13:91EA: 00        .byte $00
- D - I - - 0x0191FB 13:91EB: F4 91     .word off_91F4_0D_00_повтор
- D - I - - 0x0191FD 13:91ED: 01        .byte $01
- D - I - - 0x0191FE 13:91EE: 30 92     .word off_9230_0D_01
- D - I - - 0x019200 13:91F0: 03        .byte $03
- D - I - - 0x019201 13:91F1: F3 91     .word off_91F3_выкл
off_91F3_выкл:
- D - I - - 0x019203 13:91F3: FF        .byte $FF



off_91F4_0D_00_повтор:
- D - I - - 0x019204 13:91F4: E0        .byte $E0
- D - I - - 0x019205 13:91F5: 11        .byte $11
- D - I - - 0x019206 13:91F6: E2        .byte $E2
- D - I - - 0x019207 13:91F7: C0        .byte $C0
- D - I - - 0x019208 13:91F8: E3        .byte $E3
- D - I - - 0x019209 13:91F9: 00        .byte $00
- D - I - - 0x01920A 13:91FA: 81        .byte $81
- D - I - - 0x01920B 13:91FB: 48        .byte $48
- D - I - - 0x01920C 13:91FC: E5        .byte $E5
- D - I - - 0x01920D 13:91FD: 01        .byte $01
- D - I - - 0x01920E 13:91FE: 48        .byte $48
- D - I - - 0x01920F 13:91FF: E5        .byte $E5
- D - I - - 0x019210 13:9200: 02        .byte $02
- D - I - - 0x019211 13:9201: 48        .byte $48
- D - I - - 0x019212 13:9202: E5        .byte $E5
- D - I - - 0x019213 13:9203: 04        .byte $04
- D - I - - 0x019214 13:9204: 48        .byte $48
- D - I - - 0x019215 13:9205: E9        .byte $E9
- D - I - - 0x019216 13:9206: 1D 92     .word off_921D_отрезок
- D - I - - 0x019218 13:9208: E3        .byte $E3
- D - I - - 0x019219 13:9209: 08        .byte $08
- D - I - - 0x01921A 13:920A: E9        .byte $E9
- D - I - - 0x01921B 13:920B: 1D 92     .word off_921D_отрезок
- D - I - - 0x01921D 13:920D: E3        .byte $E3
- D - I - - 0x01921E 13:920E: 0A        .byte $0A
- D - I - - 0x01921F 13:920F: E9        .byte $E9
- D - I - - 0x019220 13:9210: 1D 92     .word off_921D_отрезок
- D - I - - 0x019222 13:9212: E3        .byte $E3
- D - I - - 0x019223 13:9213: 0C        .byte $0C
- D - I - - 0x019224 13:9214: E9        .byte $E9
- D - I - - 0x019225 13:9215: 1D 92     .word off_921D_отрезок
- D - I - - 0x019227 13:9217: E3        .byte $E3
- D - I - - 0x019228 13:9218: 0E        .byte $0E
- D - I - - 0x019229 13:9219: E9        .byte $E9
- D - I - - 0x01922A 13:921A: 1D 92     .word off_921D_отрезок
- D - I - - 0x01922C 13:921C: FF        .byte $FF
off_921D_отрезок:
- D - I - - 0x01922D 13:921D: E5        .byte $E5
- D - I - - 0x01922E 13:921E: 06        .byte $06
- D - I - - 0x01922F 13:921F: 48        .byte $48
- D - I - - 0x019230 13:9220: E5        .byte $E5
- D - I - - 0x019231 13:9221: 08        .byte $08
- D - I - - 0x019232 13:9222: 48        .byte $48
- D - I - - 0x019233 13:9223: E5        .byte $E5
- D - I - - 0x019234 13:9224: 0A        .byte $0A
- D - I - - 0x019235 13:9225: 48        .byte $48
- D - I - - 0x019236 13:9226: E5        .byte $E5
- D - I - - 0x019237 13:9227: 0C        .byte $0C
- D - I - - 0x019238 13:9228: 48        .byte $48
- D - I - - 0x019239 13:9229: E5        .byte $E5
- D - I - - 0x01923A 13:922A: 0E        .byte $0E
- D - I - - 0x01923B 13:922B: 48        .byte $48
- D - I - - 0x01923C 13:922C: E5        .byte $E5
- D - I - - 0x01923D 13:922D: 10        .byte $10
- D - I - - 0x01923E 13:922E: 48        .byte $48
- D - I - - 0x01923F 13:922F: EA        .byte $EA



off_9230_0D_01:
- D - I - - 0x019240 13:9230: 84        .byte $84
- D - I - - 0x019241 13:9231: 0C        .byte $0C
- D - I - - 0x019242 13:9232: E8        .byte $E8
- D - I - - 0x019243 13:9233: F4 91     .word off_91F4_0D_00_повтор



_off000_9235_09_полет_спешала:
- D - I - - 0x019245 13:9235: 00        .byte $00
- D - I - - 0x019246 13:9236: 3E 92     .word off_923E_выкл
- D - I - - 0x019248 13:9238: 01        .byte $01
- D - I - - 0x019249 13:9239: 3F 92     .word off_923F_09_01
- D - I - - 0x01924B 13:923B: 03        .byte $03
- D - I - - 0x01924C 13:923C: DC 92     .word off_92DC_09_03
off_923E_выкл:
- D - I - - 0x01924E 13:923E: FF        .byte $FF



off_923F_09_01:
- D - I - - 0x01924F 13:923F: E0        .byte $E0
- D - I - - 0x019250 13:9240: 14        .byte $14
- D - I - - 0x019251 13:9241: E2        .byte $E2
- D - I - - 0x019252 13:9242: 80        .byte $80
- D - I - - 0x019253 13:9243: E3        .byte $E3
- D - I - - 0x019254 13:9244: 08        .byte $08
- D - I - - 0x019255 13:9245: E9        .byte $E9
- D - I - - 0x019256 13:9246: C0 92     .word off_92C0_отрезок
- D - I - - 0x019258 13:9248: EB        .byte $EB
- D - I - - 0x019259 13:9249: 06        .byte $06
- D - I - - 0x01925A 13:924A: 03        .byte $03
- D - I - - 0x01925B 13:924B: 10        .byte $10
- D - I - - 0x01925C 13:924C: EC        .byte $EC
- D - I - - 0x01925D 13:924D: EB        .byte $EB
- D - I - - 0x01925E 13:924E: 07        .byte $07
- D - I - - 0x01925F 13:924F: 02        .byte $02
- D - I - - 0x019260 13:9250: 11        .byte $11
- D - I - - 0x019261 13:9251: EC        .byte $EC
- D - I - - 0x019262 13:9252: E3        .byte $E3
- D - I - - 0x019263 13:9253: 02        .byte $02
- D - I - - 0x019264 13:9254: EB        .byte $EB
- D - I - - 0x019265 13:9255: 03        .byte $03
- D - I - - 0x019266 13:9256: 02        .byte $02
- D - I - - 0x019267 13:9257: 14        .byte $14
- D - I - - 0x019268 13:9258: 02        .byte $02
- D - I - - 0x019269 13:9259: 15        .byte $15
- D - I - - 0x01926A 13:925A: 03        .byte $03
- D - I - - 0x01926B 13:925B: 14        .byte $14
- D - I - - 0x01926C 13:925C: 04        .byte $04
- D - I - - 0x01926D 13:925D: 13        .byte $13
- D - I - - 0x01926E 13:925E: EC        .byte $EC
- D - I - - 0x01926F 13:925F: E3        .byte $E3
- D - I - - 0x019270 13:9260: 03        .byte $03
- D - I - - 0x019271 13:9261: 02        .byte $02
- D - I - - 0x019272 13:9262: 15        .byte $15
- D - I - - 0x019273 13:9263: 03        .byte $03
- D - I - - 0x019274 13:9264: 14        .byte $14
- D - I - - 0x019275 13:9265: 04        .byte $04
- D - I - - 0x019276 13:9266: 13        .byte $13
- D - I - - 0x019277 13:9267: E3        .byte $E3
- D - I - - 0x019278 13:9268: 04        .byte $04
- D - I - - 0x019279 13:9269: 03        .byte $03
- D - I - - 0x01927A 13:926A: 14        .byte $14
- D - I - - 0x01927B 13:926B: 02        .byte $02
- D - I - - 0x01927C 13:926C: 15        .byte $15
- D - I - - 0x01927D 13:926D: 03        .byte $03
- D - I - - 0x01927E 13:926E: 14        .byte $14
- D - I - - 0x01927F 13:926F: E3        .byte $E3
- D - I - - 0x019280 13:9270: 05        .byte $05
- D - I - - 0x019281 13:9271: 04        .byte $04
- D - I - - 0x019282 13:9272: 13        .byte $13
- D - I - - 0x019283 13:9273: 03        .byte $03
- D - I - - 0x019284 13:9274: 14        .byte $14
- D - I - - 0x019285 13:9275: 02        .byte $02
- D - I - - 0x019286 13:9276: 15        .byte $15
- D - I - - 0x019287 13:9277: E3        .byte $E3
- D - I - - 0x019288 13:9278: 06        .byte $06
- D - I - - 0x019289 13:9279: 02        .byte $02
- D - I - - 0x01928A 13:927A: 14        .byte $14
- D - I - - 0x01928B 13:927B: 03        .byte $03
- D - I - - 0x01928C 13:927C: 12        .byte $12
- D - I - - 0x01928D 13:927D: 02        .byte $02
- D - I - - 0x01928E 13:927E: 13        .byte $13
- D - I - - 0x01928F 13:927F: E3        .byte $E3
- D - I - - 0x019290 13:9280: 07        .byte $07
- D - I - - 0x019291 13:9281: 01        .byte $01
- D - I - - 0x019292 13:9282: 14        .byte $14
- D - I - - 0x019293 13:9283: 02        .byte $02
- D - I - - 0x019294 13:9284: 13        .byte $13
- D - I - - 0x019295 13:9285: 03        .byte $03
- D - I - - 0x019296 13:9286: 12        .byte $12
- D - I - - 0x019297 13:9287: E3        .byte $E3
- D - I - - 0x019298 13:9288: 08        .byte $08
- D - I - - 0x019299 13:9289: 02        .byte $02
- D - I - - 0x01929A 13:928A: 13        .byte $13
- D - I - - 0x01929B 13:928B: 01        .byte $01
- D - I - - 0x01929C 13:928C: 14        .byte $14
- D - I - - 0x01929D 13:928D: 02        .byte $02
- D - I - - 0x01929E 13:928E: 13        .byte $13
- D - I - - 0x01929F 13:928F: E3        .byte $E3
- D - I - - 0x0192A0 13:9290: 09        .byte $09
- D - I - - 0x0192A1 13:9291: 03        .byte $03
- D - I - - 0x0192A2 13:9292: 12        .byte $12
- D - I - - 0x0192A3 13:9293: 02        .byte $02
- D - I - - 0x0192A4 13:9294: 13        .byte $13
- D - I - - 0x0192A5 13:9295: 01        .byte $01
- D - I - - 0x0192A6 13:9296: 14        .byte $14
- D - I - - 0x0192A7 13:9297: E3        .byte $E3
- D - I - - 0x0192A8 13:9298: 0A        .byte $0A
- D - I - - 0x0192A9 13:9299: 01        .byte $01
- D - I - - 0x0192AA 13:929A: 12        .byte $12
- D - I - - 0x0192AB 13:929B: 02        .byte $02
- D - I - - 0x0192AC 13:929C: 11        .byte $11
- D - I - - 0x0192AD 13:929D: 01        .byte $01
- D - I - - 0x0192AE 13:929E: 12        .byte $12
- D - I - - 0x0192AF 13:929F: E3        .byte $E3
- D - I - - 0x0192B0 13:92A0: 0B        .byte $0B
- D - I - - 0x0192B1 13:92A1: 00        .byte $00
- D - I - - 0x0192B2 13:92A2: 13        .byte $13
- D - I - - 0x0192B3 13:92A3: 01        .byte $01
- D - I - - 0x0192B4 13:92A4: 12        .byte $12
- D - I - - 0x0192B5 13:92A5: 02        .byte $02
- D - I - - 0x0192B6 13:92A6: 11        .byte $11
- D - I - - 0x0192B7 13:92A7: E3        .byte $E3
- D - I - - 0x0192B8 13:92A8: 0C        .byte $0C
- D - I - - 0x0192B9 13:92A9: 01        .byte $01
- D - I - - 0x0192BA 13:92AA: 12        .byte $12
- D - I - - 0x0192BB 13:92AB: 00        .byte $00
- D - I - - 0x0192BC 13:92AC: 13        .byte $13
- D - I - - 0x0192BD 13:92AD: 01        .byte $01
- D - I - - 0x0192BE 13:92AE: 12        .byte $12
- D - I - - 0x0192BF 13:92AF: E3        .byte $E3
- D - I - - 0x0192C0 13:92B0: 0D        .byte $0D
- D - I - - 0x0192C1 13:92B1: 02        .byte $02
- D - I - - 0x0192C2 13:92B2: 11        .byte $11
- D - I - - 0x0192C3 13:92B3: 01        .byte $01
- D - I - - 0x0192C4 13:92B4: 12        .byte $12
- D - I - - 0x0192C5 13:92B5: 00        .byte $00
- D - I - - 0x0192C6 13:92B6: 13        .byte $13
- D - I - - 0x0192C7 13:92B7: E3        .byte $E3
- D - I - - 0x0192C8 13:92B8: 0E        .byte $0E
- D - I - - 0x0192C9 13:92B9: 01        .byte $01
- D - I - - 0x0192CA 13:92BA: 12        .byte $12
- D - I - - 0x0192CB 13:92BB: 02        .byte $02
- D - I - - 0x0192CC 13:92BC: 11        .byte $11
- D - I - - 0x0192CD 13:92BD: 01        .byte $01
- D - I - - 0x0192CE 13:92BE: 12        .byte $12
- D - I - - 0x0192CF 13:92BF: FF        .byte $FF
off_92C0_отрезок:
- D - I - - 0x0192D0 13:92C0: EB        .byte $EB
- D - I - - 0x0192D1 13:92C1: 02        .byte $02
- D - I - - 0x0192D2 13:92C2: 81        .byte $81
- D - I - - 0x0192D3 13:92C3: 07        .byte $07
- D - I - - 0x0192D4 13:92C4: 82        .byte $82
- D - I - - 0x0192D5 13:92C5: 08        .byte $08
- D - I - - 0x0192D6 13:92C6: EC        .byte $EC
- D - I - - 0x0192D7 13:92C7: EB        .byte $EB
- D - I - - 0x0192D8 13:92C8: 03        .byte $03
- D - I - - 0x0192D9 13:92C9: 82        .byte $82
- D - I - - 0x0192DA 13:92CA: 06        .byte $06
- D - I - - 0x0192DB 13:92CB: 81        .byte $81
- D - I - - 0x0192DC 13:92CC: 09        .byte $09
- D - I - - 0x0192DD 13:92CD: EC        .byte $EC
- D - I - - 0x0192DE 13:92CE: EB        .byte $EB
- D - I - - 0x0192DF 13:92CF: 04        .byte $04
- D - I - - 0x0192E0 13:92D0: 81        .byte $81
- D - I - - 0x0192E1 13:92D1: 05        .byte $05
- D - I - - 0x0192E2 13:92D2: 82        .byte $82
- D - I - - 0x0192E3 13:92D3: 0A        .byte $0A
- D - I - - 0x0192E4 13:92D4: EC        .byte $EC
- D - I - - 0x0192E5 13:92D5: EB        .byte $EB
- D - I - - 0x0192E6 13:92D6: 05        .byte $05
- D - I - - 0x0192E7 13:92D7: 81        .byte $81
- D - I - - 0x0192E8 13:92D8: 04        .byte $04
- D - I - - 0x0192E9 13:92D9: 0B        .byte $0B
- D - I - - 0x0192EA 13:92DA: EC        .byte $EC
- D - I - - 0x0192EB 13:92DB: EA        .byte $EA



off_92DC_09_03:
- D - I - - 0x0192EC 13:92DC: E0        .byte $E0
- D - I - - 0x0192ED 13:92DD: 14        .byte $14
- D - I - - 0x0192EE 13:92DE: E3        .byte $E3
- D - I - - 0x0192EF 13:92DF: 02        .byte $02
- D - I - - 0x0192F0 13:92E0: E9        .byte $E9
- D - I - - 0x0192F1 13:92E1: C0 92     .word off_92C0_отрезок
- D - I - - 0x0192F3 13:92E3: EB        .byte $EB
- D - I - - 0x0192F4 13:92E4: 06        .byte $06
- D - I - - 0x0192F5 13:92E5: 03        .byte $03
- D - I - - 0x0192F6 13:92E6: 0C        .byte $0C
- D - I - - 0x0192F7 13:92E7: EC        .byte $EC
- D - I - - 0x0192F8 13:92E8: EB        .byte $EB
- D - I - - 0x0192F9 13:92E9: 07        .byte $07
- D - I - - 0x0192FA 13:92EA: 02        .byte $02
- D - I - - 0x0192FB 13:92EB: 0D        .byte $0D
- D - I - - 0x0192FC 13:92EC: EC        .byte $EC
- D - I - - 0x0192FD 13:92ED: EB        .byte $EB
- D - I - - 0x0192FE 13:92EE: 03        .byte $03
- D - I - - 0x0192FF 13:92EF: 01        .byte $01
- D - I - - 0x019300 13:92F0: 0E        .byte $0E
- D - I - - 0x019301 13:92F1: 00        .byte $00
- D - I - - 0x019302 13:92F2: 0F        .byte $0F
- D - I - - 0x019303 13:92F3: 01        .byte $01
- D - I - - 0x019304 13:92F4: 0E        .byte $0E
- D - I - - 0x019305 13:92F5: 02        .byte $02
- D - I - - 0x019306 13:92F6: 0D        .byte $0D
- D - I - - 0x019307 13:92F7: EC        .byte $EC
- D - I - - 0x019308 13:92F8: E3        .byte $E3
- D - I - - 0x019309 13:92F9: 03        .byte $03
- D - I - - 0x01930A 13:92FA: 00        .byte $00
- D - I - - 0x01930B 13:92FB: 0F        .byte $0F
- D - I - - 0x01930C 13:92FC: 01        .byte $01
- D - I - - 0x01930D 13:92FD: 0E        .byte $0E
- D - I - - 0x01930E 13:92FE: 02        .byte $02
- D - I - - 0x01930F 13:92FF: 0D        .byte $0D
- D - I - - 0x019310 13:9300: E3        .byte $E3
- D - I - - 0x019311 13:9301: 04        .byte $04
- D - I - - 0x019312 13:9302: 01        .byte $01
- D - I - - 0x019313 13:9303: 0E        .byte $0E
- D - I - - 0x019314 13:9304: 00        .byte $00
- D - I - - 0x019315 13:9305: 0F        .byte $0F
- D - I - - 0x019316 13:9306: 01        .byte $01
- D - I - - 0x019317 13:9307: 0E        .byte $0E
- D - I - - 0x019318 13:9308: E3        .byte $E3
- D - I - - 0x019319 13:9309: 05        .byte $05
- D - I - - 0x01931A 13:930A: 02        .byte $02
- D - I - - 0x01931B 13:930B: 0D        .byte $0D
- D - I - - 0x01931C 13:930C: 01        .byte $01
- D - I - - 0x01931D 13:930D: 0E        .byte $0E
- D - I - - 0x01931E 13:930E: 00        .byte $00
- D - I - - 0x01931F 13:930F: 0F        .byte $0F
- D - I - - 0x019320 13:9310: E3        .byte $E3
- D - I - - 0x019321 13:9311: 06        .byte $06
- D - I - - 0x019322 13:9312: 01        .byte $01
- D - I - - 0x019323 13:9313: 0E        .byte $0E
- D - I - - 0x019324 13:9314: 02        .byte $02
- D - I - - 0x019325 13:9315: 0D        .byte $0D
- D - I - - 0x019326 13:9316: 01        .byte $01
- D - I - - 0x019327 13:9317: 0E        .byte $0E
- D - I - - 0x019328 13:9318: E3        .byte $E3
- D - I - - 0x019329 13:9319: 07        .byte $07
- D - I - - 0x01932A 13:931A: 00        .byte $00
- D - I - - 0x01932B 13:931B: 0F        .byte $0F
- D - I - - 0x01932C 13:931C: 01        .byte $01
- D - I - - 0x01932D 13:931D: 0E        .byte $0E
- D - I - - 0x01932E 13:931E: 02        .byte $02
- D - I - - 0x01932F 13:931F: 0D        .byte $0D
- D - I - - 0x019330 13:9320: E3        .byte $E3
- D - I - - 0x019331 13:9321: 08        .byte $08
- D - I - - 0x019332 13:9322: 01        .byte $01
- D - I - - 0x019333 13:9323: 0E        .byte $0E
- D - I - - 0x019334 13:9324: 00        .byte $00
- D - I - - 0x019335 13:9325: 0F        .byte $0F
- D - I - - 0x019336 13:9326: 01        .byte $01
- D - I - - 0x019337 13:9327: 0E        .byte $0E
- D - I - - 0x019338 13:9328: E3        .byte $E3
- D - I - - 0x019339 13:9329: 09        .byte $09
- D - I - - 0x01933A 13:932A: 02        .byte $02
- D - I - - 0x01933B 13:932B: 0D        .byte $0D
- D - I - - 0x01933C 13:932C: 01        .byte $01
- D - I - - 0x01933D 13:932D: 0E        .byte $0E
- D - I - - 0x01933E 13:932E: 00        .byte $00
- D - I - - 0x01933F 13:932F: 0F        .byte $0F
- D - I - - 0x019340 13:9330: E3        .byte $E3
- D - I - - 0x019341 13:9331: 0A        .byte $0A
- D - I - - 0x019342 13:9332: 01        .byte $01
- D - I - - 0x019343 13:9333: 0E        .byte $0E
- D - I - - 0x019344 13:9334: 02        .byte $02
- D - I - - 0x019345 13:9335: 0D        .byte $0D
- D - I - - 0x019346 13:9336: 01        .byte $01
- D - I - - 0x019347 13:9337: 0E        .byte $0E
- D - I - - 0x019348 13:9338: E3        .byte $E3
- D - I - - 0x019349 13:9339: 0B        .byte $0B
- D - I - - 0x01934A 13:933A: 00        .byte $00
- D - I - - 0x01934B 13:933B: 0F        .byte $0F
- D - I - - 0x01934C 13:933C: 01        .byte $01
- D - I - - 0x01934D 13:933D: 0E        .byte $0E
- D - I - - 0x01934E 13:933E: 02        .byte $02
- D - I - - 0x01934F 13:933F: 0D        .byte $0D
- D - I - - 0x019350 13:9340: E3        .byte $E3
- D - I - - 0x019351 13:9341: 0C        .byte $0C
- D - I - - 0x019352 13:9342: 01        .byte $01
- D - I - - 0x019353 13:9343: 0E        .byte $0E
- D - I - - 0x019354 13:9344: 00        .byte $00
- D - I - - 0x019355 13:9345: 0F        .byte $0F
- D - I - - 0x019356 13:9346: 01        .byte $01
- D - I - - 0x019357 13:9347: 0E        .byte $0E
- D - I - - 0x019358 13:9348: E3        .byte $E3
- D - I - - 0x019359 13:9349: 0D        .byte $0D
- D - I - - 0x01935A 13:934A: 02        .byte $02
- D - I - - 0x01935B 13:934B: 0D        .byte $0D
- D - I - - 0x01935C 13:934C: 01        .byte $01
- D - I - - 0x01935D 13:934D: 0E        .byte $0E
- D - I - - 0x01935E 13:934E: 00        .byte $00
- D - I - - 0x01935F 13:934F: 0F        .byte $0F
- D - I - - 0x019360 13:9350: E3        .byte $E3
- D - I - - 0x019361 13:9351: 0E        .byte $0E
- D - I - - 0x019362 13:9352: 01        .byte $01
- D - I - - 0x019363 13:9353: 0E        .byte $0E
- D - I - - 0x019364 13:9354: 02        .byte $02
- D - I - - 0x019365 13:9355: 0D        .byte $0D
- D - I - - 0x019366 13:9356: 01        .byte $01
- D - I - - 0x019367 13:9357: 0E        .byte $0E
- D - I - - 0x019368 13:9358: FF        .byte $FF



_off000_9359_17_замах_соды:
- D - I - - 0x019369 13:9359: 00        .byte $00
- D - I - - 0x01936A 13:935A: 63 93     .word off_9363_17_00
- D - I - - 0x01936C 13:935C: 01        .byte $01
- D - I - - 0x01936D 13:935D: A7 93     .word off_93A7_17_01
- D - I - - 0x01936F 13:935F: 03        .byte $03
- D - I - - 0x019370 13:9360: EB 93     .word off_93EB_17_03
- D - I - - 0x019372 13:9362: FF        .byte $FF



off_9363_17_00:
- D - I - - 0x019373 13:9363: E0        .byte $E0
- D - I - - 0x019374 13:9364: 13        .byte $13
- D - I - - 0x019375 13:9365: E2        .byte $E2
- D - I - - 0x019376 13:9366: 40        .byte $40
- D - I - - 0x019377 13:9367: 81        .byte $81
- D - I - - 0x019378 13:9368: E3        .byte $E3
- D - I - - 0x019379 13:9369: 07        .byte $07
- D - I - - 0x01937A 13:936A: 11        .byte $11
- D - I - - 0x01937B 13:936B: 12        .byte $12
- D - I - - 0x01937C 13:936C: 13        .byte $13
- D - I - - 0x01937D 13:936D: 14        .byte $14
- D - I - - 0x01937E 13:936E: 15        .byte $15
- D - I - - 0x01937F 13:936F: 16        .byte $16
- D - I - - 0x019380 13:9370: 17        .byte $17
- D - I - - 0x019381 13:9371: 18        .byte $18
- D - I - - 0x019382 13:9372: 19        .byte $19
- D - I - - 0x019383 13:9373: 12        .byte $12
- D - I - - 0x019384 13:9374: 13        .byte $13
- D - I - - 0x019385 13:9375: 14        .byte $14
- D - I - - 0x019386 13:9376: 15        .byte $15
- D - I - - 0x019387 13:9377: 16        .byte $16
- D - I - - 0x019388 13:9378: 17        .byte $17
- D - I - - 0x019389 13:9379: 18        .byte $18
- D - I - - 0x01938A 13:937A: 19        .byte $19
- D - I - - 0x01938B 13:937B: 13        .byte $13
- D - I - - 0x01938C 13:937C: 14        .byte $14
- D - I - - 0x01938D 13:937D: 15        .byte $15
- D - I - - 0x01938E 13:937E: 16        .byte $16
- D - I - - 0x01938F 13:937F: 17        .byte $17
- D - I - - 0x019390 13:9380: 18        .byte $18
- D - I - - 0x019391 13:9381: 19        .byte $19
- D - I - - 0x019392 13:9382: 14        .byte $14
- D - I - - 0x019393 13:9383: 15        .byte $15
- D - I - - 0x019394 13:9384: 16        .byte $16
- D - I - - 0x019395 13:9385: 17        .byte $17
- D - I - - 0x019396 13:9386: 18        .byte $18
- D - I - - 0x019397 13:9387: 19        .byte $19
- D - I - - 0x019398 13:9388: 15        .byte $15
- D - I - - 0x019399 13:9389: 16        .byte $16
- D - I - - 0x01939A 13:938A: 17        .byte $17
- D - I - - 0x01939B 13:938B: 18        .byte $18
- D - I - - 0x01939C 13:938C: 19        .byte $19
- D - I - - 0x01939D 13:938D: 16        .byte $16
- D - I - - 0x01939E 13:938E: 17        .byte $17
- D - I - - 0x01939F 13:938F: 18        .byte $18
- D - I - - 0x0193A0 13:9390: 19        .byte $19
- D - I - - 0x0193A1 13:9391: 17        .byte $17
- D - I - - 0x0193A2 13:9392: 18        .byte $18
- D - I - - 0x0193A3 13:9393: 19        .byte $19
- D - I - - 0x0193A4 13:9394: 18        .byte $18
- D - I - - 0x0193A5 13:9395: 19        .byte $19
- D - I - - 0x0193A6 13:9396: E3        .byte $E3
- D - I - - 0x0193A7 13:9397: 06        .byte $06
- D - I - - 0x0193A8 13:9398: 18        .byte $18
- D - I - - 0x0193A9 13:9399: 19        .byte $19
- D - I - - 0x0193AA 13:939A: 18        .byte $18
- D - I - - 0x0193AB 13:939B: 19        .byte $19
- D - I - - 0x0193AC 13:939C: E3        .byte $E3
- D - I - - 0x0193AD 13:939D: 05        .byte $05
- D - I - - 0x0193AE 13:939E: 18        .byte $18
- D - I - - 0x0193AF 13:939F: 19        .byte $19
- D - I - - 0x0193B0 13:93A0: 18        .byte $18
- D - I - - 0x0193B1 13:93A1: 19        .byte $19
- D - I - - 0x0193B2 13:93A2: E3        .byte $E3
- D - I - - 0x0193B3 13:93A3: 04        .byte $04
- D - I - - 0x0193B4 13:93A4: 18        .byte $18
- D - I - - 0x0193B5 13:93A5: 19        .byte $19
- D - I - - 0x0193B6 13:93A6: FF        .byte $FF



off_93A7_17_01:
- D - I - - 0x0193B7 13:93A7: E0        .byte $E0
- D - I - - 0x0193B8 13:93A8: 13        .byte $13
- D - I - - 0x0193B9 13:93A9: E2        .byte $E2
- D - I - - 0x0193BA 13:93AA: 80        .byte $80
- D - I - - 0x0193BB 13:93AB: 81        .byte $81
- D - I - - 0x0193BC 13:93AC: E3        .byte $E3
- D - I - - 0x0193BD 13:93AD: 07        .byte $07
- D - I - - 0x0193BE 13:93AE: 12        .byte $12
- D - I - - 0x0193BF 13:93AF: 13        .byte $13
- D - I - - 0x0193C0 13:93B0: 14        .byte $14
- D - I - - 0x0193C1 13:93B1: 15        .byte $15
- D - I - - 0x0193C2 13:93B2: 16        .byte $16
- D - I - - 0x0193C3 13:93B3: 17        .byte $17
- D - I - - 0x0193C4 13:93B4: 18        .byte $18
- D - I - - 0x0193C5 13:93B5: 19        .byte $19
- D - I - - 0x0193C6 13:93B6: 1A        .byte $1A
- D - I - - 0x0193C7 13:93B7: 13        .byte $13
- D - I - - 0x0193C8 13:93B8: 14        .byte $14
- D - I - - 0x0193C9 13:93B9: 15        .byte $15
- D - I - - 0x0193CA 13:93BA: 16        .byte $16
- D - I - - 0x0193CB 13:93BB: 17        .byte $17
- D - I - - 0x0193CC 13:93BC: 18        .byte $18
- D - I - - 0x0193CD 13:93BD: 19        .byte $19
- D - I - - 0x0193CE 13:93BE: 1A        .byte $1A
- D - I - - 0x0193CF 13:93BF: 14        .byte $14
- D - I - - 0x0193D0 13:93C0: 15        .byte $15
- D - I - - 0x0193D1 13:93C1: 16        .byte $16
- D - I - - 0x0193D2 13:93C2: 17        .byte $17
- D - I - - 0x0193D3 13:93C3: 18        .byte $18
- D - I - - 0x0193D4 13:93C4: 19        .byte $19
- D - I - - 0x0193D5 13:93C5: 1A        .byte $1A
- D - I - - 0x0193D6 13:93C6: 15        .byte $15
- D - I - - 0x0193D7 13:93C7: 16        .byte $16
- D - I - - 0x0193D8 13:93C8: 17        .byte $17
- D - I - - 0x0193D9 13:93C9: 18        .byte $18
- D - I - - 0x0193DA 13:93CA: 19        .byte $19
- D - I - - 0x0193DB 13:93CB: 1A        .byte $1A
- D - I - - 0x0193DC 13:93CC: 16        .byte $16
- D - I - - 0x0193DD 13:93CD: 17        .byte $17
- D - I - - 0x0193DE 13:93CE: 18        .byte $18
- D - I - - 0x0193DF 13:93CF: 19        .byte $19
- D - I - - 0x0193E0 13:93D0: 1A        .byte $1A
- D - I - - 0x0193E1 13:93D1: 17        .byte $17
- D - I - - 0x0193E2 13:93D2: 18        .byte $18
- D - I - - 0x0193E3 13:93D3: 19        .byte $19
- D - I - - 0x0193E4 13:93D4: 1A        .byte $1A
- D - I - - 0x0193E5 13:93D5: 18        .byte $18
- D - I - - 0x0193E6 13:93D6: 19        .byte $19
- D - I - - 0x0193E7 13:93D7: 1A        .byte $1A
- D - I - - 0x0193E8 13:93D8: 19        .byte $19
- D - I - - 0x0193E9 13:93D9: 1A        .byte $1A
- D - I - - 0x0193EA 13:93DA: E3        .byte $E3
- D - I - - 0x0193EB 13:93DB: 06        .byte $06
- D - I - - 0x0193EC 13:93DC: 19        .byte $19
- D - I - - 0x0193ED 13:93DD: 1A        .byte $1A
- D - I - - 0x0193EE 13:93DE: 19        .byte $19
- D - I - - 0x0193EF 13:93DF: 1A        .byte $1A
- D - I - - 0x0193F0 13:93E0: E3        .byte $E3
- D - I - - 0x0193F1 13:93E1: 05        .byte $05
- D - I - - 0x0193F2 13:93E2: 19        .byte $19
- D - I - - 0x0193F3 13:93E3: 1A        .byte $1A
- D - I - - 0x0193F4 13:93E4: 19        .byte $19
- D - I - - 0x0193F5 13:93E5: 1A        .byte $1A
- D - I - - 0x0193F6 13:93E6: E3        .byte $E3
- D - I - - 0x0193F7 13:93E7: 04        .byte $04
- D - I - - 0x0193F8 13:93E8: 19        .byte $19
- D - I - - 0x0193F9 13:93E9: 1A        .byte $1A
- D - I - - 0x0193FA 13:93EA: FF        .byte $FF



off_93EB_17_03:
- D - I - - 0x0193FB 13:93EB: 81        .byte $81
- D - I - - 0x0193FC 13:93EC: E0        .byte $E0
- D - I - - 0x0193FD 13:93ED: 12        .byte $12
- D - I - - 0x0193FE 13:93EE: E3        .byte $E3
- D - I - - 0x0193FF 13:93EF: 07        .byte $07
- D - I - - 0x019400 13:93F0: 02        .byte $02
- D - I - - 0x019401 13:93F1: 03        .byte $03
- D - I - - 0x019402 13:93F2: 04        .byte $04
- D - I - - 0x019403 13:93F3: 05        .byte $05
- D - I - - 0x019404 13:93F4: 06        .byte $06
- D - I - - 0x019405 13:93F5: 07        .byte $07
- D - I - - 0x019406 13:93F6: 08        .byte $08
- D - I - - 0x019407 13:93F7: 09        .byte $09
- D - I - - 0x019408 13:93F8: 0A        .byte $0A
- D - I - - 0x019409 13:93F9: 03        .byte $03
- D - I - - 0x01940A 13:93FA: 04        .byte $04
- D - I - - 0x01940B 13:93FB: 05        .byte $05
- D - I - - 0x01940C 13:93FC: 06        .byte $06
- D - I - - 0x01940D 13:93FD: 07        .byte $07
- D - I - - 0x01940E 13:93FE: 08        .byte $08
- D - I - - 0x01940F 13:93FF: 09        .byte $09
- D - I - - 0x019410 13:9400: 0A        .byte $0A
- D - I - - 0x019411 13:9401: 04        .byte $04
- D - I - - 0x019412 13:9402: 05        .byte $05
- D - I - - 0x019413 13:9403: 06        .byte $06
- D - I - - 0x019414 13:9404: 07        .byte $07
- D - I - - 0x019415 13:9405: 08        .byte $08
- D - I - - 0x019416 13:9406: 09        .byte $09
- D - I - - 0x019417 13:9407: 0A        .byte $0A
- D - I - - 0x019418 13:9408: 05        .byte $05
- D - I - - 0x019419 13:9409: 06        .byte $06
- D - I - - 0x01941A 13:940A: 07        .byte $07
- D - I - - 0x01941B 13:940B: 08        .byte $08
- D - I - - 0x01941C 13:940C: 09        .byte $09
- D - I - - 0x01941D 13:940D: 0A        .byte $0A
- D - I - - 0x01941E 13:940E: 06        .byte $06
- D - I - - 0x01941F 13:940F: 07        .byte $07
- D - I - - 0x019420 13:9410: 08        .byte $08
- D - I - - 0x019421 13:9411: 09        .byte $09
- D - I - - 0x019422 13:9412: 0A        .byte $0A
- D - I - - 0x019423 13:9413: 07        .byte $07
- D - I - - 0x019424 13:9414: 08        .byte $08
- D - I - - 0x019425 13:9415: 09        .byte $09
- D - I - - 0x019426 13:9416: 0A        .byte $0A
- D - I - - 0x019427 13:9417: 08        .byte $08
- D - I - - 0x019428 13:9418: 09        .byte $09
- D - I - - 0x019429 13:9419: 0A        .byte $0A
- D - I - - 0x01942A 13:941A: 09        .byte $09
- D - I - - 0x01942B 13:941B: 0A        .byte $0A
- D - I - - 0x01942C 13:941C: E3        .byte $E3
- D - I - - 0x01942D 13:941D: 06        .byte $06
- D - I - - 0x01942E 13:941E: 09        .byte $09
- D - I - - 0x01942F 13:941F: 0A        .byte $0A
- D - I - - 0x019430 13:9420: 09        .byte $09
- D - I - - 0x019431 13:9421: 0A        .byte $0A
- D - I - - 0x019432 13:9422: E3        .byte $E3
- D - I - - 0x019433 13:9423: 05        .byte $05
- D - I - - 0x019434 13:9424: 09        .byte $09
- D - I - - 0x019435 13:9425: 0A        .byte $0A
- D - I - - 0x019436 13:9426: 09        .byte $09
- D - I - - 0x019437 13:9427: 0A        .byte $0A
- D - I - - 0x019438 13:9428: E3        .byte $E3
- D - I - - 0x019439 13:9429: 04        .byte $04
- D - I - - 0x01943A 13:942A: 09        .byte $09
- D - I - - 0x01943B 13:942B: 0A        .byte $0A
- D - I - - 0x01943C 13:942C: FF        .byte $FF



_off000_942D_12_обычный_удар_с_земли:
- D - I - - 0x01943D 13:942D: 00        .byte $00
- D - I - - 0x01943E 13:942E: 36 94     .word off_9436_выкл
- D - I - - 0x019440 13:9430: 01        .byte $01
- D - I - - 0x019441 13:9431: 37 94     .word off_9437_12_2B_01
- D - I - - 0x019443 13:9433: 03        .byte $03
- D - I - - 0x019444 13:9434: 44 94     .word off_9444_12_03
off_9436_выкл:
- D - I - - 0x019446 13:9436: FF        .byte $FF



off_9437_12_2B_01:
- D - I - - 0x019447 13:9437: E0        .byte $E0
- D - I - - 0x019448 13:9438: 12        .byte $12
- D - I - - 0x019449 13:9439: E2        .byte $E2
- D - I - - 0x01944A 13:943A: 80        .byte $80
- D - I - - 0x01944B 13:943B: E3        .byte $E3
- D - I - - 0x01944C 13:943C: 00        .byte $00
- D - I - - 0x01944D 13:943D: 81        .byte $81
- D - I - - 0x01944E 13:943E: 10        .byte $10
- D - I - - 0x01944F 13:943F: 20        .byte $20
- D - I - - 0x019450 13:9440: 00        .byte $00
- D - I - - 0x019451 13:9441: 10        .byte $10
- D - I - - 0x019452 13:9442: 20        .byte $20
- D - I - - 0x019453 13:9443: FF        .byte $FF



off_9444_12_03:
- D - I - - 0x019454 13:9444: E9        .byte $E9
- D - I - - 0x019455 13:9445: 49 94     .word off_9449_отрезок
- D - I - - 0x019457 13:9447: 05        .byte $05
- D - I - - 0x019458 13:9448: FF        .byte $FF
off_9449_отрезок:
- D - I - - 0x019459 13:9449: E0        .byte $E0
- D - I - - 0x01945A 13:944A: 15        .byte $15
- D - I - - 0x01945B 13:944B: E3        .byte $E3
- D - I - - 0x01945C 13:944C: 00        .byte $00
- D - I - - 0x01945D 13:944D: 84        .byte $84
- D - I - - 0x01945E 13:944E: ED        .byte $ED
- D - I - - 0x01945F 13:944F: 01        .byte $01
- D - I - - 0x019460 13:9450: 0A        .byte $0A
- D - I - - 0x019461 13:9451: 8E        .byte $8E
- D - I - - 0x019462 13:9452: EA        .byte $EA



_off000_9453_2B_отбитие_мяча:
- D - I - - 0x019463 13:9453: 00        .byte $00
- D - I - - 0x019464 13:9454: 5C 94     .word off_945C_выкл
- D - I - - 0x019466 13:9456: 01        .byte $01
- D - I - - 0x019467 13:9457: 37 94     .word off_9437_12_2B_01
- D - I - - 0x019469 13:9459: 03        .byte $03
- D - I - - 0x01946A 13:945A: 5D 94     .word off_945D_2B_03
off_945C_выкл:
- D - I - - 0x01946C 13:945C: FF        .byte $FF



off_945D_2B_03:
- D - I - - 0x01946D 13:945D: E9        .byte $E9
- D - I - - 0x01946E 13:945E: 49 94     .word off_9449_отрезок
- D - I - - 0x019470 13:9460: 0F        .byte $0F
- D - I - - 0x019471 13:9461: FF        .byte $FF



_off000_9462_13_сильный_удар_с_земли:
- D - I - - 0x019472 13:9462: 00        .byte $00
- D - I - - 0x019473 13:9463: 6B 94     .word off_946B_выкл
- D - I - - 0x019475 13:9465: 01        .byte $01
- D - I - - 0x019476 13:9466: 6C 94     .word off_946C_13_01
- D - I - - 0x019478 13:9468: 03        .byte $03
- D - I - - 0x019479 13:9469: 91 94     .word off_9491_13_03
off_946B_выкл:
- D - I - - 0x01947B 13:946B: FF        .byte $FF



off_946C_13_01:
- D - I - - 0x01947C 13:946C: E0        .byte $E0
- D - I - - 0x01947D 13:946D: 12        .byte $12
- D - I - - 0x01947E 13:946E: E2        .byte $E2
- D - I - - 0x01947F 13:946F: 80        .byte $80
- D - I - - 0x019480 13:9470: E3        .byte $E3
- D - I - - 0x019481 13:9471: 00        .byte $00
off_9472_повтор:
- D - I - - 0x019482 13:9472: 81        .byte $81
- D - I - - 0x019483 13:9473: 15        .byte $15
- D - I - - 0x019484 13:9474: 14        .byte $14
- D - I - - 0x019485 13:9475: 12        .byte $12
- D - I - - 0x019486 13:9476: 10        .byte $10
- D - I - - 0x019487 13:9477: 0B        .byte $0B
- D - I - - 0x019488 13:9478: 09        .byte $09
- D - I - - 0x019489 13:9479: 07        .byte $07
- D - I - - 0x01948A 13:947A: 05        .byte $05
- D - I - - 0x01948B 13:947B: 04        .byte $04
- D - I - - 0x01948C 13:947C: E3        .byte $E3
- D - I - - 0x01948D 13:947D: 09        .byte $09
- D - I - - 0x01948E 13:947E: 15        .byte $15
- D - I - - 0x01948F 13:947F: 13        .byte $13
- D - I - - 0x019490 13:9480: 14        .byte $14
- D - I - - 0x019491 13:9481: 12        .byte $12
- D - I - - 0x019492 13:9482: 13        .byte $13
- D - I - - 0x019493 13:9483: 11        .byte $11
- D - I - - 0x019494 13:9484: 12        .byte $12
- D - I - - 0x019495 13:9485: 10        .byte $10
- D - I - - 0x019496 13:9486: 09        .byte $09
- D - I - - 0x019497 13:9487: 08        .byte $08
- D - I - - 0x019498 13:9488: 07        .byte $07
- D - I - - 0x019499 13:9489: 06        .byte $06
- D - I - - 0x01949A 13:948A: 05        .byte $05
- D - I - - 0x01949B 13:948B: 04        .byte $04
- D - I - - 0x01949C 13:948C: 03        .byte $03
- D - I - - 0x01949D 13:948D: 02        .byte $02
- D - I - - 0x01949E 13:948E: 01        .byte $01
- D - I - - 0x01949F 13:948F: 00        .byte $00
- D - I - - 0x0194A0 13:9490: FF        .byte $FF



off_9491_13_03:
- D - I - - 0x0194A1 13:9491: E0        .byte $E0
- D - I - - 0x0194A2 13:9492: 12        .byte $12
- D - I - - 0x0194A3 13:9493: E3        .byte $E3
- D - I - - 0x0194A4 13:9494: 00        .byte $00
off_9495_повтор:
- D - I - - 0x0194A5 13:9495: 81        .byte $81
- D - I - - 0x0194A6 13:9496: 0B        .byte $0B
- D - I - - 0x0194A7 13:9497: 08        .byte $08
- D - I - - 0x0194A8 13:9498: 0D        .byte $0D
- D - I - - 0x0194A9 13:9499: 0F        .byte $0F
- D - I - - 0x0194AA 13:949A: 09        .byte $09
- D - I - - 0x0194AB 13:949B: E3        .byte $E3
- D - I - - 0x0194AC 13:949C: 08        .byte $08
- D - I - - 0x0194AD 13:949D: 0F        .byte $0F
- D - I - - 0x0194AE 13:949E: 0E        .byte $0E
- D - I - - 0x0194AF 13:949F: 0D        .byte $0D
- D - I - - 0x0194B0 13:94A0: 0C        .byte $0C
- D - I - - 0x0194B1 13:94A1: E3        .byte $E3
- D - I - - 0x0194B2 13:94A2: 09        .byte $09
- D - I - - 0x0194B3 13:94A3: 0F        .byte $0F
- D - I - - 0x0194B4 13:94A4: 0E        .byte $0E
- D - I - - 0x0194B5 13:94A5: 0D        .byte $0D
- D - I - - 0x0194B6 13:94A6: 0C        .byte $0C
- D - I - - 0x0194B7 13:94A7: E3        .byte $E3
- D - I - - 0x0194B8 13:94A8: 0A        .byte $0A
- D - I - - 0x0194B9 13:94A9: 0F        .byte $0F
- D - I - - 0x0194BA 13:94AA: 0E        .byte $0E
- D - I - - 0x0194BB 13:94AB: 0D        .byte $0D
- D - I - - 0x0194BC 13:94AC: 0C        .byte $0C
- D - I - - 0x0194BD 13:94AD: E3        .byte $E3
- D - I - - 0x0194BE 13:94AE: 0B        .byte $0B
- D - I - - 0x0194BF 13:94AF: 0F        .byte $0F
- D - I - - 0x0194C0 13:94B0: 0E        .byte $0E
- D - I - - 0x0194C1 13:94B1: 0D        .byte $0D
- D - I - - 0x0194C2 13:94B2: 0C        .byte $0C
- D - I - - 0x0194C3 13:94B3: E3        .byte $E3
- D - I - - 0x0194C4 13:94B4: 0C        .byte $0C
- D - I - - 0x0194C5 13:94B5: 0F        .byte $0F
- D - I - - 0x0194C6 13:94B6: 0E        .byte $0E
- D - I - - 0x0194C7 13:94B7: 0D        .byte $0D
- D - I - - 0x0194C8 13:94B8: 0C        .byte $0C
- D - I - - 0x0194C9 13:94B9: E3        .byte $E3
- D - I - - 0x0194CA 13:94BA: 0D        .byte $0D
- D - I - - 0x0194CB 13:94BB: 0F        .byte $0F
- D - I - - 0x0194CC 13:94BC: 0E        .byte $0E
- D - I - - 0x0194CD 13:94BD: 0D        .byte $0D
- D - I - - 0x0194CE 13:94BE: 0C        .byte $0C
- D - I - - 0x0194CF 13:94BF: E3        .byte $E3
- D - I - - 0x0194D0 13:94C0: 0E        .byte $0E
- D - I - - 0x0194D1 13:94C1: 0F        .byte $0F
- D - I - - 0x0194D2 13:94C2: 0E        .byte $0E
- D - I - - 0x0194D3 13:94C3: 0D        .byte $0D
- D - I - - 0x0194D4 13:94C4: 0C        .byte $0C
- D - I - - 0x0194D5 13:94C5: FF        .byte $FF



_off000_94C6_14_удар_с_ноги:
- D - I - - 0x0194D6 13:94C6: 00        .byte $00
- D - I - - 0x0194D7 13:94C7: CF 94     .word off_94CF_выкл
- D - I - - 0x0194D9 13:94C9: 01        .byte $01
- D - I - - 0x0194DA 13:94CA: D0 94     .word off_94D0_14_01
- D - I - - 0x0194DC 13:94CC: 03        .byte $03
- D - I - - 0x0194DD 13:94CD: F9 94     .word off_94F9_14_03
off_94CF_выкл:
- D - I - - 0x0194DF 13:94CF: FF        .byte $FF



off_94D0_14_01:
- D - I - - 0x0194E0 13:94D0: E0        .byte $E0
- D - I - - 0x0194E1 13:94D1: 12        .byte $12
- D - I - - 0x0194E2 13:94D2: E2        .byte $E2
- D - I - - 0x0194E3 13:94D3: 80        .byte $80
- D - I - - 0x0194E4 13:94D4: E3        .byte $E3
- D - I - - 0x0194E5 13:94D5: 00        .byte $00
- D - I - - 0x0194E6 13:94D6: EB        .byte $EB
- D - I - - 0x0194E7 13:94D7: 03        .byte $03
- D - I - - 0x0194E8 13:94D8: 81        .byte $81
- D - I - - 0x0194E9 13:94D9: 15        .byte $15
- D - I - - 0x0194EA 13:94DA: 14        .byte $14
- D - I - - 0x0194EB 13:94DB: 12        .byte $12
- D - I - - 0x0194EC 13:94DC: 10        .byte $10
- D - I - - 0x0194ED 13:94DD: EC        .byte $EC
- D - I - - 0x0194EE 13:94DE: 0B        .byte $0B
- D - I - - 0x0194EF 13:94DF: 09        .byte $09
- D - I - - 0x0194F0 13:94E0: 07        .byte $07
- D - I - - 0x0194F1 13:94E1: 05        .byte $05
- D - I - - 0x0194F2 13:94E2: 04        .byte $04
- D - I - - 0x0194F3 13:94E3: E3        .byte $E3
- D - I - - 0x0194F4 13:94E4: 0B        .byte $0B
- D - I - - 0x0194F5 13:94E5: E9        .byte $E9
- D - I - - 0x0194F6 13:94E6: EE 94     .word off_94EE_отрезок
- D - I - - 0x0194F8 13:94E8: E3        .byte $E3
- D - I - - 0x0194F9 13:94E9: 0D        .byte $0D
- D - I - - 0x0194FA 13:94EA: E9        .byte $E9
- D - I - - 0x0194FB 13:94EB: EE 94     .word off_94EE_отрезок
- D - I - - 0x0194FD 13:94ED: FF        .byte $FF
off_94EE_отрезок:
- D - I - - 0x0194FE 13:94EE: 15        .byte $15
- D - I - - 0x0194FF 13:94EF: 13        .byte $13
- D - I - - 0x019500 13:94F0: 14        .byte $14
- D - I - - 0x019501 13:94F1: 12        .byte $12
- D - I - - 0x019502 13:94F2: 10        .byte $10
- D - I - - 0x019503 13:94F3: 0B        .byte $0B
- D - I - - 0x019504 13:94F4: 09        .byte $09
- D - I - - 0x019505 13:94F5: 07        .byte $07
- D - I - - 0x019506 13:94F6: 05        .byte $05
- D - I - - 0x019507 13:94F7: 04        .byte $04
- D - I - - 0x019508 13:94F8: EA        .byte $EA



off_94F9_14_03:
- D - I - - 0x019509 13:94F9: E0        .byte $E0
- D - I - - 0x01950A 13:94FA: 12        .byte $12
- D - I - - 0x01950B 13:94FB: E3        .byte $E3
- D - I - - 0x01950C 13:94FC: 00        .byte $00
- D - I - - 0x01950D 13:94FD: 81        .byte $81
- D - I - - 0x01950E 13:94FE: EB        .byte $EB
- D - I - - 0x01950F 13:94FF: 03        .byte $03
- D - I - - 0x019510 13:9500: 0B        .byte $0B
- D - I - - 0x019511 13:9501: 08        .byte $08
- D - I - - 0x019512 13:9502: 0D        .byte $0D
- D - I - - 0x019513 13:9503: 0F        .byte $0F
- D - I - - 0x019514 13:9504: EC        .byte $EC
- D - I - - 0x019515 13:9505: 0C        .byte $0C
- D - I - - 0x019516 13:9506: 06        .byte $06
- D - I - - 0x019517 13:9507: 0F        .byte $0F
- D - I - - 0x019518 13:9508: 0A        .byte $0A
- D - I - - 0x019519 13:9509: 10        .byte $10
- D - I - - 0x01951A 13:950A: 0F        .byte $0F
- D - I - - 0x01951B 13:950B: 0D        .byte $0D
- D - I - - 0x01951C 13:950C: 0B        .byte $0B
- D - I - - 0x01951D 13:950D: 0A        .byte $0A
- D - I - - 0x01951E 13:950E: E3        .byte $E3
- D - I - - 0x01951F 13:950F: 01        .byte $01
- D - I - - 0x019520 13:9510: 0C        .byte $0C
- D - I - - 0x019521 13:9511: E3        .byte $E3
- D - I - - 0x019522 13:9512: 03        .byte $03
- D - I - - 0x019523 13:9513: 0C        .byte $0C
- D - I - - 0x019524 13:9514: E3        .byte $E3
- D - I - - 0x019525 13:9515: 05        .byte $05
- D - I - - 0x019526 13:9516: 0C        .byte $0C
- D - I - - 0x019527 13:9517: E3        .byte $E3
- D - I - - 0x019528 13:9518: 07        .byte $07
- D - I - - 0x019529 13:9519: 0C        .byte $0C
- D - I - - 0x01952A 13:951A: E3        .byte $E3
- D - I - - 0x01952B 13:951B: 09        .byte $09
- D - I - - 0x01952C 13:951C: 0C        .byte $0C
- D - I - - 0x01952D 13:951D: E3        .byte $E3
- D - I - - 0x01952E 13:951E: 0A        .byte $0A
- D - I - - 0x01952F 13:951F: 0C        .byte $0C
- D - I - - 0x019530 13:9520: E3        .byte $E3
- D - I - - 0x019531 13:9521: 0B        .byte $0B
- D - I - - 0x019532 13:9522: 0C        .byte $0C
- D - I - - 0x019533 13:9523: E3        .byte $E3
- D - I - - 0x019534 13:9524: 0C        .byte $0C
- D - I - - 0x019535 13:9525: 0C        .byte $0C
- D - I - - 0x019536 13:9526: E3        .byte $E3
- D - I - - 0x019537 13:9527: 0D        .byte $0D
- D - I - - 0x019538 13:9528: 0C        .byte $0C
- D - I - - 0x019539 13:9529: E3        .byte $E3
- D - I - - 0x01953A 13:952A: 0E        .byte $0E
- D - I - - 0x01953B 13:952B: 0C        .byte $0C
- D - I - - 0x01953C 13:952C: FF        .byte $FF



_off000_952D_23_мощный_удар_с_земли:
- D - I - - 0x01953D 13:952D: 00        .byte $00
- D - I - - 0x01953E 13:952E: 36 95     .word off_9536_выкл
- D - I - - 0x019540 13:9530: 01        .byte $01
- D - I - - 0x019541 13:9531: 37 95     .word off_9537_23_01
- D - I - - 0x019543 13:9533: 03        .byte $03
- D - I - - 0x019544 13:9534: 48 95     .word off_9548_23_03
off_9536_выкл:
- D - I - - 0x019546 13:9536: FF        .byte $FF



off_9537_23_01:
- D - I - - 0x019547 13:9537: E0        .byte $E0
- D - I - - 0x019548 13:9538: 12        .byte $12
- D - I - - 0x019549 13:9539: E2        .byte $E2
- D - I - - 0x01954A 13:953A: 80        .byte $80
- D - I - - 0x01954B 13:953B: E3        .byte $E3
- D - I - - 0x01954C 13:953C: 00        .byte $00
- D - I - - 0x01954D 13:953D: EB        .byte $EB
- D - I - - 0x01954E 13:953E: 03        .byte $03
- D - I - - 0x01954F 13:953F: 81        .byte $81
- D - I - - 0x019550 13:9540: 15        .byte $15
- D - I - - 0x019551 13:9541: 14        .byte $14
- D - I - - 0x019552 13:9542: 12        .byte $12
- D - I - - 0x019553 13:9543: 10        .byte $10
- D - I - - 0x019554 13:9544: EC        .byte $EC
- D - I - - 0x019555 13:9545: E8        .byte $E8
- D - I - - 0x019556 13:9546: 72 94     .word off_9472_повтор



off_9548_23_03:
- D - I - - 0x019558 13:9548: E0        .byte $E0
- D - I - - 0x019559 13:9549: 12        .byte $12
- D - I - - 0x01955A 13:954A: E3        .byte $E3
- D - I - - 0x01955B 13:954B: 00        .byte $00
- D - I - - 0x01955C 13:954C: 81        .byte $81
- D - I - - 0x01955D 13:954D: EB        .byte $EB
- D - I - - 0x01955E 13:954E: 03        .byte $03
- D - I - - 0x01955F 13:954F: 0B        .byte $0B
- D - I - - 0x019560 13:9550: 08        .byte $08
- D - I - - 0x019561 13:9551: 0D        .byte $0D
- D - I - - 0x019562 13:9552: 0F        .byte $0F
- D - I - - 0x019563 13:9553: EC        .byte $EC
- D - I - - 0x019564 13:9554: E8        .byte $E8
- D - I - - 0x019565 13:9555: 95 94     .word off_9495_повтор



_off000_9557_24_полет_циклона:
- D - I - - 0x019567 13:9557: 00        .byte $00
- D - I - - 0x019568 13:9558: 61 95     .word off_9561_24_00_повтор
- D - I - - 0x01956A 13:955A: 01        .byte $01
- D - I - - 0x01956B 13:955B: A7 95     .word off_95A7_24_01
- D - I - - 0x01956D 13:955D: 03        .byte $03
- D - I - - 0x01956E 13:955E: AE 95     .word off_95AE_24_03
- D - I - - 0x019570 13:9560: FF        .byte $FF



off_9561_24_00_повтор:
- D - I - - 0x019571 13:9561: E0        .byte $E0
- D - I - - 0x019572 13:9562: 17        .byte $17
- D - I - - 0x019573 13:9563: E2        .byte $E2
- D - I - - 0x019574 13:9564: 00        .byte $00
- D - I - - 0x019575 13:9565: E3        .byte $E3
- D - I - - 0x019576 13:9566: 05        .byte $05
- D - I - - 0x019577 13:9567: 83        .byte $83
- D - I - - 0x019578 13:9568: EB        .byte $EB
- D - I - - 0x019579 13:9569: 09        .byte $09
- D - I - - 0x01957A 13:956A: E9        .byte $E9
- D - I - - 0x01957B 13:956B: 9D 95     .word off_959D_отрезок
- D - I - - 0x01957D 13:956D: EC        .byte $EC
- D - I - - 0x01957E 13:956E: E3        .byte $E3
- D - I - - 0x01957F 13:956F: 06        .byte $06
- D - I - - 0x019580 13:9570: 82        .byte $82
- D - I - - 0x019581 13:9571: E9        .byte $E9
- D - I - - 0x019582 13:9572: 9D 95     .word off_959D_отрезок
- D - I - - 0x019584 13:9574: E3        .byte $E3
- D - I - - 0x019585 13:9575: 07        .byte $07
- D - I - - 0x019586 13:9576: E9        .byte $E9
- D - I - - 0x019587 13:9577: 9D 95     .word off_959D_отрезок
- D - I - - 0x019589 13:9579: E3        .byte $E3
- D - I - - 0x01958A 13:957A: 08        .byte $08
- D - I - - 0x01958B 13:957B: E9        .byte $E9
- D - I - - 0x01958C 13:957C: 9D 95     .word off_959D_отрезок
- D - I - - 0x01958E 13:957E: E3        .byte $E3
- D - I - - 0x01958F 13:957F: 09        .byte $09
- D - I - - 0x019590 13:9580: E9        .byte $E9
- D - I - - 0x019591 13:9581: 9D 95     .word off_959D_отрезок
- D - I - - 0x019593 13:9583: E3        .byte $E3
- D - I - - 0x019594 13:9584: 0A        .byte $0A
- D - I - - 0x019595 13:9585: E9        .byte $E9
- D - I - - 0x019596 13:9586: 9D 95     .word off_959D_отрезок
- D - I - - 0x019598 13:9588: E3        .byte $E3
- D - I - - 0x019599 13:9589: 0B        .byte $0B
- D - I - - 0x01959A 13:958A: E9        .byte $E9
- D - I - - 0x01959B 13:958B: 9D 95     .word off_959D_отрезок
- D - I - - 0x01959D 13:958D: E3        .byte $E3
- D - I - - 0x01959E 13:958E: 0C        .byte $0C
- D - I - - 0x01959F 13:958F: E9        .byte $E9
- D - I - - 0x0195A0 13:9590: 9D 95     .word off_959D_отрезок
- D - I - - 0x0195A2 13:9592: E3        .byte $E3
- D - I - - 0x0195A3 13:9593: 0D        .byte $0D
- D - I - - 0x0195A4 13:9594: E9        .byte $E9
- D - I - - 0x0195A5 13:9595: 9D 95     .word off_959D_отрезок
- D - I - - 0x0195A7 13:9597: E3        .byte $E3
- D - I - - 0x0195A8 13:9598: 0E        .byte $0E
- D - I - - 0x0195A9 13:9599: E9        .byte $E9
- D - I - - 0x0195AA 13:959A: 9D 95     .word off_959D_отрезок
- D - I - - 0x0195AC 13:959C: FF        .byte $FF
off_959D_отрезок:
- D - I - - 0x0195AD 13:959D: E4        .byte $E4
- D - I - - 0x0195AE 13:959E: 84        .byte $84
- D - I - - 0x0195AF 13:959F: 20        .byte $20
- D - I - - 0x0195B0 13:95A0: E4        .byte $E4
- D - I - - 0x0195B1 13:95A1: 84        .byte $84
- D - I - - 0x0195B2 13:95A2: 30        .byte $30
- D - I - - 0x0195B3 13:95A3: E4        .byte $E4
- D - I - - 0x0195B4 13:95A4: 84        .byte $84
- D - I - - 0x0195B5 13:95A5: 40        .byte $40
- D - I - - 0x0195B6 13:95A6: EA        .byte $EA



off_95A7_24_01:
- D - I - - 0x0195B7 13:95A7: E5        .byte $E5
- D - I - - 0x0195B8 13:95A8: 01        .byte $01
- D - I - - 0x0195B9 13:95A9: 83        .byte $83
- D - I - - 0x0195BA 13:95AA: 0C        .byte $0C
- D - I - - 0x0195BB 13:95AB: E8        .byte $E8
- D - I - - 0x0195BC 13:95AC: 61 95     .word off_9561_24_00_повтор



off_95AE_24_03:
- D - I - - 0x0195BE 13:95AE: E0        .byte $E0
- D - I - - 0x0195BF 13:95AF: 17        .byte $17
- D - I - - 0x0195C0 13:95B0: E3        .byte $E3
- D - I - - 0x0195C1 13:95B1: 00        .byte $00
- D - I - - 0x0195C2 13:95B2: 81        .byte $81
- D - I - - 0x0195C3 13:95B3: 02        .byte $02
- D - I - - 0x0195C4 13:95B4: 82        .byte $82
- D - I - - 0x0195C5 13:95B5: 03        .byte $03
- D - I - - 0x0195C6 13:95B6: 83        .byte $83
- D - I - - 0x0195C7 13:95B7: 04        .byte $04
- D - I - - 0x0195C8 13:95B8: 82        .byte $82
- D - I - - 0x0195C9 13:95B9: 05        .byte $05
- D - I - - 0x0195CA 13:95BA: 81        .byte $81
- D - I - - 0x0195CB 13:95BB: 06        .byte $06
- D - I - - 0x0195CC 13:95BC: 03        .byte $03
- D - I - - 0x0195CD 13:95BD: 82        .byte $82
- D - I - - 0x0195CE 13:95BE: 04        .byte $04
- D - I - - 0x0195CF 13:95BF: 83        .byte $83
- D - I - - 0x0195D0 13:95C0: 05        .byte $05
- D - I - - 0x0195D1 13:95C1: 82        .byte $82
- D - I - - 0x0195D2 13:95C2: 06        .byte $06
- D - I - - 0x0195D3 13:95C3: 81        .byte $81
- D - I - - 0x0195D4 13:95C4: 07        .byte $07
- D - I - - 0x0195D5 13:95C5: 04        .byte $04
- D - I - - 0x0195D6 13:95C6: 82        .byte $82
- D - I - - 0x0195D7 13:95C7: 05        .byte $05
- D - I - - 0x0195D8 13:95C8: 83        .byte $83
- D - I - - 0x0195D9 13:95C9: 06        .byte $06
- D - I - - 0x0195DA 13:95CA: 82        .byte $82
- D - I - - 0x0195DB 13:95CB: 07        .byte $07
- D - I - - 0x0195DC 13:95CC: 81        .byte $81
- D - I - - 0x0195DD 13:95CD: 08        .byte $08
- D - I - - 0x0195DE 13:95CE: 05        .byte $05
- D - I - - 0x0195DF 13:95CF: 82        .byte $82
- D - I - - 0x0195E0 13:95D0: 06        .byte $06
- D - I - - 0x0195E1 13:95D1: 83        .byte $83
- D - I - - 0x0195E2 13:95D2: 07        .byte $07
- D - I - - 0x0195E3 13:95D3: 82        .byte $82
- D - I - - 0x0195E4 13:95D4: 08        .byte $08
- D - I - - 0x0195E5 13:95D5: 81        .byte $81
- D - I - - 0x0195E6 13:95D6: 09        .byte $09
- D - I - - 0x0195E7 13:95D7: 06        .byte $06
- D - I - - 0x0195E8 13:95D8: 82        .byte $82
- D - I - - 0x0195E9 13:95D9: 07        .byte $07
- D - I - - 0x0195EA 13:95DA: 83        .byte $83
- D - I - - 0x0195EB 13:95DB: 08        .byte $08
- D - I - - 0x0195EC 13:95DC: 82        .byte $82
- D - I - - 0x0195ED 13:95DD: 09        .byte $09
- D - I - - 0x0195EE 13:95DE: 81        .byte $81
- D - I - - 0x0195EF 13:95DF: 0A        .byte $0A
- D - I - - 0x0195F0 13:95E0: 07        .byte $07
- D - I - - 0x0195F1 13:95E1: 82        .byte $82
- D - I - - 0x0195F2 13:95E2: 08        .byte $08
- D - I - - 0x0195F3 13:95E3: 83        .byte $83
- D - I - - 0x0195F4 13:95E4: 09        .byte $09
- D - I - - 0x0195F5 13:95E5: 82        .byte $82
- D - I - - 0x0195F6 13:95E6: 0A        .byte $0A
- D - I - - 0x0195F7 13:95E7: 81        .byte $81
- D - I - - 0x0195F8 13:95E8: 0B        .byte $0B
- D - I - - 0x0195F9 13:95E9: 08        .byte $08
- D - I - - 0x0195FA 13:95EA: 82        .byte $82
- D - I - - 0x0195FB 13:95EB: 09        .byte $09
- D - I - - 0x0195FC 13:95EC: 83        .byte $83
- D - I - - 0x0195FD 13:95ED: 0A        .byte $0A
- D - I - - 0x0195FE 13:95EE: 82        .byte $82
- D - I - - 0x0195FF 13:95EF: 0B        .byte $0B
- D - I - - 0x019600 13:95F0: 81        .byte $81
- D - I - - 0x019601 13:95F1: 0C        .byte $0C
- D - I - - 0x019602 13:95F2: 09        .byte $09
- D - I - - 0x019603 13:95F3: 82        .byte $82
- D - I - - 0x019604 13:95F4: 0A        .byte $0A
- D - I - - 0x019605 13:95F5: 83        .byte $83
- D - I - - 0x019606 13:95F6: 0B        .byte $0B
- D - I - - 0x019607 13:95F7: 82        .byte $82
- D - I - - 0x019608 13:95F8: 0C        .byte $0C
- D - I - - 0x019609 13:95F9: 81        .byte $81
- D - I - - 0x01960A 13:95FA: 0D        .byte $0D
- D - I - - 0x01960B 13:95FB: 0A        .byte $0A
- D - I - - 0x01960C 13:95FC: 82        .byte $82
- D - I - - 0x01960D 13:95FD: 0B        .byte $0B
- D - I - - 0x01960E 13:95FE: 83        .byte $83
- D - I - - 0x01960F 13:95FF: 0C        .byte $0C
- D - I - - 0x019610 13:9600: 82        .byte $82
- D - I - - 0x019611 13:9601: 0D        .byte $0D
- D - I - - 0x019612 13:9602: 81        .byte $81
- D - I - - 0x019613 13:9603: 0E        .byte $0E
- D - I - - 0x019614 13:9604: E3        .byte $E3
- D - I - - 0x019615 13:9605: 01        .byte $01
- D - I - - 0x019616 13:9606: E9        .byte $E9
- D - I - - 0x019617 13:9607: 4B 96     .word off_964B_отрезок
- D - I - - 0x019619 13:9609: E3        .byte $E3
- D - I - - 0x01961A 13:960A: 02        .byte $02
- D - I - - 0x01961B 13:960B: E9        .byte $E9
- D - I - - 0x01961C 13:960C: 4B 96     .word off_964B_отрезок
- D - I - - 0x01961E 13:960E: E3        .byte $E3
- D - I - - 0x01961F 13:960F: 03        .byte $03
- D - I - - 0x019620 13:9610: E9        .byte $E9
- D - I - - 0x019621 13:9611: 4B 96     .word off_964B_отрезок
- D - I - - 0x019623 13:9613: E3        .byte $E3
- D - I - - 0x019624 13:9614: 04        .byte $04
- D - I - - 0x019625 13:9615: E9        .byte $E9
- D - I - - 0x019626 13:9616: 4B 96     .word off_964B_отрезок
- D - I - - 0x019628 13:9618: E3        .byte $E3
- D - I - - 0x019629 13:9619: 05        .byte $05
- D - I - - 0x01962A 13:961A: E9        .byte $E9
- D - I - - 0x01962B 13:961B: 4B 96     .word off_964B_отрезок
- D - I - - 0x01962D 13:961D: E3        .byte $E3
- D - I - - 0x01962E 13:961E: 06        .byte $06
- D - I - - 0x01962F 13:961F: E9        .byte $E9
- D - I - - 0x019630 13:9620: 4B 96     .word off_964B_отрезок
- D - I - - 0x019632 13:9622: E3        .byte $E3
- D - I - - 0x019633 13:9623: 07        .byte $07
- D - I - - 0x019634 13:9624: E9        .byte $E9
- D - I - - 0x019635 13:9625: 4B 96     .word off_964B_отрезок
- D - I - - 0x019637 13:9627: E3        .byte $E3
- D - I - - 0x019638 13:9628: 08        .byte $08
- D - I - - 0x019639 13:9629: E9        .byte $E9
- D - I - - 0x01963A 13:962A: 4B 96     .word off_964B_отрезок
- D - I - - 0x01963C 13:962C: E3        .byte $E3
- D - I - - 0x01963D 13:962D: 09        .byte $09
- D - I - - 0x01963E 13:962E: E9        .byte $E9
- D - I - - 0x01963F 13:962F: 4B 96     .word off_964B_отрезок
- D - I - - 0x019641 13:9631: E3        .byte $E3
- D - I - - 0x019642 13:9632: 0A        .byte $0A
- D - I - - 0x019643 13:9633: E9        .byte $E9
- D - I - - 0x019644 13:9634: 4B 96     .word off_964B_отрезок
- D - I - - 0x019646 13:9636: E3        .byte $E3
- D - I - - 0x019647 13:9637: 0B        .byte $0B
- D - I - - 0x019648 13:9638: E9        .byte $E9
- D - I - - 0x019649 13:9639: 4B 96     .word off_964B_отрезок
- D - I - - 0x01964B 13:963B: E3        .byte $E3
- D - I - - 0x01964C 13:963C: 0C        .byte $0C
- D - I - - 0x01964D 13:963D: E9        .byte $E9
- D - I - - 0x01964E 13:963E: 4B 96     .word off_964B_отрезок
- D - I - - 0x019650 13:9640: E3        .byte $E3
- D - I - - 0x019651 13:9641: 0D        .byte $0D
- D - I - - 0x019652 13:9642: E9        .byte $E9
- D - I - - 0x019653 13:9643: 4B 96     .word off_964B_отрезок
- D - I - - 0x019655 13:9645: E3        .byte $E3
- D - I - - 0x019656 13:9646: 0E        .byte $0E
- D - I - - 0x019657 13:9647: E9        .byte $E9
- D - I - - 0x019658 13:9648: 4B 96     .word off_964B_отрезок
- D - I - - 0x01965A 13:964A: FF        .byte $FF
off_964B_отрезок:
- D - I - - 0x01965B 13:964B: 0A        .byte $0A
- D - I - - 0x01965C 13:964C: 0B        .byte $0B
- D - I - - 0x01965D 13:964D: 82        .byte $82
- D - I - - 0x01965E 13:964E: 0C        .byte $0C
- D - I - - 0x01965F 13:964F: 81        .byte $81
- D - I - - 0x019660 13:9650: 0D        .byte $0D
- D - I - - 0x019661 13:9651: 0E        .byte $0E
- D - I - - 0x019662 13:9652: EA        .byte $EA



_off000_9653_18_замах_с_красным_фоном:
- D - I - - 0x019663 13:9653: 00        .byte $00
- D - I - - 0x019664 13:9654: A2 96     .word off_96A2_18_00
- D - I - - 0x019666 13:9656: 01        .byte $01
- D - I - - 0x019667 13:9657: 78 96     .word off_9678_18_01
- D - I - - 0x019669 13:9659: 03        .byte $03
- D - I - - 0x01966A 13:965A: 5D 96     .word off_965D_18_03
- D - I - - 0x01966C 13:965C: FF        .byte $FF



off_965D_18_03:
- D - I - - 0x01966D 13:965D: E0        .byte $E0
- D - I - - 0x01966E 13:965E: 2F        .byte $2F
- D - I - - 0x01966F 13:965F: E3        .byte $E3
- D - I - - 0x019670 13:9660: 00        .byte $00
- D - I - - 0x019671 13:9661: 82        .byte $82
- D - I - - 0x019672 13:9662: 04        .byte $04
- D - I - - 0x019673 13:9663: 09        .byte $09
- D - I - - 0x019674 13:9664: 0A        .byte $0A
- D - I - - 0x019675 13:9665: 0B        .byte $0B
- D - I - - 0x019676 13:9666: 81        .byte $81
- D - I - - 0x019677 13:9667: 0A        .byte $0A
- D - I - - 0x019678 13:9668: 0B        .byte $0B
- D - I - - 0x019679 13:9669: 0A        .byte $0A
- D - I - - 0x01967A 13:966A: 10        .byte $10
- D - I - - 0x01967B 13:966B: 82        .byte $82
- D - I - - 0x01967C 13:966C: 09        .byte $09
- D - I - - 0x01967D 13:966D: 0A        .byte $0A
- D - I - - 0x01967E 13:966E: 0B        .byte $0B
- D - I - - 0x01967F 13:966F: 83        .byte $83
- D - I - - 0x019680 13:9670: 0A        .byte $0A
- D - I - - 0x019681 13:9671: 0B        .byte $0B
- D - I - - 0x019682 13:9672: 0C        .byte $0C
- D - I - - 0x019683 13:9673: E0        .byte $E0
- D - I - - 0x019684 13:9674: 2E        .byte $2E
- D - I - - 0x019685 13:9675: A5        .byte $A5
- D - I - - 0x019686 13:9676: 0D        .byte $0D
- D - I - - 0x019687 13:9677: FF        .byte $FF



off_9678_18_01:
- D - I - - 0x019688 13:9678: E0        .byte $E0
- D - I - - 0x019689 13:9679: 17        .byte $17
- D - I - - 0x01968A 13:967A: E2        .byte $E2
- D - I - - 0x01968B 13:967B: 80        .byte $80
- D - I - - 0x01968C 13:967C: E3        .byte $E3
- D - I - - 0x01968D 13:967D: 00        .byte $00
- D - I - - 0x01968E 13:967E: 81        .byte $81
- D - I - - 0x01968F 13:967F: EB        .byte $EB
- D - I - - 0x019690 13:9680: 03        .byte $03
- D - I - - 0x019691 13:9681: 00        .byte $00
- D - I - - 0x019692 13:9682: 10        .byte $10
- D - I - - 0x019693 13:9683: EC        .byte $EC
- D - I - - 0x019694 13:9684: 0B        .byte $0B
- D - I - - 0x019695 13:9685: 0A        .byte $0A
- D - I - - 0x019696 13:9686: 09        .byte $09
- D - I - - 0x019697 13:9687: 08        .byte $08
- D - I - - 0x019698 13:9688: 00        .byte $00
- D - I - - 0x019699 13:9689: 10        .byte $10
- D - I - - 0x01969A 13:968A: 00        .byte $00
- D - I - - 0x01969B 13:968B: 10        .byte $10
- D - I - - 0x01969C 13:968C: 00        .byte $00
- D - I - - 0x01969D 13:968D: 0B        .byte $0B
- D - I - - 0x01969E 13:968E: 10        .byte $10
- D - I - - 0x01969F 13:968F: 0A        .byte $0A
- D - I - - 0x0196A0 13:9690: 0B        .byte $0B
- D - I - - 0x0196A1 13:9691: 09        .byte $09
- D - I - - 0x0196A2 13:9692: 0A        .byte $0A
- D - I - - 0x0196A3 13:9693: 08        .byte $08
- D - I - - 0x0196A4 13:9694: 09        .byte $09
- D - I - - 0x0196A5 13:9695: 07        .byte $07
- D - I - - 0x0196A6 13:9696: 08        .byte $08
- D - I - - 0x0196A7 13:9697: E0        .byte $E0
- D - I - - 0x0196A8 13:9698: 2E        .byte $2E
- D - I - - 0x0196A9 13:9699: 00        .byte $00
- D - I - - 0x0196AA 13:969A: F3        .byte $F3
- D - I - - 0x0196AB 13:969B: EB        .byte $EB
- D - I - - 0x0196AC 13:969C: 43        .byte $43
- D - I - - 0x0196AD 13:969D: 01        .byte $01
- D - I - - 0x0196AE 13:969E: 00        .byte $00
- D - I - - 0x0196AF 13:969F: EC        .byte $EC
- D - I - - 0x0196B0 13:96A0: F4        .byte $F4
- D - I - - 0x0196B1 13:96A1: FF        .byte $FF



off_96A2_18_00:
- D - I - - 0x0196B2 13:96A2: E0        .byte $E0
- D - I - - 0x0196B3 13:96A3: 17        .byte $17
- D - I - - 0x0196B4 13:96A4: E2        .byte $E2
- D - I - - 0x0196B5 13:96A5: 80        .byte $80
- D - I - - 0x0196B6 13:96A6: E3        .byte $E3
- D - I - - 0x0196B7 13:96A7: 05        .byte $05
- D - I - - 0x0196B8 13:96A8: 81        .byte $81
- D - I - - 0x0196B9 13:96A9: EB        .byte $EB
- D - I - - 0x0196BA 13:96AA: 03        .byte $03
- D - I - - 0x0196BB 13:96AB: 03        .byte $03
- D - I - - 0x0196BC 13:96AC: 13        .byte $13
- D - I - - 0x0196BD 13:96AD: EC        .byte $EC
- D - I - - 0x0196BE 13:96AE: 12        .byte $12
- D - I - - 0x0196BF 13:96AF: 11        .byte $11
- D - I - - 0x0196C0 13:96B0: 10        .byte $10
- D - I - - 0x0196C1 13:96B1: 0B        .byte $0B
- D - I - - 0x0196C2 13:96B2: 03        .byte $03
- D - I - - 0x0196C3 13:96B3: 13        .byte $13
- D - I - - 0x0196C4 13:96B4: 03        .byte $03
- D - I - - 0x0196C5 13:96B5: 13        .byte $13
- D - I - - 0x0196C6 13:96B6: 03        .byte $03
- D - I - - 0x0196C7 13:96B7: 12        .byte $12
- D - I - - 0x0196C8 13:96B8: 13        .byte $13
- D - I - - 0x0196C9 13:96B9: 11        .byte $11
- D - I - - 0x0196CA 13:96BA: 12        .byte $12
- D - I - - 0x0196CB 13:96BB: 10        .byte $10
- D - I - - 0x0196CC 13:96BC: 11        .byte $11
- D - I - - 0x0196CD 13:96BD: 0B        .byte $0B
- D - I - - 0x0196CE 13:96BE: 10        .byte $10
- D - I - - 0x0196CF 13:96BF: 0A        .byte $0A
- D - I - - 0x0196D0 13:96C0: 0B        .byte $0B
- D - I - - 0x0196D1 13:96C1: E0        .byte $E0
- D - I - - 0x0196D2 13:96C2: 2E        .byte $2E
- D - I - - 0x0196D3 13:96C3: 03        .byte $03
- D - I - - 0x0196D4 13:96C4: F3        .byte $F3
- D - I - - 0x0196D5 13:96C5: EB        .byte $EB
- D - I - - 0x0196D6 13:96C6: 43        .byte $43
- D - I - - 0x0196D7 13:96C7: 04        .byte $04
- D - I - - 0x0196D8 13:96C8: 03        .byte $03
- D - I - - 0x0196D9 13:96C9: EC        .byte $EC
- D - I - - 0x0196DA 13:96CA: F4        .byte $F4
- D - I - - 0x0196DB 13:96CB: FF        .byte $FF



_off000_96CC_0A_полет_спешала:
- D - I - - 0x0196DC 13:96CC: 00        .byte $00
- D - I - - 0x0196DD 13:96CD: D5 96     .word off_96D5_выкл
- D - I - - 0x0196DF 13:96CF: 01        .byte $01
- D - I - - 0x0196E0 13:96D0: D6 96     .word off_96D6_0A_01
- D - I - - 0x0196E2 13:96D2: 03        .byte $03
- D - I - - 0x0196E3 13:96D3: 21 97     .word off_9721_0A_03
off_96D5_выкл:
- D - I - - 0x0196E5 13:96D5: FF        .byte $FF



off_96D6_0A_01:
- D - I - - 0x0196E6 13:96D6: E0        .byte $E0
- D - I - - 0x0196E7 13:96D7: 14        .byte $14
- D - I - - 0x0196E8 13:96D8: E2        .byte $E2
- D - I - - 0x0196E9 13:96D9: 80        .byte $80
- D - I - - 0x0196EA 13:96DA: E3        .byte $E3
- D - I - - 0x0196EB 13:96DB: 08        .byte $08
- D - I - - 0x0196EC 13:96DC: 81        .byte $81
- D - I - - 0x0196ED 13:96DD: 20        .byte $20
- D - I - - 0x0196EE 13:96DE: 22        .byte $22
- D - I - - 0x0196EF 13:96DF: 21        .byte $21
- D - I - - 0x0196F0 13:96E0: E3        .byte $E3
- D - I - - 0x0196F1 13:96E1: 0D        .byte $0D
- D - I - - 0x0196F2 13:96E2: 20        .byte $20
- D - I - - 0x0196F3 13:96E3: 22        .byte $22
- D - I - - 0x0196F4 13:96E4: 21        .byte $21
- D - I - - 0x0196F5 13:96E5: E3        .byte $E3
- D - I - - 0x0196F6 13:96E6: 07        .byte $07
- D - I - - 0x0196F7 13:96E7: 21        .byte $21
- D - I - - 0x0196F8 13:96E8: 23        .byte $23
- D - I - - 0x0196F9 13:96E9: 22        .byte $22
- D - I - - 0x0196FA 13:96EA: E3        .byte $E3
- D - I - - 0x0196FB 13:96EB: 0C        .byte $0C
- D - I - - 0x0196FC 13:96EC: 21        .byte $21
- D - I - - 0x0196FD 13:96ED: 23        .byte $23
- D - I - - 0x0196FE 13:96EE: 22        .byte $22
- D - I - - 0x0196FF 13:96EF: E3        .byte $E3
- D - I - - 0x019700 13:96F0: 06        .byte $06
- D - I - - 0x019701 13:96F1: 22        .byte $22
- D - I - - 0x019702 13:96F2: 24        .byte $24
- D - I - - 0x019703 13:96F3: 23        .byte $23
- D - I - - 0x019704 13:96F4: E3        .byte $E3
- D - I - - 0x019705 13:96F5: 0B        .byte $0B
- D - I - - 0x019706 13:96F6: 22        .byte $22
- D - I - - 0x019707 13:96F7: 24        .byte $24
- D - I - - 0x019708 13:96F8: 23        .byte $23
- D - I - - 0x019709 13:96F9: EB        .byte $EB
- D - I - - 0x01970A 13:96FA: 04        .byte $04
- D - I - - 0x01970B 13:96FB: E3        .byte $E3
- D - I - - 0x01970C 13:96FC: 05        .byte $05
- D - I - - 0x01970D 13:96FD: 23        .byte $23
- D - I - - 0x01970E 13:96FE: 25        .byte $25
- D - I - - 0x01970F 13:96FF: 24        .byte $24
- D - I - - 0x019710 13:9700: E3        .byte $E3
- D - I - - 0x019711 13:9701: 0B        .byte $0B
- D - I - - 0x019712 13:9702: 23        .byte $23
- D - I - - 0x019713 13:9703: 25        .byte $25
- D - I - - 0x019714 13:9704: 24        .byte $24
- D - I - - 0x019715 13:9705: EC        .byte $EC
- D - I - - 0x019716 13:9706: EB        .byte $EB
- D - I - - 0x019717 13:9707: 04        .byte $04
- D - I - - 0x019718 13:9708: E3        .byte $E3
- D - I - - 0x019719 13:9709: 08        .byte $08
- D - I - - 0x01971A 13:970A: 22        .byte $22
- D - I - - 0x01971B 13:970B: 24        .byte $24
- D - I - - 0x01971C 13:970C: 23        .byte $23
- D - I - - 0x01971D 13:970D: E3        .byte $E3
- D - I - - 0x01971E 13:970E: 0D        .byte $0D
- D - I - - 0x01971F 13:970F: 22        .byte $22
- D - I - - 0x019720 13:9710: 24        .byte $24
- D - I - - 0x019721 13:9711: 23        .byte $23
- D - I - - 0x019722 13:9712: EC        .byte $EC
- D - I - - 0x019723 13:9713: EB        .byte $EB
- D - I - - 0x019724 13:9714: 04        .byte $04
- D - I - - 0x019725 13:9715: E3        .byte $E3
- D - I - - 0x019726 13:9716: 0A        .byte $0A
- D - I - - 0x019727 13:9717: 23        .byte $23
- D - I - - 0x019728 13:9718: 25        .byte $25
- D - I - - 0x019729 13:9719: 24        .byte $24
- D - I - - 0x01972A 13:971A: E3        .byte $E3
- D - I - - 0x01972B 13:971B: 0E        .byte $0E
- D - I - - 0x01972C 13:971C: 23        .byte $23
- D - I - - 0x01972D 13:971D: 25        .byte $25
- D - I - - 0x01972E 13:971E: 24        .byte $24
- D - I - - 0x01972F 13:971F: EC        .byte $EC
- D - I - - 0x019730 13:9720: FF        .byte $FF



off_9721_0A_03:
- D - I - - 0x019731 13:9721: E0        .byte $E0
- D - I - - 0x019732 13:9722: 14        .byte $14
- D - I - - 0x019733 13:9723: E3        .byte $E3
- D - I - - 0x019734 13:9724: 00        .byte $00
- D - I - - 0x019735 13:9725: 81        .byte $81
- D - I - - 0x019736 13:9726: EB        .byte $EB
- D - I - - 0x019737 13:9727: 08        .byte $08
- D - I - - 0x019738 13:9728: 0A        .byte $0A
- D - I - - 0x019739 13:9729: 09        .byte $09
- D - I - - 0x01973A 13:972A: 08        .byte $08
- D - I - - 0x01973B 13:972B: EC        .byte $EC
- D - I - - 0x01973C 13:972C: EB        .byte $EB
- D - I - - 0x01973D 13:972D: 04        .byte $04
- D - I - - 0x01973E 13:972E: 0B        .byte $0B
- D - I - - 0x01973F 13:972F: 0A        .byte $0A
- D - I - - 0x019740 13:9730: 09        .byte $09
- D - I - - 0x019741 13:9731: EC        .byte $EC
- D - I - - 0x019742 13:9732: EB        .byte $EB
- D - I - - 0x019743 13:9733: 04        .byte $04
- D - I - - 0x019744 13:9734: 0C        .byte $0C
- D - I - - 0x019745 13:9735: 0B        .byte $0B
- D - I - - 0x019746 13:9736: 0A        .byte $0A
- D - I - - 0x019747 13:9737: EC        .byte $EC
- D - I - - 0x019748 13:9738: EB        .byte $EB
- D - I - - 0x019749 13:9739: 02        .byte $02
- D - I - - 0x01974A 13:973A: 0D        .byte $0D
- D - I - - 0x01974B 13:973B: 0C        .byte $0C
- D - I - - 0x01974C 13:973C: 0B        .byte $0B
- D - I - - 0x01974D 13:973D: EC        .byte $EC
- D - I - - 0x01974E 13:973E: EB        .byte $EB
- D - I - - 0x01974F 13:973F: 02        .byte $02
- D - I - - 0x019750 13:9740: 0E        .byte $0E
- D - I - - 0x019751 13:9741: 0D        .byte $0D
- D - I - - 0x019752 13:9742: 0C        .byte $0C
- D - I - - 0x019753 13:9743: EC        .byte $EC
- D - I - - 0x019754 13:9744: 0D        .byte $0D
- D - I - - 0x019755 13:9745: 0E        .byte $0E
- D - I - - 0x019756 13:9746: 96        .byte $96
- D - I - - 0x019757 13:9747: 0F        .byte $0F
- D - I - - 0x019758 13:9748: FF        .byte $FF



_off000_9749_0B_полет_спешала:
- D - I - - 0x019759 13:9749: 00        .byte $00
- D - I - - 0x01975A 13:974A: 52 97     .word off_9752_выкл
- D - I - - 0x01975C 13:974C: 01        .byte $01
- D - I - - 0x01975D 13:974D: 52 97     .word off_9752_выкл
- D - I - - 0x01975F 13:974F: 03        .byte $03
- D - I - - 0x019760 13:9750: 53 97     .word off_9753_0B_03
off_9752_выкл:
- D - I - - 0x019762 13:9752: FF        .byte $FF



off_9753_0B_03:
- D - I - - 0x019763 13:9753: E0        .byte $E0
- D - I - - 0x019764 13:9754: 12        .byte $12
- D - I - - 0x019765 13:9755: E3        .byte $E3
- D - I - - 0x019766 13:9756: 00        .byte $00
- D - I - - 0x019767 13:9757: 81        .byte $81
- D - I - - 0x019768 13:9758: 00        .byte $00
- D - I - - 0x019769 13:9759: 02        .byte $02
- D - I - - 0x01976A 13:975A: 01        .byte $01
- D - I - - 0x01976B 13:975B: 03        .byte $03
- D - I - - 0x01976C 13:975C: 02        .byte $02
- D - I - - 0x01976D 13:975D: 04        .byte $04
- D - I - - 0x01976E 13:975E: 03        .byte $03
- D - I - - 0x01976F 13:975F: 05        .byte $05
- D - I - - 0x019770 13:9760: 04        .byte $04
- D - I - - 0x019771 13:9761: 06        .byte $06
- D - I - - 0x019772 13:9762: 05        .byte $05
- D - I - - 0x019773 13:9763: 07        .byte $07
- D - I - - 0x019774 13:9764: 06        .byte $06
- D - I - - 0x019775 13:9765: 08        .byte $08
- D - I - - 0x019776 13:9766: 07        .byte $07
- D - I - - 0x019777 13:9767: 09        .byte $09
- D - I - - 0x019778 13:9768: 08        .byte $08
- D - I - - 0x019779 13:9769: 0A        .byte $0A
- D - I - - 0x01977A 13:976A: 09        .byte $09
- D - I - - 0x01977B 13:976B: 0B        .byte $0B
- D - I - - 0x01977C 13:976C: 0A        .byte $0A
- D - I - - 0x01977D 13:976D: 0C        .byte $0C
- D - I - - 0x01977E 13:976E: 0B        .byte $0B
- D - I - - 0x01977F 13:976F: 0D        .byte $0D
- D - I - - 0x019780 13:9770: 0C        .byte $0C
- D - I - - 0x019781 13:9771: 0E        .byte $0E
- D - I - - 0x019782 13:9772: 0D        .byte $0D
- D - I - - 0x019783 13:9773: 0F        .byte $0F
- D - I - - 0x019784 13:9774: 96        .byte $96
- D - I - - 0x019785 13:9775: 0E        .byte $0E
- D - I - - 0x019786 13:9776: FF        .byte $FF



_off000_9777_1A_удар_оверхед:
- D - I - - 0x019787 13:9777: 00        .byte $00
- D - I - - 0x019788 13:9778: 80 97     .word off_9780_выкл
- D - I - - 0x01978A 13:977A: 01        .byte $01
- D - I - - 0x01978B 13:977B: 81 97     .word off_9781_1A_01
- D - I - - 0x01978D 13:977D: 03        .byte $03
- D - I - - 0x01978E 13:977E: 8F 97     .word off_978F_1A_03
off_9780_выкл:
- D - I - - 0x019790 13:9780: FF        .byte $FF



off_9781_1A_01:
- D - I - - 0x019791 13:9781: E0        .byte $E0
- D - I - - 0x019792 13:9782: 12        .byte $12
- D - I - - 0x019793 13:9783: E2        .byte $E2
- D - I - - 0x019794 13:9784: 80        .byte $80
- D - I - - 0x019795 13:9785: E3        .byte $E3
- D - I - - 0x019796 13:9786: 00        .byte $00
- D - I - - 0x019797 13:9787: 81        .byte $81
- D - I - - 0x019798 13:9788: 10        .byte $10
- D - I - - 0x019799 13:9789: 20        .byte $20
- D - I - - 0x01979A 13:978A: 00        .byte $00
- D - I - - 0x01979B 13:978B: 10        .byte $10
- D - I - - 0x01979C 13:978C: 00        .byte $00
- D - I - - 0x01979D 13:978D: 10        .byte $10
- D - I - - 0x01979E 13:978E: FF        .byte $FF



off_978F_1A_03:
- D - I - - 0x01979F 13:978F: E0        .byte $E0
- D - I - - 0x0197A0 13:9790: 15        .byte $15
- D - I - - 0x0197A1 13:9791: E3        .byte $E3
- D - I - - 0x0197A2 13:9792: 00        .byte $00
- D - I - - 0x0197A3 13:9793: 84        .byte $84
- D - I - - 0x0197A4 13:9794: ED        .byte $ED
- D - I - - 0x0197A5 13:9795: 01        .byte $01
- D - I - - 0x0197A6 13:9796: 0C        .byte $0C
- D - I - - 0x0197A7 13:9797: 88        .byte $88
- D - I - - 0x0197A8 13:9798: 08        .byte $08
- D - I - - 0x0197A9 13:9799: E3        .byte $E3
- D - I - - 0x0197AA 13:979A: 08        .byte $08
- D - I - - 0x0197AB 13:979B: 07        .byte $07
- D - I - - 0x0197AC 13:979C: FF        .byte $FF



_off000_979D_2E:
- D - I - - 0x0197AD 13:979D: 00        .byte $00
- D - I - - 0x0197AE 13:979E: A7 97     .word off_97A7_2E_00
- D - I - - 0x0197B0 13:97A0: 01        .byte $01
- D - I - - 0x0197B1 13:97A1: B7 97     .word off_97B7_2E_01
- D - I - - 0x0197B3 13:97A3: 03        .byte $03
- D - I - - 0x0197B4 13:97A4: C7 97     .word off_97C7_2E_03
- D - I - - 0x0197B6 13:97A6: FF        .byte $FF



off_97A7_2E_00:
- D - I - - 0x0197B7 13:97A7: E0        .byte $E0
- D - I - - 0x0197B8 13:97A8: 14        .byte $14
- D - I - - 0x0197B9 13:97A9: E2        .byte $E2
- D - I - - 0x0197BA 13:97AA: 80        .byte $80
- D - I - - 0x0197BB 13:97AB: E3        .byte $E3
- D - I - - 0x0197BC 13:97AC: 00        .byte $00
- D - I - - 0x0197BD 13:97AD: 81        .byte $81
- D - I - - 0x0197BE 13:97AE: 10        .byte $10
- D - I - - 0x0197BF 13:97AF: 00        .byte $00
- D - I - - 0x0197C0 13:97B0: 15        .byte $15
- D - I - - 0x0197C1 13:97B1: 05        .byte $05
- D - I - - 0x0197C2 13:97B2: 10        .byte $10
- D - I - - 0x0197C3 13:97B3: 00        .byte $00
- D - I - - 0x0197C4 13:97B4: 16        .byte $16
- D - I - - 0x0197C5 13:97B5: 06        .byte $06
- D - I - - 0x0197C6 13:97B6: FF        .byte $FF



off_97B7_2E_01:
- D - I - - 0x0197C7 13:97B7: E0        .byte $E0
- D - I - - 0x0197C8 13:97B8: 14        .byte $14
- D - I - - 0x0197C9 13:97B9: E2        .byte $E2
- D - I - - 0x0197CA 13:97BA: 80        .byte $80
- D - I - - 0x0197CB 13:97BB: E3        .byte $E3
- D - I - - 0x0197CC 13:97BC: 00        .byte $00
- D - I - - 0x0197CD 13:97BD: 81        .byte $81
- D - I - - 0x0197CE 13:97BE: 11        .byte $11
- D - I - - 0x0197CF 13:97BF: 01        .byte $01
- D - I - - 0x0197D0 13:97C0: 16        .byte $16
- D - I - - 0x0197D1 13:97C1: 06        .byte $06
- D - I - - 0x0197D2 13:97C2: 11        .byte $11
- D - I - - 0x0197D3 13:97C3: 01        .byte $01
- D - I - - 0x0197D4 13:97C4: 17        .byte $17
- D - I - - 0x0197D5 13:97C5: 07        .byte $07
- D - I - - 0x0197D6 13:97C6: FF        .byte $FF



off_97C7_2E_03:
- D - I - - 0x0197D7 13:97C7: E0        .byte $E0
- D - I - - 0x0197D8 13:97C8: 17        .byte $17
- D - I - - 0x0197D9 13:97C9: E3        .byte $E3
- D - I - - 0x0197DA 13:97CA: 00        .byte $00
- D - I - - 0x0197DB 13:97CB: 81        .byte $81
- D - I - - 0x0197DC 13:97CC: 0B        .byte $0B
- D - I - - 0x0197DD 13:97CD: 08        .byte $08
- D - I - - 0x0197DE 13:97CE: 0D        .byte $0D
- D - I - - 0x0197DF 13:97CF: 0F        .byte $0F
- D - I - - 0x0197E0 13:97D0: 0C        .byte $0C
- D - I - - 0x0197E1 13:97D1: 06        .byte $06
- D - I - - 0x0197E2 13:97D2: 0F        .byte $0F
- D - I - - 0x0197E3 13:97D3: 0A        .byte $0A
- D - I - - 0x0197E4 13:97D4: 0F        .byte $0F
- D - I - - 0x0197E5 13:97D5: FF        .byte $FF



_off000_97D6_29:
- D - I - - 0x0197E6 13:97D6: 00        .byte $00
- D - I - - 0x0197E7 13:97D7: DF 97     .word off_97DF_выкл
- D - I - - 0x0197E9 13:97D9: 01        .byte $01
- D - I - - 0x0197EA 13:97DA: E0 97     .word off_97E0_29_01
- D - I - - 0x0197EC 13:97DC: 03        .byte $03
- D - I - - 0x0197ED 13:97DD: F7 97     .word off_97F7_29_03
off_97DF_выкл:
- D - I - - 0x0197EF 13:97DF: FF        .byte $FF



off_97E0_29_01:
- D - I - - 0x0197F0 13:97E0: E0        .byte $E0
- D - I - - 0x0197F1 13:97E1: 16        .byte $16
- D - I - - 0x0197F2 13:97E2: E2        .byte $E2
- D - I - - 0x0197F3 13:97E3: 80        .byte $80
- D - I - - 0x0197F4 13:97E4: E3        .byte $E3
- D - I - - 0x0197F5 13:97E5: 00        .byte $00
- D - I - - 0x0197F6 13:97E6: E9        .byte $E9
- D - I - - 0x0197F7 13:97E7: EF 97     .word off_97EF_отрезок
- D - I - - 0x0197F9 13:97E9: E3        .byte $E3
- D - I - - 0x0197FA 13:97EA: 0B        .byte $0B
- D - I - - 0x0197FB 13:97EB: E9        .byte $E9
- D - I - - 0x0197FC 13:97EC: EF 97     .word off_97EF_отрезок
- D - I - - 0x0197FE 13:97EE: FF        .byte $FF
off_97EF_отрезок:
- D - I - - 0x0197FF 13:97EF: 82        .byte $82
- D - I - - 0x019800 13:97F0: 08        .byte $08
- D - I - - 0x019801 13:97F1: 09        .byte $09
- D - I - - 0x019802 13:97F2: 08        .byte $08
- D - I - - 0x019803 13:97F3: 07        .byte $07
- D - I - - 0x019804 13:97F4: 81        .byte $81
- D - I - - 0x019805 13:97F5: 06        .byte $06
- D - I - - 0x019806 13:97F6: EA        .byte $EA



off_97F7_29_03:
- D - I - - 0x019807 13:97F7: E0        .byte $E0
- D - I - - 0x019808 13:97F8: 12        .byte $12
- D - I - - 0x019809 13:97F9: E3        .byte $E3
- D - I - - 0x01980A 13:97FA: 00        .byte $00
- D - I - - 0x01980B 13:97FB: 82        .byte $82
- D - I - - 0x01980C 13:97FC: 07        .byte $07
- D - I - - 0x01980D 13:97FD: 08        .byte $08
- D - I - - 0x01980E 13:97FE: 07        .byte $07
- D - I - - 0x01980F 13:97FF: 06        .byte $06
- D - I - - 0x019810 13:9800: 81        .byte $81
- D - I - - 0x019811 13:9801: 05        .byte $05
- D - I - - 0x019812 13:9802: FF        .byte $FF



_off000_9803_2C_принятие_мяча:
- D - I - - 0x019813 13:9803: 00        .byte $00
- D - I - - 0x019814 13:9804: 0C 98     .word off_980C_выкл
- D - I - - 0x019816 13:9806: 01        .byte $01
- D - I - - 0x019817 13:9807: 0C 98     .word off_980C_выкл
- D - I - - 0x019819 13:9809: 03        .byte $03
- D - I - - 0x01981A 13:980A: 0D 98     .word off_980D_2C_03
off_980C_выкл:
- D - I - - 0x01981C 13:980C: FF        .byte $FF



off_980D_2C_03:
- D - I - - 0x01981D 13:980D: E0        .byte $E0
- D - I - - 0x01981E 13:980E: 12        .byte $12
- D - I - - 0x01981F 13:980F: E3        .byte $E3
- D - I - - 0x019820 13:9810: 00        .byte $00
- D - I - - 0x019821 13:9811: 82        .byte $82
- D - I - - 0x019822 13:9812: 0D        .byte $0D
- D - I - - 0x019823 13:9813: E3        .byte $E3
- D - I - - 0x019824 13:9814: 02        .byte $02
- D - I - - 0x019825 13:9815: 0C        .byte $0C
- D - I - - 0x019826 13:9816: 07        .byte $07
- D - I - - 0x019827 13:9817: E3        .byte $E3
- D - I - - 0x019828 13:9818: 06        .byte $06
- D - I - - 0x019829 13:9819: 0D        .byte $0D
- D - I - - 0x01982A 13:981A: FF        .byte $FF



_off000_981B_2F:
- D - I - - 0x01982B 13:981B: 00        .byte $00
- D - I - - 0x01982C 13:981C: 25 98     .word off_9825_2F_00_повтор
- D - I - - 0x01982E 13:981E: 01        .byte $01
- D - I - - 0x01982F 13:981F: 39 98     .word off_9839_2F_01
- D - I - - 0x019831 13:9821: 03        .byte $03
- D - I - - 0x019832 13:9822: 40 98     .word off_9840_2F_03
- D - I - - 0x019834 13:9824: FF        .byte $FF



off_9825_2F_00_повтор:
- D - I - - 0x019835 13:9825: E0        .byte $E0
- D - I - - 0x019836 13:9826: 17        .byte $17
- D - I - - 0x019837 13:9827: E2        .byte $E2
- D - I - - 0x019838 13:9828: 80        .byte $80
- D - I - - 0x019839 13:9829: E3        .byte $E3
- D - I - - 0x01983A 13:982A: 00        .byte $00
- D - I - - 0x01983B 13:982B: 81        .byte $81
- D - I - - 0x01983C 13:982C: 10        .byte $10
- D - I - - 0x01983D 13:982D: 00        .byte $00
- D - I - - 0x01983E 13:982E: 15        .byte $15
- D - I - - 0x01983F 13:982F: 05        .byte $05
- D - I - - 0x019840 13:9830: 10        .byte $10
- D - I - - 0x019841 13:9831: 00        .byte $00
- D - I - - 0x019842 13:9832: 16        .byte $16
- D - I - - 0x019843 13:9833: 06        .byte $06
- D - I - - 0x019844 13:9834: 10        .byte $10
- D - I - - 0x019845 13:9835: 00        .byte $00
- D - I - - 0x019846 13:9836: 17        .byte $17
- D - I - - 0x019847 13:9837: 07        .byte $07
- D - I - - 0x019848 13:9838: FF        .byte $FF



off_9839_2F_01:
- D - I - - 0x019849 13:9839: E5        .byte $E5
- D - I - - 0x01984A 13:983A: 08        .byte $08
- D - I - - 0x01984B 13:983B: 81        .byte $81
- D - I - - 0x01984C 13:983C: 0C        .byte $0C
- D - I - - 0x01984D 13:983D: E8        .byte $E8
- D - I - - 0x01984E 13:983E: 25 98     .word off_9825_2F_00_повтор



off_9840_2F_03:
- D - I - - 0x019850 13:9840: E0        .byte $E0
- D - I - - 0x019851 13:9841: 17        .byte $17
- D - I - - 0x019852 13:9842: E3        .byte $E3
- D - I - - 0x019853 13:9843: 00        .byte $00
- D - I - - 0x019854 13:9844: 81        .byte $81
- D - I - - 0x019855 13:9845: 0B        .byte $0B
- D - I - - 0x019856 13:9846: 0C        .byte $0C
- D - I - - 0x019857 13:9847: 05        .byte $05
- D - I - - 0x019858 13:9848: 0F        .byte $0F
- D - I - - 0x019859 13:9849: 0A        .byte $0A
- D - I - - 0x01985A 13:984A: 08        .byte $08
- D - I - - 0x01985B 13:984B: 05        .byte $05
- D - I - - 0x01985C 13:984C: 0F        .byte $0F
- D - I - - 0x01985D 13:984D: 0E        .byte $0E
- D - I - - 0x01985E 13:984E: 0D        .byte $0D
- D - I - - 0x01985F 13:984F: 0C        .byte $0C
- D - I - - 0x019860 13:9850: 0B        .byte $0B
- D - I - - 0x019861 13:9851: FF        .byte $FF
- - - - - - 0x019862 13:9852: 00        .byte $00
- - - - - - 0x019863 13:9853: 5B        .byte $5B
- - - - - - 0x019864 13:9854: 98        .byte $98
- - - - - - 0x019865 13:9855: 01        .byte $01
- - - - - - 0x019866 13:9856: 5C        .byte $5C
- - - - - - 0x019867 13:9857: 98        .byte $98
- - - - - - 0x019868 13:9858: 03        .byte $03
- - - - - - 0x019869 13:9859: 67        .byte $67
- - - - - - 0x01986A 13:985A: 98        .byte $98
- - - - - - 0x01986B 13:985B: FF        .byte $FF
- - - - - - 0x01986C 13:985C: E0        .byte $E0
- - - - - - 0x01986D 13:985D: 12        .byte $12
- - - - - - 0x01986E 13:985E: E2        .byte $E2
- - - - - - 0x01986F 13:985F: 80        .byte $80
- - - - - - 0x019870 13:9860: E3        .byte $E3
- - - - - - 0x019871 13:9861: 00        .byte $00
- - - - - - 0x019872 13:9862: 81        .byte $81
- - - - - - 0x019873 13:9863: 10        .byte $10
- - - - - - 0x019874 13:9864: 01        .byte $01
- - - - - - 0x019875 13:9865: 11        .byte $11
- - - - - - 0x019876 13:9866: FF        .byte $FF
- - - - - - 0x019877 13:9867: E0        .byte $E0
- - - - - - 0x019878 13:9868: 16        .byte $16
- - - - - - 0x019879 13:9869: E3        .byte $E3
- - - - - - 0x01987A 13:986A: 00        .byte $00
- - - - - - 0x01987B 13:986B: 81        .byte $81
- - - - - - 0x01987C 13:986C: 0A        .byte $0A
- - - - - - 0x01987D 13:986D: 00        .byte $00
- - - - - - 0x01987E 13:986E: 01        .byte $01
- - - - - - 0x01987F 13:986F: 02        .byte $02
- - - - - - 0x019880 13:9870: 03        .byte $03
- - - - - - 0x019881 13:9871: 04        .byte $04
- - - - - - 0x019882 13:9872: 05        .byte $05
- - - - - - 0x019883 13:9873: FF        .byte $FF



_off000_9874_5D_звук_гол:
- D - I - - 0x019884 13:9874: 00        .byte $00
- D - I - - 0x019885 13:9875: 7D 98     .word off_987D_выкл
- D - I - - 0x019887 13:9877: 01        .byte $01
- D - I - - 0x019888 13:9878: 94 98     .word off_9894_5D_60_01
- D - I - - 0x01988A 13:987A: 03        .byte $03
- D - I - - 0x01988B 13:987B: 9D 98     .word off_989D_5D_60_03
off_987D_выкл:
- D - I - - 0x01988D 13:987D: FF        .byte $FF



_off000_987E_60_звук_гол:
- D - I - - 0x01988E 13:987E: 00        .byte $00
- D - I - - 0x01988F 13:987F: 93 98     .word off_9893_выкл
- D - I - - 0x019891 13:9881: 01        .byte $01
- D - I - - 0x019892 13:9882: 94 98     .word off_9894_5D_60_01
- D - I - - 0x019894 13:9884: 03        .byte $03
- D - I - - 0x019895 13:9885: 9D 98     .word off_989D_5D_60_03
- D - I - - 0x019897 13:9887: 04        .byte $04
- D - I - - 0x019898 13:9888: 93 98     .word off_9893_выкл
- D - I - - 0x01989A 13:988A: 05        .byte $05
- D - I - - 0x01989B 13:988B: 93 98     .word off_9893_выкл
- D - I - - 0x01989D 13:988D: 06        .byte $06
- D - I - - 0x01989E 13:988E: 93 98     .word off_9893_выкл
- D - I - - 0x0198A0 13:9890: 07        .byte $07
- D - I - - 0x0198A1 13:9891: 93 98     .word off_9893_выкл
off_9893_выкл:
- D - I - - 0x0198A3 13:9893: FF        .byte $FF



off_9894_5D_60_01:
- D - I - - 0x0198A4 13:9894: 8E        .byte $8E
- D - I - - 0x0198A5 13:9895: 0C        .byte $0C
- D - I - - 0x0198A6 13:9896: E9        .byte $E9
- D - I - - 0x0198A7 13:9897: 36 9A     .word off_9A36_отрезок
- D - I - - 0x0198A9 13:9899: E9        .byte $E9
- D - I - - 0x0198AA 13:989A: 14 9A     .word off_9A14_отрезок
- D - I - - 0x0198AC 13:989C: FF        .byte $FF



off_989D_5D_60_03:
- D - I - - 0x0198AD 13:989D: E9        .byte $E9
- D - I - - 0x0198AE 13:989E: A5 98     .word off_98A5_отрезок
- D - I - - 0x0198B0 13:98A0: 8F        .byte $8F
- D - I - - 0x0198B1 13:98A1: 10        .byte $10
- D - I - - 0x0198B2 13:98A2: E8        .byte $E8
- D - I - - 0x0198B3 13:98A3: F4 98     .word off_98F4_повтор
off_98A5_отрезок:
- D - I - - 0x0198B5 13:98A5: E0        .byte $E0
- D - I - - 0x0198B6 13:98A6: 17        .byte $17
- D - I - - 0x0198B7 13:98A7: E3        .byte $E3
- D - I - - 0x0198B8 13:98A8: 00        .byte $00
- D - I - - 0x0198B9 13:98A9: 81        .byte $81
- D - I - - 0x0198BA 13:98AA: 0D        .byte $0D
- D - I - - 0x0198BB 13:98AB: 0E        .byte $0E
- D - I - - 0x0198BC 13:98AC: 0F        .byte $0F
- D - I - - 0x0198BD 13:98AD: 0E        .byte $0E
- D - I - - 0x0198BE 13:98AE: 0D        .byte $0D
- D - I - - 0x0198BF 13:98AF: 0C        .byte $0C
- D - I - - 0x0198C0 13:98B0: 0B        .byte $0B
- D - I - - 0x0198C1 13:98B1: 0C        .byte $0C
- D - I - - 0x0198C2 13:98B2: 0A        .byte $0A
- D - I - - 0x0198C3 13:98B3: 0B        .byte $0B
- D - I - - 0x0198C4 13:98B4: 09        .byte $09
- D - I - - 0x0198C5 13:98B5: 08        .byte $08
- D - I - - 0x0198C6 13:98B6: 07        .byte $07
- D - I - - 0x0198C7 13:98B7: 06        .byte $06
- D - I - - 0x0198C8 13:98B8: 05        .byte $05
- D - I - - 0x0198C9 13:98B9: 06        .byte $06
- D - I - - 0x0198CA 13:98BA: 07        .byte $07
- D - I - - 0x0198CB 13:98BB: 08        .byte $08
- D - I - - 0x0198CC 13:98BC: EA        .byte $EA



_off000_98BD_61_звук_рваная_сетка:
- D - I - - 0x0198CD 13:98BD: 00        .byte $00
- D - I - - 0x0198CE 13:98BE: D2 98     .word off_98D2_выкл
- D - I - - 0x0198D0 13:98C0: 01        .byte $01
- D - I - - 0x0198D1 13:98C1: 3B 99     .word off_993B_61_01
- D - I - - 0x0198D3 13:98C3: 03        .byte $03
- D - I - - 0x0198D4 13:98C4: D3 98     .word off_98D3_61_03
- D - I - - 0x0198D6 13:98C6: 04        .byte $04
- D - I - - 0x0198D7 13:98C7: D2 98     .word off_98D2_выкл
- D - I - - 0x0198D9 13:98C9: 05        .byte $05
- D - I - - 0x0198DA 13:98CA: D2 98     .word off_98D2_выкл
- D - I - - 0x0198DC 13:98CC: 06        .byte $06
- D - I - - 0x0198DD 13:98CD: D2 98     .word off_98D2_выкл
- D - I - - 0x0198DF 13:98CF: 07        .byte $07
- D - I - - 0x0198E0 13:98D0: D2 98     .word off_98D2_выкл
off_98D2_выкл:
- D - I - - 0x0198E2 13:98D2: FF        .byte $FF



off_98D3_61_03:
- D - I - - 0x0198E3 13:98D3: E0        .byte $E0
- D - I - - 0x0198E4 13:98D4: 15        .byte $15
- D - I - - 0x0198E5 13:98D5: E3        .byte $E3
- D - I - - 0x0198E6 13:98D6: 00        .byte $00
- D - I - - 0x0198E7 13:98D7: 81        .byte $81
- D - I - - 0x0198E8 13:98D8: 0D        .byte $0D
- D - I - - 0x0198E9 13:98D9: 0E        .byte $0E
- D - I - - 0x0198EA 13:98DA: 06        .byte $06
- D - I - - 0x0198EB 13:98DB: 09        .byte $09
- D - I - - 0x0198EC 13:98DC: 0A        .byte $0A
- D - I - - 0x0198ED 13:98DD: 0C        .byte $0C
- D - I - - 0x0198EE 13:98DE: 0D        .byte $0D
- D - I - - 0x0198EF 13:98DF: 05        .byte $05
- D - I - - 0x0198F0 13:98E0: 08        .byte $08
- D - I - - 0x0198F1 13:98E1: 09        .byte $09
- D - I - - 0x0198F2 13:98E2: 0B        .byte $0B
- D - I - - 0x0198F3 13:98E3: 0C        .byte $0C
- D - I - - 0x0198F4 13:98E4: 04        .byte $04
- D - I - - 0x0198F5 13:98E5: 07        .byte $07
- D - I - - 0x0198F6 13:98E6: 08        .byte $08
- D - I - - 0x0198F7 13:98E7: 0A        .byte $0A
- D - I - - 0x0198F8 13:98E8: 0B        .byte $0B
- D - I - - 0x0198F9 13:98E9: 03        .byte $03
- D - I - - 0x0198FA 13:98EA: 06        .byte $06
- D - I - - 0x0198FB 13:98EB: 07        .byte $07
- D - I - - 0x0198FC 13:98EC: 06        .byte $06
- D - I - - 0x0198FD 13:98ED: 07        .byte $07
- D - I - - 0x0198FE 13:98EE: 08        .byte $08
- D - I - - 0x0198FF 13:98EF: 09        .byte $09
- D - I - - 0x019900 13:98F0: 83        .byte $83
- D - I - - 0x019901 13:98F1: 0A        .byte $0A
- D - I - - 0x019902 13:98F2: 8F        .byte $8F
- D - I - - 0x019903 13:98F3: 10        .byte $10
off_98F4_повтор:
- D - I - - 0x019904 13:98F4: E0        .byte $E0
- D - I - - 0x019905 13:98F5: 21        .byte $21
- D - I - - 0x019906 13:98F6: E3        .byte $E3
- D - I - - 0x019907 13:98F7: 04        .byte $04
- D - I - - 0x019908 13:98F8: 8F        .byte $8F
- D - I - - 0x019909 13:98F9: 0A        .byte $0A
- D - I - - 0x01990A 13:98FA: E3        .byte $E3
- D - I - - 0x01990B 13:98FB: 02        .byte $02
- D - I - - 0x01990C 13:98FC: 9A        .byte $9A
- D - I - - 0x01990D 13:98FD: 0A        .byte $0A
- D - I - - 0x01990E 13:98FE: E3        .byte $E3
- D - I - - 0x01990F 13:98FF: 03        .byte $03
- D - I - - 0x019910 13:9900: 97        .byte $97
- D - I - - 0x019911 13:9901: 0A        .byte $0A
- D - I - - 0x019912 13:9902: E3        .byte $E3
- D - I - - 0x019913 13:9903: 02        .byte $02
- D - I - - 0x019914 13:9904: 95        .byte $95
- D - I - - 0x019915 13:9905: 0A        .byte $0A
- D - I - - 0x019916 13:9906: E3        .byte $E3
- D - I - - 0x019917 13:9907: 01        .byte $01
- D - I - - 0x019918 13:9908: 96        .byte $96
- D - I - - 0x019919 13:9909: 0A        .byte $0A
- D - I - - 0x01991A 13:990A: E3        .byte $E3
- D - I - - 0x01991B 13:990B: 03        .byte $03
- D - I - - 0x01991C 13:990C: 98        .byte $98
- D - I - - 0x01991D 13:990D: 0A        .byte $0A
- D - I - - 0x01991E 13:990E: E3        .byte $E3
- D - I - - 0x01991F 13:990F: 04        .byte $04
- D - I - - 0x019920 13:9910: 99        .byte $99
- D - I - - 0x019921 13:9911: 0A        .byte $0A
- D - I - - 0x019922 13:9912: E3        .byte $E3
- D - I - - 0x019923 13:9913: 05        .byte $05
- D - I - - 0x019924 13:9914: 97        .byte $97
- D - I - - 0x019925 13:9915: 0A        .byte $0A
- D - I - - 0x019926 13:9916: E3        .byte $E3
- D - I - - 0x019927 13:9917: 06        .byte $06
- D - I - - 0x019928 13:9918: 99        .byte $99
- D - I - - 0x019929 13:9919: 0A        .byte $0A
- D - I - - 0x01992A 13:991A: E3        .byte $E3
- D - I - - 0x01992B 13:991B: 07        .byte $07
- D - I - - 0x01992C 13:991C: 98        .byte $98
- D - I - - 0x01992D 13:991D: 0A        .byte $0A
- D - I - - 0x01992E 13:991E: E3        .byte $E3
- D - I - - 0x01992F 13:991F: 08        .byte $08
- D - I - - 0x019930 13:9920: 9A        .byte $9A
- D - I - - 0x019931 13:9921: 0A        .byte $0A
- D - I - - 0x019932 13:9922: E3        .byte $E3
- D - I - - 0x019933 13:9923: 09        .byte $09
- D - I - - 0x019934 13:9924: 98        .byte $98
- D - I - - 0x019935 13:9925: 0A        .byte $0A
- D - I - - 0x019936 13:9926: E3        .byte $E3
- D - I - - 0x019937 13:9927: 0A        .byte $0A
- D - I - - 0x019938 13:9928: 96        .byte $96
- D - I - - 0x019939 13:9929: 0A        .byte $0A
- D - I - - 0x01993A 13:992A: E3        .byte $E3
- D - I - - 0x01993B 13:992B: 0B        .byte $0B
- D - I - - 0x01993C 13:992C: 95        .byte $95
- D - I - - 0x01993D 13:992D: 0A        .byte $0A
- D - I - - 0x01993E 13:992E: E3        .byte $E3
- D - I - - 0x01993F 13:992F: 0C        .byte $0C
- D - I - - 0x019940 13:9930: 94        .byte $94
- D - I - - 0x019941 13:9931: 0A        .byte $0A
- D - I - - 0x019942 13:9932: E3        .byte $E3
- D - I - - 0x019943 13:9933: 0D        .byte $0D
- D - I - - 0x019944 13:9934: 95        .byte $95
- D - I - - 0x019945 13:9935: 0A        .byte $0A
- D - I - - 0x019946 13:9936: E3        .byte $E3
- D - I - - 0x019947 13:9937: 0E        .byte $0E
- D - I - - 0x019948 13:9938: 94        .byte $94
- D - I - - 0x019949 13:9939: 0A        .byte $0A
- D - I - - 0x01994A 13:993A: FF        .byte $FF



off_993B_61_01:
- D - I - - 0x01994B 13:993B: 95        .byte $95
- D - I - - 0x01994C 13:993C: 0C        .byte $0C
- D - I - - 0x01994D 13:993D: E9        .byte $E9
- D - I - - 0x01994E 13:993E: 36 9A     .word off_9A36_отрезок
- D - I - - 0x019950 13:9940: E9        .byte $E9
- D - I - - 0x019951 13:9941: 14 9A     .word off_9A14_отрезок
- D - I - - 0x019953 13:9943: FF        .byte $FF



_off000_9944_62_звук_громкие_зрители:
- D - I - - 0x019954 13:9944: 00        .byte $00
- D - I - - 0x019955 13:9945: 4D 99     .word off_994D_выкл
- D - I - - 0x019957 13:9947: 01        .byte $01
- D - I - - 0x019958 13:9948: 4D 99     .word off_994D_выкл
- D - I - - 0x01995A 13:994A: 03        .byte $03
- D - I - - 0x01995B 13:994B: 4E 99     .word off_994E_62_03
off_994D_выкл:
- D - I - - 0x01995D 13:994D: FF        .byte $FF



off_994E_62_03:
- D - I - - 0x01995E 13:994E: E0        .byte $E0
- D - I - - 0x01995F 13:994F: 21        .byte $21
- D - I - - 0x019960 13:9950: E0        .byte $E0
- D - I - - 0x019961 13:9951: 17        .byte $17
- D - I - - 0x019962 13:9952: E3        .byte $E3
- D - I - - 0x019963 13:9953: 04        .byte $04
- D - I - - 0x019964 13:9954: 8E        .byte $8E
- D - I - - 0x019965 13:9955: 0A        .byte $0A
off_9956_повтор:
- D - I - - 0x019966 13:9956: E3        .byte $E3
- D - I - - 0x019967 13:9957: 01        .byte $01
- D - I - - 0x019968 13:9958: 95        .byte $95
- D - I - - 0x019969 13:9959: 0A        .byte $0A
- D - I - - 0x01996A 13:995A: E3        .byte $E3
- D - I - - 0x01996B 13:995B: 03        .byte $03
- D - I - - 0x01996C 13:995C: 8A        .byte $8A
- D - I - - 0x01996D 13:995D: 0A        .byte $0A
- D - I - - 0x01996E 13:995E: E3        .byte $E3
- D - I - - 0x01996F 13:995F: 02        .byte $02
- D - I - - 0x019970 13:9960: 8E        .byte $8E
- D - I - - 0x019971 13:9961: 0A        .byte $0A
- D - I - - 0x019972 13:9962: E3        .byte $E3
- D - I - - 0x019973 13:9963: 03        .byte $03
- D - I - - 0x019974 13:9964: 91        .byte $91
- D - I - - 0x019975 13:9965: 0A        .byte $0A
- D - I - - 0x019976 13:9966: E3        .byte $E3
- D - I - - 0x019977 13:9967: 04        .byte $04
- D - I - - 0x019978 13:9968: 8E        .byte $8E
- D - I - - 0x019979 13:9969: 0A        .byte $0A
- D - I - - 0x01997A 13:996A: E3        .byte $E3
- D - I - - 0x01997B 13:996B: 05        .byte $05
- D - I - - 0x01997C 13:996C: 8A        .byte $8A
- D - I - - 0x01997D 13:996D: 0A        .byte $0A
- D - I - - 0x01997E 13:996E: E3        .byte $E3
- D - I - - 0x01997F 13:996F: 06        .byte $06
- D - I - - 0x019980 13:9970: 91        .byte $91
- D - I - - 0x019981 13:9971: 0A        .byte $0A
- D - I - - 0x019982 13:9972: E3        .byte $E3
- D - I - - 0x019983 13:9973: 07        .byte $07
- D - I - - 0x019984 13:9974: 0A        .byte $0A
- D - I - - 0x019985 13:9975: E3        .byte $E3
- D - I - - 0x019986 13:9976: 08        .byte $08
- D - I - - 0x019987 13:9977: 94        .byte $94
- D - I - - 0x019988 13:9978: 0A        .byte $0A
- D - I - - 0x019989 13:9979: E3        .byte $E3
- D - I - - 0x01998A 13:997A: 09        .byte $09
- D - I - - 0x01998B 13:997B: 8D        .byte $8D
- D - I - - 0x01998C 13:997C: 0A        .byte $0A
- D - I - - 0x01998D 13:997D: E3        .byte $E3
- D - I - - 0x01998E 13:997E: 0A        .byte $0A
- D - I - - 0x01998F 13:997F: 0A        .byte $0A
- D - I - - 0x019990 13:9980: E3        .byte $E3
- D - I - - 0x019991 13:9981: 0B        .byte $0B
- D - I - - 0x019992 13:9982: 0A        .byte $0A
- D - I - - 0x019993 13:9983: E3        .byte $E3
- D - I - - 0x019994 13:9984: 0C        .byte $0C
- D - I - - 0x019995 13:9985: 0A        .byte $0A
- D - I - - 0x019996 13:9986: E3        .byte $E3
- D - I - - 0x019997 13:9987: 0D        .byte $0D
- D - I - - 0x019998 13:9988: 0A        .byte $0A
- D - I - - 0x019999 13:9989: E3        .byte $E3
- D - I - - 0x01999A 13:998A: 0E        .byte $0E
- D - I - - 0x01999B 13:998B: 99        .byte $99
- D - I - - 0x01999C 13:998C: 0A        .byte $0A
- D - I - - 0x01999D 13:998D: FF        .byte $FF



_off000_998E_63_звук_штанга:
- D - I - - 0x01999E 13:998E: 00        .byte $00
- D - I - - 0x01999F 13:998F: 98 99     .word off_9998_63_00
- D - I - - 0x0199A1 13:9991: 01        .byte $01
- D - I - - 0x0199A2 13:9992: A6 99     .word off_99A6_63_01
- D - I - - 0x0199A4 13:9994: 03        .byte $03
- D - I - - 0x0199A5 13:9995: 97 99     .word off_9997_выкл
off_9997_выкл:
- D - I - - 0x0199A7 13:9997: FF        .byte $FF



off_9998_63_00:
- D - I - - 0x0199A8 13:9998: E0        .byte $E0
- D - I - - 0x0199A9 13:9999: 12        .byte $12
- D - I - - 0x0199AA 13:999A: E2        .byte $E2
- D - I - - 0x0199AB 13:999B: 80        .byte $80
- D - I - - 0x0199AC 13:999C: E3        .byte $E3
- D - I - - 0x0199AD 13:999D: 05        .byte $05
- D - I - - 0x0199AE 13:999E: 81        .byte $81
- D - I - - 0x0199AF 13:999F: 28        .byte $28
- D - I - - 0x0199B0 13:99A0: 29        .byte $29
- D - I - - 0x0199B1 13:99A1: 28        .byte $28
- D - I - - 0x0199B2 13:99A2: 27        .byte $27
- D - I - - 0x0199B3 13:99A3: 94        .byte $94
- D - I - - 0x0199B4 13:99A4: 26        .byte $26
- D - I - - 0x0199B5 13:99A5: FF        .byte $FF



off_99A6_63_01:
- D - I - - 0x0199B6 13:99A6: E0        .byte $E0
- D - I - - 0x0199B7 13:99A7: 12        .byte $12
- D - I - - 0x0199B8 13:99A8: E2        .byte $E2
- D - I - - 0x0199B9 13:99A9: 80        .byte $80
- D - I - - 0x0199BA 13:99AA: E3        .byte $E3
- D - I - - 0x0199BB 13:99AB: 01        .byte $01
- D - I - - 0x0199BC 13:99AC: 81        .byte $81
- D - I - - 0x0199BD 13:99AD: 15        .byte $15
- D - I - - 0x0199BE 13:99AE: 16        .byte $16
- D - I - - 0x0199BF 13:99AF: 15        .byte $15
- D - I - - 0x0199C0 13:99B0: 14        .byte $14
- D - I - - 0x0199C1 13:99B1: 94        .byte $94
- D - I - - 0x0199C2 13:99B2: 13        .byte $13
- D - I - - 0x0199C3 13:99B3: FF        .byte $FF



_off000_99B4_65_звук_рваный_мяч:
- D - I - - 0x0199C4 13:99B4: 00        .byte $00
- D - I - - 0x0199C5 13:99B5: BD 99     .word off_99BD_выкл
- D - I - - 0x0199C7 13:99B7: 01        .byte $01
- D - I - - 0x0199C8 13:99B8: BE 99     .word off_99BE_65_01
- D - I - - 0x0199CA 13:99BA: 03        .byte $03
- D - I - - 0x0199CB 13:99BB: D5 99     .word off_99D5_65_03
off_99BD_выкл:
- D - I - - 0x0199CD 13:99BD: FF        .byte $FF



off_99BE_65_01:
- D - I - - 0x0199CE 13:99BE: E0        .byte $E0
- D - I - - 0x0199CF 13:99BF: 12        .byte $12
- D - I - - 0x0199D0 13:99C0: E2        .byte $E2
- D - I - - 0x0199D1 13:99C1: 40        .byte $40
- D - I - - 0x0199D2 13:99C2: E3        .byte $E3
- D - I - - 0x0199D3 13:99C3: 05        .byte $05
- D - I - - 0x0199D4 13:99C4: 81        .byte $81
- D - I - - 0x0199D5 13:99C5: 15        .byte $15
- D - I - - 0x0199D6 13:99C6: 13        .byte $13
- D - I - - 0x0199D7 13:99C7: 11        .byte $11
- D - I - - 0x0199D8 13:99C8: 0B        .byte $0B
- D - I - - 0x0199D9 13:99C9: 09        .byte $09
- D - I - - 0x0199DA 13:99CA: 0B        .byte $0B
- D - I - - 0x0199DB 13:99CB: 11        .byte $11
- D - I - - 0x0199DC 13:99CC: 10        .byte $10
- D - I - - 0x0199DD 13:99CD: 0B        .byte $0B
- D - I - - 0x0199DE 13:99CE: 0A        .byte $0A
- D - I - - 0x0199DF 13:99CF: 09        .byte $09
- D - I - - 0x0199E0 13:99D0: 0C        .byte $0C
- D - I - - 0x0199E1 13:99D1: 09        .byte $09
- D - I - - 0x0199E2 13:99D2: 0C        .byte $0C
- D - I - - 0x0199E3 13:99D3: 09        .byte $09
- D - I - - 0x0199E4 13:99D4: FF        .byte $FF



off_99D5_65_03:
- D - I - - 0x0199E5 13:99D5: E0        .byte $E0
- D - I - - 0x0199E6 13:99D6: 12        .byte $12
- D - I - - 0x0199E7 13:99D7: E3        .byte $E3
- D - I - - 0x0199E8 13:99D8: 00        .byte $00
- D - I - - 0x0199E9 13:99D9: 81        .byte $81
- D - I - - 0x0199EA 13:99DA: 03        .byte $03
- D - I - - 0x0199EB 13:99DB: 05        .byte $05
- D - I - - 0x0199EC 13:99DC: 04        .byte $04
- D - I - - 0x0199ED 13:99DD: 06        .byte $06
- D - I - - 0x0199EE 13:99DE: 05        .byte $05
- D - I - - 0x0199EF 13:99DF: 07        .byte $07
- D - I - - 0x0199F0 13:99E0: 06        .byte $06
- D - I - - 0x0199F1 13:99E1: 08        .byte $08
- D - I - - 0x0199F2 13:99E2: E3        .byte $E3
- D - I - - 0x0199F3 13:99E3: 07        .byte $07
- D - I - - 0x0199F4 13:99E4: 8E        .byte $8E
- D - I - - 0x0199F5 13:99E5: 0B        .byte $0B
- D - I - - 0x0199F6 13:99E6: FF        .byte $FF



_off000_99E7_68_звук_дриблинг:
- D - I - - 0x0199F7 13:99E7: 00        .byte $00
- D - I - - 0x0199F8 13:99E8: F0 99     .word off_99F0_выкл
- D - I - - 0x0199FA 13:99EA: 01        .byte $01
- D - I - - 0x0199FB 13:99EB: F0 99     .word off_99F0_выкл
- D - I - - 0x0199FD 13:99ED: 03        .byte $03
- D - I - - 0x0199FE 13:99EE: F1 99     .word off_99F1_68_03
off_99F0_выкл:
- D - I - - 0x019A00 13:99F0: FF        .byte $FF



off_99F1_68_03:
- D - I - - 0x019A01 13:99F1: E0        .byte $E0
- D - I - - 0x019A02 13:99F2: 12        .byte $12
- D - I - - 0x019A03 13:99F3: E3        .byte $E3
- D - I - - 0x019A04 13:99F4: 00        .byte $00
- D - I - - 0x019A05 13:99F5: ED        .byte $ED
- D - I - - 0x019A06 13:99F6: 02        .byte $02
- D - I - - 0x019A07 13:99F7: 84        .byte $84
- D - I - - 0x019A08 13:99F8: 09        .byte $09
- D - I - - 0x019A09 13:99F9: 93        .byte $93
- D - I - - 0x019A0A 13:99FA: 06        .byte $06
- D - I - - 0x019A0B 13:99FB: FF        .byte $FF



_off000_99FC_66_звук_свисток:
- D - I - - 0x019A0C 13:99FC: 00        .byte $00
- D - I - - 0x019A0D 13:99FD: 05 9A     .word off_9A05_выкл
- D - I - - 0x019A0F 13:99FF: 01        .byte $01
- D - I - - 0x019A10 13:9A00: 06 9A     .word off_9A06_66_01
- D - I - - 0x019A12 13:9A02: 03        .byte $03
- D - I - - 0x019A13 13:9A03: 05 9A     .word off_9A05_выкл
off_9A05_выкл:
- D - I - - 0x019A15 13:9A05: FF        .byte $FF



off_9A06_66_01:
- D - I - - 0x019A16 13:9A06: E0        .byte $E0
- D - I - - 0x019A17 13:9A07: 12        .byte $12
- D - I - - 0x019A18 13:9A08: E2        .byte $E2
- D - I - - 0x019A19 13:9A09: 80        .byte $80
- D - I - - 0x019A1A 13:9A0A: E3        .byte $E3
- D - I - - 0x019A1B 13:9A0B: 00        .byte $00
- D - I - - 0x019A1C 13:9A0C: 81        .byte $81
- D - I - - 0x019A1D 13:9A0D: 4A        .byte $4A
- D - I - - 0x019A1E 13:9A0E: 82        .byte $82
- D - I - - 0x019A1F 13:9A0F: 4B        .byte $4B
- D - I - - 0x019A20 13:9A10: E9        .byte $E9
- D - I - - 0x019A21 13:9A11: 14 9A     .word off_9A14_отрезок
- D - I - - 0x019A23 13:9A13: FF        .byte $FF
off_9A14_отрезок:
- D - I - - 0x019A24 13:9A14: 81        .byte $81
- D - I - - 0x019A25 13:9A15: 54        .byte $54
- D - I - - 0x019A26 13:9A16: 59        .byte $59
- D - I - - 0x019A27 13:9A17: 56        .byte $56
- D - I - - 0x019A28 13:9A18: EB        .byte $EB
- D - I - - 0x019A29 13:9A19: 15        .byte $15
- D - I - - 0x019A2A 13:9A1A: 58        .byte $58
- D - I - - 0x019A2B 13:9A1B: 54        .byte $54
- D - I - - 0x019A2C 13:9A1C: EC        .byte $EC
- D - I - - 0x019A2D 13:9A1D: EA        .byte $EA



_off000_9A1E_67_свисток_с_нарушением:
- D - I - - 0x019A2E 13:9A1E: 04        .byte $04
- D - I - - 0x019A2F 13:9A1F: 46 9A     .word off_9A46_67_04
- D - I - - 0x019A31 13:9A21: 05        .byte $05
- D - I - - 0x019A32 13:9A22: 2B 9A     .word off_9A2B_67_05
- D - I - - 0x019A34 13:9A24: 06        .byte $06
- D - I - - 0x019A35 13:9A25: 4B 9A     .word off_9A4B_67_06
- D - I - - 0x019A37 13:9A27: 07        .byte $07
- D - I - - 0x019A38 13:9A28: 50 9A     .word off_9A50_67_07
- D - I - - 0x019A3A 13:9A2A: FF        .byte $FF



off_9A2B_67_05:
- D - I - - 0x019A3B 13:9A2B: E9        .byte $E9
- D - I - - 0x019A3C 13:9A2C: 36 9A     .word off_9A36_отрезок
- D - I - - 0x019A3E 13:9A2E: E9        .byte $E9
- D - I - - 0x019A3F 13:9A2F: 14 9A     .word off_9A14_отрезок
- D - I - - 0x019A41 13:9A31: 8B        .byte $8B
- D - I - - 0x019A42 13:9A32: 0C        .byte $0C
- D - I - - 0x019A43 13:9A33: E8        .byte $E8
- D - I - - 0x019A44 13:9A34: F7 B8     .word off_0x01B907_повтор
off_9A36_отрезок:
- D - I - - 0x019A46 13:9A36: E0        .byte $E0
- D - I - - 0x019A47 13:9A37: 12        .byte $12
- D - I - - 0x019A48 13:9A38: E2        .byte $E2
- D - I - - 0x019A49 13:9A39: 80        .byte $80
- D - I - - 0x019A4A 13:9A3A: E3        .byte $E3
- D - I - - 0x019A4B 13:9A3B: 03        .byte $03
- D - I - - 0x019A4C 13:9A3C: 81        .byte $81
- D - I - - 0x019A4D 13:9A3D: 55        .byte $55
- D - I - - 0x019A4E 13:9A3E: 58        .byte $58
- D - I - - 0x019A4F 13:9A3F: 53        .byte $53
- D - I - - 0x019A50 13:9A40: 58        .byte $58
- D - I - - 0x019A51 13:9A41: 54        .byte $54
- D - I - - 0x019A52 13:9A42: 59        .byte $59
- D - I - - 0x019A53 13:9A43: 83        .byte $83
- D - I - - 0x019A54 13:9A44: 0C        .byte $0C
- D - I - - 0x019A55 13:9A45: EA        .byte $EA



off_9A46_67_04:
- D - I - - 0x019A56 13:9A46: 9E        .byte $9E
- D - I - - 0x019A57 13:9A47: 0C        .byte $0C
- D - I - - 0x019A58 13:9A48: E8        .byte $E8
- D - I - - 0x019A59 13:9A49: 05 B9     .word off_0x01B915_повтор



off_9A4B_67_06:
- D - I - - 0x019A5B 13:9A4B: 9E        .byte $9E
- D - I - - 0x019A5C 13:9A4C: 0C        .byte $0C
- D - I - - 0x019A5D 13:9A4D: E8        .byte $E8
- D - I - - 0x019A5E 13:9A4E: 13 B9     .word off_0x01B923_повтор



off_9A50_67_07:
- D - I - - 0x019A60 13:9A50: 9E        .byte $9E
- D - I - - 0x019A61 13:9A51: 10        .byte $10
- D - I - - 0x019A62 13:9A52: E8        .byte $E8
- D - I - - 0x019A63 13:9A53: 1F B9     .word off_0x01B92F_повтор



_off000_9A55_28_подкат:
- D - I - - 0x019A65 13:9A55: 00        .byte $00
- D - I - - 0x019A66 13:9A56: 5E 9A     .word off_9A5E_выкл
- D - I - - 0x019A68 13:9A58: 01        .byte $01
- D - I - - 0x019A69 13:9A59: 5E 9A     .word off_9A5E_выкл
- D - I - - 0x019A6B 13:9A5B: 03        .byte $03
- D - I - - 0x019A6C 13:9A5C: 5F 9A     .word off_9A5F_28_03
off_9A5E_выкл:
- D - I - - 0x019A6E 13:9A5E: FF        .byte $FF



off_9A5F_28_03:
- D - I - - 0x019A6F 13:9A5F: E0        .byte $E0
- D - I - - 0x019A70 13:9A60: 12        .byte $12
- D - I - - 0x019A71 13:9A61: E3        .byte $E3
- D - I - - 0x019A72 13:9A62: 00        .byte $00
- D - I - - 0x019A73 13:9A63: 81        .byte $81
- D - I - - 0x019A74 13:9A64: 0A        .byte $0A
- D - I - - 0x019A75 13:9A65: F3        .byte $F3
- D - I - - 0x019A76 13:9A66: 0B        .byte $0B
- D - I - - 0x019A77 13:9A67: 08        .byte $08
- D - I - - 0x019A78 13:9A68: 09        .byte $09
- D - I - - 0x019A79 13:9A69: 0A        .byte $0A
- D - I - - 0x019A7A 13:9A6A: F4        .byte $F4
- D - I - - 0x019A7B 13:9A6B: 84        .byte $84
- D - I - - 0x019A7C 13:9A6C: 10        .byte $10
- D - I - - 0x019A7D 13:9A6D: 07        .byte $07
- D - I - - 0x019A7E 13:9A6E: 08        .byte $08
- D - I - - 0x019A7F 13:9A6F: 07        .byte $07
- D - I - - 0x019A80 13:9A70: 85        .byte $85
- D - I - - 0x019A81 13:9A71: 07        .byte $07
- D - I - - 0x019A82 13:9A72: 08        .byte $08
- D - I - - 0x019A83 13:9A73: 09        .byte $09
- D - I - - 0x019A84 13:9A74: 96        .byte $96
- D - I - - 0x019A85 13:9A75: 09        .byte $09
- D - I - - 0x019A86 13:9A76: FF        .byte $FF



_off000_9A77_2A_ловля_мяча:
- D - I - - 0x019A87 13:9A77: 00        .byte $00
- D - I - - 0x019A88 13:9A78: 80 9A     .word off_9A80_выкл
- D - I - - 0x019A8A 13:9A7A: 01        .byte $01
- D - I - - 0x019A8B 13:9A7B: 81 9A     .word off_9A81_2A_01
- D - I - - 0x019A8D 13:9A7D: 03        .byte $03
- D - I - - 0x019A8E 13:9A7E: 8F 9A     .word off_9A8F_2A_03
off_9A80_выкл:
- D - I - - 0x019A90 13:9A80: FF        .byte $FF



off_9A81_2A_01:
- D - I - - 0x019A91 13:9A81: E0        .byte $E0
- D - I - - 0x019A92 13:9A82: 12        .byte $12
- D - I - - 0x019A93 13:9A83: E2        .byte $E2
- D - I - - 0x019A94 13:9A84: 80        .byte $80
- D - I - - 0x019A95 13:9A85: E3        .byte $E3
- D - I - - 0x019A96 13:9A86: 00        .byte $00
- D - I - - 0x019A97 13:9A87: 81        .byte $81
- D - I - - 0x019A98 13:9A88: 00        .byte $00
- D - I - - 0x019A99 13:9A89: 05        .byte $05
- D - I - - 0x019A9A 13:9A8A: 01        .byte $01
- D - I - - 0x019A9B 13:9A8B: 06        .byte $06
- D - I - - 0x019A9C 13:9A8C: 02        .byte $02
- D - I - - 0x019A9D 13:9A8D: 07        .byte $07
- D - I - - 0x019A9E 13:9A8E: FF        .byte $FF



off_9A8F_2A_03:
- D - I - - 0x019A9F 13:9A8F: E0        .byte $E0
- D - I - - 0x019AA0 13:9A90: 15        .byte $15
- D - I - - 0x019AA1 13:9A91: E3        .byte $E3
- D - I - - 0x019AA2 13:9A92: 00        .byte $00
- D - I - - 0x019AA3 13:9A93: 84        .byte $84
- D - I - - 0x019AA4 13:9A94: ED        .byte $ED
- D - I - - 0x019AA5 13:9A95: 02        .byte $02
- D - I - - 0x019AA6 13:9A96: 0E        .byte $0E
- D - I - - 0x019AA7 13:9A97: 8C        .byte $8C
- D - I - - 0x019AA8 13:9A98: 05        .byte $05
- D - I - - 0x019AA9 13:9A99: FF        .byte $FF



_off000_9A9A_2D_удар_мяча_об_живот:
- D - I - - 0x019AAA 13:9A9A: 00        .byte $00
- D - I - - 0x019AAB 13:9A9B: A4 9A     .word off_9AA4_2D_00
- D - I - - 0x019AAD 13:9A9D: 01        .byte $01
- D - I - - 0x019AAE 13:9A9E: B2 9A     .word off_9AB2_2D_01
- D - I - - 0x019AB0 13:9AA0: 03        .byte $03
- D - I - - 0x019AB1 13:9AA1: C0 9A     .word off_9AC0_2D_03
- D - I - - 0x019AB3 13:9AA3: FF        .byte $FF



off_9AA4_2D_00:
- D - I - - 0x019AB4 13:9AA4: E0        .byte $E0
- D - I - - 0x019AB5 13:9AA5: 16        .byte $16
- D - I - - 0x019AB6 13:9AA6: E2        .byte $E2
- D - I - - 0x019AB7 13:9AA7: 80        .byte $80
- D - I - - 0x019AB8 13:9AA8: E3        .byte $E3
- D - I - - 0x019AB9 13:9AA9: 00        .byte $00
- D - I - - 0x019ABA 13:9AAA: 81        .byte $81
- D - I - - 0x019ABB 13:9AAB: 10        .byte $10
- D - I - - 0x019ABC 13:9AAC: 00        .byte $00
- D - I - - 0x019ABD 13:9AAD: 16        .byte $16
- D - I - - 0x019ABE 13:9AAE: 06        .byte $06
- D - I - - 0x019ABF 13:9AAF: 10        .byte $10
- D - I - - 0x019AC0 13:9AB0: 00        .byte $00
- D - I - - 0x019AC1 13:9AB1: FF        .byte $FF



off_9AB2_2D_01:
- D - I - - 0x019AC2 13:9AB2: E0        .byte $E0
- D - I - - 0x019AC3 13:9AB3: 14        .byte $14
- D - I - - 0x019AC4 13:9AB4: E2        .byte $E2
- D - I - - 0x019AC5 13:9AB5: 40        .byte $40
- D - I - - 0x019AC6 13:9AB6: E3        .byte $E3
- D - I - - 0x019AC7 13:9AB7: 04        .byte $04
- D - I - - 0x019AC8 13:9AB8: 81        .byte $81
- D - I - - 0x019AC9 13:9AB9: 22        .byte $22
- D - I - - 0x019ACA 13:9ABA: 21        .byte $21
- D - I - - 0x019ACB 13:9ABB: 15        .byte $15
- D - I - - 0x019ACC 13:9ABC: 14        .byte $14
- D - I - - 0x019ACD 13:9ABD: 24        .byte $24
- D - I - - 0x019ACE 13:9ABE: 25        .byte $25
- D - I - - 0x019ACF 13:9ABF: FF        .byte $FF



off_9AC0_2D_03:
- D - I - - 0x019AD0 13:9AC0: E0        .byte $E0
- D - I - - 0x019AD1 13:9AC1: 17        .byte $17
- D - I - - 0x019AD2 13:9AC2: E3        .byte $E3
- D - I - - 0x019AD3 13:9AC3: 00        .byte $00
- D - I - - 0x019AD4 13:9AC4: 82        .byte $82
- D - I - - 0x019AD5 13:9AC5: 0E        .byte $0E
- D - I - - 0x019AD6 13:9AC6: 0D        .byte $0D
- D - I - - 0x019AD7 13:9AC7: 09        .byte $09
- D - I - - 0x019AD8 13:9AC8: 81        .byte $81
- D - I - - 0x019AD9 13:9AC9: 0A        .byte $0A
- D - I - - 0x019ADA 13:9ACA: 09        .byte $09
- D - I - - 0x019ADB 13:9ACB: 08        .byte $08
- D - I - - 0x019ADC 13:9ACC: FF        .byte $FF



_off000_9ACD_1D_удар_соды:
- D - I - - 0x019ADD 13:9ACD: 00        .byte $00
- D - I - - 0x019ADE 13:9ACE: D7 9A     .word off_9AD7_1D_00
- D - I - - 0x019AE0 13:9AD0: 01        .byte $01
- D - I - - 0x019AE1 13:9AD1: FB 9A     .word off_9AFB_1D_01
- D - I - - 0x019AE3 13:9AD3: 03        .byte $03
- D - I - - 0x019AE4 13:9AD4: 04 9B     .word off_9B04_1D_03
- D - I - - 0x019AE6 13:9AD6: FF        .byte $FF



off_9AD7_1D_00:
- D - I - - 0x019AE7 13:9AD7: E2        .byte $E2
- D - I - - 0x019AE8 13:9AD8: 40        .byte $40
- D - I - - 0x019AE9 13:9AD9: E3        .byte $E3
- D - I - - 0x019AEA 13:9ADA: 00        .byte $00
off_9ADB_повтор:
- D - I - - 0x019AEB 13:9ADB: 82        .byte $82
- D - I - - 0x019AEC 13:9ADC: 0C        .byte $0C
- D - I - - 0x019AED 13:9ADD: E0        .byte $E0
- D - I - - 0x019AEE 13:9ADE: 32        .byte $32
- D - I - - 0x019AEF 13:9ADF: 58        .byte $58
- D - I - - 0x019AF0 13:9AE0: F3        .byte $F3
- D - I - - 0x019AF1 13:9AE1: E5        .byte $E5
- D - I - - 0x019AF2 13:9AE2: 01        .byte $01
- D - I - - 0x019AF3 13:9AE3: 84        .byte $84
- D - I - - 0x019AF4 13:9AE4: 58        .byte $58
- D - I - - 0x019AF5 13:9AE5: 82        .byte $82
- D - I - - 0x019AF6 13:9AE6: 0C        .byte $0C
- D - I - - 0x019AF7 13:9AE7: E5        .byte $E5
- D - I - - 0x019AF8 13:9AE8: 00        .byte $00
- D - I - - 0x019AF9 13:9AE9: F4        .byte $F4
- D - I - - 0x019AFA 13:9AEA: 82        .byte $82
- D - I - - 0x019AFB 13:9AEB: 58        .byte $58
- D - I - - 0x019AFC 13:9AEC: F3        .byte $F3
- D - I - - 0x019AFD 13:9AED: E5        .byte $E5
- D - I - - 0x019AFE 13:9AEE: 01        .byte $01
- D - I - - 0x019AFF 13:9AEF: 84        .byte $84
- D - I - - 0x019B00 13:9AF0: 58        .byte $58
- D - I - - 0x019B01 13:9AF1: E5        .byte $E5
- D - I - - 0x019B02 13:9AF2: 02        .byte $02
- D - I - - 0x019B03 13:9AF3: 83        .byte $83
- D - I - - 0x019B04 13:9AF4: 58        .byte $58
- D - I - - 0x019B05 13:9AF5: E5        .byte $E5
- D - I - - 0x019B06 13:9AF6: 01        .byte $01
- D - I - - 0x019B07 13:9AF7: 84        .byte $84
- D - I - - 0x019B08 13:9AF8: 58        .byte $58
- D - I - - 0x019B09 13:9AF9: F4        .byte $F4
- D - I - - 0x019B0A 13:9AFA: FF        .byte $FF



off_9AFB_1D_01:
- D - I - - 0x019B0B 13:9AFB: 86        .byte $86
- D - I - - 0x019B0C 13:9AFC: 0C        .byte $0C
- D - I - - 0x019B0D 13:9AFD: E2        .byte $E2
- D - I - - 0x019B0E 13:9AFE: 80        .byte $80
- D - I - - 0x019B0F 13:9AFF: E3        .byte $E3
- D - I - - 0x019B10 13:9B00: 03        .byte $03
- D - I - - 0x019B11 13:9B01: E8        .byte $E8
- D - I - - 0x019B12 13:9B02: DB 9A     .word off_9ADB_повтор



off_9B04_1D_03:
- D - I - - 0x019B14 13:9B04: E0        .byte $E0
- D - I - - 0x019B15 13:9B05: 11        .byte $11
- D - I - - 0x019B16 13:9B06: E3        .byte $E3
- D - I - - 0x019B17 13:9B07: 05        .byte $05
- D - I - - 0x019B18 13:9B08: 81        .byte $81
- D - I - - 0x019B19 13:9B09: 00        .byte $00
- D - I - - 0x019B1A 13:9B0A: 01        .byte $01
- D - I - - 0x019B1B 13:9B0B: 82        .byte $82
- D - I - - 0x019B1C 13:9B0C: 02        .byte $02
- D - I - - 0x019B1D 13:9B0D: F3        .byte $F3
- D - I - - 0x019B1E 13:9B0E: 84        .byte $84
- D - I - - 0x019B1F 13:9B0F: 03        .byte $03
- D - I - - 0x019B20 13:9B10: 82        .byte $82
- D - I - - 0x019B21 13:9B11: 10        .byte $10
- D - I - - 0x019B22 13:9B12: F4        .byte $F4
- D - I - - 0x019B23 13:9B13: 83        .byte $83
- D - I - - 0x019B24 13:9B14: 02        .byte $02
- D - I - - 0x019B25 13:9B15: F3        .byte $F3
- D - I - - 0x019B26 13:9B16: 87        .byte $87
- D - I - - 0x019B27 13:9B17: 03        .byte $03
- D - I - - 0x019B28 13:9B18: 85        .byte $85
- D - I - - 0x019B29 13:9B19: 04        .byte $04
- D - I - - 0x019B2A 13:9B1A: 88        .byte $88
- D - I - - 0x019B2B 13:9B1B: 03        .byte $03
- D - I - - 0x019B2C 13:9B1C: F4        .byte $F4
- D - I - - 0x019B2D 13:9B1D: FF        .byte $FF



_off000_9B1E_1B_удар_головой:
- D - I - - 0x019B2E 13:9B1E: 00        .byte $00
- D - I - - 0x019B2F 13:9B1F: 27 9B     .word off_9B27_выкл
- D - I - - 0x019B31 13:9B21: 01        .byte $01
- D - I - - 0x019B32 13:9B22: 28 9B     .word off_9B28_1B_01
- D - I - - 0x019B34 13:9B24: 03        .byte $03
- D - I - - 0x019B35 13:9B25: 46 9B     .word off_9B46_1B_03
off_9B27_выкл:
- D - I - - 0x019B37 13:9B27: FF        .byte $FF



off_9B28_1B_01:
- D - I - - 0x019B38 13:9B28: E0        .byte $E0
- D - I - - 0x019B39 13:9B29: 16        .byte $16
- D - I - - 0x019B3A 13:9B2A: E2        .byte $E2
- D - I - - 0x019B3B 13:9B2B: 80        .byte $80
- D - I - - 0x019B3C 13:9B2C: E3        .byte $E3
- D - I - - 0x019B3D 13:9B2D: 00        .byte $00
- D - I - - 0x019B3E 13:9B2E: 81        .byte $81
- D - I - - 0x019B3F 13:9B2F: 10        .byte $10
- D - I - - 0x019B40 13:9B30: 00        .byte $00
- D - I - - 0x019B41 13:9B31: 11        .byte $11
- D - I - - 0x019B42 13:9B32: 01        .byte $01
- D - I - - 0x019B43 13:9B33: 12        .byte $12
- D - I - - 0x019B44 13:9B34: 02        .byte $02
- D - I - - 0x019B45 13:9B35: 82        .byte $82
- D - I - - 0x019B46 13:9B36: 08        .byte $08
- D - I - - 0x019B47 13:9B37: 09        .byte $09
- D - I - - 0x019B48 13:9B38: 08        .byte $08
- D - I - - 0x019B49 13:9B39: 07        .byte $07
- D - I - - 0x019B4A 13:9B3A: 81        .byte $81
- D - I - - 0x019B4B 13:9B3B: 06        .byte $06
- D - I - - 0x019B4C 13:9B3C: E3        .byte $E3
- D - I - - 0x019B4D 13:9B3D: 08        .byte $08
- D - I - - 0x019B4E 13:9B3E: 82        .byte $82
- D - I - - 0x019B4F 13:9B3F: 08        .byte $08
- D - I - - 0x019B50 13:9B40: 09        .byte $09
- D - I - - 0x019B51 13:9B41: 08        .byte $08
- D - I - - 0x019B52 13:9B42: 07        .byte $07
- D - I - - 0x019B53 13:9B43: 81        .byte $81
- D - I - - 0x019B54 13:9B44: 06        .byte $06
- D - I - - 0x019B55 13:9B45: FF        .byte $FF



off_9B46_1B_03:
- D - I - - 0x019B56 13:9B46: E0        .byte $E0
- D - I - - 0x019B57 13:9B47: 14        .byte $14
- D - I - - 0x019B58 13:9B48: E3        .byte $E3
- D - I - - 0x019B59 13:9B49: 00        .byte $00
- D - I - - 0x019B5A 13:9B4A: 81        .byte $81
- D - I - - 0x019B5B 13:9B4B: 0F        .byte $0F
- D - I - - 0x019B5C 13:9B4C: 00        .byte $00
- D - I - - 0x019B5D 13:9B4D: 0E        .byte $0E
- D - I - - 0x019B5E 13:9B4E: 01        .byte $01
- D - I - - 0x019B5F 13:9B4F: FF        .byte $FF



_off000_9B50_1E:
- D - I - - 0x019B60 13:9B50: 00        .byte $00
- D - I - - 0x019B61 13:9B51: 5A 9B     .word off_9B5A_1E_00
- D - I - - 0x019B63 13:9B53: 01        .byte $01
- D - I - - 0x019B64 13:9B54: 7A 9B     .word off_9B7A_1E_01
- D - I - - 0x019B66 13:9B56: 03        .byte $03
- D - I - - 0x019B67 13:9B57: 59 9B     .word off_9B59_выкл
off_9B59_выкл:
- D - I - - 0x019B69 13:9B59: FF        .byte $FF



off_9B5A_1E_00:
- D - I - - 0x019B6A 13:9B5A: E0        .byte $E0
- D - I - - 0x019B6B 13:9B5B: 14        .byte $14
- D - I - - 0x019B6C 13:9B5C: E2        .byte $E2
- D - I - - 0x019B6D 13:9B5D: 80        .byte $80
- D - I - - 0x019B6E 13:9B5E: E3        .byte $E3
- D - I - - 0x019B6F 13:9B5F: 00        .byte $00
- D - I - - 0x019B70 13:9B60: 8E        .byte $8E
- D - I - - 0x019B71 13:9B61: E4        .byte $E4
- D - I - - 0x019B72 13:9B62: 95        .byte $95
- D - I - - 0x019B73 13:9B63: 37        .byte $37
- D - I - - 0x019B74 13:9B64: E3        .byte $E3
- D - I - - 0x019B75 13:9B65: 08        .byte $08
- D - I - - 0x019B76 13:9B66: E4        .byte $E4
- D - I - - 0x019B77 13:9B67: 95        .byte $95
- D - I - - 0x019B78 13:9B68: 37        .byte $37
- D - I - - 0x019B79 13:9B69: E3        .byte $E3
- D - I - - 0x019B7A 13:9B6A: 0A        .byte $0A
- D - I - - 0x019B7B 13:9B6B: E4        .byte $E4
- D - I - - 0x019B7C 13:9B6C: 95        .byte $95
- D - I - - 0x019B7D 13:9B6D: 37        .byte $37
- D - I - - 0x019B7E 13:9B6E: E3        .byte $E3
- D - I - - 0x019B7F 13:9B6F: 0B        .byte $0B
- D - I - - 0x019B80 13:9B70: E4        .byte $E4
- D - I - - 0x019B81 13:9B71: 95        .byte $95
- D - I - - 0x019B82 13:9B72: 37        .byte $37
- D - I - - 0x019B83 13:9B73: E3        .byte $E3
- D - I - - 0x019B84 13:9B74: 0C        .byte $0C
- D - I - - 0x019B85 13:9B75: 83        .byte $83
- D - I - - 0x019B86 13:9B76: E4        .byte $E4
- D - I - - 0x019B87 13:9B77: 95        .byte $95
- D - I - - 0x019B88 13:9B78: 37        .byte $37
- D - I - - 0x019B89 13:9B79: FF        .byte $FF



off_9B7A_1E_01:
- D - I - - 0x019B8A 13:9B7A: E0        .byte $E0
- D - I - - 0x019B8B 13:9B7B: 14        .byte $14
- D - I - - 0x019B8C 13:9B7C: E2        .byte $E2
- D - I - - 0x019B8D 13:9B7D: 80        .byte $80
- D - I - - 0x019B8E 13:9B7E: 8E        .byte $8E
- D - I - - 0x019B8F 13:9B7F: 0C        .byte $0C
- D - I - - 0x019B90 13:9B80: E5        .byte $E5
- D - I - - 0x019B91 13:9B81: 02        .byte $02
- D - I - - 0x019B92 13:9B82: E3        .byte $E3
- D - I - - 0x019B93 13:9B83: 08        .byte $08
- D - I - - 0x019B94 13:9B84: E4        .byte $E4
- D - I - - 0x019B95 13:9B85: 95        .byte $95
- D - I - - 0x019B96 13:9B86: 37        .byte $37
- D - I - - 0x019B97 13:9B87: E3        .byte $E3
- D - I - - 0x019B98 13:9B88: 0A        .byte $0A
- D - I - - 0x019B99 13:9B89: E4        .byte $E4
- D - I - - 0x019B9A 13:9B8A: 95        .byte $95
- D - I - - 0x019B9B 13:9B8B: 37        .byte $37
- D - I - - 0x019B9C 13:9B8C: E3        .byte $E3
- D - I - - 0x019B9D 13:9B8D: 0B        .byte $0B
- D - I - - 0x019B9E 13:9B8E: E4        .byte $E4
- D - I - - 0x019B9F 13:9B8F: 95        .byte $95
- D - I - - 0x019BA0 13:9B90: 37        .byte $37
- D - I - - 0x019BA1 13:9B91: E3        .byte $E3
- D - I - - 0x019BA2 13:9B92: 0C        .byte $0C
- D - I - - 0x019BA3 13:9B93: E4        .byte $E4
- D - I - - 0x019BA4 13:9B94: 95        .byte $95
- D - I - - 0x019BA5 13:9B95: 37        .byte $37
- D - I - - 0x019BA6 13:9B96: 83        .byte $83
- D - I - - 0x019BA7 13:9B97: E3        .byte $E3
- D - I - - 0x019BA8 13:9B98: 0D        .byte $0D
- D - I - - 0x019BA9 13:9B99: E4        .byte $E4
- D - I - - 0x019BAA 13:9B9A: 95        .byte $95
- D - I - - 0x019BAB 13:9B9B: 37        .byte $37
- D - I - - 0x019BAC 13:9B9C: FF        .byte $FF



_off000_9B9D_1F:
- D - I - - 0x019BAD 13:9B9D: 00        .byte $00
- D - I - - 0x019BAE 13:9B9E: A6 9B     .word off_9BA6_выкл
- D - I - - 0x019BB0 13:9BA0: 01        .byte $01
- D - I - - 0x019BB1 13:9BA1: A7 9B     .word off_9BA7_1F_01
- D - I - - 0x019BB3 13:9BA3: 03        .byte $03
- D - I - - 0x019BB4 13:9BA4: A6 9B     .word off_9BA6_выкл
off_9BA6_выкл:
- D - I - - 0x019BB6 13:9BA6: FF        .byte $FF



off_9BA7_1F_01:
- D - I - - 0x019BB7 13:9BA7: E0        .byte $E0
- D - I - - 0x019BB8 13:9BA8: 17        .byte $17
- D - I - - 0x019BB9 13:9BA9: E2        .byte $E2
- D - I - - 0x019BBA 13:9BAA: 40        .byte $40
- D - I - - 0x019BBB 13:9BAB: 89        .byte $89
- D - I - - 0x019BBC 13:9BAC: E3        .byte $E3
- D - I - - 0x019BBD 13:9BAD: 00        .byte $00
- D - I - - 0x019BBE 13:9BAE: E4        .byte $E4
- D - I - - 0x019BBF 13:9BAF: 85        .byte $85
- D - I - - 0x019BC0 13:9BB0: 18        .byte $18
- D - I - - 0x019BC1 13:9BB1: E3        .byte $E3
- D - I - - 0x019BC2 13:9BB2: 01        .byte $01
- D - I - - 0x019BC3 13:9BB3: E4        .byte $E4
- D - I - - 0x019BC4 13:9BB4: 85        .byte $85
- D - I - - 0x019BC5 13:9BB5: 18        .byte $18
- D - I - - 0x019BC6 13:9BB6: E3        .byte $E3
- D - I - - 0x019BC7 13:9BB7: 02        .byte $02
- D - I - - 0x019BC8 13:9BB8: E4        .byte $E4
- D - I - - 0x019BC9 13:9BB9: 85        .byte $85
- D - I - - 0x019BCA 13:9BBA: 18        .byte $18
- D - I - - 0x019BCB 13:9BBB: E3        .byte $E3
- D - I - - 0x019BCC 13:9BBC: 03        .byte $03
- D - I - - 0x019BCD 13:9BBD: E4        .byte $E4
- D - I - - 0x019BCE 13:9BBE: 85        .byte $85
- D - I - - 0x019BCF 13:9BBF: 18        .byte $18
- D - I - - 0x019BD0 13:9BC0: E3        .byte $E3
- D - I - - 0x019BD1 13:9BC1: 04        .byte $04
- D - I - - 0x019BD2 13:9BC2: E4        .byte $E4
- D - I - - 0x019BD3 13:9BC3: 85        .byte $85
- D - I - - 0x019BD4 13:9BC4: 18        .byte $18
- D - I - - 0x019BD5 13:9BC5: E3        .byte $E3
- D - I - - 0x019BD6 13:9BC6: 05        .byte $05
- D - I - - 0x019BD7 13:9BC7: E4        .byte $E4
- D - I - - 0x019BD8 13:9BC8: 85        .byte $85
- D - I - - 0x019BD9 13:9BC9: 18        .byte $18
- D - I - - 0x019BDA 13:9BCA: E3        .byte $E3
- D - I - - 0x019BDB 13:9BCB: 06        .byte $06
- D - I - - 0x019BDC 13:9BCC: E4        .byte $E4
- D - I - - 0x019BDD 13:9BCD: 85        .byte $85
- D - I - - 0x019BDE 13:9BCE: 18        .byte $18
- D - I - - 0x019BDF 13:9BCF: E3        .byte $E3
- D - I - - 0x019BE0 13:9BD0: 07        .byte $07
- D - I - - 0x019BE1 13:9BD1: E4        .byte $E4
- D - I - - 0x019BE2 13:9BD2: 85        .byte $85
- D - I - - 0x019BE3 13:9BD3: 18        .byte $18
- D - I - - 0x019BE4 13:9BD4: E3        .byte $E3
- D - I - - 0x019BE5 13:9BD5: 08        .byte $08
- D - I - - 0x019BE6 13:9BD6: E4        .byte $E4
- D - I - - 0x019BE7 13:9BD7: 85        .byte $85
- D - I - - 0x019BE8 13:9BD8: 18        .byte $18
- D - I - - 0x019BE9 13:9BD9: E3        .byte $E3
- D - I - - 0x019BEA 13:9BDA: 09        .byte $09
- D - I - - 0x019BEB 13:9BDB: E4        .byte $E4
- D - I - - 0x019BEC 13:9BDC: 85        .byte $85
- D - I - - 0x019BED 13:9BDD: 18        .byte $18
- D - I - - 0x019BEE 13:9BDE: E3        .byte $E3
- D - I - - 0x019BEF 13:9BDF: 0A        .byte $0A
- D - I - - 0x019BF0 13:9BE0: E4        .byte $E4
- D - I - - 0x019BF1 13:9BE1: 85        .byte $85
- D - I - - 0x019BF2 13:9BE2: 18        .byte $18
- D - I - - 0x019BF3 13:9BE3: E3        .byte $E3
- D - I - - 0x019BF4 13:9BE4: 0B        .byte $0B
- D - I - - 0x019BF5 13:9BE5: E4        .byte $E4
- D - I - - 0x019BF6 13:9BE6: 85        .byte $85
- D - I - - 0x019BF7 13:9BE7: 18        .byte $18
- D - I - - 0x019BF8 13:9BE8: E3        .byte $E3
- D - I - - 0x019BF9 13:9BE9: 0C        .byte $0C
- D - I - - 0x019BFA 13:9BEA: E4        .byte $E4
- D - I - - 0x019BFB 13:9BEB: 85        .byte $85
- D - I - - 0x019BFC 13:9BEC: 18        .byte $18
- D - I - - 0x019BFD 13:9BED: E3        .byte $E3
- D - I - - 0x019BFE 13:9BEE: 0D        .byte $0D
- D - I - - 0x019BFF 13:9BEF: E4        .byte $E4
- D - I - - 0x019C00 13:9BF0: 85        .byte $85
- D - I - - 0x019C01 13:9BF1: 18        .byte $18
- D - I - - 0x019C02 13:9BF2: FF        .byte $FF



_off000_9BF3_6C_звук_часы_конец:
- D - I - - 0x019C03 13:9BF3: 00        .byte $00
- D - I - - 0x019C04 13:9BF4: FD 9B     .word off_9BFD_6C_00
- D - I - - 0x019C06 13:9BF6: 01        .byte $01
- D - I - - 0x019C07 13:9BF7: 06 9C     .word off_9C06_6C_01
- D - I - - 0x019C09 13:9BF9: 03        .byte $03
- D - I - - 0x019C0A 13:9BFA: FC 9B     .word off_9BFC_выкл
off_9BFC_выкл:
- D - I - - 0x019C0C 13:9BFC: FF        .byte $FF



off_9BFD_6C_00:
- D - I - - 0x019C0D 13:9BFD: E3        .byte $E3
- D - I - - 0x019C0E 13:9BFE: 00        .byte $00
- D - I - - 0x019C0F 13:9BFF: E2        .byte $E2
- D - I - - 0x019C10 13:9C00: 80        .byte $80
- D - I - - 0x019C11 13:9C01: E0        .byte $E0
- D - I - - 0x019C12 13:9C02: 14        .byte $14
- D - I - - 0x019C13 13:9C03: A2        .byte $A2
- D - I - - 0x019C14 13:9C04: 49        .byte $49
- D - I - - 0x019C15 13:9C05: FF        .byte $FF



off_9C06_6C_01:
- D - I - - 0x019C16 13:9C06: E3        .byte $E3
- D - I - - 0x019C17 13:9C07: 0A        .byte $0A
- D - I - - 0x019C18 13:9C08: ED        .byte $ED
- D - I - - 0x019C19 13:9C09: 01        .byte $01
- D - I - - 0x019C1A 13:9C0A: 83        .byte $83
- D - I - - 0x019C1B 13:9C0B: 0C        .byte $0C
- D - I - - 0x019C1C 13:9C0C: E2        .byte $E2
- D - I - - 0x019C1D 13:9C0D: 80        .byte $80
- D - I - - 0x019C1E 13:9C0E: E0        .byte $E0
- D - I - - 0x019C1F 13:9C0F: 14        .byte $14
- D - I - - 0x019C20 13:9C10: A2        .byte $A2
- D - I - - 0x019C21 13:9C11: 49        .byte $49
- D - I - - 0x019C22 13:9C12: FF        .byte $FF



_off000_9C13_30_гроза:
- D - I - - 0x019C23 13:9C13: 00        .byte $00
- D - I - - 0x019C24 13:9C14: 1C 9C     .word off_9C1C_выкл
- D - I - - 0x019C26 13:9C16: 01        .byte $01
- D - I - - 0x019C27 13:9C17: 1C 9C     .word off_9C1C_выкл
- D - I - - 0x019C29 13:9C19: 03        .byte $03
- D - I - - 0x019C2A 13:9C1A: 1D 9C     .word off_9C1D_30_03
off_9C1C_выкл:
- D - I - - 0x019C2C 13:9C1C: FF        .byte $FF



off_9C1D_30_03:
- D - I - - 0x019C2D 13:9C1D: E0        .byte $E0
- D - I - - 0x019C2E 13:9C1E: 2F        .byte $2F
- D - I - - 0x019C2F 13:9C1F: E3        .byte $E3
- D - I - - 0x019C30 13:9C20: 00        .byte $00
- D - I - - 0x019C31 13:9C21: 85        .byte $85
- D - I - - 0x019C32 13:9C22: 00        .byte $00
- D - I - - 0x019C33 13:9C23: 82        .byte $82
- D - I - - 0x019C34 13:9C24: 04        .byte $04
- D - I - - 0x019C35 13:9C25: 83        .byte $83
- D - I - - 0x019C36 13:9C26: 08        .byte $08
- D - I - - 0x019C37 13:9C27: 09        .byte $09
- D - I - - 0x019C38 13:9C28: 0A        .byte $0A
- D - I - - 0x019C39 13:9C29: 0B        .byte $0B
- D - I - - 0x019C3A 13:9C2A: 0C        .byte $0C
- D - I - - 0x019C3B 13:9C2B: 0A        .byte $0A
- D - I - - 0x019C3C 13:9C2C: 0B        .byte $0B
- D - I - - 0x019C3D 13:9C2D: 0C        .byte $0C
- D - I - - 0x019C3E 13:9C2E: E0        .byte $E0
- D - I - - 0x019C3F 13:9C2F: 2E        .byte $2E
- D - I - - 0x019C40 13:9C30: E3        .byte $E3
- D - I - - 0x019C41 13:9C31: 00        .byte $00
- D - I - - 0x019C42 13:9C32: A5        .byte $A5
- D - I - - 0x019C43 13:9C33: 0F        .byte $0F
- D - I - - 0x019C44 13:9C34: FF        .byte $FF



_off000_9C35_6A_звук_самолет:
- D - I - - 0x019C45 13:9C35: 04        .byte $04
- D - I - - 0x019C46 13:9C36: 42 9C     .word off_9C42_6A_04_повтор
- D - I - - 0x019C48 13:9C38: 05        .byte $05
- D - I - - 0x019C49 13:9C39: 60 9C     .word off_9C60_6A_05
- D - I - - 0x019C4B 13:9C3B: 06        .byte $06
- D - I - - 0x019C4C 13:9C3C: 41 9C     .word off_9C41_выкл
- D - I - - 0x019C4E 13:9C3E: 07        .byte $07
- D - I - - 0x019C4F 13:9C3F: 67 9C     .word off_9C67_6A_07
off_9C41_выкл:
- D - I - - 0x019C51 13:9C41: FF        .byte $FF



off_9C42_6A_04_повтор:
- D - I - - 0x019C52 13:9C42: E0        .byte $E0
- D - I - - 0x019C53 13:9C43: 17        .byte $17
- D - I - - 0x019C54 13:9C44: E2        .byte $E2
- D - I - - 0x019C55 13:9C45: 40        .byte $40
- D - I - - 0x019C56 13:9C46: E3        .byte $E3
- D - I - - 0x019C57 13:9C47: 0D        .byte $0D
- D - I - - 0x019C58 13:9C48: AD        .byte $AD
- D - I - - 0x019C59 13:9C49: E4        .byte $E4
- D - I - - 0x019C5A 13:9C4A: FF        .byte $FF
- D - I - - 0x019C5B 13:9C4B: 40        .byte $40
- D - I - - 0x019C5C 13:9C4C: 9F        .byte $9F
- D - I - - 0x019C5D 13:9C4D: E3        .byte $E3
- D - I - - 0x019C5E 13:9C4E: 0E        .byte $0E
- D - I - - 0x019C5F 13:9C4F: 53        .byte $53
- D - I - - 0x019C60 13:9C50: E3        .byte $E3
- D - I - - 0x019C61 13:9C51: 0D        .byte $0D
- D - I - - 0x019C62 13:9C52: E0        .byte $E0
- D - I - - 0x019C63 13:9C53: 30        .byte $30
- D - I - - 0x019C64 13:9C54: 89        .byte $89
- D - I - - 0x019C65 13:9C55: EB        .byte $EB
- D - I - - 0x019C66 13:9C56: 1F        .byte $1F
- D - I - - 0x019C67 13:9C57: 53        .byte $53
- D - I - - 0x019C68 13:9C58: EC        .byte $EC
- D - I - - 0x019C69 13:9C59: E3        .byte $E3
- D - I - - 0x019C6A 13:9C5A: 0E        .byte $0E
- D - I - - 0x019C6B 13:9C5B: EB        .byte $EB
- D - I - - 0x019C6C 13:9C5C: 3F        .byte $3F
- D - I - - 0x019C6D 13:9C5D: 53        .byte $53
- D - I - - 0x019C6E 13:9C5E: EC        .byte $EC
- D - I - - 0x019C6F 13:9C5F: FF        .byte $FF



off_9C60_6A_05:
- D - I - - 0x019C70 13:9C60: E5        .byte $E5
- D - I - - 0x019C71 13:9C61: 02        .byte $02
- D - I - - 0x019C72 13:9C62: 85        .byte $85
- D - I - - 0x019C73 13:9C63: 0C        .byte $0C
- D - I - - 0x019C74 13:9C64: E8        .byte $E8
- D - I - - 0x019C75 13:9C65: 42 9C     .word off_9C42_6A_04_повтор



off_9C67_6A_07:
- D - I - - 0x019C77 13:9C67: E0        .byte $E0
- D - I - - 0x019C78 13:9C68: 17        .byte $17
- D - I - - 0x019C79 13:9C69: E3        .byte $E3
- D - I - - 0x019C7A 13:9C6A: 0D        .byte $0D
- D - I - - 0x019C7B 13:9C6B: 96        .byte $96
- D - I - - 0x019C7C 13:9C6C: 0C        .byte $0C
- D - I - - 0x019C7D 13:9C6D: E3        .byte $E3
- D - I - - 0x019C7E 13:9C6E: 0C        .byte $0C
- D - I - - 0x019C7F 13:9C6F: 0C        .byte $0C
- D - I - - 0x019C80 13:9C70: E3        .byte $E3
- D - I - - 0x019C81 13:9C71: 0B        .byte $0B
- D - I - - 0x019C82 13:9C72: 0C        .byte $0C
- D - I - - 0x019C83 13:9C73: E3        .byte $E3
- D - I - - 0x019C84 13:9C74: 0A        .byte $0A
- D - I - - 0x019C85 13:9C75: 0C        .byte $0C
- D - I - - 0x019C86 13:9C76: E3        .byte $E3
- D - I - - 0x019C87 13:9C77: 09        .byte $09
- D - I - - 0x019C88 13:9C78: 0C        .byte $0C
- D - I - - 0x019C89 13:9C79: E3        .byte $E3
- D - I - - 0x019C8A 13:9C7A: 08        .byte $08
- D - I - - 0x019C8B 13:9C7B: 0C        .byte $0C
- D - I - - 0x019C8C 13:9C7C: E3        .byte $E3
- D - I - - 0x019C8D 13:9C7D: 07        .byte $07
- D - I - - 0x019C8E 13:9C7E: 0C        .byte $0C
- D - I - - 0x019C8F 13:9C7F: E3        .byte $E3
- D - I - - 0x019C90 13:9C80: 06        .byte $06
- D - I - - 0x019C91 13:9C81: 0C        .byte $0C
- D - I - - 0x019C92 13:9C82: E3        .byte $E3
- D - I - - 0x019C93 13:9C83: 05        .byte $05
- D - I - - 0x019C94 13:9C84: A6        .byte $A6
- D - I - - 0x019C95 13:9C85: 0C        .byte $0C
- D - I - - 0x019C96 13:9C86: 0C        .byte $0C
- D - I - - 0x019C97 13:9C87: 9F        .byte $9F
- D - I - - 0x019C98 13:9C88: 0C        .byte $0C
- D - I - - 0x019C99 13:9C89: E3        .byte $E3
- D - I - - 0x019C9A 13:9C8A: 06        .byte $06
- D - I - - 0x019C9B 13:9C8B: 94        .byte $94
- D - I - - 0x019C9C 13:9C8C: 0C        .byte $0C
- D - I - - 0x019C9D 13:9C8D: 9A        .byte $9A
- D - I - - 0x019C9E 13:9C8E: 0C        .byte $0C
- D - I - - 0x019C9F 13:9C8F: E3        .byte $E3
- D - I - - 0x019CA0 13:9C90: 07        .byte $07
- D - I - - 0x019CA1 13:9C91: 9D        .byte $9D
- D - I - - 0x019CA2 13:9C92: 0C        .byte $0C
- D - I - - 0x019CA3 13:9C93: 98        .byte $98
- D - I - - 0x019CA4 13:9C94: 0C        .byte $0C
- D - I - - 0x019CA5 13:9C95: E3        .byte $E3
- D - I - - 0x019CA6 13:9C96: 08        .byte $08
- D - I - - 0x019CA7 13:9C97: 0C        .byte $0C
- D - I - - 0x019CA8 13:9C98: 9D        .byte $9D
- D - I - - 0x019CA9 13:9C99: 0C        .byte $0C
- D - I - - 0x019CAA 13:9C9A: E3        .byte $E3
- D - I - - 0x019CAB 13:9C9B: 09        .byte $09
- D - I - - 0x019CAC 13:9C9C: 0C        .byte $0C
- D - I - - 0x019CAD 13:9C9D: 98        .byte $98
- D - I - - 0x019CAE 13:9C9E: 0C        .byte $0C
- D - I - - 0x019CAF 13:9C9F: E3        .byte $E3
- D - I - - 0x019CB0 13:9CA0: 0A        .byte $0A
- D - I - - 0x019CB1 13:9CA1: 94        .byte $94
- D - I - - 0x019CB2 13:9CA2: 0C        .byte $0C
- D - I - - 0x019CB3 13:9CA3: 9E        .byte $9E
- D - I - - 0x019CB4 13:9CA4: 0C        .byte $0C
- D - I - - 0x019CB5 13:9CA5: E3        .byte $E3
- D - I - - 0x019CB6 13:9CA6: 0B        .byte $0B
- D - I - - 0x019CB7 13:9CA7: 0C        .byte $0C
- D - I - - 0x019CB8 13:9CA8: 94        .byte $94
- D - I - - 0x019CB9 13:9CA9: 0C        .byte $0C
- D - I - - 0x019CBA 13:9CAA: E3        .byte $E3
- D - I - - 0x019CBB 13:9CAB: 0C        .byte $0C
- D - I - - 0x019CBC 13:9CAC: 9F        .byte $9F
- D - I - - 0x019CBD 13:9CAD: 0C        .byte $0C
- D - I - - 0x019CBE 13:9CAE: E3        .byte $E3
- D - I - - 0x019CBF 13:9CAF: 0D        .byte $0D
- D - I - - 0x019CC0 13:9CB0: 0C        .byte $0C
- D - I - - 0x019CC1 13:9CB1: E3        .byte $E3
- D - I - - 0x019CC2 13:9CB2: 0E        .byte $0E
- D - I - - 0x019CC3 13:9CB3: 0C        .byte $0C
- D - I - - 0x019CC4 13:9CB4: FF        .byte $FF



_off000_9CB5_70:
- D - I - - 0x019CC5 13:9CB5: 04        .byte $04
- D - I - - 0x019CC6 13:9CB6: C1 9C     .word off_9CC1_выкл
- D - I - - 0x019CC8 13:9CB8: 05        .byte $05
- D - I - - 0x019CC9 13:9CB9: C1 9C     .word off_9CC1_выкл
- D - I - - 0x019CCB 13:9CBB: 06        .byte $06
- D - I - - 0x019CCC 13:9CBC: C1 9C     .word off_9CC1_выкл
- D - I - - 0x019CCE 13:9CBE: 07        .byte $07
- D - I - - 0x019CCF 13:9CBF: C2 9C     .word off_9CC2_70_07
off_9CC1_выкл:
- D - I - - 0x019CD1 13:9CC1: FF        .byte $FF



off_9CC2_70_07:
- D - I - - 0x019CD2 13:9CC2: E0        .byte $E0
- D - I - - 0x019CD3 13:9CC3: 17        .byte $17
- D - I - - 0x019CD4 13:9CC4: E3        .byte $E3
- D - I - - 0x019CD5 13:9CC5: 04        .byte $04
off_9CC6_повтор:
- D - I - - 0x019CD6 13:9CC6: 90        .byte $90
- D - I - - 0x019CD7 13:9CC7: 03        .byte $03
- D - I - - 0x019CD8 13:9CC8: E8        .byte $E8
- D - I - - 0x019CD9 13:9CC9: C6 9C     .word off_9CC6_повтор



_off000_9CCB_64_звук_отскок_мяча_от_земли:
- D - I - - 0x019CDB 13:9CCB: 00        .byte $00
- D - I - - 0x019CDC 13:9CCC: D4 9C     .word off_9CD4_выкл
- D - I - - 0x019CDE 13:9CCE: 01        .byte $01
- D - I - - 0x019CDF 13:9CCF: D5 9C     .word off_9CD5_64_01
- D - I - - 0x019CE1 13:9CD1: 03        .byte $03
- D - I - - 0x019CE2 13:9CD2: D4 9C     .word off_9CD4_выкл
off_9CD4_выкл:
- D - I - - 0x019CE4 13:9CD4: FF        .byte $FF



off_9CD5_64_01:
- D - I - - 0x019CE5 13:9CD5: E0        .byte $E0
- D - I - - 0x019CE6 13:9CD6: 12        .byte $12
- D - I - - 0x019CE7 13:9CD7: E2        .byte $E2
- D - I - - 0x019CE8 13:9CD8: 80        .byte $80
- D - I - - 0x019CE9 13:9CD9: E3        .byte $E3
- D - I - - 0x019CEA 13:9CDA: 00        .byte $00
- D - I - - 0x019CEB 13:9CDB: 84        .byte $84
- D - I - - 0x019CEC 13:9CDC: E4        .byte $E4
- D - I - - 0x019CED 13:9CDD: 85        .byte $85
- D - I - - 0x019CEE 13:9CDE: 10        .byte $10
- D - I - - 0x019CEF 13:9CDF: 83        .byte $83
- D - I - - 0x019CF0 13:9CE0: E4        .byte $E4
- D - I - - 0x019CF1 13:9CE1: 8D        .byte $8D
- D - I - - 0x019CF2 13:9CE2: 11        .byte $11
- D - I - - 0x019CF3 13:9CE3: E3        .byte $E3
- D - I - - 0x019CF4 13:9CE4: 0A        .byte $0A
- D - I - - 0x019CF5 13:9CE5: 84        .byte $84
- D - I - - 0x019CF6 13:9CE6: E4        .byte $E4
- D - I - - 0x019CF7 13:9CE7: 85        .byte $85
- D - I - - 0x019CF8 13:9CE8: 10        .byte $10
- D - I - - 0x019CF9 13:9CE9: 83        .byte $83
- D - I - - 0x019CFA 13:9CEA: E4        .byte $E4
- D - I - - 0x019CFB 13:9CEB: 8D        .byte $8D
- D - I - - 0x019CFC 13:9CEC: 11        .byte $11
- D - I - - 0x019CFD 13:9CED: FF        .byte $FF



_off000_9CEE_25_прыжок:
- D - I - - 0x019CFE 13:9CEE: 00        .byte $00
- D - I - - 0x019CFF 13:9CEF: F7 9C     .word off_9CF7_выкл
- D - I - - 0x019D01 13:9CF1: 01        .byte $01
- D - I - - 0x019D02 13:9CF2: F7 9C     .word off_9CF7_выкл
- D - I - - 0x019D04 13:9CF4: 03        .byte $03
- D - I - - 0x019D05 13:9CF5: F8 9C     .word off_9CF8_25_03
off_9CF7_выкл:
- D - I - - 0x019D07 13:9CF7: FF        .byte $FF



off_9CF8_25_03:
- D - I - - 0x019D08 13:9CF8: E0        .byte $E0
- D - I - - 0x019D09 13:9CF9: 11        .byte $11
- D - I - - 0x019D0A 13:9CFA: E3        .byte $E3
- D - I - - 0x019D0B 13:9CFB: 00        .byte $00
- D - I - - 0x019D0C 13:9CFC: 83        .byte $83
- D - I - - 0x019D0D 13:9CFD: 0A        .byte $0A
- D - I - - 0x019D0E 13:9CFE: 82        .byte $82
- D - I - - 0x019D0F 13:9CFF: 0E        .byte $0E
- D - I - - 0x019D10 13:9D00: 90        .byte $90
- D - I - - 0x019D11 13:9D01: F3        .byte $F3
- D - I - - 0x019D12 13:9D02: ED        .byte $ED
- D - I - - 0x019D13 13:9D03: 02        .byte $02
- D - I - - 0x019D14 13:9D04: 05        .byte $05
- D - I - - 0x019D15 13:9D05: F4        .byte $F4
- D - I - - 0x019D16 13:9D06: EF        .byte $EF
- D - I - - 0x019D17 13:9D07: FF        .byte $FF



_off000_9D08_6D:
- D - I - - 0x019D18 13:9D08: 00        .byte $00
- D - I - - 0x019D19 13:9D09: 11 9D     .word off_9D11_выкл
- D - I - - 0x019D1B 13:9D0B: 01        .byte $01
- D - I - - 0x019D1C 13:9D0C: 12 9D     .word off_9D12_6D_01
- D - I - - 0x019D1E 13:9D0E: 03        .byte $03
- D - I - - 0x019D1F 13:9D0F: 36 9D     .word off_9D36_6D_03
off_9D11_выкл:
- D - I - - 0x019D21 13:9D11: FF        .byte $FF



off_9D12_6D_01:
- D - I - - 0x019D22 13:9D12: E0        .byte $E0
- D - I - - 0x019D23 13:9D13: 11        .byte $11
- D - I - - 0x019D24 13:9D14: E2        .byte $E2
- D - I - - 0x019D25 13:9D15: 80        .byte $80
- D - I - - 0x019D26 13:9D16: E3        .byte $E3
- D - I - - 0x019D27 13:9D17: 00        .byte $00
- D - I - - 0x019D28 13:9D18: 88        .byte $88
- D - I - - 0x019D29 13:9D19: E4        .byte $E4
- D - I - - 0x019D2A 13:9D1A: 85        .byte $85
- D - I - - 0x019D2B 13:9D1B: 15        .byte $15
- D - I - - 0x019D2C 13:9D1C: E3        .byte $E3
- D - I - - 0x019D2D 13:9D1D: 04        .byte $04
- D - I - - 0x019D2E 13:9D1E: E4        .byte $E4
- D - I - - 0x019D2F 13:9D1F: 85        .byte $85
- D - I - - 0x019D30 13:9D20: 15        .byte $15
- D - I - - 0x019D31 13:9D21: E3        .byte $E3
- D - I - - 0x019D32 13:9D22: 08        .byte $08
- D - I - - 0x019D33 13:9D23: E4        .byte $E4
- D - I - - 0x019D34 13:9D24: 85        .byte $85
- D - I - - 0x019D35 13:9D25: 15        .byte $15
- D - I - - 0x019D36 13:9D26: E3        .byte $E3
- D - I - - 0x019D37 13:9D27: 0A        .byte $0A
- D - I - - 0x019D38 13:9D28: E4        .byte $E4
- D - I - - 0x019D39 13:9D29: 85        .byte $85
- D - I - - 0x019D3A 13:9D2A: 15        .byte $15
- D - I - - 0x019D3B 13:9D2B: E3        .byte $E3
- D - I - - 0x019D3C 13:9D2C: 0C        .byte $0C
- D - I - - 0x019D3D 13:9D2D: E4        .byte $E4
- D - I - - 0x019D3E 13:9D2E: 85        .byte $85
- D - I - - 0x019D3F 13:9D2F: 15        .byte $15
- D - I - - 0x019D40 13:9D30: E3        .byte $E3
- D - I - - 0x019D41 13:9D31: 0E        .byte $0E
- D - I - - 0x019D42 13:9D32: E4        .byte $E4
- D - I - - 0x019D43 13:9D33: 85        .byte $85
- D - I - - 0x019D44 13:9D34: 15        .byte $15
- D - I - - 0x019D45 13:9D35: FF        .byte $FF



off_9D36_6D_03:
- D - I - - 0x019D46 13:9D36: E0        .byte $E0
- D - I - - 0x019D47 13:9D37: 14        .byte $14
- D - I - - 0x019D48 13:9D38: E3        .byte $E3
- D - I - - 0x019D49 13:9D39: 00        .byte $00
- D - I - - 0x019D4A 13:9D3A: 81        .byte $81
- D - I - - 0x019D4B 13:9D3B: 0F        .byte $0F
- D - I - - 0x019D4C 13:9D3C: 05        .byte $05
- D - I - - 0x019D4D 13:9D3D: 0E        .byte $0E
- D - I - - 0x019D4E 13:9D3E: 05        .byte $05
- D - I - - 0x019D4F 13:9D3F: 0D        .byte $0D
- D - I - - 0x019D50 13:9D40: 05        .byte $05
- D - I - - 0x019D51 13:9D41: 06        .byte $06
- D - I - - 0x019D52 13:9D42: 07        .byte $07
- D - I - - 0x019D53 13:9D43: 08        .byte $08
- D - I - - 0x019D54 13:9D44: 09        .byte $09
- D - I - - 0x019D55 13:9D45: 0A        .byte $0A
- D - I - - 0x019D56 13:9D46: 0B        .byte $0B
- D - I - - 0x019D57 13:9D47: 0C        .byte $0C
- D - I - - 0x019D58 13:9D48: 0B        .byte $0B
- D - I - - 0x019D59 13:9D49: 87        .byte $87
- D - I - - 0x019D5A 13:9D4A: 0A        .byte $0A
- D - I - - 0x019D5B 13:9D4B: E3        .byte $E3
- D - I - - 0x019D5C 13:9D4C: 08        .byte $08
- D - I - - 0x019D5D 13:9D4D: 0A        .byte $0A
- D - I - - 0x019D5E 13:9D4E: E3        .byte $E3
- D - I - - 0x019D5F 13:9D4F: 0A        .byte $0A
- D - I - - 0x019D60 13:9D50: 0A        .byte $0A
- D - I - - 0x019D61 13:9D51: E3        .byte $E3
- D - I - - 0x019D62 13:9D52: 0C        .byte $0C
- D - I - - 0x019D63 13:9D53: 0A        .byte $0A
- D - I - - 0x019D64 13:9D54: E3        .byte $E3
- D - I - - 0x019D65 13:9D55: 0E        .byte $0E
- D - I - - 0x019D66 13:9D56: 0A        .byte $0A
- D - I - - 0x019D67 13:9D57: FF        .byte $FF



_off000_9D58_26_разгон_перед_подкатом:
- D - I - - 0x019D68 13:9D58: 00        .byte $00
- D - I - - 0x019D69 13:9D59: 61 9D     .word off_9D61_выкл
- D - I - - 0x019D6B 13:9D5B: 01        .byte $01
- D - I - - 0x019D6C 13:9D5C: 61 9D     .word off_9D61_выкл
- D - I - - 0x019D6E 13:9D5E: 03        .byte $03
- D - I - - 0x019D6F 13:9D5F: 62 9D     .word off_9D62_26_03
off_9D61_выкл:
- D - I - - 0x019D71 13:9D61: FF        .byte $FF



off_9D62_26_03:
- D - I - - 0x019D72 13:9D62: E0        .byte $E0
- D - I - - 0x019D73 13:9D63: 12        .byte $12
- D - I - - 0x019D74 13:9D64: E3        .byte $E3
- D - I - - 0x019D75 13:9D65: 00        .byte $00
- D - I - - 0x019D76 13:9D66: 81        .byte $81
- D - I - - 0x019D77 13:9D67: 0C        .byte $0C
- D - I - - 0x019D78 13:9D68: 0D        .byte $0D
- D - I - - 0x019D79 13:9D69: EB        .byte $EB
- D - I - - 0x019D7A 13:9D6A: 08        .byte $08
- D - I - - 0x019D7B 13:9D6B: 08        .byte $08
- D - I - - 0x019D7C 13:9D6C: 0D        .byte $0D
- D - I - - 0x019D7D 13:9D6D: 0A        .byte $0A
- D - I - - 0x019D7E 13:9D6E: 00        .byte $00
- D - I - - 0x019D7F 13:9D6F: 10        .byte $10
- D - I - - 0x019D80 13:9D70: 10        .byte $10
- D - I - - 0x019D81 13:9D71: EC        .byte $EC
- D - I - - 0x019D82 13:9D72: FF        .byte $FF



_off000_9D73_27_силовой_дриблинг:
- D - I - - 0x019D83 13:9D73: 00        .byte $00
- D - I - - 0x019D84 13:9D74: 7D 9D     .word off_9D7D_27_00
- D - I - - 0x019D86 13:9D76: 01        .byte $01
- D - I - - 0x019D87 13:9D77: A8 9D     .word off_9DA8_27_01
- D - I - - 0x019D89 13:9D79: 03        .byte $03
- D - I - - 0x019D8A 13:9D7A: D3 9D     .word off_9DD3_27_03
- D - I - - 0x019D8C 13:9D7C: FF        .byte $FF



off_9D7D_27_00:
- D - I - - 0x019D8D 13:9D7D: E0        .byte $E0
- D - I - - 0x019D8E 13:9D7E: 00        .byte $00
- D - I - - 0x019D8F 13:9D7F: 82        .byte $82
- D - I - - 0x019D90 13:9D80: 0C        .byte $0C
- D - I - - 0x019D91 13:9D81: E2        .byte $E2
- D - I - - 0x019D92 13:9D82: C0        .byte $C0
- D - I - - 0x019D93 13:9D83: E3        .byte $E3
- D - I - - 0x019D94 13:9D84: 05        .byte $05
- D - I - - 0x019D95 13:9D85: EB        .byte $EB
- D - I - - 0x019D96 13:9D86: 03        .byte $03
- D - I - - 0x019D97 13:9D87: 81        .byte $81
- D - I - - 0x019D98 13:9D88: 0A        .byte $0A
- D - I - - 0x019D99 13:9D89: 00        .byte $00
- D - I - - 0x019D9A 13:9D8A: 0B        .byte $0B
- D - I - - 0x019D9B 13:9D8B: 01        .byte $01
- D - I - - 0x019D9C 13:9D8C: 82        .byte $82
- D - I - - 0x019D9D 13:9D8D: 0C        .byte $0C
- D - I - - 0x019D9E 13:9D8E: EC        .byte $EC
- D - I - - 0x019D9F 13:9D8F: E3        .byte $E3
- D - I - - 0x019DA0 13:9D90: 03        .byte $03
- D - I - - 0x019DA1 13:9D91: EB        .byte $EB
- D - I - - 0x019DA2 13:9D92: 06        .byte $06
- D - I - - 0x019DA3 13:9D93: 81        .byte $81
- D - I - - 0x019DA4 13:9D94: 0A        .byte $0A
- D - I - - 0x019DA5 13:9D95: 00        .byte $00
- D - I - - 0x019DA6 13:9D96: 0B        .byte $0B
- D - I - - 0x019DA7 13:9D97: 01        .byte $01
- D - I - - 0x019DA8 13:9D98: 82        .byte $82
- D - I - - 0x019DA9 13:9D99: 0C        .byte $0C
- D - I - - 0x019DAA 13:9D9A: EC        .byte $EC
- D - I - - 0x019DAB 13:9D9B: E3        .byte $E3
- D - I - - 0x019DAC 13:9D9C: 01        .byte $01
- D - I - - 0x019DAD 13:9D9D: EB        .byte $EB
- D - I - - 0x019DAE 13:9D9E: 0A        .byte $0A
- D - I - - 0x019DAF 13:9D9F: 81        .byte $81
- D - I - - 0x019DB0 13:9DA0: 0A        .byte $0A
- D - I - - 0x019DB1 13:9DA1: 00        .byte $00
- D - I - - 0x019DB2 13:9DA2: 0B        .byte $0B
- D - I - - 0x019DB3 13:9DA3: 01        .byte $01
- D - I - - 0x019DB4 13:9DA4: 82        .byte $82
- D - I - - 0x019DB5 13:9DA5: 0C        .byte $0C
- D - I - - 0x019DB6 13:9DA6: EC        .byte $EC
- D - I - - 0x019DB7 13:9DA7: FF        .byte $FF



off_9DA8_27_01:
- D - I - - 0x019DB8 13:9DA8: E0        .byte $E0
- D - I - - 0x019DB9 13:9DA9: 00        .byte $00
- D - I - - 0x019DBA 13:9DAA: E2        .byte $E2
- D - I - - 0x019DBB 13:9DAB: C0        .byte $C0
- D - I - - 0x019DBC 13:9DAC: 82        .byte $82
- D - I - - 0x019DBD 13:9DAD: 0C        .byte $0C
- D - I - - 0x019DBE 13:9DAE: E3        .byte $E3
- D - I - - 0x019DBF 13:9DAF: 05        .byte $05
- D - I - - 0x019DC0 13:9DB0: EB        .byte $EB
- D - I - - 0x019DC1 13:9DB1: 03        .byte $03
- D - I - - 0x019DC2 13:9DB2: 81        .byte $81
- D - I - - 0x019DC3 13:9DB3: 07        .byte $07
- D - I - - 0x019DC4 13:9DB4: 06        .byte $06
- D - I - - 0x019DC5 13:9DB5: 05        .byte $05
- D - I - - 0x019DC6 13:9DB6: 04        .byte $04
- D - I - - 0x019DC7 13:9DB7: 03        .byte $03
- D - I - - 0x019DC8 13:9DB8: 0C        .byte $0C
- D - I - - 0x019DC9 13:9DB9: EC        .byte $EC
- D - I - - 0x019DCA 13:9DBA: E3        .byte $E3
- D - I - - 0x019DCB 13:9DBB: 03        .byte $03
- D - I - - 0x019DCC 13:9DBC: EB        .byte $EB
- D - I - - 0x019DCD 13:9DBD: 06        .byte $06
- D - I - - 0x019DCE 13:9DBE: 81        .byte $81
- D - I - - 0x019DCF 13:9DBF: 07        .byte $07
- D - I - - 0x019DD0 13:9DC0: 06        .byte $06
- D - I - - 0x019DD1 13:9DC1: 05        .byte $05
- D - I - - 0x019DD2 13:9DC2: 04        .byte $04
- D - I - - 0x019DD3 13:9DC3: 03        .byte $03
- D - I - - 0x019DD4 13:9DC4: 0C        .byte $0C
- D - I - - 0x019DD5 13:9DC5: EC        .byte $EC
- D - I - - 0x019DD6 13:9DC6: E3        .byte $E3
- D - I - - 0x019DD7 13:9DC7: 01        .byte $01
- D - I - - 0x019DD8 13:9DC8: EB        .byte $EB
- D - I - - 0x019DD9 13:9DC9: 0A        .byte $0A
- D - I - - 0x019DDA 13:9DCA: 81        .byte $81
- D - I - - 0x019DDB 13:9DCB: 07        .byte $07
- D - I - - 0x019DDC 13:9DCC: 06        .byte $06
- D - I - - 0x019DDD 13:9DCD: 05        .byte $05
- D - I - - 0x019DDE 13:9DCE: 04        .byte $04
- D - I - - 0x019DDF 13:9DCF: 03        .byte $03
- D - I - - 0x019DE0 13:9DD0: 0C        .byte $0C
- D - I - - 0x019DE1 13:9DD1: EC        .byte $EC
- D - I - - 0x019DE2 13:9DD2: FF        .byte $FF



off_9DD3_27_03:
- D - I - - 0x019DE3 13:9DD3: E0        .byte $E0
- D - I - - 0x019DE4 13:9DD4: 12        .byte $12
- D - I - - 0x019DE5 13:9DD5: E3        .byte $E3
- D - I - - 0x019DE6 13:9DD6: 00        .byte $00
- D - I - - 0x019DE7 13:9DD7: 81        .byte $81
- D - I - - 0x019DE8 13:9DD8: 0C        .byte $0C
- D - I - - 0x019DE9 13:9DD9: 0D        .byte $0D
- D - I - - 0x019DEA 13:9DDA: EB        .byte $EB
- D - I - - 0x019DEB 13:9DDB: 12        .byte $12
- D - I - - 0x019DEC 13:9DDC: 08        .byte $08
- D - I - - 0x019DED 13:9DDD: 0D        .byte $0D
- D - I - - 0x019DEE 13:9DDE: 0A        .byte $0A
- D - I - - 0x019DEF 13:9DDF: 00        .byte $00
- D - I - - 0x019DF0 13:9DE0: 10        .byte $10
- D - I - - 0x019DF1 13:9DE1: 10        .byte $10
- D - I - - 0x019DF2 13:9DE2: EC        .byte $EC
- D - I - - 0x019DF3 13:9DE3: FF        .byte $FF



_off000_9DE4_15_замах_мацуямы:
- D - I - - 0x019DF4 13:9DE4: 00        .byte $00
- D - I - - 0x019DF5 13:9DE5: ED 9D     .word off_9DED_выкл
- D - I - - 0x019DF7 13:9DE7: 01        .byte $01
- D - I - - 0x019DF8 13:9DE8: ED 9D     .word off_9DED_выкл
- D - I - - 0x019DFA 13:9DEA: 03        .byte $03
- D - I - - 0x019DFB 13:9DEB: EE 9D     .word off_9DEE_15_03
off_9DED_выкл:
- D - I - - 0x019DFD 13:9DED: FF        .byte $FF



off_9DEE_15_03:
- D - I - - 0x019DFE 13:9DEE: E0        .byte $E0
- D - I - - 0x019DFF 13:9DEF: 14        .byte $14
- D - I - - 0x019E00 13:9DF0: E3        .byte $E3
- D - I - - 0x019E01 13:9DF1: 00        .byte $00
- D - I - - 0x019E02 13:9DF2: 8A        .byte $8A
- D - I - - 0x019E03 13:9DF3: 01        .byte $01
- D - I - - 0x019E04 13:9DF4: 89        .byte $89
- D - I - - 0x019E05 13:9DF5: 02        .byte $02
- D - I - - 0x019E06 13:9DF6: 88        .byte $88
- D - I - - 0x019E07 13:9DF7: 03        .byte $03
- D - I - - 0x019E08 13:9DF8: 87        .byte $87
- D - I - - 0x019E09 13:9DF9: 04        .byte $04
- D - I - - 0x019E0A 13:9DFA: 88        .byte $88
- D - I - - 0x019E0B 13:9DFB: 05        .byte $05
- D - I - - 0x019E0C 13:9DFC: FF        .byte $FF



_off000_9DFD_16_замах_цубасы:
- D - I - - 0x019E0D 13:9DFD: 00        .byte $00
- D - I - - 0x019E0E 13:9DFE: 06 9E     .word off_9E06_выкл
- D - I - - 0x019E10 13:9E00: 01        .byte $01
- D - I - - 0x019E11 13:9E01: 06 9E     .word off_9E06_выкл
- D - I - - 0x019E13 13:9E03: 03        .byte $03
- D - I - - 0x019E14 13:9E04: 07 9E     .word off_9E07_16_03
off_9E06_выкл:
- D - I - - 0x019E16 13:9E06: FF        .byte $FF



off_9E07_16_03:
- D - I - - 0x019E17 13:9E07: E0        .byte $E0
- D - I - - 0x019E18 13:9E08: 17        .byte $17
- D - I - - 0x019E19 13:9E09: E3        .byte $E3
- D - I - - 0x019E1A 13:9E0A: 00        .byte $00
- D - I - - 0x019E1B 13:9E0B: 81        .byte $81
- D - I - - 0x019E1C 13:9E0C: 01        .byte $01
- D - I - - 0x019E1D 13:9E0D: 04        .byte $04
- D - I - - 0x019E1E 13:9E0E: 01        .byte $01
- D - I - - 0x019E1F 13:9E0F: 82        .byte $82
- D - I - - 0x019E20 13:9E10: 02        .byte $02
- D - I - - 0x019E21 13:9E11: 05        .byte $05
- D - I - - 0x019E22 13:9E12: 02        .byte $02
- D - I - - 0x019E23 13:9E13: 83        .byte $83
- D - I - - 0x019E24 13:9E14: 03        .byte $03
- D - I - - 0x019E25 13:9E15: 06        .byte $06
- D - I - - 0x019E26 13:9E16: 03        .byte $03
- D - I - - 0x019E27 13:9E17: 04        .byte $04
- D - I - - 0x019E28 13:9E18: 07        .byte $07
- D - I - - 0x019E29 13:9E19: 04        .byte $04
- D - I - - 0x019E2A 13:9E1A: 05        .byte $05
- D - I - - 0x019E2B 13:9E1B: 08        .byte $08
- D - I - - 0x019E2C 13:9E1C: 05        .byte $05
- D - I - - 0x019E2D 13:9E1D: 06        .byte $06
- D - I - - 0x019E2E 13:9E1E: 09        .byte $09
- D - I - - 0x019E2F 13:9E1F: 06        .byte $06
- D - I - - 0x019E30 13:9E20: FF        .byte $FF



_off000_9E21_6F_мелодия_новый_уровень:
- D - I - - 0x019E31 13:9E21: 00        .byte $00
- D - I - - 0x019E32 13:9E22: 2B 9E     .word off_9E2B_6F_00
- D - I - - 0x019E34 13:9E24: 01        .byte $01
- D - I - - 0x019E35 13:9E25: 37 9E     .word off_9E37_6F_01
- D - I - - 0x019E37 13:9E27: 03        .byte $03
- D - I - - 0x019E38 13:9E28: 2A 9E     .word off_9E2A_выкл
off_9E2A_выкл:
- D - I - - 0x019E3A 13:9E2A: FF        .byte $FF



off_9E2B_6F_00:
- D - I - - 0x019E3B 13:9E2B: E3        .byte $E3
- D - I - - 0x019E3C 13:9E2C: 00        .byte $00
- D - I - - 0x019E3D 13:9E2D: E0        .byte $E0
- D - I - - 0x019E3E 13:9E2E: 11        .byte $11
- D - I - - 0x019E3F 13:9E2F: E2        .byte $E2
- D - I - - 0x019E40 13:9E30: 80        .byte $80
- D - I - - 0x019E41 13:9E31: E9        .byte $E9
- D - I - - 0x019E42 13:9E32: 4C 9E     .word off_9E4C_отрезок
- D - I - - 0x019E44 13:9E34: 90        .byte $90
- D - I - - 0x019E45 13:9E35: 50        .byte $50
- D - I - - 0x019E46 13:9E36: FF        .byte $FF



off_9E37_6F_01:
- D - I - - 0x019E47 13:9E37: E0        .byte $E0
- D - I - - 0x019E48 13:9E38: 12        .byte $12
- D - I - - 0x019E49 13:9E39: E2        .byte $E2
- D - I - - 0x019E4A 13:9E3A: 80        .byte $80
- D - I - - 0x019E4B 13:9E3B: E3        .byte $E3
- D - I - - 0x019E4C 13:9E3C: 05        .byte $05
- D - I - - 0x019E4D 13:9E3D: E5        .byte $E5
- D - I - - 0x019E4E 13:9E3E: 01        .byte $01
- D - I - - 0x019E4F 13:9E3F: 84        .byte $84
- D - I - - 0x019E50 13:9E40: 0C        .byte $0C
- D - I - - 0x019E51 13:9E41: E9        .byte $E9
- D - I - - 0x019E52 13:9E42: 4C 9E     .word off_9E4C_отрезок
- D - I - - 0x019E54 13:9E44: E5        .byte $E5
- D - I - - 0x019E55 13:9E45: 00        .byte $00
- D - I - - 0x019E56 13:9E46: ED        .byte $ED
- D - I - - 0x019E57 13:9E47: 01        .byte $01
- D - I - - 0x019E58 13:9E48: 90        .byte $90
- D - I - - 0x019E59 13:9E49: 50        .byte $50
- D - I - - 0x019E5A 13:9E4A: EF        .byte $EF
- D - I - - 0x019E5B 13:9E4B: FF        .byte $FF
off_9E4C_отрезок:
- D - I - - 0x019E5C 13:9E4C: 87        .byte $87
- D - I - - 0x019E5D 13:9E4D: 30        .byte $30
- D - I - - 0x019E5E 13:9E4E: 32        .byte $32
- D - I - - 0x019E5F 13:9E4F: 34        .byte $34
- D - I - - 0x019E60 13:9E50: 84        .byte $84
- D - I - - 0x019E61 13:9E51: 37        .byte $37
- D - I - - 0x019E62 13:9E52: 34        .byte $34
- D - I - - 0x019E63 13:9E53: 30        .byte $30
- D - I - - 0x019E64 13:9E54: 86        .byte $86
- D - I - - 0x019E65 13:9E55: 34        .byte $34
- D - I - - 0x019E66 13:9E56: 37        .byte $37
- D - I - - 0x019E67 13:9E57: 40        .byte $40
- D - I - - 0x019E68 13:9E58: 44        .byte $44
- D - I - - 0x019E69 13:9E59: 84        .byte $84
- D - I - - 0x019E6A 13:9E5A: 40        .byte $40
- D - I - - 0x019E6B 13:9E5B: 37        .byte $37
- D - I - - 0x019E6C 13:9E5C: EA        .byte $EA



_off000_9E5D_6E_звук_часы_тикают:
- D - I - - 0x019E6D 13:9E5D: 00        .byte $00
- D - I - - 0x019E6E 13:9E5E: 67 9E     .word off_9E67_6E_00
- D - I - - 0x019E70 13:9E60: 01        .byte $01
- D - I - - 0x019E71 13:9E61: 72 9E     .word off_9E72_6E_01
- D - I - - 0x019E73 13:9E63: 03        .byte $03
- D - I - - 0x019E74 13:9E64: 66 9E     .word off_9E66_выкл
off_9E66_выкл:
- D - I - - 0x019E76 13:9E66: FF        .byte $FF



off_9E67_6E_00:
- D - I - - 0x019E77 13:9E67: E3        .byte $E3
- D - I - - 0x019E78 13:9E68: 00        .byte $00
- D - I - - 0x019E79 13:9E69: E2        .byte $E2
- D - I - - 0x019E7A 13:9E6A: 80        .byte $80
- D - I - - 0x019E7B 13:9E6B: E0        .byte $E0
- D - I - - 0x019E7C 13:9E6C: 13        .byte $13
- D - I - - 0x019E7D 13:9E6D: E5        .byte $E5
- D - I - - 0x019E7E 13:9E6E: 81        .byte $81
- D - I - - 0x019E7F 13:9E6F: 9A        .byte $9A
- D - I - - 0x019E80 13:9E70: 39        .byte $39
- D - I - - 0x019E81 13:9E71: FF        .byte $FF



off_9E72_6E_01:
- D - I - - 0x019E82 13:9E72: E3        .byte $E3
- D - I - - 0x019E83 13:9E73: 0A        .byte $0A
- D - I - - 0x019E84 13:9E74: ED        .byte $ED
- D - I - - 0x019E85 13:9E75: 01        .byte $01
- D - I - - 0x019E86 13:9E76: 83        .byte $83
- D - I - - 0x019E87 13:9E77: 0C        .byte $0C
- D - I - - 0x019E88 13:9E78: E2        .byte $E2
- D - I - - 0x019E89 13:9E79: 80        .byte $80
- D - I - - 0x019E8A 13:9E7A: E0        .byte $E0
- D - I - - 0x019E8B 13:9E7B: 13        .byte $13
- D - I - - 0x019E8C 13:9E7C: 9A        .byte $9A
- D - I - - 0x019E8D 13:9E7D: 39        .byte $39
- D - I - - 0x019E8E 13:9E7E: FF        .byte $FF



_off000_9E7F_19_замах_удар_с_земли:
- D - I - - 0x019E8F 13:9E7F: 00        .byte $00
- D - I - - 0x019E90 13:9E80: 88 9E     .word off_9E88_выкл
- D - I - - 0x019E92 13:9E82: 01        .byte $01
- D - I - - 0x019E93 13:9E83: 88 9E     .word off_9E88_выкл
- D - I - - 0x019E95 13:9E85: 03        .byte $03
- D - I - - 0x019E96 13:9E86: 89 9E     .word off_9E89_19_03
off_9E88_выкл:
- D - I - - 0x019E98 13:9E88: FF        .byte $FF



off_9E89_19_03:
- D - I - - 0x019E99 13:9E89: E0        .byte $E0
- D - I - - 0x019E9A 13:9E8A: 11        .byte $11
- D - I - - 0x019E9B 13:9E8B: E3        .byte $E3
- D - I - - 0x019E9C 13:9E8C: 00        .byte $00
- D - I - - 0x019E9D 13:9E8D: 81        .byte $81
- D - I - - 0x019E9E 13:9E8E: 00        .byte $00
- D - I - - 0x019E9F 13:9E8F: 01        .byte $01
- D - I - - 0x019EA0 13:9E90: 02        .byte $02
- D - I - - 0x019EA1 13:9E91: 08        .byte $08
- D - I - - 0x019EA2 13:9E92: 09        .byte $09
- D - I - - 0x019EA3 13:9E93: 10        .byte $10
- D - I - - 0x019EA4 13:9E94: 10        .byte $10
- D - I - - 0x019EA5 13:9E95: 8B        .byte $8B
- D - I - - 0x019EA6 13:9E96: 09        .byte $09
- D - I - - 0x019EA7 13:9E97: FF        .byte $FF



_off000_9E98_20:
- D - I - - 0x019EA8 13:9E98: 00        .byte $00
- D - I - - 0x019EA9 13:9E99: A1 9E     .word off_9EA1_выкл
- D - I - - 0x019EAB 13:9E9B: 01        .byte $01
- D - I - - 0x019EAC 13:9E9C: A1 9E     .word off_9EA1_выкл
- D - I - - 0x019EAE 13:9E9E: 03        .byte $03
- D - I - - 0x019EAF 13:9E9F: A2 9E     .word off_9EA2_20_03
off_9EA1_выкл:
- D - I - - 0x019EB1 13:9EA1: FF        .byte $FF



off_9EA2_20_03:
- D - I - - 0x019EB2 13:9EA2: E0        .byte $E0
- D - I - - 0x019EB3 13:9EA3: 17        .byte $17
- D - I - - 0x019EB4 13:9EA4: E3        .byte $E3
- D - I - - 0x019EB5 13:9EA5: 0C        .byte $0C
- D - I - - 0x019EB6 13:9EA6: 83        .byte $83
- D - I - - 0x019EB7 13:9EA7: 00        .byte $00
- D - I - - 0x019EB8 13:9EA8: E3        .byte $E3
- D - I - - 0x019EB9 13:9EA9: 0B        .byte $0B
- D - I - - 0x019EBA 13:9EAA: 01        .byte $01
- D - I - - 0x019EBB 13:9EAB: E3        .byte $E3
- D - I - - 0x019EBC 13:9EAC: 0A        .byte $0A
- D - I - - 0x019EBD 13:9EAD: 84        .byte $84
- D - I - - 0x019EBE 13:9EAE: 02        .byte $02
- D - I - - 0x019EBF 13:9EAF: E3        .byte $E3
- D - I - - 0x019EC0 13:9EB0: 09        .byte $09
- D - I - - 0x019EC1 13:9EB1: 03        .byte $03
- D - I - - 0x019EC2 13:9EB2: E3        .byte $E3
- D - I - - 0x019EC3 13:9EB3: 08        .byte $08
- D - I - - 0x019EC4 13:9EB4: 85        .byte $85
- D - I - - 0x019EC5 13:9EB5: 04        .byte $04
- D - I - - 0x019EC6 13:9EB6: E3        .byte $E3
- D - I - - 0x019EC7 13:9EB7: 07        .byte $07
- D - I - - 0x019EC8 13:9EB8: 04        .byte $04
- D - I - - 0x019EC9 13:9EB9: E3        .byte $E3
- D - I - - 0x019ECA 13:9EBA: 06        .byte $06
- D - I - - 0x019ECB 13:9EBB: 86        .byte $86
- D - I - - 0x019ECC 13:9EBC: 05        .byte $05
- D - I - - 0x019ECD 13:9EBD: E3        .byte $E3
- D - I - - 0x019ECE 13:9EBE: 05        .byte $05
- D - I - - 0x019ECF 13:9EBF: 05        .byte $05
- D - I - - 0x019ED0 13:9EC0: E3        .byte $E3
- D - I - - 0x019ED1 13:9EC1: 04        .byte $04
- D - I - - 0x019ED2 13:9EC2: 87        .byte $87
- D - I - - 0x019ED3 13:9EC3: 05        .byte $05
- D - I - - 0x019ED4 13:9EC4: E3        .byte $E3
- D - I - - 0x019ED5 13:9EC5: 03        .byte $03
- D - I - - 0x019ED6 13:9EC6: 05        .byte $05
- D - I - - 0x019ED7 13:9EC7: E3        .byte $E3
- D - I - - 0x019ED8 13:9EC8: 02        .byte $02
- D - I - - 0x019ED9 13:9EC9: 88        .byte $88
- D - I - - 0x019EDA 13:9ECA: 05        .byte $05
- D - I - - 0x019EDB 13:9ECB: E3        .byte $E3
- D - I - - 0x019EDC 13:9ECC: 01        .byte $01
- D - I - - 0x019EDD 13:9ECD: 05        .byte $05
- D - I - - 0x019EDE 13:9ECE: E3        .byte $E3
- D - I - - 0x019EDF 13:9ECF: 00        .byte $00
- D - I - - 0x019EE0 13:9ED0: 9C        .byte $9C
- D - I - - 0x019EE1 13:9ED1: 05        .byte $05
- D - I - - 0x019EE2 13:9ED2: FF        .byte $FF



_off000_9ED3_1C:
- D - I - - 0x019EE3 13:9ED3: 00        .byte $00
- D - I - - 0x019EE4 13:9ED4: DC 9E     .word off_9EDC_выкл
- D - I - - 0x019EE6 13:9ED6: 01        .byte $01
- D - I - - 0x019EE7 13:9ED7: E9 9E     .word off_9EE9_1C_01
- D - I - - 0x019EE9 13:9ED9: 03        .byte $03
- D - I - - 0x019EEA 13:9EDA: DD 9E     .word off_9EDD_1C_03
off_9EDC_выкл:
- D - I - - 0x019EEC 13:9EDC: FF        .byte $FF



off_9EDD_1C_03:
- D - I - - 0x019EED 13:9EDD: E0        .byte $E0
- D - I - - 0x019EEE 13:9EDE: 15        .byte $15
- D - I - - 0x019EEF 13:9EDF: E3        .byte $E3
- D - I - - 0x019EF0 13:9EE0: 00        .byte $00
- D - I - - 0x019EF1 13:9EE1: 81        .byte $81
- D - I - - 0x019EF2 13:9EE2: 0E        .byte $0E
- D - I - - 0x019EF3 13:9EE3: 09        .byte $09
- D - I - - 0x019EF4 13:9EE4: 0F        .byte $0F
- D - I - - 0x019EF5 13:9EE5: 09        .byte $09
- D - I - - 0x019EF6 13:9EE6: 84        .byte $84
- D - I - - 0x019EF7 13:9EE7: 08        .byte $08
- D - I - - 0x019EF8 13:9EE8: FF        .byte $FF



off_9EE9_1C_01:
- D - I - - 0x019EF9 13:9EE9: E0        .byte $E0
- D - I - - 0x019EFA 13:9EEA: 12        .byte $12
- D - I - - 0x019EFB 13:9EEB: E2        .byte $E2
- D - I - - 0x019EFC 13:9EEC: 80        .byte $80
- D - I - - 0x019EFD 13:9EED: E3        .byte $E3
- D - I - - 0x019EFE 13:9EEE: 00        .byte $00
- D - I - - 0x019EFF 13:9EEF: 81        .byte $81
- D - I - - 0x019F00 13:9EF0: 05        .byte $05
- D - I - - 0x019F01 13:9EF1: 0A        .byte $0A
- D - I - - 0x019F02 13:9EF2: 06        .byte $06
- D - I - - 0x019F03 13:9EF3: 0B        .byte $0B
- D - I - - 0x019F04 13:9EF4: 07        .byte $07
- D - I - - 0x019F05 13:9EF5: 10        .byte $10
- D - I - - 0x019F06 13:9EF6: FF        .byte $FF



_off000_9EF7_22:
- D - I - - 0x019F07 13:9EF7: 00        .byte $00
- D - I - - 0x019F08 13:9EF8: 00 9F     .word off_9F00_выкл
- D - I - - 0x019F0A 13:9EFA: 01        .byte $01
- D - I - - 0x019F0B 13:9EFB: 00 9F     .word off_9F00_выкл
- D - I - - 0x019F0D 13:9EFD: 03        .byte $03
- D - I - - 0x019F0E 13:9EFE: 01 9F     .word off_9F01_22_03
off_9F00_выкл:
- D - I - - 0x019F10 13:9F00: FF        .byte $FF



off_9F01_22_03:
- D - I - - 0x019F11 13:9F01: E0        .byte $E0
- D - I - - 0x019F12 13:9F02: 12        .byte $12
- D - I - - 0x019F13 13:9F03: E3        .byte $E3
- D - I - - 0x019F14 13:9F04: 00        .byte $00
- D - I - - 0x019F15 13:9F05: 82        .byte $82
- D - I - - 0x019F16 13:9F06: 00        .byte $00
- D - I - - 0x019F17 13:9F07: 01        .byte $01
- D - I - - 0x019F18 13:9F08: 02        .byte $02
- D - I - - 0x019F19 13:9F09: 03        .byte $03
- D - I - - 0x019F1A 13:9F0A: 01        .byte $01
- D - I - - 0x019F1B 13:9F0B: 02        .byte $02
- D - I - - 0x019F1C 13:9F0C: 03        .byte $03
- D - I - - 0x019F1D 13:9F0D: 04        .byte $04
- D - I - - 0x019F1E 13:9F0E: 02        .byte $02
- D - I - - 0x019F1F 13:9F0F: 03        .byte $03
- D - I - - 0x019F20 13:9F10: 04        .byte $04
- D - I - - 0x019F21 13:9F11: 05        .byte $05
- D - I - - 0x019F22 13:9F12: 81        .byte $81
- D - I - - 0x019F23 13:9F13: EB        .byte $EB
- D - I - - 0x019F24 13:9F14: 03        .byte $03
- D - I - - 0x019F25 13:9F15: 03        .byte $03
- D - I - - 0x019F26 13:9F16: 04        .byte $04
- D - I - - 0x019F27 13:9F17: 05        .byte $05
- D - I - - 0x019F28 13:9F18: 06        .byte $06
- D - I - - 0x019F29 13:9F19: EC        .byte $EC
- D - I - - 0x019F2A 13:9F1A: EB        .byte $EB
- D - I - - 0x019F2B 13:9F1B: 04        .byte $04
- D - I - - 0x019F2C 13:9F1C: 04        .byte $04
- D - I - - 0x019F2D 13:9F1D: 05        .byte $05
- D - I - - 0x019F2E 13:9F1E: 06        .byte $06
- D - I - - 0x019F2F 13:9F1F: 07        .byte $07
- D - I - - 0x019F30 13:9F20: EC        .byte $EC
- D - I - - 0x019F31 13:9F21: EB        .byte $EB
- D - I - - 0x019F32 13:9F22: 03        .byte $03
- D - I - - 0x019F33 13:9F23: 05        .byte $05
- D - I - - 0x019F34 13:9F24: 06        .byte $06
- D - I - - 0x019F35 13:9F25: 07        .byte $07
- D - I - - 0x019F36 13:9F26: 08        .byte $08
- D - I - - 0x019F37 13:9F27: EC        .byte $EC
- D - I - - 0x019F38 13:9F28: 06        .byte $06
- D - I - - 0x019F39 13:9F29: 07        .byte $07
- D - I - - 0x019F3A 13:9F2A: 08        .byte $08
- D - I - - 0x019F3B 13:9F2B: 09        .byte $09
- D - I - - 0x019F3C 13:9F2C: 07        .byte $07
- D - I - - 0x019F3D 13:9F2D: 08        .byte $08
- D - I - - 0x019F3E 13:9F2E: 09        .byte $09
- D - I - - 0x019F3F 13:9F2F: 0A        .byte $0A
- D - I - - 0x019F40 13:9F30: 08        .byte $08
- D - I - - 0x019F41 13:9F31: 09        .byte $09
- D - I - - 0x019F42 13:9F32: 0A        .byte $0A
- D - I - - 0x019F43 13:9F33: 0B        .byte $0B
- D - I - - 0x019F44 13:9F34: 09        .byte $09
- D - I - - 0x019F45 13:9F35: 0A        .byte $0A
- D - I - - 0x019F46 13:9F36: 0B        .byte $0B
- D - I - - 0x019F47 13:9F37: 0C        .byte $0C
- D - I - - 0x019F48 13:9F38: 0A        .byte $0A
- D - I - - 0x019F49 13:9F39: 0B        .byte $0B
- D - I - - 0x019F4A 13:9F3A: 0C        .byte $0C
- D - I - - 0x019F4B 13:9F3B: 0D        .byte $0D
- D - I - - 0x019F4C 13:9F3C: 0B        .byte $0B
- D - I - - 0x019F4D 13:9F3D: 0C        .byte $0C
- D - I - - 0x019F4E 13:9F3E: 0D        .byte $0D
- D - I - - 0x019F4F 13:9F3F: 0E        .byte $0E
- D - I - - 0x019F50 13:9F40: 0C        .byte $0C
- D - I - - 0x019F51 13:9F41: 0D        .byte $0D
- D - I - - 0x019F52 13:9F42: 0E        .byte $0E
- D - I - - 0x019F53 13:9F43: 96        .byte $96
- D - I - - 0x019F54 13:9F44: 0F        .byte $0F
- D - I - - 0x019F55 13:9F45: FF        .byte $FF



_off000_9F46_5F_полет_спешала:
- D - I - - 0x019F56 13:9F46: 00        .byte $00
- D - I - - 0x019F57 13:9F47: 4F 9F     .word off_9F4F_выкл
- D - I - - 0x019F59 13:9F49: 01        .byte $01
- D - I - - 0x019F5A 13:9F4A: 4F 9F     .word off_9F4F_выкл
- D - I - - 0x019F5C 13:9F4C: 03        .byte $03
- D - I - - 0x019F5D 13:9F4D: 50 9F     .word off_9F50_5F_03
off_9F4F_выкл:
- D - I - - 0x019F5F 13:9F4F: FF        .byte $FF



off_9F50_5F_03:
- D - I - - 0x019F60 13:9F50: 82        .byte $82
- D - I - - 0x019F61 13:9F51: E0        .byte $E0
- D - I - - 0x019F62 13:9F52: 12        .byte $12
- D - I - - 0x019F63 13:9F53: E3        .byte $E3
- D - I - - 0x019F64 13:9F54: 00        .byte $00
- D - I - - 0x019F65 13:9F55: 0F        .byte $0F
- D - I - - 0x019F66 13:9F56: 0E        .byte $0E
- D - I - - 0x019F67 13:9F57: 0D        .byte $0D
- D - I - - 0x019F68 13:9F58: 0C        .byte $0C
- D - I - - 0x019F69 13:9F59: 0E        .byte $0E
- D - I - - 0x019F6A 13:9F5A: 0D        .byte $0D
- D - I - - 0x019F6B 13:9F5B: 0C        .byte $0C
- D - I - - 0x019F6C 13:9F5C: 0B        .byte $0B
- D - I - - 0x019F6D 13:9F5D: 0D        .byte $0D
- D - I - - 0x019F6E 13:9F5E: 0C        .byte $0C
- D - I - - 0x019F6F 13:9F5F: 0B        .byte $0B
- D - I - - 0x019F70 13:9F60: 0A        .byte $0A
- D - I - - 0x019F71 13:9F61: 81        .byte $81
- D - I - - 0x019F72 13:9F62: 0C        .byte $0C
- D - I - - 0x019F73 13:9F63: 0B        .byte $0B
- D - I - - 0x019F74 13:9F64: 0A        .byte $0A
- D - I - - 0x019F75 13:9F65: 09        .byte $09
- D - I - - 0x019F76 13:9F66: 0C        .byte $0C
- D - I - - 0x019F77 13:9F67: 0B        .byte $0B
- D - I - - 0x019F78 13:9F68: 0A        .byte $0A
- D - I - - 0x019F79 13:9F69: 09        .byte $09
- D - I - - 0x019F7A 13:9F6A: 0B        .byte $0B
- D - I - - 0x019F7B 13:9F6B: 0A        .byte $0A
- D - I - - 0x019F7C 13:9F6C: 09        .byte $09
- D - I - - 0x019F7D 13:9F6D: 08        .byte $08
- D - I - - 0x019F7E 13:9F6E: 0B        .byte $0B
- D - I - - 0x019F7F 13:9F6F: 0A        .byte $0A
- D - I - - 0x019F80 13:9F70: 09        .byte $09
- D - I - - 0x019F81 13:9F71: 08        .byte $08
- D - I - - 0x019F82 13:9F72: 0B        .byte $0B
- D - I - - 0x019F83 13:9F73: 0A        .byte $0A
- D - I - - 0x019F84 13:9F74: 09        .byte $09
- D - I - - 0x019F85 13:9F75: 08        .byte $08
- D - I - - 0x019F86 13:9F76: 0A        .byte $0A
- D - I - - 0x019F87 13:9F77: 09        .byte $09
- D - I - - 0x019F88 13:9F78: 08        .byte $08
- D - I - - 0x019F89 13:9F79: 07        .byte $07
- D - I - - 0x019F8A 13:9F7A: 0A        .byte $0A
- D - I - - 0x019F8B 13:9F7B: 09        .byte $09
- D - I - - 0x019F8C 13:9F7C: 08        .byte $08
- D - I - - 0x019F8D 13:9F7D: 07        .byte $07
- D - I - - 0x019F8E 13:9F7E: 09        .byte $09
- D - I - - 0x019F8F 13:9F7F: 08        .byte $08
- D - I - - 0x019F90 13:9F80: 07        .byte $07
- D - I - - 0x019F91 13:9F81: 06        .byte $06
- D - I - - 0x019F92 13:9F82: 08        .byte $08
- D - I - - 0x019F93 13:9F83: 07        .byte $07
- D - I - - 0x019F94 13:9F84: 06        .byte $06
- D - I - - 0x019F95 13:9F85: 05        .byte $05
- D - I - - 0x019F96 13:9F86: 07        .byte $07
- D - I - - 0x019F97 13:9F87: 06        .byte $06
- D - I - - 0x019F98 13:9F88: 05        .byte $05
- D - I - - 0x019F99 13:9F89: 04        .byte $04
- D - I - - 0x019F9A 13:9F8A: 06        .byte $06
- D - I - - 0x019F9B 13:9F8B: 05        .byte $05
- D - I - - 0x019F9C 13:9F8C: 04        .byte $04
- D - I - - 0x019F9D 13:9F8D: 03        .byte $03
- D - I - - 0x019F9E 13:9F8E: 05        .byte $05
- D - I - - 0x019F9F 13:9F8F: 04        .byte $04
- D - I - - 0x019FA0 13:9F90: 03        .byte $03
- D - I - - 0x019FA1 13:9F91: 02        .byte $02
- D - I - - 0x019FA2 13:9F92: 04        .byte $04
- D - I - - 0x019FA3 13:9F93: 03        .byte $03
- D - I - - 0x019FA4 13:9F94: 02        .byte $02
- D - I - - 0x019FA5 13:9F95: 01        .byte $01
- D - I - - 0x019FA6 13:9F96: 03        .byte $03
- D - I - - 0x019FA7 13:9F97: 02        .byte $02
- D - I - - 0x019FA8 13:9F98: 01        .byte $01
- D - I - - 0x019FA9 13:9F99: 96        .byte $96
- D - I - - 0x019FAA 13:9F9A: 00        .byte $00
- D - I - - 0x019FAB 13:9F9B: FF        .byte $FF



_off000_9F9C_69_звук_тихие_зрители:
- D - I - - 0x019FAC 13:9F9C: 00        .byte $00
- D - I - - 0x019FAD 13:9F9D: A5 9F     .word off_9FA5_выкл
- D - I - - 0x019FAF 13:9F9F: 01        .byte $01
- D - I - - 0x019FB0 13:9FA0: A5 9F     .word off_9FA5_выкл
- D - I - - 0x019FB2 13:9FA2: 03        .byte $03
- D - I - - 0x019FB3 13:9FA3: A6 9F     .word off_9FA6_69_03
off_9FA5_выкл:
- D - I - - 0x019FB5 13:9FA5: FF        .byte $FF



off_9FA6_69_03:
- D - I - - 0x019FB6 13:9FA6: E0        .byte $E0
- D - I - - 0x019FB7 13:9FA7: 21        .byte $21
- D - I - - 0x019FB8 13:9FA8: E0        .byte $E0
- D - I - - 0x019FB9 13:9FA9: 17        .byte $17
- D - I - - 0x019FBA 13:9FAA: E3        .byte $E3
- D - I - - 0x019FBB 13:9FAB: 0C        .byte $0C
- D - I - - 0x019FBC 13:9FAC: 85        .byte $85
- D - I - - 0x019FBD 13:9FAD: 0A        .byte $0A
- D - I - - 0x019FBE 13:9FAE: E3        .byte $E3
- D - I - - 0x019FBF 13:9FAF: 0B        .byte $0B
- D - I - - 0x019FC0 13:9FB0: 0A        .byte $0A
- D - I - - 0x019FC1 13:9FB1: E3        .byte $E3
- D - I - - 0x019FC2 13:9FB2: 0A        .byte $0A
- D - I - - 0x019FC3 13:9FB3: 0A        .byte $0A
- D - I - - 0x019FC4 13:9FB4: E3        .byte $E3
- D - I - - 0x019FC5 13:9FB5: 09        .byte $09
- D - I - - 0x019FC6 13:9FB6: 0A        .byte $0A
- D - I - - 0x019FC7 13:9FB7: E3        .byte $E3
- D - I - - 0x019FC8 13:9FB8: 08        .byte $08
- D - I - - 0x019FC9 13:9FB9: 0A        .byte $0A
- D - I - - 0x019FCA 13:9FBA: E3        .byte $E3
- D - I - - 0x019FCB 13:9FBB: 07        .byte $07
- D - I - - 0x019FCC 13:9FBC: 0A        .byte $0A
- D - I - - 0x019FCD 13:9FBD: E3        .byte $E3
- D - I - - 0x019FCE 13:9FBE: 06        .byte $06
- D - I - - 0x019FCF 13:9FBF: 0A        .byte $0A
- D - I - - 0x019FD0 13:9FC0: E3        .byte $E3
- D - I - - 0x019FD1 13:9FC1: 05        .byte $05
- D - I - - 0x019FD2 13:9FC2: 0A        .byte $0A
- D - I - - 0x019FD3 13:9FC3: E3        .byte $E3
- D - I - - 0x019FD4 13:9FC4: 04        .byte $04
- D - I - - 0x019FD5 13:9FC5: 8D        .byte $8D
- D - I - - 0x019FD6 13:9FC6: 0A        .byte $0A
- D - I - - 0x019FD7 13:9FC7: E8        .byte $E8
- D - I - - 0x019FD8 13:9FC8: 56 99     .word off_9956_повтор



_off000_9FCA_6B_звук_замах_джаиро:
- D - I - - 0x019FDA 13:9FCA: 00        .byte $00
- D - I - - 0x019FDB 13:9FCB: D3 9F     .word off_9FD3_выкл
- D - I - - 0x019FDD 13:9FCD: 01        .byte $01
- D - I - - 0x019FDE 13:9FCE: D3 9F     .word off_9FD3_выкл
- D - I - - 0x019FE0 13:9FD0: 03        .byte $03
- D - I - - 0x019FE1 13:9FD1: D4 9F     .word off_9FD4_6B_03
off_9FD3_выкл:
- D - I - - 0x019FE3 13:9FD3: FF        .byte $FF



off_9FD4_6B_03:
- D - I - - 0x019FE4 13:9FD4: E0        .byte $E0
- D - I - - 0x019FE5 13:9FD5: 17        .byte $17
- D - I - - 0x019FE6 13:9FD6: E3        .byte $E3
- D - I - - 0x019FE7 13:9FD7: 03        .byte $03
- D - I - - 0x019FE8 13:9FD8: 81        .byte $81
- D - I - - 0x019FE9 13:9FD9: 01        .byte $01
- D - I - - 0x019FEA 13:9FDA: 04        .byte $04
- D - I - - 0x019FEB 13:9FDB: 01        .byte $01
- D - I - - 0x019FEC 13:9FDC: 82        .byte $82
- D - I - - 0x019FED 13:9FDD: 02        .byte $02
- D - I - - 0x019FEE 13:9FDE: 05        .byte $05
- D - I - - 0x019FEF 13:9FDF: 02        .byte $02
- D - I - - 0x019FF0 13:9FE0: 83        .byte $83
- D - I - - 0x019FF1 13:9FE1: 03        .byte $03
- D - I - - 0x019FF2 13:9FE2: 06        .byte $06
- D - I - - 0x019FF3 13:9FE3: 03        .byte $03
- D - I - - 0x019FF4 13:9FE4: 04        .byte $04
- D - I - - 0x019FF5 13:9FE5: 07        .byte $07
- D - I - - 0x019FF6 13:9FE6: 04        .byte $04
- D - I - - 0x019FF7 13:9FE7: 05        .byte $05
- D - I - - 0x019FF8 13:9FE8: 08        .byte $08
- D - I - - 0x019FF9 13:9FE9: 05        .byte $05
- D - I - - 0x019FFA 13:9FEA: 06        .byte $06
- D - I - - 0x019FFB 13:9FEB: 09        .byte $09
- D - I - - 0x019FFC 13:9FEC: 06        .byte $06
- D - I - - 0x019FFD 13:9FED: 07        .byte $07
- D - I - - 0x019FFE 13:9FEE: 0A        .byte $0A
- D - I - - 0x019FFF 13:9FEF: 08        .byte $08
- D - I - - 0x01A000 13:9FF0: 0B        .byte $0B
- D - I - - 0x01A001 13:9FF1: 09        .byte $09
- D - I - - 0x01A002 13:9FF2: 0C        .byte $0C
- D - I - - 0x01A003 13:9FF3: 0A        .byte $0A
- D - I - - 0x01A004 13:9FF4: 0D        .byte $0D
- D - I - - 0x01A005 13:9FF5: 0B        .byte $0B
- D - I - - 0x01A006 13:9FF6: 0E        .byte $0E
- D - I - - 0x01A007 13:9FF7: 0C        .byte $0C
- D - I - - 0x01A008 13:9FF8: 0F        .byte $0F
off_9FF9_повтор:
- D - I - - 0x01A009 13:9FF9: 0E        .byte $0E
- D - I - - 0x01A00A 13:9FFA: 0F        .byte $0F
- D - I - - 0x01A00B 13:9FFB: E8        .byte $E8
- D - I - - 0x01A00C 13:9FFC: F9 9F     .word off_9FF9_повтор
