.segment "BANK_14"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000



.export sub_0x02801F
.export sub_0x0283E9
.export sub_0x0284EC
.export sub_0x028634
.export sub_0x0287A6



sub_0x02801F:
C D - - - - 0x02801F 14:800F: AD 3A 05  LDA ram_053A
C - - - - - 0x028022 14:8012: F0 6F     BEQ bra_8083_RTS
C - - - - - 0x028024 14:8014: 10 51     BPL bra_8067
C - - - - - 0x028026 14:8016: A2 01     LDX #$01
C - - - - - 0x028028 14:8018: 8E 3A 05  STX ram_053A
C - - - - - 0x02802B 14:801B: AD 3C 05  LDA ram_номер_анимации
C - - - - - 0x02802E 14:801E: A2 68     LDX #< tbl_8968_анимации_сценариев
C - - - - - 0x028030 14:8020: 86 4C     STX ram_anim_data
C - - - - - 0x028032 14:8022: A2 89     LDX #> tbl_8968_анимации_сценариев
C - - - - - 0x028036 14:8026: 0A        ASL
C - - - - - 0x028037 14:8027: 90 02     BCC bra_802A_not_overflow
C - - - - - 0x028039 14:8029: E6 4D     INX
bra_802A_not_overflow:
C - - - - - 0x028034 14:802A: 86 4D     STX ram_anim_data + 1
C - - - - - 0x02803B 14:802B: A8        TAY
C - - - - - 0x02803C 14:802C: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x02803E 14:802E: AA        TAX
C - - - - - 0x02803F 14:802F: C8        INY
C - - - - - 0x028040 14:8030: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028042 14:8032: 86 4C     STX ram_anim_data
C - - - - - 0x028044 14:8034: 85 4D     STA ram_anim_data + 1
C - - - - - 0x028046 14:8036: A2 00     LDX #$00
bra_8038_loop:
C - - - - - 0x028048 14:8038: A9 00     LDA #$00
C - - - - - 0x02804A 14:803A: 9D 47 05  STA ram_0547,X
C - - - - - 0x02804D 14:803D: 8A        TXA
C - - - - - 0x02804E 14:803E: 18        CLC
C - - - - - 0x02804F 14:803F: 69 15     ADC #$15
C - - - - - 0x028051 14:8041: AA        TAX
C - - - - - 0x028052 14:8042: C9 7E     CMP #$7E
C - - - - - 0x028054 14:8044: D0 F2     BNE bra_8038_loop
C - - - - - 0x028056 14:8046: A9 01     LDA #$01
C - - - - - 0x028058 14:8048: 8D 3B 05  STA ram_053B
C - - - - - 0x02805B 14:804B: A9 00     LDA #$00
C - - - - - 0x02805D 14:804D: 8D 3D 05  STA ram_053D
C - - - - - 0x028060 14:8050: 8D 40 05  STA ram_0540
C - - - - - 0x028063 14:8053: A9 FF     LDA #$FF
C - - - - - 0x028065 14:8055: 8D 41 05  STA ram_0541
C - - - - - 0x028068 14:8058: A9 01     LDA #$01
C - - - - - 0x02806A 14:805A: 8D 43 05  STA ram_0543
C - - - - - 0x02806D 14:805D: A9 23     LDA #$23
C - - - - - 0x02806F 14:805F: 8D 44 05  STA ram_0544
C - - - - - 0x028072 14:8062: A9 45     LDA #$45
C - - - - - 0x028074 14:8064: 8D 45 05  STA ram_0545
bra_8067:
C - - - - - 0x028077 14:8067: CE 3B 05  DEC ram_053B
C - - - - - 0x02807A 14:806A: F0 01     BEQ bra_806D
C - - - - - 0x02807C 14:806C: 60        RTS
bra_806D:
loc_806D_цикл:
C D - - - - 0x02807D 14:806D: A0 00     LDY #$00
C - - - - - 0x02807F 14:806F: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028081 14:8071: C9 F0     CMP #$F0
C - - - - - 0x028083 14:8073: 90 06     BCC bra_807B_EF_и_ниже
C - - - - - 0x028085 14:8075: 20 84 80  JSR sub_8084_управляющие_байты
C - - - - - 0x028088 14:8078: 4C 6D 80  JMP loc_806D_цикл
bra_807B_EF_и_ниже:
C - - - - - 0x02808B 14:807B: 8D 3B 05  STA ram_053B
C - - - - - 0x02808E 14:807E: A9 01     LDA #$01
C - - - - - 0x028090 14:8080: 20 CF 83  JSR sub_83CF_сместить_указатель
bra_8083_RTS:
C - - - - - 0x028093 14:8083: 60        RTS



sub_8084_управляющие_байты:
C - - - - - 0x028094 14:8084: 38        SEC
C - - - - - 0x028095 14:8085: E9 F0     SBC #$F0
C - - - - - 0x028097 14:8087: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x02809A 14:808A: A2 80     .word ofs_022_80A2_F0
- D - I - - 0x02809C 14:808C: AA 80     .word ofs_022_80AA_F1
- - - - - - 0x02809E 14:808E: 2B 81     .word ofs_022_812B_F2
- - - - - - 0x0280A0 14:8090: 38 81     .word ofs_022_8138_F3
- D - I - - 0x0280A2 14:8092: 42 81     .word ofs_022_8142_F4_запись_4х_банков_chr
- D - I - - 0x0280A4 14:8094: 53 81     .word ofs_022_8153_F5_запись_палитры_спрайтов
- D - I - - 0x0280A6 14:8096: AE 83     .word ofs_022_83AE_F6
- D - I - - 0x0280A8 14:8098: BD 83     .word ofs_022_83BD_F7
- D - I - - 0x0280AA 14:809A: 6F 81     .word ofs_022_816F_F8
- D - I - - 0x0280AC 14:809C: 7C 81     .word ofs_022_817C_F9
- D - I - - 0x0280AE 14:809E: 95 81     .word ofs_022_8195_FA
- D - I - - 0x0280B0 14:80A0: A9 81     .word ofs_022_81A9_FB



ofs_022_80A2_F0:
C - J - - - 0x0280B2 14:80A2: 68        PLA
C - - - - - 0x0280B3 14:80A3: 68        PLA
C - - - - - 0x0280B4 14:80A4: A9 00     LDA #$00
C - - - - - 0x0280B6 14:80A6: 8D 3A 05  STA ram_053A
C - - - - - 0x0280B9 14:80A9: 60        RTS



ofs_022_80AA_F1:
C - J - - - 0x0280BA 14:80AA: A0 05     LDY #$05
C - - - - - 0x0280BC 14:80AC: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0280BE 14:80AE: 29 1C     AND #$1C
C - - - - - 0x0280C0 14:80B0: 4A        LSR
C - - - - - 0x0280C1 14:80B1: AA        TAX
C - - - - - 0x0280C2 14:80B2: BD E4 88  LDA tbl_88E4,X
C - - - - - 0x0280C5 14:80B5: 85 3A     STA ram_003A
C - - - - - 0x0280C7 14:80B7: BD E5 88  LDA tbl_88E4 + 1,X
C - - - - - 0x0280CA 14:80BA: 85 3B     STA ram_003B
C - - - - - 0x0280CC 14:80BC: A0 00     LDY #$00
C - - - - - 0x0280CE 14:80BE: 98        TYA
bra_80BF_loop:
C - - - - - 0x0280CF 14:80BF: 91 3A     STA (ram_003A),Y
C - - - - - 0x0280D1 14:80C1: C8        INY
C - - - - - 0x0280D2 14:80C2: C0 15     CPY #$15
C - - - - - 0x0280D4 14:80C4: D0 F9     BNE bra_80BF_loop
C - - - - - 0x0280D6 14:80C6: A0 01     LDY #$01
C - - - - - 0x0280D8 14:80C8: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0280DA 14:80CA: A2 B4     LDX #< tbl_A1B4
C - - - - - 0x0280DC 14:80CC: 86 3E     STX ram_003E
C - - - - - 0x0280DE 14:80CE: A2 A1     LDX #> tbl_A1B4
C - - - - - 0x0280E0 14:80D0: 0A        ASL
C - - - - - 0x0280E1 14:80D1: 90 01     BCC bra_80D4
C - - - - - 0x0280E3 14:80D3: E8        INX
bra_80D4:
C - - - - - 0x0280E4 14:80D4: 86 3F     STX ram_003F
C - - - - - 0x0280E6 14:80D6: A8        TAY
C - - - - - 0x0280E7 14:80D7: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0280E9 14:80D9: AA        TAX
C - - - - - 0x0280EA 14:80DA: C8        INY
C - - - - - 0x0280EB 14:80DB: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0280ED 14:80DD: A0 02     LDY #$02
C - - - - - 0x0280EF 14:80DF: 91 3A     STA (ram_003A),Y
C - - - - - 0x0280F1 14:80E1: 88        DEY
C - - - - - 0x0280F2 14:80E2: 8A        TXA
C - - - - - 0x0280F3 14:80E3: 91 3A     STA (ram_003A),Y
C - - - - - 0x0280F5 14:80E5: A0 02     LDY #$02
C - - - - - 0x0280F7 14:80E7: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0280F9 14:80E9: A2 47     LDX #< tbl_AC47
C - - - - - 0x0280FB 14:80EB: 86 3E     STX ram_003E
C - - - - - 0x0280FD 14:80ED: A2 AC     LDX #> tbl_AC47
C - - - - - 0x0280FF 14:80EF: 0A        ASL
C - - - - - 0x028100 14:80F0: 90 01     BCC bra_80F3
C - - - - - 0x028102 14:80F2: E8        INX
bra_80F3:
C - - - - - 0x028103 14:80F3: 86 3F     STX ram_003F
C - - - - - 0x028105 14:80F5: A8        TAY
C - - - - - 0x028106 14:80F6: B1 3E     LDA (ram_003E),Y
C - - - - - 0x028108 14:80F8: AA        TAX
C - - - - - 0x028109 14:80F9: C8        INY
C - - - - - 0x02810A 14:80FA: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02810C 14:80FC: A0 04     LDY #$04
C - - - - - 0x02810E 14:80FE: 91 3A     STA (ram_003A),Y
C - - - - - 0x028110 14:8100: 88        DEY
C - - - - - 0x028111 14:8101: 8A        TXA
C - - - - - 0x028112 14:8102: 91 3A     STA (ram_003A),Y
C - - - - - 0x028114 14:8104: A0 03     LDY #$03
C - - - - - 0x028116 14:8106: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028118 14:8108: A0 08     LDY #$08
C - - - - - 0x02811A 14:810A: 91 3A     STA (ram_003A),Y
C - - - - - 0x02811C 14:810C: A0 04     LDY #$04
C - - - - - 0x02811E 14:810E: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028120 14:8110: A0 0C     LDY #$0C
C - - - - - 0x028122 14:8112: 91 3A     STA (ram_003A),Y
C - - - - - 0x028124 14:8114: A0 05     LDY #$05
C - - - - - 0x028126 14:8116: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028128 14:8118: AA        TAX
C - - - - - 0x028129 14:8119: 29 03     AND #$03
C - - - - - 0x02812B 14:811B: 85 3C     STA ram_003C
C - - - - - 0x02812D 14:811D: 05 3C     ORA ram_003C
C - - - - - 0x02812F 14:811F: 09 80     ORA #$80
C - - - - - 0x028131 14:8121: A0 00     LDY #$00
C - - - - - 0x028133 14:8123: 91 3A     STA (ram_003A),Y
C - - - - - 0x028135 14:8125: A9 06     LDA #$06
C - - - - - 0x028137 14:8127: 20 CF 83  JSR sub_83CF_сместить_указатель
C - - - - - 0x02813A 14:812A: 60        RTS



ofs_022_812B_F2:
- - - - - - 0x02813B 14:812B: A9 00     LDA #$00
- - - - - - 0x02813D 14:812D: 8D 3E 05  STA ram_053E
- - - - - - 0x028140 14:8130: A9 01     LDA #$01
- - - - - - 0x028142 14:8132: 8D 3D 05  STA ram_053D
- - - - - - 0x028145 14:8135: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_8138_F3:
- - - - - - 0x028148 14:8138: A9 00     LDA #$00
- - - - - - 0x02814A 14:813A: 8D 3D 05  STA ram_053D
- - - - - - 0x02814D 14:813D: A9 01     LDA #$01
- - - - - - 0x02814F 14:813F: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_8142_F4_запись_4х_банков_chr:
C - J - - - 0x028152 14:8142: A0 01     LDY #$01
bra_8144_loop:
C - - - - - 0x028154 14:8144: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028156 14:8146: 99 93 04  STA ram_chr_bank + 4 - 1,Y
C - - - - - 0x028159 14:8149: C8        INY
C - - - - - 0x02815A 14:814A: C0 05     CPY #$05
C - - - - - 0x02815C 14:814C: D0 F6     BNE bra_8144_loop
C - - - - - 0x02815E 14:814E: A9 05     LDA #$05
C - - - - - 0x028160 14:8150: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_8153_F5_запись_палитры_спрайтов:
C - J - - - 0x028163 14:8153: A0 01     LDY #$01
C - - - - - 0x028165 14:8155: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028167 14:8157: 10 06     BPL bra_815F
; пропуск записи палитры
C - - - - - 0x028169 14:8159: 20 BA 81  JSR sub_81BA
C - - - - - 0x02816C 14:815C: 4C 64 81  JMP loc_8164
bra_815F:
C - - - - - 0x02816F 14:815F: A2 10     LDX #$10    ; палитра спрайтов
C - - - - - 0x028171 14:8161: 20 30 C5  JSR sub_0x03CC12_запись_палитры_во_время_матча
loc_8164:
C D - - - - 0x028174 14:8164: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x02817A 14:816A: A9 02     LDA #$02
C - - - - - 0x02817C 14:816C: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_816F_F8:
C - J - - - 0x02817F 14:816F: A0 01     LDY #$01
C - - - - - 0x028181 14:8171: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028183 14:8173: AA        TAX
C - - - - - 0x028184 14:8174: C8        INY
C - - - - - 0x028185 14:8175: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028187 14:8177: 86 4C     STX ram_anim_data
C - - - - - 0x028189 14:8179: 85 4D     STA ram_anim_data + 1
C - - - - - 0x02818B 14:817B: 60        RTS



ofs_022_817C_F9:
C - J - - - 0x02818C 14:817C: A0 01     LDY #$01
C - - - - - 0x02818E 14:817E: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x028190 14:8180: 8D 42 05  STA ram_0542
C - - - - - 0x028193 14:8183: C8        INY
C - - - - - 0x028194 14:8184: 98        TYA
C - - - - - 0x028195 14:8185: 18        CLC
C - - - - - 0x028196 14:8186: 65 4C     ADC ram_anim_data
C - - - - - 0x028198 14:8188: 85 4E     STA ram_004E
C - - - - - 0x02819A 14:818A: A5 4D     LDA ram_anim_data + 1
C - - - - - 0x02819C 14:818C: 69 00     ADC #$00
C - - - - - 0x02819E 14:818E: 85 4F     STA ram_004F
C - - - - - 0x0281A0 14:8190: A9 02     LDA #$02
C - - - - - 0x0281A2 14:8192: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_8195_FA:
C - J - - - 0x0281A5 14:8195: A9 01     LDA #$01
C - - - - - 0x0281A7 14:8197: CE 42 05  DEC ram_0542
C - - - - - 0x0281AA 14:819A: F0 0A     BEQ bra_81A6
C - - - - - 0x0281AC 14:819C: A5 4E     LDA ram_004E
C - - - - - 0x0281AE 14:819E: 85 4C     STA ram_anim_data
C - - - - - 0x0281B0 14:81A0: A5 4F     LDA ram_004F
C - - - - - 0x0281B2 14:81A2: 85 4D     STA ram_anim_data + 1
C - - - - - 0x0281B4 14:81A4: A9 00     LDA #$00
bra_81A6:
C - - - - - 0x0281B6 14:81A6: 4C CF 83  JMP loc_83CF_сместить_указатель



ofs_022_81A9_FB:
C - J - - - 0x0281B9 14:81A9: A0 01     LDY #$01
bra_81AB_loop:
C - - - - - 0x0281BB 14:81AB: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0281BD 14:81AD: 99 42 05  STA ram_0543 - 1,Y
C - - - - - 0x0281C0 14:81B0: C8        INY
C - - - - - 0x0281C1 14:81B1: C0 04     CPY #$04
C - - - - - 0x0281C3 14:81B3: D0 F6     BNE bra_81AB_loop
C - - - - - 0x0281C5 14:81B5: A9 04     LDA #$04
C - - - - - 0x0281C7 14:81B7: 4C CF 83  JMP loc_83CF_сместить_указатель



sub_81BA:
C - - - - - 0x0281CA 14:81BA: 29 7F     AND #$7F
C - - - - - 0x0281CC 14:81BC: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x0281CF 14:81BF: CF 81     .word ofs_023_81CF_00_игрок_с_мячом
- D - I - - 0x0281D1 14:81C1: E9 81     .word ofs_023_81E9_01_игрок_без_мяча
- D - I - - 0x0281D3 14:81C3: DB 81     .word ofs_023_81DB_02_команда_с_мячом
- D - I - - 0x0281D5 14:81C5: E1 81     .word ofs_023_81E1_03_команда_без_мяча
- D - I - - 0x0281D7 14:81C7: BC 82     .word ofs_023_82BC_04
- D - I - - 0x0281D9 14:81C9: 7F 83     .word ofs_023_837F_05_06
- - - - - - 0x0281DB 14:81CB: 7F 83     .word ofs_023_837F_05_06
- D - I - - 0x0281DD 14:81CD: D5 81     .word ofs_023_81D5_07_принимающий_мяч



ofs_023_81CF_00_игрок_с_мячом:
C - J - - - 0x0281DF 14:81CF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x0281E2 14:81D2: 4C EC 81  JMP loc_81EC



ofs_023_81D5_07_принимающий_мяч:
C - J - - - 0x0281E5 14:81D5: AD FC 05  LDA ram_принимающий
C - - - - - 0x0281E8 14:81D8: 4C EC 81  JMP loc_81EC



ofs_023_81DB_02_команда_с_мячом:
C - J - - - 0x0281EB 14:81DB: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0281EE 14:81DE: 4C EC 81  JMP loc_81EC



ofs_023_81E1_03_команда_без_мяча:
C - J - - - 0x0281F1 14:81E1: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0281F4 14:81E4: 49 0B     EOR #$0B
C - - - - - 0x0281F6 14:81E6: 4C EC 81  JMP loc_81EC



ofs_023_81E9_01_игрок_без_мяча:
C - J - - - 0x0281F9 14:81E9: AD 42 04  LDA ram_игрок_без_мяча
loc_81EC:
C D - - - - 0x0281FC 14:81EC: 85 3A     STA ram_003A
C - - - - - 0x0281FE 14:81EE: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x028201 14:81F1: 20 6A 82  JSR sub_826A
C - - - - - 0x028204 14:81F4: A0 00     LDY #con_plr_id
C - - - - - 0x028206 14:81F6: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x028208 14:81F8: F0 07     BEQ bra_8201_это_клон
; if not con_p_clone
C - - - - - 0x02820A 14:81FA: 20 82 82  JSR sub_8282
C - - - - - 0x02820D 14:81FD: A2 00     LDX #$00
C - - - - - 0x02820F 14:81FF: F0 12     BEQ bra_8213    ; jmp
bra_8201_это_клон:
C - - - - - 0x028211 14:8201: AD 2B 00  LDA ram_команда_соперника
C - - - - - 0x028214 14:8204: 38        SEC
C - - - - - 0x028215 14:8205: E9 03     SBC #$03
C - - - - - 0x028217 14:8207: A2 02     LDX #$02
C - - - - - 0x028219 14:8209: A4 3A     LDY ram_003A
C - - - - - 0x02821B 14:820B: F0 04     BEQ bra_8211
C - - - - - 0x02821D 14:820D: C0 0B     CPY #$0B
C - - - - - 0x02821F 14:820F: D0 02     BNE bra_8213
bra_8211:
C - - - - - 0x028221 14:8211: A2 04     LDX #$04
bra_8213:
C - - - - - 0x028223 14:8213: 85 3A     STA ram_003A
C - - - - - 0x028225 14:8215: A0 00     LDY #$00
C - - - - - 0x028227 14:8217: 84 3B     STY ram_003B
C - - - - - 0x028229 14:8219: A8        TAY
C - - - - - 0x02822A 14:821A: 0A        ASL
C - - - - - 0x02822B 14:821B: 26 3B     ROL ram_003B
C - - - - - 0x02822D 14:821D: 0A        ASL
C - - - - - 0x02822E 14:821E: 26 3B     ROL ram_003B
C - - - - - 0x028230 14:8220: 65 3A     ADC ram_003A
C - - - - - 0x028232 14:8222: 85 3A     STA ram_003A
C - - - - - 0x028234 14:8224: A9 00     LDA #$00
C - - - - - 0x028236 14:8226: 65 3B     ADC ram_003B
C - - - - - 0x028238 14:8228: 85 3B     STA ram_003B
C - - - - - 0x02823A 14:822A: 18        CLC
C - - - - - 0x02823B 14:822B: A5 3A     LDA ram_003A
C - - - - - 0x02823D 14:822D: 7D 64 82  ADC tbl_8264,X
C - - - - - 0x028240 14:8230: 85 3A     STA ram_003A
C - - - - - 0x028242 14:8232: A5 3B     LDA ram_003B
C - - - - - 0x028244 14:8234: 7D 65 82  ADC tbl_8264 + 1,X
C - - - - - 0x028247 14:8237: 85 3B     STA ram_003B
C - - - - - 0x028249 14:8239: A0 00     LDY #$00
C - - - - - 0x02824B 14:823B: B1 3A     LDA (ram_003A),Y
C - - - - - 0x02824D 14:823D: C8        INY
C - - - - - 0x02824E 14:823E: 48        PHA
C - - - - - 0x02824F 14:823F: A2 00     LDX #$00
bra_8241_loop:
C - - - - - 0x028251 14:8241: 8A        TXA
C - - - - - 0x028252 14:8242: 29 03     AND #$03
C - - - - - 0x028254 14:8244: F0 17     BEQ bra_825D
C - - - - - 0x028256 14:8246: C9 01     CMP #$01
C - - - - - 0x028258 14:8248: F0 0E     BEQ bra_8258
C - - - - - 0x02825A 14:824A: C9 02     CMP #$02
C - - - - - 0x02825C 14:824C: F0 05     BEQ bra_8253
C - - - - - 0x02825E 14:824E: 68        PLA
C - - - - - 0x02825F 14:824F: 48        PHA
C - - - - - 0x028260 14:8250: 4C 5A 82  JMP loc_825A
bra_8253:
C - - - - - 0x028263 14:8253: B1 3A     LDA (ram_003A),Y
C - - - - - 0x028265 14:8255: C8        INY
C - - - - - 0x028266 14:8256: D0 02     BNE bra_825A
bra_8258:
C - - - - - 0x028268 14:8258: A9 0F     LDA #$0F
bra_825A:
loc_825A:
C D - - - - 0x02826A 14:825A: 9D 7F 04  STA ram_047F,X
bra_825D:
C - - - - - 0x02826D 14:825D: E8        INX
C - - - - - 0x02826E 14:825E: E0 10     CPX #$10
C - - - - - 0x028270 14:8260: D0 DF     BNE bra_8241_loop
C - - - - - 0x028272 14:8262: 68        PLA
C - - - - - 0x028273 14:8263: 60        RTS

tbl_8264:
- D - - - - 0x028274 14:8264: 0C B8     .word off_B80C
- D - - - - 0x028276 14:8266: C7 B6     .word off_B6C7
- D - - - - 0x028278 14:8268: 67 B7     .word off_B767



sub_826A:
C - - - - - 0x02827A 14:826A: A0 00     LDY #con_plr_id
C - - - - - 0x02827C 14:826C: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x02827E 14:826E: 08        PHP
C - - - - - 0x02827F 14:826F: AA        TAX
C - - - - - 0x028280 14:8270: BD F0 88  LDA tbl_88F0,X
C - - - - - 0x028283 14:8273: 28        PLP
C - - - - - 0x028284 14:8274: D0 08     BNE bra_827E
C - - - - - 0x028286 14:8276: A6 3A     LDX ram_003A
C - - - - - 0x028288 14:8278: E0 0B     CPX #$0B
C - - - - - 0x02828A 14:827A: D0 02     BNE bra_827E
C - - - - - 0x02828C 14:827C: A9 04     LDA #$04
bra_827E:
C - - - - - 0x02828E 14:827E: 8D 46 05  STA ram_0546
C - - - - - 0x028291 14:8281: 60        RTS



sub_8282:
C - - - - - 0x028292 14:8282: A2 01     LDX #$01
C - - - - - 0x028294 14:8284: 85 3B     STA ram_003B
C - - - - - 0x028296 14:8286: C9 01     CMP #$01
C - - - - - 0x028298 14:8288: F0 0C     BEQ bra_8296
C - - - - - 0x02829A 14:828A: A2 00     LDX #$00
C - - - - - 0x02829C 14:828C: C9 0F     CMP #$0F
C - - - - - 0x02829E 14:828E: 90 06     BCC bra_8296
C - - - - - 0x0282A0 14:8290: C9 17     CMP #$17
C - - - - - 0x0282A2 14:8292: B0 02     BCS bra_8296
C - - - - - 0x0282A4 14:8294: A2 02     LDX #$02
bra_8296:
C - - - - - 0x0282A6 14:8296: 8A        TXA
C - - - - - 0x0282A7 14:8297: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x0282AA 14:829A: A0 82     .word ofs_024_82A0_00
- D - I - - 0x0282AC 14:829C: A3 82     .word ofs_024_82A3_01
- D - I - - 0x0282AE 14:829E: AD 82     .word ofs_024_82AD_02



ofs_024_82A0_00:
C - J - - - 0x0282B0 14:82A0: A5 3B     LDA ram_003B
C - - - - - 0x0282B2 14:82A2: 60        RTS



ofs_024_82A3_01:
C - J - - - 0x0282B3 14:82A3: A9 01     LDA #$01
C - - - - - 0x0282B5 14:82A5: AE 2A 00  LDX ram_твоя_команда
C - - - - - 0x0282B8 14:82A8: F0 02     BEQ bra_82AC_RTS
C - - - - - 0x0282BA 14:82AA: A9 76     LDA #$76
bra_82AC_RTS:
C - - - - - 0x0282BC 14:82AC: 60        RTS



ofs_024_82AD_02:
C - J - - - 0x0282BD 14:82AD: A9 00     LDA #$00
C - - - - - 0x0282BF 14:82AF: AE 2A 00  LDX ram_твоя_команда
C - - - - - 0x0282C2 14:82B2: E0 01     CPX #$01
C - - - - - 0x0282C4 14:82B4: F0 02     BEQ bra_82B8
C - - - - - 0x0282C6 14:82B6: A9 68     LDA #$68
bra_82B8:
C - - - - - 0x0282C8 14:82B8: 18        CLC
C - - - - - 0x0282C9 14:82B9: 65 3B     ADC ram_003B
C - - - - - 0x0282CB 14:82BB: 60        RTS



ofs_023_82BC_04:
C - J - - - 0x0282CC 14:82BC: A0 02     LDY #$02
C - - - - - 0x0282CE 14:82BE: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0282D0 14:82C0: 10 03     BPL bra_82C5
C - - - - - 0x0282D2 14:82C2: 20 16 83  JSR sub_8316
bra_82C5:
C - - - - - 0x0282D5 14:82C5: A2 00     LDX #$00
C - - - - - 0x0282D7 14:82C7: 86 3B     STX ram_003B
; * 10h
C - - - - - 0x0282D9 14:82C9: 0A        ASL
C - - - - - 0x0282DA 14:82CA: 26 3B     ROL ram_003B
C - - - - - 0x0282DC 14:82CC: 0A        ASL
C - - - - - 0x0282DD 14:82CD: 26 3B     ROL ram_003B
C - - - - - 0x0282DF 14:82CF: 0A        ASL
C - - - - - 0x0282E0 14:82D0: 26 3B     ROL ram_003B
C - - - - - 0x0282E2 14:82D2: 0A        ASL
C - - - - - 0x0282E3 14:82D3: 26 3B     ROL ram_003B
C - - - - - 0x0282E5 14:82D5: 69 CF     ADC #< tbl_BACF
C - - - - - 0x0282E7 14:82D7: 85 3A     STA ram_003A
C - - - - - 0x0282E9 14:82D9: A5 3B     LDA ram_003B
C - - - - - 0x0282EB 14:82DB: 69 BA     ADC #> tbl_BACF
C - - - - - 0x0282ED 14:82DD: 85 3B     STA ram_003B
bra_82DF_loop:
C - - - - - 0x0282EF 14:82DF: BD F6 82  LDA tbl_82F6,X
C - - - - - 0x0282F2 14:82E2: 10 05     BPL bra_82E9
C - - - - - 0x0282F4 14:82E4: 29 7F     AND #$7F
C - - - - - 0x0282F6 14:82E6: A8        TAY
C - - - - - 0x0282F7 14:82E7: B1 3A     LDA (ram_003A),Y
bra_82E9:
C - - - - - 0x0282F9 14:82E9: 9D 6F 04  STA ram_046F,X
C - - - - - 0x0282FC 14:82EC: E8        INX
C - - - - - 0x0282FD 14:82ED: E0 20     CPX #$20
C - - - - - 0x0282FF 14:82EF: D0 EE     BNE bra_82DF_loop
C - - - - - 0x028301 14:82F1: A9 01     LDA #$01
C - - - - - 0x028303 14:82F3: 4C CF 83  JMP loc_83CF_сместить_указатель

tbl_82F6:
; 0x028306
    .byte $0F,       $0F,       $0F,       $30
    .byte $0F,       $21,       $09 + $80, $0A + $80
    .byte $0F,       $21,       $0B + $80, $0C + $80
    .byte $0F,       $21,       $0D + $80, $0E + $80
    .byte $0F,       $0F,       $00 + $80, $01 + $80
    .byte $0F,       $0F,       $02 + $80, $03 + $80
    .byte $0F,       $0F,       $04 + $80, $05 + $80
    .byte $0F,       $06 + $80, $07 + $80, $08 + $80



sub_8316:
C - - - - - 0x028326 14:8316: 29 7F     AND #$7F
C - - - - - 0x028328 14:8318: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x02832B 14:831B: 2B 83     .word ofs_025_832B_00
- D - I - - 0x02832D 14:831D: 35 83     .word ofs_025_8335_01
- D - I - - 0x02832F 14:831F: 42 83     .word ofs_025_8342_02
- D - I - - 0x028331 14:8321: 47 83     .word ofs_025_8347_03
- D - I - - 0x028333 14:8323: 61 83     .word ofs_025_8361_04
- D - I - - 0x028335 14:8325: 65 83     .word ofs_025_8365_05
- - - - - - 0x028337 14:8327: 6A 83     .word ofs_025_836A_06
- - - - - - 0x028339 14:8329: 7B 83     .word ofs_025_837B_07

ofs_025_832B_00:
C - J - - - 0x02833B 14:832B: A9 00     LDA #$00
C - - - - - 0x02833D 14:832D: AE 2A 00  LDX ram_твоя_команда
C - - - - - 0x028340 14:8330: F0 02     BEQ bra_8334_RTS
C - - - - - 0x028342 14:8332: A9 01     LDA #$01
bra_8334_RTS:
C - - - - - 0x028344 14:8334: 60        RTS

ofs_025_8335_01:
C - J - - - 0x028345 14:8335: A9 03     LDA #$03
                                        BNE bra_8337
ofs_025_8342_02:
                                        LDA #$05
                                        BNE bra_8337
ofs_025_8365_05:
                                        LDA #$0B
bra_8337:
C D - - - - 0x028347 14:8337: AE 2A 00  LDX ram_твоя_команда
C - - - - - 0x02834A 14:833A: E0 01     CPX #$01
C - - - - - 0x02834C 14:833C: F0 03     BEQ bra_8341_RTS
C - - - - - 0x02834E 14:833E: 18        CLC
C - - - - - 0x02834F 14:833F: 69 01     ADC #$01
bra_8341_RTS:
C - - - - - 0x028351 14:8341: 60        RTS

ofs_025_8347_03:
C - J - - - 0x028357 14:8347: 18        CLC
                                        BCC bra_8348
ofs_025_8361_04:
                                        SEC
bra_8348:
C D - - - - 0x028358 14:8348: 08        PHP
C - - - - - 0x028359 14:8349: A9 2E     LDA #$2E
C - - - - - 0x02835B 14:834B: AE 2B 00  LDX ram_команда_соперника
C - - - - - 0x02835E 14:834E: E0 12     CPX #$12
C - - - - - 0x028360 14:8350: F0 0B     BEQ bra_835D
C - - - - - 0x028362 14:8352: A9 07     LDA #$07
C - - - - - 0x028364 14:8354: AE 2A 00  LDX ram_твоя_команда
C - - - - - 0x028367 14:8357: E0 01     CPX #$01
C - - - - - 0x028369 14:8359: F0 02     BEQ bra_835D
C - - - - - 0x02836B 14:835B: A9 09     LDA #$09
bra_835D:
C - - - - - 0x02836D 14:835D: 28        PLP
C - - - - - 0x02836E 14:835E: 69 00     ADC #$00
C - - - - - 0x028370 14:8360: 60        RTS

ofs_025_836A_06:
- - - - - - 0x02837A 14:836A: 18        CLC
loc_836B:
- - - - - - 0x02837B 14:836B: 08        PHP
- - - - - - 0x02837C 14:836C: A9 15     LDA #$15
- - - - - - 0x02837E 14:836E: AE 2A 00  LDX ram_твоя_команда
- - - - - - 0x028381 14:8371: E0 02     CPX #$02
- - - - - - 0x028383 14:8373: F0 02     BEQ bra_8377
- - - - - - 0x028385 14:8375: A9 26     LDA #$26
bra_8377:
- - - - - - 0x028387 14:8377: 28        PLP
- - - - - - 0x028388 14:8378: 69 00     ADC #$00
- - - - - - 0x02838A 14:837A: 60        RTS

ofs_025_837B_07:
- - - - - - 0x02838B 14:837B: 38        SEC
- - - - - - 0x02838C 14:837C: 4C 6B 83  JMP loc_836B

ofs_023_837F_05_06:
C - J - - - 0x02838F 14:837F: A2 00     LDX #$00
C - - - - - 0x028391 14:8381: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x028394 14:8384: F0 01     BEQ bra_8387_команда_слева
; if комада справа
C - - - - - 0x028396 14:8386: E8        INX
bra_8387_команда_слева:
C - - - - - 0x028397 14:8387: BD 2A 00  LDA ram_твоя_команда,X
C - - - - - 0x02839A 14:838A: 0A        ASL
C - - - - - 0x02839B 14:838B: A8        TAY
C - - - - - 0x02839C 14:838C: A2 00     LDX #$00
bra_838E_loop:
C - - - - - 0x02839E 14:838E: BD A6 83  LDA tbl_83A6,X
C - - - - - 0x0283A1 14:8391: 9D 7F 04  STA ram_047F,X
C - - - - - 0x0283A4 14:8394: E8        INX
C - - - - - 0x0283A5 14:8395: E0 08     CPX #$08
C - - - - - 0x0283A7 14:8397: D0 F5     BNE bra_838E_loop
C - - - - - 0x0283A9 14:8399: B9 87 BA  LDA tbl_BA87,Y
C - - - - - 0x0283AC 14:839C: 8D 81 04  STA ram_0481
C - - - - - 0x0283AF 14:839F: B9 88 BA  LDA tbl_BA87 + 1,Y
C - - - - - 0x0283B2 14:83A2: 8D 82 04  STA ram_0482
C - - - - - 0x0283B5 14:83A5: 60        RTS

tbl_83A6:
- D - - - - 0x0283B6 14:83A6: 0F        .byte $0F   ; <そ>
- D - - - - 0x0283B7 14:83A7: 0F        .byte $0F   ; <そ>
- D - - - - 0x0283B8 14:83A8: 00        .byte $00
- D - - - - 0x0283B9 14:83A9: 00        .byte $00
- D - - - - 0x0283BA 14:83AA: 0F        .byte $0F   ; <そ>
- D - - - - 0x0283BB 14:83AB: 0F        .byte $0F   ; <そ>
- D - - - - 0x0283BC 14:83AC: 30        .byte $30   ; <ゃ>
- D - - - - 0x0283BD 14:83AD: 00        .byte $00

ofs_022_83AE_F6:
C - J - - - 0x0283BE 14:83AE: A0 01     LDY #$01
C - - - - - 0x0283C0 14:83B0: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0283C2 14:83B2: AA        TAX
C - - - - - 0x0283C3 14:83B3: A9 00     LDA #$00
C - - - - - 0x0283C5 14:83B5: 9D 47 05  STA ram_0547,X
C - - - - - 0x0283C8 14:83B8: A9 02     LDA #$02
C - - - - - 0x0283CA 14:83BA: 4C CF 83  JMP loc_83CF_сместить_указатель

ofs_022_83BD_F7:
C - J - - - 0x0283CD 14:83BD: A0 01     LDY #$01
C - - - - - 0x0283CF 14:83BF: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0283D1 14:83C1: 8D 40 05  STA ram_0540
C - - - - - 0x0283D4 14:83C4: C8        INY
C - - - - - 0x0283D5 14:83C5: B1 4C     LDA (ram_anim_data),Y
C - - - - - 0x0283D7 14:83C7: 8D 41 05  STA ram_0541
C - - - - - 0x0283DA 14:83CA: A9 03     LDA #$03
C - - - - - 0x0283DC 14:83CC: 4C CF 83  JMP loc_83CF_сместить_указатель

sub_83CF_сместить_указатель:
loc_83CF_сместить_указатель:
C D - - - - 0x0283DF 14:83CF: 18        CLC
C - - - - - 0x0283E0 14:83D0: 65 4C     ADC ram_anim_data
C - - - - - 0x0283E2 14:83D2: 85 4C     STA ram_anim_data
C - - - - - 0x0283E4 14:83D4: 90 02     BCC bra_83D8_RTS    ; if not overflow
; if overflow
C - - - - - 0x0283E6 14:83D6: E6 4D     INC ram_anim_data + 1
bra_83D8_RTS:
C - - - - - 0x0283E8 14:83D8: 60        RTS

sub_0x0283E9:
C D - - - - 0x0283E9 14:83D9: A0 10     LDY #$10
C - - - - - 0x0283EB 14:83DB: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0283ED 14:83DD: F0 0A     BEQ bra_83E9
C - - - - - 0x0283EF 14:83DF: C9 FF     CMP #$FF
C - - - - - 0x0283F1 14:83E1: F0 05     BEQ bra_83E8_RTS
C - - - - - 0x0283F3 14:83E3: 38        SEC
C - - - - - 0x0283F4 14:83E4: E9 01     SBC #$01
C - - - - - 0x0283F6 14:83E6: 91 3C     STA (ram_003C),Y
bra_83E8_RTS:
C - - - - - 0x0283F8 14:83E8: 60        RTS
bra_83E9:
C - - - - - 0x0283F9 14:83E9: A0 00     LDY #$00
C - - - - - 0x0283FB 14:83EB: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0283FD 14:83ED: 29 9F     AND #$9F
C - - - - - 0x0283FF 14:83EF: 91 3C     STA (ram_003C),Y
C - - - - - 0x028401 14:83F1: A0 13     LDY #$13
C - - - - - 0x028403 14:83F3: A9 00     LDA #$00
C - - - - - 0x028405 14:83F5: 91 3C     STA (ram_003C),Y
C - - - - - 0x028407 14:83F7: C8        INY
C - - - - - 0x028408 14:83F8: 91 3C     STA (ram_003C),Y
C - - - - - 0x02840A 14:83FA: A0 03     LDY #$03
C - - - - - 0x02840C 14:83FC: B1 3C     LDA (ram_003C),Y
C - - - - - 0x02840E 14:83FE: 85 3E     STA ram_003E
C - - - - - 0x028410 14:8400: C8        INY
C - - - - - 0x028411 14:8401: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028413 14:8403: 85 3F     STA ram_003F
C - - - - - 0x028415 14:8405: A0 00     LDY #$00
C - - - - - 0x028417 14:8407: 84 40     STY ram_0040
loc_8409:
C D - - - - 0x028419 14:8409: A4 40     LDY ram_0040
C - - - - - 0x02841B 14:840B: E6 40     INC ram_0040
C - - - - - 0x02841D 14:840D: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02841F 14:840F: C9 F0     CMP #$F0
C - - - - - 0x028421 14:8411: 90 06     BCC bra_8419
C - - - - - 0x028423 14:8413: 20 38 84  JSR sub_8438
C - - - - - 0x028426 14:8416: 4C 09 84  JMP loc_8409
bra_8419:
C - - - - - 0x028429 14:8419: AA        TAX
C - - - - - 0x02842A 14:841A: C8        INY
C - - - - - 0x02842B 14:841B: 98        TYA
C - - - - - 0x02842C 14:841C: 48        PHA
C - - - - - 0x02842D 14:841D: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02842F 14:841F: A0 12     LDY #$12
C - - - - - 0x028431 14:8421: 91 3C     STA (ram_003C),Y
C - - - - - 0x028433 14:8423: 8A        TXA
C - - - - - 0x028434 14:8424: A0 10     LDY #$10
C - - - - - 0x028436 14:8426: 91 3C     STA (ram_003C),Y
C - - - - - 0x028438 14:8428: 68        PLA
C - - - - - 0x028439 14:8429: A0 03     LDY #$03
C - - - - - 0x02843B 14:842B: 38        SEC
C - - - - - 0x02843C 14:842C: 65 3E     ADC ram_003E
C - - - - - 0x02843E 14:842E: 91 3C     STA (ram_003C),Y
C - - - - - 0x028440 14:8430: C8        INY
C - - - - - 0x028441 14:8431: A9 00     LDA #$00
C - - - - - 0x028443 14:8433: 65 3F     ADC ram_003F
C - - - - - 0x028445 14:8435: 91 3C     STA (ram_003C),Y
C - - - - - 0x028447 14:8437: 60        RTS

sub_8438:
C - - - - - 0x028448 14:8438: 38        SEC
C - - - - - 0x028449 14:8439: E9 F0     SBC #$F0
C - - - - - 0x02844B 14:843B: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x02844E 14:843E: 50 84     .word ofs_026_8450_F0
- D - I - - 0x028450 14:8440: 59 84     .word ofs_026_8459_F1
- D - I - - 0x028452 14:8442: 5D 84     .word ofs_026_845D_F2
- D - I - - 0x028454 14:8444: 66 84     .word ofs_026_8466_F3
- D - I - - 0x028456 14:8446: 77 84     .word ofs_026_8477_F4
- D - I - - 0x028458 14:8448: 96 84     .word ofs_026_8496_F5
- D - I - - 0x02845A 14:844A: B3 84     .word ofs_026_84B3_F6
- D - I - - 0x02845C 14:844C: C7 84     .word ofs_026_84C7_F7
- D - I - - 0x02845E 14:844E: D2 84     .word ofs_026_84D2_F8

loc_8450:
ofs_026_8450_F0:
C D - - - - 0x028460 14:8450: A0 10     LDY #$10
C - - - - - 0x028462 14:8452: A9 FF     LDA #$FF
C - - - - - 0x028464 14:8454: 91 3C     STA (ram_003C),Y
C - - - - - 0x028466 14:8456: 68        PLA
C - - - - - 0x028467 14:8457: 68        PLA
C - - - - - 0x028468 14:8458: 60        RTS

ofs_026_8459_F1:
C - J - - - 0x028469 14:8459: A9 20     LDA #$20
C - - - - - 0x02846B 14:845B: D0 02     BNE bra_845F

ofs_026_845D_F2:
C - J - - - 0x02846D 14:845D: A9 40     LDA #$40
bra_845F:
C - - - - - 0x02846F 14:845F: A0 00     LDY #$00
C - - - - - 0x028471 14:8461: 11 3C     ORA (ram_003C),Y
C - - - - - 0x028473 14:8463: 91 3C     STA (ram_003C),Y
C - - - - - 0x028475 14:8465: 60        RTS

ofs_026_8466_F3:
C - J - - - 0x028476 14:8466: A4 40     LDY ram_0040
C - - - - - 0x028478 14:8468: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02847A 14:846A: AA        TAX
C - - - - - 0x02847B 14:846B: C8        INY
C - - - - - 0x02847C 14:846C: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02847E 14:846E: 85 3F     STA ram_003F
C - - - - - 0x028480 14:8470: 86 3E     STX ram_003E
C - - - - - 0x028482 14:8472: A9 00     LDA #$00
C - - - - - 0x028484 14:8474: 85 40     STA ram_0040
C - - - - - 0x028486 14:8476: 60        RTS

ofs_026_8477_F4:
C - J - - - 0x028487 14:8477: A4 40     LDY ram_0040
C - - - - - 0x028489 14:8479: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02848B 14:847B: 48        PHA
C - - - - - 0x02848C 14:847C: C8        INY
C - - - - - 0x02848D 14:847D: 84 40     STY ram_0040
C - - - - - 0x02848F 14:847F: 98        TYA
C - - - - - 0x028490 14:8480: A6 3F     LDX ram_003F
C - - - - - 0x028492 14:8482: 18        CLC
C - - - - - 0x028493 14:8483: 65 3E     ADC ram_003E
C - - - - - 0x028495 14:8485: 90 01     BCC bra_8488
- - - - - - 0x028497 14:8487: E8        INX
bra_8488:
C - - - - - 0x028498 14:8488: A0 0E     LDY #$0E
C - - - - - 0x02849A 14:848A: 91 3C     STA (ram_003C),Y
C - - - - - 0x02849C 14:848C: 8A        TXA
C - - - - - 0x02849D 14:848D: C8        INY
C - - - - - 0x02849E 14:848E: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284A0 14:8490: A0 0D     LDY #$0D
C - - - - - 0x0284A2 14:8492: 68        PLA
C - - - - - 0x0284A3 14:8493: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284A5 14:8495: 60        RTS

ofs_026_8496_F5:
C - J - - - 0x0284A6 14:8496: A0 0D     LDY #$0D
C - - - - - 0x0284A8 14:8498: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0284AA 14:849A: 38        SEC
C - - - - - 0x0284AB 14:849B: E9 01     SBC #$01
C - - - - - 0x0284AD 14:849D: D0 01     BNE bra_84A0
C - - - - - 0x0284AF 14:849F: 60        RTS
bra_84A0:
C - - - - - 0x0284B0 14:84A0: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284B2 14:84A2: A0 0E     LDY #$0E
C - - - - - 0x0284B4 14:84A4: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0284B6 14:84A6: AA        TAX
C - - - - - 0x0284B7 14:84A7: C8        INY
C - - - - - 0x0284B8 14:84A8: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0284BA 14:84AA: 85 3F     STA ram_003F
C - - - - - 0x0284BC 14:84AC: 86 3E     STX ram_003E
C - - - - - 0x0284BE 14:84AE: A9 00     LDA #$00
C - - - - - 0x0284C0 14:84B0: 85 40     STA ram_0040
C - - - - - 0x0284C2 14:84B2: 60        RTS

ofs_026_84B3_F6:
C - J - - - 0x0284C3 14:84B3: A4 40     LDY ram_0040
C - - - - - 0x0284C5 14:84B5: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0284C7 14:84B7: AA        TAX
C - - - - - 0x0284C8 14:84B8: C8        INY
C - - - - - 0x0284C9 14:84B9: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0284CB 14:84BB: C8        INY
C - - - - - 0x0284CC 14:84BC: 84 40     STY ram_0040
C - - - - - 0x0284CE 14:84BE: A0 14     LDY #$14
C - - - - - 0x0284D0 14:84C0: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284D2 14:84C2: 88        DEY
C - - - - - 0x0284D3 14:84C3: 8A        TXA
C - - - - - 0x0284D4 14:84C4: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284D6 14:84C6: 60        RTS

ofs_026_84C7_F7:
C - J - - - 0x0284D7 14:84C7: A4 40     LDY ram_0040
C - - - - - 0x0284D9 14:84C9: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0284DB 14:84CB: A0 12     LDY #$12
C - - - - - 0x0284DD 14:84CD: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284DF 14:84CF: 4C 50 84  JMP loc_8450

ofs_026_84D2_F8:
C - J - - - 0x0284E2 14:84D2: A4 40     LDY ram_0040
C - - - - - 0x0284E4 14:84D4: E6 40     INC ram_0040
C - - - - - 0x0284E6 14:84D6: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0284E8 14:84D8: 8D 46 05  STA ram_0546
C - - - - - 0x0284EB 14:84DB: 60        RTS

sub_0x0284EC:
C D - - - - 0x0284EC 14:84DC: A0 11     LDY #$11
C - - - - - 0x0284EE 14:84DE: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0284F0 14:84E0: F0 0D     BEQ bra_84EF
C - - - - - 0x0284F2 14:84E2: C9 FF     CMP #$FF
C - - - - - 0x0284F4 14:84E4: D0 01     BNE bra_84E7
C - - - - - 0x0284F6 14:84E6: 60        RTS
bra_84E7:
C - - - - - 0x0284F7 14:84E7: 38        SEC
C - - - - - 0x0284F8 14:84E8: E9 01     SBC #$01
C - - - - - 0x0284FA 14:84EA: 91 3C     STA (ram_003C),Y
C - - - - - 0x0284FC 14:84EC: 4C 2A 85  JMP loc_852A
bra_84EF:
C - - - - - 0x0284FF 14:84EF: 85 40     STA ram_0040
C - - - - - 0x028501 14:84F1: A0 01     LDY #$01
C - - - - - 0x028503 14:84F3: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028505 14:84F5: 85 3E     STA ram_003E
C - - - - - 0x028507 14:84F7: C8        INY
C - - - - - 0x028508 14:84F8: B1 3C     LDA (ram_003C),Y
C - - - - - 0x02850A 14:84FA: 85 3F     STA ram_003F
C - - - - - 0x02850C 14:84FC: A0 00     LDY #$00
C - - - - - 0x02850E 14:84FE: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028510 14:8500: 29 10     AND #$10
C - - - - - 0x028512 14:8502: F0 0B     BEQ bra_850F
C - - - - - 0x028514 14:8504: A9 04     LDA #$04
C - - - - - 0x028516 14:8506: 18        CLC
C - - - - - 0x028517 14:8507: 65 3E     ADC ram_003E
C - - - - - 0x028519 14:8509: 85 3E     STA ram_003E
C - - - - - 0x02851B 14:850B: 90 02     BCC bra_850F    ; if not overflow
; if overflow
C - - - - - 0x02851D 14:850D: E6 3F     INC ram_003F
bra_850F:
C - - - - - 0x02851F 14:850F: A0 00     LDY #$00
C - - - - - 0x028521 14:8511: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028523 14:8513: 29 EF     AND #$EF
C - - - - - 0x028525 14:8515: 91 3C     STA (ram_003C),Y
C - - - - - 0x028527 14:8517: 20 7A 85  JSR sub_857A
C - - - - - 0x02852A 14:851A: A5 40     LDA ram_0040
C - - - - - 0x02852C 14:851C: A0 01     LDY #$01
C - - - - - 0x02852E 14:851E: 18        CLC
C - - - - - 0x02852F 14:851F: 65 3E     ADC ram_003E
C - - - - - 0x028531 14:8521: 91 3C     STA (ram_003C),Y
C - - - - - 0x028533 14:8523: C8        INY
C - - - - - 0x028534 14:8524: A5 3F     LDA ram_003F
C - - - - - 0x028536 14:8526: 69 00     ADC #$00
C - - - - - 0x028538 14:8528: 91 3C     STA (ram_003C),Y
loc_852A:
C D - - - - 0x02853A 14:852A: A9 00     LDA #$00
C - - - - - 0x02853C 14:852C: 85 42     STA ram_0042
C - - - - - 0x02853E 14:852E: 85 43     STA ram_0043
C - - - - - 0x028540 14:8530: A0 00     LDY #$00
C - - - - - 0x028542 14:8532: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028544 14:8534: 29 FC     AND #$FC
C - - - - - 0x028546 14:8536: 85 41     STA ram_0041
C - - - - - 0x028548 14:8538: B1 3C     LDA (ram_003C),Y
C - - - - - 0x02854A 14:853A: 4A        LSR
C - - - - - 0x02854B 14:853B: 26 42     ROL ram_0042
C - - - - - 0x02854D 14:853D: 4A        LSR
C - - - - - 0x02854E 14:853E: 26 43     ROL ram_0043
C - - - - - 0x028550 14:8540: A2 00     LDX #$00
C - - - - - 0x028552 14:8542: A0 05     LDY #$05
C - - - - - 0x028554 14:8544: 20 F2 85  JSR sub_85F2
C - - - - - 0x028557 14:8547: A2 01     LDX #$01
C - - - - - 0x028559 14:8549: A0 09     LDY #$09
C - - - - - 0x02855B 14:854B: 20 F2 85  JSR sub_85F2
C - - - - - 0x02855E 14:854E: A9 00     LDA #$00
C - - - - - 0x028560 14:8550: 46 43     LSR ram_0043
C - - - - - 0x028562 14:8552: 2A        ROL
C - - - - - 0x028563 14:8553: 46 42     LSR ram_0042
C - - - - - 0x028565 14:8555: 2A        ROL
C - - - - - 0x028566 14:8556: 05 41     ORA ram_0041
C - - - - - 0x028568 14:8558: A0 00     LDY #$00
C - - - - - 0x02856A 14:855A: 91 3C     STA (ram_003C),Y
C - - - - - 0x02856C 14:855C: 29 10     AND #$10
C - - - - - 0x02856E 14:855E: F0 19     BEQ bra_8579_RTS
C - - - - - 0x028570 14:8560: A0 01     LDY #$01
C - - - - - 0x028572 14:8562: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028574 14:8564: 85 3E     STA ram_003E
C - - - - - 0x028576 14:8566: C8        INY
C - - - - - 0x028577 14:8567: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028579 14:8569: 85 3F     STA ram_003F
C - - - - - 0x02857B 14:856B: A2 05     LDX #$05
C - - - - - 0x02857D 14:856D: A0 01     LDY #$01
C - - - - - 0x02857F 14:856F: 20 0D 86  JSR sub_860D
C - - - - - 0x028582 14:8572: A2 09     LDX #$09
C - - - - - 0x028584 14:8574: A0 03     LDY #$03
C - - - - - 0x028586 14:8576: 20 0D 86  JSR sub_860D
bra_8579_RTS:
C - - - - - 0x028589 14:8579: 60        RTS

sub_857A:
loc_857A:
C D - - - - 0x02858A 14:857A: A4 40     LDY ram_0040
C - - - - - 0x02858C 14:857C: E6 40     INC ram_0040
C - - - - - 0x02858E 14:857E: B1 3E     LDA (ram_003E),Y
C - - - - - 0x028590 14:8580: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x028593 14:8583: A0 85     .word ofs_027_85A0_00
- D - I - - 0x028595 14:8585: A9 85     .word ofs_027_85A9_01
- D - I - - 0x028597 14:8587: D5 85     .word ofs_027_85D5_02
- D - I - - 0x028599 14:8589: E1 85     .word ofs_027_85E1_03
- D - I - - 0x02859B 14:858B: 8D 85     .word ofs_027_858D_04

ofs_027_858D_04:
C - J - - - 0x02859D 14:858D: A4 40     LDY ram_0040
C - - - - - 0x02859F 14:858F: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285A1 14:8591: AA        TAX
C - - - - - 0x0285A2 14:8592: C8        INY
C - - - - - 0x0285A3 14:8593: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285A5 14:8595: 85 3F     STA ram_003F
C - - - - - 0x0285A7 14:8597: 86 3E     STX ram_003E
C - - - - - 0x0285A9 14:8599: A9 00     LDA #$00
C - - - - - 0x0285AB 14:859B: 85 40     STA ram_0040
C - - - - - 0x0285AD 14:859D: 4C 7A 85  JMP loc_857A

ofs_027_85A0_00:
C - J - - - 0x0285B0 14:85A0: A0 11     LDY #$11
C - - - - - 0x0285B2 14:85A2: A9 FF     LDA #$FF
C - - - - - 0x0285B4 14:85A4: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285B6 14:85A6: 68        PLA
C - - - - - 0x0285B7 14:85A7: 68        PLA
C - - - - - 0x0285B8 14:85A8: 60        RTS

sub_85A9:
ofs_027_85A9_01:
C - J - - - 0x0285B9 14:85A9: 20 E7 85  JSR sub_85E7
C - - - - - 0x0285BC 14:85AC: A4 40     LDY ram_0040
C - - - - - 0x0285BE 14:85AE: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285C0 14:85B0: AA        TAX
C - - - - - 0x0285C1 14:85B1: C8        INY
C - - - - - 0x0285C2 14:85B2: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285C4 14:85B4: C8        INY
C - - - - - 0x0285C5 14:85B5: 84 40     STY ram_0040
C - - - - - 0x0285C7 14:85B7: A0 07     LDY #$07
C - - - - - 0x0285C9 14:85B9: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285CB 14:85BB: 88        DEY
C - - - - - 0x0285CC 14:85BC: 88        DEY
C - - - - - 0x0285CD 14:85BD: 8A        TXA
C - - - - - 0x0285CE 14:85BE: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285D0 14:85C0: A4 40     LDY ram_0040
C - - - - - 0x0285D2 14:85C2: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285D4 14:85C4: AA        TAX
C - - - - - 0x0285D5 14:85C5: C8        INY
C - - - - - 0x0285D6 14:85C6: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285D8 14:85C8: C8        INY
C - - - - - 0x0285D9 14:85C9: 84 40     STY ram_0040
C - - - - - 0x0285DB 14:85CB: A0 0B     LDY #$0B
C - - - - - 0x0285DD 14:85CD: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285DF 14:85CF: 88        DEY
C - - - - - 0x0285E0 14:85D0: 88        DEY
C - - - - - 0x0285E1 14:85D1: 8A        TXA
C - - - - - 0x0285E2 14:85D2: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285E4 14:85D4: 60        RTS

ofs_027_85D5_02:
C - J - - - 0x0285E5 14:85D5: 20 E7 85  JSR sub_85E7
loc_85D8:
C D - - - - 0x0285E8 14:85D8: A0 00     LDY #$00
C - - - - - 0x0285EA 14:85DA: B1 3C     LDA (ram_003C),Y
C - - - - - 0x0285EC 14:85DC: 09 10     ORA #$10
C - - - - - 0x0285EE 14:85DE: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285F0 14:85E0: 60        RTS

ofs_027_85E1_03:
C - J - - - 0x0285F1 14:85E1: 20 A9 85  JSR sub_85A9
C - - - - - 0x0285F4 14:85E4: 4C D8 85  JMP loc_85D8

sub_85E7:
C - - - - - 0x0285F7 14:85E7: A4 40     LDY ram_0040
C - - - - - 0x0285F9 14:85E9: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0285FB 14:85EB: A0 11     LDY #$11
C - - - - - 0x0285FD 14:85ED: 91 3C     STA (ram_003C),Y
C - - - - - 0x0285FF 14:85EF: E6 40     INC ram_0040
C - - - - - 0x028601 14:85F1: 60        RTS

sub_85F2:
C - - - - - 0x028602 14:85F2: 18        CLC
C - - - - - 0x028603 14:85F3: B1 3C     LDA (ram_003C),Y
C - - - - - 0x028605 14:85F5: C8        INY
C - - - - - 0x028606 14:85F6: 71 3C     ADC (ram_003C),Y
C - - - - - 0x028608 14:85F8: 91 3C     STA (ram_003C),Y
C - - - - - 0x02860A 14:85FA: C8        INY
C - - - - - 0x02860B 14:85FB: B1 3C     LDA (ram_003C),Y
C - - - - - 0x02860D 14:85FD: 10 02     BPL bra_8601
C - - - - - 0x02860F 14:85FF: D6 42     DEC ram_0042,X
bra_8601:
C - - - - - 0x028611 14:8601: C8        INY
C - - - - - 0x028612 14:8602: 71 3C     ADC (ram_003C),Y
C - - - - - 0x028614 14:8604: 91 3C     STA (ram_003C),Y
C - - - - - 0x028616 14:8606: B5 42     LDA ram_0042,X
C - - - - - 0x028618 14:8608: 69 00     ADC #$00
C - - - - - 0x02861A 14:860A: 95 42     STA ram_0042,X
C - - - - - 0x02861C 14:860C: 60        RTS

sub_860D:
C - - - - - 0x02861D 14:860D: B1 3E     LDA (ram_003E),Y
C - - - - - 0x02861F 14:860F: 48        PHA
C - - - - - 0x028620 14:8610: 88        DEY
C - - - - - 0x028621 14:8611: B1 3E     LDA (ram_003E),Y
C - - - - - 0x028623 14:8613: 48        PHA
C - - - - - 0x028624 14:8614: 8A        TXA
C - - - - - 0x028625 14:8615: A8        TAY
C - - - - - 0x028626 14:8616: 68        PLA
C - - - - - 0x028627 14:8617: 18        CLC
C - - - - - 0x028628 14:8618: 71 3C     ADC (ram_003C),Y
C - - - - - 0x02862A 14:861A: 91 3C     STA (ram_003C),Y
C - - - - - 0x02862C 14:861C: C8        INY
C - - - - - 0x02862D 14:861D: C8        INY
C - - - - - 0x02862E 14:861E: 68        PLA
C - - - - - 0x02862F 14:861F: 71 3C     ADC (ram_003C),Y
C - - - - - 0x028631 14:8621: 91 3C     STA (ram_003C),Y
C - - - - - 0x028633 14:8623: 60        RTS

sub_0x028634:
C D - - - - 0x028634 14:8624: AD 2D 06  LDA ram_062D
C - - - - - 0x028637 14:8627: 29 0F     AND #$0F
C - - - - - 0x028639 14:8629: C9 05     CMP #$05
C - - - - - 0x02863B 14:862B: D0 03     BNE bra_8630
C - - - - - 0x02863D 14:862D: 4C 61 88  JMP loc_8861
bra_8630:
C - - - - - 0x028640 14:8630: 20 53 87  JSR sub_8753
C - - - - - 0x028643 14:8633: A9 00     LDA #$00
C - - - - - 0x028645 14:8635: 85 46     STA ram_0046
loc_8637:
C D - - - - 0x028647 14:8637: A5 46     LDA ram_0046
C - - - - - 0x028649 14:8639: D0 03     BNE bra_863E
C - - - - - 0x02864B 14:863B: 4C CF 86  JMP loc_86CF
bra_863E:
C - - - - - 0x02864E 14:863E: C9 0B     CMP #$0B
C - - - - - 0x028650 14:8640: D0 03     BNE bra_8645
C - - - - - 0x028652 14:8642: 4C CF 86  JMP loc_86CF
bra_8645:
C - - - - - 0x028655 14:8645: 20 DB 86  JSR sub_86DB
C - - - - - 0x028658 14:8648: B0 03     BCS bra_864D
C - - - - - 0x02865A 14:864A: 4C CF 86  JMP loc_86CF
bra_864D:
C - - - - - 0x02865D 14:864D: A6 3B     LDX ram_003B
C - - - - - 0x02865F 14:864F: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x028661 14:8651: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x028663 14:8653: C9 34     CMP #$34
C - - - - - 0x028665 14:8655: B0 02     BCS bra_8659
C - - - - - 0x028667 14:8657: A9 34     LDA #$34
bra_8659:
C - - - - - 0x028669 14:8659: C9 CC     CMP #$CC
C - - - - - 0x02866B 14:865B: 90 02     BCC bra_865F
C - - - - - 0x02866D 14:865D: A9 CC     LDA #$CC
bra_865F:
C - - - - - 0x02866F 14:865F: 48        PHA
C - - - - - 0x028670 14:8660: AD 2D 06  LDA ram_062D
C - - - - - 0x028673 14:8663: 29 0F     AND #$0F
C - - - - - 0x028675 14:8665: A8        TAY
C - - - - - 0x028676 14:8666: 68        PLA
C - - - - - 0x028677 14:8667: 18        CLC
C - - - - - 0x028678 14:8668: 79 DA 88  ADC tbl_88DA,Y
C - - - - - 0x02867B 14:866B: 9D 03 02  STA ram_spr_X,X
C - - - - - 0x02867E 14:866E: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x028680 14:8670: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x028682 14:8672: C9 54     CMP #$54
C - - - - - 0x028684 14:8674: B0 02     BCS bra_8678
C - - - - - 0x028686 14:8676: A9 54     LDA #$54
bra_8678:
C - - - - - 0x028688 14:8678: C9 AC     CMP #$AC
C - - - - - 0x02868A 14:867A: 90 02     BCC bra_867E
C - - - - - 0x02868C 14:867C: A9 AC     LDA #$AC
bra_867E:
C - - - - - 0x02868E 14:867E: 48        PHA
C - - - - - 0x02868F 14:867F: AD 2D 06  LDA ram_062D
C - - - - - 0x028692 14:8682: 29 0F     AND #$0F
C - - - - - 0x028694 14:8684: A8        TAY
C - - - - - 0x028695 14:8685: 68        PLA
C - - - - - 0x028696 14:8686: 18        CLC
C - - - - - 0x028697 14:8687: 79 DF 88  ADC tbl_88DF,Y
C - - - - - 0x02869A 14:868A: 9D 00 02  STA ram_spr_Y,X
C - - - - - 0x02869D 14:868D: A9 03     LDA #$03
C - - - - - 0x02869F 14:868F: 9D 02 02  STA ram_spr_A,X
C - - - - - 0x0286A2 14:8692: 2C 15 06  BIT ram_0615
C - - - - - 0x0286A5 14:8695: 10 11     BPL bra_86A8
C - - - - - 0x0286A7 14:8697: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0286AA 14:869A: F0 0C     BEQ bra_86A8    ; if комада слева
; if комада справа
C - - - - - 0x0286AC 14:869C: A5 46     LDA ram_0046
C - - - - - 0x0286AE 14:869E: C9 0B     CMP #$0B
C - - - - - 0x0286B0 14:86A0: B0 06     BCS bra_86A8
C - - - - - 0x0286B2 14:86A2: 20 F2 86  JSR sub_86F2
C - - - - - 0x0286B5 14:86A5: 4C B5 86  JMP loc_86B5
bra_86A8:
C - - - - - 0x0286B8 14:86A8: A5 46     LDA ram_0046
C - - - - - 0x0286BA 14:86AA: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x0286BD 14:86AD: D0 06     BNE bra_86B5
C - - - - - 0x0286BF 14:86AF: 20 1D 88  JSR sub_881D_анимация_мяча_миникарты
C - - - - - 0x0286C2 14:86B2: 4C C4 86  JMP loc_86C4
bra_86B5:
loc_86B5:
C D - - - - 0x0286C5 14:86B5: C9 0B     CMP #$0B
C - - - - - 0x0286C7 14:86B7: 90 02     BCC bra_86BB
C - - - - - 0x0286C9 14:86B9: E9 01     SBC #$01
bra_86BB:
C - - - - - 0x0286CB 14:86BB: 18        CLC
C - - - - - 0x0286CC 14:86BC: 69 11     ADC #$11
C - - - - - 0x0286CE 14:86BE: C9 20     CMP #$20
C - - - - - 0x0286D0 14:86C0: 90 02     BCC bra_86C4
C - - - - - 0x0286D2 14:86C2: 69 0F     ADC #$0F
bra_86C4:
loc_86C4:
C D - - - - 0x0286D4 14:86C4: 9D 01 02  STA ram_spr_T,X
C - - - - - 0x0286D7 14:86C7: E8        INX
C - - - - - 0x0286D8 14:86C8: E8        INX
C - - - - - 0x0286D9 14:86C9: E8        INX
C - - - - - 0x0286DA 14:86CA: E8        INX
C - - - - - 0x0286DB 14:86CB: 86 3B     STX ram_003B
C - - - - - 0x0286DD 14:86CD: E6 48     INC ram_0048
loc_86CF:
C D - - - - 0x0286DF 14:86CF: E6 46     INC ram_0046
C - - - - - 0x0286E1 14:86D1: A5 46     LDA ram_0046
C - - - - - 0x0286E3 14:86D3: C9 16     CMP #$16
C - - - - - 0x0286E5 14:86D5: F0 03     BEQ bra_86DA_RTS
C - - - - - 0x0286E7 14:86D7: 4C 37 86  JMP loc_8637
bra_86DA_RTS:
C - - - - - 0x0286EA 14:86DA: 60        RTS

sub_86DB:
C - - - - - 0x0286EB 14:86DB: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0286EE 14:86DE: AD 2D 06  LDA ram_062D
C - - - - - 0x0286F1 14:86E1: 29 0F     AND #$0F
C - - - - - 0x0286F3 14:86E3: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x0286F6 14:86E6: 1D 87     .word ofs_028_871D_00
- D - I - - 0x0286F8 14:86E8: 1D 87     .word ofs_028_871D_01
- D - I - - 0x0286FA 14:86EA: 1F 87     .word ofs_028_871F_02
- D - I - - 0x0286FC 14:86EC: 3B 87     .word ofs_028_873B_03
- D - I - - 0x0286FE 14:86EE: 1D 87     .word ofs_028_871D_04

sub_86F2:
C - - - - - 0x028702 14:86F2: A5 46     LDA ram_0046
C - - - - - 0x028704 14:86F4: CD FD 05  CMP ram_управляемый
C - - - - - 0x028707 14:86F7: D0 23     BNE bra_871C_RTS
C - - - - - 0x028709 14:86F9: AD 2E 06  LDA ram_062E
C - - - - - 0x02870C 14:86FC: D0 11     BNE bra_870F
C - - - - - 0x02870E 14:86FE: A0 07     LDY #$07
C - - - - - 0x028710 14:8700: AD 2D 06  LDA ram_062D
C - - - - - 0x028713 14:8703: 49 40     EOR #$40
C - - - - - 0x028715 14:8705: 8D 2D 06  STA ram_062D
C - - - - - 0x028718 14:8708: 70 02     BVS bra_870C
C - - - - - 0x02871A 14:870A: A0 04     LDY #$04
bra_870C:
C - - - - - 0x02871C 14:870C: 8C 2E 06  STY ram_062E
bra_870F:
C - - - - - 0x02871F 14:870F: CE 2E 06  DEC ram_062E
C - - - - - 0x028722 14:8712: A5 46     LDA ram_0046
C - - - - - 0x028724 14:8714: 2C 2D 06  BIT ram_062D
C - - - - - 0x028727 14:8717: 70 03     BVS bra_871C_RTS
C - - - - - 0x028729 14:8719: 18        CLC
C - - - - - 0x02872A 14:871A: 69 0B     ADC #$0B
bra_871C_RTS:
C - - - - - 0x02872C 14:871C: 60        RTS

ofs_028_871F_02:
C - J - - - 0x02872F 14:871F: A5 46     LDA ram_0046
C - - - - - 0x028731 14:8721: C9 0B     CMP #$0B
C - - - - - 0x028733 14:8723: B0 14     BCS bra_8739
C - - - - - 0x028735 14:8725: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x028738 14:8728: F0 0F     BEQ bra_8739
C - - - - - 0x02873A 14:872A: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x02873D 14:872D: F0 08     BEQ bra_8737
bra_872F_loop:
C - - - - - 0x02873F 14:872F: DD 30 04  CMP ram_список_спешалов,X
C - - - - - 0x028742 14:8732: F0 05     BEQ bra_8739
C - - - - - 0x028744 14:8734: CA        DEX
C - - - - - 0x028745 14:8735: D0 F8     BNE bra_872F_loop
bra_8737:
C - - - - - 0x028747 14:8737: 18        CLC
C - - - - - 0x028748 14:8738: 60        RTS
bra_8739:
ofs_028_871D_00:
ofs_028_871D_01:
ofs_028_871D_04:
C - - - - - 0x028749 14:8739: 38        SEC
C - - - - - 0x02874A 14:873A: 60        RTS

ofs_028_873B_03:
C - J - - - 0x02874B 14:873B: A5 46     LDA ram_0046
C - - - - - 0x02874D 14:873D: CD 41 04  CMP ram_игрок_с_мячом
C - - - - - 0x028750 14:8740: F0 0F     BEQ bra_8751
C - - - - - 0x028752 14:8742: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x028755 14:8745: F0 08     BEQ bra_874F
bra_8747_loop:
C - - - - - 0x028757 14:8747: DD 00 06  CMP ram_колво_защитников,X
C - - - - - 0x02875A 14:874A: F0 05     BEQ bra_8751
C - - - - - 0x02875C 14:874C: CA        DEX
C - - - - - 0x02875D 14:874D: D0 F8     BNE bra_8747_loop
bra_874F:
C - - - - - 0x02875F 14:874F: 38        SEC
C - - - - - 0x028760 14:8750: 60        RTS
bra_8751:
C - - - - - 0x028761 14:8751: 18        CLC
C - - - - - 0x028762 14:8752: 60        RTS

sub_8753:
C - - - - - 0x028763 14:8753: AD 2D 06  LDA ram_062D
C - - - - - 0x028766 14:8756: 29 0F     AND #$0F
C - - - - - 0x028768 14:8758: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x02876B 14:875B: 67 87     .word _общий_RTS
- D - I - - 0x02876D 14:875D: 68 87     .word ofs_029_8768_01
- D - I - - 0x02876F 14:875F: 71 87     .word ofs_029_8771_02
- D - I - - 0x028771 14:8761: 84 87     .word ofs_029_8784_03
- D - I - - 0x028773 14:8763: 67 87     .word _общий_RTS

ofs_029_8768_01:
C - J - - - 0x028778 14:8768: AD 24 06  LDA ram_0624
C - - - - - 0x02877B 14:876B: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x02877E 14:876E: 4C E7 87  JMP loc_87E7

ofs_029_8771_02:
C - J - - - 0x028781 14:8771: AD FC 05  LDA ram_принимающий
C - - - - - 0x028784 14:8774: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x028787 14:8777: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x028789 14:8779: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x02878B 14:877B: AA        TAX
C - - - - - 0x02878C 14:877C: A0 08     LDY #con_plr_pos_Y_hi
C - - - - - 0x02878E 14:877E: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x028790 14:8780: A8        TAY
C - - - - - 0x028791 14:8781: 4C E7 87  JMP loc_87E7

ofs_029_8784_03:
C - J - - - 0x028794 14:8784: AD 24 06  LDA ram_0624
C - - - - - 0x028797 14:8787: 20 A7 87  JSR sub_87A7
C - - - - - 0x02879A 14:878A: 48        PHA
C - - - - - 0x02879B 14:878B: AD 24 06  LDA ram_0624
C - - - - - 0x02879E 14:878E: 20 C7 87  JSR sub_87C7
C - - - - - 0x0287A1 14:8791: 68        PLA
C - - - - - 0x0287A2 14:8792: AA        TAX
C - - - - - 0x0287A3 14:8793: 4C E7 87  JMP loc_87E7

sub_0x0287A6:
C D - - - - 0x0287A6 14:8796: A9 10     LDA #$10
C - - - - - 0x0287A8 14:8798: 20 A7 87  JSR sub_87A7
C - - - - - 0x0287AB 14:879B: 8D 35 06  STA ram_0635
C - - - - - 0x0287AE 14:879E: A9 10     LDA #$10
C - - - - - 0x0287B0 14:87A0: 20 C7 87  JSR sub_87C7
C - - - - - 0x0287B3 14:87A3: 8D 37 06  STA ram_0637
C - - - - - 0x0287B6 14:87A6: 60        RTS

sub_87A7:
C - - - - - 0x0287B7 14:87A7: 85 3E     STA ram_003E
C - - - - - 0x0287B9 14:87A9: AD 2C 06  LDA ram_062C
C - - - - - 0x0287BC 14:87AC: 20 45 C5  JSR sub_0x03CE5A
C - - - - - 0x0287BF 14:87AF: 86 3C     STX ram_003C
C - - - - - 0x0287C1 14:87B1: 84 3D     STY ram_003D
C - - - - - 0x0287C3 14:87B3: AE 39 06  LDX ram_0639
C - - - - - 0x0287C6 14:87B6: AC 35 06  LDY ram_0635
bra_87B9_loop:
C - - - - - 0x0287C9 14:87B9: 18        CLC
C - - - - - 0x0287CA 14:87BA: 8A        TXA
C - - - - - 0x0287CB 14:87BB: 65 3C     ADC ram_003C
C - - - - - 0x0287CD 14:87BD: AA        TAX
C - - - - - 0x0287CE 14:87BE: 98        TYA
C - - - - - 0x0287CF 14:87BF: 65 3D     ADC ram_003D
C - - - - - 0x0287D1 14:87C1: A8        TAY
C - - - - - 0x0287D2 14:87C2: C6 3E     DEC ram_003E
C - - - - - 0x0287D4 14:87C4: 10 F3     BPL bra_87B9_loop
C - - - - - 0x0287D6 14:87C6: 60        RTS

sub_87C7:
C - - - - - 0x0287D7 14:87C7: 85 3E     STA ram_003E
C - - - - - 0x0287D9 14:87C9: AD 2C 06  LDA ram_062C
C - - - - - 0x0287DC 14:87CC: 20 42 C5  JSR sub_0x03CE5D
C - - - - - 0x0287DF 14:87CF: 86 3C     STX ram_003C
C - - - - - 0x0287E1 14:87D1: 84 3D     STY ram_003D
C - - - - - 0x0287E3 14:87D3: AE 3B 06  LDX ram_063B
C - - - - - 0x0287E6 14:87D6: AC 37 06  LDY ram_0637
bra_87D9_loop:
C - - - - - 0x0287E9 14:87D9: 18        CLC
C - - - - - 0x0287EA 14:87DA: 8A        TXA
C - - - - - 0x0287EB 14:87DB: 65 3C     ADC ram_003C
C - - - - - 0x0287ED 14:87DD: AA        TAX
C - - - - - 0x0287EE 14:87DE: 98        TYA
C - - - - - 0x0287EF 14:87DF: 65 3D     ADC ram_003D
C - - - - - 0x0287F1 14:87E1: A8        TAY
C - - - - - 0x0287F2 14:87E2: C6 3E     DEC ram_003E
C - - - - - 0x0287F4 14:87E4: 10 F3     BPL bra_87D9_loop
C - - - - - 0x0287F6 14:87E6: 60        RTS

loc_87E7:
C D - - - - 0x0287F7 14:87E7: 8A        TXA
C - - - - - 0x0287F8 14:87E8: 18        CLC
C - - - - - 0x0287F9 14:87E9: 69 FD     ADC #$FD
C - - - - - 0x0287FB 14:87EB: A6 3B     LDX ram_003B
C - - - - - 0x0287FD 14:87ED: 9D 03 02  STA ram_spr_X,X
C - - - - - 0x028800 14:87F0: 98        TYA
C - - - - - 0x028801 14:87F1: 18        CLC
C - - - - - 0x028802 14:87F2: 69 C7     ADC #$C7
C - - - - - 0x028804 14:87F4: 9D 00 02  STA ram_spr_Y,X
C - - - - - 0x028807 14:87F7: A9 3C     LDA #$3C
C - - - - - 0x028809 14:87F9: AC 2D 06  LDY ram_062D
C - - - - - 0x02880C 14:87FC: C0 83     CPY #$83
C - - - - - 0x02880E 14:87FE: 08        PHP
C - - - - - 0x02880F 14:87FF: A0 01     LDY #$01
C - - - - - 0x028811 14:8801: 28        PLP
C - - - - - 0x028812 14:8802: D0 04     BNE bra_8808
C - - - - - 0x028814 14:8804: A0 03     LDY #$03
C - - - - - 0x028816 14:8806: A9 11     LDA #$11
bra_8808:
C - - - - - 0x028818 14:8808: 9D 01 02  STA ram_spr_T,X
C - - - - - 0x02881B 14:880B: 98        TYA
C - - - - - 0x02881C 14:880C: 9D 02 02  STA ram_spr_A,X
C - - - - - 0x02881F 14:880F: E8        INX
C - - - - - 0x028820 14:8810: E8        INX
C - - - - - 0x028821 14:8811: E8        INX
C - - - - - 0x028822 14:8812: E8        INX
C - - - - - 0x028823 14:8813: 86 3B     STX ram_003B
C - - - - - 0x028825 14:8815: E6 48     INC ram_0048
C - - - - - 0x028827 14:8817: A9 01     LDA #$01
C - - - - - 0x028829 14:8819: 8D 32 05  STA ram_0532
C - - - - - 0x02882C 14:881C: 60        RTS

sub_881D_анимация_мяча_миникарты:
C - - - - - 0x02882D 14:881D: AC 40 06  LDY ram_счетчик_анимации_мяча_миникарты_lo
C - - - - - 0x028830 14:8820: D0 12     BNE bra_8834_пропуск_изменения_счетчика
C - - - - - 0x028832 14:8822: AC 41 06  LDY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - - 0x028835 14:8825: C8        INY
C - - - - - 0x028836 14:8826: C0 03     CPY #$03
C - - - - - 0x028838 14:8828: D0 02     BNE bra_882C_не_обнулять_счетчик
C - - - - - 0x02883A 14:882A: A0 00     LDY #$00
bra_882C_не_обнулять_счетчик:
C - - - - - 0x02883C 14:882C: 8C 41 06  STY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - - 0x02883F 14:882F: A9 04     LDA #$04
C - - - - - 0x028841 14:8831: 8D 40 06  STA ram_счетчик_анимации_мяча_миникарты_lo
bra_8834_пропуск_изменения_счетчика:
C - - - - - 0x028844 14:8834: A9 00     LDA #$00
C - - - - - 0x028846 14:8836: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x028849 14:8839: 08        PHP
C - - - - - 0x02884A 14:883A: AC 41 06  LDY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - - 0x02884D 14:883D: 28        PLP
C - - - - - 0x02884E 14:883E: D0 07     BNE bra_8847_команда_справа
; if комада слева
C - - - - - 0x028850 14:8840: 98        TYA
C - - - - - 0x028851 14:8841: 18        CLC
C - - - - - 0x028852 14:8842: 69 03     ADC #$03
C - - - - - 0x028854 14:8844: A8        TAY
C - - - - - 0x028855 14:8845: A9 80     LDA #$80
bra_8847_команда_справа:
C - - - - - 0x028857 14:8847: 2C 37 06  BIT ram_0637
C - - - - - 0x02885A 14:884A: 30 02     BMI bra_884E_не_менять_флаг_зеркала
C - - - - - 0x02885C 14:884C: 49 80     EOR #$80
bra_884E_не_менять_флаг_зеркала:
C - - - - - 0x02885E 14:884E: 1D 02 02  ORA ram_spr_A,X
C - - - - - 0x028861 14:8851: 9D 02 02  STA ram_spr_A,X
C - - - - - 0x028864 14:8854: B9 5B 88  LDA tbl_885B_тайлы_спрайта_мяча_миникарты,Y
C - - - - - 0x028867 14:8857: CE 40 06  DEC ram_счетчик_анимации_мяча_миникарты_lo
C - - - - - 0x02886A 14:885A: 60        RTS



tbl_885B_тайлы_спрайта_мяча_миникарты:
; вращение диагонально вниз
- D - - - - 0x02886B 14:885B: 36        .byte $36   ; <3>
- D - - - - 0x02886C 14:885C: 37        .byte $37   ; <4>
- D - - - - 0x02886D 14:885D: 3D        .byte $3D   ; <+>
; вращение диагонально вверх
- D - - - - 0x02886E 14:885E: 3D        .byte $3D   ; <+>
- D - - - - 0x02886F 14:885F: 37        .byte $37   ; <4>
- D - - - - 0x028870 14:8860: 36        .byte $36   ; <3>



loc_8861:
C D - - - - 0x028871 14:8861: AD 2C 00  LDA ram_расстановка_слева
C - - - - - 0x028874 14:8864: 0A        ASL
C - - - - - 0x028875 14:8865: 85 46     STA ram_0046
C - - - - - 0x028877 14:8867: 0A        ASL
C - - - - - 0x028878 14:8868: 0A        ASL
C - - - - - 0x028879 14:8869: 65 46     ADC ram_0046
C - - - - - 0x02887B 14:886B: AA        TAX
C - - - - - 0x02887C 14:886C: A9 00     LDA #$00
C - - - - - 0x02887E 14:886E: 85 46     STA ram_0046
bra_8870_loop:
C - - - - - 0x028880 14:8870: A4 46     LDY ram_0046
C - - - - - 0x028882 14:8872: B9 D0 88  LDA tbl_88D0,Y
C - - - - - 0x028885 14:8875: A4 3B     LDY ram_003B
C - - - - - 0x028887 14:8877: 99 01 02  STA ram_spr_T,Y
C - - - - - 0x02888A 14:887A: BD A8 88  LDA tbl_88A8,X
C - - - - - 0x02888D 14:887D: 48        PHA
C - - - - - 0x02888E 14:887E: 29 F0     AND #$F0
C - - - - - 0x028890 14:8880: 4A        LSR
C - - - - - 0x028891 14:8881: 18        CLC
C - - - - - 0x028892 14:8882: 69 A0     ADC #$A0
C - - - - - 0x028894 14:8884: 99 03 02  STA ram_spr_X,Y
C - - - - - 0x028897 14:8887: 68        PLA
C - - - - - 0x028898 14:8888: 29 0F     AND #$0F
C - - - - - 0x02889A 14:888A: 0A        ASL
C - - - - - 0x02889B 14:888B: 0A        ASL
C - - - - - 0x02889C 14:888C: 69 A2     ADC #$A2
C - - - - - 0x02889E 14:888E: 99 00 02  STA ram_spr_Y,Y
C - - - - - 0x0288A1 14:8891: A9 00     LDA #$00
C - - - - - 0x0288A3 14:8893: 99 02 02  STA ram_spr_A,Y
C - - - - - 0x0288A6 14:8896: E8        INX
C - - - - - 0x0288A7 14:8897: C8        INY
C - - - - - 0x0288A8 14:8898: C8        INY
C - - - - - 0x0288A9 14:8899: C8        INY
C - - - - - 0x0288AA 14:889A: C8        INY
C - - - - - 0x0288AB 14:889B: 84 3B     STY ram_003B
C - - - - - 0x0288AD 14:889D: E6 48     INC ram_0048
C - - - - - 0x0288AF 14:889F: E6 46     INC ram_0046
C - - - - - 0x0288B1 14:88A1: A5 46     LDA ram_0046
C - - - - - 0x0288B3 14:88A3: C9 0A     CMP #$0A
C - - - - - 0x0288B5 14:88A5: D0 C9     BNE bra_8870_loop
C - - - - - 0x0288B7 14:88A7: 60        RTS

tbl_88A8:
- D - - - - 0x0288B8 14:88A8: 30        .byte $30   ; <ゃ>
- D - - - - 0x0288B9 14:88A9: 3A        .byte $3A   ; <7>
- D - - - - 0x0288BA 14:88AA: 35        .byte $35   ; <2>
- D - - - - 0x0288BB 14:88AB: 25        .byte $25   ; <ゆ>
- D - - - - 0x0288BC 14:88AC: 52        .byte $52   ; <ツ>
- D - - - - 0x0288BD 14:88AD: 7A        .byte $7A   ; <、>
- D - - - - 0x0288BE 14:88AE: 58        .byte $58   ; <ネ>
- D - - - - 0x0288BF 14:88AF: 75        .byte $75   ; <ェ>
- D - - - - 0x0288C0 14:88B0: 55        .byte $55   ; <ナ>
- D - - - - 0x0288C1 14:88B1: 70        .byte $70   ; <ャ>
- D - - - - 0x0288C2 14:88B2: 20        .byte $20   ; <み>
- D - - - - 0x0288C3 14:88B3: 2A        .byte $2A   ; <れ>
- D - - - - 0x0288C4 14:88B4: 25        .byte $25   ; <ゆ>
- D - - - - 0x0288C5 14:88B5: 15        .byte $15   ; <な>
- D - - - - 0x0288C6 14:88B6: 51        .byte $51   ; <チ>
- D - - - - 0x0288C7 14:88B7: 59        .byte $59   ; <ノ>
- D - - - - 0x0288C8 14:88B8: 46        .byte $46   ; <カ>
- D - - - - 0x0288C9 14:88B9: 77        .byte $77   ; <:>
- D - - - - 0x0288CA 14:88BA: 44        .byte $44   ; <エ>
- D - - - - 0x0288CB 14:88BB: 73        .byte $73   ; <ヮ>
- D - - - - 0x0288CC 14:88BC: 20        .byte $20   ; <み>
- D - - - - 0x0288CD 14:88BD: 2A        .byte $2A   ; <れ>
- D - - - - 0x0288CE 14:88BE: 25        .byte $25   ; <ゆ>
- D - - - - 0x0288CF 14:88BF: 43        .byte $43   ; <ウ>
- D - - - - 0x0288D0 14:88C0: 51        .byte $51   ; <チ>
- D - - - - 0x0288D1 14:88C1: 59        .byte $59   ; <ノ>
- D - - - - 0x0288D2 14:88C2: 47        .byte $47   ; <キ>
- D - - - - 0x0288D3 14:88C3: 77        .byte $77   ; <:>
- D - - - - 0x0288D4 14:88C4: 55        .byte $55   ; <ナ>
- D - - - - 0x0288D5 14:88C5: 73        .byte $73   ; <ヮ>
- D - - - - 0x0288D6 14:88C6: 20        .byte $20   ; <み>
- D - - - - 0x0288D7 14:88C7: 2A        .byte $2A   ; <れ>
- D - - - - 0x0288D8 14:88C8: 24        .byte $24   ; <や>
- D - - - - 0x0288D9 14:88C9: 26        .byte $26   ; <よ>
- D - - - - 0x0288DA 14:88CA: 45        .byte $45   ; <オ>
- D - - - - 0x0288DB 14:88CB: 7A        .byte $7A   ; <、>
- D - - - - 0x0288DC 14:88CC: 48        .byte $48   ; <ク>
- D - - - - 0x0288DD 14:88CD: 75        .byte $75   ; <ェ>
- D - - - - 0x0288DE 14:88CE: 63        .byte $63   ; <モ>
- D - - - - 0x0288DF 14:88CF: 42        .byte $42   ; <イ>

tbl_88D0:
- D - - - - 0x0288E0 14:88D0: 1C        .byte $1C   ; <ふ>
- D - - - - 0x0288E1 14:88D1: 1D        .byte $1D   ; <へ>
- D - - - - 0x0288E2 14:88D2: 1E        .byte $1E   ; <ほ>
- D - - - - 0x0288E3 14:88D3: 1F        .byte $1F   ; <ま>
- D - - - - 0x0288E4 14:88D4: 30        .byte $30   ; <ゃ>
- D - - - - 0x0288E5 14:88D5: 31        .byte $31   ; <ゅ>
- D - - - - 0x0288E6 14:88D6: 32        .byte $32   ; <ょ>
- D - - - - 0x0288E7 14:88D7: 33        .byte $33   ; <0>
- D - - - - 0x0288E8 14:88D8: 34        .byte $34   ; <1>
- D - - - - 0x0288E9 14:88D9: 35        .byte $35   ; <2>

tbl_88DA:
- D - - - - 0x0288EA 14:88DA: 1D        .byte $1D   ; <へ>
- D - - - - 0x0288EB 14:88DB: FD        .byte $FD
- D - - - - 0x0288EC 14:88DC: FD        .byte $FD
- D - - - - 0x0288ED 14:88DD: FD        .byte $FD
- D - - - - 0x0288EE 14:88DE: FD        .byte $FD

tbl_88DF:
- D - - - - 0x0288EF 14:88DF: 2C        .byte $2C   ; <わ>
- D - - - - 0x0288F0 14:88E0: C7        .byte $C7   ; <ボ>
- D - - - - 0x0288F1 14:88E1: C7        .byte $C7   ; <ボ>
- D - - - - 0x0288F2 14:88E2: C7        .byte $C7   ; <ボ>
- D - - - - 0x0288F3 14:88E3: C7        .byte $C7   ; <ボ>

tbl_88E4:
; какие-то адреса оперативки
- D - - - - 0x0288F4 14:88E4: 47 05     .word ram_0547
- D - - - - 0x0288F6 14:88E6: 5C 05     .word ram_055C
- D - - - - 0x0288F8 14:88E8: 71 05     .word ram_0571
- D - - - - 0x0288FA 14:88EA: 86 05     .word ram_0586
- D - - - - 0x0288FC 14:88EC: 9B 05     .word ram_059B
- D - - - - 0x0288FE 14:88EE: B0 05     .word ram_05B0

tbl_88F0:
- D - - - - 0x028900 14:88F0: 08        .byte $08    ; 00 con_p_clone
- D - - - - 0x028901 14:88F1: 00        .byte $00    ; 01 con_p_tsubasa_my
- D - - - - 0x028902 14:88F2: 0F        .byte $0F    ; 02 con_p_renato_my
- D - - - - 0x028903 14:88F3: 06        .byte $06    ; 03 con_p_lima_my
- D - - - - 0x028904 14:88F4: 04        .byte $04    ; 04 con_p_marini_my
- D - - - - 0x028905 14:88F5: 09        .byte $09    ; 05 con_p_amaral_my
- D - - - - 0x028906 14:88F6: 05        .byte $05    ; 06 con_p_dotor_my
- D - - - - 0x028907 14:88F7: 08        .byte $08    ; 07 con_p_batista_my
- D - - - - 0x028908 14:88F8: 08        .byte $08    ; 08 con_p_tahamata_my
- D - - - - 0x028909 14:88F9: 01        .byte $01    ; 09 con_p_babington_my
- D - - - - 0x02890A 14:88FA: 02        .byte $02    ; 0A con_p_gil_my
- D - - - - 0x02890B 14:88FB: 08        .byte $08    ; 0B con_p_platon_my
- D - - - - 0x02890C 14:88FC: 09        .byte $09    ; 0C con_p_urabe_my
- D - - - - 0x02890D 14:88FD: 04        .byte $04    ; 0D con_p_kishida_my
- D - - - - 0x02890E 14:88FE: 08        .byte $08    ; 0E con_p_nakayama_my
- D - - - - 0x02890F 14:88FF: 10        .byte $10    ; 0F con_p_morisaki_my
- D - - - - 0x028910 14:8900: 08        .byte $08    ; 10 con_p_takasugi_my
- D - - - - 0x028911 14:8901: 02        .byte $02    ; 11 con_p_misaki_my
- D - - - - 0x028912 14:8902: 01        .byte $01    ; 12 con_p_izawa_my
- D - - - - 0x028913 14:8903: 03        .byte $03    ; 13 con_p_taki_my
- D - - - - 0x028914 14:8904: 06        .byte $06    ; 14 con_p_ishizaki_my
- D - - - - 0x028915 14:8905: 0B        .byte $0B    ; 15 con_p_nitta_my
- D - - - - 0x028916 14:8906: 05        .byte $05    ; 16 con_p_kisugi_my
- D - - - - 0x028917 14:8907: 03        .byte $03    ; 17 con_p_masao_my
- D - - - - 0x028918 14:8908: 03        .byte $03    ; 18 con_p_kazuo_my
- D - - - - 0x028919 14:8909: 01        .byte $01    ; 19 con_p_sano_my
- D - - - - 0x02891A 14:890A: 07        .byte $07    ; 1A con_p_hyuga_my
- D - - - - 0x02891B 14:890B: 04        .byte $04    ; 1B con_p_soda_my
- D - - - - 0x02891C 14:890C: 04        .byte $04    ; 1C con_p_jito_my
- D - - - - 0x02891D 14:890D: 02        .byte $02    ; 1D con_p_matsuyama_my
- - - - - - 0x02891E 14:890E: 02        .byte $02    ; 1E con_p_sorimachi_my
- - - - - - 0x02891F 14:890F: 04        .byte $04    ; 1F con_p_sawada_my
- D - - - - 0x028920 14:8910: 02        .byte $02    ; 20 con_p_misugi_my
- D - - - - 0x028921 14:8911: 0C        .byte $0C    ; 21 con_p_wakabayashi_my
- D - - - - 0x028922 14:8912: 0E        .byte $0E    ; 22 con_p_wakashimazu_my
- D - - - - 0x028923 14:8913: 03        .byte $03    ; 23 con_p_satrustegui_corinthians
- D - - - - 0x028924 14:8914: 01        .byte $01    ; 24 con_p_ribeiro_corinthians
- D - - - - 0x028925 14:8915: 0B        .byte $0B    ; 25 con_p_da_silva_gremio
- D - - - - 0x028926 14:8916: 0F        .byte $0F    ; 26 con_p_meon_gremio
- D - - - - 0x028927 14:8917: 06        .byte $06    ; 27 con_p_toninho_palmeiras
- D - - - - 0x028928 14:8918: 02        .byte $02    ; 28 con_p_nei_palmeiras
- D - - - - 0x028929 14:8919: 07        .byte $07    ; 29 con_p_zagallo_santos
- D - - - - 0x02892A 14:891A: 04        .byte $04    ; 2A con_p_dirceu_santos
- D - - - - 0x02892B 14:891B: 0A        .byte $0A    ; 2B con_p_carlos_flamengo
- D - - - - 0x02892C 14:891C: 09        .byte $09    ; 2C con_p_santamaria_flamengo
- D - - - - 0x02892D 14:891D: 08        .byte $08    ; 2D con_p_jetorio_flamengo
- D - - - - 0x02892E 14:891E: 04        .byte $04    ; 2E con_p_jito_kunimi
- D - - - - 0x02892F 14:891F: 01        .byte $01    ; 2F con_p_sano_kunimi
- D - - - - 0x028930 14:8920: 03        .byte $03    ; 30 con_p_masao_akita
- D - - - - 0x028931 14:8921: 03        .byte $03    ; 31 con_p_kazuo_akita
- D - - - - 0x028932 14:8922: 04        .byte $04    ; 32 con_p_soda_tatsunami
- D - - - - 0x028933 14:8923: 11        .byte $11    ; 33 con_p_nakanishi_tatsunami
- D - - - - 0x028934 14:8924: 02        .byte $02    ; 34 con_p_misugi_musashi
- D - - - - 0x028935 14:8925: 02        .byte $02    ; 35 con_p_matsuyama_furano
- D - - - - 0x028936 14:8926: 07        .byte $07    ; 36 con_p_hyuga_toho
- D - - - - 0x028937 14:8927: 02        .byte $02    ; 37 con_p_sorimachi_toho
- D - - - - 0x028938 14:8928: 04        .byte $04    ; 38 con_p_sawada_toho
- D - - - - 0x028939 14:8929: 0E        .byte $0E    ; 39 con_p_wakashimazu_toho
- D - - - - 0x02893A 14:892A: 09        .byte $09    ; 3A con_p_rampion_as_roma
- D - - - - 0x02893B 14:892B: 02        .byte $02    ; 3B con_p_victorino_uruguay
- D - - - - 0x02893C 14:892C: 0B        .byte $0B    ; 3C con_p_da_silva_uruguay
- D - - - - 0x02893D 14:892D: 01        .byte $01    ; 3D con_p_kappelman_hamburger_sv
- D - - - - 0x02893E 14:892E: 04        .byte $04    ; 3E con_p_kaltz_hamburger_sv
- D - - - - 0x02893F 14:892F: 02        .byte $02    ; 3F con_p_metza_hamburger_sv
- D - - - - 0x028940 14:8930: 0C        .byte $0C    ; 40 con_p_wakabayashi_hamburger_sv
- D - - - - 0x028941 14:8931: 07        .byte $07    ; 41 con_p_hyuga_japan
- D - - - - 0x028942 14:8932: 0B        .byte $0B    ; 42 con_p_nitta_japan
- D - - - - 0x028943 14:8933: 01        .byte $01    ; 43 con_p_sano_japan
- D - - - - 0x028944 14:8934: 02        .byte $02    ; 44 con_p_misaki_japan
- D - - - - 0x028945 14:8935: 02        .byte $02    ; 45 con_p_misugi_japan
- D - - - - 0x028946 14:8936: 03        .byte $03    ; 46 con_p_masao_japan
- D - - - - 0x028947 14:8937: 03        .byte $03    ; 47 con_p_kazuo_japan
- D - - - - 0x028948 14:8938: 04        .byte $04    ; 48 con_p_jito_japan
- D - - - - 0x028949 14:8939: 06        .byte $06    ; 49 con_p_ishizaki_japan
- D - - - - 0x02894A 14:893A: 04        .byte $04    ; 4A con_p_soda_japan
- D - - - - 0x02894B 14:893B: 02        .byte $02    ; 4B con_p_matsuyama_japan
- D - - - - 0x02894C 14:893C: 0E        .byte $0E    ; 4C con_p_wakashimazu_japan
- D - - - - 0x02894D 14:893D: 06        .byte $06    ; 4D con_p_li_han_ne_china
- D - - - - 0x02894E 14:893E: 06        .byte $06    ; 4E con_p_li_ban_kun_china
- D - - - - 0x02894F 14:893F: 07        .byte $07    ; 4F con_p_sha_south_korea
- D - - - - 0x028950 14:8940: 0A        .byte $0A    ; 50 con_p_kim_south_korea
- D - - - - 0x028951 14:8941: 06        .byte $06    ; 51 con_p_macher_poland
- D - - - - 0x028952 14:8942: 11        .byte $11    ; 52 con_p_djazic_poland
- D - - - - 0x028953 14:8943: 01        .byte $01    ; 53 con_p_lorimar_england
- D - - - - 0x028954 14:8944: 04        .byte $04    ; 54 con_p_robson_england
- D - - - - 0x028955 14:8945: 05        .byte $05    ; 55 con_p_belyaev_soviet_union
- D - - - - 0x028956 14:8946: 0F        .byte $0F    ; 56 con_p_rashin_soviet_union
- D - - - - 0x028957 14:8947: 04        .byte $04    ; 57 con_p_napoleon_france
- D - - - - 0x028958 14:8948: 01        .byte $01    ; 58 con_p_pierre_france
- D - - - - 0x028959 14:8949: 0B        .byte $0B    ; 59 con_p_espana_mexico
- D - - - - 0x02895A 14:894A: 09        .byte $09    ; 5A con_p_rampion_italy
- D - - - - 0x02895B 14:894B: 0F        .byte $0F    ; 5B con_p_hernandez_italy
- D - - - - 0x02895C 14:894C: 02        .byte $02    ; 5C con_p_islas_netherlands
- D - - - - 0x02895D 14:894D: 09        .byte $09    ; 5D con_p_libuta_netherlands
- D - - - - 0x02895E 14:894E: 0B        .byte $0B    ; 5E con_p_pascal_argentina
- D - - - - 0x02895F 14:894F: 03        .byte $03    ; 5F con_p_satrustegui_argentina
- D - - - - 0x028960 14:8950: 05        .byte $05    ; 60 con_p_diaz_argentina
- D - - - - 0x028961 14:8951: 01        .byte $01    ; 61 con_p_babington_argentina
- D - - - - 0x028962 14:8952: 01        .byte $01    ; 62 con_p_galvan_argentina
- D - - - - 0x028963 14:8953: 00        .byte $00    ; 63 con_p_schneider_west_germany
- D - - - - 0x028964 14:8954: 03        .byte $03    ; 64 con_p_margus_west_germany
- D - - - - 0x028965 14:8955: 04        .byte $04    ; 65 con_p_kaltz_west_germany
- D - - - - 0x028966 14:8956: 02        .byte $02    ; 66 con_p_metza_west_germany
- D - - - - 0x028967 14:8957: 0B        .byte $0B    ; 67 con_p_schester_west_germany
- D - - - - 0x028968 14:8958: 01        .byte $01    ; 68 con_p_kappelman_west_germany
- D - - - - 0x028969 14:8959: 0D        .byte $0D    ; 69 con_p_muller_west_germany
- D - - - - 0x02896A 14:895A: 0A        .byte $0A    ; 6A con_p_carlos_brazil
- D - - - - 0x02896B 14:895B: 07        .byte $07    ; 6B con_p_zagallo_brazil
- D - - - - 0x02896C 14:895C: 01        .byte $01    ; 6C con_p_ribeiro_brazil
- D - - - - 0x02896D 14:895D: 02        .byte $02    ; 6D con_p_nei_brazil
- D - - - - 0x02896E 14:895E: 09        .byte $09    ; 6E con_p_santamaria_brazil
- D - - - - 0x02896F 14:895F: 06        .byte $06    ; 6F con_p_toninho_brazil
- D - - - - 0x028970 14:8960: 05        .byte $05    ; 70 con_p_dotor_brazil
- D - - - - 0x028971 14:8961: 09        .byte $09    ; 71 con_p_amaral_brazil
- D - - - - 0x028972 14:8962: 04        .byte $04    ; 72 con_p_dirceu_brazil
- D - - - - 0x028973 14:8963: 08        .byte $08    ; 73 con_p_jetorio_brazil
- D - - - - 0x028974 14:8964: 0E        .byte $0E    ; 74 con_p_gertise_brazil
- D - - - - 0x028975 14:8965: 0B        .byte $0B    ; 75 con_p_coimbra_brazil



tbl_8968_анимации_сценариев:
- D - I - - 0x028978 14:8968: 48 8B     .word _off007_8B48_00     ; мерцающий экран (белый или красный)
- D - I - - 0x02897A 14:896A: 5C 8B     .word _off007_8B5C_01     ; полет drive shot
- D - I - - 0x02897C 14:896C: 6A 8B     .word _off007_8B6A_02     ; дохлый кипер в воздухе
- D - I - - 0x02897E 14:896E: 78 8B     .word _off007_8B78_03     ; кипер моментально ловит мяч и медленно движется
- D - I - - 0x028980 14:8970: 86 8B     .word _off007_8B86_04     ; кипер делает нижний dive
- D - I - - 0x028982 14:8972: 94 8B     .word _off007_8B94_05     ; после касания мяча ногой в воздухе, который летит дальше
- D - I - - 0x028984 14:8974: B4 8B     .word _off007_8BB4_06     ; игрок не дотягивается ногой до мяча в воздухе, который пролетает над ним
- D - I - - 0x028986 14:8976: CA 8B     .word _off007_8BCA_07     ; игрок не дотягивается ногой до мяча в воздухе, который пролетает под ним
- D - I - - 0x028988 14:8978: E0 8B     .word _off007_8BE0_08     ; мяч приклеивается к ноге игрока когда мяч был в полете
- D - I - - 0x02898A 14:897A: EE 8B     .word _off007_8BEE_09     ; мяч летит и касается ноги игрока
- - - - - - 0x02898C 14:897C: 04 8C     .word _off007_8C04_0A     ; ! unused байтов в сценариях не найдено, какой-то полет мяча
- D - I - - 0x02898E 14:897E: 12 8C     .word _off007_8C12_0B     ; после касания мяча телом в воздухе, который летит дальше
- D - I - - 0x028990 14:8980: 28 8C     .word _off007_8C28_0C     ; игрок не дотягивается телом до мяча в воздухе, который пролетает под ним
- D - I - - 0x028992 14:8982: 3C 8C     .word _off007_8C3C_0D     ; мяч приклеивается к телу игрока когда мяч был в полете
- D - I - - 0x028994 14:8984: 4A 8C     .word _off007_8C4A_0E     ; полет drive shot / cyclone
- D - I - - 0x028996 14:8986: 61 8C     .word _off007_8C61_0F     ; полет drive overhead / falcon volley / sano combo / volley / skylab hurricane
- D - I - - 0x028998 14:8988: 78 8C     .word _off007_8C78_10     ; полет drive overhead / cyclone
- D - I - - 0x02899A 14:898A: 86 8C     .word _off007_8C86_11     ; полет удара, а также ??? jumping volley / booster shot / mach shot? / fire shot / falcon shot / falcon volley
- D - I - - 0x02899C 14:898C: 94 8C     .word _off007_8C94_12     ; полет falcon shot / dynamite header / foward somersault / tiger shot
- D - I - - 0x02899E 14:898E: A2 8C     .word _off007_8CA2_13     ; дохлый игрок воздухе (большой)
- D - I - - 0x0289A0 14:8990: B9 8C     .word _off007_8CB9_14     ; дохлый игрок воздухе (поменьше)
- D - I - - 0x0289A2 14:8992: D0 8C     .word _off007_8CD0_15     ; игрок приклеивает мяч к ноге после подката
- D - I - - 0x0289A4 14:8994: DE 8C     .word _off007_8CDE_16     ; кипер моментально ловит мяч и быстро движется вниз (предположительно после нижнего dive)
- D - I - - 0x0289A6 14:8996: EC 8C     .word _off007_8CEC_17     ; кипер ловит летящий мяч (предположительно после верхнего dive и пк)
- D - I - - 0x0289A8 14:8998: 09 8D     .word _off007_8D09_18     ; кипер пытается словить мяч но не дотягивается
- D - I - - 0x0289AA 14:899A: 1F 8D     .word _off007_8D1F_19     ; игрок делает пас головой в воздухе
- D - I - - 0x0289AC 14:899C: 52 8D     .word _off007_8D52_1A     ; полет header / cannon shot / razor shot / tiger shot
- D - I - - 0x0289AE 14:899E: 60 8D     .word _off007_8D60_1B     ; кипер ловит летящий мяч (обычная ловля)
- D - I - - 0x0289B0 14:89A0: 89 8D     .word _off007_8D89_1C     ; игрок прыгает в воздух (вблизи, быстро)
- D - I - - 0x0289B2 14:89A2: 97 8D     .word _off007_8D97_1D     ; полет rocket header / razor shot / sidewinder shot
- D - I - - 0x0289B4 14:89A4: A5 8D     .word _off007_8DA5_1E     ; полет twin shot / skylab twin shot
- D - I - - 0x0289B6 14:89A6: B3 8D     .word _off007_8DB3_1F     ; полет twin shot / drive tiger
- D - I - - 0x0289B8 14:89A8: C1 8D     .word _off007_8DC1_20     ; игрок прыгает в воздух (вблизи, медленно)
- D - I - - 0x0289BA 14:89AA: CF 8D     .word _off007_8DCF_21     ; защитник в воротах отбивает мяч
- D - I - - 0x0289BC 14:89AC: 05 8E     .word _off007_8E05_22     ; защитник в воротах промахивается
- D - I - - 0x0289BE 14:89AE: 1B 8E     .word _off007_8E1B_23     ; rolling save
- D - I - - 0x0289C0 14:89B0: 32 8E     .word _off007_8E32_24     ; кипер пытается отбить мяч но не дотягивается
- D - I - - 0x0289C2 14:89B2: 5B 8E     .word _off007_8E5B_25     ; кипер пытается отбить мяч после спешала но не дотягивается
- D - I - - 0x0289C4 14:89B4: 7A 8E     .word _off007_8E7A_26     ; triangle jump не дотягивается
- D - I - - 0x0289C6 14:89B6: 8E 8E     .word _off007_8E8E_27     ; кипер легко отбивает мяч ближним кулаком
- D - I - - 0x0289C8 14:89B8: C6 8E     .word _off007_8EC6_28     ; полет drive tiger / slider cannon / skylab twin shot
- D - I - - 0x0289CA 14:89BA: E5 8E     .word _off007_8EE5_29     ; полет drive tiger
- D - I - - 0x0289CC 14:89BC: F3 8E     .word _off007_8EF3_2A     ; кипер легко отбивает мяч дальним кулаком
- D - I - - 0x0289CE 14:89BE: 29 8F     .word _off007_8F29_2B     ; кипер вакашимазу легко отбивает мяч верхним прыжком
- D - I - - 0x0289D0 14:89C0: 53 8F     .word _off007_8F53_2C     ; кипер напаривается кулаком на мяч
- D - I - - 0x0289D2 14:89C2: 7C 8F     .word _off007_8F7C_2D     ; triangle jump ловит мяч
- D - I - - 0x0289D4 14:89C4: 99 8F     .word _off007_8F99_2E     ; мяч приклеивается к ноге игрока после отбора мяча у другого игрока блоком или перехватом
- D - I - - 0x0289D6 14:89C6: A7 8F     .word _off007_8FA7_2F     ; полет drive tiger
- D - I - - 0x0289D8 14:89C8: BE 8F     .word _off007_8FBE_30     ; мяч приклеивается к телу игрока при заборе спешал блоком когда мяч был в полете
- D - I - - 0x0289DA 14:89CA: CC 8F     .word _off007_8FCC_31     ; игрок не дотягивается телом до мяча в воздухе, который пролетает над ним
- D - I - - 0x0289DC 14:89CC: E2 8F     .word _off007_8FE2_32     ; полет eagle shot
- D - I - - 0x0289DE 14:89CE: F9 8F     .word _off007_8FF9_33     ; игрок делает нижний clear ногой
- D - I - - 0x0289E0 14:89D0: 3A 90     .word _off007_903A_34     ; игрок делает верхний clear головой
- D - I - - 0x0289E2 14:89D2: 6F 90     .word _off007_906F_35     ; игрок делает нижний clear телом
- D - I - - 0x0289E4 14:89D4: A5 90     .word _off007_90A5_36     ; полет tiger shot / neo-tiger shot
- D - I - - 0x0289E6 14:89D6: B3 90     .word _off007_90B3_37     ; игрок бежит для перехвата нижнего мяча
- D - I - - 0x0289E8 14:89D8: CD 90     .word _off007_90CD_38     ; игрок делает нижний clear ногой (почти аналогично 33)
- D - I - - 0x0289EA 14:89DA: D2 90     .word _off007_90D2_39     ; игрок делает верхний clear головой (почти аналогично 34)
- D - I - - 0x0289EC 14:89DC: D7 90     .word _off007_90D7_3A     ; clone save
- D - I - - 0x0289EE 14:89DE: 0C 91     .word _off007_910C_3B     ; удар головой header
- D - I - - 0x0289F0 14:89E0: 41 91     .word _off007_9141_3C     ; полет mach shot / slider shot / fire shot / jumping volley / booster shot
- D - I - - 0x0289F2 14:89E2: 52 91     .word _off007_9152_3D     ; полет mach shot / cannon shot
- D - I - - 0x0289F4 14:89E4: 60 91     .word _off007_9160_3E     ; дохлый игрок воздухе (большой, зеркально 13)
- D - I - - 0x0289F6 14:89E6: 77 91     .word _off007_9177_3F     ; дохлый игрок воздухе (поменьше, зеркально 14)
- D - I - - 0x0289F8 14:89E8: 8E 91     .word _off007_918E_40     ; полет rising dragon kick / sano kombo
- D - I - - 0x0289FA 14:89EA: A5 91     .word _off007_91A5_41     ; полет banana shot
- D - I - - 0x0289FC 14:89EC: BC 91     .word _off007_91BC_42     ; отскок от штанги
- D - I - - 0x0289FE 14:89EE: CA 91     .word _off007_91CA_43     ; попадание в штангу
- D - I - - 0x028A00 14:89F0: D8 91     .word _off007_91D8_44     ; мяч в сетке
- D - I - - 0x028A02 14:89F2: E6 91     .word _off007_91E6_45     ; мяч рвет сетку
- D - I - - 0x028A04 14:89F4: F4 91     .word _off007_91F4_46     ; куски тел портрета сан-паулу после гола
- D - I - - 0x028A06 14:89F6: 02 92     .word _off007_9202_47     ; куски тел портрета нанкацу после гола
- D - I - - 0x028A08 14:89F8: 10 92     .word _off007_9210_48     ; куски тел портрета японии после гола
- D - I - - 0x028A0A 14:89FA: 1E 92     .word _off007_921E_49     ; игрок прыгает к летящему мячу
- D - I - - 0x028A0C 14:89FC: 32 92     .word _off007_9232_4A     ; игрок в стеночке приклеивает к себе мяч
- D - I - - 0x028A0E 14:89FE: 40 92     .word _off007_9240_4B     ; полет masao / kazuo с тонкими ногами
- D - I - - 0x028A10 14:8A00: 45 92     .word _off007_9245_4C     ; полет паса
- D - I - - 0x028A12 14:8A02: 53 92     .word _off007_9253_4D     ; вакашимазу отталкивается ногами от штанги
- D - I - - 0x028A14 14:8A04: 61 92     .word _off007_9261_4E     ; рефери поднимает руку и свистит
- D - I - - 0x028A16 14:8A06: 6F 92     .word _off007_926F_4F     ; рваный мяч падает на землю
- D - I - - 0x028A18 14:8A08: 7D 92     .word _off007_927D_50     ; анимация подката
- D - I - - 0x028A1A 14:8A0A: 8B 92     .word _off007_928B_51     ; полет cyclone
- D - I - - 0x028A1C 14:8A0C: 9F 92     .word _off007_929F_52     ; мяч улетает в сторону после выбивания откуда-то
- - - - - - 0x028A1E 14:8A0E: AD 92     .word _off007_92AD_53     ; ! unused байтов в сценариях не найдено, какой-то полет мяча
- - - - - - 0x028A20 14:8A10: BB 92     .word _off007_92BB_54     ; полет мяча дальше после задевания стенки (мяч продолжает лететь в ворота)
- D - I - - 0x028A22 14:8A12: C9 92     .word _off007_92C9_55     ; полет мяча при огибании стеночки
- D - I - - 0x028A24 14:8A14: D7 92     .word _off007_92D7_56     ; полет мяча когда игрок делает пас/удар после нападения на него, и игроки собираются его перехватить
- D - I - - 0x028A26 14:8A16: E5 92     .word _off007_92E5_57     ; кипер делает верхний dive
- D - I - - 0x028A28 14:8A18: F3 92     .word _off007_92F3_58     ; игрок разгоняется для подката
- - - - - - 0x028A2A 14:8A1A: 0D 93     .word _off007_930D_59     ; кипер не может словить мяч в пк
- D - I - - 0x028A2C 14:8A1C: 23 93     .word _off007_9323_5A     ; ХЗ игрок бежит
- D - I - - 0x028A2E 14:8A1E: 3D 93     .word _off007_933D_5B     ; игрок медленно бежит (когда он нападает на игрока с мячом)
- D - I - - 0x028A30 14:8A20: 57 93     .word _off007_9357_5C     ; игрок завис вблизи с мячом на земле в режиме выбора действия
- D - I - - 0x028A32 14:8A22: 71 93     .word _off007_9371_5D     ; полет sidewinder shot / double eel
- D - I - - 0x028A34 14:8A24: 7F 93     .word _off007_937F_5E     ; полет slider shot
- D - I - - 0x028A36 14:8A26: 8D 93     .word _off007_938D_5F     ; полет drive overhead
- D - I - - 0x028A38 14:8A28: A4 93     .word _off007_93A4_60     ; dribble
- D - I - - 0x028A3A 14:8A2A: EC 93     .word _off007_93EC_61     ; игрок замахивается для обычного удара / удара с красным экраном
- D - I - - 0x028A3C 14:8A2C: 03 94     .word _off007_9403_62     ; удар по мячу обычным ударом
- D - I - - 0x028A3E 14:8A2E: 11 94     .word _off007_9411_63     ; мяч улетает от игрока после удара по нему
- D - I - - 0x028A40 14:8A30: 25 94     .word _off007_9425_64     ; игрок прыгает в воздух (вблизи, средняя скорость)
- - - - - - 0x028A42 14:8A32: 33 94     .word _off007_9433_65     ; ! unused байтов в сценариях не найдено, какой-то полет мяча
- D - I - - 0x028A44 14:8A34: 41 94     .word _off007_9441_66     ; игрок делает пас с земли
- D - I - - 0x028A46 14:8A36: 56 94     .word _off007_9456_67     ; полет eagle shot
- D - I - - 0x028A48 14:8A38: 6A 94     .word _off007_946A_68     ; игрок подлетает к мячу для замаха volley
- D - I - - 0x028A4A 14:8A3A: 7E 94     .word _off007_947E_69     ; удар по мячу volley
- D - I - - 0x028A4C 14:8A3C: 8C 94     .word _off007_948C_6A     ; игрок уже ударил volley, мяч улетает от него
- D - I - - 0x028A4E 14:8A3E: A2 94     .word _off007_94A2_6B     ; ХЗ игрок бежит / tsubasa бежит к drive tiger / masao kazuo бежит для skylb twin shot
- D - I - - 0x028A50 14:8A40: BC 94     .word _off007_94BC_6C     ; игрок принимает ничейный низкий мяч на ногу
- D - I - - 0x028A52 14:8A42: F4 94     .word _off007_94F4_6D     ; игрок принимает ничейный высокий мяч на тело
- D - I - - 0x028A54 14:8A44: 2C 95     .word _off007_952C_6E     ; игрок делает верхний through
- D - I - - 0x028A56 14:8A46: 49 95     .word _off007_9549_6F     ; игрок делает нижний through
- D - I - - 0x028A58 14:8A48: 79 95     .word _off007_9579_70     ; ХЗ полет мяча
- D - I - - 0x028A5A 14:8A4A: 87 95     .word _off007_9587_71     ; игрок прыгает в воздух (вблизи, средняя скорость, почти идентично 64)
- - - - - - 0x028A5C 14:8A4C: 98 95     .word _off007_9598_72     ; ! найден 1 случай в сценарии, какой-то полет мяча
- D - I - - 0x028A5E 14:8A4E: A6 95     .word _off007_95A6_73     ; полет rising dragon kick
- D - I - - 0x028A60 14:8A50: B4 95     .word _off007_95B4_74     ; полет foward somersault
- D - I - - 0x028A62 14:8A52: E6 95     .word _off007_95E6_75     ; лицо вакабаяши во время крита
- D - I - - 0x028A64 14:8A54: F5 95     .word _off007_95F5_76     ; подкат masao / kazuo
- D - I - - 0x028A66 14:8A56: 03 96     .word _off007_9603_77     ; кипер делает пас после ловли мяча
- D - I - - 0x028A68 14:8A58: 18 96     .word _off007_9618_78     ; игрок принимает возвращаемую перепасовку на ногу
- D - I - - 0x028A6A 14:8A5A: 51 96     .word _off007_9651_79     ; глаза tsubasa в одной точке
- D - I - - 0x028A6C 14:8A5C: 5F 96     .word _off007_965F_7A     ; игрок принимает верхний пас на грудь
- D - I - - 0x028A6E 14:8A5E: 89 96     .word _off007_9689_7B     ; мяч быстро летит во время перепасовки
- D - I - - 0x028A70 14:8A60: 97 96     .word _off007_9697_7C     ; игрок возвращает перепасовку
- D - I - - 0x028A72 14:8A62: D2 96     .word _off007_96D2_7D     ; dark illusion
- D - I - - 0x028A74 14:8A64: 3B 97     .word _off007_973B_7E     ; мяч закатывается в аут
- D - I - - 0x028A76 14:8A66: 49 97     .word _off007_9749_7F     ; кипер делает пас во время goal kick
- D - I - - 0x028A78 14:8A68: 60 97     .word _off007_9760_80     ; мяч отскакивает от земли
- D - I - - 0x028A7A 14:8A6A: 6E 97     .word _off007_976E_81     ; игрок выбрасывает мяч руками во время throw in
- D - I - - 0x028A7C 14:8A6C: 84 97     .word _off007_9784_82     ; игрок бьет крученый удар во время corner kick
- D - I - - 0x028A7E 14:8A6E: 98 97     .word _off007_9798_83     ; игрок делает пас во время corner kick
- D - I - - 0x028A80 14:8A70: AF 97     .word _off007_97AF_84     ; полет shoot финальный
- D - I - - 0x028A82 14:8A72: BD 97     .word _off007_97BD_85     ; мяч стоит перед кипером на 11м penalty kick
- D - I - - 0x028A84 14:8A74: D1 97     .word _off007_97D1_86     ; в пк кипер прыгает в сторону мяча влево/вправо
- D - I - - 0x028A86 14:8A76: E7 97     .word _off007_97E7_87     ; в пк кипер прыгает в сторону, мяч летит совсем в другой угол
- D - I - - 0x028A88 14:8A78: F7 97     .word _off007_97F7_88     ; в пк кипер прыгает в сторону, мяч летит прямо
- D - I - - 0x028A8A 14:8A7A: 07 98     .word _off007_9807_89     ; в пк кипер стоит прямо, мяч после удара летит влево / вправо
- D - I - - 0x028A8C 14:8A7C: 17 98     .word _off007_9817_8A     ; в пк кипер стоит прямо, мяч после удара летит прямо
- D - I - - 0x028A8E 14:8A7E: 27 98     .word _off007_9827_8B     ; игрок завис вдалеке с мячом на земле когда на него напали
- D - I - - 0x028A90 14:8A80: 35 98     .word _off007_9835_8C     ; удар по мячу спешалом
- D - I - - 0x028A92 14:8A82: 63 98     .word _off007_9863_8D     ; игрок завис вдалеке с мячом в воздухе на штрафнойц
- D - I - - 0x028A94 14:8A84: 71 98     .word _off007_9871_8E     ; замах drive shot
- D - I - - 0x028A96 14:8A86: 85 98     .word _off007_9885_8F     ; рефери смотрит на часы
- D - I - - 0x028A98 14:8A88: AB 98     .word _off007_98AB_90     ; бег игрока с мячом по полю во время передвижения
- D - I - - 0x028A9A 14:8A8A: C5 98     .word _off007_98C5_91     ; лицо tsubasa
- D - I - - 0x028A9C 14:8A8C: D4 98     .word _off007_98D4_92     ; tsubasa возвращает перепасовку
- D - I - - 0x028A9E 14:8A8E: 13 99     .word _off007_9913_93     ; лицо renato
- D - I - - 0x028AA0 14:8A90: 22 99     .word _off007_9922_94     ; лицо morisaki
- D - I - - 0x028AA2 14:8A92: 31 99     .word _off007_9931_95     ; misaki возвращает перепасовку
- D - I - - 0x028AA4 14:8A94: 6C 99     .word _off007_996C_96     ; лицо misaki
- D - I - - 0x028AA6 14:8A96: 7B 99     .word _off007_997B_97     ; лицо misaki
- D - I - - 0x028AA8 14:8A98: 81 99     .word _off007_9981_98     ; лицо ishizaki
- D - I - - 0x028AAA 14:8A9A: 90 99     .word _off007_9990_99     ; лицо ishizaki
- D - I - - 0x028AAC 14:8A9C: 96 99     .word _off007_9996_9A     ; лицо nitta
- - - - - - 0x028AAE 14:8A9E: A5 99     .word _off007_99A5_9B     ; лицо nitta
- D - I - - 0x028AB0 14:8AA0: AB 99     .word _off007_99AB_9C     ; лицо masao / kazuo
- D - I - - 0x028AB2 14:8AA2: B1 99     .word _off007_99B1_9D     ; замах slider shot / razor shot
- D - I - - 0x028AB4 14:8AA4: D4 99     .word _off007_99D4_9E     ; лицо hyuga
- D - I - - 0x028AB6 14:8AA6: DA 99     .word _off007_99DA_9F     ; лицо soda
- D - I - - 0x028AB8 14:8AA8: E0 99     .word _off007_99E0_A0     ; лицо jito
- D - I - - 0x028ABA 14:8AAA: E6 99     .word _off007_99E6_A1     ; лицо matsuyama
- - - - - - 0x028ABC 14:8AAC: EC 99     .word _off007_99EC_A2     ; лицо sawada
- D - I - - 0x028ABE 14:8AAE: F2 99     .word _off007_99F2_A3     ; лицо misugi
- D - I - - 0x028AC0 14:8AB0: F8 99     .word _off007_99F8_A4     ; лицо wakabayashi
- D - I - - 0x028AC2 14:8AB2: 07 9A     .word _off007_9A07_A5     ; hyuga возвращает перепасовку
- D - I - - 0x028AC4 14:8AB4: 42 9A     .word _off007_9A42_A6     ; лицо wakashimazu
- D - I - - 0x028AC6 14:8AB6: 50 9A     .word _off007_9A50_A7     ; sawada / napoleon возвращает перепасовку
- D - I - - 0x028AC8 14:8AB8: 8B 9A     .word _off007_9A8B_A8     ; лицо meon
- D - I - - 0x028ACA 14:8ABA: 9A 9A     .word _off007_9A9A_A9     ; лицо carlos
- D - I - - 0x028ACC 14:8ABC: A0 9A     .word _off007_9AA0_AA     ; лицо jito
- D - I - - 0x028ACE 14:8ABE: AF 9A     .word _off007_9AAF_AB     ; лицо masao / kazuo
- D - I - - 0x028AD0 14:8AC0: BE 9A     .word _off007_9ABE_AC     ; игрок прыгает в воздух (вблизи, средняя скорость, чуть правее 64 и 71)
- D - I - - 0x028AD2 14:8AC2: D5 9A     .word _off007_9AD5_AD     ; лицо soda
- D - I - - 0x028AD4 14:8AC4: E4 9A     .word _off007_9AE4_AE     ; лицо misugi
- D - I - - 0x028AD6 14:8AC6: F3 9A     .word _off007_9AF3_AF     ; лицо matsuyama
- D - I - - 0x028AD8 14:8AC8: 02 9B     .word _off007_9B02_B0     ; лицо hyuga
- D - I - - 0x028ADA 14:8ACA: 11 9B     .word _off007_9B11_B1     ; лицо sawada
- D - I - - 0x028ADC 14:8ACC: 20 9B     .word _off007_9B20_B2     ; лицо victorino
- D - I - - 0x028ADE 14:8ACE: 2F 9B     .word _off007_9B2F_B3     ; лицо kaltz
- D - I - - 0x028AE0 14:8AD0: 35 9B     .word _off007_9B35_B4     ; лицо napoleon
- D - I - - 0x028AE2 14:8AD2: 44 9B     .word _off007_9B44_B5     ; лицо pierre
- D - I - - 0x028AE4 14:8AD4: 53 9B     .word _off007_9B53_B6     ; лицо pascal
- D - I - - 0x028AE6 14:8AD6: 62 9B     .word _off007_9B62_B7     ; лицо diaz
- D - I - - 0x028AE8 14:8AD8: 71 9B     .word _off007_9B71_B8     ; лицо schneider
- D - I - - 0x028AEA 14:8ADA: 80 9B     .word _off007_9B80_B9     ; лицо kaltz
- D - I - - 0x028AEC 14:8ADC: 8F 9B     .word _off007_9B8F_BA     ; лицо schester
- D - I - - 0x028AEE 14:8ADE: 9E 9B     .word _off007_9B9E_BB     ; лицо carlos бразилия
- D - I - - 0x028AF0 14:8AE0: AD 9B     .word _off007_9BAD_BC     ; лицо coimbra
- D - I - - 0x028AF2 14:8AE2: BC 9B     .word _off007_9BBC_BD     ; лицо ishizaki face block 
- - - - - - 0x028AF4 14:8AE4: CB 9B     .word _off007_9BCB_BE     ; diaz возвращает перепасовку
- D - I - - 0x028AF6 14:8AE6: 06 9C     .word _off007_9C06_BF     ; overhead
- D - I - - 0x028AF8 14:8AE8: 38 9C     .word _off007_9C38_C0     ; masao kazuo стоят один на другом
- D - I - - 0x028AFA 14:8AEA: 46 9C     .word _off007_9C46_C1     ; полет masao / kazuo с тонкими ногами (аналогично 4B)
- D - I - - 0x028AFC 14:8AEC: 54 9C     .word _off007_9C54_C2     ; masao kazuo стоят на jito
- D - I - - 0x028AFE 14:8AEE: 62 9C     .word _off007_9C62_C3     ; masao kazuo летят вдвоем
- D - I - - 0x028B00 14:8AF0: 70 9C     .word _off007_9C70_C4     ; замах jumping volley
- D - I - - 0x028B02 14:8AF2: 93 9C     .word _off007_9C93_C5     ; мяч улетает от игрока после jumping volley / booster shot
- D - I - - 0x028B04 14:8AF4: AD 9C     .word _off007_9CAD_C6     ; tsubasa подкидывает грудью мяч перед cyclone
- D - I - - 0x028B06 14:8AF6: D7 9C     .word _off007_9CD7_C7     ; замах cyclone
- D - I - - 0x028B08 14:8AF8: FB 9C     .word _off007_9CFB_C8     ; замах booster shot toninho
- D - I - - 0x028B0A 14:8AFA: 0F 9D     .word _off007_9D0F_C9     ; замах rising dragon kick
- D - I - - 0x028B0C 14:8AFC: 34 9D     .word _off007_9D34_CA     ; замах rocket header
- D - I - - 0x028B0E 14:8AFE: 79 9D     .word _off007_9D79_CB     ; li brothers стоят перед rising dragon kick
- D - I - - 0x028B10 14:8B00: 87 9D     .word _off007_9D87_CC     ; diaz перед foward somersault
- D - I - - 0x028B12 14:8B02: A4 9D     .word _off007_9DA4_CD     ; foward somersault
- D - I - - 0x028B14 14:8B04: B8 9D     .word _off007_9DB8_CE     ; замах razor pass / pazor shot / razor tackle (палка пибика)
- D - I - - 0x028B16 14:8B06: E9 9D     .word _off007_9DE9_CF     ; ishizaki летит перед face block
- D - I - - 0x028B18 14:8B08: 07 9E     .word _off007_9E07_D0     ; forcible dribble
- D - I - - 0x028B1A 14:8B0A: 21 9E     .word _off007_9E21_D1     ; high speed dribble / vanishing feint / hedgehog dribble
- D - I - - 0x028B1C 14:8B0C: 3B 9E     .word _off007_9E3B_D2     ; high speed dribble / vanishing feint / hedgehog dribble
- D - I - - 0x028B1E 14:8B0E: 55 9E     .word _off007_9E55_D3     ; meon не может отбить drove overhead
- D - I - - 0x028B20 14:8B10: 6B 9E     .word _off007_9E6B_D4     ; лицо pierre перед slider cannon (озарение)
- D - I - - 0x028B22 14:8B12: 7A 9E     .word _off007_9E7A_D5     ; лицо napoleon перед slider cannon (озарение)
- D - I - - 0x028B24 14:8B14: 89 9E     .word _off007_9E89_D6     ; golden twin shot
- D - I - - 0x028B26 14:8B16: 97 9E     .word _off007_9E97_D7     ; drive tiger twin shot
- D - I - - 0x028B28 14:8B18: A5 9E     .word _off007_9EA5_D8     ; skylab twin shot
- D - I - - 0x028B2A 14:8B1A: B3 9E     .word _off007_9EB3_D9     ; korea twin shot
- D - I - - 0x028B2C 14:8B1C: C1 9E     .word _off007_9EC1_DA     ; кипер ждет в воротах вместо dive
- D - I - - 0x028B2E 14:8B1E: CF 9E     .word _off007_9ECF_DB     ; замах slider cannon
- D - I - - 0x028B30 14:8B20: 1F 9F     .word _off007_9F1F_DC     ; после удара twin shot
- D - I - - 0x028B32 14:8B22: 3C 9F     .word _off007_9F3C_DD     ; clone dribble
- D - I - - 0x028B34 14:8B24: 56 9F     .word _off007_9F56_DE     ; глаза tsubasa в медленном движении
- - - - - - 0x028B36 14:8B26: 6D 9F     .word _off007_9F6D_DF     ; pascal возвращает перепасовку
- D - I - - 0x028B38 14:8B28: A8 9F     .word _off007_9FA8_E0     ; tsubasa стоит спиной
- D - I - - 0x028B3A 14:8B2A: C4 9F     .word _off007_9FC4_E1     ; masao kazuo зеленые один на другом
- D - I - - 0x028B3C 14:8B2C: C9 9F     .word _off007_9FC9_E2     ; heel lift
- D - I - - 0x028B3E 14:8B2E: 4C A0     .word _off007_A04C_E3     ; ? бег игрока перед power block
- D - I - - 0x028B40 14:8B30: 66 A0     .word _off007_A066_E4     ; heel lift мяч приземляется к tsubasa
- D - I - - 0x028B42 14:8B32: 8F A0     .word _off007_A08F_E5     ; мяч подлетает вверх перед ударом по нему cyclone
- D - I - - 0x028B44 14:8B34: A3 A0     .word _off007_A0A3_E6     ; игрок принимает нижний пас на ногу (почти идентично 78)
- D - I - - 0x028B46 14:8B36: A8 A0     .word _off007_A0A8_E7     ; hyuga бежит к drive tiger
- D - I - - 0x028B48 14:8B38: BE A0     .word _off007_A0BE_E8     ; sano бьет головой в sano combo
- D - I - - 0x028B4A 14:8B3A: EA A0     .word _off007_A0EA_E9     ; удар booster shot toninho
- D - I - - 0x028B4C 14:8B3C: F8 A0     .word _off007_A0F8_EA     ; jito готовится делать skylab twin shot
- D - I - - 0x028B4E 14:8B3E: 06 A1     .word _off007_A106_EB     ; pierre прыгает для slider cannon
- D - I - - 0x028B50 14:8B40: 1D A1     .word _off007_A11D_EC     ; napoleon прыгает для slider cannon
- D - I - - 0x028B52 14:8B42: 30 A1     .word _off007_A130_ED     ; tsubasa прыгает для drive overhead
- D - I - - 0x028B54 14:8B44: 3E A1     .word _off007_A13E_EE     ; pierre возвращает перепасовку
- D - I - - 0x028B56 14:8B46: 79 A1     .word _off007_A179_EF     ; masao kazuo возвращает перепасовку



con_F0              = $F0 ; выход
con_F1              = $F1 ; 
; unused            = $F2 ; 
; unused            = $F3 ; 
con_F4              = $F4 ; 4 банка спрайтов
con_F5              = $F5 ; 
con_F6              = $F6 ; 
con_F7              = $F7 ; 
con_F8              = $F8 ; прыжок
con_F9              = $F9 ; ? пауза
con_FA              = $FA ; ? выход из паузы
con_FB              = $FB ; 



_off007_8B48_00:
- D - I - - 0x028B58 14:8B48: F5        .byte con_F5, $0B
- D - I - - 0x028B5A 14:8B4A: F4        .byte con_F4, $1F, $00, $00, $00
- D - I - - 0x028B5F 14:8B4F: F6        .byte con_F6, $00
- D - I - - 0x028B61 14:8B51: F6        .byte con_F6, $15
- D - I - - 0x028B63 14:8B53: F6        .byte con_F6, $2A
- D - I - - 0x028B65 14:8B55: F6        .byte con_F6, $3F
- D - I - - 0x028B67 14:8B57: F6        .byte con_F6, $54
- D - I - - 0x028B69 14:8B59: F6        .byte con_F6, $69
- D - I - - 0x028B6B 14:8B5B: F0        .byte con_F0

_off007_8B5C_01:
- D - I - - 0x028B6C 14:8B5C: F5        .byte con_F5, $09
- D - I - - 0x028B6E 14:8B5E: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028B73 14:8B63: F1        .byte con_F1, $0B, $BA, $B8, $F3, $00
- D - I - - 0x028B79 14:8B69: F0        .byte con_F0

_off007_8B6A_02:
- D - I - - 0x028B7A 14:8B6A: F5        .byte con_F5, $83
- D - I - - 0x028B7C 14:8B6C: F4        .byte con_F4, $12, $00, $00, $00
- D - I - - 0x028B81 14:8B71: F1        .byte con_F1, $00, $01, $00, $C3, $01
- D - I - - 0x028B87 14:8B77: F0        .byte con_F0

_off007_8B78_03:
- D - I - - 0x028B88 14:8B78: F5        .byte con_F5, $83
- D - I - - 0x028B8A 14:8B7A: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028B8F 14:8B7F: F1        .byte con_F1, $46, $40, $E8, $BB, $00
- D - I - - 0x028B95 14:8B85: F0        .byte con_F0

_off007_8B86_04:
- D - I - - 0x028B96 14:8B86: F5        .byte con_F5, $83
- D - I - - 0x028B98 14:8B88: F4        .byte con_F4, $18, $19, $1A, $2B
- D - I - - 0x028B9D 14:8B8D: F1        .byte con_F1, $37, $05, $18, $CB, $01
- D - I - - 0x028BA3 14:8B93: F0        .byte con_F0

_off007_8B94_05:
- D - I - - 0x028BA4 14:8B94: F5        .byte con_F5, $81
- D - I - - 0x028BA6 14:8B96: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028BAB 14:8B9B: F1        .byte con_F1, $02, $07, $E4, $CF, $00
- D - I - - 0x028BB1 14:8BA1: F1        .byte con_F1, $01, $06, $F8, $BB, $04
off_8BA7:
- D - I - - 0x028BB7 14:8BA7: 01        .byte $01
- D - I - - 0x028BB8 14:8BA8: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028BBC 14:8BAC: 01        .byte $01
- D - I - - 0x028BBD 14:8BAD: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028BC1 14:8BB1: F8        .byte con_F8
- D - I - - 0x028BC2 14:8BB2: A7 8B     .word off_8BA7

_off007_8BB4_06:
- D - I - - 0x028BC4 14:8BB4: F5        .byte con_F5, $81
- D - I - - 0x028BC6 14:8BB6: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028BCB 14:8BBB: F1        .byte con_F1, $04, $07, $50, $04, $02
- D - I - - 0x028BD1 14:8BC1: F1        .byte con_F1, $03, $06, $10, $B3, $05
- D - I - - 0x028BD7 14:8BC7: F8        .byte con_F8
- D - I - - 0x028BD8 14:8BC8: A7 8B     .word off_8BA7

_off007_8BCA_07:
- D - I - - 0x028BDA 14:8BCA: F5        .byte con_F5, $81
- D - I - - 0x028BDC 14:8BCC: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028BE1 14:8BD1: F1        .byte con_F1, $06, $07, $58, $EF, $00
- D - I - - 0x028BE7 14:8BD7: F1        .byte con_F1, $05, $06, $10, $B3, $05
- D - I - - 0x028BED 14:8BDD: F8        .byte con_F8
- D - I - - 0x028BEE 14:8BDE: A7 8B     .word off_8BA7

_off007_8BE0_08:
- D - I - - 0x028BF0 14:8BE0: F5        .byte con_F5, $81
- D - I - - 0x028BF2 14:8BE2: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028BF7 14:8BE7: F1        .byte con_F1, $00, $08, $F8, $BB, $00
- D - I - - 0x028BFD 14:8BED: F0        .byte con_F0

_off007_8BEE_09:
- D - I - - 0x028BFE 14:8BEE: F5        .byte con_F5, $81
- D - I - - 0x028C00 14:8BF0: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028C05 14:8BF5: F1        .byte con_F1, $09, $07, $32, $FE, $00
- D - I - - 0x028C0B 14:8BFB: F1        .byte con_F1, $DA, $06, $11, $B2, $05
- D - I - - 0x028C11 14:8C01: F8        .byte con_F8
- D - I - - 0x028C12 14:8C02: A7 8B     .word off_8BA7

_off007_8C04_0A:
- - - - - - 0x028C14 14:8C04: F5        .byte con_F5, $09
- - - - - - 0x028C16 14:8C06: F4        .byte con_F4, $04, $05, $00, $00
- - - - - - 0x028C1B 14:8C0B: F1        .byte con_F1, $0D, $C4, $98, $E3, $00
- - - - - - 0x028C21 14:8C11: F0        .byte con_F0

_off007_8C12_0B:
- D - I - - 0x028C22 14:8C12: F5        .byte con_F5, $81
- D - I - - 0x028C24 14:8C14: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028C29 14:8C19: F1        .byte con_F1, $0A, $0A, $F0, $BB, $00
- D - I - - 0x028C2F 14:8C1F: F1        .byte con_F1, $01, $09, $F8, $BB, $04
- D - I - - 0x028C35 14:8C25: F8        .byte con_F8
- D - I - - 0x028C36 14:8C26: A7 8B     .word off_8BA7

_off007_8C28_0C:
- D - I - - 0x028C38 14:8C28: F5        .byte con_F5, $81
- D - I - - 0x028C3A 14:8C2A: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028C3F 14:8C2F: F1        .byte con_F1, $05, $09, $10, $B3, $05
- D - I - - 0x028C45 14:8C35: F1        .byte con_F1, $06, $0A, $58, $EF, $00
- D - I - - 0x028C4B 14:8C3B: F0        .byte con_F0

_off007_8C3C_0D:
- D - I - - 0x028C4C 14:8C3C: F5        .byte con_F5, $81
- D - I - - 0x028C4E 14:8C3E: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028C53 14:8C43: F1        .byte con_F1, $00, $3A, $F8, $BB, $00
- D - I - - 0x028C59 14:8C49: F0        .byte con_F0

_off007_8C4A_0E:
- D - I - - 0x028C5A 14:8C4A: F5        .byte con_F5, $09
- D - I - - 0x028C5C 14:8C4C: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028C61 14:8C51: F7        .byte con_F7, $03, $7B
- D - I - - 0x028C64 14:8C54: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028C6A 14:8C5A: F1        .byte con_F1, $3B, $BA, $D0, $C3, $04
- D - I - - 0x028C70 14:8C60: F0        .byte con_F0

_off007_8C61_0F:
- D - I - - 0x028C71 14:8C61: F5        .byte con_F5, $09
- D - I - - 0x028C73 14:8C63: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028C78 14:8C68: F7        .byte con_F7, $03, $7B
- D - I - - 0x028C7B 14:8C6B: F1        .byte con_F1, $3C, $CF, $E0, $7B, $04
- D - I - - 0x028C81 14:8C71: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028C87 14:8C77: F0        .byte con_F0

_off007_8C78_10:
- D - I - - 0x028C88 14:8C78: F5        .byte con_F5, $09
- D - I - - 0x028C8A 14:8C7A: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028C8F 14:8C7F: F1        .byte con_F1, $48, $C4, $98, $A4, $00
- D - I - - 0x028C95 14:8C85: F0        .byte con_F0

_off007_8C86_11:
- D - I - - 0x028C96 14:8C86: F5        .byte con_F5, $09
- D - I - - 0x028C98 14:8C88: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028C9D 14:8C8D: F1        .byte con_F1, $00, $BA, $00, $C3, $01
- D - I - - 0x028CA3 14:8C93: F0        .byte con_F0

_off007_8C94_12:
- D - I - - 0x028CA4 14:8C94: F5        .byte con_F5, $09
- D - I - - 0x028CA6 14:8C96: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028CAB 14:8C9B: F1        .byte con_F1, $5F, $CF, $98, $AB, $00
- D - I - - 0x028CB1 14:8CA1: F0        .byte con_F0

_off007_8CA2_13:
- D - I - - 0x028CB2 14:8CA2: F5        .byte con_F5, $81
- D - I - - 0x028CB4 14:8CA4: F4        .byte con_F4, $1C, $1D, $00, $00
- D - I - - 0x028CB9 14:8CA9: F7        .byte con_F7, $03, $7B
- D - I - - 0x028CBC 14:8CAC: F1        .byte con_F1, $76, $0D, $80, $23, $06
- D - I - - 0x028CC2 14:8CB2: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028CC8 14:8CB8: F0        .byte con_F0

_off007_8CB9_14:
- D - I - - 0x028CC9 14:8CB9: F5        .byte con_F5, $81
- D - I - - 0x028CCB 14:8CBB: F4        .byte con_F4, $1C, $1D, $00, $00
- D - I - - 0x028CD0 14:8CC0: F7        .byte con_F7, $03, $7B
- D - I - - 0x028CD3 14:8CC3: F1        .byte con_F1, $76, $0F, $80, $23, $06
- D - I - - 0x028CD9 14:8CC9: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028CDF 14:8CCF: F0        .byte con_F0

_off007_8CD0_15:
- D - I - - 0x028CE0 14:8CD0: F5        .byte con_F5, $81
- D - I - - 0x028CE2 14:8CD2: F4        .byte con_F4, $28, $29, $2A, $0B
- D - I - - 0x028CE7 14:8CD7: F1        .byte con_F1, $0E, $3C, $E8, $BB, $00
- D - I - - 0x028CED 14:8CDD: F0        .byte con_F0

_off007_8CDE_16:
- D - I - - 0x028CEE 14:8CDE: F5        .byte con_F5, $83
- D - I - - 0x028CF0 14:8CE0: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028CF5 14:8CE5: F1        .byte con_F1, $99, $40, $D0, $BB, $00
- D - I - - 0x028CFB 14:8CEB: F0        .byte con_F0

_off007_8CEC_17:
- D - I - - 0x028CFC 14:8CEC: F5        .byte con_F5, $83
- D - I - - 0x028CFE 14:8CEE: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028D03 14:8CF3: F1        .byte con_F1, $11, $15, $64, $EF, $00
- D - I - - 0x028D09 14:8CF9: F1        .byte con_F1, $9A, $14, $CE, $B7, $04
- D - I - - 0x028D0F 14:8CFF: 1E        .byte $1E
- D - I - - 0x028D10 14:8D00: F6        .byte con_F6, $00
- D - I - - 0x028D12 14:8D02: F1        .byte con_F1, $10, $40, $E8, $BB, $04
- D - I - - 0x028D18 14:8D08: F0        .byte con_F0

_off007_8D09_18:
- D - I - - 0x028D19 14:8D09: F5        .byte con_F5, $83
- D - I - - 0x028D1B 14:8D0B: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028D20 14:8D10: F1        .byte con_F1, $12, $15, $40, $CB, $00
- D - I - - 0x028D26 14:8D16: F1        .byte con_F1, $9B, $14, $DC, $C6, $04
- D - I - - 0x028D2C 14:8D1C: F8        .byte con_F8
- D - I - - 0x028D2D 14:8D1D: A7 8B     .word off_8BA7

_off007_8D1F_19:
- D - I - - 0x028D2F 14:8D1F: F5        .byte con_F5, $80
- D - I - - 0x028D31 14:8D21: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x028D36 14:8D26: F7        .byte con_F7, $03, $7B
- D - I - - 0x028D39 14:8D29: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028D3F 14:8D2F: F1        .byte con_F1, $9D, $1E, $7C, $9F, $04
- D - I - - 0x028D45 14:8D35: F1        .byte con_F1, $24, $1D, $F0, $C3, $08
- D - I - - 0x028D4B 14:8D3B: 1E        .byte $1E
- D - I - - 0x028D4C 14:8D3C: F6        .byte con_F6, $15
- D - I - - 0x028D4E 14:8D3E: F1        .byte con_F1, $00, $47, $EB, $C1, $08
- D - I - - 0x028D54 14:8D44: 02        .byte $02
- D - I - - 0x028D55 14:8D45: F1        .byte con_F1, $E7, $1E, $FC, $B3, $04
- D - I - - 0x028D5B 14:8D4B: F1        .byte con_F1, $26, $20, $EB, $C1, $08
- D - I - - 0x028D61 14:8D51: F0        .byte con_F0

_off007_8D52_1A:
- D - I - - 0x028D62 14:8D52: F5        .byte con_F5, $09
- D - I - - 0x028D64 14:8D54: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028D69 14:8D59: F1        .byte con_F1, $60, $CF, $98, $E3, $00
- D - I - - 0x028D6F 14:8D5F: F0        .byte con_F0

_off007_8D60_1B:
- D - I - - 0x028D70 14:8D60: F5        .byte con_F5, $83
- D - I - - 0x028D72 14:8D62: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028D77 14:8D67: F1        .byte con_F1, $49, $15, $40, $CB, $00
- D - I - - 0x028D7D 14:8D6D: F1        .byte con_F1, $A5, $14, $DC, $C6, $04
- D - I - - 0x028D83 14:8D73: F9        .byte con_F9, $0F
- D - I - - 0x028D85 14:8D75: 01        .byte $01
- D - I - - 0x028D86 14:8D76: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028D8A 14:8D7A: 01        .byte $01
- D - I - - 0x028D8B 14:8D7B: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028D8F 14:8D7F: FA        .byte con_FA
- D - I - - 0x028D90 14:8D80: F6        .byte con_F6, $00
- D - I - - 0x028D92 14:8D82: F1        .byte con_F1, $4A, $40, $08, $BB, $05
- D - I - - 0x028D98 14:8D88: F0        .byte con_F0

_off007_8D89_1C:
- D - I - - 0x028D99 14:8D89: F5        .byte con_F5, $81
- D - I - - 0x028D9B 14:8D8B: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x028DA0 14:8D90: F1        .byte con_F1, $90, $2A, $00, $CB, $01
- D - I - - 0x028DA6 14:8D96: F0        .byte con_F0

_off007_8D97_1D:
- D - I - - 0x028DA7 14:8D97: F5        .byte con_F5, $09
- D - I - - 0x028DA9 14:8D99: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028DAE 14:8D9E: F1        .byte con_F1, $61, $C4, $00, $EB, $01
- D - I - - 0x028DB4 14:8DA4: F0        .byte con_F0

_off007_8DA5_1E:
- D - I - - 0x028DB5 14:8DA5: F5        .byte con_F5, $09
- D - I - - 0x028DB7 14:8DA7: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028DBC 14:8DAC: F1        .byte con_F1, $73, $72, $9F, $BB, $00
- D - I - - 0x028DC2 14:8DB2: F0        .byte con_F0

_off007_8DB3_1F:
- D - I - - 0x028DC3 14:8DB3: F5        .byte con_F5, $09
- D - I - - 0x028DC5 14:8DB5: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028DCA 14:8DBA: F1        .byte con_F1, $00, $71, $00, $BB, $01
- D - I - - 0x028DD0 14:8DC0: F0        .byte con_F0

_off007_8DC1_20:
- D - I - - 0x028DD1 14:8DC1: F5        .byte con_F5, $81
- D - I - - 0x028DD3 14:8DC3: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x028DD8 14:8DC8: F1        .byte con_F1, $38, $2A, $00, $CB, $01
- D - I - - 0x028DDE 14:8DCE: F0        .byte con_F0

_off007_8DCF_21:
- D - I - - 0x028DDF 14:8DCF: F5        .byte con_F5, $81
- D - I - - 0x028DE1 14:8DD1: F4        .byte con_F4, $28, $29, $2A, $0B
- D - I - - 0x028DE6 14:8DD6: F1        .byte con_F1, $4C, $12, $70, $CB, $00
- D - I - - 0x028DEC 14:8DDC: F1        .byte con_F1, $4B, $10, $23, $C0, $05
- D - I - - 0x028DF2 14:8DE2: F9        .byte con_F9, $0C
- D - I - - 0x028DF4 14:8DE4: 01        .byte $01
- D - I - - 0x028DF5 14:8DE5: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028DF9 14:8DE9: 01        .byte $01
- D - I - - 0x028DFA 14:8DEA: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028DFE 14:8DEE: FA        .byte con_FA
- D - I - - 0x028DFF 14:8DEF: F6        .byte con_F6, $00
- D - I - - 0x028E01 14:8DF1: F1        .byte con_F1, $00, $37, $20, $BB, $05
- D - I - - 0x028E07 14:8DF7: 02        .byte $02
- D - I - - 0x028E08 14:8DF8: F1        .byte con_F1, $DE, $12, $16, $CB, $01
- D - I - - 0x028E0E 14:8DFE: F1        .byte con_F1, $4B, $10, $20, $BB, $05
- D - I - - 0x028E14 14:8E04: F0        .byte con_F0

_off007_8E05_22:
- D - I - - 0x028E15 14:8E05: F5        .byte con_F5, $81
- D - I - - 0x028E17 14:8E07: F4        .byte con_F4, $28, $29, $2A, $2B
- D - I - - 0x028E1C 14:8E0C: F1        .byte con_F1, $4E, $12, $70, $CB, $00
- D - I - - 0x028E22 14:8E12: F1        .byte con_F1, $4D, $10, $28, $C3, $05
- D - I - - 0x028E28 14:8E18: F8        .byte con_F8
- D - I - - 0x028E29 14:8E19: A7 8B     .word off_8BA7

_off007_8E1B_23:
- D - I - - 0x028E2B 14:8E1B: F5        .byte con_F5, $83
- D - I - - 0x028E2D 14:8E1D: F4        .byte con_F4, $18, $19, $1A, $2B
- D - I - - 0x028E32 14:8E22: F7        .byte con_F7, $03, $7B
- D - I - - 0x028E35 14:8E25: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028E3B 14:8E2B: F1        .byte con_F1, $E8, $05, $F8, $C3, $04
- D - I - - 0x028E41 14:8E31: F0        .byte con_F0

_off007_8E32_24:
- D - I - - 0x028E42 14:8E32: F5        .byte con_F5, $83
- D - I - - 0x028E44 14:8E34: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028E49 14:8E39: F7        .byte con_F7, $03, $7B
- D - I - - 0x028E4C 14:8E3C: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028E52 14:8E42: F1        .byte con_F1, $14, $15, $56, $7C, $04
- D - I - - 0x028E58 14:8E48: F1        .byte con_F1, $4A, $80, $E8, $BB, $08
off_8E4E:
- D - I - - 0x028E5E 14:8E4E: 01        .byte $01
- D - I - - 0x028E5F 14:8E4F: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028E63 14:8E53: 01        .byte $01
- D - I - - 0x028E64 14:8E54: FB        .byte con_FB, $02, $13, $45
- D - I - - 0x028E68 14:8E58: F8        .byte con_F8
- D - I - - 0x028E69 14:8E59: 4E 8E     .word off_8E4E

_off007_8E5B_25:
- D - I - - 0x028E6B 14:8E5B: F5        .byte con_F5, $83
- D - I - - 0x028E6D 14:8E5D: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028E72 14:8E62: F7        .byte con_F7, $03, $7B
- D - I - - 0x028E75 14:8E65: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028E7B 14:8E6B: F1        .byte con_F1, $14, $15, $39, $7E, $04
- D - I - - 0x028E81 14:8E71: F1        .byte con_F1, $13, $17, $04, $BB, $09
- D - I - - 0x028E87 14:8E77: F8        .byte con_F8
- D - I - - 0x028E88 14:8E78: 4E 8E     .word off_8E4E

_off007_8E7A_26:
- D - I - - 0x028E8A 14:8E7A: F5        .byte con_F5, $83
- D - I - - 0x028E8C 14:8E7C: F4        .byte con_F4, $2A, $2B, $00, $00
- D - I - - 0x028E91 14:8E81: F1        .byte con_F1, $16, $04, $90, $9B, $00
- D - I - - 0x028E97 14:8E87: F1        .byte con_F1, $15, $03, $F6, $D5, $04
- D - I - - 0x028E9D 14:8E8D: F0        .byte con_F0

_off007_8E8E_27:
- D - I - - 0x028E9E 14:8E8E: F5        .byte con_F5, $83
- D - I - - 0x028EA0 14:8E90: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028EA5 14:8E95: F1        .byte con_F1, $17, $15, $39, $7E, $00
- D - I - - 0x028EAB 14:8E9B: F1        .byte con_F1, $52, $17, $02, $BD, $05
- D - I - - 0x028EB1 14:8EA1: F9        .byte con_F9, $0F
- D - I - - 0x028EB3 14:8EA3: 01        .byte $01
- D - I - - 0x028EB4 14:8EA4: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028EB8 14:8EA8: 01        .byte $01
- D - I - - 0x028EB9 14:8EA9: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028EBD 14:8EAD: FA        .byte con_FA
- D - I - - 0x028EBE 14:8EAE: F6        .byte con_F6, $00
- D - I - - 0x028EC0 14:8EB0: F1        .byte con_F1, $00, $CE, $F4, $C3, $04
- D - I - - 0x028EC6 14:8EB6: 04        .byte $04
- D - I - - 0x028EC7 14:8EB7: F1        .byte con_F1, $1B, $15, $E6, $DD, $00
- D - I - - 0x028ECD 14:8EBD: F1        .byte con_F1, $53, $17, $F4, $C3, $04
- D - I - - 0x028ED3 14:8EC3: F8        .byte con_F8
- D - I - - 0x028ED4 14:8EC4: A7 8B     .word off_8BA7

_off007_8EC6_28:
- D - I - - 0x028ED6 14:8EC6: F5        .byte con_F5, $09
- D - I - - 0x028ED8 14:8EC8: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028EDD 14:8ECD: F7        .byte con_F7, $03, $73
- D - I - - 0x028EE0 14:8ED0: F1        .byte con_F1, $75, $71, $00, $C3, $01
- D - I - - 0x028EE6 14:8ED6: 0A        .byte $0A
- D - I - - 0x028EE7 14:8ED7: F1        .byte con_F1, $D9, $71, $00, $C3, $05
- D - I - - 0x028EED 14:8EDD: 0A        .byte $0A
- D - I - - 0x028EEE 14:8EDE: F1        .byte con_F1, $00, $71, $00, $C3, $09
- D - I - - 0x028EF4 14:8EE4: F0        .byte con_F0

_off007_8EE5_29:
- D - I - - 0x028EF5 14:8EE5: F5        .byte con_F5, $09
- D - I - - 0x028EF7 14:8EE7: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028EFC 14:8EEC: F1        .byte con_F1, $87, $71, $00, $EB, $01
- D - I - - 0x028F02 14:8EF2: F0        .byte con_F0

_off007_8EF3_2A:
- D - I - - 0x028F03 14:8EF3: F5        .byte con_F5, $83
- D - I - - 0x028F05 14:8EF5: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028F0A 14:8EFA: F1        .byte con_F1, $17, $15, $56, $7C, $00
- D - I - - 0x028F10 14:8F00: F1        .byte con_F1, $08, $80, $E6, $BC, $04
- D - I - - 0x028F16 14:8F06: F9        .byte con_F9, $0F
- D - I - - 0x028F18 14:8F08: 01        .byte $01
- D - I - - 0x028F19 14:8F09: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028F1D 14:8F0D: 01        .byte $01
- D - I - - 0x028F1E 14:8F0E: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028F22 14:8F12: FA        .byte con_FA
- D - I - - 0x028F23 14:8F13: F6        .byte con_F6, $00
- D - I - - 0x028F25 14:8F15: F1        .byte con_F1, $00, $7F, $F8, $C3, $04
- D - I - - 0x028F2B 14:8F1B: 04        .byte $04
- D - I - - 0x028F2C 14:8F1C: F1        .byte con_F1, $1B, $15, $06, $DD, $01
- D - I - - 0x028F32 14:8F22: F1        .byte con_F1, $1C, $80, $F8, $C3, $04
- D - I - - 0x028F38 14:8F28: F0        .byte con_F0

_off007_8F29_2B:
- D - I - - 0x028F39 14:8F29: F5        .byte con_F5, $83
- D - I - - 0x028F3B 14:8F2B: F4        .byte con_F4, $2A, $2B, $00, $00
- D - I - - 0x028F40 14:8F30: F1        .byte con_F1, $19, $04, $90, $9B, $00
- D - I - - 0x028F46 14:8F36: F1        .byte con_F1, $18, $03, $FA, $D0, $04
- D - I - - 0x028F4C 14:8F3C: 1E        .byte $1E
- D - I - - 0x028F4D 14:8F3D: F6        .byte con_F6, $00
- D - I - - 0x028F4F 14:8F3F: F1        .byte con_F1, $00, $3E, $00, $CB, $05
- D - I - - 0x028F55 14:8F45: 04        .byte $04
- D - I - - 0x028F56 14:8F46: F1        .byte con_F1, $1D, $04, $1C, $AB, $01
- D - I - - 0x028F5C 14:8F4C: F1        .byte con_F1, $18, $03, $00, $CB, $05
- D - I - - 0x028F62 14:8F52: F0        .byte con_F0

_off007_8F53_2C:
- D - I - - 0x028F63 14:8F53: F5        .byte con_F5, $83
- D - I - - 0x028F65 14:8F55: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x028F6A 14:8F5A: F1        .byte con_F1, $17, $15, $56, $7C, $00
- D - I - - 0x028F70 14:8F60: F1        .byte con_F1, $08, $80, $E6, $BC, $04
- D - I - - 0x028F76 14:8F66: F9        .byte con_F9, $0F
- D - I - - 0x028F78 14:8F68: 01        .byte $01
- D - I - - 0x028F79 14:8F69: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x028F7D 14:8F6D: 01        .byte $01
- D - I - - 0x028F7E 14:8F6E: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x028F82 14:8F72: FA        .byte con_FA
- D - I - - 0x028F83 14:8F73: F6        .byte con_F6, $00
- D - I - - 0x028F85 14:8F75: F1        .byte con_F1, $00, $7F, $F8, $C3, $04
- D - I - - 0x028F8B 14:8F7B: F0        .byte con_F0

_off007_8F7C_2D:
- D - I - - 0x028F8C 14:8F7C: F5        .byte con_F5, $83
- D - I - - 0x028F8E 14:8F7E: F4        .byte con_F4, $2A, $2B, $00, $00
- D - I - - 0x028F93 14:8F83: F1        .byte con_F1, $19, $04, $90, $9B, $00
- D - I - - 0x028F99 14:8F89: F1        .byte con_F1, $18, $03, $FA, $D0, $04
- D - I - - 0x028F9F 14:8F8F: 1E        .byte $1E
- D - I - - 0x028FA0 14:8F90: F6        .byte con_F6, $00
- D - I - - 0x028FA2 14:8F92: F1        .byte con_F1, $00, $3E, $00, $CB, $05
- D - I - - 0x028FA8 14:8F98: F0        .byte con_F0

_off007_8F99_2E:
- D - I - - 0x028FA9 14:8F99: F5        .byte con_F5, $81
- D - I - - 0x028FAB 14:8F9B: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028FB0 14:8FA0: F1        .byte con_F1, $9C, $38, $08, $BB, $01
- D - I - - 0x028FB6 14:8FA6: F0        .byte con_F0

_off007_8FA7_2F:
- D - I - - 0x028FB7 14:8FA7: F5        .byte con_F5, $09
- D - I - - 0x028FB9 14:8FA9: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028FBE 14:8FAE: F7        .byte con_F7, $03, $7B
- D - I - - 0x028FC1 14:8FB1: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x028FC7 14:8FB7: F1        .byte con_F1, $88, $71, $D0, $C3, $04
- D - I - - 0x028FCD 14:8FBD: F0        .byte con_F0

_off007_8FBE_30:
- D - I - - 0x028FCE 14:8FBE: F5        .byte con_F5, $81
- D - I - - 0x028FD0 14:8FC0: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028FD5 14:8FC5: F1        .byte con_F1, $1F, $3A, $08, $BB, $01
- D - I - - 0x028FDB 14:8FCB: F0        .byte con_F0

_off007_8FCC_31:
- D - I - - 0x028FDC 14:8FCC: F5        .byte con_F5, $81
- D - I - - 0x028FDE 14:8FCE: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x028FE3 14:8FD3: F1        .byte con_F1, $04, $0A, $50, $03, $02
- D - I - - 0x028FE9 14:8FD9: F1        .byte con_F1, $03, $09, $10, $B3, $05
- D - I - - 0x028FEF 14:8FDF: F8        .byte con_F8
- D - I - - 0x028FF0 14:8FE0: A7 8B     .word off_8BA7

_off007_8FE2_32:
- D - I - - 0x028FF2 14:8FE2: F5        .byte con_F5, $09
- D - I - - 0x028FF4 14:8FE4: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x028FF9 14:8FE9: F7        .byte con_F7, $03, $7B
- D - I - - 0x028FFC 14:8FEC: F1        .byte con_F1, $89, $23, $C0, $7B, $04
- D - I - - 0x029002 14:8FF2: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029008 14:8FF8: F0        .byte con_F0

_off007_8FF9_33:
- D - I - - 0x029009 14:8FF9: F5        .byte con_F5, $81
off_8FFB:
- D - I - - 0x02900B 14:8FFB: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029010 14:9000: F1        .byte con_F1, $21, $49, $80, $8F, $00
- D - I - - 0x029016 14:9006: F1        .byte con_F1, $20, $59, $98, $BB, $04
- D - I - - 0x02901C 14:900C: F1        .byte con_F1, $20, $5A, $98, $BB, $08
- D - I - - 0x029022 14:9012: F1        .byte con_F1, $20, $5B, $98, $BB, $0C
- D - I - - 0x029028 14:9018: 2A        .byte $2A
- D - I - - 0x029029 14:9019: F4        .byte con_F4, $16, $17, $2D, $53
- D - I - - 0x02902E 14:901E: F6        .byte con_F6, $00
- D - I - - 0x029030 14:9020: F6        .byte con_F6, $2A
- D - I - - 0x029032 14:9022: F6        .byte con_F6, $3F
- D - I - - 0x029034 14:9024: F1        .byte con_F1, $00, $45, $28, $C3, $05
- D - I - - 0x02903A 14:902A: 04        .byte $04
- D - I - - 0x02903B 14:902B: F1        .byte con_F1, $23, $1A, $58, $EB, $01
- D - I - - 0x029041 14:9031: F1        .byte con_F1, $22, $18, $28, $C3, $05
- D - I - - 0x029047 14:9037: F8        .byte con_F8
- D - I - - 0x029048 14:9038: A7 8B     .word off_8BA7

_off007_903A_34:
- D - I - - 0x02904A 14:903A: F5        .byte con_F5, $81
off_903C:
- D - I - - 0x02904C 14:903C: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029051 14:9041: F7        .byte con_F7, $03, $7B
- D - I - - 0x029054 14:9044: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x02905A 14:904A: F1        .byte con_F1, $9D, $1E, $90, $97, $04
- D - I - - 0x029060 14:9050: F1        .byte con_F1, $24, $1D, $20, $C3, $09
- D - I - - 0x029066 14:9056: 1E        .byte $1E
- D - I - - 0x029067 14:9057: F6        .byte con_F6, $00
- D - I - - 0x029069 14:9059: F6        .byte con_F6, $15
- D - I - - 0x02906B 14:905B: F1        .byte con_F1, $25, $48, $10, $BB, $09
- D - I - - 0x029071 14:9061: 02        .byte $02
- D - I - - 0x029072 14:9062: F1        .byte con_F1, $27, $1E, $F4, $AB, $04
- D - I - - 0x029078 14:9068: F1        .byte con_F1, $26, $21, $08, $BB, $09
- D - I - - 0x02907E 14:906E: F0        .byte con_F0

_off007_906F_35:
- D - I - - 0x02907F 14:906F: F5        .byte con_F5, $81
- D - I - - 0x029081 14:9071: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x029086 14:9076: F1        .byte con_F1, $0C, $0A, $48, $FC, $00
- D - I - - 0x02908C 14:907C: F1        .byte con_F1, $DA, $09, $10, $B3, $05
- D - I - - 0x029092 14:9082: F9        .byte con_F9, $0F
- D - I - - 0x029094 14:9084: 01        .byte $01
- D - I - - 0x029095 14:9085: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x029099 14:9089: 01        .byte $01
- D - I - - 0x02909A 14:908A: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x02909E 14:908E: FA        .byte con_FA
- D - I - - 0x02909F 14:908F: F6        .byte con_F6, $00
- D - I - - 0x0290A1 14:9091: F1        .byte con_F1, $00, $3B, $FA, $BB, $04
- D - I - - 0x0290A7 14:9097: 04        .byte $04
- D - I - - 0x0290A8 14:9098: F1        .byte con_F1, $A6, $0A, $F2, $BB, $00
- D - I - - 0x0290AE 14:909E: F1        .byte con_F1, $26, $09, $FA, $BB, $04
- D - I - - 0x0290B4 14:90A4: F0        .byte con_F0

_off007_90A5_36:
- D - I - - 0x0290B5 14:90A5: F5        .byte con_F5, $09
- D - I - - 0x0290B7 14:90A7: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0290BC 14:90AC: F1        .byte con_F1, $8A, $BA, $00, $EB, $01
- D - I - - 0x0290C2 14:90B2: F0        .byte con_F0

_off007_90B3_37:
- D - I - - 0x0290C3 14:90B3: F5        .byte con_F5, $81
- D - I - - 0x0290C5 14:90B5: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0290CA 14:90BA: F1        .byte con_F1, $54, $4B, $B0, $BB, $01
- D - I - - 0x0290D0 14:90C0: F1        .byte con_F1, $54, $4D, $B0, $BB, $05
- D - I - - 0x0290D6 14:90C6: F1        .byte con_F1, $54, $4F, $B0, $BB, $09
- D - I - - 0x0290DC 14:90CC: F0        .byte con_F0

_off007_90CD_38:
- D - I - - 0x0290DD 14:90CD: F5        .byte con_F5, $80
- D - I - - 0x0290DF 14:90CF: F8        .byte con_F8
- D - I - - 0x0290E0 14:90D0: FB 8F     .word off_8FFB

_off007_90D2_39:
- D - I - - 0x0290E2 14:90D2: F5        .byte con_F5, $80
- D - I - - 0x0290E4 14:90D4: F8        .byte con_F8
- D - I - - 0x0290E5 14:90D5: 3C 90     .word off_903C

_off007_90D7_3A:
- D - I - - 0x0290E7 14:90D7: F5        .byte con_F5, $83
- D - I - - 0x0290E9 14:90D9: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x0290EE 14:90DE: F7        .byte con_F7, $23, $5B
- D - I - - 0x0290F1 14:90E1: F1        .byte con_F1, $00, $00, $80, $A3, $00
- D - I - - 0x0290F7 14:90E7: F1        .byte con_F1, $00, $00, $80, $DB, $04
- D - I - - 0x0290FD 14:90ED: F1        .byte con_F1, $00, $70, $00, $BB, $09
- D - I - - 0x029103 14:90F3: F1        .byte con_F1, $E5, $1B, $00, $BB, $0D
- D - I - - 0x029109 14:90F9: F1        .byte con_F1, $E6, $1F, $00, $BB, $11
- D - I - - 0x02910F 14:90FF: 96        .byte $96
- D - I - - 0x029110 14:9100: F7        .byte con_F7, $03, $7B
- D - I - - 0x029113 14:9103: F6        .byte con_F6, $00
- D - I - - 0x029115 14:9105: F6        .byte con_F6, $15
- D - I - - 0x029117 14:9107: F6        .byte con_F6, $3F
- D - I - - 0x029119 14:9109: F6        .byte con_F6, $54
- D - I - - 0x02911B 14:910B: F0        .byte con_F0

_off007_910C_3B:
- D - I - - 0x02911C 14:910C: F5        .byte con_F5, $80
- D - I - - 0x02911E 14:910E: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029123 14:9113: F7        .byte con_F7, $03, $7B
- D - I - - 0x029126 14:9116: F1        .byte con_F1, $9E, $1E, $68, $93, $05
- D - I - - 0x02912C 14:911C: F1        .byte con_F1, $28, $1C, $C8, $BB, $08
- D - I - - 0x029132 14:9122: 1E        .byte $1E
- D - I - - 0x029133 14:9123: F6        .byte con_F6, $15
- D - I - - 0x029135 14:9125: F1        .byte con_F1, $29, $47, $E0, $BB, $08
- D - I - - 0x02913B 14:912B: 02        .byte $02
- D - I - - 0x02913C 14:912C: F1        .byte con_F1, $2A, $20, $E8, $BB, $08
off_9132:
- D - I - - 0x029142 14:9132: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029148 14:9138: F1        .byte con_F1, $9F, $1E, $FC, $AB, $04
- D - I - - 0x02914E 14:913E: F8        .byte con_F8
- D - I - - 0x02914F 14:913F: 4E 8E     .word off_8E4E

_off007_9141_3C:
- D - I - - 0x029151 14:9141: F5        .byte con_F5, $09
- D - I - - 0x029153 14:9143: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029158 14:9148: F7        .byte con_F7, $23, $5B
- D - I - - 0x02915B 14:914B: F1        .byte con_F1, $8D, $CF, $98, $C3, $00
- D - I - - 0x029161 14:9151: F0        .byte con_F0

_off007_9152_3D:
- D - I - - 0x029162 14:9152: F5        .byte con_F5, $09
- D - I - - 0x029164 14:9154: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029169 14:9159: F1        .byte con_F1, $00, $EC, $00, $C3, $01
- D - I - - 0x02916F 14:915F: F0        .byte con_F0

_off007_9160_3E:
- D - I - - 0x029170 14:9160: F5        .byte con_F5, $80
- D - I - - 0x029172 14:9162: F4        .byte con_F4, $1C, $1D, $00, $00
- D - I - - 0x029177 14:9167: F7        .byte con_F7, $03, $7B
- D - I - - 0x02917A 14:916A: F1        .byte con_F1, $95, $0C, $7F, $23, $07
- D - I - - 0x029180 14:9170: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029186 14:9176: F0        .byte con_F0

_off007_9177_3F:
- D - I - - 0x029187 14:9177: F5        .byte con_F5, $80
- D - I - - 0x029189 14:9179: F4        .byte con_F4, $1C, $1D, $00, $00
- D - I - - 0x02918E 14:917E: F7        .byte con_F7, $03, $7B
- D - I - - 0x029191 14:9181: F1        .byte con_F1, $95, $0E, $7F, $23, $07
- D - I - - 0x029197 14:9187: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x02919D 14:918D: F0        .byte con_F0

_off007_918E_40:
- D - I - - 0x02919E 14:918E: F5        .byte con_F5, $09
- D - I - - 0x0291A0 14:9190: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0291A5 14:9195: F7        .byte con_F7, $03, $7B
- D - I - - 0x0291A8 14:9198: F1        .byte con_F1, $8F, $BC, $A0, $A3, $04
- D - I - - 0x0291AE 14:919E: F1        .byte con_F1, $00, $00, $78, $FB, $00
- D - I - - 0x0291B4 14:91A4: F0        .byte con_F0

_off007_91A5_41:
- D - I - - 0x0291B5 14:91A5: F5        .byte con_F5, $09
- D - I - - 0x0291B7 14:91A7: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0291BC 14:91AC: F7        .byte con_F7, $03, $7B
- D - I - - 0x0291BF 14:91AF: F1        .byte con_F1, $91, $BC, $C0, $EB, $04
- D - I - - 0x0291C5 14:91B5: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x0291CB 14:91BB: F0        .byte con_F0

_off007_91BC_42:
- D - I - - 0x0291CC 14:91BC: F5        .byte con_F5, $09
- D - I - - 0x0291CE 14:91BE: F4        .byte con_F4, $06, $00, $00, $00
- D - I - - 0x0291D3 14:91C3: F1        .byte con_F1, $77, $B4, $40, $EB, $01
- D - I - - 0x0291D9 14:91C9: F0        .byte con_F0

_off007_91CA_43:
- D - I - - 0x0291DA 14:91CA: F5        .byte con_F5, $09
- D - I - - 0x0291DC 14:91CC: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0291E1 14:91D1: F1        .byte con_F1, $00, $34, $08, $CB, $01
- D - I - - 0x0291E7 14:91D7: F0        .byte con_F0

_off007_91D8_44:
- D - I - - 0x0291E8 14:91D8: F5        .byte con_F5, $09
- D - I - - 0x0291EA 14:91DA: F4        .byte con_F4, $3B, $47, $00, $00
- D - I - - 0x0291EF 14:91DF: F1        .byte con_F1, $00, $35, $00, $CB, $01
- D - I - - 0x0291F5 14:91E5: F0        .byte con_F0

_off007_91E6_45:
- D - I - - 0x0291F6 14:91E6: F5        .byte con_F5, $09
- D - I - - 0x0291F8 14:91E8: F4        .byte con_F4, $3B, $47, $00, $00
- D - I - - 0x0291FD 14:91ED: F1        .byte con_F1, $00, $36, $00, $CB, $01
- D - I - - 0x029203 14:91F3: F0        .byte con_F0

_off007_91F4_46:
- D - I - - 0x029204 14:91F4: F5        .byte con_F5, $0B
- D - I - - 0x029206 14:91F6: F4        .byte con_F4, $43, $45, $47, $44
- D - I - - 0x02920B 14:91FB: F1        .byte con_F1, $00, $24, $F0, $BB, $00
- D - I - - 0x029211 14:9201: F0        .byte con_F0

_off007_9202_47:
- D - I - - 0x029212 14:9202: F5        .byte con_F5, $0B
- D - I - - 0x029214 14:9204: F4        .byte con_F4, $43, $45, $47, $44
- D - I - - 0x029219 14:9209: F1        .byte con_F1, $00, $25, $F0, $BB, $00
- D - I - - 0x02921F 14:920F: F0        .byte con_F0

_off007_9210_48:
- D - I - - 0x029220 14:9210: F5        .byte con_F5, $0B
- D - I - - 0x029222 14:9212: F4        .byte con_F4, $43, $45, $47, $44
- D - I - - 0x029227 14:9217: F1        .byte con_F1, $00, $26, $F0, $BB, $00
- D - I - - 0x02922D 14:921D: F0        .byte con_F0

_off007_921E_49:
- D - I - - 0x02922E 14:921E: F5        .byte con_F5, $81
- D - I - - 0x029230 14:9220: F4        .byte con_F4, $04, $05, $0F, $00
- D - I - - 0x029235 14:9225: F1        .byte con_F1, $32, $C0, $88, $E3, $00
- D - I - - 0x02923B 14:922B: F1        .byte con_F1, $07, $2B, $50, $DB, $05
- D - I - - 0x029241 14:9231: F0        .byte con_F0

_off007_9232_4A:
- D - I - - 0x029242 14:9232: F5        .byte con_F5, $81
- D - I - - 0x029244 14:9234: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029249 14:9239: F1        .byte con_F1, $29, $3F, $F8, $B3, $04
- D - I - - 0x02924F 14:923F: F0        .byte con_F0

_off007_9240_4B:
- D - I - - 0x029250 14:9240: F5        .byte con_F5, $80
- D - I - - 0x029252 14:9242: F8        .byte con_F8
- D - I - - 0x029253 14:9243: 48 9C     .word off_9C48

_off007_9245_4C:
- D - I - - 0x029255 14:9245: F5        .byte con_F5, $09
- D - I - - 0x029257 14:9247: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x02925C 14:924C: F1        .byte con_F1, $7E, $BA, $E0, $BB, $00
- D - I - - 0x029262 14:9252: F0        .byte con_F0

_off007_9253_4D:
- D - I - - 0x029263 14:9253: F5        .byte con_F5, $83
- D - I - - 0x029265 14:9255: F4        .byte con_F4, $1B, $00, $00, $00
- D - I - - 0x02926A 14:925A: F1        .byte con_F1, $00, $2C, $00, $BB, $01
- D - I - - 0x029270 14:9260: F0        .byte con_F0

_off007_9261_4E:
- D - I - - 0x029271 14:9261: F5        .byte con_F5, $0A
- D - I - - 0x029273 14:9263: F4        .byte con_F4, $2C, $0B, $05, $07
- D - I - - 0x029278 14:9268: F1        .byte con_F1, $00, $27, $10, $CB, $01
- D - I - - 0x02927E 14:926E: F0        .byte con_F0

_off007_926F_4F:
- D - I - - 0x02927F 14:926F: F5        .byte con_F5, $09
- D - I - - 0x029281 14:9271: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029286 14:9276: F1        .byte con_F1, $35, $28, $00, $B7, $01
- D - I - - 0x02928C 14:927C: F0        .byte con_F0

_off007_927D_50:
- D - I - - 0x02928D 14:927D: F5        .byte con_F5, $81
- D - I - - 0x02928F 14:927F: F4        .byte con_F4, $28, $29, $2A, $0B
- D - I - - 0x029294 14:9284: F1        .byte con_F1, $00, $11, $E8, $BB, $00
- D - I - - 0x02929A 14:928A: F0        .byte con_F0

_off007_928B_51:
- D - I - - 0x02929B 14:928B: F5        .byte con_F5, $09
- D - I - - 0x02929D 14:928D: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0292A2 14:9292: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x0292A8 14:9298: F1        .byte con_F1, $E8, $BA, $FC, $C3, $04
- D - I - - 0x0292AE 14:929E: F0        .byte con_F0

_off007_929F_52:
- D - I - - 0x0292AF 14:929F: F5        .byte con_F5, $09
- D - I - - 0x0292B1 14:92A1: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0292B6 14:92A6: F1        .byte con_F1, $7A, $BD, $E0, $E3, $00
- D - I - - 0x0292BC 14:92AC: F0        .byte con_F0

_off007_92AD_53:
- - - - - - 0x0292BD 14:92AD: F5        .byte con_F5, $09
- - - - - - 0x0292BF 14:92AF: F4        .byte con_F4, $04, $05, $00, $00
- - - - - - 0x0292C4 14:92B4: F1        .byte con_F1, $7B, $BC, $A8, $EB, $00
- - - - - - 0x0292CA 14:92BA: F0        .byte con_F0

_off007_92BB_54:
- - - - - - 0x0292CB 14:92BB: F5        .byte con_F5, $09
- - - - - - 0x0292CD 14:92BD: F4        .byte con_F4, $04, $05, $00, $00
- - - - - - 0x0292D2 14:92C2: F1        .byte con_F1, $7F, $C0, $60, $A3, $01
- - - - - - 0x0292D8 14:92C8: F0        .byte con_F0

_off007_92C9_55:
- D - I - - 0x0292D9 14:92C9: F5        .byte con_F5, $09
- D - I - - 0x0292DB 14:92CB: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0292E0 14:92D0: F1        .byte con_F1, $80, $C0, $E0, $A3, $00
- D - I - - 0x0292E6 14:92D6: F0        .byte con_F0

_off007_92D7_56:
- D - I - - 0x0292E7 14:92D7: F5        .byte con_F5, $09
- D - I - - 0x0292E9 14:92D9: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0292EE 14:92DE: F1        .byte con_F1, $7C, $BA, $90, $AB, $00
- D - I - - 0x0292F4 14:92E4: F0        .byte con_F0

_off007_92E5_57:
- D - I - - 0x0292F5 14:92E5: F5        .byte con_F5, $83
- D - I - - 0x0292F7 14:92E7: F4        .byte con_F4, $2A, $2B, $00, $00
- D - I - - 0x0292FC 14:92EC: F1        .byte con_F1, $36, $02, $10, $D3, $01
- D - I - - 0x029302 14:92F2: F0        .byte con_F0

_off007_92F3_58:
- D - I - - 0x029303 14:92F3: F5        .byte con_F5, $81
- D - I - - 0x029305 14:92F5: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02930A 14:92FA: F1        .byte con_F1, $98, $4B, $90, $B3, $01
- D - I - - 0x029310 14:9300: F1        .byte con_F1, $98, $4D, $90, $B3, $05
- D - I - - 0x029316 14:9306: F1        .byte con_F1, $98, $4F, $90, $B3, $09
- D - I - - 0x02931C 14:930C: F0        .byte con_F0

_off007_930D_59:
- - - - - - 0x02931D 14:930D: F5        .byte con_F5, $83
- - - - - - 0x02931F 14:930F: F4        .byte con_F4, $18, $19, $1A, $1B
- - - - - - 0x029324 14:9314: F1        .byte con_F1, $E3, $15, $64, $EF, $00
- - - - - - 0x02932A 14:931A: F1        .byte con_F1, $9A, $14, $D0, $B3, $04
- - - - - - 0x029330 14:9320: F8        .byte con_F8
- - - - - - 0x029331 14:9321: A7 8B     .word off_8BA7

_off007_9323_5A:
- D - I - - 0x029333 14:9323: F5        .byte con_F5, $81
- D - I - - 0x029335 14:9325: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02933A 14:932A: F1        .byte con_F1, $8B, $4B, $80, $BB, $01
- D - I - - 0x029340 14:9330: F1        .byte con_F1, $8B, $4D, $80, $BB, $05
- D - I - - 0x029346 14:9336: F1        .byte con_F1, $8B, $4F, $80, $BB, $09
- D - I - - 0x02934C 14:933C: F0        .byte con_F0

_off007_933D_5B:
- D - I - - 0x02934D 14:933D: F5        .byte con_F5, $81
- D - I - - 0x02934F 14:933F: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029354 14:9344: F1        .byte con_F1, $8C, $4B, $80, $BB, $01
- D - I - - 0x02935A 14:934A: F1        .byte con_F1, $8C, $4D, $80, $BB, $05
- D - I - - 0x029360 14:9350: F1        .byte con_F1, $8C, $4F, $80, $BB, $09
- D - I - - 0x029366 14:9356: F0        .byte con_F0

_off007_9357_5C:
- D - I - - 0x029367 14:9357: F5        .byte con_F5, $80
- D - I - - 0x029369 14:9359: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02936E 14:935E: F1        .byte con_F1, $00, $CD, $00, $C3, $0D
- D - I - - 0x029374 14:9364: F1        .byte con_F1, $00, $CA, $00, $C3, $01
- D - I - - 0x02937A 14:936A: F1        .byte con_F1, $00, $CB, $00, $C3, $05
- D - I - - 0x029380 14:9370: F0        .byte con_F0

_off007_9371_5D:
- D - I - - 0x029381 14:9371: F5        .byte con_F5, $09
- D - I - - 0x029383 14:9373: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029388 14:9378: F1        .byte con_F1, $93, $C4, $A0, $A3, $00
- D - I - - 0x02938E 14:937E: F0        .byte con_F0

_off007_937F_5E:
- D - I - - 0x02938F 14:937F: F5        .byte con_F5, $09
- D - I - - 0x029391 14:9381: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029396 14:9386: F1        .byte con_F1, $94, $BA, $80, $E3, $00
- D - I - - 0x02939C 14:938C: F0        .byte con_F0

_off007_938D_5F:
- D - I - - 0x02939D 14:938D: F5        .byte con_F5, $09
- D - I - - 0x02939F 14:938F: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0293A4 14:9394: F7        .byte con_F7, $03, $7B
- D - I - - 0x0293A7 14:9397: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x0293AD 14:939D: F1        .byte con_F1, $E9, $CF, $00, $83, $05
- D - I - - 0x0293B3 14:93A3: F0        .byte con_F0

_off007_93A4_60:
- D - I - - 0x0293B4 14:93A4: F5        .byte con_F5, $80
- D - I - - 0x0293B6 14:93A6: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0293BB 14:93AB: F1        .byte con_F1, $3A, $56, $E0, $BB, $08
- D - I - - 0x0293C1 14:93B1: F1        .byte con_F1, $3A, $4C, $E0, $BB, $00
- D - I - - 0x0293C7 14:93B7: F1        .byte con_F1, $3A, $4E, $E0, $BB, $04
- D - I - - 0x0293CD 14:93BD: 14        .byte $14
- D - I - - 0x0293CE 14:93BE: F1        .byte con_F1, $3F, $49, $28, $EB, $01
- D - I - - 0x0293D4 14:93C4: F1        .byte con_F1, $3E, $5C, $00, $C3, $05
- D - I - - 0x0293DA 14:93CA: F1        .byte con_F1, $3E, $5D, $00, $C3, $09
- D - I - - 0x0293E0 14:93D0: F1        .byte con_F1, $3E, $5E, $00, $C3, $0D
- D - I - - 0x0293E6 14:93D6: 14        .byte $14
- D - I - - 0x0293E7 14:93D7: F6        .byte con_F6, $3F
- D - I - - 0x0293E9 14:93D9: F1        .byte con_F1, $3D, $56, $AB, $C3, $08
- D - I - - 0x0293EF 14:93DF: F1        .byte con_F1, $3D, $4C, $AB, $C3, $00
- D - I - - 0x0293F5 14:93E5: F1        .byte con_F1, $3D, $4E, $AB, $C3, $04
- D - I - - 0x0293FB 14:93EB: F0        .byte con_F0

_off007_93EC_61:
- D - I - - 0x0293FC 14:93EC: F5        .byte con_F5, $80
- D - I - - 0x0293FE 14:93EE: F4        .byte con_F4, $10, $11, $12, $00
- D - I - - 0x029403 14:93F3: F1        .byte con_F1, $DB, $2D, $18, $B3, $01
- D - I - - 0x029409 14:93F9: F1        .byte con_F1, $59, $2E, $20, $AB, $05
- D - I - - 0x02940F 14:93FF: 64        .byte $64
- D - I - - 0x029410 14:9400: F6        .byte con_F6, $15
- D - I - - 0x029412 14:9402: F0        .byte con_F0

_off007_9403_62:
- D - I - - 0x029413 14:9403: F5        .byte con_F5, $85
- D - I - - 0x029415 14:9405: F4        .byte con_F4, $41, $04, $00, $00
- D - I - - 0x02941A 14:940A: F1        .byte con_F1, $00, $2F, $00, $D3, $01
- D - I - - 0x029420 14:9410: F0        .byte con_F0

_off007_9411_63:
- D - I - - 0x029421 14:9411: F5        .byte con_F5, $80
- D - I - - 0x029423 14:9413: F4        .byte con_F4, $04, $05, $23, $00
- D - I - - 0x029428 14:9418: F1        .byte con_F1, $A8, $CF, $10, $D3, $01
- D - I - - 0x02942E 14:941E: F1        .byte con_F1, $5A, $E7, $10, $CB, $05
- D - I - - 0x029434 14:9424: F0        .byte con_F0

_off007_9425_64:
- D - I - - 0x029435 14:9425: F5        .byte con_F5, $80
- D - I - - 0x029437 14:9427: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x02943C 14:942C: F1        .byte con_F1, $40, $29, $D8, $CB, $00
- D - I - - 0x029442 14:9432: F0        .byte con_F0

_off007_9433_65:
- - - - - - 0x029443 14:9433: F5        .byte con_F5, $09
- - - - - - 0x029445 14:9435: F4        .byte con_F4, $06, $00, $00, $00
- - - - - - 0x02944A 14:943A: F1        .byte con_F1, $5C, $B5, $00, $93, $01
- - - - - - 0x029450 14:9440: F0        .byte con_F0

_off007_9441_66:
- D - I - - 0x029451 14:9441: F5        .byte con_F5, $80
- D - I - - 0x029453 14:9443: F4        .byte con_F4, $04, $05, $22, $00
- D - I - - 0x029458 14:9448: F1        .byte con_F1, $5D, $31, $B0, $D3, $04
- D - I - - 0x02945E 14:944E: 06        .byte $06
- D - I - - 0x02945F 14:944F: F1        .byte con_F1, $A9, $C4, $B8, $DB, $00
- D - I - - 0x029465 14:9455: F0        .byte con_F0

_off007_9456_67:
- D - I - - 0x029466 14:9456: F5        .byte con_F5, $09
- D - I - - 0x029468 14:9458: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x02946D 14:945D: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029473 14:9463: F1        .byte con_F1, $EA, $23, $70, $CB, $05
- D - I - - 0x029479 14:9469: F0        .byte con_F0

_off007_946A_68:
- D - I - - 0x02947A 14:946A: F5        .byte con_F5, $80
- D - I - - 0x02947C 14:946C: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x029481 14:9471: F1        .byte con_F1, $AA, $C6, $90, $CB, $00
- D - I - - 0x029487 14:9477: F1        .byte con_F1, $5E, $32, $80, $9B, $05
- D - I - - 0x02948D 14:947D: F0        .byte con_F0

_off007_947E_69:
- D - I - - 0x02948E 14:947E: F5        .byte con_F5, $80
- D - I - - 0x029490 14:9480: F4        .byte con_F4, $16, $17, $2D, $53
- D - I - - 0x029495 14:9485: F1        .byte con_F1, $00, $46, $08, $BB, $01
- D - I - - 0x02949B 14:948B: F0        .byte con_F0

_off007_948C_6A:
- D - I - - 0x02949C 14:948C: F5        .byte con_F5, $80
- D - I - - 0x02949E 14:948E: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x0294A3 14:9493: F1        .byte con_F1, $AB, $CF, $E8, $DB, $00
- D - I - - 0x0294A9 14:9499: F1        .byte con_F1, $2D, $33, $F8, $CB, $04
- D - I - - 0x0294AF 14:949F: F8        .byte con_F8
- D - I - - 0x0294B0 14:94A0: A7 8B     .word off_8BA7

_off007_94A2_6B:
- D - I - - 0x0294B2 14:94A2: F5        .byte con_F5, $80
- D - I - - 0x0294B4 14:94A4: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0294B9 14:94A9: F1        .byte con_F1, $42, $4C, $80, $BB, $00
- D - I - - 0x0294BF 14:94AF: F1        .byte con_F1, $42, $4E, $80, $BB, $04
off_94B5:
- D - I - - 0x0294C5 14:94B5: F1        .byte con_F1, $42, $50, $80, $BB, $08
- D - I - - 0x0294CB 14:94BB: F0        .byte con_F0

_off007_94BC_6C:
- D - I - - 0x0294CC 14:94BC: F5        .byte con_F5, $80
- D - I - - 0x0294CE 14:94BE: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x0294D3 14:94C3: F1        .byte con_F1, $1A, $07, $4C, $76, $00
- D - I - - 0x0294D9 14:94C9: F1        .byte con_F1, $A0, $06, $10, $B3, $05
- D - I - - 0x0294DF 14:94CF: F9        .byte con_F9, $0F
- D - I - - 0x0294E1 14:94D1: 01        .byte $01
- D - I - - 0x0294E2 14:94D2: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x0294E6 14:94D6: 01        .byte $01
- D - I - - 0x0294E7 14:94D7: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x0294EB 14:94DB: FA        .byte con_FA
- D - I - - 0x0294EC 14:94DC: F6        .byte con_F6, $00
- D - I - - 0x0294EE 14:94DE: F1        .byte con_F1, $00, $39, $F9, $BB, $04
- D - I - - 0x0294F4 14:94E4: 04        .byte $04
- D - I - - 0x0294F5 14:94E5: F1        .byte con_F1, $A1, $07, $E4, $CF, $00
- D - I - - 0x0294FB 14:94EB: F1        .byte con_F1, $26, $06, $F9, $BB, $04
- D - I - - 0x029501 14:94F1: F8        .byte con_F8
- D - I - - 0x029502 14:94F2: A7 8B     .word off_8BA7

_off007_94F4_6D:
- D - I - - 0x029504 14:94F4: F5        .byte con_F5, $80
- D - I - - 0x029506 14:94F6: F4        .byte con_F4, $24, $25, $26, $4F
- D - I - - 0x02950B 14:94FB: F1        .byte con_F1, $A2, $0A, $5F, $7B, $00
- D - I - - 0x029511 14:9501: F1        .byte con_F1, $A0, $09, $10, $B3, $05
- D - I - - 0x029517 14:9507: F9        .byte con_F9, $0F
- D - I - - 0x029519 14:9509: 01        .byte $01
- D - I - - 0x02951A 14:950A: FB        .byte con_FB, $10, $23, $45
- D - I - - 0x02951E 14:950E: 01        .byte $01
- D - I - - 0x02951F 14:950F: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x029523 14:9513: FA        .byte con_FA
- D - I - - 0x029524 14:9514: F6        .byte con_F6, $00
- D - I - - 0x029526 14:9516: F1        .byte con_F1, $00, $3B, $F9, $BB, $04
- D - I - - 0x02952C 14:951C: 04        .byte $04
- D - I - - 0x02952D 14:951D: F1        .byte con_F1, $A3, $0A, $F0, $BB, $00
- D - I - - 0x029533 14:9523: F1        .byte con_F1, $26, $09, $F9, $BB, $04
- D - I - - 0x029539 14:9529: F8        .byte con_F8
- D - I - - 0x02953A 14:952A: A7 8B     .word off_8BA7

_off007_952C_6E:
- D - I - - 0x02953C 14:952C: F5        .byte con_F5, $80
- D - I - - 0x02953E 14:952E: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029543 14:9533: F1        .byte con_F1, $33, $1E, $60, $97, $04
- D - I - - 0x029549 14:9539: F1        .byte con_F1, $24, $1D, $20, $B7, $09
- D - I - - 0x02954F 14:953F: 1E        .byte $1E
- D - I - - 0x029550 14:9540: F6        .byte con_F6, $2A
- D - I - - 0x029552 14:9542: F1        .byte con_F1, $34, $21, $10, $B7, $01
- D - I - - 0x029558 14:9548: F0        .byte con_F0

_off007_9549_6F:
- D - I - - 0x029559 14:9549: F5        .byte con_F5, $80
- D - I - - 0x02955B 14:954B: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029560 14:9550: F1        .byte con_F1, $33, $49, $60, $E3, $04
- D - I - - 0x029566 14:9556: F1        .byte con_F1, $67, $94, $F0, $BB, $00
- D - I - - 0x02956C 14:955C: F1        .byte con_F1, $67, $95, $F0, $BB, $08
- D - I - - 0x029572 14:9562: F1        .byte con_F1, $67, $96, $F0, $BB, $0C
- D - I - - 0x029578 14:9568: 1E        .byte $1E
- D - I - - 0x029579 14:9569: F4        .byte con_F4, $0A, $0B, $00, $0B
- D - I - - 0x02957E 14:956E: F6        .byte con_F6, $2A
- D - I - - 0x029580 14:9570: F6        .byte con_F6, $3F
- D - I - - 0x029582 14:9572: F1        .byte con_F1, $68, $85, $20, $C3, $01
- D - I - - 0x029588 14:9578: F0        .byte con_F0

_off007_9579_70:
- D - I - - 0x029589 14:9579: F5        .byte con_F5, $09
- D - I - - 0x02958B 14:957B: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x029590 14:9580: F1        .byte con_F1, $81, $C0, $C0, $EB, $00
- D - I - - 0x029596 14:9586: F0        .byte con_F0

_off007_9587_71:
- D - I - - 0x029597 14:9587: F5        .byte con_F5, $80
- D - I - - 0x029599 14:9589: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x02959E 14:958E: F1        .byte con_F1, $40, $7E, $D8, $CB, $00
- D - I - - 0x0295A4 14:9594: F0        .byte con_F0

_off007_9598_72:
- - - - - - 0x0295A8 14:9598: F5        .byte con_F5, $09
- - - - - - 0x0295AA 14:959A: F4        .byte con_F4, $04, $05, $00, $00
- - - - - - 0x0295AF 14:959F: F1        .byte con_F1, $96, $C0, $D0, $9B, $00
- - - - - - 0x0295B5 14:95A5: F0        .byte con_F0

_off007_95A6_73:
- D - I - - 0x0295B6 14:95A6: F5        .byte con_F5, $09
- D - I - - 0x0295B8 14:95A8: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0295BD 14:95AD: F1        .byte con_F1, $97, $C0, $00, $E3, $01
- D - I - - 0x0295C3 14:95B3: F0        .byte con_F0

_off007_95B4_74:
- D - I - - 0x0295C4 14:95B4: F5        .byte con_F5, $09
- D - I - - 0x0295C6 14:95B6: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0295CB 14:95BB: F7        .byte con_F7, $2B, $53
- D - I - - 0x0295CE 14:95BE: F1        .byte con_F1, $00, $00, $80, $A3, $00
- D - I - - 0x0295D4 14:95C4: F1        .byte con_F1, $00, $00, $80, $DB, $04
- D - I - - 0x0295DA 14:95CA: F1        .byte con_F1, $B1, $C4, $90, $93, $08
- D - I - - 0x0295E0 14:95D0: 03        .byte $03
- D - I - - 0x0295E1 14:95D1: F1        .byte con_F1, $B1, $C4, $90, $93, $0C
- D - I - - 0x0295E7 14:95D7: 03        .byte $03
- D - I - - 0x0295E8 14:95D8: F1        .byte con_F1, $B1, $C4, $90, $93, $10
- D - I - - 0x0295EE 14:95DE: 03        .byte $03
- D - I - - 0x0295EF 14:95DF: F1        .byte con_F1, $B1, $C4, $90, $93, $14
- D - I - - 0x0295F5 14:95E5: F0        .byte con_F0

_off007_95E6_75:
- D - I - - 0x0295F6 14:95E6: F5        .byte con_F5, $84
- D - I - - 0x0295F8 14:95E8: 16        .byte $16
- D - I - - 0x0295F9 14:95E9: F4        .byte con_F4, $2D, $00, $00, $00
- D - I - - 0x0295FE 14:95EE: F1        .byte con_F1, $CB, $B3, $53, $C3, $00
- D - I - - 0x029604 14:95F4: F0        .byte con_F0

_off007_95F5_76:
- D - I - - 0x029605 14:95F5: F5        .byte con_F5, $80
- D - I - - 0x029607 14:95F7: F4        .byte con_F4, $28, $29, $2A, $0B
- D - I - - 0x02960C 14:95FC: F1        .byte con_F1, $39, $11, $E8, $BB, $00
- D - I - - 0x029612 14:9602: F0        .byte con_F0

_off007_9603_77:
- D - I - - 0x029613 14:9603: F5        .byte con_F5, $82
- D - I - - 0x029615 14:9605: F4        .byte con_F4, $04, $05, $22, $00
- D - I - - 0x02961A 14:960A: F1        .byte con_F1, $5D, $83, $B8, $D3, $04
- D - I - - 0x029620 14:9610: 06        .byte $06
- D - I - - 0x029621 14:9611: F1        .byte con_F1, $A9, $C4, $B8, $DB, $00
- D - I - - 0x029627 14:9617: F0        .byte con_F0


_off007_9618_78:
- D - I - - 0x029628 14:9618: F5        .byte con_F5, $80
off_961A:
- D - I - - 0x02962A 14:961A: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02962F 14:961F: F1        .byte con_F1, $62, $5E, $20, $BB, $0D
- D - I - - 0x029635 14:9625: F1        .byte con_F1, $62, $5D, $20, $BB, $09
- D - I - - 0x02963B 14:962B: F1        .byte con_F1, $62, $5C, $20, $BB, $05
- D - I - - 0x029641 14:9631: F1        .byte con_F1, $63, $49, $A0, $9F, $00
- D - I - - 0x029647 14:9637: 14        .byte $14
- D - I - - 0x029648 14:9638: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x02964D 14:963D: F6        .byte con_F6, $00
- D - I - - 0x02964F 14:963F: F6        .byte con_F6, $2A
- D - I - - 0x029651 14:9641: F6        .byte con_F6, $3F
- D - I - - 0x029653 14:9643: F1        .byte con_F1, $00, $85, $08, $BB, $05
- D - I - - 0x029659 14:9649: 02        .byte $02
- D - I - - 0x02965A 14:964A: F1        .byte con_F1, $8E, $84, $0C, $BB, $05
- D - I - - 0x029660 14:9650: F0        .byte con_F0


_off007_9651_79:
- D - I - - 0x029661 14:9651: F5        .byte con_F5, $09
- D - I - - 0x029663 14:9653: F4        .byte con_F4, $60, $61, $62, $63
- D - I - - 0x029668 14:9658: F1        .byte con_F1, $00, $79, $F0, $BB, $00
- D - I - - 0x02966E 14:965E: F0        .byte con_F0

_off007_965F_7A:
- D - I - - 0x02966F 14:965F: F5        .byte con_F5, $80
- D - I - - 0x029671 14:9661: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029676 14:9666: F1        .byte con_F1, $65, $1E, $D0, $93, $00
- D - I - - 0x02967C 14:966C: F1        .byte con_F1, $64, $1D, $1F, $B7, $05
- D - I - - 0x029682 14:9672: 14        .byte $14
- D - I - - 0x029683 14:9673: F6        .byte con_F6, $00
- D - I - - 0x029685 14:9675: F1        .byte con_F1, $00, $3F, $16, $B3, $05
- D - I - - 0x02968B 14:967B: 04        .byte $04
- D - I - - 0x02968C 14:967C: F1        .byte con_F1, $66, $1D, $16, $B3, $05
- D - I - - 0x029692 14:9682: F1        .byte con_F1, $A7, $22, $0E, $AF, $01
- D - I - - 0x029698 14:9688: F0        .byte con_F0

_off007_9689_7B:
- D - I - - 0x029699 14:9689: F5        .byte con_F5, $09
- D - I - - 0x02969B 14:968B: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0296A0 14:9690: F1        .byte con_F1, $83, $BA, $B8, $BB, $00
- D - I - - 0x0296A6 14:9696: F0        .byte con_F0

_off007_9697_7C:
- D - I - - 0x0296A7 14:9697: F5        .byte con_F5, $87
- D - I - - 0x0296A9 14:9699: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0296AE 14:969E: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x0296B4 14:96A4: F1        .byte con_F1, $67, $94, $F0, $B3, $04
- D - I - - 0x0296BA 14:96AA: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x0296C0 14:96B0: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x0296C6 14:96B6: 16        .byte $16
- D - I - - 0x0296C7 14:96B7: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x0296CC 14:96BC: F6        .byte con_F6, $00
- D - I - - 0x0296CE 14:96BE: F6        .byte con_F6, $2A
- D - I - - 0x0296D0 14:96C0: F6        .byte con_F6, $3F
- D - I - - 0x0296D2 14:96C2: F1        .byte con_F1, $00, $84, $20, $BB, $05
- D - I - - 0x0296D8 14:96C8: 04        .byte $04
- D - I - - 0x0296D9 14:96C9: F1        .byte con_F1, $68, $85, $20, $BB, $05
- D - I - - 0x0296DF 14:96CF: F8        .byte con_F8
- D - I - - 0x0296E0 14:96D0: 0C 99     .word off_990C

_off007_96D2_7D:
- D - I - - 0x0296E2 14:96D2: F5        .byte con_F5, $83
- D - I - - 0x0296E4 14:96D4: F4        .byte con_F4, $18, $19, $1A, $2B
- D - I - - 0x0296E9 14:96D9: F7        .byte con_F7, $03, $7B
- D - I - - 0x0296EC 14:96DC: F1        .byte con_F1, $30, $00, $80, $9B, $04
- D - I - - 0x0296F2 14:96E2: F1        .byte con_F1, $43, $00, $80, $E4, $08
- D - I - - 0x0296F8 14:96E8: F1        .byte con_F1, $2C, $ED, $70, $C3, $11
- D - I - - 0x0296FE 14:96EE: C0        .byte $C0
- D - I - - 0x0296FF 14:96EF: F7        .byte con_F7, $1C, $63
- D - I - - 0x029702 14:96F2: F1        .byte con_F1, $00, $00, $80, $E3, $0C
- D - I - - 0x029708 14:96F8: 10        .byte $10
- D - I - - 0x029709 14:96F9: F7        .byte con_F7, $24, $5B
- D - I - - 0x02970C 14:96FC: F1        .byte con_F1, $00, $00, $80, $A4, $00
- D - I - - 0x029712 14:9702: F1        .byte con_F1, $00, $00, $80, $DB, $0C
- D - I - - 0x029718 14:9708: 10        .byte $10
- D - I - - 0x029719 14:9709: F7        .byte con_F7, $2B, $53
- D - I - - 0x02971C 14:970C: F1        .byte con_F1, $00, $00, $80, $AB, $00
- D - I - - 0x029722 14:9712: F1        .byte con_F1, $00, $00, $80, $D3, $0C
- D - I - - 0x029728 14:9718: 10        .byte $10
- D - I - - 0x029729 14:9719: F7        .byte con_F7, $33, $4B
- D - I - - 0x02972C 14:971C: F1        .byte con_F1, $00, $00, $80, $B3, $00
- D - I - - 0x029732 14:9722: F1        .byte con_F1, $00, $00, $80, $CB, $0C
- D - I - - 0x029738 14:9728: 60        .byte $60
- D - I - - 0x029739 14:9729: F7        .byte con_F7, $03, $7B
- D - I - - 0x02973C 14:972C: F6        .byte con_F6, $00
- D - I - - 0x02973E 14:972E: F6        .byte con_F6, $15
- D - I - - 0x029740 14:9730: F6        .byte con_F6, $2A
- D - I - - 0x029742 14:9732: F6        .byte con_F6, $3F
- D - I - - 0x029744 14:9734: F1        .byte con_F1, $2E, $17, $00, $C3, $11
- D - I - - 0x02974A 14:973A: F0        .byte con_F0

_off007_973B_7E:
- D - I - - 0x02974B 14:973B: F5        .byte con_F5, $09
- D - I - - 0x02974D 14:973D: F4        .byte con_F4, $06, $00, $00, $00
- D - I - - 0x029752 14:9742: F1        .byte con_F1, $84, $B6, $E0, $63, $00
- D - I - - 0x029758 14:9748: F0        .byte con_F0

_off007_9749_7F:
- D - I - - 0x029759 14:9749: F5        .byte con_F5, $82
- D - I - - 0x02975B 14:974B: F4        .byte con_F4, $04, $05, $22, $00
- D - I - - 0x029760 14:9750: F1        .byte con_F1, $00, $8A, $20, $CB, $05
- D - I - - 0x029766 14:9756: 06        .byte $06
- D - I - - 0x029767 14:9757: F1        .byte con_F1, $69, $BA, $18, $D3, $01
- D - I - - 0x02976D 14:975D: F8        .byte con_F8
- D - I - - 0x02976E 14:975E: A7 8B     .word off_8BA7

_off007_9760_80:
- D - I - - 0x029770 14:9760: F5        .byte con_F5, $09
- D - I - - 0x029772 14:9762: F4        .byte con_F4, $06, $00, $00, $00
- D - I - - 0x029777 14:9767: F1        .byte con_F1, $85, $B7, $60, $93, $00
- D - I - - 0x02977D 14:976D: F0        .byte con_F0

_off007_976E_81:
- D - I - - 0x02977E 14:976E: F5        .byte con_F5, $80
- D - I - - 0x029780 14:9770: F4        .byte con_F4, $04, $05, $23, $00
- D - I - - 0x029785 14:9775: F1        .byte con_F1, $AE, $BA, $D0, $B5, $00
- D - I - - 0x02978B 14:977B: F1        .byte con_F1, $6A, $8B, $C0, $C5, $04
- D - I - - 0x029791 14:9781: F8        .byte con_F8
- D - I - - 0x029792 14:9782: A7 8B     .word off_8BA7

_off007_9784_82:
- D - I - - 0x029794 14:9784: F5        .byte con_F5, $80
- D - I - - 0x029796 14:9786: F4        .byte con_F4, $04, $05, $23, $00
- D - I - - 0x02979B 14:978B: F1        .byte con_F1, $AF, $BA, $D0, $D7, $00
- D - I - - 0x0297A1 14:9791: F1        .byte con_F1, $00, $30, $C8, $CF, $04
- D - I - - 0x0297A7 14:9797: F0        .byte con_F0

_off007_9798_83:
- D - I - - 0x0297A8 14:9798: F5        .byte con_F5, $80
- D - I - - 0x0297AA 14:979A: F4        .byte con_F4, $04, $05, $22, $00
- D - I - - 0x0297AF 14:979F: F1        .byte con_F1, $00, $31, $E4, $CB, $04
- D - I - - 0x0297B5 14:97A5: 06        .byte $06
- D - I - - 0x0297B6 14:97A6: F1        .byte con_F1, $B0, $BA, $E8, $DB, $00
- D - I - - 0x0297BC 14:97AC: F8        .byte con_F8
- D - I - - 0x0297BD 14:97AD: A7 8B     .word off_8BA7

_off007_97AF_84:
- D - I - - 0x0297BF 14:97AF: F5        .byte con_F5, $09
- D - I - - 0x0297C1 14:97B1: F4        .byte con_F4, $04, $05, $00, $00
- D - I - - 0x0297C6 14:97B6: F1        .byte con_F1, $86, $C4, $A8, $AB, $00
- D - I - - 0x0297CC 14:97BC: F0        .byte con_F0

_off007_97BD_85:
- D - I - - 0x0297CD 14:97BD: F5        .byte con_F5, $83
- D - I - - 0x0297CF 14:97BF: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x0297D4 14:97C4: F1        .byte con_F1, $00, $8E, $00, $EB, $01
off_97CA:
- D - I - - 0x0297DA 14:97CA: F1        .byte con_F1, $00, $8C, $00, $D3, $05
- D - I - - 0x0297E0 14:97D0: F0        .byte con_F0

_off007_97D1_86:
- D - I - - 0x0297E1 14:97D1: F5        .byte con_F5, $83
- D - I - - 0x0297E3 14:97D3: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x0297E8 14:97D8: F1        .byte con_F1, $6C, $B8, $00, $EB, $01
off_97DE:
- D - I - - 0x0297EE 14:97DE: F1        .byte con_F1, $6B, $8D, $10, $C7, $05
- D - I - - 0x0297F4 14:97E4: F8        .byte con_F8
- D - I - - 0x0297F5 14:97E5: A7 8B     .word off_8BA7

_off007_97E7_87:
- D - I - - 0x0297F7 14:97E7: F5        .byte con_F5, $83
- D - I - - 0x0297F9 14:97E9: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x0297FE 14:97EE: F1        .byte con_F1, $6D, $B8, $00, $EB, $01
- D - I - - 0x029804 14:97F4: F8        .byte con_F8
- D - I - - 0x029805 14:97F5: DE 97     .word off_97DE

_off007_97F7_88:
- D - I - - 0x029807 14:97F7: F5        .byte con_F5, $83
- D - I - - 0x029809 14:97F9: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x02980E 14:97FE: F1        .byte con_F1, $6E, $B8, $00, $EB, $01
- D - I - - 0x029814 14:9804: F8        .byte con_F8
- D - I - - 0x029815 14:9805: DE 97     .word off_97DE

_off007_9807_89:
- D - I - - 0x029817 14:9807: F5        .byte con_F5, $83
- D - I - - 0x029819 14:9809: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x02981E 14:980E: F1        .byte con_F1, $6C, $B8, $00, $EB, $01
- D - I - - 0x029824 14:9814: F8        .byte con_F8
- D - I - - 0x029825 14:9815: CA 97     .word off_97CA

_off007_9817_8A:
- D - I - - 0x029827 14:9817: F5        .byte con_F5, $83
- D - I - - 0x029829 14:9819: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x02982E 14:981E: F1        .byte con_F1, $6E, $B8, $00, $EB, $01
- D - I - - 0x029834 14:9824: F8        .byte con_F8
- D - I - - 0x029835 14:9825: CA 97     .word off_97CA

_off007_9827_8B:
- D - I - - 0x029837 14:9827: F5        .byte con_F5, $80
- D - I - - 0x029839 14:9829: F4        .byte con_F4, $20, $21, $00, $00
- D - I - - 0x02983E 14:982E: F1        .byte con_F1, $00, $8F, $10, $BB, $01
- D - I - - 0x029844 14:9834: F0        .byte con_F0

_off007_9835_8C:
- D - I - - 0x029845 14:9835: F5        .byte con_F5, $85
- D - I - - 0x029847 14:9837: F4        .byte con_F4, $06, $07, $00, $00
- D - I - - 0x02984C 14:983C: F1        .byte con_F1, $00, $64, $10, $D3, $01
- D - I - - 0x029852 14:9842: 10        .byte $10
- D - I - - 0x029853 14:9843: F1        .byte con_F1, $00, $65, $30, $CB, $05
- D - I - - 0x029859 14:9849: 04        .byte $04
- D - I - - 0x02985A 14:984A: F1        .byte con_F1, $00, $67, $00, $D3, $05
- D - I - - 0x029860 14:9850: F1        .byte con_F1, $00, $66, $00, $D3, $01
- D - I - - 0x029866 14:9856: 06        .byte $06
- D - I - - 0x029867 14:9857: F6        .byte con_F6, $15
- D - I - - 0x029869 14:9859: F1        .byte con_F1, $00, $68, $C0, $C3, $00
- D - I - - 0x02986F 14:985F: 02        .byte $02
- D - I - - 0x029870 14:9860: F6        .byte con_F6, $00
- D - I - - 0x029872 14:9862: F0        .byte con_F0

_off007_9863_8D:
- D - I - - 0x029873 14:9863: F5        .byte con_F5, $80
- D - I - - 0x029875 14:9865: F4        .byte con_F4, $20, $21, $00, $00
- D - I - - 0x02987A 14:986A: F1        .byte con_F1, $00, $90, $10, $BB, $01
- D - I - - 0x029880 14:9870: F0        .byte con_F0

_off007_9871_8E:
- D - I - - 0x029881 14:9871: F5        .byte con_F5, $80
- D - I - - 0x029883 14:9873: F4        .byte con_F4, $10, $11, $12, $13
- D - I - - 0x029888 14:9878: F1        .byte con_F1, $D0, $2E, $20, $B3, $05
- D - I - - 0x02988E 14:987E: F1        .byte con_F1, $B2, $2D, $18, $BB, $01
- D - I - - 0x029894 14:9884: F0        .byte con_F0

_off007_9885_8F:
- D - I - - 0x029895 14:9885: F5        .byte con_F5, $0A
- D - I - - 0x029897 14:9887: F4        .byte con_F4, $2C, $0B, $05, $07
- D - I - - 0x02989C 14:988C: F1        .byte con_F1, $00, $91, $00, $D3, $01
- D - I - - 0x0298A2 14:9892: F1        .byte con_F1, $70, $92, $28, $C3, $05
- D - I - - 0x0298A8 14:9898: F1        .byte con_F1, $70, $92, $00, $C3, $08
- D - I - - 0x0298AE 14:989E: F1        .byte con_F1, $71, $93, $B8, $B3, $0C
- D - I - - 0x0298B4 14:98A4: F1        .byte con_F1, $71, $93, $00, $B3, $10
- D - I - - 0x0298BA 14:98AA: F0        .byte con_F0

_off007_98AB_90:
- D - I - - 0x0298BB 14:98AB: F5        .byte con_F5, $80
- D - I - - 0x0298BD 14:98AD: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0298C2 14:98B2: F1        .byte con_F1, $00, $58, $00, $C3, $09
- D - I - - 0x0298C8 14:98B8: F1        .byte con_F1, $00, $4B, $00, $C3, $01
- D - I - - 0x0298CE 14:98BE: F1        .byte con_F1, $00, $4D, $00, $C3, $05
- D - I - - 0x0298D4 14:98C4: F0        .byte con_F0

_off007_98C5_91:
- D - I - - 0x0298D5 14:98C5: F5        .byte con_F5, $84
- D - I - - 0x0298D7 14:98C7: 80        .byte $80
- D - I - - 0x0298D8 14:98C8: F4        .byte con_F4, $33, $00, $00, $00
- D - I - - 0x0298DD 14:98CD: F1        .byte con_F1, $00, $98, $00, $D3, $01
- D - I - - 0x0298E3 14:98D3: F0        .byte con_F0

_off007_98D4_92:
- D - I - - 0x0298E4 14:98D4: F5        .byte con_F5, $0F
- D - I - - 0x0298E6 14:98D6: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x0298EB 14:98DB: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x0298F1 14:98E1: F1        .byte con_F1, $67, $D3, $F0, $B3, $04
- D - I - - 0x0298F7 14:98E7: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x0298FD 14:98ED: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x029903 14:98F3: 16        .byte $16
- D - I - - 0x029904 14:98F4: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x029909 14:98F9: F6        .byte con_F6, $00
- D - I - - 0x02990B 14:98FB: F6        .byte con_F6, $2A
- D - I - - 0x02990D 14:98FD: F6        .byte con_F6, $3F
- D - I - - 0x02990F 14:98FF: F1        .byte con_F1, $00, $DA, $20, $BB, $05
- D - I - - 0x029915 14:9905: 04        .byte $04
- D - I - - 0x029916 14:9906: F1        .byte con_F1, $68, $E0, $20, $BB, $05
off_990C:
- D - I - - 0x02991C 14:990C: F1        .byte con_F1, $AD, $86, $08, $EB, $01
- D - I - - 0x029922 14:9912: F0        .byte con_F0

_off007_9913_93:
- D - I - - 0x029923 14:9913: F5        .byte con_F5, $84
- D - I - - 0x029925 14:9915: 02        .byte $02
- D - I - - 0x029926 14:9916: F4        .byte con_F4, $38, $39, $42, $41
- D - I - - 0x02992B 14:991B: F1        .byte con_F1, $00, $B1, $10, $CB, $01
- D - I - - 0x029931 14:9921: F0        .byte con_F0

_off007_9922_94:
- D - I - - 0x029932 14:9922: F5        .byte con_F5, $84
- D - I - - 0x029934 14:9924: 81        .byte $81
- D - I - - 0x029935 14:9925: F4        .byte con_F4, $38, $39, $42, $41
- D - I - - 0x02993A 14:992A: F1        .byte con_F1, $00, $AE, $10, $CB, $01
- D - I - - 0x029940 14:9930: F0        .byte con_F0

_off007_9931_95:
- D - I - - 0x029941 14:9931: F5        .byte con_F5, $10
- D - I - - 0x029943 14:9933: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029948 14:9938: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x02994E 14:993E: F1        .byte con_F1, $67, $D4, $F0, $B3, $04
- D - I - - 0x029954 14:9944: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x02995A 14:994A: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x029960 14:9950: 16        .byte $16
- D - I - - 0x029961 14:9951: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x029966 14:9956: F6        .byte con_F6, $00
- D - I - - 0x029968 14:9958: F6        .byte con_F6, $2A
- D - I - - 0x02996A 14:995A: F6        .byte con_F6, $3F
- D - I - - 0x02996C 14:995C: F1        .byte con_F1, $00, $DB, $20, $BB, $05
- D - I - - 0x029972 14:9962: 04        .byte $04
- D - I - - 0x029973 14:9963: F1        .byte con_F1, $68, $E1, $20, $BB, $05
- D - I - - 0x029979 14:9969: F8        .byte con_F8
- D - I - - 0x02997A 14:996A: 0C 99     .word off_990C

_off007_996C_96:
- D - I - - 0x02997C 14:996C: F5        .byte con_F5, $84
- D - I - - 0x02997E 14:996E: 82        .byte $82
off_996F:
- D - I - - 0x02997F 14:996F: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029984 14:9974: F1        .byte con_F1, $00, $9E, $00, $D3, $01
- D - I - - 0x02998A 14:997A: F0        .byte con_F0

_off007_997B_97:
- D - I - - 0x02998B 14:997B: F5        .byte con_F5, $84
- D - I - - 0x02998D 14:997D: 06        .byte $06
- D - I - - 0x02998E 14:997E: F8        .byte con_F8
- D - I - - 0x02998F 14:997F: 6F 99     .word off_996F

_off007_9981_98:
- D - I - - 0x029991 14:9981: F5        .byte con_F5, $84
- D - I - - 0x029993 14:9983: 83        .byte $83
off_9984:
- D - I - - 0x029994 14:9984: F4        .byte con_F4, $34, $00, $00, $00
- D - I - - 0x029999 14:9989: F1        .byte con_F1, $00, $9D, $00, $D3, $01
- D - I - - 0x02999F 14:998F: F0        .byte con_F0

_off007_9990_99:
- D - I - - 0x0299A0 14:9990: F5        .byte con_F5, $84
- D - I - - 0x0299A2 14:9992: 09        .byte $09
- D - I - - 0x0299A3 14:9993: F8        .byte con_F8
- D - I - - 0x0299A4 14:9994: 84 99     .word off_9984

_off007_9996_9A:
- D - I - - 0x0299A6 14:9996: F5        .byte con_F5, $84
- D - I - - 0x0299A8 14:9998: 85        .byte $85
off_9999:
- D - I - - 0x0299A9 14:9999: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x0299AE 14:999E: F1        .byte con_F1, $00, $AA, $00, $D3, $01
- D - I - - 0x0299B4 14:99A4: F0        .byte con_F0

_off007_99A5_9B:
- - - - - - 0x0299B5 14:99A5: F5        .byte con_F5, $84
- - - - - - 0x0299B7 14:99A7: 0C        .byte $0C
- - - - - - 0x0299B8 14:99A8: F8        .byte con_F8
- - - - - - 0x0299B9 14:99A9: 99 99     .word off_9999

_off007_99AB_9C:
- D - I - - 0x0299BB 14:99AB: F5        .byte con_F5, $84
- D - I - - 0x0299BD 14:99AD: 0D        .byte $0D
- D - I - - 0x0299BE 14:99AE: F8        .byte con_F8
- D - I - - 0x0299BF 14:99AF: B2 9A     .word off_9AB2

_off007_99B1_9D:
- D - I - - 0x0299C1 14:99B1: F5        .byte con_F5, $80
- D - I - - 0x0299C3 14:99B3: F4        .byte con_F4, $10, $11, $12, $13
- D - I - - 0x0299C8 14:99B8: F7        .byte con_F7, $23, $5B
- D - I - - 0x0299CB 14:99BB: F1        .byte con_F1, $D2, $2E, $20, $BB, $0D
- D - I - - 0x0299D1 14:99C1: F1        .byte con_F1, $D1, $2D, $18, $C3, $09
- D - I - - 0x0299D7 14:99C7: F1        .byte con_F1, $00, $00, $80, $A3, $04
- D - I - - 0x0299DD 14:99CD: F1        .byte con_F1, $00, $00, $80, $DB, $00
- D - I - - 0x0299E3 14:99D3: F0        .byte con_F0

_off007_99D4_9E:
- D - I - - 0x0299E4 14:99D4: F5        .byte con_F5, $84
- D - I - - 0x0299E6 14:99D6: 0F        .byte $0F
- D - I - - 0x0299E7 14:99D7: F8        .byte con_F8
- D - I - - 0x0299E8 14:99D8: 05 9B     .word off_9B05

_off007_99DA_9F:
- D - I - - 0x0299EA 14:99DA: F5        .byte con_F5, $84
- D - I - - 0x0299EC 14:99DC: 10        .byte $10
- D - I - - 0x0299ED 14:99DD: F8        .byte con_F8
- D - I - - 0x0299EE 14:99DE: D8 9A     .word off_9AD8

_off007_99E0_A0:
- D - I - - 0x0299F0 14:99E0: F5        .byte con_F5, $84
- D - I - - 0x0299F2 14:99E2: 11        .byte $11
- D - I - - 0x0299F3 14:99E3: F8        .byte con_F8
- D - I - - 0x0299F4 14:99E4: A3 9A     .word off_9AA3

_off007_99E6_A1:
- D - I - - 0x0299F6 14:99E6: F5        .byte con_F5, $84
- D - I - - 0x0299F8 14:99E8: 12        .byte $12
- D - I - - 0x0299F9 14:99E9: F8        .byte con_F8
- D - I - - 0x0299FA 14:99EA: F6 9A     .word off_9AF6

_off007_99EC_A2:
- - - - - - 0x0299FC 14:99EC: F5        .byte con_F5, $84
- - - - - - 0x0299FE 14:99EE: 13        .byte $13
- - - - - - 0x0299FF 14:99EF: F8        .byte con_F8
- - - - - - 0x029A00 14:99F0: 14 9B     .word off_9B14

_off007_99F2_A3:
- D - I - - 0x029A02 14:99F2: F5        .byte con_F5, $84
- D - I - - 0x029A04 14:99F4: 14        .byte $14
- D - I - - 0x029A05 14:99F5: F8        .byte con_F8
- D - I - - 0x029A06 14:99F6: E7 9A     .word off_9AE7

_off007_99F8_A4:
- D - I - - 0x029A08 14:99F8: F5        .byte con_F5, $84
- D - I - - 0x029A0A 14:99FA: 15        .byte $15
- D - I - - 0x029A0B 14:99FB: F4        .byte con_F4, $38, $39, $42, $41
- D - I - - 0x029A10 14:9A00: F1        .byte con_F1, $00, $B0, $10, $CB, $01
- D - I - - 0x029A16 14:9A06: F0        .byte con_F0

_off007_9A07_A5:
- D - I - - 0x029A17 14:9A07: F5        .byte con_F5, $80
- D - I - - 0x029A19 14:9A09: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029A1E 14:9A0E: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x029A24 14:9A14: F1        .byte con_F1, $67, $D5, $F0, $B3, $04
- D - I - - 0x029A2A 14:9A1A: F1        .byte con_F1, $67, $D9, $F0, $B3, $08
- D - I - - 0x029A30 14:9A20: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x029A36 14:9A26: 16        .byte $16
- D - I - - 0x029A37 14:9A27: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x029A3C 14:9A2C: F6        .byte con_F6, $00
- D - I - - 0x029A3E 14:9A2E: F6        .byte con_F6, $2A
- D - I - - 0x029A40 14:9A30: F6        .byte con_F6, $3F
- D - I - - 0x029A42 14:9A32: F1        .byte con_F1, $00, $DC, $20, $BB, $05
- D - I - - 0x029A48 14:9A38: 04        .byte $04
- D - I - - 0x029A49 14:9A39: F1        .byte con_F1, $68, $E2, $20, $BB, $05
- D - I - - 0x029A4F 14:9A3F: F8        .byte con_F8
- D - I - - 0x029A50 14:9A40: 0C 99     .word off_990C

_off007_9A42_A6:
- D - I - - 0x029A52 14:9A42: F5        .byte con_F5, $1A
- D - I - - 0x029A54 14:9A44: F4        .byte con_F4, $38, $39, $42, $41
- D - I - - 0x029A59 14:9A49: F1        .byte con_F1, $00, $AF, $10, $CB, $01
- D - I - - 0x029A5F 14:9A4F: F0        .byte con_F0

_off007_9A50_A7:
- D - I - - 0x029A60 14:9A50: F5        .byte con_F5, $80
- D - I - - 0x029A62 14:9A52: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029A67 14:9A57: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x029A6D 14:9A5D: F1        .byte con_F1, $67, $D6, $F0, $B3, $04
- D - I - - 0x029A73 14:9A63: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x029A79 14:9A69: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x029A7F 14:9A6F: 16        .byte $16
- D - I - - 0x029A80 14:9A70: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x029A85 14:9A75: F6        .byte con_F6, $00
- D - I - - 0x029A87 14:9A77: F6        .byte con_F6, $2A
- D - I - - 0x029A89 14:9A79: F6        .byte con_F6, $3F
- D - I - - 0x029A8B 14:9A7B: F1        .byte con_F1, $00, $DD, $20, $BB, $05
- D - I - - 0x029A91 14:9A81: 04        .byte $04
- D - I - - 0x029A92 14:9A82: F1        .byte con_F1, $68, $E3, $20, $BB, $05
- D - I - - 0x029A98 14:9A88: F8        .byte con_F8
- D - I - - 0x029A99 14:9A89: 0C 99     .word off_990C

_off007_9A8B_A8:
- D - I - - 0x029A9B 14:9A8B: F5        .byte con_F5, $84
- D - I - - 0x029A9D 14:9A8D: 18        .byte $18
- D - I - - 0x029A9E 14:9A8E: F4        .byte con_F4, $38, $39, $42, $41
- D - I - - 0x029AA3 14:9A93: F1        .byte con_F1, $00, $AD, $10, $CB, $01
- D - I - - 0x029AA9 14:9A99: F0        .byte con_F0

_off007_9A9A_A9:
- D - I - - 0x029AAA 14:9A9A: F5        .byte con_F5, $84
- D - I - - 0x029AAC 14:9A9C: 19        .byte $19
- D - I - - 0x029AAD 14:9A9D: F8        .byte con_F8
- D - I - - 0x029AAE 14:9A9E: A1 9B     .word off_9BA1

_off007_9AA0_AA:
- D - I - - 0x029AB0 14:9AA0: F5        .byte con_F5, $84
- D - I - - 0x029AB2 14:9AA2: 1A        .byte $1A
off_9AA3:
- D - I - - 0x029AB3 14:9AA3: F4        .byte con_F4, $35, $00, $00, $00
- D - I - - 0x029AB8 14:9AA8: F1        .byte con_F1, $00, $A9, $00, $D3, $01
- D - I - - 0x029ABE 14:9AAE: F0        .byte con_F0

_off007_9AAF_AB:
- D - I - - 0x029ABF 14:9AAF: F5        .byte con_F5, $84
- D - I - - 0x029AC1 14:9AB1: 1B        .byte $1B
off_9AB2:
- D - I - - 0x029AC2 14:9AB2: F4        .byte con_F4, $33, $00, $00, $00
- D - I - - 0x029AC7 14:9AB7: F1        .byte con_F1, $00, $99, $00, $D3, $01
- D - I - - 0x029ACD 14:9ABD: F0        .byte con_F0

_off007_9ABE_AC:
- D - I - - 0x029ACE 14:9ABE: F5        .byte con_F5, $80
- D - I - - 0x029AD0 14:9AC0: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x029AD5 14:9AC5: F7        .byte con_F7, $03, $7B
- D - I - - 0x029AD8 14:9AC8: F1        .byte con_F1, $B4, $29, $E0, $1B, $06
- D - I - - 0x029ADE 14:9ACE: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029AE4 14:9AD4: F0        .byte con_F0

_off007_9AD5_AD:
- D - I - - 0x029AE5 14:9AD5: F5        .byte con_F5, $84
- D - I - - 0x029AE7 14:9AD7: 1D        .byte $1D
off_9AD8:
- D - I - - 0x029AE8 14:9AD8: F4        .byte con_F4, $33, $30, $00, $00
- D - I - - 0x029AED 14:9ADD: F1        .byte con_F1, $00, $9A, $00, $D3, $01
- D - I - - 0x029AF3 14:9AE3: F0        .byte con_F0

_off007_9AE4_AE:
- D - I - - 0x029AF4 14:9AE4: F5        .byte con_F5, $84
- D - I - - 0x029AF6 14:9AE6: 1E        .byte $1E
off_9AE7:
- D - I - - 0x029AF7 14:9AE7: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029AFC 14:9AEC: F1        .byte con_F1, $00, $A7, $00, $D3, $01
- D - I - - 0x029B02 14:9AF2: F0        .byte con_F0

_off007_9AF3_AF:
- D - I - - 0x029B03 14:9AF3: F5        .byte con_F5, $84
- D - I - - 0x029B05 14:9AF5: 1F        .byte $1F
off_9AF6:
- D - I - - 0x029B06 14:9AF6: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029B0B 14:9AFB: F1        .byte con_F1, $00, $A8, $00, $D3, $01
- D - I - - 0x029B11 14:9B01: F0        .byte con_F0

_off007_9B02_B0:
- D - I - - 0x029B12 14:9B02: F5        .byte con_F5, $84
- D - I - - 0x029B14 14:9B04: 20        .byte $20
off_9B05:
- D - I - - 0x029B15 14:9B05: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029B1A 14:9B0A: F1        .byte con_F1, $00, $9B, $00, $D3, $01
- D - I - - 0x029B20 14:9B10: F0        .byte con_F0

_off007_9B11_B1:
- D - I - - 0x029B21 14:9B11: F5        .byte con_F5, $84
- D - I - - 0x029B23 14:9B13: 21        .byte $21
off_9B14:
- D - I - - 0x029B24 14:9B14: F4        .byte con_F4, $34, $00, $00, $00
- D - I - - 0x029B29 14:9B19: F1        .byte con_F1, $00, $9C, $00, $D3, $01
- D - I - - 0x029B2F 14:9B1F: F0        .byte con_F0

_off007_9B20_B2:
- D - I - - 0x029B30 14:9B20: F5        .byte con_F5, $84
- D - I - - 0x029B32 14:9B22: 23        .byte $23
- D - I - - 0x029B33 14:9B23: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029B38 14:9B28: F1        .byte con_F1, $00, $AC, $00, $D3, $01
- D - I - - 0x029B3E 14:9B2E: F0        .byte con_F0

_off007_9B2F_B3:
- D - I - - 0x029B3F 14:9B2F: F5        .byte con_F5, $84
- D - I - - 0x029B41 14:9B31: 24        .byte $24
- D - I - - 0x029B42 14:9B32: F8        .byte con_F8
- D - I - - 0x029B43 14:9B33: 83 9B     .word off_9B83

_off007_9B35_B4:
- D - I - - 0x029B45 14:9B35: F5        .byte con_F5, $84
- D - I - - 0x029B47 14:9B37: 33        .byte $33
- D - I - - 0x029B48 14:9B38: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029B4D 14:9B3D: F1        .byte con_F1, $00, $A6, $00, $D3, $01
- D - I - - 0x029B53 14:9B43: F0        .byte con_F0

_off007_9B44_B5:
- D - I - - 0x029B54 14:9B44: F5        .byte con_F5, $84
- D - I - - 0x029B56 14:9B46: 34        .byte $34
- D - I - - 0x029B57 14:9B47: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029B5C 14:9B4C: F1        .byte con_F1, $00, $A5, $00, $D3, $01
- D - I - - 0x029B62 14:9B52: F0        .byte con_F0

_off007_9B53_B6:
- D - I - - 0x029B63 14:9B53: F5        .byte con_F5, $84
- D - I - - 0x029B65 14:9B55: 35        .byte $35
- D - I - - 0x029B66 14:9B56: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029B6B 14:9B5B: F1        .byte con_F1, $00, $A0, $00, $D3, $01
- D - I - - 0x029B71 14:9B61: F0        .byte con_F0

_off007_9B62_B7:
- D - I - - 0x029B72 14:9B62: F5        .byte con_F5, $84
- D - I - - 0x029B74 14:9B64: 36        .byte $36
- D - I - - 0x029B75 14:9B65: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029B7A 14:9B6A: F1        .byte con_F1, $00, $9F, $00, $D3, $01
- D - I - - 0x029B80 14:9B70: F0        .byte con_F0

_off007_9B71_B8:
- D - I - - 0x029B81 14:9B71: F5        .byte con_F5, $84
- D - I - - 0x029B83 14:9B73: 37        .byte $37
- D - I - - 0x029B84 14:9B74: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029B89 14:9B79: F1        .byte con_F1, $00, $A3, $00, $D3, $01
- D - I - - 0x029B8F 14:9B7F: F0        .byte con_F0

_off007_9B80_B9:
- D - I - - 0x029B90 14:9B80: F5        .byte con_F5, $84
- D - I - - 0x029B92 14:9B82: 38        .byte $38
off_9B83:
- D - I - - 0x029B93 14:9B83: F4        .byte con_F4, $35, $00, $00, $00
- D - I - - 0x029B98 14:9B88: F1        .byte con_F1, $00, $A2, $00, $D3, $01
- D - I - - 0x029B9E 14:9B8E: F0        .byte con_F0

_off007_9B8F_BA:
- D - I - - 0x029B9F 14:9B8F: F5        .byte con_F5, $84
- D - I - - 0x029BA1 14:9B91: 39        .byte $39
- D - I - - 0x029BA2 14:9B92: F4        .byte con_F4, $36, $37, $00, $00
- D - I - - 0x029BA7 14:9B97: F1        .byte con_F1, $00, $A4, $00, $D3, $01
- D - I - - 0x029BAD 14:9B9D: F0        .byte con_F0

_off007_9B9E_BB:
- D - I - - 0x029BAE 14:9B9E: F5        .byte con_F5, $84
- D - I - - 0x029BB0 14:9BA0: 3A        .byte $3A
off_9BA1:
- D - I - - 0x029BB1 14:9BA1: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029BB6 14:9BA6: F1        .byte con_F1, $00, $A1, $00, $D3, $01
- D - I - - 0x029BBC 14:9BAC: F0        .byte con_F0

_off007_9BAD_BC:
- D - I - - 0x029BBD 14:9BAD: F5        .byte con_F5, $84
- D - I - - 0x029BBF 14:9BAF: 3C        .byte $3C
- D - I - - 0x029BC0 14:9BB0: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029BC5 14:9BB5: F1        .byte con_F1, $00, $AB, $00, $D3, $01
- D - I - - 0x029BCB 14:9BBB: F0        .byte con_F0

_off007_9BBC_BD:
- D - I - - 0x029BCC 14:9BBC: F5        .byte con_F5, $84
- D - I - - 0x029BCE 14:9BBE: 84        .byte $84
- D - I - - 0x029BCF 14:9BBF: F4        .byte con_F4, $1D, $00, $80, $48
- D - I - - 0x029BD4 14:9BC4: F1        .byte con_F1, $72, $B2, $08, $CB, $01
- D - I - - 0x029BDA 14:9BCA: F0        .byte con_F0

_off007_9BCB_BE:
- - - - - - 0x029BDB 14:9BCB: F5        .byte con_F5, $17
- - - - - - 0x029BDD 14:9BCD: F4        .byte con_F4, $08, $09, $0A, $0B
- - - - - - 0x029BE2 14:9BD2: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- - - - - - 0x029BE8 14:9BD8: F1        .byte con_F1, $67, $D7, $F0, $B3, $04
- - - - - - 0x029BEE 14:9BDE: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- - - - - - 0x029BF4 14:9BE4: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- - - - - - 0x029BFA 14:9BEA: 16        .byte $16
- - - - - - 0x029BFB 14:9BEB: F4        .byte con_F4, $0A, $0B, $00, $00
- - - - - - 0x029C00 14:9BF0: F6        .byte con_F6, $00
- - - - - - 0x029C02 14:9BF2: F6        .byte con_F6, $2A
- - - - - - 0x029C04 14:9BF4: F6        .byte con_F6, $3F
- - - - - - 0x029C06 14:9BF6: F1        .byte con_F1, $00, $DE, $20, $BB, $05
- - - - - - 0x029C0C 14:9BFC: 04        .byte $04
- - - - - - 0x029C0D 14:9BFD: F1        .byte con_F1, $68, $E4, $20, $BB, $05
- - - - - - 0x029C13 14:9C03: F8        .byte con_F8
- - - - - - 0x029C14 14:9C04: 0C 99     .word off_990C

_off007_9C06_BF:
- D - I - - 0x029C16 14:9C06: F5        .byte con_F5, $80
- D - I - - 0x029C18 14:9C08: F4        .byte con_F4, $13, $00, $00, $0B
- D - I - - 0x029C1D 14:9C0D: F7        .byte con_F7, $03, $7B
- D - I - - 0x029C20 14:9C10: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029C26 14:9C16: F1        .byte con_F1, $B7, $29, $10, $2B, $07
- D - I - - 0x029C2C 14:9C1C: F1        .byte con_F1, $31, $49, $AC, $FF, $0A
- D - I - - 0x029C32 14:9C22: 28        .byte $28
- D - I - - 0x029C33 14:9C23: F4        .byte con_F4, $27, $1F, $00, $0B
- D - I - - 0x029C38 14:9C28: F1        .byte con_F1, $00, $0B, $00, $BB, $05
- D - I - - 0x029C3E 14:9C2E: 04        .byte $04
- D - I - - 0x029C3F 14:9C2F: F1        .byte con_F1, $B5, $C9, $FD, $9F, $08
- D - I - - 0x029C45 14:9C35: F8        .byte con_F8
- D - I - - 0x029C46 14:9C36: 4E 8E     .word off_8E4E

_off007_9C38_C0:
- D - I - - 0x029C48 14:9C38: F5        .byte con_F5, $0D
off_9C3A:
- D - I - - 0x029C4A 14:9C3A: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029C4F 14:9C3F: F1        .byte con_F1, $00, $3D, $00, $C3, $01
- D - I - - 0x029C55 14:9C45: F0        .byte con_F0

_off007_9C46_C1:
- D - I - - 0x029C56 14:9C46: F5        .byte con_F5, $81
off_9C48:
- D - I - - 0x029C58 14:9C48: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029C5D 14:9C4D: F1        .byte con_F1, $BC, $41, $B0, $C3, $00
- D - I - - 0x029C63 14:9C53: F0        .byte con_F0

_off007_9C54_C2:
- D - I - - 0x029C64 14:9C54: F5        .byte con_F5, $80
- D - I - - 0x029C66 14:9C56: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029C6B 14:9C5B: F1        .byte con_F1, $00, $42, $00, $C3, $01
- D - I - - 0x029C71 14:9C61: F0        .byte con_F0

_off007_9C62_C3:
- D - I - - 0x029C72 14:9C62: F5        .byte con_F5, $80
- D - I - - 0x029C74 14:9C64: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029C79 14:9C69: F1        .byte con_F1, $BC, $44, $A0, $C3, $00
- D - I - - 0x029C7F 14:9C6F: F0        .byte con_F0

_off007_9C70_C4:
- D - I - - 0x029C80 14:9C70: F5        .byte con_F5, $80
- D - I - - 0x029C82 14:9C72: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x029C87 14:9C77: F7        .byte con_F7, $23, $5B
- D - I - - 0x029C8A 14:9C7A: F1        .byte con_F1, $BD, $32, $08, $E3, $0D
- D - I - - 0x029C90 14:9C80: F1        .byte con_F1, $D4, $C0, $98, $D3, $08
- D - I - - 0x029C96 14:9C86: F1        .byte con_F1, $00, $00, $80, $A3, $04
- D - I - - 0x029C9C 14:9C8C: F1        .byte con_F1, $00, $00, $80, $DB, $00
- D - I - - 0x029CA2 14:9C92: F0        .byte con_F0

_off007_9C93_C5:
- D - I - - 0x029CA3 14:9C93: F5        .byte con_F5, $80
- D - I - - 0x029CA5 14:9C95: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x029CAA 14:9C9A: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029CB0 14:9CA0: F1        .byte con_F1, $BF, $CF, $F0, $CB, $04
- D - I - - 0x029CB6 14:9CA6: F1        .byte con_F1, $BE, $33, $04, $BB, $09
- D - I - - 0x029CBC 14:9CAC: F0        .byte con_F0

_off007_9CAD_C6:
- D - I - - 0x029CBD 14:9CAD: F5        .byte con_F5, $80
- D - I - - 0x029CBF 14:9CAF: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029CC4 14:9CB4: F1        .byte con_F1, $64, $1D, $20, $BB, $05
- D - I - - 0x029CCA 14:9CBA: F1        .byte con_F1, $65, $1E, $D0, $93, $00
- D - I - - 0x029CD0 14:9CC0: 14        .byte $14
- D - I - - 0x029CD1 14:9CC1: F6        .byte con_F6, $15
- D - I - - 0x029CD3 14:9CC3: F1        .byte con_F1, $C0, $3F, $10, $B3, $01
- D - I - - 0x029CD9 14:9CC9: 04        .byte $04
- D - I - - 0x029CDA 14:9CCA: F1        .byte con_F1, $66, $1D, $10, $B3, $05
- D - I - - 0x029CE0 14:9CD0: F1        .byte con_F1, $D6, $1E, $08, $AF, $01
- D - I - - 0x029CE6 14:9CD6: F0        .byte con_F0

_off007_9CD7_C7:
- D - I - - 0x029CE7 14:9CD7: F5        .byte con_F5, $80
- D - I - - 0x029CE9 14:9CD9: F4        .byte con_F4, $10, $11, $12, $13
- D - I - - 0x029CEE 14:9CDE: F7        .byte con_F7, $03, $7B
- D - I - - 0x029CF1 14:9CE1: F1        .byte con_F1, $C2, $53, $E0, $7B, $0C
- D - I - - 0x029CF7 14:9CE7: F1        .byte con_F1, $00, $00, $80, $83, $00
- D - I - - 0x029CFD 14:9CED: 28        .byte $28
- D - I - - 0x029CFE 14:9CEE: F1        .byte con_F1, $C3, $55, $10, $1B, $07
- D - I - - 0x029D04 14:9CF4: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029D0A 14:9CFA: F0        .byte con_F0

_off007_9CFB_C8:
- D - I - - 0x029D0B 14:9CFB: F5        .byte con_F5, $80
- D - I - - 0x029D0D 14:9CFD: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x029D12 14:9D02: F1        .byte con_F1, $C4, $32, $B8, $BB, $05
- D - I - - 0x029D18 14:9D08: F1        .byte con_F1, $C5, $C0, $E0, $C3, $00
- D - I - - 0x029D1E 14:9D0E: F0        .byte con_F0

_off007_9D0F_C9:
- D - I - - 0x029D1F 14:9D0F: F5        .byte con_F5, $80
- D - I - - 0x029D21 14:9D11: F4        .byte con_F4, $13, $00, $0F, $00
- D - I - - 0x029D26 14:9D16: F7        .byte con_F7, $03, $7B
- D - I - - 0x029D29 14:9D19: F1        .byte con_F1, $C6, $2B, $40, $0B, $0F
- D - I - - 0x029D2F 14:9D1F: 14        .byte $14
- D - I - - 0x029D30 14:9D20: F1        .byte con_F1, $C7, $2A, $00, $1B, $0B
- D - I - - 0x029D36 14:9D26: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029D3C 14:9D2C: 32        .byte $32
- D - I - - 0x029D3D 14:9D2D: F1        .byte con_F1, $DF, $2A, $F8, $5B, $0C
- D - I - - 0x029D43 14:9D33: F0        .byte con_F0

_off007_9D34_CA:
- D - I - - 0x029D44 14:9D34: F5        .byte con_F5, $80
- D - I - - 0x029D46 14:9D36: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x029D4B 14:9D3B: F7        .byte con_F7, $23, $5B
- D - I - - 0x029D4E 14:9D3E: F1        .byte con_F1, $51, $1C, $00, $CB, $0C
- D - I - - 0x029D54 14:9D44: F1        .byte con_F1, $9E, $1E, $68, $A3, $09
- D - I - - 0x029D5A 14:9D4A: F1        .byte con_F1, $00, $00, $80, $A3, $04
- D - I - - 0x029D60 14:9D50: F1        .byte con_F1, $00, $00, $80, $DB, $00
- D - I - - 0x029D66 14:9D56: 1E        .byte $1E
- D - I - - 0x029D67 14:9D57: F6        .byte con_F6, $2A
- D - I - - 0x029D69 14:9D59: F1        .byte con_F1, $29, $47, $E0, $CB, $0C
- D - I - - 0x029D6F 14:9D5F: 02        .byte $02
- D - I - - 0x029D70 14:9D60: F1        .byte con_F1, $2A, $20, $E8, $CB, $0C
- D - I - - 0x029D76 14:9D66: F1        .byte con_F1, $41, $22, $FC, $BB, $08
off_9D6C:
- D - I - - 0x029D7C 14:9D6C: 01        .byte $01
- D - I - - 0x029D7D 14:9D6D: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x029D81 14:9D71: 01        .byte $01
- D - I - - 0x029D82 14:9D72: FB        .byte con_FB, $01, $32, $45
- D - I - - 0x029D86 14:9D76: F8        .byte con_F8
- D - I - - 0x029D87 14:9D77: 6C 9D     .word off_9D6C

_off007_9D79_CB:
- D - I - - 0x029D89 14:9D79: F5        .byte con_F5, $80
- D - I - - 0x029D8B 14:9D7B: F4        .byte con_F4, $2B, $00, $00, $00
- D - I - - 0x029D90 14:9D80: F1        .byte con_F1, $00, $57, $10, $C3, $01
- D - I - - 0x029D96 14:9D86: F0        .byte con_F0

_off007_9D87_CC:
- D - I - - 0x029D97 14:9D87: F5        .byte con_F5, $80
- D - I - - 0x029D99 14:9D89: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029D9E 14:9D8E: F7        .byte con_F7, $23, $5B
- D - I - - 0x029DA1 14:9D91: F1        .byte con_F1, $00, $00, $80, $DB, $00
- D - I - - 0x029DA7 14:9D97: F1        .byte con_F1, $00, $00, $80, $A3, $04
- D - I - - 0x029DAD 14:9D9D: F1        .byte con_F1, $B3, $5F, $70, $FF, $08
- D - I - - 0x029DB3 14:9DA3: F0        .byte con_F0

_off007_9DA4_CD:
- D - I - - 0x029DB4 14:9DA4: F5        .byte con_F5, $80
- D - I - - 0x029DB6 14:9DA6: F4        .byte con_F4, $27, $1E, $00, $0B
- D - I - - 0x029DBB 14:9DAB: F1        .byte con_F1, $B6, $13, $50, $AB, $04
- D - I - - 0x029DC1 14:9DB1: F1        .byte con_F1, $92, $49, $20, $77, $01
- D - I - - 0x029DC7 14:9DB7: F0        .byte con_F0

_off007_9DB8_CE:
- D - I - - 0x029DC8 14:9DB8: F5        .byte con_F5, $09
- D - I - - 0x029DCA 14:9DBA: F4        .byte con_F4, $22, $23, $00, $00
- D - I - - 0x029DCF 14:9DBF: F1        .byte con_F1, $BB, $62, $18, $8B, $01
- D - I - - 0x029DD5 14:9DC5: 01        .byte $01
- D - I - - 0x029DD6 14:9DC6: F1        .byte con_F1, $BB, $62, $18, $8B, $05
- D - I - - 0x029DDC 14:9DCC: 01        .byte $01
- D - I - - 0x029DDD 14:9DCD: F1        .byte con_F1, $BB, $61, $18, $8B, $09
- D - I - - 0x029DE3 14:9DD3: 01        .byte $01
- D - I - - 0x029DE4 14:9DD4: F1        .byte con_F1, $BB, $61, $18, $8B, $0D
- D - I - - 0x029DEA 14:9DDA: 01        .byte $01
- D - I - - 0x029DEB 14:9DDB: F1        .byte con_F1, $BB, $60, $18, $8B, $11
- D - I - - 0x029DF1 14:9DE1: 01        .byte $01
- D - I - - 0x029DF2 14:9DE2: F1        .byte con_F1, $BB, $60, $18, $8B, $15
- D - I - - 0x029DF8 14:9DE8: F0        .byte con_F0

_off007_9DE9_CF:
- D - I - - 0x029DF9 14:9DE9: F5        .byte con_F5, $81
- D - I - - 0x029DFB 14:9DEB: F4        .byte con_F4, $14, $15, $16, $00
- D - I - - 0x029E00 14:9DF0: F1        .byte con_F1, $B9, $52, $B0, $E3, $0C
- D - I - - 0x029E06 14:9DF6: 28        .byte $28
- D - I - - 0x029E07 14:9DF7: F7        .byte con_F7, $23, $5B
- D - I - - 0x029E0A 14:9DFA: F1        .byte con_F1, $00, $00, $80, $A3, $00
- D - I - - 0x029E10 14:9E00: F1        .byte con_F1, $00, $00, $80, $DB, $04
- D - I - - 0x029E16 14:9E06: F0        .byte con_F0

_off007_9E07_D0:
- D - I - - 0x029E17 14:9E07: F5        .byte con_F5, $80
- D - I - - 0x029E19 14:9E09: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029E1E 14:9E0E: F1        .byte con_F1, $D3, $6D, $60, $BB, $05
- D - I - - 0x029E24 14:9E14: F1        .byte con_F1, $D3, $6C, $60, $BB, $01
- D - I - - 0x029E2A 14:9E1A: F1        .byte con_F1, $D3, $6F, $60, $BB, $09
- D - I - - 0x029E30 14:9E20: F0        .byte con_F0

_off007_9E21_D1:
- D - I - - 0x029E31 14:9E21: F5        .byte con_F5, $80
- D - I - - 0x029E33 14:9E23: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029E38 14:9E28: F1        .byte con_F1, $CA, $6D, $20, $C3, $05
- D - I - - 0x029E3E 14:9E2E: F1        .byte con_F1, $CA, $6C, $20, $C3, $01
- D - I - - 0x029E44 14:9E34: F1        .byte con_F1, $CA, $6F, $20, $C3, $09
- D - I - - 0x029E4A 14:9E3A: F0        .byte con_F0

_off007_9E3B_D2:
- D - I - - 0x029E4B 14:9E3B: F5        .byte con_F5, $80
- D - I - - 0x029E4D 14:9E3D: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029E52 14:9E42: F1        .byte con_F1, $C9, $BE, $E0, $C3, $04
- D - I - - 0x029E58 14:9E48: F1        .byte con_F1, $C9, $BB, $E0, $C3, $00
- D - I - - 0x029E5E 14:9E4E: F1        .byte con_F1, $C9, $C1, $E0, $C3, $08
- D - I - - 0x029E64 14:9E54: F0        .byte con_F0

_off007_9E55_D3:
- D - I - - 0x029E65 14:9E55: F5        .byte con_F5, $83
- D - I - - 0x029E67 14:9E57: F4        .byte con_F4, $18, $19, $1A, $1B
- D - I - - 0x029E6C 14:9E5C: F1        .byte con_F1, $13, $17, $F8, $C3, $04
- D - I - - 0x029E72 14:9E62: F1        .byte con_F1, $CE, $15, $80, $EB, $00
- D - I - - 0x029E78 14:9E68: F8        .byte con_F8
- D - I - - 0x029E79 14:9E69: A7 8B     .word off_8BA7

_off007_9E6B_D4:
- D - I - - 0x029E7B 14:9E6B: F5        .byte con_F5, $84
- D - I - - 0x029E7D 14:9E6D: 34        .byte $34
- D - I - - 0x029E7E 14:9E6E: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029E83 14:9E73: F1        .byte con_F1, $CC, $A5, $F8, $D3, $01
- D - I - - 0x029E89 14:9E79: F0        .byte con_F0

_off007_9E7A_D5:
- D - I - - 0x029E8A 14:9E7A: F5        .byte con_F5, $84
- D - I - - 0x029E8C 14:9E7C: 33        .byte $33
- D - I - - 0x029E8D 14:9E7D: F4        .byte con_F4, $30, $31, $32, $00
- D - I - - 0x029E92 14:9E82: F1        .byte con_F1, $CC, $A6, $F8, $D3, $01
- D - I - - 0x029E98 14:9E88: F0        .byte con_F0

_off007_9E89_D6:
- D - I - - 0x029E99 14:9E89: F5        .byte con_F5, $0F
- D - I - - 0x029E9B 14:9E8B: F4        .byte con_F4, $16, $17, $2D, $00
- D - I - - 0x029EA0 14:9E90: F1        .byte con_F1, $00, $69, $00, $C3, $01
- D - I - - 0x029EA6 14:9E96: F0        .byte con_F0

_off007_9E97_D7:
- D - I - - 0x029EA7 14:9E97: F5        .byte con_F5, $80
- D - I - - 0x029EA9 14:9E99: F4        .byte con_F4, $16, $17, $2D, $00
- D - I - - 0x029EAE 14:9E9E: F1        .byte con_F1, $00, $7B, $00, $C3, $01
- D - I - - 0x029EB4 14:9EA4: F0        .byte con_F0

_off007_9EA5_D8:
- D - I - - 0x029EB5 14:9EA5: F5        .byte con_F5, $80
- D - I - - 0x029EB7 14:9EA7: F4        .byte con_F4, $16, $17, $2D, $00
- D - I - - 0x029EBC 14:9EAC: F1        .byte con_F1, $00, $7C, $00, $C3, $01
- D - I - - 0x029EC2 14:9EB2: F0        .byte con_F0

_off007_9EB3_D9:
- D - I - - 0x029EC3 14:9EB3: F5        .byte con_F5, $80
- D - I - - 0x029EC5 14:9EB5: F4        .byte con_F4, $16, $17, $2D, $00
- D - I - - 0x029ECA 14:9EBA: F1        .byte con_F1, $00, $7D, $00, $C3, $01
- D - I - - 0x029ED0 14:9EC0: F0        .byte con_F0

_off007_9EC1_DA:
- D - I - - 0x029ED1 14:9EC1: F5        .byte con_F5, $83
- D - I - - 0x029ED3 14:9EC3: F4        .byte con_F4, $04, $05, $1E, $1F
- D - I - - 0x029ED8 14:9EC8: F1        .byte con_F1, $00, $8C, $1C, $D7, $01
- D - I - - 0x029EDE 14:9ECE: F0        .byte con_F0

_off007_9ECF_DB:
- D - I - - 0x029EDF 14:9ECF: F5        .byte con_F5, $80
- D - I - - 0x029EE1 14:9ED1: F4        .byte con_F4, $10, $11, $12, $13
- D - I - - 0x029EE6 14:9ED6: F7        .byte con_F7, $23, $5B
- D - I - - 0x029EE9 14:9ED9: F1        .byte con_F1, $E0, $6B, $06, $B3, $0C
- D - I - - 0x029EEF 14:9EDF: F1        .byte con_F1, $E0, $C5, $06, $B3, $08
- D - I - - 0x029EF5 14:9EE5: F1        .byte con_F1, $00, $00, $80, $A3, $04
- D - I - - 0x029EFB 14:9EEB: F1        .byte con_F1, $00, $00, $80, $DB, $00
- D - I - - 0x029F01 14:9EF1: 14        .byte $14
- D - I - - 0x029F02 14:9EF2: F1        .byte con_F1, $E1, $C3, $FB, $B3, $15
- D - I - - 0x029F08 14:9EF8: F1        .byte con_F1, $E1, $C2, $FB, $B3, $11
- D - I - - 0x029F0E 14:9EFE: 28        .byte $28
- D - I - - 0x029F0F 14:9EFF: F7        .byte con_F7, $03, $7B
- D - I - - 0x029F12 14:9F02: F6        .byte con_F6, $54
- D - I - - 0x029F14 14:9F04: F6        .byte con_F6, $69
- D - I - - 0x029F16 14:9F06: F1        .byte con_F1, $00, $C3, $38, $B3, $0D
- D - I - - 0x029F1C 14:9F0C: F1        .byte con_F1, $00, $C2, $38, $B3, $09
- D - I - - 0x029F22 14:9F12: F1        .byte con_F1, $00, $6B, $C8, $B3, $04
- D - I - - 0x029F28 14:9F18: F1        .byte con_F1, $00, $6A, $C8, $B3, $00
- D - I - - 0x029F2E 14:9F1E: F0        .byte con_F0

_off007_9F1F_DC:
- D - I - - 0x029F2F 14:9F1F: F5        .byte con_F5, $80
- D - I - - 0x029F31 14:9F21: F4        .byte con_F4, $04, $05, $20, $21
- D - I - - 0x029F36 14:9F26: F7        .byte con_F7, $03, $7B
- D - I - - 0x029F39 14:9F29: F1        .byte con_F1, $00, $54, $10, $BB, $09
- D - I - - 0x029F3F 14:9F2F: F1        .byte con_F1, $00, $71, $00, $CB, $05
- D - I - - 0x029F45 14:9F35: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x029F4B 14:9F3B: F0        .byte con_F0

_off007_9F3C_DD:
- D - I - - 0x029F4C 14:9F3C: F5        .byte con_F5, $80
- D - I - - 0x029F4E 14:9F3E: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029F53 14:9F43: F1        .byte con_F1, $CF, $4D, $00, $C3, $05
- D - I - - 0x029F59 14:9F49: F1        .byte con_F1, $CF, $4B, $00, $C3, $01
- D - I - - 0x029F5F 14:9F4F: F1        .byte con_F1, $CF, $58, $00, $C3, $09
- D - I - - 0x029F65 14:9F55: F0        .byte con_F0

_off007_9F56_DE:
- D - I - - 0x029F66 14:9F56: F5        .byte con_F5, $09
- D - I - - 0x029F68 14:9F58: F4        .byte con_F4, $60, $61, $62, $63
- D - I - - 0x029F6D 14:9F5D: F1        .byte con_F1, $0F, $79, $F0, $BB, $01
- D - I - - 0x029F73 14:9F63: EF        .byte $EF
- D - I - - 0x029F74 14:9F64: EF        .byte $EF
- D - I - - 0x029F75 14:9F65: 20        .byte $20
- D - I - - 0x029F76 14:9F66: F1        .byte con_F1, $00, $82, $F0, $BB, $00
- D - I - - 0x029F7C 14:9F6C: F0        .byte con_F0

_off007_9F6D_DF:
- - - - - - 0x029F7D 14:9F6D: F5        .byte con_F5, $18
- - - - - - 0x029F7F 14:9F6F: F4        .byte con_F4, $08, $09, $0A, $0B
- - - - - - 0x029F84 14:9F74: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- - - - - - 0x029F8A 14:9F7A: F1        .byte con_F1, $67, $D4, $F0, $B3, $04
- - - - - - 0x029F90 14:9F80: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- - - - - - 0x029F96 14:9F86: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- - - - - - 0x029F9C 14:9F8C: 16        .byte $16
- - - - - - 0x029F9D 14:9F8D: F4        .byte con_F4, $0A, $0B, $00, $00
- - - - - - 0x029FA2 14:9F92: F6        .byte con_F6, $00
- - - - - - 0x029FA4 14:9F94: F6        .byte con_F6, $2A
- - - - - - 0x029FA6 14:9F96: F6        .byte con_F6, $3F
- - - - - - 0x029FA8 14:9F98: F1        .byte con_F1, $00, $DB, $20, $BB, $05
- - - - - - 0x029FAE 14:9F9E: 04        .byte $04
- - - - - - 0x029FAF 14:9F9F: F1        .byte con_F1, $68, $E1, $20, $BB, $05
- - - - - - 0x029FB5 14:9FA5: F8        .byte con_F8
- - - - - - 0x029FB6 14:9FA6: 0C 99     .word off_990C

_off007_9FA8_E0:
- D - I - - 0x029FB8 14:9FA8: F5        .byte con_F5, $14
- D - I - - 0x029FBA 14:9FAA: F4        .byte con_F4, $74, $75, $7B, $67
- D - I - - 0x029FBF 14:9FAF: F1        .byte con_F1, $00, $81, $00, $D3, $01
- D - I - - 0x029FC5 14:9FB5: EF        .byte $EF
- D - I - - 0x029FC6 14:9FB6: F5        .byte con_F5, $0C
- D - I - - 0x029FC8 14:9FB8: F4        .byte con_F4, $6C, $6D, $6E, $6F
- D - I - - 0x029FCD 14:9FBD: F1        .byte con_F1, $D5, $78, $F8, $D3, $00
- D - I - - 0x029FD3 14:9FC3: F0        .byte con_F0

_off007_9FC4_E1:
- D - I - - 0x029FD4 14:9FC4: F5        .byte con_F5, $0E
- D - I - - 0x029FD6 14:9FC6: F8        .byte con_F8
- D - I - - 0x029FD7 14:9FC7: 3A 9C     .word off_9C3A

_off007_9FC9_E2:
- D - I - - 0x029FD9 14:9FC9: F5        .byte con_F5, $80
- D - I - - 0x029FDB 14:9FCB: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x029FE0 14:9FD0: F1        .byte con_F1, $DC, $4D, $60, $B3, $05
- D - I - - 0x029FE6 14:9FD6: F1        .byte con_F1, $DC, $4B, $60, $B3, $01
- D - I - - 0x029FEC 14:9FDC: F1        .byte con_F1, $DC, $58, $60, $B3, $09
- D - I - - 0x029FF2 14:9FE2: 1E        .byte $1E
- D - I - - 0x029FF3 14:9FE3: F1        .byte con_F1, $DD, $4F, $20, $C3, $09
- D - I - - 0x029FF9 14:9FE9: F1        .byte con_F1, $DD, $4D, $20, $C3, $05
- D - I - - 0x029FFF 14:9FEF: F1        .byte con_F1, $DD, $4B, $20, $C3, $01
- D - I - - 0x02A005 14:9FF5: F1        .byte con_F1, $D7, $49, $08, $EB, $0D
- D - I - - 0x02A00B 14:9FFB: F9        .byte con_F9, $0F
- D - I - - 0x02A00D 14:9FFD: 01        .byte $01
- D - I - - 0x02A00E 14:9FFE: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x02A012 14:A002: 01        .byte $01
- D - I - - 0x02A013 14:A003: FB        .byte con_FB, $03, $12, $45
- D - I - - 0x02A017 14:A007: FA        .byte con_FA
- D - I - - 0x02A018 14:A008: F6        .byte con_F6, $2A
- D - I - - 0x02A01A 14:A00A: F6        .byte con_F6, $3F
- D - I - - 0x02A01C 14:A00C: F6        .byte con_F6, $00
- D - I - - 0x02A01E 14:A00E: F4        .byte con_F4, $06, $00, $00, $00
- D - I - - 0x02A023 14:A013: F1        .byte con_F1, $C8, $63, $50, $E3, $05
- D - I - - 0x02A029 14:A019: 03        .byte $03
- D - I - - 0x02A02A 14:A01A: F1        .byte con_F1, $C8, $E8, $50, $E3, $09
- D - I - - 0x02A030 14:A020: 03        .byte $03
- D - I - - 0x02A031 14:A021: F1        .byte con_F1, $C8, $E8, $50, $E3, $0D
- D - I - - 0x02A037 14:A027: 03        .byte $03
- D - I - - 0x02A038 14:A028: F1        .byte con_F1, $C8, $E9, $50, $E3, $11
- D - I - - 0x02A03E 14:A02E: 03        .byte $03
- D - I - - 0x02A03F 14:A02F: F1        .byte con_F1, $C8, $EA, $50, $E3, $15
off_A035:
- D - I - - 0x02A045 14:A035: 01        .byte $01
- D - I - - 0x02A046 14:A036: FB        .byte con_FB, $01, $34, $52
- D - I - - 0x02A04A 14:A03A: 01        .byte $01
- D - I - - 0x02A04B 14:A03B: FB        .byte con_FB, $01, $45, $23
- D - I - - 0x02A04F 14:A03F: 01        .byte $01
- D - I - - 0x02A050 14:A040: FB        .byte con_FB, $01, $52, $34
- D - I - - 0x02A054 14:A044: 01        .byte $01
- D - I - - 0x02A055 14:A045: FB        .byte con_FB, $01, $23, $45
- D - I - - 0x02A059 14:A049: F8        .byte con_F8
- D - I - - 0x02A05A 14:A04A: 35 A0     .word off_A035

_off007_A04C_E3:
- D - I - - 0x02A05C 14:A04C: F5        .byte con_F5, $81
- D - I - - 0x02A05E 14:A04E: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02A063 14:A053: F1        .byte con_F1, $8B, $6E, $80, $BB, $09
- D - I - - 0x02A069 14:A059: F1        .byte con_F1, $8B, $6D, $80, $BB, $05
- D - I - - 0x02A06F 14:A05F: F1        .byte con_F1, $8B, $6C, $80, $BB, $01
- D - I - - 0x02A075 14:A065: F0        .byte con_F0

_off007_A066_E4:
- D - I - - 0x02A076 14:A066: F5        .byte con_F5, $80
- D - I - - 0x02A078 14:A068: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02A07D 14:A06D: F1        .byte con_F1, $E4, $4F, $21, $BA, $0D
- D - I - - 0x02A083 14:A073: F1        .byte con_F1, $E4, $4D, $21, $BA, $09
- D - I - - 0x02A089 14:A079: F1        .byte con_F1, $E4, $4B, $21, $BA, $05
- D - I - - 0x02A08F 14:A07F: F1        .byte con_F1, $D8, $49, $08, $3B, $01
- D - I - - 0x02A095 14:A085: 28        .byte $28
- D - I - - 0x02A096 14:A086: F6        .byte con_F6, $00
- D - I - - 0x02A098 14:A088: F1        .byte con_F1, $00, $58, $00, $C3, $0D
- D - I - - 0x02A09E 14:A08E: F0        .byte con_F0

_off007_A08F_E5:
- D - I - - 0x02A09F 14:A08F: F5        .byte con_F5, $80
- D - I - - 0x02A0A1 14:A091: F4        .byte con_F4, $06, $00, $21, $26
- D - I - - 0x02A0A6 14:A096: F1        .byte con_F1, $C0, $51, $06, $B3, $05
- D - I - - 0x02A0AC 14:A09C: F1        .byte con_F1, $C1, $16, $00, $BF, $01
- D - I - - 0x02A0B2 14:A0A2: F0        .byte con_F0

_off007_A0A3_E6:
- D - I - - 0x02A0B3 14:A0A3: F5        .byte con_F5, $87
- D - I - - 0x02A0B5 14:A0A5: F8        .byte con_F8
- D - I - - 0x02A0B6 14:A0A6: 1A 96     .word off_961A

_off007_A0A8_E7:
- D - I - - 0x02A0B8 14:A0A8: F5        .byte con_F5, $80
- D - I - - 0x02A0BA 14:A0AA: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02A0BF 14:A0AF: F1        .byte con_F1, $42, $C8, $80, $BB, $04
- D - I - - 0x02A0C5 14:A0B5: F1        .byte con_F1, $42, $97, $80, $BB, $00
- D - I - - 0x02A0CB 14:A0BB: F8        .byte con_F8
- D - I - - 0x02A0CC 14:A0BC: B5 94     .word off_94B5

_off007_A0BE_E8:
- D - I - - 0x02A0CE 14:A0BE: F5        .byte con_F5, $80
- D - I - - 0x02A0D0 14:A0C0: F4        .byte con_F4, $0C, $0D, $0E, $0F
- D - I - - 0x02A0D5 14:A0C5: F7        .byte con_F7, $03, $7B
- D - I - - 0x02A0D8 14:A0C8: F1        .byte con_F1, $2F, $D0, $D0, $BB, $08
- D - I - - 0x02A0DE 14:A0CE: F1        .byte con_F1, $9E, $1E, $68, $93, $05
- D - I - - 0x02A0E4 14:A0D4: 1E        .byte $1E
- D - I - - 0x02A0E5 14:A0D5: F6        .byte con_F6, $15
- D - I - - 0x02A0E7 14:A0D7: F1        .byte con_F1, $29, $D1, $E0, $BB, $08
- D - I - - 0x02A0ED 14:A0DD: 02        .byte $02
- D - I - - 0x02A0EE 14:A0DE: F1        .byte con_F1, $2A, $D2, $E8, $BB, $08
- D - I - - 0x02A0F4 14:A0E4: F8        .byte con_F8
- D - I - - 0x02A0F5 14:A0E5: 32 91     .word off_9132

_off007_A0EA_E9:
- D - I - - 0x02A0FA 14:A0EA: F5        .byte con_F5, $80
- D - I - - 0x02A0FC 14:A0EC: F4        .byte con_F4, $16, $17, $2D, $53
- D - I - - 0x02A101 14:A0F1: F1        .byte con_F1, $00, $74, $00, $C3, $01
- D - I - - 0x02A107 14:A0F7: F0        .byte con_F0

_off007_A0F8_EA:
- D - I - - 0x02A108 14:A0F8: F5        .byte con_F5, $11
- D - I - - 0x02A10A 14:A0FA: F4        .byte con_F4, $28, $29, $2A, $0B
- D - I - - 0x02A10F 14:A0FF: F1        .byte con_F1, $39, $73, $E8, $BB, $00
- D - I - - 0x02A115 14:A105: F0        .byte con_F0

_off007_A106_EB:
- D - I - - 0x02A116 14:A106: F5        .byte con_F5, $80
- D - I - - 0x02A118 14:A108: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x02A11D 14:A10D: F7        .byte con_F7, $03, $7B
- D - I - - 0x02A120 14:A110: F1        .byte con_F1, $B4, $75, $B0, $1B, $06
off_A116:
- D - I - - 0x02A126 14:A116: F1        .byte con_F1, $00, $00, $80, $FB, $00
- D - I - - 0x02A12C 14:A11C: F0        .byte con_F0

_off007_A11D_EC:
- D - I - - 0x02A12D 14:A11D: F5        .byte con_F5, $80
- D - I - - 0x02A12F 14:A11F: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x02A134 14:A124: F7        .byte con_F7, $03, $7B
- D - I - - 0x02A137 14:A127: F1        .byte con_F1, $B4, $76, $B0, $1B, $06
- D - I - - 0x02A13D 14:A12D: F8        .byte con_F8
- D - I - - 0x02A13E 14:A12E: 16 A1     .word off_A116

_off007_A130_ED:
- D - I - - 0x02A140 14:A130: F5        .byte con_F5, $80
- D - I - - 0x02A142 14:A132: F4        .byte con_F4, $13, $00, $00, $00
- D - I - - 0x02A147 14:A137: F1        .byte con_F1, $40, $77, $D8, $CB, $00
- D - I - - 0x02A14D 14:A13D: F0        .byte con_F0

_off007_A13E_EE:
- D - I - - 0x02A14E 14:A13E: F5        .byte con_F5, $80
- D - I - - 0x02A150 14:A140: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02A155 14:A145: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x02A15B 14:A14B: F1        .byte con_F1, $67, $D8, $F0, $B3, $04
- D - I - - 0x02A161 14:A151: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x02A167 14:A157: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x02A16D 14:A15D: 14        .byte $14
- D - I - - 0x02A16E 14:A15E: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x02A173 14:A163: F6        .byte con_F6, $00
- D - I - - 0x02A175 14:A165: F6        .byte con_F6, $2A
- D - I - - 0x02A177 14:A167: F6        .byte con_F6, $3F
- D - I - - 0x02A179 14:A169: F1        .byte con_F1, $00, $DF, $20, $BB, $05
- D - I - - 0x02A17F 14:A16F: 04        .byte $04
- D - I - - 0x02A180 14:A170: F1        .byte con_F1, $68, $E5, $20, $BB, $05
- D - I - - 0x02A186 14:A176: F8        .byte con_F8
- D - I - - 0x02A187 14:A177: 0C 99     .word off_990C

_off007_A179_EF:
- D - I - - 0x02A189 14:A179: F5        .byte con_F5, $80
- D - I - - 0x02A18B 14:A17B: F4        .byte con_F4, $08, $09, $0A, $0B
- D - I - - 0x02A190 14:A180: F1        .byte con_F1, $AC, $49, $9C, $63, $00
- D - I - - 0x02A196 14:A186: F1        .byte con_F1, $67, $B9, $F0, $B3, $04
- D - I - - 0x02A19C 14:A18C: F1        .byte con_F1, $67, $95, $F0, $B3, $08
- D - I - - 0x02A1A2 14:A192: F1        .byte con_F1, $67, $96, $F0, $B3, $0C
- D - I - - 0x02A1A8 14:A198: 14        .byte $14
- D - I - - 0x02A1A9 14:A199: F4        .byte con_F4, $0A, $0B, $00, $00
- D - I - - 0x02A1AE 14:A19E: F6        .byte con_F6, $00
- D - I - - 0x02A1B0 14:A1A0: F6        .byte con_F6, $2A
- D - I - - 0x02A1B2 14:A1A2: F6        .byte con_F6, $3F
- D - I - - 0x02A1B4 14:A1A4: F1        .byte con_F1, $00, $C7, $20, $BB, $05
- D - I - - 0x02A1BA 14:A1AA: 04        .byte $04
- D - I - - 0x02A1BB 14:A1AB: F1        .byte con_F1, $68, $E6, $20, $BB, $05
- D - I - - 0x02A1C1 14:A1B1: F8        .byte con_F8
- D - I - - 0x02A1C2 14:A1B2: 0C 99     .word off_990C



tbl_A1B4:
- D - I - - 0x02A1C4 14:A1B4: 8A A3     .word off_A38A_00
- D - I - - 0x02A1C6 14:A1B6: 91 A3     .word off_A391_01
- D - I - - 0x02A1C8 14:A1B8: 98 A3     .word off_A398_02
- D - I - - 0x02A1CA 14:A1BA: 9F A3     .word off_A39F_03
- D - I - - 0x02A1CC 14:A1BC: A6 A3     .word off_A3A6_04
- D - I - - 0x02A1CE 14:A1BE: AD A3     .word off_A3AD_05
- D - I - - 0x02A1D0 14:A1C0: B4 A3     .word off_A3B4_06
- D - I - - 0x02A1D2 14:A1C2: BB A3     .word off_A3BB_07
- D - I - - 0x02A1D4 14:A1C4: C2 A3     .word off_A3C2_08
- D - I - - 0x02A1D6 14:A1C6: C9 A3     .word off_A3C9_09
- D - I - - 0x02A1D8 14:A1C8: D0 A3     .word off_A3D0_0A
- D - I - - 0x02A1DA 14:A1CA: D7 A3     .word off_A3D7_0B
- D - I - - 0x02A1DC 14:A1CC: DE A3     .word off_A3DE_0C
- - - - - - 0x02A1DE 14:A1CE: E5 A3     .word off_A3E5_0D
- D - I - - 0x02A1E0 14:A1D0: FA A3     .word off_A3FA_0E
- D - I - - 0x02A1E2 14:A1D2: 01 A4     .word off_A401_0F
- D - I - - 0x02A1E4 14:A1D4: 0B A4     .word off_A40B_10
- D - I - - 0x02A1E6 14:A1D6: 12 A4     .word off_A412_11
- D - I - - 0x02A1E8 14:A1D8: 19 A4     .word off_A419_12
- D - I - - 0x02A1EA 14:A1DA: 20 A4     .word off_A420_13
- D - I - - 0x02A1EC 14:A1DC: 2D A4     .word off_A42D_14
- D - I - - 0x02A1EE 14:A1DE: 34 A4     .word off_A434_15
- D - I - - 0x02A1F0 14:A1E0: 3B A4     .word off_A43B_16
- D - I - - 0x02A1F2 14:A1E2: 42 A4     .word off_A442_17
- D - I - - 0x02A1F4 14:A1E4: 49 A4     .word off_A449_18
- D - I - - 0x02A1F6 14:A1E6: 50 A4     .word off_A450_19
- D - I - - 0x02A1F8 14:A1E8: 57 A4     .word off_A457_1A
- D - I - - 0x02A1FA 14:A1EA: 5E A4     .word off_A45E_1B
- D - I - - 0x02A1FC 14:A1EC: 65 A4     .word off_A465_1C
- D - I - - 0x02A1FE 14:A1EE: 6C A4     .word off_A46C_1D
- - - - - - 0x02A200 14:A1F0: 73 A4     .word off_A473_1E
- D - I - - 0x02A202 14:A1F2: 7A A4     .word off_A47A_1F
- D - I - - 0x02A204 14:A1F4: 81 A4     .word off_A481_20
- D - I - - 0x02A206 14:A1F6: 88 A4     .word off_A488_21
- D - I - - 0x02A208 14:A1F8: 8F A4     .word off_A48F_22
- D - I - - 0x02A20A 14:A1FA: 96 A4     .word off_A496_23
- D - I - - 0x02A20C 14:A1FC: 9D A4     .word off_A49D_24
- D - I - - 0x02A20E 14:A1FE: A4 A4     .word off_A4A4_25
- D - I - - 0x02A210 14:A200: AB A4     .word off_A4AB_26
- D - I - - 0x02A212 14:A202: B2 A4     .word off_A4B2_27
- D - I - - 0x02A214 14:A204: B9 A4     .word off_A4B9_28
- D - I - - 0x02A216 14:A206: C0 A4     .word off_A4C0_29
- D - I - - 0x02A218 14:A208: C7 A4     .word off_A4C7_2A
- - - - - - 0x02A21A 14:A20A: CE A4     .word off_A4CE_2B
- D - I - - 0x02A21C 14:A20C: D5 A4     .word off_A4D5_2C
- D - I - - 0x02A21E 14:A20E: EC A4     .word off_A4EC_2D
- D - I - - 0x02A220 14:A210: F3 A4     .word off_A4F3_2E
- D - I - - 0x02A222 14:A212: F6 A4     .word off_A4F6_2F
- D - I - - 0x02A224 14:A214: FD A4     .word off_A4FD_30
- D - I - - 0x02A226 14:A216: 0A A5     .word off_A50A_31
- D - I - - 0x02A228 14:A218: 11 A5     .word off_A511_32
- D - I - - 0x02A22A 14:A21A: 18 A5     .word off_A518_33
- D - I - - 0x02A22C 14:A21C: 1F A5     .word off_A51F_34
- D - I - - 0x02A22E 14:A21E: 26 A5     .word off_A526_35
- D - I - - 0x02A230 14:A220: 37 A5     .word off_A537_36
- D - I - - 0x02A232 14:A222: 3E A5     .word off_A53E_37
- D - I - - 0x02A234 14:A224: 45 A5     .word off_A545_38
- D - I - - 0x02A236 14:A226: 4C A5     .word off_A54C_39
- D - I - - 0x02A238 14:A228: 53 A5     .word off_A553_3A
- D - I - - 0x02A23A 14:A22A: 5A A5     .word off_A55A_3B
- D - I - - 0x02A23C 14:A22C: 6B A5     .word off_A56B_3C
- D - I - - 0x02A23E 14:A22E: 72 A5     .word off_A572_3D
- D - I - - 0x02A240 14:A230: 79 A5     .word off_A579_3E
- D - I - - 0x02A242 14:A232: 84 A5     .word off_A584_3F
- D - I - - 0x02A244 14:A234: 8B A5     .word off_A58B_40
- D - I - - 0x02A246 14:A236: 92 A5     .word off_A592_41
- D - I - - 0x02A248 14:A238: 99 A5     .word off_A599_42
- D - I - - 0x02A24A 14:A23A: A0 A5     .word off_A5A0_43
- - - - - - 0x02A24C 14:A23C: AD A5     .word off_A5AD_44
- - - - - - 0x02A24E 14:A23E: BC A5     .word off_A5BC_45
- D - I - - 0x02A250 14:A240: CB A5     .word off_A5CB_46
- - - - - - 0x02A252 14:A242: D2 A5     .word off_A5D2_47
- D - I - - 0x02A254 14:A244: D3 A5     .word off_A5D3_48
- D - I - - 0x02A256 14:A246: E8 A5     .word off_A5E8_49
- D - I - - 0x02A258 14:A248: EF A5     .word off_A5EF_4A
- D - I - - 0x02A25A 14:A24A: F6 A5     .word off_A5F6_4B
- D - I - - 0x02A25C 14:A24C: FD A5     .word off_A5FD_4C
- D - I - - 0x02A25E 14:A24E: 04 A6     .word off_A604_4D
- D - I - - 0x02A260 14:A250: 11 A6     .word off_A611_4E
- - - - - - 0x02A262 14:A252: 18 A6     .word off_A618_4F
- - - - - - 0x02A264 14:A254: 43 A6     .word off_A643_50
- D - I - - 0x02A266 14:A256: 4A A6     .word off_A64A_51
- D - I - - 0x02A268 14:A258: 51 A6     .word off_A651_52
- D - I - - 0x02A26A 14:A25A: 58 A6     .word off_A658_53
- D - I - - 0x02A26C 14:A25C: 5F A6     .word off_A65F_54
- - - - - - 0x02A26E 14:A25E: 66 A6     .word off_A666_55
- - - - - - 0x02A270 14:A260: 67 A6     .word off_A667_56
- - - - - - 0x02A272 14:A262: 68 A6     .word off_A668_57
- - - - - - 0x02A274 14:A264: 69 A6     .word off_A669_58
- D - I - - 0x02A276 14:A266: 6A A6     .word off_A66A_59
- D - I - - 0x02A278 14:A268: 7D A6     .word off_A67D_5A
- - - - - - 0x02A27A 14:A26A: 84 A6     .word off_A684_5B
- - - - - - 0x02A27C 14:A26C: 8B A6     .word off_A68B_5C
- D - I - - 0x02A27E 14:A26E: 92 A6     .word off_A692_5D
- D - I - - 0x02A280 14:A270: 99 A6     .word off_A699_5E
- D - I - - 0x02A282 14:A272: A0 A6     .word off_A6A0_5F
- D - I - - 0x02A284 14:A274: AB A6     .word off_A6AB_60
- D - I - - 0x02A286 14:A276: B6 A6     .word off_A6B6_61
- D - I - - 0x02A288 14:A278: C7 A6     .word off_A6C7_62
- D - I - - 0x02A28A 14:A27A: CE A6     .word off_A6CE_63
- D - I - - 0x02A28C 14:A27C: D5 A6     .word off_A6D5_64
- D - I - - 0x02A28E 14:A27E: DC A6     .word off_A6DC_65
- D - I - - 0x02A290 14:A280: E3 A6     .word off_A6E3_66
- D - I - - 0x02A292 14:A282: EA A6     .word off_A6EA_67
- D - I - - 0x02A294 14:A284: F1 A6     .word off_A6F1_68
- D - I - - 0x02A296 14:A286: F8 A6     .word off_A6F8_69
- D - I - - 0x02A298 14:A288: FF A6     .word off_A6FF_6A
- D - I - - 0x02A29A 14:A28A: 06 A7     .word off_A706_6B
- D - I - - 0x02A29C 14:A28C: 0D A7     .word off_A70D_6C
- D - I - - 0x02A29E 14:A28E: 14 A7     .word off_A714_6D
- D - I - - 0x02A2A0 14:A290: 1B A7     .word off_A71B_6E
- - - - - - 0x02A2A2 14:A292: 22 A7     .word off_A722_6F
- D - I - - 0x02A2A4 14:A294: 23 A7     .word off_A723_70
- D - I - - 0x02A2A6 14:A296: 2C A7     .word off_A72C_71
- D - I - - 0x02A2A8 14:A298: 35 A7     .word off_A735_72
- D - I - - 0x02A2AA 14:A29A: 42 A7     .word off_A742_73
- - - - - - 0x02A2AC 14:A29C: 49 A7     .word off_A749_74
- D - I - - 0x02A2AE 14:A29E: 50 A7     .word off_A750_75
- D - I - - 0x02A2B0 14:A2A0: 5B A7     .word off_A75B_76
- D - I - - 0x02A2B2 14:A2A2: 62 A7     .word off_A762_77
- - - - - - 0x02A2B4 14:A2A4: 6D A7     .word off_A76D_78
- - - - - - 0x02A2B6 14:A2A6: 6E A7     .word off_A76E_79
- D - I - - 0x02A2B8 14:A2A8: 6F A7     .word off_A76F_7A
- - - - - - 0x02A2BA 14:A2AA: 7A A7     .word off_A77A_7B
- D - I - - 0x02A2BC 14:A2AC: 8F A7     .word off_A78F_7C
- - - - - - 0x02A2BE 14:A2AE: 9A A7     .word off_A79A_7D
- D - I - - 0x02A2C0 14:A2B0: 9B A7     .word off_A79B_7E
- - - - - - 0x02A2C2 14:A2B2: A6 A7     .word off_A7A6_7F
- D - I - - 0x02A2C4 14:A2B4: B1 A7     .word off_A7B1_80
- D - I - - 0x02A2C6 14:A2B6: BC A7     .word off_A7BC_81
- - - - - - 0x02A2C8 14:A2B8: C7 A7     .word off_A7C7_82
- D - I - - 0x02A2CA 14:A2BA: D2 A7     .word off_A7D2_83
- D - I - - 0x02A2CC 14:A2BC: DD A7     .word off_A7DD_84
- D - I - - 0x02A2CE 14:A2BE: FC A7     .word off_A7FC_85
- D - I - - 0x02A2D0 14:A2C0: 11 A8     .word off_A811_86
- D - I - - 0x02A2D2 14:A2C2: 1C A8     .word off_A81C_87
- D - I - - 0x02A2D4 14:A2C4: 2D A8     .word off_A82D_88
- D - I - - 0x02A2D6 14:A2C6: 3E A8     .word off_A83E_89
- D - I - - 0x02A2D8 14:A2C8: 49 A8     .word off_A849_8A
- D - I - - 0x02A2DA 14:A2CA: 50 A8     .word off_A850_8B
- D - I - - 0x02A2DC 14:A2CC: 57 A8     .word off_A857_8C
- D - I - - 0x02A2DE 14:A2CE: 5E A8     .word off_A85E_8D
- D - I - - 0x02A2E0 14:A2D0: 65 A8     .word off_A865_8E
- D - I - - 0x02A2E2 14:A2D2: 6C A8     .word off_A86C_8F
- D - I - - 0x02A2E4 14:A2D4: 73 A8     .word off_A873_90
- D - I - - 0x02A2E6 14:A2D6: 7A A8     .word off_A87A_91
- D - I - - 0x02A2E8 14:A2D8: 85 A8     .word off_A885_92
- D - I - - 0x02A2EA 14:A2DA: 92 A8     .word off_A892_93
- D - I - - 0x02A2EC 14:A2DC: A7 A8     .word off_A8A7_94
- D - I - - 0x02A2EE 14:A2DE: B8 A8     .word off_A8B8_95
- - - - - - 0x02A2F0 14:A2E0: BF A8     .word off_A8BF_96
- D - I - - 0x02A2F2 14:A2E2: CA A8     .word off_A8CA_97
- D - I - - 0x02A2F4 14:A2E4: D1 A8     .word off_A8D1_98
- D - I - - 0x02A2F6 14:A2E6: D8 A8     .word off_A8D8_99
- D - I - - 0x02A2F8 14:A2E8: DF A8     .word off_A8DF_9A
- D - I - - 0x02A2FA 14:A2EA: F0 A8     .word off_A8F0_9B
- D - I - - 0x02A2FC 14:A2EC: 01 A9     .word off_A901_9C
- D - I - - 0x02A2FE 14:A2EE: 08 A9     .word off_A908_9D
- D - I - - 0x02A300 14:A2F0: 13 A9     .word off_A913_9E
- D - I - - 0x02A302 14:A2F2: 1E A9     .word off_A91E_9F
- D - I - - 0x02A304 14:A2F4: 25 A9     .word off_A925_A0
- D - I - - 0x02A306 14:A2F6: 2C A9     .word off_A92C_A1
- D - I - - 0x02A308 14:A2F8: 37 A9     .word off_A937_A2
- D - I - - 0x02A30A 14:A2FA: 3E A9     .word off_A93E_A3
- - - - - - 0x02A30C 14:A2FC: 49 A9     .word off_A949_A4
- D - I - - 0x02A30E 14:A2FE: 4A A9     .word off_A94A_A5
- D - I - - 0x02A310 14:A300: 55 A9     .word off_A955_A6
- D - I - - 0x02A312 14:A302: 5C A9     .word off_A95C_A7
- D - I - - 0x02A314 14:A304: 67 A9     .word off_A967_A8
- D - I - - 0x02A316 14:A306: 6E A9     .word off_A96E_A9
- D - I - - 0x02A318 14:A308: 79 A9     .word off_A979_AA
- D - I - - 0x02A31A 14:A30A: 84 A9     .word off_A984_AB
- D - I - - 0x02A31C 14:A30C: 8F A9     .word off_A98F_AC
- D - I - - 0x02A31E 14:A30E: 96 A9     .word off_A996_AD
- D - I - - 0x02A320 14:A310: 9D A9     .word off_A99D_AE
- D - I - - 0x02A322 14:A312: A8 A9     .word off_A9A8_AF
- D - I - - 0x02A324 14:A314: B3 A9     .word off_A9B3_B0
- D - I - - 0x02A326 14:A316: BE A9     .word off_A9BE_B1
- D - I - - 0x02A328 14:A318: D3 A9     .word off_A9D3_B2
- D - I - - 0x02A32A 14:A31A: DA A9     .word off_A9DA_B3
- D - I - - 0x02A32C 14:A31C: E1 A9     .word off_A9E1_B4
- D - I - - 0x02A32E 14:A31E: E8 A9     .word off_A9E8_B5
- D - I - - 0x02A330 14:A320: EF A9     .word off_A9EF_B6
- D - I - - 0x02A332 14:A322: FC A9     .word off_A9FC_B7
- - - - - - 0x02A334 14:A324: 07 AA     .word off_AA07_B8
- D - I - - 0x02A336 14:A326: 08 AA     .word off_AA08_B9
- - - - - - 0x02A338 14:A328: 0F AA     .word off_AA0F_BA
- D - I - - 0x02A33A 14:A32A: 10 AA     .word off_AA10_BB
- D - I - - 0x02A33C 14:A32C: 17 AA     .word off_AA17_BC
- D - I - - 0x02A33E 14:A32E: 1E AA     .word off_AA1E_BD
- D - I - - 0x02A340 14:A330: 25 AA     .word off_AA25_BE
- D - I - - 0x02A342 14:A332: 2C AA     .word off_AA2C_BF
- D - I - - 0x02A344 14:A334: 37 AA     .word off_AA37_C0
- D - I - - 0x02A346 14:A336: 3E AA     .word off_AA3E_C1
- D - I - - 0x02A348 14:A338: 4F AA     .word off_AA4F_C2
- D - I - - 0x02A34A 14:A33A: 56 AA     .word off_AA56_C3
- D - I - - 0x02A34C 14:A33C: 5D AA     .word off_AA5D_C4
- D - I - - 0x02A34E 14:A33E: 64 AA     .word off_AA64_C5
- D - I - - 0x02A350 14:A340: 6B AA     .word off_AA6B_C6
- D - I - - 0x02A352 14:A342: 72 AA     .word off_AA72_C7
- D - I - - 0x02A354 14:A344: 79 AA     .word off_AA79_C8
- D - I - - 0x02A356 14:A346: 84 AA     .word off_AA84_C9
- D - I - - 0x02A358 14:A348: 8B AA     .word off_AA8B_CA
- D - I - - 0x02A35A 14:A34A: 92 AA     .word off_AA92_CB
- D - I - - 0x02A35C 14:A34C: 9D AA     .word off_AA9D_CC
- - - - - - 0x02A35E 14:A34E: A4 AA     .word off_AAA4_CD
- D - I - - 0x02A360 14:A350: AB AA     .word off_AAAB_CE
- D - I - - 0x02A362 14:A352: B6 AA     .word off_AAB6_CF
- D - I - - 0x02A364 14:A354: DD AA     .word off_AADD_D0
- D - I - - 0x02A366 14:A356: E4 AA     .word off_AAE4_D1
- D - I - - 0x02A368 14:A358: EB AA     .word off_AAEB_D2
- D - I - - 0x02A36A 14:A35A: F2 AA     .word off_AAF2_D3
- D - I - - 0x02A36C 14:A35C: F9 AA     .word off_AAF9_D4
- D - I - - 0x02A36E 14:A35E: 00 AB     .word off_AB00_D5
- D - I - - 0x02A370 14:A360: 09 AB     .word off_AB09_D6
- D - I - - 0x02A372 14:A362: 10 AB     .word off_AB10_D7
- D - I - - 0x02A374 14:A364: 1D AB     .word off_AB1D_D8
- D - I - - 0x02A376 14:A366: 24 AB     .word off_AB24_D9
- D - I - - 0x02A378 14:A368: 2F AB     .word off_AB2F_DA
- D - I - - 0x02A37A 14:A36A: 36 AB     .word off_AB36_DB
- D - I - - 0x02A37C 14:A36C: 3D AB     .word off_AB3D_DC
- D - I - - 0x02A37E 14:A36E: 44 AB     .word off_AB44_DD
- D - I - - 0x02A380 14:A370: 4B AB     .word off_AB4B_DE
- D - I - - 0x02A382 14:A372: 52 AB     .word off_AB52_DF
- D - I - - 0x02A384 14:A374: 59 AB     .word off_AB59_E0
- D - I - - 0x02A386 14:A376: 60 AB     .word off_AB60_E1
- - - - - - 0x02A388 14:A378: 67 AB     .word off_AB67_E2
- - - - - - 0x02A38A 14:A37A: 68 AB     .word off_AB68_E3
- D - I - - 0x02A38C 14:A37C: 6F AB     .word off_AB6F_E4
- D - I - - 0x02A38E 14:A37E: 76 AB     .word off_AB76_E5
- D - I - - 0x02A390 14:A380: 7D AB     .word off_AB7D_E6
- D - I - - 0x02A392 14:A382: 84 AB     .word off_AB84_E7
- D - I - - 0x02A394 14:A384: 8B AB     .word off_AB8B_E8
- D - I - - 0x02A396 14:A386: 31 AC     .word off_AC31_E9
- D - I - - 0x02A398 14:A388: 3C AC     .word off_AC3C_EA



off_A38A_00:
- D - I - - 0x02A39A 14:A38A: 01        .byte $01   ; <あ>
- D - I - - 0x02A39B 14:A38B: 01        .byte $01   ; <あ>
- D - I - - 0x02A39C 14:A38C: 00        .byte $00
- D - I - - 0x02A39D 14:A38D: 00        .byte $00
- D - I - - 0x02A39E 14:A38E: 00        .byte $00
- D - I - - 0x02A39F 14:A38F: 00        .byte $00
- D - I - - 0x02A3A0 14:A390: 00        .byte $00

off_A391_01:
- D - I - - 0x02A3A1 14:A391: 01        .byte $01   ; <あ>
- D - I - - 0x02A3A2 14:A392: 32        .byte $32   ; <ょ>
- D - I - - 0x02A3A3 14:A393: CE        .byte $CE   ; <ピ>
- D - I - - 0x02A3A4 14:A394: FF        .byte $FF
- D - I - - 0x02A3A5 14:A395: 00        .byte $00
- D - I - - 0x02A3A6 14:A396: 00        .byte $00
- D - I - - 0x02A3A7 14:A397: 00        .byte $00

off_A398_02:
- D - I - - 0x02A3A8 14:A398: 01        .byte $01   ; <あ>
- D - I - - 0x02A3A9 14:A399: 32        .byte $32   ; <ょ>
- D - I - - 0x02A3AA 14:A39A: 00        .byte $00
- D - I - - 0x02A3AB 14:A39B: 05        .byte $05   ; <お>
- D - I - - 0x02A3AC 14:A39C: C3        .byte $C3   ; <バ>
- D - I - - 0x02A3AD 14:A39D: FF        .byte $FF
- D - I - - 0x02A3AE 14:A39E: 00        .byte $00

off_A39F_03:
- D - I - - 0x02A3AF 14:A39F: 01        .byte $01   ; <あ>
- D - I - - 0x02A3B0 14:A3A0: 3C        .byte $3C   ; <9>
- D - I - - 0x02A3B1 14:A3A1: 9A        .byte $9A
- D - I - - 0x02A3B2 14:A3A2: FF        .byte $FF
- D - I - - 0x02A3B3 14:A3A3: 1D        .byte $1D   ; <へ>
- D - I - - 0x02A3B4 14:A3A4: 00        .byte $00
- D - I - - 0x02A3B5 14:A3A5: 00        .byte $00

off_A3A6_04:
- D - I - - 0x02A3B6 14:A3A6: 01        .byte $01   ; <あ>
- D - I - - 0x02A3B7 14:A3A7: 3C        .byte $3C   ; <9>
- D - I - - 0x02A3B8 14:A3A8: 00        .byte $00
- D - I - - 0x02A3B9 14:A3A9: 05        .byte $05   ; <お>
- D - I - - 0x02A3BA 14:A3AA: 00        .byte $00
- D - I - - 0x02A3BB 14:A3AB: FD        .byte $FD
- D - I - - 0x02A3BC 14:A3AC: 00        .byte $00

off_A3AD_05:
- D - I - - 0x02A3BD 14:A3AD: 01        .byte $01   ; <あ>
- D - I - - 0x02A3BE 14:A3AE: 3C        .byte $3C   ; <9>
- D - I - - 0x02A3BF 14:A3AF: 9A        .byte $9A
- D - I - - 0x02A3C0 14:A3B0: FF        .byte $FF
- D - I - - 0x02A3C1 14:A3B1: 1D        .byte $1D   ; <へ>
- D - I - - 0x02A3C2 14:A3B2: 00        .byte $00
- D - I - - 0x02A3C3 14:A3B3: 00        .byte $00

off_A3B4_06:
- D - I - - 0x02A3C4 14:A3B4: 01        .byte $01   ; <あ>
- D - I - - 0x02A3C5 14:A3B5: 3C        .byte $3C   ; <9>
- D - I - - 0x02A3C6 14:A3B6: 00        .byte $00
- D - I - - 0x02A3C7 14:A3B7: 06        .byte $06   ; <か>
- D - I - - 0x02A3C8 14:A3B8: 78        .byte $78   ; <?>
- D - I - - 0x02A3C9 14:A3B9: FF        .byte $FF
- D - I - - 0x02A3CA 14:A3BA: 00        .byte $00

off_A3BB_07:
- D - I - - 0x02A3CB 14:A3BB: 01        .byte $01   ; <あ>
- D - I - - 0x02A3CC 14:A3BC: 28        .byte $28   ; <り>
- D - I - - 0x02A3CD 14:A3BD: 00        .byte $00
- D - I - - 0x02A3CE 14:A3BE: 00        .byte $00
- D - I - - 0x02A3CF 14:A3BF: E0        .byte $E0
- D - I - - 0x02A3D0 14:A3C0: FE        .byte $FE
- - - - - - 0x02A3D1 14:A3C1: 00        .byte $00

off_A3C2_08:
- D - I - - 0x02A3D2 14:A3C2: 01        .byte $01   ; <あ>
- D - I - - 0x02A3D3 14:A3C3: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A3D4 14:A3C4: 80        .byte $80
- D - I - - 0x02A3D5 14:A3C5: 00        .byte $00
- D - I - - 0x02A3D6 14:A3C6: 26        .byte $26   ; <よ>
- D - I - - 0x02A3D7 14:A3C7: 00        .byte $00
- - - - - - 0x02A3D8 14:A3C8: 00        .byte $00

off_A3C9_09:
- D - I - - 0x02A3D9 14:A3C9: 01        .byte $01   ; <あ>
- D - I - - 0x02A3DA 14:A3CA: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A3DB 14:A3CB: C4        .byte $C4   ; <ビ>
- D - I - - 0x02A3DC 14:A3CC: 05        .byte $05   ; <お>
- D - I - - 0x02A3DD 14:A3CD: 80        .byte $80
- D - I - - 0x02A3DE 14:A3CE: FE        .byte $FE
- - - - - - 0x02A3DF 14:A3CF: 00        .byte $00

off_A3D0_0A:
- D - I - - 0x02A3E0 14:A3D0: 01        .byte $01   ; <あ>
- D - I - - 0x02A3E1 14:A3D1: 32        .byte $32   ; <ょ>
- D - I - - 0x02A3E2 14:A3D2: 00        .byte $00
- D - I - - 0x02A3E3 14:A3D3: 04        .byte $04   ; <え>
- D - I - - 0x02A3E4 14:A3D4: A4        .byte $A4   ; <ご>
- D - I - - 0x02A3E5 14:A3D5: FF        .byte $FF
- D - I - - 0x02A3E6 14:A3D6: 00        .byte $00

off_A3D7_0B:
- D - I - - 0x02A3E7 14:A3D7: 02        .byte $02   ; <い>
- D - I - - 0x02A3E8 14:A3D8: 40        .byte $40   ; <「>
- D - I - - 0x02A3E9 14:A3D9: 0E        .byte $0E   ; <せ>
- D - I - - 0x02A3EA 14:A3DA: 00        .byte $00
- D - I - - 0x02A3EB 14:A3DB: E6        .byte $E6
- D - I - - 0x02A3EC 14:A3DC: FF        .byte $FF
- - - - - - 0x02A3ED 14:A3DD: 00        .byte $00

off_A3DE_0C:
- D - I - - 0x02A3EE 14:A3DE: 01        .byte $01   ; <あ>
- D - I - - 0x02A3EF 14:A3DF: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A3F0 14:A3E0: 99        .byte $99
- D - I - - 0x02A3F1 14:A3E1: 05        .byte $05   ; <お>
- D - I - - 0x02A3F2 14:A3E2: DE        .byte $DE
- D - I - - 0x02A3F3 14:A3E3: FD        .byte $FD
- - - - - - 0x02A3F4 14:A3E4: 00        .byte $00

off_A3E5_0D:
- - - - - - 0x02A3F5 14:A3E5: 03        .byte $03   ; <う>
- - - - - - 0x02A3F6 14:A3E6: 28        .byte $28   ; <り>
- - - - - - 0x02A3F7 14:A3E7: 00        .byte $00
- - - - - - 0x02A3F8 14:A3E8: 02        .byte $02   ; <い>
- - - - - - 0x02A3F9 14:A3E9: 2D        .byte $2D   ; <を>
- - - - - - 0x02A3FA 14:A3EA: FD        .byte $FD
- - - - - - 0x02A3FB 14:A3EB: FD        .byte $FD
- - - - - - 0x02A3FC 14:A3EC: FF        .byte $FF
- - - - - - 0x02A3FD 14:A3ED: 0C        .byte $0C   ; <し>
- - - - - - 0x02A3FE 14:A3EE: 00        .byte $00
- - - - - - 0x02A3FF 14:A3EF: 03        .byte $03   ; <う>
- - - - - - 0x02A400 14:A3F0: 14        .byte $14   ; <と>
- - - - - - 0x02A401 14:A3F1: CC        .byte $CC   ; <ぽ>
- - - - - - 0x02A402 14:A3F2: 02        .byte $02   ; <い>
- - - - - - 0x02A403 14:A3F3: 67        .byte $67   ; <ラ>
- - - - - - 0x02A404 14:A3F4: FE        .byte $FE
- - - - - - 0x02A405 14:A3F5: 38        .byte $38   ; <5>
- - - - - - 0x02A406 14:A3F6: 00        .byte $00
- - - - - - 0x02A407 14:A3F7: 58        .byte $58   ; <ネ>
- - - - - - 0x02A408 14:A3F8: 00        .byte $00
- - - - - - 0x02A409 14:A3F9: 00        .byte $00

off_A3FA_0E:
- D - I - - 0x02A40A 14:A3FA: 01        .byte $01   ; <あ>
- D - I - - 0x02A40B 14:A3FB: 5A        .byte $5A   ; <ハ>
- D - I - - 0x02A40C 14:A3FC: E0        .byte $E0
- D - I - - 0x02A40D 14:A3FD: FF        .byte $FF
- D - I - - 0x02A40E 14:A3FE: 08        .byte $08   ; <く>
- D - I - - 0x02A40F 14:A3FF: 00        .byte $00
- - - - - - 0x02A410 14:A400: 00        .byte $00

off_A401_0F:
off_A401:
- D - I - - 0x02A411 14:A401: 01        .byte $01   ; <あ>
- D - I - - 0x02A412 14:A402: EF        .byte $EF
- D - I - - 0x02A413 14:A403: 80        .byte $80
- D - I - - 0x02A414 14:A404: FF        .byte $FF
- D - I - - 0x02A415 14:A405: 00        .byte $00
- D - I - - 0x02A416 14:A406: 00        .byte $00
- D - I - - 0x02A417 14:A407: 04        .byte $04   ; <え>
- D - I - - 0x02A418 14:A408: 01 A4     .word off_A401
- - - - - - 0x02A41A 14:A40A: 00        .byte $00

off_A40B_10:
- D - I - - 0x02A41B 14:A40B: 01        .byte $01   ; <あ>
- D - I - - 0x02A41C 14:A40C: 32        .byte $32   ; <ょ>
- D - I - - 0x02A41D 14:A40D: 16        .byte $16   ; <に>
- D - I - - 0x02A41E 14:A40E: 00        .byte $00
- D - I - - 0x02A41F 14:A40F: 32        .byte $32   ; <ょ>
- D - I - - 0x02A420 14:A410: 00        .byte $00
- - - - - - 0x02A421 14:A411: 00        .byte $00

off_A412_11:
- D - I - - 0x02A422 14:A412: 01        .byte $01   ; <あ>
- D - I - - 0x02A423 14:A413: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A424 14:A414: 53        .byte $53   ; <テ>
- D - I - - 0x02A425 14:A415: 04        .byte $04   ; <え>
- D - I - - 0x02A426 14:A416: FA        .byte $FA
- D - I - - 0x02A427 14:A417: FE        .byte $FE
- - - - - - 0x02A428 14:A418: 00        .byte $00

off_A419_12:
- D - I - - 0x02A429 14:A419: 01        .byte $01   ; <あ>
- D - I - - 0x02A42A 14:A41A: 3C        .byte $3C   ; <9>
- D - I - - 0x02A42B 14:A41B: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A42C 14:A41C: 06        .byte $06   ; <か>
- D - I - - 0x02A42D 14:A41D: 08        .byte $08   ; <く>
- D - I - - 0x02A42E 14:A41E: 00        .byte $00
- - - - - - 0x02A42F 14:A41F: 00        .byte $00

off_A420_13:
- D - I - - 0x02A430 14:A420: 01        .byte $01   ; <あ>
- D - I - - 0x02A431 14:A421: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A432 14:A422: 80        .byte $80
- D - I - - 0x02A433 14:A423: FF        .byte $FF
- D - I - - 0x02A434 14:A424: 26        .byte $26   ; <よ>
- D - I - - 0x02A435 14:A425: 00        .byte $00
- D - I - - 0x02A436 14:A426: 01        .byte $01   ; <あ>
- D - I - - 0x02A437 14:A427: 0A        .byte $0A   ; <こ>
- D - I - - 0x02A438 14:A428: 80        .byte $80
- D - I - - 0x02A439 14:A429: FF        .byte $FF
- D - I - - 0x02A43A 14:A42A: 80        .byte $80
- D - I - - 0x02A43B 14:A42B: 00        .byte $00
- - - - - - 0x02A43C 14:A42C: 00        .byte $00

off_A42D_14:
- D - I - - 0x02A43D 14:A42D: 01        .byte $01   ; <あ>
- D - I - - 0x02A43E 14:A42E: 28        .byte $28   ; <り>
- D - I - - 0x02A43F 14:A42F: 99        .byte $99
- D - I - - 0x02A440 14:A430: 05        .byte $05   ; <お>
- D - I - - 0x02A441 14:A431: 00        .byte $00
- D - I - - 0x02A442 14:A432: 03        .byte $03   ; <う>
- - - - - - 0x02A443 14:A433: 00        .byte $00

off_A434_15:
- D - I - - 0x02A444 14:A434: 01        .byte $01   ; <あ>
- D - I - - 0x02A445 14:A435: 28        .byte $28   ; <り>
- D - I - - 0x02A446 14:A436: 40        .byte $40   ; <「>
- D - I - - 0x02A447 14:A437: 00        .byte $00
- D - I - - 0x02A448 14:A438: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A449 14:A439: FF        .byte $FF
- D - I - - 0x02A44A 14:A43A: 00        .byte $00

off_A43B_16:
- D - I - - 0x02A44B 14:A43B: 01        .byte $01   ; <あ>
- D - I - - 0x02A44C 14:A43C: 3C        .byte $3C   ; <9>
- D - I - - 0x02A44D 14:A43D: 80        .byte $80
- D - I - - 0x02A44E 14:A43E: 04        .byte $04   ; <え>
- D - I - - 0x02A44F 14:A43F: 80        .byte $80
- D - I - - 0x02A450 14:A440: 00        .byte $00
- - - - - - 0x02A451 14:A441: 00        .byte $00

off_A442_17:
- D - I - - 0x02A452 14:A442: 01        .byte $01   ; <あ>
- D - I - - 0x02A453 14:A443: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A454 14:A444: 99        .byte $99
- D - I - - 0x02A455 14:A445: 05        .byte $05   ; <お>
- D - I - - 0x02A456 14:A446: 00        .byte $00
- D - I - - 0x02A457 14:A447: 03        .byte $03   ; <う>
- - - - - - 0x02A458 14:A448: 00        .byte $00

off_A449_18:
- D - I - - 0x02A459 14:A449: 01        .byte $01   ; <あ>
- D - I - - 0x02A45A 14:A44A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A45B 14:A44B: 26        .byte $26   ; <よ>
- D - I - - 0x02A45C 14:A44C: 00        .byte $00
- D - I - - 0x02A45D 14:A44D: DA        .byte $DA
- D - I - - 0x02A45E 14:A44E: FF        .byte $FF
- - - - - - 0x02A45F 14:A44F: 00        .byte $00

off_A450_19:
- D - I - - 0x02A460 14:A450: 01        .byte $01   ; <あ>
- D - I - - 0x02A461 14:A451: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A462 14:A452: 80        .byte $80
- D - I - - 0x02A463 14:A453: 04        .byte $04   ; <え>
- D - I - - 0x02A464 14:A454: 80        .byte $80
- D - I - - 0x02A465 14:A455: 00        .byte $00
- - - - - - 0x02A466 14:A456: 00        .byte $00

off_A457_1A:
- D - I - - 0x02A467 14:A457: 01        .byte $01   ; <あ>
- D - I - - 0x02A468 14:A458: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A469 14:A459: E6        .byte $E6
- D - I - - 0x02A46A 14:A45A: 04        .byte $04   ; <え>
- D - I - - 0x02A46B 14:A45B: D5        .byte $D5
- D - I - - 0x02A46C 14:A45C: 02        .byte $02   ; <い>
- - - - - - 0x02A46D 14:A45D: 00        .byte $00

off_A45E_1B:
- D - I - - 0x02A46E 14:A45E: 01        .byte $01   ; <あ>
- D - I - - 0x02A46F 14:A45F: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A470 14:A460: 1A        .byte $1A   ; <は>
- D - I - - 0x02A471 14:A461: FE        .byte $FE
- D - I - - 0x02A472 14:A462: B4        .byte $B4   ; <ガ>
- D - I - - 0x02A473 14:A463: FB        .byte $FB
- D - I - - 0x02A474 14:A464: 00        .byte $00

off_A465_1C:
- D - I - - 0x02A475 14:A465: 01        .byte $01   ; <あ>
- D - I - - 0x02A476 14:A466: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A477 14:A467: 26        .byte $26   ; <よ>
- D - I - - 0x02A478 14:A468: 00        .byte $00
- D - I - - 0x02A479 14:A469: 26        .byte $26   ; <よ>
- D - I - - 0x02A47A 14:A46A: 00        .byte $00
- D - I - - 0x02A47B 14:A46B: 00        .byte $00

off_A46C_1D:
- D - I - - 0x02A47C 14:A46C: 01        .byte $01   ; <あ>
- D - I - - 0x02A47D 14:A46D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A47E 14:A46E: 00        .byte $00
- D - I - - 0x02A47F 14:A46F: FF        .byte $FF
- D - I - - 0x02A480 14:A470: E0        .byte $E0
- D - I - - 0x02A481 14:A471: FD        .byte $FD
- - - - - - 0x02A482 14:A472: 00        .byte $00

off_A473_1E:
- - - - - - 0x02A483 14:A473: 01        .byte $01   ; <あ>
- - - - - - 0x02A484 14:A474: 3C        .byte $3C   ; <9>
- - - - - - 0x02A485 14:A475: 40        .byte $40   ; <「>
- - - - - - 0x02A486 14:A476: 02        .byte $02   ; <い>
- - - - - - 0x02A487 14:A477: C0        .byte $C0   ; <ヅ>
- - - - - - 0x02A488 14:A478: FE        .byte $FE
- - - - - - 0x02A489 14:A479: 00        .byte $00

off_A47A_1F:
- D - I - - 0x02A48A 14:A47A: 01        .byte $01   ; <あ>
- D - I - - 0x02A48B 14:A47B: 5A        .byte $5A   ; <ハ>
- D - I - - 0x02A48C 14:A47C: DA        .byte $DA
- D - I - - 0x02A48D 14:A47D: FF        .byte $FF
- D - I - - 0x02A48E 14:A47E: 00        .byte $00
- D - I - - 0x02A48F 14:A47F: 00        .byte $00
- D - I - - 0x02A490 14:A480: 00        .byte $00

off_A481_20:
- D - I - - 0x02A491 14:A481: 01        .byte $01   ; <あ>
- D - I - - 0x02A492 14:A482: 28        .byte $28   ; <り>
- D - I - - 0x02A493 14:A483: 80        .byte $80
- D - I - - 0x02A494 14:A484: 02        .byte $02   ; <い>
- D - I - - 0x02A495 14:A485: 20        .byte $20   ; <み>
- D - I - - 0x02A496 14:A486: 00        .byte $00
- D - I - - 0x02A497 14:A487: 00        .byte $00

off_A488_21:
- D - I - - 0x02A498 14:A488: 01        .byte $01   ; <あ>
- D - I - - 0x02A499 14:A489: 2C        .byte $2C   ; <わ>
- D - I - - 0x02A49A 14:A48A: 00        .byte $00
- D - I - - 0x02A49B 14:A48B: 05        .byte $05   ; <お>
- D - I - - 0x02A49C 14:A48C: 20        .byte $20   ; <み>
- D - I - - 0x02A49D 14:A48D: 02        .byte $02   ; <い>
- - - - - - 0x02A49E 14:A48E: 00        .byte $00

off_A48F_22:
- D - I - - 0x02A49F 14:A48F: 01        .byte $01   ; <あ>
- D - I - - 0x02A4A0 14:A490: 28        .byte $28   ; <り>
- D - I - - 0x02A4A1 14:A491: 80        .byte $80
- D - I - - 0x02A4A2 14:A492: 00        .byte $00
- D - I - - 0x02A4A3 14:A493: 20        .byte $20   ; <み>
- D - I - - 0x02A4A4 14:A494: 00        .byte $00
- - - - - - 0x02A4A5 14:A495: 00        .byte $00

off_A496_23:
- D - I - - 0x02A4A6 14:A496: 01        .byte $01   ; <あ>
- D - I - - 0x02A4A7 14:A497: 28        .byte $28   ; <り>
- D - I - - 0x02A4A8 14:A498: B0        .byte $B0   ; <び>
- D - I - - 0x02A4A9 14:A499: FC        .byte $FC
- D - I - - 0x02A4AA 14:A49A: B0        .byte $B0   ; <び>
- D - I - - 0x02A4AB 14:A49B: FD        .byte $FD
- - - - - - 0x02A4AC 14:A49C: 00        .byte $00

off_A49D_24:
- D - I - - 0x02A4AD 14:A49D: 01        .byte $01   ; <あ>
- D - I - - 0x02A4AE 14:A49E: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A4AF 14:A49F: AD        .byte $AD   ; <で>
- D - I - - 0x02A4B0 14:A4A0: FF        .byte $FF
- D - I - - 0x02A4B1 14:A4A1: DA        .byte $DA
- D - I - - 0x02A4B2 14:A4A2: FF        .byte $FF
- - - - - - 0x02A4B3 14:A4A3: 00        .byte $00

off_A4A4_25:
- D - I - - 0x02A4B4 14:A4A4: 01        .byte $01   ; <あ>
- D - I - - 0x02A4B5 14:A4A5: 10        .byte $10   ; <た>
- D - I - - 0x02A4B6 14:A4A6: B0        .byte $B0   ; <び>
- D - I - - 0x02A4B7 14:A4A7: FF        .byte $FF
- D - I - - 0x02A4B8 14:A4A8: 00        .byte $00
- D - I - - 0x02A4B9 14:A4A9: 00        .byte $00
- - - - - - 0x02A4BA 14:A4AA: 00        .byte $00

off_A4AB_26:
- D - I - - 0x02A4BB 14:A4AB: 01        .byte $01   ; <あ>
- D - I - - 0x02A4BC 14:A4AC: 28        .byte $28   ; <り>
- D - I - - 0x02A4BD 14:A4AD: E0        .byte $E0
- D - I - - 0x02A4BE 14:A4AE: FF        .byte $FF
- D - I - - 0x02A4BF 14:A4AF: 20        .byte $20   ; <み>
- D - I - - 0x02A4C0 14:A4B0: 00        .byte $00
- D - I - - 0x02A4C1 14:A4B1: 00        .byte $00

off_A4B2_27:
- D - I - - 0x02A4C2 14:A4B2: 01        .byte $01   ; <あ>
- D - I - - 0x02A4C3 14:A4B3: 28        .byte $28   ; <り>
- D - I - - 0x02A4C4 14:A4B4: 00        .byte $00
- D - I - - 0x02A4C5 14:A4B5: FD        .byte $FD
- D - I - - 0x02A4C6 14:A4B6: 00        .byte $00
- D - I - - 0x02A4C7 14:A4B7: FD        .byte $FD
- D - I - - 0x02A4C8 14:A4B8: 00        .byte $00

off_A4B9_28:
- D - I - - 0x02A4C9 14:A4B9: 01        .byte $01   ; <あ>
- D - I - - 0x02A4CA 14:A4BA: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A4CB 14:A4BB: 80        .byte $80
- D - I - - 0x02A4CC 14:A4BC: 00        .byte $00
- D - I - - 0x02A4CD 14:A4BD: DA        .byte $DA
- D - I - - 0x02A4CE 14:A4BE: FF        .byte $FF
- - - - - - 0x02A4CF 14:A4BF: 00        .byte $00

off_A4C0_29:
- D - I - - 0x02A4D0 14:A4C0: 01        .byte $01   ; <あ>
- D - I - - 0x02A4D1 14:A4C1: 10        .byte $10   ; <た>
- D - I - - 0x02A4D2 14:A4C2: 50        .byte $50   ; <タ>
- D - I - - 0x02A4D3 14:A4C3: 00        .byte $00
- D - I - - 0x02A4D4 14:A4C4: 00        .byte $00
- D - I - - 0x02A4D5 14:A4C5: 00        .byte $00
- D - I - - 0x02A4D6 14:A4C6: 00        .byte $00

off_A4C7_2A:
- D - I - - 0x02A4D7 14:A4C7: 01        .byte $01   ; <あ>
- D - I - - 0x02A4D8 14:A4C8: 28        .byte $28   ; <り>
- D - I - - 0x02A4D9 14:A4C9: 20        .byte $20   ; <み>
- D - I - - 0x02A4DA 14:A4CA: 00        .byte $00
- D - I - - 0x02A4DB 14:A4CB: 20        .byte $20   ; <み>
- D - I - - 0x02A4DC 14:A4CC: 00        .byte $00
- D - I - - 0x02A4DD 14:A4CD: 00        .byte $00

off_A4CE_2B:
- - - - - - 0x02A4DE 14:A4CE: 01        .byte $01   ; <あ>
- - - - - - 0x02A4DF 14:A4CF: 1E        .byte $1E   ; <ほ>
- - - - - - 0x02A4E0 14:A4D0: C0        .byte $C0   ; <ヅ>
- - - - - - 0x02A4E1 14:A4D1: F7        .byte $F7
- - - - - - 0x02A4E2 14:A4D2: 00        .byte $00
- - - - - - 0x02A4E3 14:A4D3: 00        .byte $00
- - - - - - 0x02A4E4 14:A4D4: 00        .byte $00

off_A4D5_2C:
- D - I - - 0x02A4E5 14:A4D5: 01        .byte $01   ; <あ>
- D - I - - 0x02A4E6 14:A4D6: 3C        .byte $3C   ; <9>
- D - I - - 0x02A4E7 14:A4D7: 00        .byte $00
- D - I - - 0x02A4E8 14:A4D8: FE        .byte $FE
- D - I - - 0x02A4E9 14:A4D9: 00        .byte $00
- D - I - - 0x02A4EA 14:A4DA: 00        .byte $00
- D - I - - 0x02A4EB 14:A4DB: 03        .byte $03   ; <う>
- D - I - - 0x02A4EC 14:A4DC: 3C        .byte $3C   ; <9>
- D - I - - 0x02A4ED 14:A4DD: 00        .byte $00
- D - I - - 0x02A4EE 14:A4DE: FE        .byte $FE
- D - I - - 0x02A4EF 14:A4DF: 00        .byte $00
- D - I - - 0x02A4F0 14:A4E0: 00        .byte $00
- D - I - - 0x02A4F1 14:A4E1: 1A        .byte $1A   ; <は>
- D - I - - 0x02A4F2 14:A4E2: 00        .byte $00
- D - I - - 0x02A4F3 14:A4E3: 00        .byte $00
- D - I - - 0x02A4F4 14:A4E4: 00        .byte $00
- D - I - - 0x02A4F5 14:A4E5: 01        .byte $01   ; <あ>
- D - I - - 0x02A4F6 14:A4E6: 50        .byte $50   ; <タ>
- D - I - - 0x02A4F7 14:A4E7: 00        .byte $00
- D - I - - 0x02A4F8 14:A4E8: 00        .byte $00
- D - I - - 0x02A4F9 14:A4E9: 00        .byte $00
- D - I - - 0x02A4FA 14:A4EA: 00        .byte $00
- D - I - - 0x02A4FB 14:A4EB: 00        .byte $00

off_A4EC_2D:
- D - I - - 0x02A4FC 14:A4EC: 01        .byte $01   ; <あ>
- D - I - - 0x02A4FD 14:A4ED: 28        .byte $28   ; <り>
- D - I - - 0x02A4FE 14:A4EE: 80        .byte $80
- D - I - - 0x02A4FF 14:A4EF: FF        .byte $FF
- D - I - - 0x02A500 14:A4F0: 20        .byte $20   ; <み>
- D - I - - 0x02A501 14:A4F1: 00        .byte $00
- D - I - - 0x02A502 14:A4F2: 00        .byte $00

off_A4F3_2E:
- D - I - - 0x02A503 14:A4F3: 04        .byte $04   ; <え>
- D - I - - 0x02A504 14:A4F4: BC AA     .word off_AABC

off_A4F6_2F:
- D - I - - 0x02A506 14:A4F6: 01        .byte $01   ; <あ>
- D - I - - 0x02A507 14:A4F7: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A508 14:A4F8: 53        .byte $53   ; <テ>
- D - I - - 0x02A509 14:A4F9: 00        .byte $00
- D - I - - 0x02A50A 14:A4FA: DA        .byte $DA
- D - I - - 0x02A50B 14:A4FB: FF        .byte $FF
- - - - - - 0x02A50C 14:A4FC: 00        .byte $00

off_A4FD_30:
- D - I - - 0x02A50D 14:A4FD: 01        .byte $01   ; <あ>
- D - I - - 0x02A50E 14:A4FE: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A50F 14:A4FF: 00        .byte $00
- D - I - - 0x02A510 14:A500: 00        .byte $00
- D - I - - 0x02A511 14:A501: 00        .byte $00
- D - I - - 0x02A512 14:A502: 00        .byte $00
- D - I - - 0x02A513 14:A503: 01        .byte $01   ; <あ>
- D - I - - 0x02A514 14:A504: 40        .byte $40   ; <「>
- D - I - - 0x02A515 14:A505: 00        .byte $00
- D - I - - 0x02A516 14:A506: 00        .byte $00
- D - I - - 0x02A517 14:A507: 80        .byte $80
- D - I - - 0x02A518 14:A508: 00        .byte $00
- D - I - - 0x02A519 14:A509: 00        .byte $00

off_A50A_31:
- D - I - - 0x02A51A 14:A50A: 01        .byte $01   ; <あ>
- D - I - - 0x02A51B 14:A50B: 28        .byte $28   ; <り>
- D - I - - 0x02A51C 14:A50C: 06        .byte $06   ; <か>
- D - I - - 0x02A51D 14:A50D: 02        .byte $02   ; <い>
- D - I - - 0x02A51E 14:A50E: F9        .byte $F9
- D - I - - 0x02A51F 14:A50F: 03        .byte $03   ; <う>
- D - I - - 0x02A520 14:A510: 00        .byte $00

off_A511_32:
- D - I - - 0x02A521 14:A511: 01        .byte $01   ; <あ>
- D - I - - 0x02A522 14:A512: 28        .byte $28   ; <り>
- D - I - - 0x02A523 14:A513: 20        .byte $20   ; <み>
- D - I - - 0x02A524 14:A514: 04        .byte $04   ; <え>
- D - I - - 0x02A525 14:A515: E0        .byte $E0
- D - I - - 0x02A526 14:A516: FE        .byte $FE
- - - - - - 0x02A527 14:A517: 00        .byte $00

off_A518_33:
- D - I - - 0x02A528 14:A518: 01        .byte $01   ; <あ>
- D - I - - 0x02A529 14:A519: 50        .byte $50   ; <タ>
- D - I - - 0x02A52A 14:A51A: 7C        .byte $7C   ; <~>
- D - I - - 0x02A52B 14:A51B: 04        .byte $04   ; <え>
- D - I - - 0x02A52C 14:A51C: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A52D 14:A51D: 00        .byte $00
- D - I - - 0x02A52E 14:A51E: 00        .byte $00

off_A51F_34:
- D - I - - 0x02A52F 14:A51F: 01        .byte $01   ; <あ>
- D - I - - 0x02A530 14:A520: 32        .byte $32   ; <ょ>
- D - I - - 0x02A531 14:A521: EA        .byte $EA
- D - I - - 0x02A532 14:A522: FF        .byte $FF
- D - I - - 0x02A533 14:A523: 16        .byte $16   ; <に>
- D - I - - 0x02A534 14:A524: 00        .byte $00
- D - I - - 0x02A535 14:A525: 00        .byte $00

off_A526_35:
- D - I - - 0x02A536 14:A526: 02        .byte $02   ; <い>
- D - I - - 0x02A537 14:A527: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A538 14:A528: 00        .byte $00
- D - I - - 0x02A539 14:A529: 00        .byte $00
- D - I - - 0x02A53A 14:A52A: 15        .byte $15   ; <な>
- D - I - - 0x02A53B 14:A52B: 00        .byte $00
- D - I - - 0x02A53C 14:A52C: 03        .byte $03   ; <う>
- D - I - - 0x02A53D 14:A52D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A53E 14:A52E: 00        .byte $00
- D - I - - 0x02A53F 14:A52F: 00        .byte $00
- D - I - - 0x02A540 14:A530: 34        .byte $34   ; <1>
- D - I - - 0x02A541 14:A531: FF        .byte $FF
- D - I - - 0x02A542 14:A532: 00        .byte $00
- D - I - - 0x02A543 14:A533: 00        .byte $00
- D - I - - 0x02A544 14:A534: 0C        .byte $0C   ; <し>
- D - I - - 0x02A545 14:A535: 00        .byte $00
- D - I - - 0x02A546 14:A536: 00        .byte $00

off_A537_36:
- D - I - - 0x02A547 14:A537: 01        .byte $01   ; <あ>
- D - I - - 0x02A548 14:A538: 3C        .byte $3C   ; <9>
- D - I - - 0x02A549 14:A539: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A54A 14:A53A: FF        .byte $FF
- D - I - - 0x02A54B 14:A53B: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A54C 14:A53C: FF        .byte $FF
- - - - - - 0x02A54D 14:A53D: 00        .byte $00

off_A53E_37:
- D - I - - 0x02A54E 14:A53E: 01        .byte $01   ; <あ>
- D - I - - 0x02A54F 14:A53F: 32        .byte $32   ; <ょ>
- D - I - - 0x02A550 14:A540: E0        .byte $E0
- D - I - - 0x02A551 14:A541: FF        .byte $FF
- D - I - - 0x02A552 14:A542: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A553 14:A543: 00        .byte $00
- D - I - - 0x02A554 14:A544: 00        .byte $00

off_A545_38:
- D - I - - 0x02A555 14:A545: 01        .byte $01   ; <あ>
- D - I - - 0x02A556 14:A546: 28        .byte $28   ; <り>
- D - I - - 0x02A557 14:A547: 00        .byte $00
- D - I - - 0x02A558 14:A548: 00        .byte $00
- D - I - - 0x02A559 14:A549: 40        .byte $40   ; <「>
- D - I - - 0x02A55A 14:A54A: FD        .byte $FD
- D - I - - 0x02A55B 14:A54B: 00        .byte $00

off_A54C_39:
- D - I - - 0x02A55C 14:A54C: 01        .byte $01   ; <あ>
- D - I - - 0x02A55D 14:A54D: 50        .byte $50   ; <タ>
- D - I - - 0x02A55E 14:A54E: EB        .byte $EB
- D - I - - 0x02A55F 14:A54F: FF        .byte $FF
- D - I - - 0x02A560 14:A550: 05        .byte $05   ; <お>
- D - I - - 0x02A561 14:A551: 00        .byte $00
- - - - - - 0x02A562 14:A552: 00        .byte $00

off_A553_3A:
- D - I - - 0x02A563 14:A553: 01        .byte $01   ; <あ>
- D - I - - 0x02A564 14:A554: 14        .byte $14   ; <と>
- D - I - - 0x02A565 14:A555: 40        .byte $40   ; <「>
- D - I - - 0x02A566 14:A556: 02        .byte $02   ; <い>
- D - I - - 0x02A567 14:A557: 40        .byte $40   ; <「>
- D - I - - 0x02A568 14:A558: 00        .byte $00
- - - - - - 0x02A569 14:A559: 00        .byte $00

off_A55A_3B:
- D - I - - 0x02A56A 14:A55A: 03        .byte $03   ; <う>
- D - I - - 0x02A56B 14:A55B: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A56C 14:A55C: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x02A56D 14:A55D: FD        .byte $FD
- D - I - - 0x02A56E 14:A55E: A0        .byte $A0   ; <が>
- D - I - - 0x02A56F 14:A55F: FD        .byte $FD
- D - I - - 0x02A570 14:A560: 18        .byte $18   ; <ね>
- D - I - - 0x02A571 14:A561: 00        .byte $00
- D - I - - 0x02A572 14:A562: 10        .byte $10   ; <た>
- D - I - - 0x02A573 14:A563: 00        .byte $00
- D - I - - 0x02A574 14:A564: 02        .byte $02   ; <い>
- D - I - - 0x02A575 14:A565: 28        .byte $28   ; <り>
- D - I - - 0x02A576 14:A566: A0        .byte $A0   ; <が>
- D - I - - 0x02A577 14:A567: 00        .byte $00
- D - I - - 0x02A578 14:A568: 70        .byte $70   ; <ャ>
- D - I - - 0x02A579 14:A569: 00        .byte $00
- - - - - - 0x02A57A 14:A56A: 00        .byte $00

off_A56B_3C:
- D - I - - 0x02A57B 14:A56B: 02        .byte $02   ; <い>
- D - I - - 0x02A57C 14:A56C: 40        .byte $40   ; <「>
- D - I - - 0x02A57D 14:A56D: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A57E 14:A56E: 00        .byte $00
- D - I - - 0x02A57F 14:A56F: 38        .byte $38   ; <5>
- D - I - - 0x02A580 14:A570: 00        .byte $00
- D - I - - 0x02A581 14:A571: 00        .byte $00

off_A572_3D:
- D - I - - 0x02A582 14:A572: 01        .byte $01   ; <あ>
- D - I - - 0x02A583 14:A573: 14        .byte $14   ; <と>
- D - I - - 0x02A584 14:A574: 00        .byte $00
- D - I - - 0x02A585 14:A575: 04        .byte $04   ; <え>
- D - I - - 0x02A586 14:A576: 00        .byte $00
- D - I - - 0x02A587 14:A577: 00        .byte $00
- D - I - - 0x02A588 14:A578: 00        .byte $00

off_A579_3E:
- D - I - - 0x02A589 14:A579: 03        .byte $03   ; <う>
- D - I - - 0x02A58A 14:A57A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A58B 14:A57B: 8C        .byte $8C   ; <M>
- D - I - - 0x02A58C 14:A57C: 05        .byte $05   ; <お>
- D - I - - 0x02A58D 14:A57D: 00        .byte $00
- D - I - - 0x02A58E 14:A57E: 00        .byte $00
- D - I - - 0x02A58F 14:A57F: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A590 14:A580: FF        .byte $FF
- D - I - - 0x02A591 14:A581: 00        .byte $00
- D - I - - 0x02A592 14:A582: 00        .byte $00
- - - - - - 0x02A593 14:A583: 00        .byte $00

off_A584_3F:
- D - I - - 0x02A594 14:A584: 01        .byte $01   ; <あ>
- D - I - - 0x02A595 14:A585: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A596 14:A586: CD        .byte $CD   ; <パ>
- D - I - - 0x02A597 14:A587: FC        .byte $FC
- D - I - - 0x02A598 14:A588: 00        .byte $00
- D - I - - 0x02A599 14:A589: 00        .byte $00
- - - - - - 0x02A59A 14:A58A: 00        .byte $00

off_A58B_40:
- D - I - - 0x02A59B 14:A58B: 01        .byte $01   ; <あ>
- D - I - - 0x02A59C 14:A58C: 32        .byte $32   ; <ょ>
- D - I - - 0x02A59D 14:A58D: 20        .byte $20   ; <み>
- D - I - - 0x02A59E 14:A58E: 01        .byte $01   ; <あ>
- D - I - - 0x02A59F 14:A58F: 80        .byte $80
- D - I - - 0x02A5A0 14:A590: FB        .byte $FB
- D - I - - 0x02A5A1 14:A591: 00        .byte $00

off_A592_41:
- D - I - - 0x02A5A2 14:A592: 01        .byte $01   ; <あ>
- D - I - - 0x02A5A3 14:A593: 28        .byte $28   ; <り>
- D - I - - 0x02A5A4 14:A594: 00        .byte $00
- D - I - - 0x02A5A5 14:A595: 09        .byte $09   ; <け>
- D - I - - 0x02A5A6 14:A596: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A5A7 14:A597: 00        .byte $00
- D - I - - 0x02A5A8 14:A598: 00        .byte $00

off_A599_42:
- D - I - - 0x02A5A9 14:A599: 01        .byte $01   ; <あ>
- D - I - - 0x02A5AA 14:A59A: 32        .byte $32   ; <ょ>
- D - I - - 0x02A5AB 14:A59B: 88        .byte $88   ; <H>
- D - I - - 0x02A5AC 14:A59C: 02        .byte $02   ; <い>
- D - I - - 0x02A5AD 14:A59D: 16        .byte $16   ; <に>
- D - I - - 0x02A5AE 14:A59E: 00        .byte $00
- D - I - - 0x02A5AF 14:A59F: 00        .byte $00

off_A5A0_43:
- D - I - - 0x02A5B0 14:A5A0: 01        .byte $01   ; <あ>
- D - I - - 0x02A5B1 14:A5A1: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A5B2 14:A5A2: 00        .byte $00
- D - I - - 0x02A5B3 14:A5A3: 00        .byte $00
- D - I - - 0x02A5B4 14:A5A4: 00        .byte $00
- D - I - - 0x02A5B5 14:A5A5: 00        .byte $00
- D - I - - 0x02A5B6 14:A5A6: 01        .byte $01   ; <あ>
- D - I - - 0x02A5B7 14:A5A7: 40        .byte $40   ; <「>
- D - I - - 0x02A5B8 14:A5A8: 00        .byte $00
- D - I - - 0x02A5B9 14:A5A9: 00        .byte $00
- D - I - - 0x02A5BA 14:A5AA: 80        .byte $80
- D - I - - 0x02A5BB 14:A5AB: FF        .byte $FF
- D - I - - 0x02A5BC 14:A5AC: 00        .byte $00

off_A5AD_44:
off_A5AD:
- - - - - - 0x02A5BD 14:A5AD: 01        .byte $01   ; <あ>
- - - - - - 0x02A5BE 14:A5AE: 10        .byte $10   ; <た>
- - - - - - 0x02A5BF 14:A5AF: 00        .byte $00
- - - - - - 0x02A5C0 14:A5B0: 00        .byte $00
- - - - - - 0x02A5C1 14:A5B1: 00        .byte $00
- - - - - - 0x02A5C2 14:A5B2: 00        .byte $00
- - - - - - 0x02A5C3 14:A5B3: 01        .byte $01   ; <あ>
- - - - - - 0x02A5C4 14:A5B4: 01        .byte $01   ; <あ>
- - - - - - 0x02A5C5 14:A5B5: 00        .byte $00
- - - - - - 0x02A5C6 14:A5B6: 00        .byte $00
- - - - - - 0x02A5C7 14:A5B7: 00        .byte $00
- - - - - - 0x02A5C8 14:A5B8: 08        .byte $08   ; <く>
- - - - - - 0x02A5C9 14:A5B9: 04        .byte $04   ; <え>
- - - - - - 0x02A5CA 14:A5BA: AD A5     .word off_A5AD

off_A5BC_45:
off_A5BC:
- - - - - - 0x02A5CC 14:A5BC: 01        .byte $01   ; <あ>
- - - - - - 0x02A5CD 14:A5BD: 10        .byte $10   ; <た>
- - - - - - 0x02A5CE 14:A5BE: 00        .byte $00
- - - - - - 0x02A5CF 14:A5BF: 00        .byte $00
- - - - - - 0x02A5D0 14:A5C0: 00        .byte $00
- - - - - - 0x02A5D1 14:A5C1: 00        .byte $00
- - - - - - 0x02A5D2 14:A5C2: 01        .byte $01   ; <あ>
- - - - - - 0x02A5D3 14:A5C3: 01        .byte $01   ; <あ>
- - - - - - 0x02A5D4 14:A5C4: 00        .byte $00
- - - - - - 0x02A5D5 14:A5C5: 00        .byte $00
- - - - - - 0x02A5D6 14:A5C6: 00        .byte $00
- - - - - - 0x02A5D7 14:A5C7: F8        .byte $F8
- - - - - - 0x02A5D8 14:A5C8: 04        .byte $04   ; <え>
- - - - - - 0x02A5D9 14:A5C9: BC A5     .word off_A5BC

off_A5CB_46:
- D - I - - 0x02A5DB 14:A5CB: 01        .byte $01   ; <あ>
- D - I - - 0x02A5DC 14:A5CC: 5A        .byte $5A   ; <ハ>
- D - I - - 0x02A5DD 14:A5CD: 44        .byte $44   ; <エ>
- D - I - - 0x02A5DE 14:A5CE: 00        .byte $00
- D - I - - 0x02A5DF 14:A5CF: 17        .byte $17   ; <ぬ>
- D - I - - 0x02A5E0 14:A5D0: 00        .byte $00
- D - I - - 0x02A5E1 14:A5D1: 00        .byte $00

off_A5D2_47:
- - - - - - 0x02A5E2 14:A5D2: 00        .byte $00

off_A5D3_48:
- D - I - - 0x02A5E3 14:A5D3: 03        .byte $03   ; <う>
- D - I - - 0x02A5E4 14:A5D4: 28        .byte $28   ; <り>
- D - I - - 0x02A5E5 14:A5D5: 6C        .byte $6C   ; <ワ>
- D - I - - 0x02A5E6 14:A5D6: 00        .byte $00
- D - I - - 0x02A5E7 14:A5D7: 66        .byte $66   ; <ヨ>
- D - I - - 0x02A5E8 14:A5D8: 01        .byte $01   ; <あ>
- D - I - - 0x02A5E9 14:A5D9: 0A        .byte $0A   ; <こ>
- D - I - - 0x02A5EA 14:A5DA: 00        .byte $00
- D - I - - 0x02A5EB 14:A5DB: 00        .byte $00
- D - I - - 0x02A5EC 14:A5DC: 00        .byte $00
- D - I - - 0x02A5ED 14:A5DD: 03        .byte $03   ; <う>
- D - I - - 0x02A5EE 14:A5DE: 14        .byte $14   ; <と>
- D - I - - 0x02A5EF 14:A5DF: 59        .byte $59   ; <ノ>
- D - I - - 0x02A5F0 14:A5E0: 02        .byte $02   ; <い>
- D - I - - 0x02A5F1 14:A5E1: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A5F2 14:A5E2: 00        .byte $00
- D - I - - 0x02A5F3 14:A5E3: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A5F4 14:A5E4: 00        .byte $00
- D - I - - 0x02A5F5 14:A5E5: 80        .byte $80
- D - I - - 0x02A5F6 14:A5E6: FF        .byte $FF
- - - - - - 0x02A5F7 14:A5E7: 00        .byte $00

off_A5E8_49:
- D - I - - 0x02A5F8 14:A5E8: 01        .byte $01   ; <あ>
- D - I - - 0x02A5F9 14:A5E9: 1F        .byte $1F   ; <ま>
- D - I - - 0x02A5FA 14:A5EA: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A5FB 14:A5EB: 06        .byte $06   ; <か>
- D - I - - 0x02A5FC 14:A5EC: 13        .byte $13   ; <て>
- D - I - - 0x02A5FD 14:A5ED: 00        .byte $00
- - - - - - 0x02A5FE 14:A5EE: 00        .byte $00

off_A5EF_4A:
- D - I - - 0x02A5FF 14:A5EF: 01        .byte $01   ; <あ>
- D - I - - 0x02A600 14:A5F0: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A601 14:A5F1: 40        .byte $40   ; <「>
- D - I - - 0x02A602 14:A5F2: 00        .byte $00
- D - I - - 0x02A603 14:A5F3: 40        .byte $40   ; <「>
- D - I - - 0x02A604 14:A5F4: 00        .byte $00
- D - I - - 0x02A605 14:A5F5: 00        .byte $00

off_A5F6_4B:
- D - I - - 0x02A606 14:A5F6: 01        .byte $01   ; <あ>
- D - I - - 0x02A607 14:A5F7: 28        .byte $28   ; <り>
- D - I - - 0x02A608 14:A5F8: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A609 14:A5F9: FF        .byte $FF
- D - I - - 0x02A60A 14:A5FA: E0        .byte $E0
- D - I - - 0x02A60B 14:A5FB: FF        .byte $FF
- D - I - - 0x02A60C 14:A5FC: 00        .byte $00

off_A5FD_4C:
- D - I - - 0x02A60D 14:A5FD: 01        .byte $01   ; <あ>
- D - I - - 0x02A60E 14:A5FE: 28        .byte $28   ; <り>
- D - I - - 0x02A60F 14:A5FF: C6        .byte $C6   ; <ベ>
- D - I - - 0x02A610 14:A600: 06        .byte $06   ; <か>
- D - I - - 0x02A611 14:A601: 00        .byte $00
- D - I - - 0x02A612 14:A602: 00        .byte $00
- - - - - - 0x02A613 14:A603: 00        .byte $00

off_A604_4D:
- D - I - - 0x02A614 14:A604: 01        .byte $01   ; <あ>
- D - I - - 0x02A615 14:A605: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A616 14:A606: AD        .byte $AD   ; <で>
- D - I - - 0x02A617 14:A607: FF        .byte $FF
- D - I - - 0x02A618 14:A608: DA        .byte $DA
- D - I - - 0x02A619 14:A609: FF        .byte $FF
- D - I - - 0x02A61A 14:A60A: 01        .byte $01   ; <あ>
- D - I - - 0x02A61B 14:A60B: 14        .byte $14   ; <と>
- D - I - - 0x02A61C 14:A60C: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A61D 14:A60D: FF        .byte $FF
- D - I - - 0x02A61E 14:A60E: 00        .byte $00
- D - I - - 0x02A61F 14:A60F: 00        .byte $00
- - - - - - 0x02A620 14:A610: 00        .byte $00

off_A611_4E:
- D - I - - 0x02A621 14:A611: 01        .byte $01   ; <あ>
- D - I - - 0x02A622 14:A612: 32        .byte $32   ; <ょ>
- D - I - - 0x02A623 14:A613: C6        .byte $C6   ; <ベ>
- D - I - - 0x02A624 14:A614: 06        .byte $06   ; <か>
- D - I - - 0x02A625 14:A615: 00        .byte $00
- D - I - - 0x02A626 14:A616: 00        .byte $00
- - - - - - 0x02A627 14:A617: 00        .byte $00

off_A618_4F:
off_A618:
- - - - - - 0x02A628 14:A618: 03        .byte $03   ; <う>
- - - - - - 0x02A629 14:A619: 05        .byte $05   ; <お>
- - - - - - 0x02A62A 14:A61A: 00        .byte $00
- - - - - - 0x02A62B 14:A61B: 00        .byte $00
- - - - - - 0x02A62C 14:A61C: 00        .byte $00
- - - - - - 0x02A62D 14:A61D: 05        .byte $05   ; <お>
- - - - - - 0x02A62E 14:A61E: F8        .byte $F8
- - - - - - 0x02A62F 14:A61F: 00        .byte $00
- - - - - - 0x02A630 14:A620: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x02A631 14:A621: FF        .byte $FF
- - - - - - 0x02A632 14:A622: 03        .byte $03   ; <う>
- - - - - - 0x02A633 14:A623: 05        .byte $05   ; <お>
- - - - - - 0x02A634 14:A624: 00        .byte $00
- - - - - - 0x02A635 14:A625: 05        .byte $05   ; <お>
- - - - - - 0x02A636 14:A626: 00        .byte $00
- - - - - - 0x02A637 14:A627: 00        .byte $00
- - - - - - 0x02A638 14:A628: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x02A639 14:A629: FF        .byte $FF
- - - - - - 0x02A63A 14:A62A: 08        .byte $08   ; <く>
- - - - - - 0x02A63B 14:A62B: FF        .byte $FF
- - - - - - 0x02A63C 14:A62C: 03        .byte $03   ; <う>
- - - - - - 0x02A63D 14:A62D: 05        .byte $05   ; <お>
- - - - - - 0x02A63E 14:A62E: 00        .byte $00
- - - - - - 0x02A63F 14:A62F: 00        .byte $00
- - - - - - 0x02A640 14:A630: 00        .byte $00
- - - - - - 0x02A641 14:A631: FB        .byte $FB
- - - - - - 0x02A642 14:A632: 08        .byte $08   ; <く>
- - - - - - 0x02A643 14:A633: FF        .byte $FF
- - - - - - 0x02A644 14:A634: 93        .byte $93   ; <Y>
- - - - - - 0x02A645 14:A635: 00        .byte $00
- - - - - - 0x02A646 14:A636: 03        .byte $03   ; <う>
- - - - - - 0x02A647 14:A637: 05        .byte $05   ; <お>
- - - - - - 0x02A648 14:A638: 00        .byte $00
- - - - - - 0x02A649 14:A639: FB        .byte $FB
- - - - - - 0x02A64A 14:A63A: 00        .byte $00
- - - - - - 0x02A64B 14:A63B: 00        .byte $00
- - - - - - 0x02A64C 14:A63C: 60        .byte $60   ; <ミ>
- - - - - - 0x02A64D 14:A63D: 00        .byte $00
- - - - - - 0x02A64E 14:A63E: F8        .byte $F8
- - - - - - 0x02A64F 14:A63F: 00        .byte $00
- - - - - - 0x02A650 14:A640: 04        .byte $04   ; <え>
- - - - - - 0x02A651 14:A641: 18 A6     .word off_A618

off_A643_50:
- - - - - - 0x02A653 14:A643: 01        .byte $01   ; <あ>
- - - - - - 0x02A654 14:A644: 14        .byte $14   ; <と>
- - - - - - 0x02A655 14:A645: C0        .byte $C0   ; <ヅ>
- - - - - - 0x02A656 14:A646: FF        .byte $FF
- - - - - - 0x02A657 14:A647: 40        .byte $40   ; <「>
- - - - - - 0x02A658 14:A648: 00        .byte $00
- - - - - - 0x02A659 14:A649: 00        .byte $00

off_A64A_51:
- D - I - - 0x02A65A 14:A64A: 01        .byte $01   ; <あ>
- D - I - - 0x02A65B 14:A64B: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A65C 14:A64C: 80        .byte $80
- D - I - - 0x02A65D 14:A64D: 07        .byte $07   ; <き>
- D - I - - 0x02A65E 14:A64E: 00        .byte $00
- D - I - - 0x02A65F 14:A64F: 00        .byte $00
- - - - - - 0x02A660 14:A650: 00        .byte $00

off_A651_52:
- D - I - - 0x02A661 14:A651: 01        .byte $01   ; <あ>
- D - I - - 0x02A662 14:A652: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A663 14:A653: 80        .byte $80
- D - I - - 0x02A664 14:A654: FF        .byte $FF
- D - I - - 0x02A665 14:A655: 26        .byte $26   ; <よ>
- D - I - - 0x02A666 14:A656: 00        .byte $00
- - - - - - 0x02A667 14:A657: 00        .byte $00

off_A658_53:
- D - I - - 0x02A668 14:A658: 01        .byte $01   ; <あ>
- D - I - - 0x02A669 14:A659: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A66A 14:A65A: DA        .byte $DA
- D - I - - 0x02A66B 14:A65B: FF        .byte $FF
- D - I - - 0x02A66C 14:A65C: 26        .byte $26   ; <よ>
- D - I - - 0x02A66D 14:A65D: 00        .byte $00
- D - I - - 0x02A66E 14:A65E: 00        .byte $00

off_A65F_54:
- D - I - - 0x02A66F 14:A65F: 01        .byte $01   ; <あ>
- D - I - - 0x02A670 14:A660: 32        .byte $32   ; <ょ>
- D - I - - 0x02A671 14:A661: 00        .byte $00
- D - I - - 0x02A672 14:A662: FD        .byte $FD
- D - I - - 0x02A673 14:A663: 00        .byte $00
- D - I - - 0x02A674 14:A664: 00        .byte $00
- - - - - - 0x02A675 14:A665: 00        .byte $00

off_A666_55:
- - - - - - 0x02A676 14:A666: 00        .byte $00

off_A667_56:
- - - - - - 0x02A677 14:A667: 00        .byte $00

off_A668_57:
- - - - - - 0x02A678 14:A668: 00        .byte $00

off_A669_58:
- - - - - - 0x02A679 14:A669: 00        .byte $00

off_A66A_59:
- D - I - - 0x02A67A 14:A66A: 01        .byte $01   ; <あ>
- D - I - - 0x02A67B 14:A66B: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A67C 14:A66C: AD        .byte $AD   ; <で>
- D - I - - 0x02A67D 14:A66D: FF        .byte $FF
- D - I - - 0x02A67E 14:A66E: 26        .byte $26   ; <よ>
- D - I - - 0x02A67F 14:A66F: 00        .byte $00
- D - I - - 0x02A680 14:A670: 01        .byte $01   ; <あ>
- D - I - - 0x02A681 14:A671: 3C        .byte $3C   ; <9>
- D - I - - 0x02A682 14:A672: 00        .byte $00
- D - I - - 0x02A683 14:A673: 00        .byte $00
- D - I - - 0x02A684 14:A674: 00        .byte $00
- D - I - - 0x02A685 14:A675: 00        .byte $00
- D - I - - 0x02A686 14:A676: 01        .byte $01   ; <あ>
- D - I - - 0x02A687 14:A677: 0A        .byte $0A   ; <こ>
- D - I - - 0x02A688 14:A678: 00        .byte $00
- D - I - - 0x02A689 14:A679: FC        .byte $FC
- D - I - - 0x02A68A 14:A67A: 00        .byte $00
- D - I - - 0x02A68B 14:A67B: 04        .byte $04   ; <え>
- - - - - - 0x02A68C 14:A67C: 00        .byte $00

off_A67D_5A:
- D - I - - 0x02A68D 14:A67D: 01        .byte $01   ; <あ>
- D - I - - 0x02A68E 14:A67E: 3C        .byte $3C   ; <9>
- D - I - - 0x02A68F 14:A67F: 55        .byte $55   ; <ナ>
- D - I - - 0x02A690 14:A680: 01        .byte $01   ; <あ>
- D - I - - 0x02A691 14:A681: DA        .byte $DA
- D - I - - 0x02A692 14:A682: FF        .byte $FF
- D - I - - 0x02A693 14:A683: 00        .byte $00

off_A684_5B:
- - - - - - 0x02A694 14:A684: 01        .byte $01   ; <あ>
- - - - - - 0x02A695 14:A685: 0C        .byte $0C   ; <し>
- - - - - - 0x02A696 14:A686: 66        .byte $66   ; <ヨ>
- - - - - - 0x02A697 14:A687: 03        .byte $03   ; <う>
- - - - - - 0x02A698 14:A688: 33        .byte $33   ; <0>
- - - - - - 0x02A699 14:A689: 00        .byte $00
- - - - - - 0x02A69A 14:A68A: 00        .byte $00

off_A68B_5C:
- - - - - - 0x02A69B 14:A68B: 02        .byte $02   ; <い>
- - - - - - 0x02A69C 14:A68C: 28        .byte $28   ; <り>
- - - - - - 0x02A69D 14:A68D: 00        .byte $00
- - - - - - 0x02A69E 14:A68E: 00        .byte $00
- - - - - - 0x02A69F 14:A68F: 18        .byte $18   ; <ね>
- - - - - - 0x02A6A0 14:A690: 00        .byte $00
- - - - - - 0x02A6A1 14:A691: 00        .byte $00

off_A692_5D:
- D - I - - 0x02A6A2 14:A692: 01        .byte $01   ; <あ>
- D - I - - 0x02A6A3 14:A693: 3C        .byte $3C   ; <9>
- D - I - - 0x02A6A4 14:A694: DA        .byte $DA
- D - I - - 0x02A6A5 14:A695: FF        .byte $FF
- D - I - - 0x02A6A6 14:A696: ED        .byte $ED
- D - I - - 0x02A6A7 14:A697: FF        .byte $FF
- D - I - - 0x02A6A8 14:A698: 00        .byte $00

off_A699_5E:
- D - I - - 0x02A6A9 14:A699: 01        .byte $01   ; <あ>
- D - I - - 0x02A6AA 14:A69A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A6AB 14:A69B: DA        .byte $DA
- D - I - - 0x02A6AC 14:A69C: FB        .byte $FB
- D - I - - 0x02A6AD 14:A69D: 60        .byte $60   ; <ミ>
- D - I - - 0x02A6AE 14:A69E: 01        .byte $01   ; <あ>
- D - I - - 0x02A6AF 14:A69F: 00        .byte $00

off_A6A0_5F:
- D - I - - 0x02A6B0 14:A6A0: 03        .byte $03   ; <う>
- D - I - - 0x02A6B1 14:A6A1: 28        .byte $28   ; <り>
- D - I - - 0x02A6B2 14:A6A2: C4        .byte $C4   ; <ビ>
- D - I - - 0x02A6B3 14:A6A3: 00        .byte $00
- D - I - - 0x02A6B4 14:A6A4: 3C        .byte $3C   ; <9>
- D - I - - 0x02A6B5 14:A6A5: 00        .byte $00
- D - I - - 0x02A6B6 14:A6A6: 48        .byte $48   ; <ク>
- D - I - - 0x02A6B7 14:A6A7: 00        .byte $00
- D - I - - 0x02A6B8 14:A6A8: 0E        .byte $0E   ; <せ>
- D - I - - 0x02A6B9 14:A6A9: 00        .byte $00
- D - I - - 0x02A6BA 14:A6AA: 00        .byte $00

off_A6AB_60:
- D - I - - 0x02A6BB 14:A6AB: 03        .byte $03   ; <う>
- D - I - - 0x02A6BC 14:A6AC: 28        .byte $28   ; <り>
- D - I - - 0x02A6BD 14:A6AD: C4        .byte $C4   ; <ビ>
- D - I - - 0x02A6BE 14:A6AE: 00        .byte $00
- D - I - - 0x02A6BF 14:A6AF: C4        .byte $C4   ; <ビ>
- D - I - - 0x02A6C0 14:A6B0: FF        .byte $FF
- D - I - - 0x02A6C1 14:A6B1: 48        .byte $48   ; <ク>
- D - I - - 0x02A6C2 14:A6B2: 00        .byte $00
- D - I - - 0x02A6C3 14:A6B3: F2        .byte $F2
- D - I - - 0x02A6C4 14:A6B4: FF        .byte $FF
- D - I - - 0x02A6C5 14:A6B5: 00        .byte $00

off_A6B6_61:
- D - I - - 0x02A6C6 14:A6B6: 02        .byte $02   ; <い>
- D - I - - 0x02A6C7 14:A6B7: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A6C8 14:A6B8: 14        .byte $14   ; <と>
- D - I - - 0x02A6C9 14:A6B9: 00        .byte $00
- D - I - - 0x02A6CA 14:A6BA: F4        .byte $F4
- D - I - - 0x02A6CB 14:A6BB: FF        .byte $FF
- D - I - - 0x02A6CC 14:A6BC: 03        .byte $03   ; <う>
- D - I - - 0x02A6CD 14:A6BD: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A6CE 14:A6BE: EF        .byte $EF
- D - I - - 0x02A6CF 14:A6BF: FF        .byte $FF
- D - I - - 0x02A6D0 14:A6C0: 80        .byte $80
- D - I - - 0x02A6D1 14:A6C1: FC        .byte $FC
- D - I - - 0x02A6D2 14:A6C2: 80        .byte $80
- D - I - - 0x02A6D3 14:A6C3: FF        .byte $FF
- D - I - - 0x02A6D4 14:A6C4: 17        .byte $17   ; <ぬ>
- D - I - - 0x02A6D5 14:A6C5: 00        .byte $00
- - - - - - 0x02A6D6 14:A6C6: 00        .byte $00

off_A6C7_62:
- D - I - - 0x02A6D7 14:A6C7: 01        .byte $01   ; <あ>
- D - I - - 0x02A6D8 14:A6C8: 14        .byte $14   ; <と>
- D - I - - 0x02A6D9 14:A6C9: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A6DA 14:A6CA: FD        .byte $FD
- D - I - - 0x02A6DB 14:A6CB: 00        .byte $00
- D - I - - 0x02A6DC 14:A6CC: 00        .byte $00
- - - - - - 0x02A6DD 14:A6CD: 00        .byte $00

off_A6CE_63:
- D - I - - 0x02A6DE 14:A6CE: 01        .byte $01   ; <あ>
- D - I - - 0x02A6DF 14:A6CF: 16        .byte $16   ; <に>
- D - I - - 0x02A6E0 14:A6D0: 80        .byte $80
- D - I - - 0x02A6E1 14:A6D1: 03        .byte $03   ; <う>
- D - I - - 0x02A6E2 14:A6D2: 80        .byte $80
- D - I - - 0x02A6E3 14:A6D3: 03        .byte $03   ; <う>
- - - - - - 0x02A6E4 14:A6D4: 00        .byte $00

off_A6D5_64:
- D - I - - 0x02A6E5 14:A6D5: 01        .byte $01   ; <あ>
- D - I - - 0x02A6E6 14:A6D6: 14        .byte $14   ; <と>
- D - I - - 0x02A6E7 14:A6D7: 80        .byte $80
- D - I - - 0x02A6E8 14:A6D8: FF        .byte $FF
- D - I - - 0x02A6E9 14:A6D9: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A6EA 14:A6DA: FF        .byte $FF
- - - - - - 0x02A6EB 14:A6DB: 00        .byte $00

off_A6DC_65:
- D - I - - 0x02A6EC 14:A6DC: 01        .byte $01   ; <あ>
- D - I - - 0x02A6ED 14:A6DD: 14        .byte $14   ; <と>
- D - I - - 0x02A6EE 14:A6DE: 80        .byte $80
- D - I - - 0x02A6EF 14:A6DF: 02        .byte $02   ; <い>
- D - I - - 0x02A6F0 14:A6E0: 40        .byte $40   ; <「>
- D - I - - 0x02A6F1 14:A6E1: 01        .byte $01   ; <あ>
- - - - - - 0x02A6F2 14:A6E2: 00        .byte $00

off_A6E3_66:
- D - I - - 0x02A6F3 14:A6E3: 01        .byte $01   ; <あ>
- D - I - - 0x02A6F4 14:A6E4: 28        .byte $28   ; <り>
- D - I - - 0x02A6F5 14:A6E5: E0        .byte $E0
- D - I - - 0x02A6F6 14:A6E6: FF        .byte $FF
- D - I - - 0x02A6F7 14:A6E7: 20        .byte $20   ; <み>
- D - I - - 0x02A6F8 14:A6E8: 00        .byte $00
- - - - - - 0x02A6F9 14:A6E9: 00        .byte $00

off_A6EA_67:
- D - I - - 0x02A6FA 14:A6EA: 01        .byte $01   ; <あ>
- D - I - - 0x02A6FB 14:A6EB: 14        .byte $14   ; <と>
- D - I - - 0x02A6FC 14:A6EC: 40        .byte $40   ; <「>
- D - I - - 0x02A6FD 14:A6ED: 02        .byte $02   ; <い>
- D - I - - 0x02A6FE 14:A6EE: 00        .byte $00
- D - I - - 0x02A6FF 14:A6EF: 00        .byte $00
- D - I - - 0x02A700 14:A6F0: 00        .byte $00

off_A6F1_68:
- D - I - - 0x02A701 14:A6F1: 01        .byte $01   ; <あ>
- D - I - - 0x02A702 14:A6F2: 14        .byte $14   ; <と>
- D - I - - 0x02A703 14:A6F3: DA        .byte $DA
- D - I - - 0x02A704 14:A6F4: FF        .byte $FF
- D - I - - 0x02A705 14:A6F5: 00        .byte $00
- D - I - - 0x02A706 14:A6F6: 00        .byte $00
- D - I - - 0x02A707 14:A6F7: 00        .byte $00

off_A6F8_69:
- D - I - - 0x02A708 14:A6F8: 01        .byte $01   ; <あ>
- D - I - - 0x02A709 14:A6F9: 32        .byte $32   ; <ょ>
- D - I - - 0x02A70A 14:A6FA: 78        .byte $78   ; <?>
- D - I - - 0x02A70B 14:A6FB: FF        .byte $FF
- D - I - - 0x02A70C 14:A6FC: 3C        .byte $3C   ; <9>
- D - I - - 0x02A70D 14:A6FD: FF        .byte $FF
- - - - - - 0x02A70E 14:A6FE: 00        .byte $00

off_A6FF_6A:
- D - I - - 0x02A70F 14:A6FF: 01        .byte $01   ; <あ>
- D - I - - 0x02A710 14:A700: 32        .byte $32   ; <ょ>
- D - I - - 0x02A711 14:A701: 80        .byte $80
- D - I - - 0x02A712 14:A702: FF        .byte $FF
- D - I - - 0x02A713 14:A703: 00        .byte $00
- D - I - - 0x02A714 14:A704: 00        .byte $00
- - - - - - 0x02A715 14:A705: 00        .byte $00

off_A706_6B:
- D - I - - 0x02A716 14:A706: 01        .byte $01   ; <あ>
- D - I - - 0x02A717 14:A707: 32        .byte $32   ; <ょ>
- D - I - - 0x02A718 14:A708: 32        .byte $32   ; <ょ>
- D - I - - 0x02A719 14:A709: 00        .byte $00
- D - I - - 0x02A71A 14:A70A: F8        .byte $F8
- D - I - - 0x02A71B 14:A70B: FF        .byte $FF
- - - - - - 0x02A71C 14:A70C: 00        .byte $00

off_A70D_6C:
- D - I - - 0x02A71D 14:A70D: 01        .byte $01   ; <あ>
- D - I - - 0x02A71E 14:A70E: 32        .byte $32   ; <ょ>
- D - I - - 0x02A71F 14:A70F: F5        .byte $F5
- D - I - - 0x02A720 14:A710: 00        .byte $00
- D - I - - 0x02A721 14:A711: 2F        .byte $2F   ; <っ>
- D - I - - 0x02A722 14:A712: FF        .byte $FF
- - - - - - 0x02A723 14:A713: 00        .byte $00

off_A714_6D:
- D - I - - 0x02A724 14:A714: 01        .byte $01   ; <あ>
- D - I - - 0x02A725 14:A715: 32        .byte $32   ; <ょ>
- D - I - - 0x02A726 14:A716: 0B        .byte $0B   ; <さ>
- D - I - - 0x02A727 14:A717: FF        .byte $FF
- D - I - - 0x02A728 14:A718: 39        .byte $39   ; <6>
- D - I - - 0x02A729 14:A719: FF        .byte $FF
- - - - - - 0x02A72A 14:A71A: 00        .byte $00

off_A71B_6E:
- D - I - - 0x02A72B 14:A71B: 01        .byte $01   ; <あ>
- D - I - - 0x02A72C 14:A71C: 32        .byte $32   ; <ょ>
- D - I - - 0x02A72D 14:A71D: 00        .byte $00
- D - I - - 0x02A72E 14:A71E: 00        .byte $00
- D - I - - 0x02A72F 14:A71F: 2F        .byte $2F   ; <っ>
- D - I - - 0x02A730 14:A720: FF        .byte $FF
- - - - - - 0x02A731 14:A721: 00        .byte $00

off_A722_6F:
- - - - - - 0x02A732 14:A722: 00        .byte $00

off_A723_70:
off_A723:
- D - I - - 0x02A733 14:A723: 01        .byte $01   ; <あ>
- D - I - - 0x02A734 14:A724: EF        .byte $EF
- D - I - - 0x02A735 14:A725: 26        .byte $26   ; <よ>
- D - I - - 0x02A736 14:A726: 00        .byte $00
- D - I - - 0x02A737 14:A727: 00        .byte $00
- D - I - - 0x02A738 14:A728: 00        .byte $00
- D - I - - 0x02A739 14:A729: 04        .byte $04   ; <え>
- D - I - - 0x02A73A 14:A72A: 23 A7     .word off_A723

off_A72C_71:
off_A72C:
- D - I - - 0x02A73C 14:A72C: 01        .byte $01   ; <あ>
- D - I - - 0x02A73D 14:A72D: A0        .byte $A0   ; <が>
- D - I - - 0x02A73E 14:A72E: 40        .byte $40   ; <「>
- D - I - - 0x02A73F 14:A72F: 00        .byte $00
- D - I - - 0x02A740 14:A730: 00        .byte $00
- D - I - - 0x02A741 14:A731: 00        .byte $00
- D - I - - 0x02A742 14:A732: 04        .byte $04   ; <え>
- D - I - - 0x02A743 14:A733: 2C A7     .word off_A72C

off_A735_72:
- D - I - - 0x02A745 14:A735: 01        .byte $01   ; <あ>
- D - I - - 0x02A746 14:A736: 04        .byte $04   ; <え>
- D - I - - 0x02A747 14:A737: 00        .byte $00
- D - I - - 0x02A748 14:A738: F8        .byte $F8
- D - I - - 0x02A749 14:A739: 00        .byte $00
- D - I - - 0x02A74A 14:A73A: 00        .byte $00
- D - I - - 0x02A74B 14:A73B: 01        .byte $01   ; <あ>
- D - I - - 0x02A74C 14:A73C: 04        .byte $04   ; <え>
- D - I - - 0x02A74D 14:A73D: 00        .byte $00
- D - I - - 0x02A74E 14:A73E: 08        .byte $08   ; <く>
- D - I - - 0x02A74F 14:A73F: 00        .byte $00
- D - I - - 0x02A750 14:A740: 00        .byte $00
- D - I - - 0x02A751 14:A741: 00        .byte $00

off_A742_73:
- D - I - - 0x02A752 14:A742: 02        .byte $02   ; <い>
- D - I - - 0x02A753 14:A743: 28        .byte $28   ; <り>
- D - I - - 0x02A754 14:A744: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A755 14:A745: 00        .byte $00
- D - I - - 0x02A756 14:A746: 00        .byte $00
- D - I - - 0x02A757 14:A747: 00        .byte $00
- D - I - - 0x02A758 14:A748: 00        .byte $00

off_A749_74:
- - - - - - 0x02A759 14:A749: 01        .byte $01   ; <あ>
- - - - - - 0x02A75A 14:A74A: 14        .byte $14   ; <と>
- - - - - - 0x02A75B 14:A74B: 40        .byte $40   ; <「>
- - - - - - 0x02A75C 14:A74C: 06        .byte $06   ; <か>
- - - - - - 0x02A75D 14:A74D: 80        .byte $80
- - - - - - 0x02A75E 14:A74E: FB        .byte $FB
- - - - - - 0x02A75F 14:A74F: 00        .byte $00

off_A750_75:
- D - I - - 0x02A760 14:A750: 03        .byte $03   ; <う>
- D - I - - 0x02A761 14:A751: 3C        .byte $3C   ; <9>
- D - I - - 0x02A762 14:A752: DE        .byte $DE
- D - I - - 0x02A763 14:A753: FD        .byte $FD
- D - I - - 0x02A764 14:A754: 74        .byte $74   ; <ィ>
- D - I - - 0x02A765 14:A755: FF        .byte $FF
- D - I - - 0x02A766 14:A756: 20        .byte $20   ; <み>
- D - I - - 0x02A767 14:A757: 00        .byte $00
- D - I - - 0x02A768 14:A758: 00        .byte $00
- D - I - - 0x02A769 14:A759: 00        .byte $00
- D - I - - 0x02A76A 14:A75A: 00        .byte $00

off_A75B_76:
- D - I - - 0x02A76B 14:A75B: 01        .byte $01   ; <あ>
- D - I - - 0x02A76C 14:A75C: 14        .byte $14   ; <と>
- D - I - - 0x02A76D 14:A75D: 40        .byte $40   ; <「>
- D - I - - 0x02A76E 14:A75E: 06        .byte $06   ; <か>
- D - I - - 0x02A76F 14:A75F: 80        .byte $80
- D - I - - 0x02A770 14:A760: FB        .byte $FB
- D - I - - 0x02A771 14:A761: 00        .byte $00

off_A762_77:
- D - I - - 0x02A772 14:A762: 03        .byte $03   ; <う>
- D - I - - 0x02A773 14:A763: 3C        .byte $3C   ; <9>
- D - I - - 0x02A774 14:A764: 00        .byte $00
- D - I - - 0x02A775 14:A765: FF        .byte $FF
- D - I - - 0x02A776 14:A766: 60        .byte $60   ; <ミ>
- D - I - - 0x02A777 14:A767: FC        .byte $FC
- D - I - - 0x02A778 14:A768: F6        .byte $F6
- D - I - - 0x02A779 14:A769: FF        .byte $FF
- D - I - - 0x02A77A 14:A76A: 14        .byte $14   ; <と>
- D - I - - 0x02A77B 14:A76B: 00        .byte $00
- D - I - - 0x02A77C 14:A76C: 00        .byte $00

off_A76D_78:
- - - - - - 0x02A77D 14:A76D: 00        .byte $00

off_A76E_79:
- - - - - - 0x02A77E 14:A76E: 00        .byte $00

off_A76F_7A:
- D - I - - 0x02A77F 14:A76F: 03        .byte $03   ; <う>
- D - I - - 0x02A780 14:A770: 62        .byte $62   ; <メ>
- D - I - - 0x02A781 14:A771: 49        .byte $49   ; <ケ>
- D - I - - 0x02A782 14:A772: 02        .byte $02   ; <い>
- D - I - - 0x02A783 14:A773: 03        .byte $03   ; <う>
- D - I - - 0x02A784 14:A774: FF        .byte $FF
- D - I - - 0x02A785 14:A775: FD        .byte $FD
- D - I - - 0x02A786 14:A776: FF        .byte $FF
- D - I - - 0x02A787 14:A777: 03        .byte $03   ; <う>
- D - I - - 0x02A788 14:A778: 00        .byte $00
- D - I - - 0x02A789 14:A779: 00        .byte $00

off_A77A_7B:
- - - - - - 0x02A78A 14:A77A: 03        .byte $03   ; <う>
- - - - - - 0x02A78B 14:A77B: 1E        .byte $1E   ; <ほ>
- - - - - - 0x02A78C 14:A77C: F7        .byte $F7
- - - - - - 0x02A78D 14:A77D: 02        .byte $02   ; <い>
- - - - - - 0x02A78E 14:A77E: 12        .byte $12   ; <つ>
- - - - - - 0x02A78F 14:A77F: F9        .byte $F9
- - - - - - 0x02A790 14:A780: 00        .byte $00
- - - - - - 0x02A791 14:A781: 00        .byte $00
- - - - - - 0x02A792 14:A782: 48        .byte $48   ; <ク>
- - - - - - 0x02A793 14:A783: 00        .byte $00
- - - - - - 0x02A794 14:A784: 03        .byte $03   ; <う>
- - - - - - 0x02A795 14:A785: 1E        .byte $1E   ; <ほ>
- - - - - - 0x02A796 14:A786: 19        .byte $19   ; <の>
- - - - - - 0x02A797 14:A787: 02        .byte $02   ; <い>
- - - - - - 0x02A798 14:A788: 19        .byte $19   ; <の>
- - - - - - 0x02A799 14:A789: 01        .byte $01   ; <あ>
- - - - - - 0x02A79A 14:A78A: FC        .byte $FC
- - - - - - 0x02A79B 14:A78B: FF        .byte $FF
- - - - - - 0x02A79C 14:A78C: 04        .byte $04   ; <え>
- - - - - - 0x02A79D 14:A78D: 00        .byte $00
- - - - - - 0x02A79E 14:A78E: 00        .byte $00

off_A78F_7C:
- D - I - - 0x02A79F 14:A78F: 03        .byte $03   ; <う>
- D - I - - 0x02A7A0 14:A790: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A7A1 14:A791: C6        .byte $C6   ; <ベ>
- D - I - - 0x02A7A2 14:A792: 01        .byte $01   ; <あ>
- D - I - - 0x02A7A3 14:A793: 00        .byte $00
- D - I - - 0x02A7A4 14:A794: 00        .byte $00
- D - I - - 0x02A7A5 14:A795: 18        .byte $18   ; <ね>
- D - I - - 0x02A7A6 14:A796: 00        .byte $00
- D - I - - 0x02A7A7 14:A797: 0A        .byte $0A   ; <こ>
- D - I - - 0x02A7A8 14:A798: 00        .byte $00
- - - - - - 0x02A7A9 14:A799: 00        .byte $00

off_A79A_7D:
- - - - - - 0x02A7AA 14:A79A: 00        .byte $00

off_A79B_7E:
- D - I - - 0x02A7AB 14:A79B: 03        .byte $03   ; <う>
- D - I - - 0x02A7AC 14:A79C: 32        .byte $32   ; <ょ>
- D - I - - 0x02A7AD 14:A79D: D1        .byte $D1   ; <ポ>
- D - I - - 0x02A7AE 14:A79E: 00        .byte $00
- D - I - - 0x02A7AF 14:A79F: CD        .byte $CD   ; <パ>
- D - I - - 0x02A7B0 14:A7A0: FC        .byte $FC
- D - I - - 0x02A7B1 14:A7A1: 04        .byte $04   ; <え>
- D - I - - 0x02A7B2 14:A7A2: 00        .byte $00
- D - I - - 0x02A7B3 14:A7A3: 28        .byte $28   ; <り>
- D - I - - 0x02A7B4 14:A7A4: 00        .byte $00
- D - I - - 0x02A7B5 14:A7A5: 00        .byte $00

off_A7A6_7F:
- - - - - - 0x02A7B6 14:A7A6: 03        .byte $03   ; <う>
- - - - - - 0x02A7B7 14:A7A7: 32        .byte $32   ; <ょ>
- - - - - - 0x02A7B8 14:A7A8: 9A        .byte $9A
- - - - - - 0x02A7B9 14:A7A9: F9        .byte $F9
- - - - - - 0x02A7BA 14:A7AA: FA        .byte $FA
- - - - - - 0x02A7BB 14:A7AB: 00        .byte $00
- - - - - - 0x02A7BC 14:A7AC: 1A        .byte $1A   ; <は>
- - - - - - 0x02A7BD 14:A7AD: 00        .byte $00
- - - - - - 0x02A7BE 14:A7AE: 00        .byte $00
- - - - - - 0x02A7BF 14:A7AF: 00        .byte $00
- - - - - - 0x02A7C0 14:A7B0: 00        .byte $00

off_A7B1_80:
- D - I - - 0x02A7C1 14:A7B1: 03        .byte $03   ; <う>
- D - I - - 0x02A7C2 14:A7B2: 32        .byte $32   ; <ょ>
- D - I - - 0x02A7C3 14:A7B3: 00        .byte $00
- D - I - - 0x02A7C4 14:A7B4: 00        .byte $00
- D - I - - 0x02A7C5 14:A7B5: 05        .byte $05   ; <お>
- D - I - - 0x02A7C6 14:A7B6: 03        .byte $03   ; <う>
- D - I - - 0x02A7C7 14:A7B7: 08        .byte $08   ; <く>
- D - I - - 0x02A7C8 14:A7B8: 00        .byte $00
- D - I - - 0x02A7C9 14:A7B9: F0        .byte $F0
- D - I - - 0x02A7CA 14:A7BA: FF        .byte $FF
- D - I - - 0x02A7CB 14:A7BB: 00        .byte $00

off_A7BC_81:
- D - I - - 0x02A7CC 14:A7BC: 03        .byte $03   ; <う>
- D - I - - 0x02A7CD 14:A7BD: 32        .byte $32   ; <ょ>
- D - I - - 0x02A7CE 14:A7BE: C7        .byte $C7   ; <ボ>
- D - I - - 0x02A7CF 14:A7BF: 00        .byte $00
- D - I - - 0x02A7D0 14:A7C0: AF        .byte $AF   ; <ば>
- D - I - - 0x02A7D1 14:A7C1: FB        .byte $FB
- D - I - - 0x02A7D2 14:A7C2: 06        .byte $06   ; <か>
- D - I - - 0x02A7D3 14:A7C3: 00        .byte $00
- D - I - - 0x02A7D4 14:A7C4: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A7D5 14:A7C5: 00        .byte $00
- D - I - - 0x02A7D6 14:A7C6: 00        .byte $00

off_A7C7_82:
- - - - - - 0x02A7D7 14:A7C7: 03        .byte $03   ; <う>
- - - - - - 0x02A7D8 14:A7C8: 32        .byte $32   ; <ょ>
- - - - - - 0x02A7D9 14:A7C9: 14        .byte $14   ; <と>
- - - - - - 0x02A7DA 14:A7CA: 02        .byte $02   ; <い>
- - - - - - 0x02A7DB 14:A7CB: DD        .byte $DD
- - - - - - 0x02A7DC 14:A7CC: FE        .byte $FE
- - - - - - 0x02A7DD 14:A7CD: 10        .byte $10   ; <た>
- - - - - - 0x02A7DE 14:A7CE: 00        .byte $00
- - - - - - 0x02A7DF 14:A7CF: 10        .byte $10   ; <た>
- - - - - - 0x02A7E0 14:A7D0: 00        .byte $00
- - - - - - 0x02A7E1 14:A7D1: 00        .byte $00

off_A7D2_83:
- D - I - - 0x02A7E2 14:A7D2: 03        .byte $03   ; <う>
- D - I - - 0x02A7E3 14:A7D3: 32        .byte $32   ; <ょ>
- D - I - - 0x02A7E4 14:A7D4: FA        .byte $FA
- D - I - - 0x02A7E5 14:A7D5: 00        .byte $00
- D - I - - 0x02A7E6 14:A7D6: A4        .byte $A4   ; <ご>
- D - I - - 0x02A7E7 14:A7D7: FC        .byte $FC
- D - I - - 0x02A7E8 14:A7D8: 08        .byte $08   ; <く>
- D - I - - 0x02A7E9 14:A7D9: 00        .byte $00
- D - I - - 0x02A7EA 14:A7DA: 28        .byte $28   ; <り>
- D - I - - 0x02A7EB 14:A7DB: 00        .byte $00
- - - - - - 0x02A7EC 14:A7DC: 00        .byte $00

off_A7DD_84:
- D - I - - 0x02A7ED 14:A7DD: 03        .byte $03   ; <う>
- D - I - - 0x02A7EE 14:A7DE: 14        .byte $14   ; <と>
- D - I - - 0x02A7EF 14:A7DF: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02A7F0 14:A7E0: 00        .byte $00
- D - I - - 0x02A7F1 14:A7E1: 59        .byte $59   ; <ノ>
- D - I - - 0x02A7F2 14:A7E2: 04        .byte $04   ; <え>
- D - I - - 0x02A7F3 14:A7E3: 00        .byte $00
- D - I - - 0x02A7F4 14:A7E4: 00        .byte $00
- D - I - - 0x02A7F5 14:A7E5: 40        .byte $40   ; <「>
- D - I - - 0x02A7F6 14:A7E6: 00        .byte $00
- D - I - - 0x02A7F7 14:A7E7: 03        .byte $03   ; <う>
- D - I - - 0x02A7F8 14:A7E8: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A7F9 14:A7E9: 3B        .byte $3B   ; <8>
- D - I - - 0x02A7FA 14:A7EA: 00        .byte $00
- D - I - - 0x02A7FB 14:A7EB: 2B        .byte $2B   ; <ろ>
- D - I - - 0x02A7FC 14:A7EC: FA        .byte $FA
- D - I - - 0x02A7FD 14:A7ED: 00        .byte $00
- D - I - - 0x02A7FE 14:A7EE: 00        .byte $00
- D - I - - 0x02A7FF 14:A7EF: 58        .byte $58   ; <ネ>
- D - I - - 0x02A800 14:A7F0: 00        .byte $00
- D - I - - 0x02A801 14:A7F1: 03        .byte $03   ; <う>
- D - I - - 0x02A802 14:A7F2: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A803 14:A7F3: 19        .byte $19   ; <の>
- D - I - - 0x02A804 14:A7F4: 00        .byte $00
- D - I - - 0x02A805 14:A7F5: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A806 14:A7F6: FD        .byte $FD
- D - I - - 0x02A807 14:A7F7: 00        .byte $00
- D - I - - 0x02A808 14:A7F8: 00        .byte $00
- D - I - - 0x02A809 14:A7F9: 2A        .byte $2A   ; <れ>
- D - I - - 0x02A80A 14:A7FA: 00        .byte $00
- D - I - - 0x02A80B 14:A7FB: 00        .byte $00

off_A7FC_85:
- D - I - - 0x02A80C 14:A7FC: 03        .byte $03   ; <う>
- D - I - - 0x02A80D 14:A7FD: 14        .byte $14   ; <と>
- D - I - - 0x02A80E 14:A7FE: 0C        .byte $0C   ; <し>
- D - I - - 0x02A80F 14:A7FF: 08        .byte $08   ; <く>
- D - I - - 0x02A810 14:A800: 26        .byte $26   ; <よ>
- D - I - - 0x02A811 14:A801: 01        .byte $01   ; <あ>
- D - I - - 0x02A812 14:A802: 00        .byte $00
- D - I - - 0x02A813 14:A803: 00        .byte $00
- D - I - - 0x02A814 14:A804: 50        .byte $50   ; <タ>
- D - I - - 0x02A815 14:A805: 00        .byte $00
- D - I - - 0x02A816 14:A806: 03        .byte $03   ; <う>
- D - I - - 0x02A817 14:A807: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A818 14:A808: D5        .byte $D5
- D - I - - 0x02A819 14:A809: 05        .byte $05   ; <お>
- D - I - - 0x02A81A 14:A80A: 6F        .byte $6F   ; <ッ>
- D - I - - 0x02A81B 14:A80B: FA        .byte $FA
- D - I - - 0x02A81C 14:A80C: 00        .byte $00
- D - I - - 0x02A81D 14:A80D: 00        .byte $00
- D - I - - 0x02A81E 14:A80E: 40        .byte $40   ; <「>
- D - I - - 0x02A81F 14:A80F: 00        .byte $00
- D - I - - 0x02A820 14:A810: 00        .byte $00

off_A811_86:
- D - I - - 0x02A821 14:A811: 03        .byte $03   ; <う>
- D - I - - 0x02A822 14:A812: 3C        .byte $3C   ; <9>
- D - I - - 0x02A823 14:A813: F3        .byte $F3
- D - I - - 0x02A824 14:A814: 00        .byte $00
- D - I - - 0x02A825 14:A815: 00        .byte $00
- D - I - - 0x02A826 14:A816: 00        .byte $00
- D - I - - 0x02A827 14:A817: 10        .byte $10   ; <た>
- D - I - - 0x02A828 14:A818: 00        .byte $00
- D - I - - 0x02A829 14:A819: 06        .byte $06   ; <か>
- D - I - - 0x02A82A 14:A81A: 00        .byte $00
- - - - - - 0x02A82B 14:A81B: 00        .byte $00

off_A81C_87:
- D - I - - 0x02A82C 14:A81C: 02        .byte $02   ; <い>
- D - I - - 0x02A82D 14:A81D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A82E 14:A81E: 14        .byte $14   ; <と>
- D - I - - 0x02A82F 14:A81F: 00        .byte $00
- D - I - - 0x02A830 14:A820: F4        .byte $F4
- D - I - - 0x02A831 14:A821: FF        .byte $FF
- D - I - - 0x02A832 14:A822: 03        .byte $03   ; <う>
- D - I - - 0x02A833 14:A823: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A834 14:A824: 00        .byte $00
- D - I - - 0x02A835 14:A825: 00        .byte $00
- D - I - - 0x02A836 14:A826: 9A        .byte $9A
- D - I - - 0x02A837 14:A827: FE        .byte $FE
- D - I - - 0x02A838 14:A828: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02A839 14:A829: FF        .byte $FF
- D - I - - 0x02A83A 14:A82A: FC        .byte $FC
- D - I - - 0x02A83B 14:A82B: FF        .byte $FF
- D - I - - 0x02A83C 14:A82C: 00        .byte $00

off_A82D_88:
- D - I - - 0x02A83D 14:A82D: 03        .byte $03   ; <う>
- D - I - - 0x02A83E 14:A82E: 28        .byte $28   ; <り>
- D - I - - 0x02A83F 14:A82F: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x02A840 14:A830: FD        .byte $FD
- D - I - - 0x02A841 14:A831: A0        .byte $A0   ; <が>
- D - I - - 0x02A842 14:A832: FD        .byte $FD
- D - I - - 0x02A843 14:A833: 18        .byte $18   ; <ね>
- D - I - - 0x02A844 14:A834: 00        .byte $00
- D - I - - 0x02A845 14:A835: 10        .byte $10   ; <た>
- D - I - - 0x02A846 14:A836: 00        .byte $00
- D - I - - 0x02A847 14:A837: 02        .byte $02   ; <い>
- D - I - - 0x02A848 14:A838: 14        .byte $14   ; <と>
- D - I - - 0x02A849 14:A839: A0        .byte $A0   ; <が>
- D - I - - 0x02A84A 14:A83A: 00        .byte $00
- D - I - - 0x02A84B 14:A83B: 50        .byte $50   ; <タ>
- D - I - - 0x02A84C 14:A83C: 00        .byte $00
- - - - - - 0x02A84D 14:A83D: 00        .byte $00

off_A83E_89:
- D - I - - 0x02A84E 14:A83E: 03        .byte $03   ; <う>
- D - I - - 0x02A84F 14:A83F: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A850 14:A840: 80        .byte $80
- D - I - - 0x02A851 14:A841: 02        .byte $02   ; <い>
- D - I - - 0x02A852 14:A842: 80        .byte $80
- D - I - - 0x02A853 14:A843: 06        .byte $06   ; <か>
- D - I - - 0x02A854 14:A844: 00        .byte $00
- D - I - - 0x02A855 14:A845: 00        .byte $00
- D - I - - 0x02A856 14:A846: D0        .byte $D0   ; <ペ>
- D - I - - 0x02A857 14:A847: FF        .byte $FF
- - - - - - 0x02A858 14:A848: 00        .byte $00

off_A849_8A:
- D - I - - 0x02A859 14:A849: 02        .byte $02   ; <い>
- D - I - - 0x02A85A 14:A84A: 32        .byte $32   ; <ょ>
- D - I - - 0x02A85B 14:A84B: 00        .byte $00
- D - I - - 0x02A85C 14:A84C: 00        .byte $00
- D - I - - 0x02A85D 14:A84D: E8        .byte $E8
- D - I - - 0x02A85E 14:A84E: FF        .byte $FF
- - - - - - 0x02A85F 14:A84F: 00        .byte $00

off_A850_8B:
- D - I - - 0x02A860 14:A850: 01        .byte $01   ; <あ>
- D - I - - 0x02A861 14:A851: 28        .byte $28   ; <り>
- D - I - - 0x02A862 14:A852: A0        .byte $A0   ; <が>
- D - I - - 0x02A863 14:A853: FC        .byte $FC
- D - I - - 0x02A864 14:A854: 20        .byte $20   ; <み>
- D - I - - 0x02A865 14:A855: 00        .byte $00
- D - I - - 0x02A866 14:A856: 00        .byte $00

off_A857_8C:
- D - I - - 0x02A867 14:A857: 01        .byte $01   ; <あ>
- D - I - - 0x02A868 14:A858: 3C        .byte $3C   ; <9>
- D - I - - 0x02A869 14:A859: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A86A 14:A85A: FD        .byte $FD
- D - I - - 0x02A86B 14:A85B: 13        .byte $13   ; <て>
- D - I - - 0x02A86C 14:A85C: 00        .byte $00
- D - I - - 0x02A86D 14:A85D: 00        .byte $00

off_A85E_8D:
- D - I - - 0x02A86E 14:A85E: 02        .byte $02   ; <い>
- D - I - - 0x02A86F 14:A85F: 32        .byte $32   ; <ょ>
- D - I - - 0x02A870 14:A860: 44        .byte $44   ; <エ>
- D - I - - 0x02A871 14:A861: 00        .byte $00
- D - I - - 0x02A872 14:A862: 00        .byte $00
- D - I - - 0x02A873 14:A863: 00        .byte $00
- D - I - - 0x02A874 14:A864: 00        .byte $00

off_A865_8E:
- D - I - - 0x02A875 14:A865: 01        .byte $01   ; <あ>
- D - I - - 0x02A876 14:A866: 0A        .byte $0A   ; <こ>
- D - I - - 0x02A877 14:A867: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A878 14:A868: 00        .byte $00
- D - I - - 0x02A879 14:A869: 00        .byte $00
- D - I - - 0x02A87A 14:A86A: 00        .byte $00
- D - I - - 0x02A87B 14:A86B: 00        .byte $00

off_A86C_8F:
- D - I - - 0x02A87C 14:A86C: 01        .byte $01   ; <あ>
- D - I - - 0x02A87D 14:A86D: 3C        .byte $3C   ; <9>
- D - I - - 0x02A87E 14:A86E: 48        .byte $48   ; <ク>
- D - I - - 0x02A87F 14:A86F: 02        .byte $02   ; <い>
- D - I - - 0x02A880 14:A870: 77        .byte $77   ; <:>
- D - I - - 0x02A881 14:A871: 00        .byte $00
- - - - - - 0x02A882 14:A872: 00        .byte $00

off_A873_90:
- D - I - - 0x02A883 14:A873: 01        .byte $01   ; <あ>
- D - I - - 0x02A884 14:A874: 14        .byte $14   ; <と>
- D - I - - 0x02A885 14:A875: E0        .byte $E0
- D - I - - 0x02A886 14:A876: FE        .byte $FE
- D - I - - 0x02A887 14:A877: 80        .byte $80
- D - I - - 0x02A888 14:A878: FA        .byte $FA
- D - I - - 0x02A889 14:A879: 00        .byte $00

off_A87A_91:
- D - I - - 0x02A88A 14:A87A: 03        .byte $03   ; <う>
- D - I - - 0x02A88B 14:A87B: 3C        .byte $3C   ; <9>
- D - I - - 0x02A88C 14:A87C: D2        .byte $D2
- D - I - - 0x02A88D 14:A87D: FC        .byte $FC
- D - I - - 0x02A88E 14:A87E: 45        .byte $45   ; <オ>
- D - I - - 0x02A88F 14:A87F: FC        .byte $FC
- D - I - - 0x02A890 14:A880: 2A        .byte $2A   ; <れ>
- D - I - - 0x02A891 14:A881: 00        .byte $00
- D - I - - 0x02A892 14:A882: 1A        .byte $1A   ; <は>
- D - I - - 0x02A893 14:A883: 00        .byte $00
- - - - - - 0x02A894 14:A884: 00        .byte $00

off_A885_92:
- D - I - - 0x02A895 14:A885: 01        .byte $01   ; <あ>
- D - I - - 0x02A896 14:A886: 14        .byte $14   ; <と>
- D - I - - 0x02A897 14:A887: 67        .byte $67   ; <ラ>
- D - I - - 0x02A898 14:A888: FE        .byte $FE
- D - I - - 0x02A899 14:A889: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A89A 14:A88A: 02        .byte $02   ; <い>
- D - I - - 0x02A89B 14:A88B: 01        .byte $01   ; <あ>
- D - I - - 0x02A89C 14:A88C: 14        .byte $14   ; <と>
- D - I - - 0x02A89D 14:A88D: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A89E 14:A88E: 0C        .byte $0C   ; <し>
- D - I - - 0x02A89F 14:A88F: B3        .byte $B3   ; <ぼ>
- D - I - - 0x02A8A0 14:A890: 03        .byte $03   ; <う>
- D - I - - 0x02A8A1 14:A891: 00        .byte $00

off_A892_93:
- D - I - - 0x02A8A2 14:A892: 03        .byte $03   ; <う>
- D - I - - 0x02A8A3 14:A893: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A8A4 14:A894: 00        .byte $00
- D - I - - 0x02A8A5 14:A895: 08        .byte $08   ; <く>
- D - I - - 0x02A8A6 14:A896: 1A        .byte $1A   ; <は>
- D - I - - 0x02A8A7 14:A897: FE        .byte $FE
- D - I - - 0x02A8A8 14:A898: 80        .byte $80
- D - I - - 0x02A8A9 14:A899: FF        .byte $FF
- D - I - - 0x02A8AA 14:A89A: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A8AB 14:A89B: 00        .byte $00
- D - I - - 0x02A8AC 14:A89C: 03        .byte $03   ; <う>
- D - I - - 0x02A8AD 14:A89D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A8AE 14:A89E: 78        .byte $78   ; <?>
- D - I - - 0x02A8AF 14:A89F: FB        .byte $FB
- D - I - - 0x02A8B0 14:A8A0: 33        .byte $33   ; <0>
- D - I - - 0x02A8B1 14:A8A1: 03        .byte $03   ; <う>
- D - I - - 0x02A8B2 14:A8A2: A8        .byte $A8   ; <ぜ>
- D - I - - 0x02A8B3 14:A8A3: 00        .byte $00
- D - I - - 0x02A8B4 14:A8A4: D0        .byte $D0   ; <ペ>
- D - I - - 0x02A8B5 14:A8A5: FF        .byte $FF
- - - - - - 0x02A8B6 14:A8A6: 00        .byte $00

off_A8A7_94:
- D - I - - 0x02A8B7 14:A8A7: 02        .byte $02   ; <い>
- D - I - - 0x02A8B8 14:A8A8: 14        .byte $14   ; <と>
- D - I - - 0x02A8B9 14:A8A9: A0        .byte $A0   ; <が>
- D - I - - 0x02A8BA 14:A8AA: 00        .byte $00
- D - I - - 0x02A8BB 14:A8AB: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A8BC 14:A8AC: FF        .byte $FF
- D - I - - 0x02A8BD 14:A8AD: 03        .byte $03   ; <う>
- D - I - - 0x02A8BE 14:A8AE: 16        .byte $16   ; <に>
- D - I - - 0x02A8BF 14:A8AF: 80        .byte $80
- D - I - - 0x02A8C0 14:A8B0: 03        .byte $03   ; <う>
- D - I - - 0x02A8C1 14:A8B1: 0C        .byte $0C   ; <し>
- D - I - - 0x02A8C2 14:A8B2: 00        .byte $00
- D - I - - 0x02A8C3 14:A8B3: 40        .byte $40   ; <「>
- D - I - - 0x02A8C4 14:A8B4: 00        .byte $00
- D - I - - 0x02A8C5 14:A8B5: 40        .byte $40   ; <「>
- D - I - - 0x02A8C6 14:A8B6: 00        .byte $00
- D - I - - 0x02A8C7 14:A8B7: 00        .byte $00

off_A8B8_95:
- D - I - - 0x02A8C8 14:A8B8: 01        .byte $01   ; <あ>
- D - I - - 0x02A8C9 14:A8B9: 14        .byte $14   ; <と>
- D - I - - 0x02A8CA 14:A8BA: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02A8CB 14:A8BB: F9        .byte $F9
- D - I - - 0x02A8CC 14:A8BC: 80        .byte $80
- D - I - - 0x02A8CD 14:A8BD: FB        .byte $FB
- D - I - - 0x02A8CE 14:A8BE: 00        .byte $00

off_A8BF_96:
- - - - - - 0x02A8CF 14:A8BF: 03        .byte $03   ; <う>
- - - - - - 0x02A8D0 14:A8C0: 28        .byte $28   ; <り>
- - - - - - 0x02A8D1 14:A8C1: F9        .byte $F9
- - - - - - 0x02A8D2 14:A8C2: 01        .byte $01   ; <あ>
- - - - - - 0x02A8D3 14:A8C3: CC        .byte $CC   ; <ぽ>
- - - - - - 0x02A8D4 14:A8C4: 02        .byte $02   ; <い>
- - - - - - 0x02A8D5 14:A8C5: FA        .byte $FA
- - - - - - 0x02A8D6 14:A8C6: FF        .byte $FF
- - - - - - 0x02A8D7 14:A8C7: F8        .byte $F8
- - - - - - 0x02A8D8 14:A8C8: FF        .byte $FF
- - - - - - 0x02A8D9 14:A8C9: 00        .byte $00

off_A8CA_97:
- D - I - - 0x02A8DA 14:A8CA: 02        .byte $02   ; <い>
- D - I - - 0x02A8DB 14:A8CB: 28        .byte $28   ; <り>
- D - I - - 0x02A8DC 14:A8CC: 00        .byte $00
- D - I - - 0x02A8DD 14:A8CD: 00        .byte $00
- D - I - - 0x02A8DE 14:A8CE: E8        .byte $E8
- D - I - - 0x02A8DF 14:A8CF: FF        .byte $FF
- - - - - - 0x02A8E0 14:A8D0: 00        .byte $00

off_A8D1_98:
- D - I - - 0x02A8E1 14:A8D1: 01        .byte $01   ; <あ>
- D - I - - 0x02A8E2 14:A8D2: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A8E3 14:A8D3: 67        .byte $67   ; <ラ>
- D - I - - 0x02A8E4 14:A8D4: FA        .byte $FA
- D - I - - 0x02A8E5 14:A8D5: 80        .byte $80
- D - I - - 0x02A8E6 14:A8D6: 00        .byte $00
- D - I - - 0x02A8E7 14:A8D7: 00        .byte $00

off_A8D8_99:
- D - I - - 0x02A8E8 14:A8D8: 01        .byte $01   ; <あ>
- D - I - - 0x02A8E9 14:A8D9: 50        .byte $50   ; <タ>
- D - I - - 0x02A8EA 14:A8DA: 96        .byte $96
- D - I - - 0x02A8EB 14:A8DB: 00        .byte $00
- D - I - - 0x02A8EC 14:A8DC: 64        .byte $64   ; <ヤ>
- D - I - - 0x02A8ED 14:A8DD: 00        .byte $00
- - - - - - 0x02A8EE 14:A8DE: 00        .byte $00

off_A8DF_9A:
- D - I - - 0x02A8EF 14:A8DF: 03        .byte $03   ; <う>
- D - I - - 0x02A8F0 14:A8E0: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A8F1 14:A8E1: D5        .byte $D5
- D - I - - 0x02A8F2 14:A8E2: 00        .byte $00
- D - I - - 0x02A8F3 14:A8E3: DE        .byte $DE
- D - I - - 0x02A8F4 14:A8E4: FF        .byte $FF
- D - I - - 0x02A8F5 14:A8E5: FF        .byte $FF
- D - I - - 0x02A8F6 14:A8E6: FF        .byte $FF
- D - I - - 0x02A8F7 14:A8E7: 05        .byte $05   ; <お>
- D - I - - 0x02A8F8 14:A8E8: 00        .byte $00
- - - - - - 0x02A8F9 14:A8E9: 01        .byte $01   ; <あ>
- - - - - - 0x02A8FA 14:A8EA: 32        .byte $32   ; <ょ>
- - - - - - 0x02A8FB 14:A8EB: 16        .byte $16   ; <に>
- - - - - - 0x02A8FC 14:A8EC: 00        .byte $00
- - - - - - 0x02A8FD 14:A8ED: 32        .byte $32   ; <ょ>
- - - - - - 0x02A8FE 14:A8EE: 00        .byte $00
- - - - - - 0x02A8FF 14:A8EF: 00        .byte $00

off_A8F0_9B:
- D - I - - 0x02A900 14:A8F0: 03        .byte $03   ; <う>
- D - I - - 0x02A901 14:A8F1: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A902 14:A8F2: 55        .byte $55   ; <ナ>
- D - I - - 0x02A903 14:A8F3: 01        .byte $01   ; <あ>
- D - I - - 0x02A904 14:A8F4: 1A        .byte $1A   ; <は>
- D - I - - 0x02A905 14:A8F5: FE        .byte $FE
- D - I - - 0x02A906 14:A8F6: 00        .byte $00
- D - I - - 0x02A907 14:A8F7: 00        .byte $00
- D - I - - 0x02A908 14:A8F8: 1A        .byte $1A   ; <は>
- D - I - - 0x02A909 14:A8F9: 00        .byte $00
- D - I - - 0x02A90A 14:A8FA: 01        .byte $01   ; <あ>
- D - I - - 0x02A90B 14:A8FB: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A90C 14:A8FC: 40        .byte $40   ; <「>
- D - I - - 0x02A90D 14:A8FD: 00        .byte $00
- D - I - - 0x02A90E 14:A8FE: 40        .byte $40   ; <「>
- D - I - - 0x02A90F 14:A8FF: 00        .byte $00
- - - - - - 0x02A910 14:A900: 00        .byte $00

off_A901_9C:
- D - I - - 0x02A911 14:A901: 01        .byte $01   ; <あ>
- D - I - - 0x02A912 14:A902: 5A        .byte $5A   ; <ハ>
- D - I - - 0x02A913 14:A903: DA        .byte $DA
- D - I - - 0x02A914 14:A904: FF        .byte $FF
- D - I - - 0x02A915 14:A905: 00        .byte $00
- D - I - - 0x02A916 14:A906: 00        .byte $00
- D - I - - 0x02A917 14:A907: 00        .byte $00

off_A908_9D:
- D - I - - 0x02A918 14:A908: 03        .byte $03   ; <う>
- D - I - - 0x02A919 14:A909: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A91A 14:A90A: DD        .byte $DD
- D - I - - 0x02A91B 14:A90B: 03        .byte $03   ; <う>
- D - I - - 0x02A91C 14:A90C: F8        .byte $F8
- D - I - - 0x02A91D 14:A90D: FF        .byte $FF
- D - I - - 0x02A91E 14:A90E: 00        .byte $00
- D - I - - 0x02A91F 14:A90F: 00        .byte $00
- D - I - - 0x02A920 14:A910: 0D        .byte $0D   ; <す>
- D - I - - 0x02A921 14:A911: 00        .byte $00
- - - - - - 0x02A922 14:A912: 00        .byte $00

off_A913_9E:
- D - I - - 0x02A923 14:A913: 03        .byte $03   ; <う>
- D - I - - 0x02A924 14:A914: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A925 14:A915: 23        .byte $23   ; <も>
- D - I - - 0x02A926 14:A916: FC        .byte $FC
- D - I - - 0x02A927 14:A917: F8        .byte $F8
- D - I - - 0x02A928 14:A918: FF        .byte $FF
- D - I - - 0x02A929 14:A919: 00        .byte $00
- D - I - - 0x02A92A 14:A91A: 00        .byte $00
- D - I - - 0x02A92B 14:A91B: 0D        .byte $0D   ; <す>
- D - I - - 0x02A92C 14:A91C: 00        .byte $00
- - - - - - 0x02A92D 14:A91D: 00        .byte $00

off_A91E_9F:
- D - I - - 0x02A92E 14:A91E: 01        .byte $01   ; <あ>
- D - I - - 0x02A92F 14:A91F: 14        .byte $14   ; <と>
- D - I - - 0x02A930 14:A920: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02A931 14:A921: 05        .byte $05   ; <お>
- D - I - - 0x02A932 14:A922: 40        .byte $40   ; <「>
- D - I - - 0x02A933 14:A923: 05        .byte $05   ; <お>
- D - I - - 0x02A934 14:A924: 00        .byte $00

off_A925_A0:
- D - I - - 0x02A935 14:A925: 01        .byte $01   ; <あ>
- D - I - - 0x02A936 14:A926: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A937 14:A927: 3C        .byte $3C   ; <9>
- D - I - - 0x02A938 14:A928: FF        .byte $FF
- D - I - - 0x02A939 14:A929: 44        .byte $44   ; <エ>
- D - I - - 0x02A93A 14:A92A: 00        .byte $00
- - - - - - 0x02A93B 14:A92B: 00        .byte $00

off_A92C_A1:
- D - I - - 0x02A93C 14:A92C: 03        .byte $03   ; <う>
- D - I - - 0x02A93D 14:A92D: 28        .byte $28   ; <り>
- D - I - - 0x02A93E 14:A92E: 20        .byte $20   ; <み>
- D - I - - 0x02A93F 14:A92F: FF        .byte $FF
- D - I - - 0x02A940 14:A930: 00        .byte $00
- D - I - - 0x02A941 14:A931: 00        .byte $00
- D - I - - 0x02A942 14:A932: 00        .byte $00
- D - I - - 0x02A943 14:A933: 00        .byte $00
- D - I - - 0x02A944 14:A934: 08        .byte $08   ; <く>
- D - I - - 0x02A945 14:A935: 00        .byte $00
- - - - - - 0x02A946 14:A936: 00        .byte $00

off_A937_A2:
- D - I - - 0x02A947 14:A937: 01        .byte $01   ; <あ>
- D - I - - 0x02A948 14:A938: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A949 14:A939: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02A94A 14:A93A: 04        .byte $04   ; <え>
- D - I - - 0x02A94B 14:A93B: 22        .byte $22   ; <め>
- D - I - - 0x02A94C 14:A93C: 02        .byte $02   ; <い>
- - - - - - 0x02A94D 14:A93D: 00        .byte $00

off_A93E_A3:
- D - I - - 0x02A94E 14:A93E: 03        .byte $03   ; <う>
- D - I - - 0x02A94F 14:A93F: 28        .byte $28   ; <り>
- D - I - - 0x02A950 14:A940: 07        .byte $07   ; <き>
- D - I - - 0x02A951 14:A941: FF        .byte $FF
- D - I - - 0x02A952 14:A942: 06        .byte $06   ; <か>
- D - I - - 0x02A953 14:A943: 00        .byte $00
- D - I - - 0x02A954 14:A944: 00        .byte $00
- D - I - - 0x02A955 14:A945: 00        .byte $00
- D - I - - 0x02A956 14:A946: 0D        .byte $0D   ; <す>
- D - I - - 0x02A957 14:A947: 00        .byte $00
- - - - - - 0x02A958 14:A948: 00        .byte $00

off_A949_A4:
- - - - - - 0x02A959 14:A949: 00        .byte $00

off_A94A_A5:
- D - I - - 0x02A95A 14:A94A: 03        .byte $03   ; <う>
- D - I - - 0x02A95B 14:A94B: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A95C 14:A94C: 55        .byte $55   ; <ナ>
- D - I - - 0x02A95D 14:A94D: 01        .byte $01   ; <あ>
- D - I - - 0x02A95E 14:A94E: 1A        .byte $1A   ; <は>
- D - I - - 0x02A95F 14:A94F: FE        .byte $FE
- D - I - - 0x02A960 14:A950: 00        .byte $00
- D - I - - 0x02A961 14:A951: 00        .byte $00
- D - I - - 0x02A962 14:A952: 1A        .byte $1A   ; <は>
- D - I - - 0x02A963 14:A953: 00        .byte $00
- - - - - - 0x02A964 14:A954: 00        .byte $00

off_A955_A6:
- D - I - - 0x02A965 14:A955: 01        .byte $01   ; <あ>
- D - I - - 0x02A966 14:A956: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A967 14:A957: 40        .byte $40   ; <「>
- D - I - - 0x02A968 14:A958: FE        .byte $FE
- D - I - - 0x02A969 14:A959: 12        .byte $12   ; <つ>
- D - I - - 0x02A96A 14:A95A: FD        .byte $FD
- - - - - - 0x02A96B 14:A95B: 00        .byte $00

off_A95C_A7:
- D - I - - 0x02A96C 14:A95C: 03        .byte $03   ; <う>
- D - I - - 0x02A96D 14:A95D: 32        .byte $32   ; <ょ>
- D - I - - 0x02A96E 14:A95E: D0        .byte $D0   ; <ペ>
- D - I - - 0x02A96F 14:A95F: FF        .byte $FF
- D - I - - 0x02A970 14:A960: 95        .byte $95
- D - I - - 0x02A971 14:A961: FF        .byte $FF
- D - I - - 0x02A972 14:A962: 00        .byte $00
- D - I - - 0x02A973 14:A963: 00        .byte $00
- D - I - - 0x02A974 14:A964: 04        .byte $04   ; <え>
- D - I - - 0x02A975 14:A965: 00        .byte $00
- - - - - - 0x02A976 14:A966: 00        .byte $00

off_A967_A8:
- D - I - - 0x02A977 14:A967: 01        .byte $01   ; <あ>
- D - I - - 0x02A978 14:A968: 3C        .byte $3C   ; <9>
- D - I - - 0x02A979 14:A969: 00        .byte $00
- D - I - - 0x02A97A 14:A96A: FD        .byte $FD
- D - I - - 0x02A97B 14:A96B: 80        .byte $80
- D - I - - 0x02A97C 14:A96C: FE        .byte $FE
- D - I - - 0x02A97D 14:A96D: 00        .byte $00

off_A96E_A9:
- D - I - - 0x02A97E 14:A96E: 03        .byte $03   ; <う>
- D - I - - 0x02A97F 14:A96F: 3C        .byte $3C   ; <9>
- D - I - - 0x02A980 14:A970: 84        .byte $84   ; <D>
- D - I - - 0x02A981 14:A971: 00        .byte $00
- D - I - - 0x02A982 14:A972: 34        .byte $34   ; <1>
- D - I - - 0x02A983 14:A973: FF        .byte $FF
- D - I - - 0x02A984 14:A974: 13        .byte $13   ; <て>
- D - I - - 0x02A985 14:A975: 00        .byte $00
- D - I - - 0x02A986 14:A976: 00        .byte $00
- D - I - - 0x02A987 14:A977: 00        .byte $00
- D - I - - 0x02A988 14:A978: 00        .byte $00

off_A979_AA:
- D - I - - 0x02A989 14:A979: 03        .byte $03   ; <う>
- D - I - - 0x02A98A 14:A97A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A98B 14:A97B: E6        .byte $E6
- D - I - - 0x02A98C 14:A97C: 02        .byte $02   ; <い>
- D - I - - 0x02A98D 14:A97D: 00        .byte $00
- D - I - - 0x02A98E 14:A97E: 00        .byte $00
- D - I - - 0x02A98F 14:A97F: 00        .byte $00
- D - I - - 0x02A990 14:A980: 00        .byte $00
- D - I - - 0x02A991 14:A981: 08        .byte $08   ; <く>
- D - I - - 0x02A992 14:A982: 00        .byte $00
- D - I - - 0x02A993 14:A983: 00        .byte $00

off_A984_AB:
- D - I - - 0x02A994 14:A984: 03        .byte $03   ; <う>
- D - I - - 0x02A995 14:A985: 28        .byte $28   ; <り>
- D - I - - 0x02A996 14:A986: 99        .byte $99
- D - I - - 0x02A997 14:A987: 01        .byte $01   ; <あ>
- D - I - - 0x02A998 14:A988: 60        .byte $60   ; <ミ>
- D - I - - 0x02A999 14:A989: 00        .byte $00
- D - I - - 0x02A99A 14:A98A: 30        .byte $30   ; <ゃ>
- D - I - - 0x02A99B 14:A98B: 00        .byte $00
- D - I - - 0x02A99C 14:A98C: EC        .byte $EC
- D - I - - 0x02A99D 14:A98D: FF        .byte $FF
- D - I - - 0x02A99E 14:A98E: 00        .byte $00

off_A98F_AC:
- D - I - - 0x02A99F 14:A98F: 01        .byte $01   ; <あ>
- D - I - - 0x02A9A0 14:A990: 14        .byte $14   ; <と>
- D - I - - 0x02A9A1 14:A991: D9        .byte $D9
- D - I - - 0x02A9A2 14:A992: 04        .byte $04   ; <え>
- D - I - - 0x02A9A3 14:A993: F3        .byte $F3
- D - I - - 0x02A9A4 14:A994: 05        .byte $05   ; <お>
- D - I - - 0x02A9A5 14:A995: 00        .byte $00

off_A996_AD:
- D - I - - 0x02A9A6 14:A996: 01        .byte $01   ; <あ>
- D - I - - 0x02A9A7 14:A997: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02A9A8 14:A998: 56        .byte $56   ; <ニ>
- D - I - - 0x02A9A9 14:A999: F9        .byte $F9
- D - I - - 0x02A9AA 14:A99A: E0        .byte $E0
- D - I - - 0x02A9AB 14:A99B: FD        .byte $FD
- D - I - - 0x02A9AC 14:A99C: 00        .byte $00

off_A99D_AE:
- D - I - - 0x02A9AD 14:A99D: 03        .byte $03   ; <う>
- D - I - - 0x02A9AE 14:A99E: 32        .byte $32   ; <ょ>
- D - I - - 0x02A9AF 14:A99F: D1        .byte $D1   ; <ポ>
- D - I - - 0x02A9B0 14:A9A0: 00        .byte $00
- D - I - - 0x02A9B1 14:A9A1: 0B        .byte $0B   ; <さ>
- D - I - - 0x02A9B2 14:A9A2: FF        .byte $FF
- D - I - - 0x02A9B3 14:A9A3: 11        .byte $11   ; <ち>
- D - I - - 0x02A9B4 14:A9A4: 00        .byte $00
- D - I - - 0x02A9B5 14:A9A5: 10        .byte $10   ; <た>
- D - I - - 0x02A9B6 14:A9A6: 00        .byte $00
- - - - - - 0x02A9B7 14:A9A7: 00        .byte $00

off_A9A8_AF:
- D - I - - 0x02A9B8 14:A9A8: 03        .byte $03   ; <う>
- D - I - - 0x02A9B9 14:A9A9: 32        .byte $32   ; <ょ>
- D - I - - 0x02A9BA 14:A9AA: 5C        .byte $5C   ; <フ>
- D - I - - 0x02A9BB 14:A9AB: 03        .byte $03   ; <う>
- D - I - - 0x02A9BC 14:A9AC: B4        .byte $B4   ; <ガ>
- D - I - - 0x02A9BD 14:A9AD: FE        .byte $FE
- D - I - - 0x02A9BE 14:A9AE: E8        .byte $E8
- D - I - - 0x02A9BF 14:A9AF: FF        .byte $FF
- D - I - - 0x02A9C0 14:A9B0: 00        .byte $00
- D - I - - 0x02A9C1 14:A9B1: 00        .byte $00
- D - I - - 0x02A9C2 14:A9B2: 00        .byte $00

off_A9B3_B0:
- D - I - - 0x02A9C3 14:A9B3: 03        .byte $03   ; <う>
- D - I - - 0x02A9C4 14:A9B4: 32        .byte $32   ; <ょ>
- D - I - - 0x02A9C5 14:A9B5: FB        .byte $FB
- D - I - - 0x02A9C6 14:A9B6: FF        .byte $FF
- D - I - - 0x02A9C7 14:A9B7: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x02A9C8 14:A9B8: FF        .byte $FF
- D - I - - 0x02A9C9 14:A9B9: 10        .byte $10   ; <た>
- D - I - - 0x02A9CA 14:A9BA: 00        .byte $00
- D - I - - 0x02A9CB 14:A9BB: 00        .byte $00
- D - I - - 0x02A9CC 14:A9BC: 00        .byte $00
- - - - - - 0x02A9CD 14:A9BD: 00        .byte $00

off_A9BE_B1:
- D - I - - 0x02A9CE 14:A9BE: 03        .byte $03   ; <う>
- D - I - - 0x02A9CF 14:A9BF: 28        .byte $28   ; <り>
- D - I - - 0x02A9D0 14:A9C0: 66        .byte $66   ; <ヨ>
- D - I - - 0x02A9D1 14:A9C1: 01        .byte $01   ; <あ>
- D - I - - 0x02A9D2 14:A9C2: 93        .byte $93   ; <Y>
- D - I - - 0x02A9D3 14:A9C3: 02        .byte $02   ; <い>
- D - I - - 0x02A9D4 14:A9C4: 10        .byte $10   ; <た>
- D - I - - 0x02A9D5 14:A9C5: 00        .byte $00
- D - I - - 0x02A9D6 14:A9C6: F8        .byte $F8
- D - I - - 0x02A9D7 14:A9C7: FF        .byte $FF
- D - I - - 0x02A9D8 14:A9C8: 03        .byte $03   ; <う>
- D - I - - 0x02A9D9 14:A9C9: 14        .byte $14   ; <と>
- D - I - - 0x02A9DA 14:A9CA: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02A9DB 14:A9CB: 02        .byte $02   ; <い>
- D - I - - 0x02A9DC 14:A9CC: 00        .byte $00
- D - I - - 0x02A9DD 14:A9CD: 00        .byte $00
- D - I - - 0x02A9DE 14:A9CE: 20        .byte $20   ; <み>
- D - I - - 0x02A9DF 14:A9CF: 00        .byte $00
- D - I - - 0x02A9E0 14:A9D0: A0        .byte $A0   ; <が>
- D - I - - 0x02A9E1 14:A9D1: FF        .byte $FF
- D - I - - 0x02A9E2 14:A9D2: 00        .byte $00

off_A9D3_B2:
- D - I - - 0x02A9E3 14:A9D3: 01        .byte $01   ; <あ>
- D - I - - 0x02A9E4 14:A9D4: 28        .byte $28   ; <り>
- D - I - - 0x02A9E5 14:A9D5: 00        .byte $00
- D - I - - 0x02A9E6 14:A9D6: 00        .byte $00
- D - I - - 0x02A9E7 14:A9D7: 94        .byte $94
- D - I - - 0x02A9E8 14:A9D8: FF        .byte $FF
- D - I - - 0x02A9E9 14:A9D9: 00        .byte $00

off_A9DA_B3:
- D - I - - 0x02A9EA 14:A9DA: 01        .byte $01   ; <あ>
- D - I - - 0x02A9EB 14:A9DB: 28        .byte $28   ; <り>
- D - I - - 0x02A9EC 14:A9DC: 20        .byte $20   ; <み>
- D - I - - 0x02A9ED 14:A9DD: 05        .byte $05   ; <お>
- D - I - - 0x02A9EE 14:A9DE: 60        .byte $60   ; <ミ>
- D - I - - 0x02A9EF 14:A9DF: FD        .byte $FD
- D - I - - 0x02A9F0 14:A9E0: 00        .byte $00

off_A9E1_B4:
- D - I - - 0x02A9F1 14:A9E1: 01        .byte $01   ; <あ>
- D - I - - 0x02A9F2 14:A9E2: 28        .byte $28   ; <り>
- D - I - - 0x02A9F3 14:A9E3: 00        .byte $00
- D - I - - 0x02A9F4 14:A9E4: 01        .byte $01   ; <あ>
- D - I - - 0x02A9F5 14:A9E5: 00        .byte $00
- D - I - - 0x02A9F6 14:A9E6: FA        .byte $FA
- D - I - - 0x02A9F7 14:A9E7: 00        .byte $00

off_A9E8_B5:
- D - I - - 0x02A9F8 14:A9E8: 01        .byte $01   ; <あ>
- D - I - - 0x02A9F9 14:A9E9: 14        .byte $14   ; <と>
- D - I - - 0x02A9FA 14:A9EA: 80        .byte $80
- D - I - - 0x02A9FB 14:A9EB: FB        .byte $FB
- D - I - - 0x02A9FC 14:A9EC: 10        .byte $10   ; <た>
- D - I - - 0x02A9FD 14:A9ED: 06        .byte $06   ; <か>
- D - I - - 0x02A9FE 14:A9EE: 00        .byte $00

off_A9EF_B6:
- D - I - - 0x02A9FF 14:A9EF: 01        .byte $01   ; <あ>
- D - I - - 0x02AA00 14:A9F0: 14        .byte $14   ; <と>
- D - I - - 0x02AA01 14:A9F1: 00        .byte $00
- D - I - - 0x02AA02 14:A9F2: 08        .byte $08   ; <く>
- D - I - - 0x02AA03 14:A9F3: 26        .byte $26   ; <よ>
- D - I - - 0x02AA04 14:A9F4: 01        .byte $01   ; <あ>
- D - I - - 0x02AA05 14:A9F5: 01        .byte $01   ; <あ>
- D - I - - 0x02AA06 14:A9F6: 14        .byte $14   ; <と>
- D - I - - 0x02AA07 14:A9F7: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02AA08 14:A9F8: 00        .byte $00
- D - I - - 0x02AA09 14:A9F9: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02AA0A 14:A9FA: 00        .byte $00
- D - I - - 0x02AA0B 14:A9FB: 00        .byte $00

off_A9FC_B7:
- D - I - - 0x02AA0C 14:A9FC: 03        .byte $03   ; <う>
- D - I - - 0x02AA0D 14:A9FD: 14        .byte $14   ; <と>
- D - I - - 0x02AA0E 14:A9FE: 00        .byte $00
- D - I - - 0x02AA0F 14:A9FF: 00        .byte $00
- D - I - - 0x02AA10 14:AA00: 00        .byte $00
- D - I - - 0x02AA11 14:AA01: F7        .byte $F7
- D - I - - 0x02AA12 14:AA02: 00        .byte $00
- D - I - - 0x02AA13 14:AA03: 00        .byte $00
- D - I - - 0x02AA14 14:AA04: 60        .byte $60   ; <ミ>
- D - I - - 0x02AA15 14:AA05: 00        .byte $00
- D - I - - 0x02AA16 14:AA06: 00        .byte $00

off_AA07_B8:
- - - - - - 0x02AA17 14:AA07: 00        .byte $00

off_AA08_B9:
- D - I - - 0x02AA18 14:AA08: 01        .byte $01   ; <あ>
- D - I - - 0x02AA19 14:AA09: 3C        .byte $3C   ; <9>
- D - I - - 0x02AA1A 14:AA0A: 13        .byte $13   ; <て>
- D - I - - 0x02AA1B 14:AA0B: 02        .byte $02   ; <い>
- D - I - - 0x02AA1C 14:AA0C: AD        .byte $AD   ; <で>
- D - I - - 0x02AA1D 14:AA0D: FF        .byte $FF
- D - I - - 0x02AA1E 14:AA0E: 00        .byte $00

off_AA0F_BA:
- - - - - - 0x02AA1F 14:AA0F: 00        .byte $00

off_AA10_BB:
- D - I - - 0x02AA20 14:AA10: 01        .byte $01   ; <あ>
- D - I - - 0x02AA21 14:AA11: 10        .byte $10   ; <た>
- D - I - - 0x02AA22 14:AA12: 00        .byte $00
- D - I - - 0x02AA23 14:AA13: FD        .byte $FD
- D - I - - 0x02AA24 14:AA14: 10        .byte $10   ; <た>
- D - I - - 0x02AA25 14:AA15: 06        .byte $06   ; <か>
- D - I - - 0x02AA26 14:AA16: 00        .byte $00

off_AA17_BC:
- D - I - - 0x02AA27 14:AA17: 01        .byte $01   ; <あ>
- D - I - - 0x02AA28 14:AA18: 3C        .byte $3C   ; <9>
- D - I - - 0x02AA29 14:AA19: 9D        .byte $9D
- D - I - - 0x02AA2A 14:AA1A: 01        .byte $01   ; <あ>
- D - I - - 0x02AA2B 14:AA1B: 00        .byte $00
- D - I - - 0x02AA2C 14:AA1C: 00        .byte $00
- D - I - - 0x02AA2D 14:AA1D: 00        .byte $00

off_AA1E_BD:
- D - I - - 0x02AA2E 14:AA1E: 01        .byte $01   ; <あ>
- D - I - - 0x02AA2F 14:AA1F: 28        .byte $28   ; <り>
- D - I - - 0x02AA30 14:AA20: 00        .byte $00
- D - I - - 0x02AA31 14:AA21: 00        .byte $00
- D - I - - 0x02AA32 14:AA22: FA        .byte $FA
- D - I - - 0x02AA33 14:AA23: FE        .byte $FE
- - - - - - 0x02AA34 14:AA24: 00        .byte $00

off_AA25_BE:
- D - I - - 0x02AA35 14:AA25: 01        .byte $01   ; <あ>
- D - I - - 0x02AA36 14:AA26: 28        .byte $28   ; <り>
- D - I - - 0x02AA37 14:AA27: 9A        .byte $9A
- D - I - - 0x02AA38 14:AA28: FF        .byte $FF
- D - I - - 0x02AA39 14:AA29: 39        .byte $39   ; <6>
- D - I - - 0x02AA3A 14:AA2A: 00        .byte $00
- D - I - - 0x02AA3B 14:AA2B: 00        .byte $00

off_AA2C_BF:
- D - I - - 0x02AA3C 14:AA2C: 03        .byte $03   ; <う>
- D - I - - 0x02AA3D 14:AA2D: 28        .byte $28   ; <り>
- D - I - - 0x02AA3E 14:AA2E: 99        .byte $99
- D - I - - 0x02AA3F 14:AA2F: 01        .byte $01   ; <あ>
- D - I - - 0x02AA40 14:AA30: 00        .byte $00
- D - I - - 0x02AA41 14:AA31: 01        .byte $01   ; <あ>
- D - I - - 0x02AA42 14:AA32: 20        .byte $20   ; <み>
- D - I - - 0x02AA43 14:AA33: 00        .byte $00
- D - I - - 0x02AA44 14:AA34: FE        .byte $FE
- D - I - - 0x02AA45 14:AA35: FF        .byte $FF
- D - I - - 0x02AA46 14:AA36: 00        .byte $00

off_AA37_C0:
- D - I - - 0x02AA47 14:AA37: 01        .byte $01   ; <あ>
- D - I - - 0x02AA48 14:AA38: 32        .byte $32   ; <ょ>
- D - I - - 0x02AA49 14:AA39: CE        .byte $CE   ; <ピ>
- D - I - - 0x02AA4A 14:AA3A: FF        .byte $FF
- D - I - - 0x02AA4B 14:AA3B: 32        .byte $32   ; <ょ>
- D - I - - 0x02AA4C 14:AA3C: 00        .byte $00
- D - I - - 0x02AA4D 14:AA3D: 00        .byte $00

off_AA3E_C1:
- D - I - - 0x02AA4E 14:AA3E: 03        .byte $03   ; <う>
- D - I - - 0x02AA4F 14:AA3F: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AA50 14:AA40: 00        .byte $00
- D - I - - 0x02AA51 14:AA41: FE        .byte $FE
- D - I - - 0x02AA52 14:AA42: 00        .byte $00
- D - I - - 0x02AA53 14:AA43: 02        .byte $02   ; <い>
- D - I - - 0x02AA54 14:AA44: 18        .byte $18   ; <ね>
- D - I - - 0x02AA55 14:AA45: 00        .byte $00
- D - I - - 0x02AA56 14:AA46: E8        .byte $E8
- D - I - - 0x02AA57 14:AA47: FF        .byte $FF
- D - I - - 0x02AA58 14:AA48: 01        .byte $01   ; <あ>
- D - I - - 0x02AA59 14:AA49: 32        .byte $32   ; <ょ>
- D - I - - 0x02AA5A 14:AA4A: 30        .byte $30   ; <ゃ>
- D - I - - 0x02AA5B 14:AA4B: 00        .byte $00
- D - I - - 0x02AA5C 14:AA4C: D0        .byte $D0   ; <ペ>
- D - I - - 0x02AA5D 14:AA4D: FF        .byte $FF
- D - I - - 0x02AA5E 14:AA4E: 00        .byte $00

off_AA4F_C2:
- D - I - - 0x02AA5F 14:AA4F: 01        .byte $01   ; <あ>
- D - I - - 0x02AA60 14:AA50: 64        .byte $64   ; <ヤ>
- D - I - - 0x02AA61 14:AA51: 00        .byte $00
- D - I - - 0x02AA62 14:AA52: 00        .byte $00
- D - I - - 0x02AA63 14:AA53: F3        .byte $F3
- D - I - - 0x02AA64 14:AA54: 00        .byte $00
- - - - - - 0x02AA65 14:AA55: 00        .byte $00

off_AA56_C3:
- D - I - - 0x02AA66 14:AA56: 01        .byte $01   ; <あ>
- D - I - - 0x02AA67 14:AA57: 3C        .byte $3C   ; <9>
- D - I - - 0x02AA68 14:AA58: 00        .byte $00
- D - I - - 0x02AA69 14:AA59: 00        .byte $00
- D - I - - 0x02AA6A 14:AA5A: 6B        .byte $6B   ; <ロ>
- D - I - - 0x02AA6B 14:AA5B: FE        .byte $FE
- - - - - - 0x02AA6C 14:AA5C: 00        .byte $00

off_AA5D_C4:
- D - I - - 0x02AA6D 14:AA5D: 01        .byte $01   ; <あ>
- D - I - - 0x02AA6E 14:AA5E: 28        .byte $28   ; <り>
- D - I - - 0x02AA6F 14:AA5F: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02AA70 14:AA60: FB        .byte $FB
- D - I - - 0x02AA71 14:AA61: 00        .byte $00
- D - I - - 0x02AA72 14:AA62: 00        .byte $00
- - - - - - 0x02AA73 14:AA63: 00        .byte $00

off_AA64_C5:
- D - I - - 0x02AA74 14:AA64: 01        .byte $01   ; <あ>
- D - I - - 0x02AA75 14:AA65: 28        .byte $28   ; <り>
- D - I - - 0x02AA76 14:AA66: 60        .byte $60   ; <ミ>
- D - I - - 0x02AA77 14:AA67: 00        .byte $00
- D - I - - 0x02AA78 14:AA68: 33        .byte $33   ; <0>
- D - I - - 0x02AA79 14:AA69: 00        .byte $00
- - - - - - 0x02AA7A 14:AA6A: 00        .byte $00

off_AA6B_C6:
- D - I - - 0x02AA7B 14:AA6B: 01        .byte $01   ; <あ>
- D - I - - 0x02AA7C 14:AA6C: 14        .byte $14   ; <と>
- D - I - - 0x02AA7D 14:AA6D: E0        .byte $E0
- D - I - - 0x02AA7E 14:AA6E: FE        .byte $FE
- D - I - - 0x02AA7F 14:AA6F: A0        .byte $A0   ; <が>
- D - I - - 0x02AA80 14:AA70: F8        .byte $F8
- D - I - - 0x02AA81 14:AA71: 00        .byte $00

off_AA72_C7:
- D - I - - 0x02AA82 14:AA72: 01        .byte $01   ; <あ>
- D - I - - 0x02AA83 14:AA73: 32        .byte $32   ; <ょ>
- D - I - - 0x02AA84 14:AA74: 00        .byte $00
- D - I - - 0x02AA85 14:AA75: 00        .byte $00
- D - I - - 0x02AA86 14:AA76: D8        .byte $D8
- D - I - - 0x02AA87 14:AA77: FE        .byte $FE
- D - I - - 0x02AA88 14:AA78: 00        .byte $00

off_AA79_C8:
- D - I - - 0x02AA89 14:AA79: 03        .byte $03   ; <う>
- D - I - - 0x02AA8A 14:AA7A: 3C        .byte $3C   ; <9>
- D - I - - 0x02AA8B 14:AA7B: 52        .byte $52   ; <ツ>
- D - I - - 0x02AA8C 14:AA7C: FD        .byte $FD
- D - I - - 0x02AA8D 14:AA7D: 67        .byte $67   ; <ラ>
- D - I - - 0x02AA8E 14:AA7E: FC        .byte $FC
- D - I - - 0x02AA8F 14:AA7F: 00        .byte $00
- D - I - - 0x02AA90 14:AA80: 00        .byte $00
- D - I - - 0x02AA91 14:AA81: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AA92 14:AA82: 00        .byte $00
- D - I - - 0x02AA93 14:AA83: 00        .byte $00

off_AA84_C9:
- D - I - - 0x02AA94 14:AA84: 01        .byte $01   ; <あ>
- D - I - - 0x02AA95 14:AA85: 18        .byte $18   ; <ね>
- D - I - - 0x02AA96 14:AA86: B5        .byte $B5   ; <ギ>
- D - I - - 0x02AA97 14:AA87: 02        .byte $02   ; <い>
- D - I - - 0x02AA98 14:AA88: 00        .byte $00
- D - I - - 0x02AA99 14:AA89: 00        .byte $00
- D - I - - 0x02AA9A 14:AA8A: 00        .byte $00

off_AA8B_CA:
- D - I - - 0x02AA9B 14:AA8B: 01        .byte $01   ; <あ>
- D - I - - 0x02AA9C 14:AA8C: 18        .byte $18   ; <ね>
- D - I - - 0x02AA9D 14:AA8D: 4B        .byte $4B   ; <サ>
- D - I - - 0x02AA9E 14:AA8E: FD        .byte $FD
- D - I - - 0x02AA9F 14:AA8F: 00        .byte $00
- D - I - - 0x02AAA0 14:AA90: 00        .byte $00
- D - I - - 0x02AAA1 14:AA91: 00        .byte $00

off_AA92_CB:
- D - I - - 0x02AAA2 14:AA92: 03        .byte $03   ; <う>
- D - I - - 0x02AAA3 14:AA93: 3C        .byte $3C   ; <9>
- D - I - - 0x02AAA4 14:AA94: CC        .byte $CC   ; <ぽ>
- D - I - - 0x02AAA5 14:AA95: 02        .byte $02   ; <い>
- D - I - - 0x02AAA6 14:AA96: 00        .byte $00
- D - I - - 0x02AAA7 14:AA97: 00        .byte $00
- D - I - - 0x02AAA8 14:AA98: F3        .byte $F3
- D - I - - 0x02AAA9 14:AA99: FF        .byte $FF
- D - I - - 0x02AAAA 14:AA9A: 00        .byte $00
- D - I - - 0x02AAAB 14:AA9B: 00        .byte $00
- D - I - - 0x02AAAC 14:AA9C: 00        .byte $00

off_AA9D_CC:
- D - I - - 0x02AAAD 14:AA9D: 01        .byte $01   ; <あ>
- D - I - - 0x02AAAE 14:AA9E: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AAAF 14:AA9F: 00        .byte $00
- D - I - - 0x02AAB0 14:AAA0: F8        .byte $F8
- D - I - - 0x02AAB1 14:AAA1: 00        .byte $00
- D - I - - 0x02AAB2 14:AAA2: 00        .byte $00
- D - I - - 0x02AAB3 14:AAA3: 00        .byte $00

off_AAA4_CD:
- - - - - - 0x02AAB4 14:AAA4: 01        .byte $01   ; <あ>
- - - - - - 0x02AAB5 14:AAA5: 1E        .byte $1E   ; <ほ>
- - - - - - 0x02AAB6 14:AAA6: 80        .byte $80
- - - - - - 0x02AAB7 14:AAA7: 08        .byte $08   ; <く>
- - - - - - 0x02AAB8 14:AAA8: 00        .byte $00
- - - - - - 0x02AAB9 14:AAA9: 00        .byte $00
- - - - - - 0x02AABA 14:AAAA: 00        .byte $00

off_AAAB_CE:
- D - I - - 0x02AABB 14:AAAB: 03        .byte $03   ; <う>
- D - I - - 0x02AABC 14:AAAC: 28        .byte $28   ; <り>
- D - I - - 0x02AABD 14:AAAD: 00        .byte $00
- D - I - - 0x02AABE 14:AAAE: 08        .byte $08   ; <く>
- D - I - - 0x02AABF 14:AAAF: 00        .byte $00
- D - I - - 0x02AAC0 14:AAB0: 00        .byte $00
- D - I - - 0x02AAC1 14:AAB1: 00        .byte $00
- D - I - - 0x02AAC2 14:AAB2: 00        .byte $00
- D - I - - 0x02AAC3 14:AAB3: E8        .byte $E8
- D - I - - 0x02AAC4 14:AAB4: FF        .byte $FF
- - - - - - 0x02AAC5 14:AAB5: 00        .byte $00

off_AAB6_CF:
- D - I - - 0x02AAC6 14:AAB6: 01        .byte $01   ; <あ>
- D - I - - 0x02AAC7 14:AAB7: 14        .byte $14   ; <と>
- D - I - - 0x02AAC8 14:AAB8: 00        .byte $00
- D - I - - 0x02AAC9 14:AAB9: 00        .byte $00
- D - I - - 0x02AACA 14:AABA: 00        .byte $00
- D - I - - 0x02AACB 14:AABB: 00        .byte $00
off_AABC:
- D - I - - 0x02AACC 14:AABC: 01        .byte $01   ; <あ>
- D - I - - 0x02AACD 14:AABD: 01        .byte $01   ; <あ>
- D - I - - 0x02AACE 14:AABE: 00        .byte $00
- D - I - - 0x02AACF 14:AABF: 16        .byte $16   ; <に>
- D - I - - 0x02AAD0 14:AAC0: 00        .byte $00
- D - I - - 0x02AAD1 14:AAC1: 00        .byte $00
- D - I - - 0x02AAD2 14:AAC2: 01        .byte $01   ; <あ>
- D - I - - 0x02AAD3 14:AAC3: 01        .byte $01   ; <あ>
- D - I - - 0x02AAD4 14:AAC4: 00        .byte $00
- D - I - - 0x02AAD5 14:AAC5: CE        .byte $CE   ; <ピ>
- D - I - - 0x02AAD6 14:AAC6: 00        .byte $00
- D - I - - 0x02AAD7 14:AAC7: 00        .byte $00
- D - I - - 0x02AAD8 14:AAC8: 01        .byte $01   ; <あ>
- D - I - - 0x02AAD9 14:AAC9: 01        .byte $01   ; <あ>
- D - I - - 0x02AADA 14:AACA: 00        .byte $00
- D - I - - 0x02AADB 14:AACB: 48        .byte $48   ; <ク>
- D - I - - 0x02AADC 14:AACC: 00        .byte $00
- D - I - - 0x02AADD 14:AACD: 00        .byte $00
- D - I - - 0x02AADE 14:AACE: 01        .byte $01   ; <あ>
- D - I - - 0x02AADF 14:AACF: 01        .byte $01   ; <あ>
- D - I - - 0x02AAE0 14:AAD0: 00        .byte $00
- D - I - - 0x02AAE1 14:AAD1: 9C        .byte $9C
- D - I - - 0x02AAE2 14:AAD2: 00        .byte $00
- D - I - - 0x02AAE3 14:AAD3: 00        .byte $00
off_AAD4:
- D - I - - 0x02AAE4 14:AAD4: 01        .byte $01   ; <あ>
- D - I - - 0x02AAE5 14:AAD5: 01        .byte $01   ; <あ>
- D - I - - 0x02AAE6 14:AAD6: 00        .byte $00
- D - I - - 0x02AAE7 14:AAD7: 55        .byte $55   ; <ナ>
- D - I - - 0x02AAE8 14:AAD8: 00        .byte $00
- D - I - - 0x02AAE9 14:AAD9: 00        .byte $00
- D - I - - 0x02AAEA 14:AADA: 04        .byte $04   ; <え>
- D - I - - 0x02AAEB 14:AADB: D4 AA     .word off_AAD4

off_AADD_D0:
- D - I - - 0x02AAED 14:AADD: 01        .byte $01   ; <あ>
- D - I - - 0x02AAEE 14:AADE: 28        .byte $28   ; <り>
- D - I - - 0x02AAEF 14:AADF: CD        .byte $CD   ; <パ>
- D - I - - 0x02AAF0 14:AAE0: FF        .byte $FF
- D - I - - 0x02AAF1 14:AAE1: C7        .byte $C7   ; <ボ>
- D - I - - 0x02AAF2 14:AAE2: FF        .byte $FF
- D - I - - 0x02AAF3 14:AAE3: 00        .byte $00

off_AAE4_D1:
- D - I - - 0x02AAF4 14:AAE4: 01        .byte $01   ; <あ>
- D - I - - 0x02AAF5 14:AAE5: 28        .byte $28   ; <り>
- D - I - - 0x02AAF6 14:AAE6: 00        .byte $00
- D - I - - 0x02AAF7 14:AAE7: 00        .byte $00
- D - I - - 0x02AAF8 14:AAE8: D4        .byte $D4
- D - I - - 0x02AAF9 14:AAE9: FE        .byte $FE
- D - I - - 0x02AAFA 14:AAEA: 00        .byte $00

off_AAEB_D2:
- D - I - - 0x02AAFB 14:AAEB: 01        .byte $01   ; <あ>
- D - I - - 0x02AAFC 14:AAEC: 28        .byte $28   ; <り>
- D - I - - 0x02AAFD 14:AAED: CD        .byte $CD   ; <パ>
- D - I - - 0x02AAFE 14:AAEE: FF        .byte $FF
- D - I - - 0x02AAFF 14:AAEF: FA        .byte $FA
- D - I - - 0x02AB00 14:AAF0: FE        .byte $FE
- D - I - - 0x02AB01 14:AAF1: 00        .byte $00

off_AAF2_D3:
- D - I - - 0x02AB02 14:AAF2: 01        .byte $01   ; <あ>
- D - I - - 0x02AB03 14:AAF3: 28        .byte $28   ; <り>
- D - I - - 0x02AB04 14:AAF4: 94        .byte $94
- D - I - - 0x02AB05 14:AAF5: FD        .byte $FD
- D - I - - 0x02AB06 14:AAF6: 20        .byte $20   ; <み>
- D - I - - 0x02AB07 14:AAF7: 00        .byte $00
- D - I - - 0x02AB08 14:AAF8: 00        .byte $00

off_AAF9_D4:
- D - I - - 0x02AB09 14:AAF9: 01        .byte $01   ; <あ>
- D - I - - 0x02AB0A 14:AAFA: 28        .byte $28   ; <り>
- D - I - - 0x02AB0B 14:AAFB: 33        .byte $33   ; <0>
- D - I - - 0x02AB0C 14:AAFC: 02        .byte $02   ; <い>
- D - I - - 0x02AB0D 14:AAFD: C7        .byte $C7   ; <ボ>
- D - I - - 0x02AB0E 14:AAFE: FF        .byte $FF
- - - - - - 0x02AB0F 14:AAFF: 00        .byte $00

off_AB00_D5:
off_AB00:
- D - I - - 0x02AB10 14:AB00: 01        .byte $01   ; <あ>
- D - I - - 0x02AB11 14:AB01: EF        .byte $EF
- D - I - - 0x02AB12 14:AB02: 1D        .byte $1D   ; <へ>
- D - I - - 0x02AB13 14:AB03: 00        .byte $00
- D - I - - 0x02AB14 14:AB04: 00        .byte $00
- D - I - - 0x02AB15 14:AB05: 00        .byte $00
- D - I - - 0x02AB16 14:AB06: 04        .byte $04   ; <え>
- D - I - - 0x02AB17 14:AB07: 00 AB     .word off_AB00

off_AB09_D6:
- D - I - - 0x02AB19 14:AB09: 01        .byte $01   ; <あ>
- D - I - - 0x02AB1A 14:AB0A: 28        .byte $28   ; <り>
- D - I - - 0x02AB1B 14:AB0B: 00        .byte $00
- D - I - - 0x02AB1C 14:AB0C: 00        .byte $00
- D - I - - 0x02AB1D 14:AB0D: 80        .byte $80
- D - I - - 0x02AB1E 14:AB0E: FD        .byte $FD
- - - - - - 0x02AB1F 14:AB0F: 00        .byte $00

off_AB10_D7:
- D - I - - 0x02AB20 14:AB10: 01        .byte $01   ; <あ>
- D - I - - 0x02AB21 14:AB11: 08        .byte $08   ; <く>
- D - I - - 0x02AB22 14:AB12: 00        .byte $00
- D - I - - 0x02AB23 14:AB13: 00        .byte $00
- D - I - - 0x02AB24 14:AB14: 00        .byte $00
- D - I - - 0x02AB25 14:AB15: 00        .byte $00
- D - I - - 0x02AB26 14:AB16: 01        .byte $01   ; <あ>
- D - I - - 0x02AB27 14:AB17: 28        .byte $28   ; <り>
- D - I - - 0x02AB28 14:AB18: 9A        .byte $9A
- D - I - - 0x02AB29 14:AB19: FF        .byte $FF
- D - I - - 0x02AB2A 14:AB1A: CD        .byte $CD   ; <パ>
- D - I - - 0x02AB2B 14:AB1B: FA        .byte $FA
- - - - - - 0x02AB2C 14:AB1C: 00        .byte $00

off_AB1D_D8:
- D - I - - 0x02AB2D 14:AB1D: 01        .byte $01   ; <あ>
- D - I - - 0x02AB2E 14:AB1E: 28        .byte $28   ; <り>
- D - I - - 0x02AB2F 14:AB1F: 47        .byte $47   ; <キ>
- D - I - - 0x02AB30 14:AB20: FF        .byte $FF
- D - I - - 0x02AB31 14:AB21: 66        .byte $66   ; <ヨ>
- D - I - - 0x02AB32 14:AB22: 04        .byte $04   ; <え>
- - - - - - 0x02AB33 14:AB23: 00        .byte $00

off_AB24_D9:
- D - I - - 0x02AB34 14:AB24: 03        .byte $03   ; <う>
- D - I - - 0x02AB35 14:AB25: 3C        .byte $3C   ; <9>
- D - I - - 0x02AB36 14:AB26: 22        .byte $22   ; <め>
- D - I - - 0x02AB37 14:AB27: 02        .byte $02   ; <い>
- D - I - - 0x02AB38 14:AB28: 84        .byte $84   ; <D>
- D - I - - 0x02AB39 14:AB29: 00        .byte $00
- D - I - - 0x02AB3A 14:AB2A: E0        .byte $E0
- D - I - - 0x02AB3B 14:AB2B: FF        .byte $FF
- D - I - - 0x02AB3C 14:AB2C: 00        .byte $00
- D - I - - 0x02AB3D 14:AB2D: 00        .byte $00
- - - - - - 0x02AB3E 14:AB2E: 00        .byte $00

off_AB2F_DA:
- D - I - - 0x02AB3F 14:AB2F: 01        .byte $01   ; <あ>
- D - I - - 0x02AB40 14:AB30: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB41 14:AB31: 34        .byte $34   ; <1>
- D - I - - 0x02AB42 14:AB32: FF        .byte $FF
- D - I - - 0x02AB43 14:AB33: 4C        .byte $4C   ; <シ>
- D - I - - 0x02AB44 14:AB34: 00        .byte $00
- - - - - - 0x02AB45 14:AB35: 00        .byte $00

off_AB36_DB:
- D - I - - 0x02AB46 14:AB36: 01        .byte $01   ; <あ>
- D - I - - 0x02AB47 14:AB37: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB48 14:AB38: DA        .byte $DA
- D - I - - 0x02AB49 14:AB39: FF        .byte $FF
- D - I - - 0x02AB4A 14:AB3A: 00        .byte $00
- D - I - - 0x02AB4B 14:AB3B: 00        .byte $00
- D - I - - 0x02AB4C 14:AB3C: 00        .byte $00

off_AB3D_DC:
- D - I - - 0x02AB4D 14:AB3D: 01        .byte $01   ; <あ>
- D - I - - 0x02AB4E 14:AB3E: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB4F 14:AB3F: D6        .byte $D6
- D - I - - 0x02AB50 14:AB40: FD        .byte $FD
- D - I - - 0x02AB51 14:AB41: 88        .byte $88   ; <H>
- D - I - - 0x02AB52 14:AB42: 00        .byte $00
- - - - - - 0x02AB53 14:AB43: 00        .byte $00

off_AB44_DD:
- D - I - - 0x02AB54 14:AB44: 01        .byte $01   ; <あ>
- D - I - - 0x02AB55 14:AB45: 16        .byte $16   ; <に>
- D - I - - 0x02AB56 14:AB46: F5        .byte $F5
- D - I - - 0x02AB57 14:AB47: FB        .byte $FB
- D - I - - 0x02AB58 14:AB48: 00        .byte $00
- D - I - - 0x02AB59 14:AB49: 00        .byte $00
- D - I - - 0x02AB5A 14:AB4A: 00        .byte $00

off_AB4B_DE:
- D - I - - 0x02AB5B 14:AB4B: 01        .byte $01   ; <あ>
- D - I - - 0x02AB5C 14:AB4C: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB5D 14:AB4D: 20        .byte $20   ; <み>
- D - I - - 0x02AB5E 14:AB4E: FD        .byte $FD
- D - I - - 0x02AB5F 14:AB4F: 24        .byte $24   ; <や>
- D - I - - 0x02AB60 14:AB50: FB        .byte $FB
- D - I - - 0x02AB61 14:AB51: 00        .byte $00

off_AB52_DF:
- D - I - - 0x02AB62 14:AB52: 01        .byte $01   ; <あ>
- D - I - - 0x02AB63 14:AB53: 0A        .byte $0A   ; <こ>
- D - I - - 0x02AB64 14:AB54: 00        .byte $00
- D - I - - 0x02AB65 14:AB55: 00        .byte $00
- D - I - - 0x02AB66 14:AB56: 40        .byte $40   ; <「>
- D - I - - 0x02AB67 14:AB57: 06        .byte $06   ; <か>
- - - - - - 0x02AB68 14:AB58: 00        .byte $00

off_AB59_E0:
- D - I - - 0x02AB69 14:AB59: 01        .byte $01   ; <あ>
- D - I - - 0x02AB6A 14:AB5A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB6B 14:AB5B: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02AB6C 14:AB5C: F5        .byte $F5
- D - I - - 0x02AB6D 14:AB5D: 00        .byte $00
- D - I - - 0x02AB6E 14:AB5E: 00        .byte $00
- D - I - - 0x02AB6F 14:AB5F: 00        .byte $00

off_AB60_E1:
- D - I - - 0x02AB70 14:AB60: 01        .byte $01   ; <あ>
- D - I - - 0x02AB71 14:AB61: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AB72 14:AB62: 40        .byte $40   ; <「>
- D - I - - 0x02AB73 14:AB63: 0A        .byte $0A   ; <こ>
- D - I - - 0x02AB74 14:AB64: 00        .byte $00
- D - I - - 0x02AB75 14:AB65: 00        .byte $00
- D - I - - 0x02AB76 14:AB66: 00        .byte $00

off_AB67_E2:
- - - - - - 0x02AB77 14:AB67: 00        .byte $00

off_AB68_E3:
- - - - - - 0x02AB78 14:AB68: 01        .byte $01   ; <あ>
- - - - - - 0x02AB79 14:AB69: 3C        .byte $3C   ; <9>
- - - - - - 0x02AB7A 14:AB6A: 53        .byte $53   ; <テ>
- - - - - - 0x02AB7B 14:AB6B: 04        .byte $04   ; <え>
- - - - - - 0x02AB7C 14:AB6C: FA        .byte $FA
- - - - - - 0x02AB7D 14:AB6D: FE        .byte $FE
- - - - - - 0x02AB7E 14:AB6E: 00        .byte $00

off_AB6F_E4:
- D - I - - 0x02AB7F 14:AB6F: 01        .byte $01   ; <あ>
- D - I - - 0x02AB80 14:AB70: 27        .byte $27   ; <ら>
- D - I - - 0x02AB81 14:AB71: 2E        .byte $2E   ; <ん>
- D - I - - 0x02AB82 14:AB72: FF        .byte $FF
- D - I - - 0x02AB83 14:AB73: 3B        .byte $3B   ; <8>
- D - I - - 0x02AB84 14:AB74: 00        .byte $00
- D - I - - 0x02AB85 14:AB75: 00        .byte $00

off_AB76_E5:
- D - I - - 0x02AB86 14:AB76: 02        .byte $02   ; <い>
- D - I - - 0x02AB87 14:AB77: 96        .byte $96
- D - I - - 0x02AB88 14:AB78: FE        .byte $FE
- D - I - - 0x02AB89 14:AB79: FF        .byte $FF
- D - I - - 0x02AB8A 14:AB7A: 00        .byte $00
- D - I - - 0x02AB8B 14:AB7B: 00        .byte $00
- - - - - - 0x02AB8C 14:AB7C: 00        .byte $00

off_AB7D_E6:
- D - I - - 0x02AB8D 14:AB7D: 02        .byte $02   ; <い>
- D - I - - 0x02AB8E 14:AB7E: 96        .byte $96
- D - I - - 0x02AB8F 14:AB7F: 02        .byte $02   ; <い>
- D - I - - 0x02AB90 14:AB80: 00        .byte $00
- D - I - - 0x02AB91 14:AB81: 00        .byte $00
- D - I - - 0x02AB92 14:AB82: 00        .byte $00
- - - - - - 0x02AB93 14:AB83: 00        .byte $00

off_AB84_E7:
- D - I - - 0x02AB94 14:AB84: 01        .byte $01   ; <あ>
- D - I - - 0x02AB95 14:AB85: 28        .byte $28   ; <り>
- D - I - - 0x02AB96 14:AB86: 00        .byte $00
- D - I - - 0x02AB97 14:AB87: 06        .byte $06   ; <か>
- D - I - - 0x02AB98 14:AB88: 00        .byte $00
- D - I - - 0x02AB99 14:AB89: FE        .byte $FE
- - - - - - 0x02AB9A 14:AB8A: 00        .byte $00

off_AB8B_E8:
- D - I - - 0x02AB9B 14:AB8B: 03        .byte $03   ; <う>
- D - I - - 0x02AB9C 14:AB8C: 03        .byte $03   ; <う>
- D - I - - 0x02AB9D 14:AB8D: 00        .byte $00
- D - I - - 0x02AB9E 14:AB8E: 00        .byte $00
- D - I - - 0x02AB9F 14:AB8F: 00        .byte $00
- D - I - - 0x02ABA0 14:AB90: FD        .byte $FD
- D - I - - 0x02ABA1 14:AB91: 40        .byte $40   ; <「>
- D - I - - 0x02ABA2 14:AB92: 00        .byte $00
- D - I - - 0x02ABA3 14:AB93: 00        .byte $00
- D - I - - 0x02ABA4 14:AB94: 01        .byte $01   ; <あ>
- D - I - - 0x02ABA5 14:AB95: 03        .byte $03   ; <う>
- D - I - - 0x02ABA6 14:AB96: 03        .byte $03   ; <う>
- D - I - - 0x02ABA7 14:AB97: 00        .byte $00
- D - I - - 0x02ABA8 14:AB98: 03        .byte $03   ; <う>
- D - I - - 0x02ABA9 14:AB99: 00        .byte $00
- D - I - - 0x02ABAA 14:AB9A: 00        .byte $00
- D - I - - 0x02ABAB 14:AB9B: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02ABAC 14:AB9C: FE        .byte $FE
- D - I - - 0x02ABAD 14:AB9D: 80        .byte $80
- D - I - - 0x02ABAE 14:AB9E: 00        .byte $00
- D - I - - 0x02ABAF 14:AB9F: 03        .byte $03   ; <う>
- D - I - - 0x02ABB0 14:ABA0: 03        .byte $03   ; <う>
- D - I - - 0x02ABB1 14:ABA1: 00        .byte $00
- D - I - - 0x02ABB2 14:ABA2: 00        .byte $00
- D - I - - 0x02ABB3 14:ABA3: 00        .byte $00
- D - I - - 0x02ABB4 14:ABA4: 03        .byte $03   ; <う>
- D - I - - 0x02ABB5 14:ABA5: 40        .byte $40   ; <「>
- D - I - - 0x02ABB6 14:ABA6: FF        .byte $FF
- D - I - - 0x02ABB7 14:ABA7: 00        .byte $00
- D - I - - 0x02ABB8 14:ABA8: FF        .byte $FF
- D - I - - 0x02ABB9 14:ABA9: 03        .byte $03   ; <う>
- D - I - - 0x02ABBA 14:ABAA: 03        .byte $03   ; <う>
- D - I - - 0x02ABBB 14:ABAB: 00        .byte $00
- D - I - - 0x02ABBC 14:ABAC: FD        .byte $FD
- D - I - - 0x02ABBD 14:ABAD: 00        .byte $00
- D - I - - 0x02ABBE 14:ABAE: 00        .byte $00
- D - I - - 0x02ABBF 14:ABAF: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02ABC0 14:ABB0: 00        .byte $00
- D - I - - 0x02ABC1 14:ABB1: 80        .byte $80
- D - I - - 0x02ABC2 14:ABB2: FF        .byte $FF
- D - I - - 0x02ABC3 14:ABB3: 03        .byte $03   ; <う>
- D - I - - 0x02ABC4 14:ABB4: 03        .byte $03   ; <う>
- D - I - - 0x02ABC5 14:ABB5: 00        .byte $00
- D - I - - 0x02ABC6 14:ABB6: 00        .byte $00
- D - I - - 0x02ABC7 14:ABB7: 00        .byte $00
- D - I - - 0x02ABC8 14:ABB8: FB        .byte $FB
- D - I - - 0x02ABC9 14:ABB9: F4        .byte $F4
- D - I - - 0x02ABCA 14:ABBA: 00        .byte $00
- D - I - - 0x02ABCB 14:ABBB: F0        .byte $F0
- D - I - - 0x02ABCC 14:ABBC: 00        .byte $00
- D - I - - 0x02ABCD 14:ABBD: 03        .byte $03   ; <う>
- D - I - - 0x02ABCE 14:ABBE: 03        .byte $03   ; <う>
- D - I - - 0x02ABCF 14:ABBF: 00        .byte $00
- D - I - - 0x02ABD0 14:ABC0: 05        .byte $05   ; <お>
- D - I - - 0x02ABD1 14:ABC1: 00        .byte $00
- D - I - - 0x02ABD2 14:ABC2: 00        .byte $00
- D - I - - 0x02ABD3 14:ABC3: D4        .byte $D4
- D - I - - 0x02ABD4 14:ABC4: FE        .byte $FE
- D - I - - 0x02ABD5 14:ABC5: 30        .byte $30   ; <ゃ>
- D - I - - 0x02ABD6 14:ABC6: 01        .byte $01   ; <あ>
- D - I - - 0x02ABD7 14:ABC7: 03        .byte $03   ; <う>
- D - I - - 0x02ABD8 14:ABC8: 03        .byte $03   ; <う>
- D - I - - 0x02ABD9 14:ABC9: 00        .byte $00
- D - I - - 0x02ABDA 14:ABCA: 00        .byte $00
- D - I - - 0x02ABDB 14:ABCB: 00        .byte $00
- D - I - - 0x02ABDC 14:ABCC: 05        .byte $05   ; <お>
- D - I - - 0x02ABDD 14:ABCD: 94        .byte $94
- D - I - - 0x02ABDE 14:ABCE: FE        .byte $FE
- D - I - - 0x02ABDF 14:ABCF: 10        .byte $10   ; <た>
- D - I - - 0x02ABE0 14:ABD0: FF        .byte $FF
- D - I - - 0x02ABE1 14:ABD1: 03        .byte $03   ; <う>
- D - I - - 0x02ABE2 14:ABD2: 03        .byte $03   ; <う>
- D - I - - 0x02ABE3 14:ABD3: 00        .byte $00
- D - I - - 0x02ABE4 14:ABD4: FB        .byte $FB
- D - I - - 0x02ABE5 14:ABD5: 00        .byte $00
- D - I - - 0x02ABE6 14:ABD6: 00        .byte $00
- D - I - - 0x02ABE7 14:ABD7: 64        .byte $64   ; <ヤ>
- D - I - - 0x02ABE8 14:ABD8: 00        .byte $00
- D - I - - 0x02ABE9 14:ABD9: D0        .byte $D0   ; <ペ>
- D - I - - 0x02ABEA 14:ABDA: FE        .byte $FE
- D - I - - 0x02ABEB 14:ABDB: 03        .byte $03   ; <う>
- D - I - - 0x02ABEC 14:ABDC: 03        .byte $03   ; <う>
- D - I - - 0x02ABED 14:ABDD: 00        .byte $00
- D - I - - 0x02ABEE 14:ABDE: 00        .byte $00
- D - I - - 0x02ABEF 14:ABDF: 00        .byte $00
- D - I - - 0x02ABF0 14:ABE0: F5        .byte $F5
- D - I - - 0x02ABF1 14:ABE1: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02ABF2 14:ABE2: 01        .byte $01   ; <あ>
- D - I - - 0x02ABF3 14:ABE3: 00        .byte $00
- D - I - - 0x02ABF4 14:ABE4: 03        .byte $03   ; <う>
- D - I - - 0x02ABF5 14:ABE5: 03        .byte $03   ; <う>
- D - I - - 0x02ABF6 14:ABE6: 03        .byte $03   ; <う>
- D - I - - 0x02ABF7 14:ABE7: 00        .byte $00
- D - I - - 0x02ABF8 14:ABE8: 0B        .byte $0B   ; <さ>
- D - I - - 0x02ABF9 14:ABE9: 00        .byte $00
- D - I - - 0x02ABFA 14:ABEA: 00        .byte $00
- D - I - - 0x02ABFB 14:ABEB: 40        .byte $40   ; <「>
- D - I - - 0x02ABFC 14:ABEC: FC        .byte $FC
- D - I - - 0x02ABFD 14:ABED: 80        .byte $80
- D - I - - 0x02ABFE 14:ABEE: 02        .byte $02   ; <い>
- D - I - - 0x02ABFF 14:ABEF: 03        .byte $03   ; <う>
- D - I - - 0x02AC00 14:ABF0: 03        .byte $03   ; <う>
- D - I - - 0x02AC01 14:ABF1: 00        .byte $00
- D - I - - 0x02AC02 14:ABF2: 00        .byte $00
- D - I - - 0x02AC03 14:ABF3: 00        .byte $00
- D - I - - 0x02AC04 14:ABF4: 0B        .byte $0B   ; <さ>
- D - I - - 0x02AC05 14:ABF5: C0        .byte $C0   ; <ヅ>
- D - I - - 0x02AC06 14:ABF6: FC        .byte $FC
- D - I - - 0x02AC07 14:ABF7: 00        .byte $00
- D - I - - 0x02AC08 14:ABF8: FD        .byte $FD
- D - I - - 0x02AC09 14:ABF9: 03        .byte $03   ; <う>
- D - I - - 0x02AC0A 14:ABFA: 03        .byte $03   ; <う>
- D - I - - 0x02AC0B 14:ABFB: 00        .byte $00
- D - I - - 0x02AC0C 14:ABFC: F5        .byte $F5
- D - I - - 0x02AC0D 14:ABFD: 00        .byte $00
- D - I - - 0x02AC0E 14:ABFE: 00        .byte $00
- D - I - - 0x02AC0F 14:ABFF: 40        .byte $40   ; <「>
- D - I - - 0x02AC10 14:AC00: 02        .byte $02   ; <い>
- D - I - - 0x02AC11 14:AC01: 80        .byte $80
- D - I - - 0x02AC12 14:AC02: FD        .byte $FD
off_AC03:
- D - I - - 0x02AC13 14:AC03: 03        .byte $03   ; <う>
- D - I - - 0x02AC14 14:AC04: 03        .byte $03   ; <う>
- D - I - - 0x02AC15 14:AC05: 00        .byte $00
- D - I - - 0x02AC16 14:AC06: 00        .byte $00
- D - I - - 0x02AC17 14:AC07: 46        .byte $46   ; <カ>
- D - I - - 0x02AC18 14:AC08: EA        .byte $EA
- D - I - - 0x02AC19 14:AC09: 80        .byte $80
- D - I - - 0x02AC1A 14:AC0A: 05        .byte $05   ; <お>
- D - I - - 0x02AC1B 14:AC0B: 80        .byte $80
- D - I - - 0x02AC1C 14:AC0C: 05        .byte $05   ; <お>
- D - I - - 0x02AC1D 14:AC0D: 03        .byte $03   ; <う>
- D - I - - 0x02AC1E 14:AC0E: 03        .byte $03   ; <う>
- D - I - - 0x02AC1F 14:AC0F: BA        .byte $BA   ; <ジ>
- D - I - - 0x02AC20 14:AC10: 15        .byte $15   ; <な>
- D - I - - 0x02AC21 14:AC11: 00        .byte $00
- D - I - - 0x02AC22 14:AC12: 00        .byte $00
- D - I - - 0x02AC23 14:AC13: 80        .byte $80
- D - I - - 0x02AC24 14:AC14: FA        .byte $FA
- D - I - - 0x02AC25 14:AC15: 80        .byte $80
- D - I - - 0x02AC26 14:AC16: 05        .byte $05   ; <お>
- D - I - - 0x02AC27 14:AC17: 03        .byte $03   ; <う>
- D - I - - 0x02AC28 14:AC18: 03        .byte $03   ; <う>
- D - I - - 0x02AC29 14:AC19: 00        .byte $00
- D - I - - 0x02AC2A 14:AC1A: 00        .byte $00
- D - I - - 0x02AC2B 14:AC1B: BA        .byte $BA   ; <ジ>
- D - I - - 0x02AC2C 14:AC1C: 15        .byte $15   ; <な>
- D - I - - 0x02AC2D 14:AC1D: 80        .byte $80
- D - I - - 0x02AC2E 14:AC1E: FA        .byte $FA
- D - I - - 0x02AC2F 14:AC1F: 80        .byte $80
- D - I - - 0x02AC30 14:AC20: FA        .byte $FA
- D - I - - 0x02AC31 14:AC21: 03        .byte $03   ; <う>
- D - I - - 0x02AC32 14:AC22: 03        .byte $03   ; <う>
- D - I - - 0x02AC33 14:AC23: 46        .byte $46   ; <カ>
- D - I - - 0x02AC34 14:AC24: EA        .byte $EA
- D - I - - 0x02AC35 14:AC25: 00        .byte $00
- D - I - - 0x02AC36 14:AC26: 00        .byte $00
- D - I - - 0x02AC37 14:AC27: 80        .byte $80
- D - I - - 0x02AC38 14:AC28: 05        .byte $05   ; <お>
- D - I - - 0x02AC39 14:AC29: 80        .byte $80
- D - I - - 0x02AC3A 14:AC2A: FA        .byte $FA
- D - I - - 0x02AC3B 14:AC2B: 04        .byte $04   ; <え>
- D - I - - 0x02AC3C 14:AC2C: 03 AC     .word off_AC03
- - - - - - 0x02AC3E 14:AC2E: 04        .byte $04   ; <え>
- - - - - - 0x02AC3F 14:AC2F: 03 AC     .word off_AC03

off_AC31_E9:
- D - I - - 0x02AC41 14:AC31: 03        .byte $03   ; <う>
- D - I - - 0x02AC42 14:AC32: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AC43 14:AC33: 00        .byte $00
- D - I - - 0x02AC44 14:AC34: 00        .byte $00
- D - I - - 0x02AC45 14:AC35: 80        .byte $80
- D - I - - 0x02AC46 14:AC36: 05        .byte $05   ; <お>
- D - I - - 0x02AC47 14:AC37: 00        .byte $00
- D - I - - 0x02AC48 14:AC38: 00        .byte $00
- D - I - - 0x02AC49 14:AC39: D8        .byte $D8
- D - I - - 0x02AC4A 14:AC3A: FF        .byte $FF
- D - I - - 0x02AC4B 14:AC3B: 00        .byte $00

off_AC3C_EA:
- D - I - - 0x02AC4C 14:AC3C: 03        .byte $03   ; <う>
- D - I - - 0x02AC4D 14:AC3D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AC4E 14:AC3E: 00        .byte $00
- D - I - - 0x02AC4F 14:AC3F: F6        .byte $F6
- D - I - - 0x02AC50 14:AC40: 00        .byte $00
- D - I - - 0x02AC51 14:AC41: 01        .byte $01   ; <あ>
- D - I - - 0x02AC52 14:AC42: 40        .byte $40   ; <「>
- D - I - - 0x02AC53 14:AC43: 00        .byte $00
- D - I - - 0x02AC54 14:AC44: F8        .byte $F8
- D - I - - 0x02AC55 14:AC45: FF        .byte $FF
- - - - - - 0x02AC56 14:AC46: 00        .byte $00



tbl_AC47:
- D - I - - 0x02AC57 14:AC47: 25 AE     .word off_AE25_00
- D - I - - 0x02AC59 14:AC49: 27 AE     .word off_AE27_01
- D - I - - 0x02AC5B 14:AC4B: 31 AE     .word off_AE31_02
- D - I - - 0x02AC5D 14:AC4D: 34 AE     .word off_AE34_03
- D - I - - 0x02AC5F 14:AC4F: 36 AE     .word off_AE36_04
- D - I - - 0x02AC61 14:AC51: 38 AE     .word off_AE38_05
- D - I - - 0x02AC63 14:AC53: 3A AE     .word off_AE3A_06
- D - I - - 0x02AC65 14:AC55: 3C AE     .word off_AE3C_07
- D - I - - 0x02AC67 14:AC57: 3E AE     .word off_AE3E_08
- D - I - - 0x02AC69 14:AC59: 41 AE     .word off_AE41_09
- D - I - - 0x02AC6B 14:AC5B: 43 AE     .word off_AE43_0A
- D - I - - 0x02AC6D 14:AC5D: 45 AE     .word off_AE45_0B
- D - I - - 0x02AC6F 14:AC5F: 49 AE     .word off_AE49_0C
- D - I - - 0x02AC71 14:AC61: 55 AE     .word off_AE55_0D
- D - I - - 0x02AC73 14:AC63: 5F AE     .word off_AE5F_0E
- D - I - - 0x02AC75 14:AC65: 6B AE     .word off_AE6B_0F
- D - I - - 0x02AC77 14:AC67: 75 AE     .word off_AE75_10
- D - I - - 0x02AC79 14:AC69: 78 AE     .word off_AE78_11
- D - I - - 0x02AC7B 14:AC6B: 82 AE     .word off_AE82_12
- D - I - - 0x02AC7D 14:AC6D: 8A AE     .word off_AE8A_13
- D - I - - 0x02AC7F 14:AC6F: 8E AE     .word off_AE8E_14
- D - I - - 0x02AC81 14:AC71: 91 AE     .word off_AE91_15
- D - I - - 0x02AC83 14:AC73: 99 AE     .word off_AE99_16
- D - I - - 0x02AC85 14:AC75: E9 AE     .word off_AEE9_17
- D - I - - 0x02AC87 14:AC77: EB AE     .word off_AEEB_18
- - - - - - 0x02AC89 14:AC79: EE AE     .word off_AEEE_19
- D - I - - 0x02AC8B 14:AC7B: F0 AE     .word off_AEF0_1A
- D - I - - 0x02AC8D 14:AC7D: FB AE     .word off_AEFB_1B
- D - I - - 0x02AC8F 14:AC7F: 0E AF     .word off_AF0E_1C
- D - I - - 0x02AC91 14:AC81: 11 AF     .word off_AF11_1D
- D - I - - 0x02AC93 14:AC83: 13 AF     .word off_AF13_1E
- D - I - - 0x02AC95 14:AC85: 1B AF     .word off_AF1B_1F
- D - I - - 0x02AC97 14:AC87: 1E AF     .word off_AF1E_20
- D - I - - 0x02AC99 14:AC89: 21 AF     .word off_AF21_21
- D - I - - 0x02AC9B 14:AC8B: 23 AF     .word off_AF23_22
- D - I - - 0x02AC9D 14:AC8D: 26 AF     .word off_AF26_23
- D - I - - 0x02AC9F 14:AC8F: 59 AF     .word off_AF59_24
- D - I - - 0x02ACA1 14:AC91: 5B AF     .word off_AF5B_25
- D - I - - 0x02ACA3 14:AC93: 5D AF     .word off_AF5D_26
- D - I - - 0x02ACA5 14:AC95: 5F AF     .word off_AF5F_27
- D - I - - 0x02ACA7 14:AC97: 61 AF     .word off_AF61_28
- D - I - - 0x02ACA9 14:AC99: 63 AF     .word off_AF63_29
- D - I - - 0x02ACAB 14:AC9B: 66 AF     .word off_AF66_2A
- D - I - - 0x02ACAD 14:AC9D: 68 AF     .word off_AF68_2B
- D - I - - 0x02ACAF 14:AC9F: 6A AF     .word off_AF6A_2C
- D - I - - 0x02ACB1 14:ACA1: 70 AF     .word off_AF70_2D
- D - I - - 0x02ACB3 14:ACA3: 72 AF     .word off_AF72_2E
- D - I - - 0x02ACB5 14:ACA5: 7C AF     .word off_AF7C_2F
- D - I - - 0x02ACB7 14:ACA7: 7E AF     .word off_AF7E_30
- D - I - - 0x02ACB9 14:ACA9: 81 AF     .word off_AF81_31
- D - I - - 0x02ACBB 14:ACAB: 87 AF     .word off_AF87_32
- D - I - - 0x02ACBD 14:ACAD: 89 AF     .word off_AF89_33
- D - I - - 0x02ACBF 14:ACAF: 8B AF     .word off_AF8B_34
- D - I - - 0x02ACC1 14:ACB1: 8D AF     .word off_AF8D_35
- D - I - - 0x02ACC3 14:ACB3: 94 AF     .word off_AF94_36
- D - I - - 0x02ACC5 14:ACB5: 9D AF     .word off_AF9D_37
- D - I - - 0x02ACC7 14:ACB7: AC AF     .word off_AFAC_38
- D - I - - 0x02ACC9 14:ACB9: AE AF     .word off_AFAE_39
- D - I - - 0x02ACCB 14:ACBB: B8 AF     .word off_AFB8_3A
- D - I - - 0x02ACCD 14:ACBD: BA AF     .word off_AFBA_3B
- D - I - - 0x02ACCF 14:ACBF: C4 AF     .word off_AFC4_3C
- D - I - - 0x02ACD1 14:ACC1: D0 AF     .word off_AFD0_3D
- D - I - - 0x02ACD3 14:ACC3: D2 AF     .word off_AFD2_3E
- D - I - - 0x02ACD5 14:ACC5: DB AF     .word off_AFDB_3F
- D - I - - 0x02ACD7 14:ACC7: E3 AF     .word off_AFE3_40
- D - I - - 0x02ACD9 14:ACC9: F5 AF     .word off_AFF5_41
- D - I - - 0x02ACDB 14:ACCB: F7 AF     .word off_AFF7_42
- - - - - - 0x02ACDD 14:ACCD: F9 AF     .word off_AFF9_43
- D - I - - 0x02ACDF 14:ACCF: FC AF     .word off_AFFC_44
- D - I - - 0x02ACE1 14:ACD1: FE AF     .word off_AFFE_45
- D - I - - 0x02ACE3 14:ACD3: 07 B0     .word off_B007_46
- D - I - - 0x02ACE5 14:ACD5: 0E B0     .word off_B00E_47
- D - I - - 0x02ACE7 14:ACD7: 17 B0     .word off_B017_48
- D - I - - 0x02ACE9 14:ACD9: 1E B0     .word off_B01E_49
- - - - - - 0x02ACEB 14:ACDB: 26 B0     .word off_B026_4A_4B
- D - I - - 0x02ACED 14:ACDD: 26 B0     .word off_B026_4A_4B
- D - I - - 0x02ACEF 14:ACDF: 31 B0     .word off_B031_4C
- D - I - - 0x02ACF1 14:ACE1: 40 B0     .word off_B040_4D
- D - I - - 0x02ACF3 14:ACE3: 4D B0     .word off_B04D_4E
- D - I - - 0x02ACF5 14:ACE5: 5A B0     .word off_B05A_4F
- D - I - - 0x02ACF7 14:ACE7: 65 B0     .word off_B065_50
- D - I - - 0x02ACF9 14:ACE9: 74 B0     .word off_B074_51
- D - I - - 0x02ACFB 14:ACEB: 76 B0     .word off_B076_52
- D - I - - 0x02ACFD 14:ACED: 78 B0     .word off_B078_53
- D - I - - 0x02ACFF 14:ACEF: 7F B0     .word off_B07F_54
- D - I - - 0x02AD01 14:ACF1: 8A B0     .word off_B08A_55
- D - I - - 0x02AD03 14:ACF3: 8C B0     .word off_B08C_56
- D - I - - 0x02AD05 14:ACF5: 9B B0     .word off_B09B_57
- D - I - - 0x02AD07 14:ACF7: 9D B0     .word off_B09D_58
- D - I - - 0x02AD09 14:ACF9: A8 B0     .word off_B0A8_59
- D - I - - 0x02AD0B 14:ACFB: AB B0     .word off_B0AB_5A
- D - I - - 0x02AD0D 14:ACFD: AE B0     .word off_B0AE_5B
- D - I - - 0x02AD0F 14:ACFF: B1 B0     .word off_B0B1_5C
- D - I - - 0x02AD11 14:AD01: B4 B0     .word off_B0B4_5D
- D - I - - 0x02AD13 14:AD03: B7 B0     .word off_B0B7_5E
- D - I - - 0x02AD15 14:AD05: BA B0     .word off_B0BA_5F
- D - I - - 0x02AD17 14:AD07: BC B0     .word off_B0BC_60
- D - I - - 0x02AD19 14:AD09: BE B0     .word off_B0BE_61
- D - I - - 0x02AD1B 14:AD0B: C0 B0     .word off_B0C0_62
- D - I - - 0x02AD1D 14:AD0D: C2 B0     .word off_B0C2_63
- D - I - - 0x02AD1F 14:AD0F: C4 B0     .word off_B0C4_64
- D - I - - 0x02AD21 14:AD11: C6 B0     .word off_B0C6_65
- D - I - - 0x02AD23 14:AD13: C8 B0     .word off_B0C8_66
- D - I - - 0x02AD25 14:AD15: CB B0     .word off_B0CB_67
- D - I - - 0x02AD27 14:AD17: CE B0     .word off_B0CE_68
- D - I - - 0x02AD29 14:AD19: D2 B0     .word off_B0D2_69
- D - I - - 0x02AD2B 14:AD1B: DE B0     .word off_B0DE_6A
- D - I - - 0x02AD2D 14:AD1D: EB B0     .word off_B0EB_6B
- D - I - - 0x02AD2F 14:AD1F: F3 B0     .word off_B0F3_6C
- D - I - - 0x02AD31 14:AD21: FE B0     .word off_B0FE_6D
- D - I - - 0x02AD33 14:AD23: 0B B1     .word off_B10B_6E
- D - I - - 0x02AD35 14:AD25: 16 B1     .word off_B116_6F
- D - I - - 0x02AD37 14:AD27: 21 B1     .word off_B121_70
- D - I - - 0x02AD39 14:AD29: 5D B1     .word off_B15D_71
- D - I - - 0x02AD3B 14:AD2B: 0E B2     .word off_B20E_72
- D - I - - 0x02AD3D 14:AD2D: 77 B2     .word off_B277_73
- D - I - - 0x02AD3F 14:AD2F: 7C B2     .word off_B27C_74
- D - I - - 0x02AD41 14:AD31: 81 B2     .word off_B281_75
- D - I - - 0x02AD43 14:AD33: 86 B2     .word off_B286_76
- D - I - - 0x02AD45 14:AD35: 8B B2     .word off_B28B_77
- D - I - - 0x02AD47 14:AD37: 90 B2     .word off_B290_78
- D - I - - 0x02AD49 14:AD39: 92 B2     .word off_B292_79
- - - - - - 0x02AD4B 14:AD3B: 94 B2     .word off_B294_7A
- D - I - - 0x02AD4D 14:AD3D: 97 B2     .word off_B297_7B
- D - I - - 0x02AD4F 14:AD3F: A3 B2     .word off_B2A3_7C
- D - I - - 0x02AD51 14:AD41: AF B2     .word off_B2AF_7D
- D - I - - 0x02AD53 14:AD43: BB B2     .word off_B2BB_7E
- D - I - - 0x02AD55 14:AD45: C0 B2     .word off_B2C0_7F
- D - I - - 0x02AD57 14:AD47: CF B2     .word off_B2CF_80
- D - I - - 0x02AD59 14:AD49: D2 B2     .word off_B2D2_81
- D - I - - 0x02AD5B 14:AD4B: D4 B2     .word off_B2D4_82
- D - I - - 0x02AD5D 14:AD4D: DA B2     .word off_B2DA_83
- D - I - - 0x02AD5F 14:AD4F: E0 B2     .word off_B2E0_84
- D - I - - 0x02AD61 14:AD51: EF B2     .word off_B2EF_85
- D - I - - 0x02AD63 14:AD53: F2 B2     .word off_B2F2_86
- - - - - - 0x02AD65 14:AD55: F5 B2     .word off_B2F5_87
- - - - - - 0x02AD67 14:AD57: F8 B2     .word off_B2F8_88
- - - - - - 0x02AD69 14:AD59: FA B2     .word off_B2FA_89
- D - I - - 0x02AD6B 14:AD5B: FD B2     .word off_B2FD_8A
- D - I - - 0x02AD6D 14:AD5D: 01 B3     .word off_B301_8B
- D - I - - 0x02AD6F 14:AD5F: 04 B3     .word off_B304_8C
- D - I - - 0x02AD71 14:AD61: 06 B3     .word off_B306_8D
- D - I - - 0x02AD73 14:AD63: 08 B3     .word off_B308_8E
- D - I - - 0x02AD75 14:AD65: 0A B3     .word off_B30A_8F
- D - I - - 0x02AD77 14:AD67: 0C B3     .word off_B30C_90
- D - I - - 0x02AD79 14:AD69: 0E B3     .word off_B30E_91
- D - I - - 0x02AD7B 14:AD6B: 10 B3     .word off_B310_92
- D - I - - 0x02AD7D 14:AD6D: 12 B3     .word off_B312_93
- D - I - - 0x02AD7F 14:AD6F: 14 B3     .word off_B314_94
- D - I - - 0x02AD81 14:AD71: 28 B3     .word off_B328_95
- D - I - - 0x02AD83 14:AD73: 2B B3     .word off_B32B_96
- D - I - - 0x02AD85 14:AD75: 2E B3     .word off_B32E_97
- D - I - - 0x02AD87 14:AD77: 33 B3     .word off_B333_98
- D - I - - 0x02AD89 14:AD79: 35 B3     .word off_B335_99
- D - I - - 0x02AD8B 14:AD7B: 37 B3     .word off_B337_9A
- D - I - - 0x02AD8D 14:AD7D: 39 B3     .word off_B339_9B
- D - I - - 0x02AD8F 14:AD7F: 3B B3     .word off_B33B_9C
- D - I - - 0x02AD91 14:AD81: 3D B3     .word off_B33D_9D
- D - I - - 0x02AD93 14:AD83: 3F B3     .word off_B33F_9E
- D - I - - 0x02AD95 14:AD85: 41 B3     .word off_B341_9F
- D - I - - 0x02AD97 14:AD87: 43 B3     .word off_B343_A0
- D - I - - 0x02AD99 14:AD89: 45 B3     .word off_B345_A1
- D - I - - 0x02AD9B 14:AD8B: 47 B3     .word off_B347_A2
- D - I - - 0x02AD9D 14:AD8D: 49 B3     .word off_B349_A3
- D - I - - 0x02AD9F 14:AD8F: 4B B3     .word off_B34B_A4
- D - I - - 0x02ADA1 14:AD91: 4D B3     .word off_B34D_A5
- D - I - - 0x02ADA3 14:AD93: 4F B3     .word off_B34F_A6
- D - I - - 0x02ADA5 14:AD95: 51 B3     .word off_B351_A7
- D - I - - 0x02ADA7 14:AD97: 53 B3     .word off_B353_A8
- D - I - - 0x02ADA9 14:AD99: 55 B3     .word off_B355_A9
- D - I - - 0x02ADAB 14:AD9B: 57 B3     .word off_B357_AA
- D - I - - 0x02ADAD 14:AD9D: 59 B3     .word off_B359_AB
- D - I - - 0x02ADAF 14:AD9F: 5B B3     .word off_B35B_AC
- D - I - - 0x02ADB1 14:ADA1: 5D B3     .word off_B35D_AD
- D - I - - 0x02ADB3 14:ADA3: 5F B3     .word off_B35F_AE
- D - I - - 0x02ADB5 14:ADA5: 61 B3     .word off_B361_AF
- D - I - - 0x02ADB7 14:ADA7: 63 B3     .word off_B363_B0
- D - I - - 0x02ADB9 14:ADA9: 65 B3     .word off_B365_B1
- D - I - - 0x02ADBB 14:ADAB: 67 B3     .word off_B367_B2
- D - I - - 0x02ADBD 14:ADAD: 71 B3     .word off_B371_B3
- D - I - - 0x02ADBF 14:ADAF: 73 B3     .word off_B373_B4
- - - - - - 0x02ADC1 14:ADB1: A0 B3     .word off_B3A0_B5
- D - I - - 0x02ADC3 14:ADB3: C1 B3     .word off_B3C1_B6
- D - I - - 0x02ADC5 14:ADB5: E8 B3     .word off_B3E8_B7
- D - I - - 0x02ADC7 14:ADB7: 12 B4     .word off_B412_B8
- D - I - - 0x02ADC9 14:ADB9: 39 B4     .word off_B439_B9
- D - I - - 0x02ADCB 14:ADBB: 3E B4     .word off_B43E_BA
- D - I - - 0x02ADCD 14:ADBD: 71 B4     .word off_B471_BB
- D - I - - 0x02ADCF 14:ADBF: 80 B4     .word off_B480_BC
- D - I - - 0x02ADD1 14:ADC1: AC B4     .word off_B4AC_BD
- D - I - - 0x02ADD3 14:ADC3: D4 B4     .word off_B4D4_BE
- - - - - - 0x02ADD5 14:ADC5: E1 B4     .word off_B4E1_BF
- D - I - - 0x02ADD7 14:ADC7: F0 B4     .word off_B4F0_C0
- D - I - - 0x02ADD9 14:ADC9: 18 B5     .word off_B518_C1
- D - I - - 0x02ADDB 14:ADCB: 27 B5     .word off_B527_C2
- D - I - - 0x02ADDD 14:ADCD: 30 B5     .word off_B530_C3
- D - I - - 0x02ADDF 14:ADCF: 37 B5     .word off_B537_C4
- D - I - - 0x02ADE1 14:ADD1: 6A B5     .word off_B56A_C5
- D - I - - 0x02ADE3 14:ADD3: 77 B5     .word off_B577_C6
- D - I - - 0x02ADE5 14:ADD5: 9F B5     .word off_B59F_C7
- D - I - - 0x02ADE7 14:ADD7: A5 B5     .word off_B5A5_C8
- D - I - - 0x02ADE9 14:ADD9: AA B5     .word off_B5AA_C9
- D - I - - 0x02ADEB 14:ADDB: AC B5     .word off_B5AC_CA
- D - I - - 0x02ADED 14:ADDD: AE B5     .word off_B5AE_CB
- - - - - - 0x02ADEF 14:ADDF: B0 B5     .word off_B5B0_CC
- D - I - - 0x02ADF1 14:ADE1: B2 B5     .word off_B5B2_CD
- D - I - - 0x02ADF3 14:ADE3: B4 B5     .word off_B5B4_CE
- D - I - - 0x02ADF5 14:ADE5: BF B5     .word off_B5BF_CF
- D - I - - 0x02ADF7 14:ADE7: F2 B5     .word off_B5F2_D0
- D - I - - 0x02ADF9 14:ADE9: F7 B5     .word off_B5F7_D1
- D - I - - 0x02ADFB 14:ADEB: FC B5     .word off_B5FC_D2
- D - I - - 0x02ADFD 14:ADED: 01 B6     .word off_B601_D3
- D - I - - 0x02ADFF 14:ADEF: 06 B6     .word off_B606_D4
- D - I - - 0x02AE01 14:ADF1: 0B B6     .word off_B60B_D5
- D - I - - 0x02AE03 14:ADF3: 10 B6     .word off_B610_D6
- - - - - - 0x02AE05 14:ADF5: 15 B6     .word off_B615_D7
- D - I - - 0x02AE07 14:ADF7: 1A B6     .word off_B61A_D8
- D - I - - 0x02AE09 14:ADF9: 1F B6     .word off_B61F_D9
- D - I - - 0x02AE0B 14:ADFB: 24 B6     .word off_B624_DA
- D - I - - 0x02AE0D 14:ADFD: 29 B6     .word off_B629_DB
- D - I - - 0x02AE0F 14:ADFF: 2E B6     .word off_B62E_DC
- D - I - - 0x02AE11 14:AE01: 33 B6     .word off_B633_DD
- - - - - - 0x02AE13 14:AE03: 38 B6     .word off_B638_DE
- D - I - - 0x02AE15 14:AE05: 3D B6     .word off_B63D_DF
- D - I - - 0x02AE17 14:AE07: 42 B6     .word off_B642_E0
- D - I - - 0x02AE19 14:AE09: 47 B6     .word off_B647_E1
- D - I - - 0x02AE1B 14:AE0B: 4C B6     .word off_B64C_E2
- D - I - - 0x02AE1D 14:AE0D: 51 B6     .word off_B651_E3
- - - - - - 0x02AE1F 14:AE0F: 56 B6     .word off_B656_E4
- D - I - - 0x02AE21 14:AE11: 5B B6     .word off_B65B_E5
- D - I - - 0x02AE23 14:AE13: 60 B6     .word off_B660_E6
- D - I - - 0x02AE25 14:AE15: 66 B6     .word off_B666_E7
- D - I - - 0x02AE27 14:AE17: 68 B6     .word off_B668_E8
- D - I - - 0x02AE29 14:AE19: 6A B6     .word off_B66A_E9
- D - I - - 0x02AE2B 14:AE1B: 6C B6     .word off_B66C_EA
- - - - - - 0x02AE2D 14:AE1D: 6E B6     .word off_B66E_EB
- D - I - - 0x02AE2F 14:AE1F: 7D B6     .word off_B67D_EC
- D - I - - 0x02AE31 14:AE21: A1 B6     .word off_B6A1_ED
- - - - - - 0x02AE33 14:AE23: C6 B6     .word off_B6C6_EE



off_AE25_00:
- D - I - - 0x02AE35 14:AE25: F7        .byte $F7
- D - I - - 0x02AE36 14:AE26: BB        .byte $BB   ; <ズ>

off_AE27_01:
off_AE27:
- D - I - - 0x02AE37 14:AE27: 01        .byte $01   ; <あ>
- D - I - - 0x02AE38 14:AE28: 24        .byte $24   ; <や>
- D - I - - 0x02AE39 14:AE29: F6        .byte $F6
- D - I - - 0x02AE3A 14:AE2A: 01        .byte $01   ; <あ>
- D - I - - 0x02AE3B 14:AE2B: 00        .byte $00
- D - I - - 0x02AE3C 14:AE2C: 01        .byte $01   ; <あ>
- D - I - - 0x02AE3D 14:AE2D: 24        .byte $24   ; <や>
- D - I - - 0x02AE3E 14:AE2E: F3        .byte $F3
- D - I - - 0x02AE3F 14:AE2F: 27 AE     .word off_AE27

off_AE31_02:
- D - I - - 0x02AE41 14:AE31: F1        .byte $F1
- D - I - - 0x02AE42 14:AE32: F7        .byte $F7
- D - I - - 0x02AE43 14:AE33: 99        .byte $99

off_AE34_03:
- D - I - - 0x02AE44 14:AE34: F7        .byte $F7
- D - I - - 0x02AE45 14:AE35: 99        .byte $99

off_AE36_04:
- D - I - - 0x02AE46 14:AE36: F7        .byte $F7
- D - I - - 0x02AE47 14:AE37: 9D        .byte $9D

off_AE38_05:
- D - I - - 0x02AE48 14:AE38: F7        .byte $F7
- D - I - - 0x02AE49 14:AE39: 51        .byte $51   ; <チ>

off_AE3A_06:
- D - I - - 0x02AE4A 14:AE3A: F7        .byte $F7
- D - I - - 0x02AE4B 14:AE3B: A2        .byte $A2   ; <ぐ>

off_AE3C_07:
- D - I - - 0x02AE4C 14:AE3C: F7        .byte $F7
- D - I - - 0x02AE4D 14:AE3D: A8        .byte $A8   ; <ぜ>

off_AE3E_08:
- D - I - - 0x02AE4E 14:AE3E: F3        .byte $F3
- D - I - - 0x02AE4F 14:AE3F: AE AF     .word off_AFAE

off_AE41_09:
- D - I - - 0x02AE51 14:AE41: F7        .byte $F7
- D - I - - 0x02AE52 14:AE42: A9        .byte $A9   ; <ぞ>

off_AE43_0A:
- D - I - - 0x02AE53 14:AE43: F7        .byte $F7
- D - I - - 0x02AE54 14:AE44: AE        .byte $AE   ; <ど>

off_AE45_0B:
- D - I - - 0x02AE55 14:AE45: 02        .byte $02   ; <い>
- D - I - - 0x02AE56 14:AE46: B0        .byte $B0   ; <び>
- D - I - - 0x02AE57 14:AE47: F7        .byte $F7
- D - I - - 0x02AE58 14:AE48: AF        .byte $AF   ; <ば>

off_AE49_0C:
off_AE49:
- D - I - - 0x02AE59 14:AE49: F1        .byte $F1
- D - I - - 0x02AE5A 14:AE4A: 01        .byte $01   ; <あ>
- D - I - - 0x02AE5B 14:AE4B: 4F        .byte $4F   ; <ソ>
- D - I - - 0x02AE5C 14:AE4C: F1        .byte $F1
- D - I - - 0x02AE5D 14:AE4D: F6        .byte $F6
- D - I - - 0x02AE5E 14:AE4E: 02        .byte $02   ; <い>
- D - I - - 0x02AE5F 14:AE4F: 00        .byte $00
- D - I - - 0x02AE60 14:AE50: 01        .byte $01   ; <あ>
- D - I - - 0x02AE61 14:AE51: 4F        .byte $4F   ; <ソ>
- D - I - - 0x02AE62 14:AE52: F3        .byte $F3
- D - I - - 0x02AE63 14:AE53: 49 AE     .word off_AE49

off_AE55_0D:
off_AE55:
- D - I - - 0x02AE65 14:AE55: 01        .byte $01   ; <あ>
- D - I - - 0x02AE66 14:AE56: 4F        .byte $4F   ; <ソ>
- D - I - - 0x02AE67 14:AE57: F6        .byte $F6
- D - I - - 0x02AE68 14:AE58: 02        .byte $02   ; <い>
- D - I - - 0x02AE69 14:AE59: 00        .byte $00
- D - I - - 0x02AE6A 14:AE5A: 01        .byte $01   ; <あ>
- D - I - - 0x02AE6B 14:AE5B: 4F        .byte $4F   ; <ソ>
- D - I - - 0x02AE6C 14:AE5C: F3        .byte $F3
- D - I - - 0x02AE6D 14:AE5D: 55 AE     .word off_AE55

off_AE5F_0E:
off_AE5F:
- D - I - - 0x02AE6F 14:AE5F: F1        .byte $F1
- D - I - - 0x02AE70 14:AE60: 01        .byte $01   ; <あ>
- D - I - - 0x02AE71 14:AE61: 50        .byte $50   ; <タ>
- D - I - - 0x02AE72 14:AE62: F1        .byte $F1
- D - I - - 0x02AE73 14:AE63: F6        .byte $F6
- D - I - - 0x02AE74 14:AE64: 02        .byte $02   ; <い>
- D - I - - 0x02AE75 14:AE65: 00        .byte $00
- D - I - - 0x02AE76 14:AE66: 01        .byte $01   ; <あ>
- D - I - - 0x02AE77 14:AE67: 50        .byte $50   ; <タ>
- D - I - - 0x02AE78 14:AE68: F3        .byte $F3
- D - I - - 0x02AE79 14:AE69: 5F AE     .word off_AE5F

off_AE6B_0F:
off_AE6B:
- D - I - - 0x02AE7B 14:AE6B: 01        .byte $01   ; <あ>
- D - I - - 0x02AE7C 14:AE6C: 50        .byte $50   ; <タ>
- D - I - - 0x02AE7D 14:AE6D: F6        .byte $F6
- D - I - - 0x02AE7E 14:AE6E: 02        .byte $02   ; <い>
- D - I - - 0x02AE7F 14:AE6F: 00        .byte $00
- D - I - - 0x02AE80 14:AE70: 01        .byte $01   ; <あ>
- D - I - - 0x02AE81 14:AE71: 50        .byte $50   ; <タ>
- D - I - - 0x02AE82 14:AE72: F3        .byte $F3
- D - I - - 0x02AE83 14:AE73: 6B AE     .word off_AE6B

off_AE75_10:
- D - I - - 0x02AE85 14:AE75: F1        .byte $F1
- D - I - - 0x02AE86 14:AE76: F7        .byte $F7
- D - I - - 0x02AE87 14:AE77: 89        .byte $89   ; <I>

off_AE78_11:
off_AE78:
- D - I - - 0x02AE88 14:AE78: 01        .byte $01   ; <あ>
- D - I - - 0x02AE89 14:AE79: 89        .byte $89   ; <I>
- D - I - - 0x02AE8A 14:AE7A: F6        .byte $F6
- D - I - - 0x02AE8B 14:AE7B: 00        .byte $00
- D - I - - 0x02AE8C 14:AE7C: 02        .byte $02   ; <い>
- D - I - - 0x02AE8D 14:AE7D: 01        .byte $01   ; <あ>
- D - I - - 0x02AE8E 14:AE7E: 89        .byte $89   ; <I>
- D - I - - 0x02AE8F 14:AE7F: F3        .byte $F3
- D - I - - 0x02AE90 14:AE80: 78 AE     .word off_AE78

off_AE82_12:
off_AE82:
- D - I - - 0x02AE92 14:AE82: 02        .byte $02   ; <い>
- D - I - - 0x02AE93 14:AE83: 8F        .byte $8F   ; <S>
- D - I - - 0x02AE94 14:AE84: F2        .byte $F2
- D - I - - 0x02AE95 14:AE85: 02        .byte $02   ; <い>
- D - I - - 0x02AE96 14:AE86: 8F        .byte $8F   ; <S>
- D - I - - 0x02AE97 14:AE87: F3        .byte $F3
- D - I - - 0x02AE98 14:AE88: 82 AE     .word off_AE82

off_AE8A_13:
- D - I - - 0x02AE9A 14:AE8A: 14        .byte $14   ; <と>
- D - I - - 0x02AE9B 14:AE8B: AF        .byte $AF   ; <ば>
- D - I - - 0x02AE9C 14:AE8C: F7        .byte $F7
- D - I - - 0x02AE9D 14:AE8D: B0        .byte $B0   ; <び>

off_AE8E_14:
- D - I - - 0x02AE9E 14:AE8E: F1        .byte $F1
- D - I - - 0x02AE9F 14:AE8F: F7        .byte $F7
- D - I - - 0x02AEA0 14:AE90: 48        .byte $48   ; <ク>

off_AE91_15:
off_AE91:
- D - I - - 0x02AEA1 14:AE91: 01        .byte $01   ; <あ>
- D - I - - 0x02AEA2 14:AE92: 47        .byte $47   ; <キ>
- D - I - - 0x02AEA3 14:AE93: F2        .byte $F2
- D - I - - 0x02AEA4 14:AE94: 01        .byte $01   ; <あ>
- D - I - - 0x02AEA5 14:AE95: 47        .byte $47   ; <キ>
- D - I - - 0x02AEA6 14:AE96: F3        .byte $F3
- D - I - - 0x02AEA7 14:AE97: 91 AE     .word off_AE91

off_AE99_16:
- D - I - - 0x02AEA9 14:AE99: 03        .byte $03   ; <う>
- D - I - - 0x02AEAA 14:AE9A: 87        .byte $87   ; <G>
- D - I - - 0x02AEAB 14:AE9B: 03        .byte $03   ; <う>
- D - I - - 0x02AEAC 14:AE9C: 86        .byte $86   ; <F>
- D - I - - 0x02AEAD 14:AE9D: 03        .byte $03   ; <う>
- D - I - - 0x02AEAE 14:AE9E: 85        .byte $85   ; <E>
- D - I - - 0x02AEAF 14:AE9F: 03        .byte $03   ; <う>
- D - I - - 0x02AEB0 14:AEA0: 84        .byte $84   ; <D>
- D - I - - 0x02AEB1 14:AEA1: 03        .byte $03   ; <う>
- D - I - - 0x02AEB2 14:AEA2: 83        .byte $83   ; <C>
- D - I - - 0x02AEB3 14:AEA3: F6        .byte $F6
- D - I - - 0x02AEB4 14:AEA4: 00        .byte $00
- D - I - - 0x02AEB5 14:AEA5: FF        .byte $FF
- D - I - - 0x02AEB6 14:AEA6: 01        .byte $01   ; <あ>
- D - I - - 0x02AEB7 14:AEA7: 82        .byte $82   ; <B>
- D - I - - 0x02AEB8 14:AEA8: F6        .byte $F6
- D - I - - 0x02AEB9 14:AEA9: 00        .byte $00
- D - I - - 0x02AEBA 14:AEAA: 01        .byte $01   ; <あ>
- D - I - - 0x02AEBB 14:AEAB: 01        .byte $01   ; <あ>
- D - I - - 0x02AEBC 14:AEAC: 81        .byte $81   ; <A>
- D - I - - 0x02AEBD 14:AEAD: F6        .byte $F6
- D - I - - 0x02AEBE 14:AEAE: 00        .byte $00
- D - I - - 0x02AEBF 14:AEAF: FF        .byte $FF
- D - I - - 0x02AEC0 14:AEB0: 01        .byte $01   ; <あ>
- D - I - - 0x02AEC1 14:AEB1: 80        .byte $80
- D - I - - 0x02AEC2 14:AEB2: F6        .byte $F6
- D - I - - 0x02AEC3 14:AEB3: 00        .byte $00
- D - I - - 0x02AEC4 14:AEB4: 04        .byte $04   ; <え>
- D - I - - 0x02AEC5 14:AEB5: 01        .byte $01   ; <あ>
- D - I - - 0x02AEC6 14:AEB6: 7F        .byte $7F   ; <,>
- D - I - - 0x02AEC7 14:AEB7: F4        .byte $F4
- D - I - - 0x02AEC8 14:AEB8: 0E        .byte $0E   ; <せ>
- D - I - - 0x02AEC9 14:AEB9: F6        .byte $F6
- D - I - - 0x02AECA 14:AEBA: 00        .byte $00
- D - I - - 0x02AECB 14:AEBB: 01        .byte $01   ; <あ>
- D - I - - 0x02AECC 14:AEBC: 01        .byte $01   ; <あ>
- D - I - - 0x02AECD 14:AEBD: 7E        .byte $7E   ; <.>
- D - I - - 0x02AECE 14:AEBE: F1        .byte $F1
- D - I - - 0x02AECF 14:AEBF: F2        .byte $F2
- D - I - - 0x02AED0 14:AEC0: F6        .byte $F6
- D - I - - 0x02AED1 14:AEC1: 00        .byte $00
- D - I - - 0x02AED2 14:AEC2: 01        .byte $01   ; <あ>
- D - I - - 0x02AED3 14:AEC3: 01        .byte $01   ; <あ>
- D - I - - 0x02AED4 14:AEC4: 7E        .byte $7E   ; <.>
- D - I - - 0x02AED5 14:AEC5: F5        .byte $F5
- D - I - - 0x02AED6 14:AEC6: F6        .byte $F6
- D - I - - 0x02AED7 14:AEC7: 00        .byte $00
- D - I - - 0x02AED8 14:AEC8: 01        .byte $01   ; <あ>
- D - I - - 0x02AED9 14:AEC9: 01        .byte $01   ; <あ>
- D - I - - 0x02AEDA 14:AECA: 7E        .byte $7E   ; <.>
- D - I - - 0x02AEDB 14:AECB: F6        .byte $F6
- D - I - - 0x02AEDC 14:AECC: 00        .byte $00
- D - I - - 0x02AEDD 14:AECD: 04        .byte $04   ; <え>
- D - I - - 0x02AEDE 14:AECE: 01        .byte $01   ; <あ>
- D - I - - 0x02AEDF 14:AECF: 7F        .byte $7F   ; <,>
- D - I - - 0x02AEE0 14:AED0: F6        .byte $F6
- D - I - - 0x02AEE1 14:AED1: 00        .byte $00
- D - I - - 0x02AEE2 14:AED2: FF        .byte $FF
- D - I - - 0x02AEE3 14:AED3: 01        .byte $01   ; <あ>
- D - I - - 0x02AEE4 14:AED4: 80        .byte $80
- D - I - - 0x02AEE5 14:AED5: F6        .byte $F6
- D - I - - 0x02AEE6 14:AED6: 00        .byte $00
- D - I - - 0x02AEE7 14:AED7: 01        .byte $01   ; <あ>
- D - I - - 0x02AEE8 14:AED8: 01        .byte $01   ; <あ>
- D - I - - 0x02AEE9 14:AED9: 81        .byte $81   ; <A>
- D - I - - 0x02AEEA 14:AEDA: F6        .byte $F6
- D - I - - 0x02AEEB 14:AEDB: 00        .byte $00
- D - I - - 0x02AEEC 14:AEDC: FF        .byte $FF
- D - I - - 0x02AEED 14:AEDD: 01        .byte $01   ; <あ>
- D - I - - 0x02AEEE 14:AEDE: 82        .byte $82   ; <B>
- D - I - - 0x02AEEF 14:AEDF: 03        .byte $03   ; <う>
- D - I - - 0x02AEF0 14:AEE0: 83        .byte $83   ; <C>
- D - I - - 0x02AEF1 14:AEE1: 03        .byte $03   ; <う>
- D - I - - 0x02AEF2 14:AEE2: 84        .byte $84   ; <D>
- - - - - - 0x02AEF3 14:AEE3: 03        .byte $03   ; <う>
- - - - - - 0x02AEF4 14:AEE4: 85        .byte $85   ; <E>
- - - - - - 0x02AEF5 14:AEE5: 03        .byte $03   ; <う>
- - - - - - 0x02AEF6 14:AEE6: 86        .byte $86   ; <F>
- - - - - - 0x02AEF7 14:AEE7: F7        .byte $F7
- - - - - - 0x02AEF8 14:AEE8: 87        .byte $87   ; <G>

off_AEE9_17:
- D - I - - 0x02AEF9 14:AEE9: F7        .byte $F7
- D - I - - 0x02AEFA 14:AEEA: 41        .byte $41   ; <ア>

off_AEEB_18:
- D - I - - 0x02AEFB 14:AEEB: F1        .byte $F1
- D - I - - 0x02AEFC 14:AEEC: F7        .byte $F7
- D - I - - 0x02AEFD 14:AEED: C3        .byte $C3   ; <バ>

off_AEEE_19:
- - - - - - 0x02AEFE 14:AEEE: F7        .byte $F7
- - - - - - 0x02AEFF 14:AEEF: C3        .byte $C3   ; <バ>

off_AEF0_1A:
off_AEF0:
- D - I - - 0x02AF00 14:AEF0: 02        .byte $02   ; <い>
- D - I - - 0x02AF01 14:AEF1: C4        .byte $C4   ; <ビ>
- D - I - - 0x02AF02 14:AEF2: F2        .byte $F2
- D - I - - 0x02AF03 14:AEF3: F6        .byte $F6
- D - I - - 0x02AF04 14:AEF4: 00        .byte $00
- D - I - - 0x02AF05 14:AEF5: 02        .byte $02   ; <い>
- D - I - - 0x02AF06 14:AEF6: 02        .byte $02   ; <い>
- D - I - - 0x02AF07 14:AEF7: C4        .byte $C4   ; <ビ>
- D - I - - 0x02AF08 14:AEF8: F3        .byte $F3
- D - I - - 0x02AF09 14:AEF9: F0 AE     .word off_AEF0

off_AEFB_1B:
- D - I - - 0x02AF0B 14:AEFB: 01        .byte $01   ; <あ>
- D - I - - 0x02AF0C 14:AEFC: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02AF0D 14:AEFD: 01        .byte $01   ; <あ>
- D - I - - 0x02AF0E 14:AEFE: C8        .byte $C8   ; <ぱ>
off_AEFF:
- D - I - - 0x02AF0F 14:AEFF: 01        .byte $01   ; <あ>
- D - I - - 0x02AF10 14:AF00: 41        .byte $41   ; <ア>
- D - I - - 0x02AF11 14:AF01: 01        .byte $01   ; <あ>
- D - I - - 0x02AF12 14:AF02: 41        .byte $41   ; <ア>
off_AF03:
- D - I - - 0x02AF13 14:AF03: 01        .byte $01   ; <あ>
- D - I - - 0x02AF14 14:AF04: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02AF15 14:AF05: 01        .byte $01   ; <あ>
- D - I - - 0x02AF16 14:AF06: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02AF17 14:AF07: 01        .byte $01   ; <あ>
- D - I - - 0x02AF18 14:AF08: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02AF19 14:AF09: 01        .byte $01   ; <あ>
- D - I - - 0x02AF1A 14:AF0A: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02AF1B 14:AF0B: F3        .byte $F3
- D - I - - 0x02AF1C 14:AF0C: FF AE     .word off_AEFF

off_AF0E_1C:
off_AF0E:
- D - I - - 0x02AF1E 14:AF0E: F1        .byte $F1
- D - I - - 0x02AF1F 14:AF0F: F7        .byte $F7
- D - I - - 0x02AF20 14:AF10: 14        .byte $14   ; <と>

off_AF11_1D:
- D - I - - 0x02AF21 14:AF11: F7        .byte $F7
- D - I - - 0x02AF22 14:AF12: 14        .byte $14   ; <と>

off_AF13_1E:
off_AF13:
- D - I - - 0x02AF23 14:AF13: 02        .byte $02   ; <い>
- D - I - - 0x02AF24 14:AF14: 18        .byte $18   ; <ね>
- D - I - - 0x02AF25 14:AF15: F2        .byte $F2
- D - I - - 0x02AF26 14:AF16: 02        .byte $02   ; <い>
- D - I - - 0x02AF27 14:AF17: 18        .byte $18   ; <ね>
- D - I - - 0x02AF28 14:AF18: F3        .byte $F3
- D - I - - 0x02AF29 14:AF19: 13 AF     .word off_AF13

off_AF1B_1F:
- D - I - - 0x02AF2B 14:AF1B: F3        .byte $F3
- D - I - - 0x02AF2C 14:AF1C: 03 AF     .word off_AF03

off_AF1E_20:
off_AF1E:
- D - I - - 0x02AF2E 14:AF1E: F1        .byte $F1
- D - I - - 0x02AF2F 14:AF1F: F7        .byte $F7
- D - I - - 0x02AF30 14:AF20: 19        .byte $19   ; <の>

off_AF21_21:
- D - I - - 0x02AF31 14:AF21: F7        .byte $F7
- D - I - - 0x02AF32 14:AF22: 19        .byte $19   ; <の>

off_AF23_22:
- D - I - - 0x02AF33 14:AF23: 02        .byte $02   ; <い>
- D - I - - 0x02AF34 14:AF24: 1D        .byte $1D   ; <へ>
- D - I - - 0x02AF35 14:AF25: F0        .byte $F0

off_AF26_23:
- D - I - - 0x02AF36 14:AF26: 01        .byte $01   ; <あ>
- D - I - - 0x02AF37 14:AF27: 7D        .byte $7D   ; <ー>
- D - I - - 0x02AF38 14:AF28: 01        .byte $01   ; <あ>
- D - I - - 0x02AF39 14:AF29: 7C        .byte $7C   ; <~>
- D - I - - 0x02AF3A 14:AF2A: 01        .byte $01   ; <あ>
- D - I - - 0x02AF3B 14:AF2B: 7B        .byte $7B   ; <。>
- D - I - - 0x02AF3C 14:AF2C: 01        .byte $01   ; <あ>
- D - I - - 0x02AF3D 14:AF2D: 7A        .byte $7A   ; <、>
- D - I - - 0x02AF3E 14:AF2E: 01        .byte $01   ; <あ>
- D - I - - 0x02AF3F 14:AF2F: 79        .byte $79   ; <!>
- D - I - - 0x02AF40 14:AF30: 01        .byte $01   ; <あ>
- D - I - - 0x02AF41 14:AF31: 78        .byte $78   ; <?>
- D - I - - 0x02AF42 14:AF32: 01        .byte $01   ; <あ>
- D - I - - 0x02AF43 14:AF33: 77        .byte $77   ; <:>
- D - I - - 0x02AF44 14:AF34: F6        .byte $F6
- D - I - - 0x02AF45 14:AF35: FE        .byte $FE
- D - I - - 0x02AF46 14:AF36: 01        .byte $01   ; <あ>
- D - I - - 0x02AF47 14:AF37: 01        .byte $01   ; <あ>
- D - I - - 0x02AF48 14:AF38: 76        .byte $76   ; <ォ>
- D - I - - 0x02AF49 14:AF39: F6        .byte $F6
- D - I - - 0x02AF4A 14:AF3A: FE        .byte $FE
- D - I - - 0x02AF4B 14:AF3B: 01        .byte $01   ; <あ>
- D - I - - 0x02AF4C 14:AF3C: 01        .byte $01   ; <あ>
- D - I - - 0x02AF4D 14:AF3D: 75        .byte $75   ; <ェ>
- D - I - - 0x02AF4E 14:AF3E: 01        .byte $01   ; <あ>
- D - I - - 0x02AF4F 14:AF3F: 74        .byte $74   ; <ィ>
- D - I - - 0x02AF50 14:AF40: F6        .byte $F6
- D - I - - 0x02AF51 14:AF41: 00        .byte $00
- D - I - - 0x02AF52 14:AF42: 01        .byte $01   ; <あ>
- D - I - - 0x02AF53 14:AF43: 01        .byte $01   ; <あ>
- D - I - - 0x02AF54 14:AF44: 73        .byte $73   ; <ヮ>
- D - I - - 0x02AF55 14:AF45: F6        .byte $F6
- D - I - - 0x02AF56 14:AF46: 01        .byte $01   ; <あ>
- D - I - - 0x02AF57 14:AF47: 00        .byte $00
- D - I - - 0x02AF58 14:AF48: 01        .byte $01   ; <あ>
- D - I - - 0x02AF59 14:AF49: 72        .byte $72   ; <ョ>
off_AF4A:
- D - I - - 0x02AF5A 14:AF4A: F6        .byte $F6
- D - I - - 0x02AF5B 14:AF4B: 00        .byte $00
- D - I - - 0x02AF5C 14:AF4C: 01        .byte $01   ; <あ>
- D - I - - 0x02AF5D 14:AF4D: 01        .byte $01   ; <あ>
- D - I - - 0x02AF5E 14:AF4E: 71        .byte $71   ; <ュ>
- D - I - - 0x02AF5F 14:AF4F: F1        .byte $F1
- D - I - - 0x02AF60 14:AF50: F2        .byte $F2
- D - I - - 0x02AF61 14:AF51: F6        .byte $F6
- D - I - - 0x02AF62 14:AF52: 00        .byte $00
- D - I - - 0x02AF63 14:AF53: 01        .byte $01   ; <あ>
- D - I - - 0x02AF64 14:AF54: 01        .byte $01   ; <あ>
- D - I - - 0x02AF65 14:AF55: 71        .byte $71   ; <ュ>
- D - I - - 0x02AF66 14:AF56: F3        .byte $F3
- D - I - - 0x02AF67 14:AF57: 4A AF     .word off_AF4A

off_AF59_24:
- D - I - - 0x02AF69 14:AF59: F7        .byte $F7
- D - I - - 0x02AF6A 14:AF5A: BC        .byte $BC   ; <ゼ>

off_AF5B_25:
- D - I - - 0x02AF6B 14:AF5B: F7        .byte $F7
- D - I - - 0x02AF6C 14:AF5C: BD        .byte $BD   ; <ゾ>

off_AF5D_26:
- D - I - - 0x02AF6D 14:AF5D: F7        .byte $F7
- D - I - - 0x02AF6E 14:AF5E: BE        .byte $BE   ; <ダ>

off_AF5F_27:
- D - I - - 0x02AF6F 14:AF5F: F7        .byte $F7
- D - I - - 0x02AF70 14:AF60: B7        .byte $B7   ; <ゲ>

off_AF61_28:
- D - I - - 0x02AF71 14:AF61: F7        .byte $F7
- D - I - - 0x02AF72 14:AF62: 88        .byte $88   ; <H>

off_AF63_29:
off_AF63:
- D - I - - 0x02AF73 14:AF63: F1        .byte $F1
- D - I - - 0x02AF74 14:AF64: F7        .byte $F7
- D - I - - 0x02AF75 14:AF65: 25        .byte $25   ; <ゆ>

off_AF66_2A:
- D - I - - 0x02AF76 14:AF66: F7        .byte $F7
- D - I - - 0x02AF77 14:AF67: 25        .byte $25   ; <ゆ>

off_AF68_2B:
- D - I - - 0x02AF78 14:AF68: F7        .byte $F7
- D - I - - 0x02AF79 14:AF69: 1E        .byte $1E   ; <ほ>

off_AF6A_2C:
- D - I - - 0x02AF7A 14:AF6A: 1E        .byte $1E   ; <ほ>
- D - I - - 0x02AF7B 14:AF6B: 4E        .byte $4E   ; <セ>
- D - I - - 0x02AF7C 14:AF6C: 02        .byte $02   ; <い>
- D - I - - 0x02AF7D 14:AF6D: CE        .byte $CE   ; <ピ>
- D - I - - 0x02AF7E 14:AF6E: F7        .byte $F7
- D - I - - 0x02AF7F 14:AF6F: C8        .byte $C8   ; <ぱ>

off_AF70_2D:
- D - I - - 0x02AF80 14:AF70: F7        .byte $F7
- D - I - - 0x02AF81 14:AF71: 1F        .byte $1F   ; <ま>

off_AF72_2E:
off_AF72:
- D - I - - 0x02AF82 14:AF72: 01        .byte $01   ; <あ>
- D - I - - 0x02AF83 14:AF73: 20        .byte $20   ; <み>
- D - I - - 0x02AF84 14:AF74: F6        .byte $F6
- D - I - - 0x02AF85 14:AF75: 02        .byte $02   ; <い>
- D - I - - 0x02AF86 14:AF76: FE        .byte $FE
- D - I - - 0x02AF87 14:AF77: 01        .byte $01   ; <あ>
- D - I - - 0x02AF88 14:AF78: 20        .byte $20   ; <み>
- D - I - - 0x02AF89 14:AF79: F3        .byte $F3
- D - I - - 0x02AF8A 14:AF7A: 72 AF     .word off_AF72

off_AF7C_2F:
- D - I - - 0x02AF8C 14:AF7C: F7        .byte $F7
- D - I - - 0x02AF8D 14:AF7D: 6A        .byte $6A   ; <レ>

off_AF7E_30:
- D - I - - 0x02AF8E 14:AF7E: F1        .byte $F1
- D - I - - 0x02AF8F 14:AF7F: F7        .byte $F7
- D - I - - 0x02AF90 14:AF80: 70        .byte $70   ; <ャ>

off_AF81_31:
- D - I - - 0x02AF91 14:AF81: F1        .byte $F1
- D - I - - 0x02AF92 14:AF82: 06        .byte $06   ; <か>
- D - I - - 0x02AF93 14:AF83: 9E        .byte $9E
- D - I - - 0x02AF94 14:AF84: F1        .byte $F1
- D - I - - 0x02AF95 14:AF85: F7        .byte $F7
- D - I - - 0x02AF96 14:AF86: 9F        .byte $9F

off_AF87_32:
- D - I - - 0x02AF97 14:AF87: F7        .byte $F7
- D - I - - 0x02AF98 14:AF88: 93        .byte $93   ; <Y>

off_AF89_33:
- D - I - - 0x02AF99 14:AF89: F7        .byte $F7
- D - I - - 0x02AF9A 14:AF8A: 94        .byte $94

off_AF8B_34:
- D - I - - 0x02AF9B 14:AF8B: F7        .byte $F7
- D - I - - 0x02AF9C 14:AF8C: 71        .byte $71   ; <ュ>

off_AF8D_35:
off_AF8D:
- D - I - - 0x02AF9D 14:AF8D: 01        .byte $01   ; <あ>
- D - I - - 0x02AF9E 14:AF8E: 90        .byte $90   ; <U>
- D - I - - 0x02AF9F 14:AF8F: 01        .byte $01   ; <あ>
- D - I - - 0x02AFA0 14:AF90: 91        .byte $91   ; <V>
- D - I - - 0x02AFA1 14:AF91: F3        .byte $F3
- D - I - - 0x02AFA2 14:AF92: 8D AF     .word off_AF8D

off_AF94_36:
- D - I - - 0x02AFA4 14:AF94: F4        .byte $F4
- D - I - - 0x02AFA5 14:AF95: 01        .byte $01   ; <あ>
- D - I - - 0x02AFA6 14:AF96: 01        .byte $01   ; <あ>
- D - I - - 0x02AFA7 14:AF97: 90        .byte $90   ; <U>
- D - I - - 0x02AFA8 14:AF98: 01        .byte $01   ; <あ>
- D - I - - 0x02AFA9 14:AF99: 91        .byte $91   ; <V>
- D - I - - 0x02AFAA 14:AF9A: F5        .byte $F5
- D - I - - 0x02AFAB 14:AF9B: F7        .byte $F7
- D - I - - 0x02AFAC 14:AF9C: 92        .byte $92   ; <W>

off_AF9D_37:
- D - I - - 0x02AFAD 14:AF9D: F1        .byte $F1
- D - I - - 0x02AFAE 14:AF9E: 01        .byte $01   ; <あ>
- D - I - - 0x02AFAF 14:AF9F: C5        .byte $C5   ; <ブ>
- - - - - - 0x02AFB0 14:AFA0: F4        .byte $F4
- - - - - - 0x02AFB1 14:AFA1: 01        .byte $01   ; <あ>
- - - - - - 0x02AFB2 14:AFA2: F1        .byte $F1
- - - - - - 0x02AFB3 14:AFA3: 01        .byte $01   ; <あ>
- - - - - - 0x02AFB4 14:AFA4: C6        .byte $C6   ; <ベ>
- - - - - - 0x02AFB5 14:AFA5: F1        .byte $F1
- - - - - - 0x02AFB6 14:AFA6: 01        .byte $01   ; <あ>
- - - - - - 0x02AFB7 14:AFA7: C7        .byte $C7   ; <ボ>
- - - - - - 0x02AFB8 14:AFA8: F5        .byte $F5
- - - - - - 0x02AFB9 14:AFA9: F1        .byte $F1
- - - - - - 0x02AFBA 14:AFAA: F7        .byte $F7
- - - - - - 0x02AFBB 14:AFAB: C5        .byte $C5   ; <ブ>

off_AFAC_38:
- D - I - - 0x02AFBC 14:AFAC: 01        .byte $01   ; <あ>
- D - I - - 0x02AFBD 14:AFAD: A3        .byte $A3   ; <げ>

off_AFAE_39:
off_AFAE:
- D - I - - 0x02AFBE 14:AFAE: 01        .byte $01   ; <あ>
- D - I - - 0x02AFBF 14:AFAF: A5        .byte $A5   ; <ざ>
- D - I - - 0x02AFC0 14:AFB0: 01        .byte $01   ; <あ>
- D - I - - 0x02AFC1 14:AFB1: A7        .byte $A7   ; <ず>
- D - I - - 0x02AFC2 14:AFB2: 01        .byte $01   ; <あ>
- D - I - - 0x02AFC3 14:AFB3: A4        .byte $A4   ; <ご>
- D - I - - 0x02AFC4 14:AFB4: 01        .byte $01   ; <あ>
- D - I - - 0x02AFC5 14:AFB5: A6        .byte $A6   ; <じ>
- D - I - - 0x02AFC6 14:AFB6: F7        .byte $F7
- D - I - - 0x02AFC7 14:AFB7: A3        .byte $A3   ; <げ>

off_AFB8_3A:
- D - I - - 0x02AFC8 14:AFB8: 01        .byte $01   ; <あ>
- D - I - - 0x02AFC9 14:AFB9: C9        .byte $C9   ; <ぴ>

off_AFBA_3B:
- D - I - - 0x02AFCA 14:AFBA: 01        .byte $01   ; <あ>
- D - I - - 0x02AFCB 14:AFBB: AB        .byte $AB   ; <ぢ>
- D - I - - 0x02AFCC 14:AFBC: 01        .byte $01   ; <あ>
- D - I - - 0x02AFCD 14:AFBD: AD        .byte $AD   ; <で>
- D - I - - 0x02AFCE 14:AFBE: 01        .byte $01   ; <あ>
- D - I - - 0x02AFCF 14:AFBF: AA        .byte $AA   ; <だ>
- D - I - - 0x02AFD0 14:AFC0: 01        .byte $01   ; <あ>
- D - I - - 0x02AFD1 14:AFC1: AC        .byte $AC   ; <づ>
- D - I - - 0x02AFD2 14:AFC2: F7        .byte $F7
- D - I - - 0x02AFD3 14:AFC3: C9        .byte $C9   ; <ぴ>

off_AFC4_3C:
- D - I - - 0x02AFD4 14:AFC4: 01        .byte $01   ; <あ>
- D - I - - 0x02AFD5 14:AFC5: 8A        .byte $8A   ; <N>
- D - I - - 0x02AFD6 14:AFC6: 01        .byte $01   ; <あ>
- D - I - - 0x02AFD7 14:AFC7: 8C        .byte $8C   ; <M>
- D - I - - 0x02AFD8 14:AFC8: 01        .byte $01   ; <あ>
- D - I - - 0x02AFD9 14:AFC9: 8E        .byte $8E   ; <L>
- D - I - - 0x02AFDA 14:AFCA: 01        .byte $01   ; <あ>
- D - I - - 0x02AFDB 14:AFCB: 8B        .byte $8B   ; <K>
- D - I - - 0x02AFDC 14:AFCC: 01        .byte $01   ; <あ>
- D - I - - 0x02AFDD 14:AFCD: 8D        .byte $8D   ; <P>
- D - I - - 0x02AFDE 14:AFCE: F7        .byte $F7
- D - I - - 0x02AFDF 14:AFCF: 8A        .byte $8A   ; <N>

off_AFD0_3D:
- D - I - - 0x02AFE0 14:AFD0: F7        .byte $F7
- D - I - - 0x02AFE1 14:AFD1: 26        .byte $26   ; <よ>

off_AFD2_3E:
- D - I - - 0x02AFE2 14:AFD2: 01        .byte $01   ; <あ>
- D - I - - 0x02AFE3 14:AFD3: 9A        .byte $9A
- D - I - - 0x02AFE4 14:AFD4: 01        .byte $01   ; <あ>
- D - I - - 0x02AFE5 14:AFD5: 9B        .byte $9B
- D - I - - 0x02AFE6 14:AFD6: 01        .byte $01   ; <あ>
- D - I - - 0x02AFE7 14:AFD7: 9C        .byte $9C
- D - I - - 0x02AFE8 14:AFD8: 01        .byte $01   ; <あ>
- D - I - - 0x02AFE9 14:AFD9: 9A        .byte $9A
- D - I - - 0x02AFEA 14:AFDA: F0        .byte $F0

off_AFDB_3F:
- D - I - - 0x02AFEB 14:AFDB: 01        .byte $01   ; <あ>
- D - I - - 0x02AFEC 14:AFDC: 15        .byte $15   ; <な>
- D - I - - 0x02AFED 14:AFDD: 01        .byte $01   ; <あ>
- D - I - - 0x02AFEE 14:AFDE: 16        .byte $16   ; <に>
- D - I - - 0x02AFEF 14:AFDF: 01        .byte $01   ; <あ>
- D - I - - 0x02AFF0 14:AFE0: 17        .byte $17   ; <ぬ>
- D - I - - 0x02AFF1 14:AFE1: F7        .byte $F7
- D - I - - 0x02AFF2 14:AFE2: 15        .byte $15   ; <な>

off_AFE3_40:
- D - I - - 0x02AFF3 14:AFE3: F1        .byte $F1
- D - I - - 0x02AFF4 14:AFE4: 01        .byte $01   ; <あ>
- D - I - - 0x02AFF5 14:AFE5: 49        .byte $49   ; <ケ>
off_AFE6:
- D - I - - 0x02AFF6 14:AFE6: F1        .byte $F1
- D - I - - 0x02AFF7 14:AFE7: 01        .byte $01   ; <あ>
- D - I - - 0x02AFF8 14:AFE8: 4B        .byte $4B   ; <サ>
- D - I - - 0x02AFF9 14:AFE9: F1        .byte $F1
- D - I - - 0x02AFFA 14:AFEA: 01        .byte $01   ; <あ>
- D - I - - 0x02AFFB 14:AFEB: 4D        .byte $4D   ; <ス>
- D - I - - 0x02AFFC 14:AFEC: F1        .byte $F1
- D - I - - 0x02AFFD 14:AFED: 01        .byte $01   ; <あ>
- D - I - - 0x02AFFE 14:AFEE: 4A        .byte $4A   ; <コ>
- D - I - - 0x02AFFF 14:AFEF: F1        .byte $F1
- D - I - - 0x02B000 14:AFF0: 01        .byte $01   ; <あ>
- D - I - - 0x02B001 14:AFF1: 4C        .byte $4C   ; <シ>
- D - I - - 0x02B002 14:AFF2: F1        .byte $F1
- D - I - - 0x02B003 14:AFF3: F7        .byte $F7
- D - I - - 0x02B004 14:AFF4: 49        .byte $49   ; <ケ>

off_AFF5_41:
- D - I - - 0x02B005 14:AFF5: F7        .byte $F7
- D - I - - 0x02B006 14:AFF6: 27        .byte $27   ; <ら>

off_AFF7_42:
- D - I - - 0x02B007 14:AFF7: F7        .byte $F7
- D - I - - 0x02B008 14:AFF8: 28        .byte $28   ; <り>

off_AFF9_43:
- - - - - - 0x02B009 14:AFF9: F3        .byte $F3
- - - - - - 0x02B00A 14:AFFA: E6 AF     .word off_AFE6

off_AFFC_44:
- D - I - - 0x02B00C 14:AFFC: F7        .byte $F7
- D - I - - 0x02B00D 14:AFFD: 29        .byte $29   ; <る>

off_AFFE_45:
off_AFFE:
- D - I - - 0x02B00E 14:AFFE: F1        .byte $F1
- D - I - - 0x02B00F 14:AFFF: 01        .byte $01   ; <あ>
- D - I - - 0x02B010 14:B000: 3F        .byte $3F   ; <•>
- D - I - - 0x02B011 14:B001: F1        .byte $F1
- D - I - - 0x02B012 14:B002: 01        .byte $01   ; <あ>
- D - I - - 0x02B013 14:B003: 40        .byte $40   ; <「>
- - - - - - 0x02B014 14:B004: F3        .byte $F3
- - - - - - 0x02B015 14:B005: FE AF     .word off_AFFE

off_B007_46:
off_B007:
- D - I - - 0x02B017 14:B007: 01        .byte $01   ; <あ>
- D - I - - 0x02B018 14:B008: 3F        .byte $3F   ; <•>
- D - I - - 0x02B019 14:B009: 01        .byte $01   ; <あ>
- D - I - - 0x02B01A 14:B00A: 40        .byte $40   ; <「>
- D - I - - 0x02B01B 14:B00B: F3        .byte $F3
- D - I - - 0x02B01C 14:B00C: 07 B0     .word off_B007

off_B00E_47:
off_B00E:
- D - I - - 0x02B01E 14:B00E: F1        .byte $F1
- D - I - - 0x02B01F 14:B00F: 01        .byte $01   ; <あ>
- D - I - - 0x02B020 14:B010: 1B        .byte $1B   ; <ひ>
- - - - - - 0x02B021 14:B011: F1        .byte $F1
- - - - - - 0x02B022 14:B012: 01        .byte $01   ; <あ>
- - - - - - 0x02B023 14:B013: 1C        .byte $1C   ; <ふ>
- - - - - - 0x02B024 14:B014: F3        .byte $F3
- - - - - - 0x02B025 14:B015: 0E B0     .word off_B00E

off_B017_48:
off_B017:
- D - I - - 0x02B027 14:B017: 01        .byte $01   ; <あ>
- D - I - - 0x02B028 14:B018: 1B        .byte $1B   ; <ひ>
- - - - - - 0x02B029 14:B019: 01        .byte $01   ; <あ>
- - - - - - 0x02B02A 14:B01A: 1C        .byte $1C   ; <ふ>
- - - - - - 0x02B02B 14:B01B: F3        .byte $F3
- - - - - - 0x02B02C 14:B01C: 17 B0     .word off_B017

off_B01E_49:
off_B01E:
- D - I - - 0x02B02E 14:B01E: 01        .byte $01   ; <あ>
- D - I - - 0x02B02F 14:B01F: CA        .byte $CA   ; <ぷ>
- D - I - - 0x02B030 14:B020: F2        .byte $F2
- D - I - - 0x02B031 14:B021: 01        .byte $01   ; <あ>
- D - I - - 0x02B032 14:B022: CA        .byte $CA   ; <ぷ>
- D - I - - 0x02B033 14:B023: F3        .byte $F3
- D - I - - 0x02B034 14:B024: 1E B0     .word off_B01E

off_B026_4A_4B:
off_B026:
- D - I - - 0x02B036 14:B026: 04        .byte $04   ; <え>
- D - I - - 0x02B037 14:B027: 00        .byte $00
off_B028:
- D - I - - 0x02B038 14:B028: 04        .byte $04   ; <え>
- D - I - - 0x02B039 14:B029: 01        .byte $01   ; <あ>
- D - I - - 0x02B03A 14:B02A: 04        .byte $04   ; <え>
- D - I - - 0x02B03B 14:B02B: 02        .byte $02   ; <い>
- D - I - - 0x02B03C 14:B02C: 04        .byte $04   ; <え>
- D - I - - 0x02B03D 14:B02D: 03        .byte $03   ; <う>
- D - I - - 0x02B03E 14:B02E: F3        .byte $F3
- D - I - - 0x02B03F 14:B02F: 26 B0     .word off_B026

off_B031_4C:
off_B031:
- D - I - - 0x02B041 14:B031: F1        .byte $F1
- D - I - - 0x02B042 14:B032: 04        .byte $04   ; <え>
- D - I - - 0x02B043 14:B033: 00        .byte $00
- D - I - - 0x02B044 14:B034: F1        .byte $F1
- D - I - - 0x02B045 14:B035: 04        .byte $04   ; <え>
- D - I - - 0x02B046 14:B036: 01        .byte $01   ; <あ>
- D - I - - 0x02B047 14:B037: F1        .byte $F1
- D - I - - 0x02B048 14:B038: 04        .byte $04   ; <え>
- D - I - - 0x02B049 14:B039: 02        .byte $02   ; <い>
off_B03A:
- D - I - - 0x02B04A 14:B03A: F1        .byte $F1
- D - I - - 0x02B04B 14:B03B: 04        .byte $04   ; <え>
- D - I - - 0x02B04C 14:B03C: 03        .byte $03   ; <う>
- D - I - - 0x02B04D 14:B03D: F3        .byte $F3
- D - I - - 0x02B04E 14:B03E: 31 B0     .word off_B031

off_B040_4D:
off_B040:
- D - I - - 0x02B050 14:B040: 04        .byte $04   ; <え>
- D - I - - 0x02B051 14:B041: 04        .byte $04   ; <え>
off_B042:
- D - I - - 0x02B052 14:B042: F1        .byte $F1
- D - I - - 0x02B053 14:B043: 04        .byte $04   ; <え>
- D - I - - 0x02B054 14:B044: 05        .byte $05   ; <お>
- D - I - - 0x02B055 14:B045: F1        .byte $F1
- D - I - - 0x02B056 14:B046: 04        .byte $04   ; <え>
- D - I - - 0x02B057 14:B047: 04        .byte $04   ; <え>
- D - I - - 0x02B058 14:B048: 04        .byte $04   ; <え>
- D - I - - 0x02B059 14:B049: 05        .byte $05   ; <お>
- D - I - - 0x02B05A 14:B04A: F3        .byte $F3
- D - I - - 0x02B05B 14:B04B: 40 B0     .word off_B040

off_B04D_4E:
off_B04D:
- D - I - - 0x02B05D 14:B04D: F1        .byte $F1
- D - I - - 0x02B05E 14:B04E: 04        .byte $04   ; <え>
- D - I - - 0x02B05F 14:B04F: 04        .byte $04   ; <え>
- D - I - - 0x02B060 14:B050: 04        .byte $04   ; <え>
- D - I - - 0x02B061 14:B051: 05        .byte $05   ; <お>
off_B052:
- D - I - - 0x02B062 14:B052: 04        .byte $04   ; <え>
- D - I - - 0x02B063 14:B053: 04        .byte $04   ; <え>
off_B054:
- D - I - - 0x02B064 14:B054: F1        .byte $F1
- D - I - - 0x02B065 14:B055: 04        .byte $04   ; <え>
- D - I - - 0x02B066 14:B056: 05        .byte $05   ; <お>
- D - I - - 0x02B067 14:B057: F3        .byte $F3
- D - I - - 0x02B068 14:B058: 4D B0     .word off_B04D

off_B05A_4F:
off_B05A:
- D - I - - 0x02B06A 14:B05A: 04        .byte $04   ; <え>
- D - I - - 0x02B06B 14:B05B: 06        .byte $06   ; <か>
off_B05C:
- D - I - - 0x02B06C 14:B05C: 04        .byte $04   ; <え>
- D - I - - 0x02B06D 14:B05D: 07        .byte $07   ; <き>
- D - I - - 0x02B06E 14:B05E: 04        .byte $04   ; <え>
- D - I - - 0x02B06F 14:B05F: 08        .byte $08   ; <く>
- D - I - - 0x02B070 14:B060: 04        .byte $04   ; <え>
- D - I - - 0x02B071 14:B061: 09        .byte $09   ; <け>
- D - I - - 0x02B072 14:B062: F3        .byte $F3
- D - I - - 0x02B073 14:B063: 5A B0     .word off_B05A

off_B065_50:
off_B065:
- D - I - - 0x02B075 14:B065: F1        .byte $F1
- D - I - - 0x02B076 14:B066: 04        .byte $04   ; <え>
- D - I - - 0x02B077 14:B067: 06        .byte $06   ; <か>
- D - I - - 0x02B078 14:B068: F1        .byte $F1
- D - I - - 0x02B079 14:B069: 04        .byte $04   ; <え>
- D - I - - 0x02B07A 14:B06A: 07        .byte $07   ; <き>
off_B06B:
- D - I - - 0x02B07B 14:B06B: F1        .byte $F1
- D - I - - 0x02B07C 14:B06C: 04        .byte $04   ; <え>
- D - I - - 0x02B07D 14:B06D: 08        .byte $08   ; <く>
off_B06E:
- D - I - - 0x02B07E 14:B06E: F1        .byte $F1
- D - I - - 0x02B07F 14:B06F: 04        .byte $04   ; <え>
- D - I - - 0x02B080 14:B070: 09        .byte $09   ; <け>
- D - I - - 0x02B081 14:B071: F3        .byte $F3
- D - I - - 0x02B082 14:B072: 65 B0     .word off_B065

off_B074_51:
- D - I - - 0x02B084 14:B074: F7        .byte $F7
- D - I - - 0x02B085 14:B075: 23        .byte $23   ; <も>

off_B076_52:
- D - I - - 0x02B086 14:B076: F7        .byte $F7
- D - I - - 0x02B087 14:B077: 2B        .byte $2B   ; <ろ>

off_B078_53:
off_B078:
- D - I - - 0x02B088 14:B078: 01        .byte $01   ; <あ>
- D - I - - 0x02B089 14:B079: 21        .byte $21   ; <む>
- D - I - - 0x02B08A 14:B07A: 01        .byte $01   ; <あ>
- D - I - - 0x02B08B 14:B07B: 22        .byte $22   ; <め>
- D - I - - 0x02B08C 14:B07C: F3        .byte $F3
- D - I - - 0x02B08D 14:B07D: 78 B0     .word off_B078

off_B07F_54:
off_B07F:
- D - I - - 0x02B08F 14:B07F: 01        .byte $01   ; <あ>
- D - I - - 0x02B090 14:B080: 94        .byte $94
- D - I - - 0x02B091 14:B081: F1        .byte $F1
- D - I - - 0x02B092 14:B082: F6        .byte $F6
- D - I - - 0x02B093 14:B083: E0        .byte $E0
- D - I - - 0x02B094 14:B084: 00        .byte $00
- D - I - - 0x02B095 14:B085: 01        .byte $01   ; <あ>
- D - I - - 0x02B096 14:B086: 94        .byte $94
- D - I - - 0x02B097 14:B087: F3        .byte $F3
- D - I - - 0x02B098 14:B088: 7F B0     .word off_B07F

off_B08A_55:
- D - I - - 0x02B09A 14:B08A: F7        .byte $F7
- D - I - - 0x02B09B 14:B08B: D2        .byte $D2

off_B08C_56:
off_B08C:
- D - I - - 0x02B09C 14:B08C: F1        .byte $F1
- D - I - - 0x02B09D 14:B08D: 04        .byte $04   ; <え>
- D - I - - 0x02B09E 14:B08E: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B09F 14:B08F: F1        .byte $F1
- D - I - - 0x02B0A0 14:B090: 04        .byte $04   ; <え>
- D - I - - 0x02B0A1 14:B091: 0B        .byte $0B   ; <さ>
- D - I - - 0x02B0A2 14:B092: F1        .byte $F1
- D - I - - 0x02B0A3 14:B093: 04        .byte $04   ; <え>
- D - I - - 0x02B0A4 14:B094: 0C        .byte $0C   ; <し>
- D - I - - 0x02B0A5 14:B095: F1        .byte $F1
- D - I - - 0x02B0A6 14:B096: 04        .byte $04   ; <え>
- D - I - - 0x02B0A7 14:B097: 0D        .byte $0D   ; <す>
- D - I - - 0x02B0A8 14:B098: F3        .byte $F3
- D - I - - 0x02B0A9 14:B099: 8C B0     .word off_B08C

off_B09B_57:
- D - I - - 0x02B0AB 14:B09B: F7        .byte $F7
- D - I - - 0x02B0AC 14:B09C: B1        .byte $B1   ; <ぶ>

off_B09D_58:
off_B09D:
- D - I - - 0x02B0AD 14:B09D: 04        .byte $04   ; <え>
- D - I - - 0x02B0AE 14:B09E: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B0AF 14:B09F: 04        .byte $04   ; <え>
- D - I - - 0x02B0B0 14:B0A0: 0B        .byte $0B   ; <さ>
- D - I - - 0x02B0B1 14:B0A1: 04        .byte $04   ; <え>
- D - I - - 0x02B0B2 14:B0A2: 0C        .byte $0C   ; <し>
- D - I - - 0x02B0B3 14:B0A3: 04        .byte $04   ; <え>
- D - I - - 0x02B0B4 14:B0A4: 0D        .byte $0D   ; <す>
- D - I - - 0x02B0B5 14:B0A5: F3        .byte $F3
- D - I - - 0x02B0B6 14:B0A6: 9D B0     .word off_B09D

off_B0A8_59:
- D - I - - 0x02B0B8 14:B0A8: F3        .byte $F3
- D - I - - 0x02B0B9 14:B0A9: 3A B0     .word off_B03A

off_B0AB_5A:
- D - I - - 0x02B0BB 14:B0AB: F3        .byte $F3
- D - I - - 0x02B0BC 14:B0AC: 54 B0     .word off_B054

off_B0AE_5B:
- D - I - - 0x02B0BE 14:B0AE: F3        .byte $F3
- D - I - - 0x02B0BF 14:B0AF: 6E B0     .word off_B06E

off_B0B1_5C:
- D - I - - 0x02B0C1 14:B0B1: F3        .byte $F3
- D - I - - 0x02B0C2 14:B0B2: 28 B0     .word off_B028

off_B0B4_5D:
- D - I - - 0x02B0C4 14:B0B4: F3        .byte $F3
- D - I - - 0x02B0C5 14:B0B5: 42 B0     .word off_B042

off_B0B7_5E:
- D - I - - 0x02B0C7 14:B0B7: F3        .byte $F3
- D - I - - 0x02B0C8 14:B0B8: 5C B0     .word off_B05C

off_B0BA_5F:
- D - I - - 0x02B0CA 14:B0BA: F7        .byte $F7
- D - I - - 0x02B0CB 14:B0BB: 2A        .byte $2A   ; <れ>

off_B0BC_60:
- D - I - - 0x02B0CC 14:B0BC: F7        .byte $F7
- D - I - - 0x02B0CD 14:B0BD: 95        .byte $95

off_B0BE_61:
- D - I - - 0x02B0CE 14:B0BE: F7        .byte $F7
- D - I - - 0x02B0CF 14:B0BF: 96        .byte $96

off_B0C0_62:
- D - I - - 0x02B0D0 14:B0C0: F7        .byte $F7
- D - I - - 0x02B0D1 14:B0C1: 97        .byte $97

off_B0C2_63:
- D - I - - 0x02B0D2 14:B0C2: F7        .byte $F7
- D - I - - 0x02B0D3 14:B0C3: 7E        .byte $7E   ; <.>

off_B0C4_64:
- D - I - - 0x02B0D4 14:B0C4: F7        .byte $F7
- D - I - - 0x02B0D5 14:B0C5: 6B        .byte $6B   ; <ロ>

off_B0C6_65:
- D - I - - 0x02B0D6 14:B0C6: F7        .byte $F7
- D - I - - 0x02B0D7 14:B0C7: 6C        .byte $6C   ; <ワ>

off_B0C8_66:
- D - I - - 0x02B0D8 14:B0C8: 02        .byte $02   ; <い>
- D - I - - 0x02B0D9 14:B0C9: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x02B0DA 14:B0CA: F0        .byte $F0

off_B0CB_67:
- D - I - - 0x02B0DB 14:B0CB: 02        .byte $02   ; <い>
- D - I - - 0x02B0DC 14:B0CC: 6E        .byte $6E   ; <ン>
- D - I - - 0x02B0DD 14:B0CD: F0        .byte $F0

off_B0CE_68:
- D - I - - 0x02B0DE 14:B0CE: 03        .byte $03   ; <う>
- D - I - - 0x02B0DF 14:B0CF: 6F        .byte $6F   ; <ッ>
- - - - - - 0x02B0E0 14:B0D0: F7        .byte $F7
- - - - - - 0x02B0E1 14:B0D1: C8        .byte $C8   ; <ぱ>

off_B0D2_69:
off_B0D2:
- D - I - - 0x02B0E2 14:B0D2: F8        .byte $F8
- D - I - - 0x02B0E3 14:B0D3: 00        .byte $00
- D - I - - 0x02B0E4 14:B0D4: 01        .byte $01   ; <あ>
- D - I - - 0x02B0E5 14:B0D5: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B0E6 14:B0D6: F8        .byte $F8
- D - I - - 0x02B0E7 14:B0D7: 02        .byte $02   ; <い>
- D - I - - 0x02B0E8 14:B0D8: F1        .byte $F1
- D - I - - 0x02B0E9 14:B0D9: 01        .byte $01   ; <あ>
- D - I - - 0x02B0EA 14:B0DA: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B0EB 14:B0DB: F3        .byte $F3
- D - I - - 0x02B0EC 14:B0DC: D2 B0     .word off_B0D2

off_B0DE_6A:
off_B0DE:
- D - I - - 0x02B0EE 14:B0DE: F8        .byte $F8
- D - I - - 0x02B0EF 14:B0DF: 01        .byte $01   ; <あ>
- D - I - - 0x02B0F0 14:B0E0: F1        .byte $F1
- D - I - - 0x02B0F1 14:B0E1: 01        .byte $01   ; <あ>
- D - I - - 0x02B0F2 14:B0E2: 1F        .byte $1F   ; <ま>
- D - I - - 0x02B0F3 14:B0E3: F6        .byte $F6
- D - I - - 0x02B0F4 14:B0E4: 00        .byte $00
- D - I - - 0x02B0F5 14:B0E5: 50        .byte $50   ; <タ>
- D - I - - 0x02B0F6 14:B0E6: 01        .byte $01   ; <あ>
- D - I - - 0x02B0F7 14:B0E7: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B0F8 14:B0E8: F3        .byte $F3
- D - I - - 0x02B0F9 14:B0E9: DE B0     .word off_B0DE

off_B0EB_6B:
off_B0EB:
- D - I - - 0x02B0FB 14:B0EB: F1        .byte $F1
- D - I - - 0x02B0FC 14:B0EC: 01        .byte $01   ; <あ>
- D - I - - 0x02B0FD 14:B0ED: 20        .byte $20   ; <み>
- D - I - - 0x02B0FE 14:B0EE: 01        .byte $01   ; <あ>
- D - I - - 0x02B0FF 14:B0EF: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B100 14:B0F0: F3        .byte $F3
- D - I - - 0x02B101 14:B0F1: EB B0     .word off_B0EB

off_B0F3_6C:
off_B0F3:
- D - I - - 0x02B103 14:B0F3: 02        .byte $02   ; <い>
- D - I - - 0x02B104 14:B0F4: 00        .byte $00
- D - I - - 0x02B105 14:B0F5: 02        .byte $02   ; <い>
- D - I - - 0x02B106 14:B0F6: 01        .byte $01   ; <あ>
- D - I - - 0x02B107 14:B0F7: 02        .byte $02   ; <い>
- D - I - - 0x02B108 14:B0F8: 02        .byte $02   ; <い>
- D - I - - 0x02B109 14:B0F9: 02        .byte $02   ; <い>
- D - I - - 0x02B10A 14:B0FA: 03        .byte $03   ; <う>
- D - I - - 0x02B10B 14:B0FB: F3        .byte $F3
- D - I - - 0x02B10C 14:B0FC: F3 B0     .word off_B0F3

off_B0FE_6D:
off_B0FE:
- D - I - - 0x02B10E 14:B0FE: 02        .byte $02   ; <い>
- D - I - - 0x02B10F 14:B0FF: 04        .byte $04   ; <え>
- D - I - - 0x02B110 14:B100: F1        .byte $F1
- D - I - - 0x02B111 14:B101: 02        .byte $02   ; <い>
- D - I - - 0x02B112 14:B102: 05        .byte $05   ; <お>
- D - I - - 0x02B113 14:B103: F1        .byte $F1
- D - I - - 0x02B114 14:B104: 02        .byte $02   ; <い>
- D - I - - 0x02B115 14:B105: 04        .byte $04   ; <え>
- D - I - - 0x02B116 14:B106: 02        .byte $02   ; <い>
- D - I - - 0x02B117 14:B107: 05        .byte $05   ; <お>
- D - I - - 0x02B118 14:B108: F3        .byte $F3
- D - I - - 0x02B119 14:B109: FE B0     .word off_B0FE

off_B10B_6E:
off_B10B:
- D - I - - 0x02B11B 14:B10B: 02        .byte $02   ; <い>
- D - I - - 0x02B11C 14:B10C: 06        .byte $06   ; <か>
- D - I - - 0x02B11D 14:B10D: 02        .byte $02   ; <い>
- D - I - - 0x02B11E 14:B10E: 07        .byte $07   ; <き>
- D - I - - 0x02B11F 14:B10F: 02        .byte $02   ; <い>
- D - I - - 0x02B120 14:B110: 08        .byte $08   ; <く>
- D - I - - 0x02B121 14:B111: 02        .byte $02   ; <い>
- D - I - - 0x02B122 14:B112: 09        .byte $09   ; <け>
- D - I - - 0x02B123 14:B113: F3        .byte $F3
- D - I - - 0x02B124 14:B114: 0B B1     .word off_B10B

off_B116_6F:
off_B116:
- D - I - - 0x02B126 14:B116: 02        .byte $02   ; <い>
- D - I - - 0x02B127 14:B117: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B128 14:B118: 02        .byte $02   ; <い>
- D - I - - 0x02B129 14:B119: 0B        .byte $0B   ; <さ>
- D - I - - 0x02B12A 14:B11A: 02        .byte $02   ; <い>
- D - I - - 0x02B12B 14:B11B: 0C        .byte $0C   ; <し>
- D - I - - 0x02B12C 14:B11C: 02        .byte $02   ; <い>
- D - I - - 0x02B12D 14:B11D: 0D        .byte $0D   ; <す>
- D - I - - 0x02B12E 14:B11E: F3        .byte $F3
- D - I - - 0x02B12F 14:B11F: 16 B1     .word off_B116

off_B121_70:
- D - I - - 0x02B131 14:B121: F4        .byte $F4
- D - I - - 0x02B132 14:B122: 0D        .byte $0D   ; <す>
- D - I - - 0x02B133 14:B123: 01        .byte $01   ; <あ>
- D - I - - 0x02B134 14:B124: 41        .byte $41   ; <ア>
- D - I - - 0x02B135 14:B125: 01        .byte $01   ; <あ>
- D - I - - 0x02B136 14:B126: 41        .byte $41   ; <ア>
- D - I - - 0x02B137 14:B127: 01        .byte $01   ; <あ>
- D - I - - 0x02B138 14:B128: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B139 14:B129: 01        .byte $01   ; <あ>
- D - I - - 0x02B13A 14:B12A: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B13B 14:B12B: 01        .byte $01   ; <あ>
- D - I - - 0x02B13C 14:B12C: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B13D 14:B12D: 01        .byte $01   ; <あ>
- D - I - - 0x02B13E 14:B12E: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B13F 14:B12F: F5        .byte $F5
off_B130:
- D - I - - 0x02B140 14:B130: 02        .byte $02   ; <い>
- D - I - - 0x02B141 14:B131: 41        .byte $41   ; <ア>
- D - I - - 0x02B142 14:B132: F6        .byte $F6
- D - I - - 0x02B143 14:B133: F0        .byte $F0
- D - I - - 0x02B144 14:B134: 00        .byte $00
- D - I - - 0x02B145 14:B135: 01        .byte $01   ; <あ>
- D - I - - 0x02B146 14:B136: 41        .byte $41   ; <ア>
- D - I - - 0x02B147 14:B137: F6        .byte $F6
- D - I - - 0x02B148 14:B138: 10        .byte $10   ; <た>
- D - I - - 0x02B149 14:B139: 00        .byte $00
- D - I - - 0x02B14A 14:B13A: 01        .byte $01   ; <あ>
- D - I - - 0x02B14B 14:B13B: 41        .byte $41   ; <ア>
- D - I - - 0x02B14C 14:B13C: F6        .byte $F6
- D - I - - 0x02B14D 14:B13D: 50        .byte $50   ; <タ>
- D - I - - 0x02B14E 14:B13E: 00        .byte $00
- D - I - - 0x02B14F 14:B13F: 01        .byte $01   ; <あ>
- D - I - - 0x02B150 14:B140: 41        .byte $41   ; <ア>
- D - I - - 0x02B151 14:B141: F6        .byte $F6
- D - I - - 0x02B152 14:B142: 28        .byte $28   ; <り>
- D - I - - 0x02B153 14:B143: 20        .byte $20   ; <み>
- D - I - - 0x02B154 14:B144: 01        .byte $01   ; <あ>
- D - I - - 0x02B155 14:B145: 41        .byte $41   ; <ア>
- D - I - - 0x02B156 14:B146: F6        .byte $F6
- D - I - - 0x02B157 14:B147: E0        .byte $E0
- D - I - - 0x02B158 14:B148: E0        .byte $E0
- D - I - - 0x02B159 14:B149: 01        .byte $01   ; <あ>
- D - I - - 0x02B15A 14:B14A: 41        .byte $41   ; <ア>
- D - I - - 0x02B15B 14:B14B: F6        .byte $F6
- D - I - - 0x02B15C 14:B14C: B0        .byte $B0   ; <び>
- D - I - - 0x02B15D 14:B14D: 00        .byte $00
- D - I - - 0x02B15E 14:B14E: 01        .byte $01   ; <あ>
- D - I - - 0x02B15F 14:B14F: 41        .byte $41   ; <ア>
off_B150:
- D - I - - 0x02B160 14:B150: F6        .byte $F6
- D - I - - 0x02B161 14:B151: D0        .byte $D0   ; <ペ>
- D - I - - 0x02B162 14:B152: 20        .byte $20   ; <み>
- D - I - - 0x02B163 14:B153: 01        .byte $01   ; <あ>
- D - I - - 0x02B164 14:B154: 41        .byte $41   ; <ア>
- D - I - - 0x02B165 14:B155: F6        .byte $F6
- D - I - - 0x02B166 14:B156: 20        .byte $20   ; <み>
- D - I - - 0x02B167 14:B157: E0        .byte $E0
- D - I - - 0x02B168 14:B158: 01        .byte $01   ; <あ>
- D - I - - 0x02B169 14:B159: 41        .byte $41   ; <ア>
- D - I - - 0x02B16A 14:B15A: F3        .byte $F3
- D - I - - 0x02B16B 14:B15B: 30 B1     .word off_B130

off_B15D_71:
- D - I - - 0x02B16D 14:B15D: 03        .byte $03   ; <う>
- D - I - - 0x02B16E 14:B15E: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B16F 14:B15F: F6        .byte $F6
- D - I - - 0x02B170 14:B160: 01        .byte $01   ; <あ>
- D - I - - 0x02B171 14:B161: FF        .byte $FF
- D - I - - 0x02B172 14:B162: 01        .byte $01   ; <あ>
- D - I - - 0x02B173 14:B163: 7C        .byte $7C   ; <~>
- D - I - - 0x02B174 14:B164: F6        .byte $F6
- D - I - - 0x02B175 14:B165: FF        .byte $FF
- D - I - - 0x02B176 14:B166: 01        .byte $01   ; <あ>
- D - I - - 0x02B177 14:B167: 01        .byte $01   ; <あ>
- D - I - - 0x02B178 14:B168: 7B        .byte $7B   ; <。>
- D - I - - 0x02B179 14:B169: F6        .byte $F6
- D - I - - 0x02B17A 14:B16A: FF        .byte $FF
- D - I - - 0x02B17B 14:B16B: FF        .byte $FF
- D - I - - 0x02B17C 14:B16C: 01        .byte $01   ; <あ>
- D - I - - 0x02B17D 14:B16D: 7A        .byte $7A   ; <、>
- D - I - - 0x02B17E 14:B16E: F6        .byte $F6
- D - I - - 0x02B17F 14:B16F: 01        .byte $01   ; <あ>
- D - I - - 0x02B180 14:B170: 01        .byte $01   ; <あ>
- D - I - - 0x02B181 14:B171: 01        .byte $01   ; <あ>
- D - I - - 0x02B182 14:B172: 79        .byte $79   ; <!>
- D - I - - 0x02B183 14:B173: F6        .byte $F6
- D - I - - 0x02B184 14:B174: FE        .byte $FE
- D - I - - 0x02B185 14:B175: 02        .byte $02   ; <い>
- D - I - - 0x02B186 14:B176: 01        .byte $01   ; <あ>
- D - I - - 0x02B187 14:B177: 79        .byte $79   ; <!>
- D - I - - 0x02B188 14:B178: F6        .byte $F6
- D - I - - 0x02B189 14:B179: 03        .byte $03   ; <う>
- D - I - - 0x02B18A 14:B17A: FE        .byte $FE
- D - I - - 0x02B18B 14:B17B: 01        .byte $01   ; <あ>
- D - I - - 0x02B18C 14:B17C: 78        .byte $78   ; <?>
- D - I - - 0x02B18D 14:B17D: F6        .byte $F6
- D - I - - 0x02B18E 14:B17E: 02        .byte $02   ; <い>
- D - I - - 0x02B18F 14:B17F: 02        .byte $02   ; <い>
- D - I - - 0x02B190 14:B180: 01        .byte $01   ; <あ>
- D - I - - 0x02B191 14:B181: 78        .byte $78   ; <?>
- D - I - - 0x02B192 14:B182: F6        .byte $F6
- D - I - - 0x02B193 14:B183: FE        .byte $FE
- D - I - - 0x02B194 14:B184: FE        .byte $FE
- D - I - - 0x02B195 14:B185: 01        .byte $01   ; <あ>
- D - I - - 0x02B196 14:B186: 78        .byte $78   ; <?>
- D - I - - 0x02B197 14:B187: F6        .byte $F6
- D - I - - 0x02B198 14:B188: 04        .byte $04   ; <え>
- D - I - - 0x02B199 14:B189: FC        .byte $FC
- D - I - - 0x02B19A 14:B18A: 01        .byte $01   ; <あ>
- D - I - - 0x02B19B 14:B18B: 77        .byte $77   ; <:>
- D - I - - 0x02B19C 14:B18C: F6        .byte $F6
- D - I - - 0x02B19D 14:B18D: FC        .byte $FC
- D - I - - 0x02B19E 14:B18E: 05        .byte $05   ; <お>
- D - I - - 0x02B19F 14:B18F: 01        .byte $01   ; <あ>
- D - I - - 0x02B1A0 14:B190: 77        .byte $77   ; <:>
- D - I - - 0x02B1A1 14:B191: F6        .byte $F6
- D - I - - 0x02B1A2 14:B192: FC        .byte $FC
- D - I - - 0x02B1A3 14:B193: FC        .byte $FC
- D - I - - 0x02B1A4 14:B194: 01        .byte $01   ; <あ>
- D - I - - 0x02B1A5 14:B195: 77        .byte $77   ; <:>
- D - I - - 0x02B1A6 14:B196: F6        .byte $F6
- D - I - - 0x02B1A7 14:B197: 06        .byte $06   ; <か>
- D - I - - 0x02B1A8 14:B198: 08        .byte $08   ; <く>
- D - I - - 0x02B1A9 14:B199: 01        .byte $01   ; <あ>
- D - I - - 0x02B1AA 14:B19A: 76        .byte $76   ; <ォ>
- D - I - - 0x02B1AB 14:B19B: F6        .byte $F6
- D - I - - 0x02B1AC 14:B19C: FA        .byte $FA
- D - I - - 0x02B1AD 14:B19D: 06        .byte $06   ; <か>
- D - I - - 0x02B1AE 14:B19E: 01        .byte $01   ; <あ>
- D - I - - 0x02B1AF 14:B19F: 76        .byte $76   ; <ォ>
- D - I - - 0x02B1B0 14:B1A0: F6        .byte $F6
- D - I - - 0x02B1B1 14:B1A1: 07        .byte $07   ; <き>
- D - I - - 0x02B1B2 14:B1A2: FA        .byte $FA
- D - I - - 0x02B1B3 14:B1A3: 01        .byte $01   ; <あ>
- D - I - - 0x02B1B4 14:B1A4: 76        .byte $76   ; <ォ>
- D - I - - 0x02B1B5 14:B1A5: F6        .byte $F6
- D - I - - 0x02B1B6 14:B1A6: 08        .byte $08   ; <く>
- D - I - - 0x02B1B7 14:B1A7: 08        .byte $08   ; <く>
- D - I - - 0x02B1B8 14:B1A8: 01        .byte $01   ; <あ>
- D - I - - 0x02B1B9 14:B1A9: 75        .byte $75   ; <ェ>
- D - I - - 0x02B1BA 14:B1AA: F6        .byte $F6
- D - I - - 0x02B1BB 14:B1AB: F8        .byte $F8
- D - I - - 0x02B1BC 14:B1AC: F8        .byte $F8
- D - I - - 0x02B1BD 14:B1AD: 01        .byte $01   ; <あ>
- D - I - - 0x02B1BE 14:B1AE: 75        .byte $75   ; <ェ>
- D - I - - 0x02B1BF 14:B1AF: F6        .byte $F6
- D - I - - 0x02B1C0 14:B1B0: 00        .byte $00
- D - I - - 0x02B1C1 14:B1B1: F8        .byte $F8
- D - I - - 0x02B1C2 14:B1B2: 01        .byte $01   ; <あ>
- D - I - - 0x02B1C3 14:B1B3: 75        .byte $75   ; <ェ>
- D - I - - 0x02B1C4 14:B1B4: F6        .byte $F6
- D - I - - 0x02B1C5 14:B1B5: 10        .byte $10   ; <た>
- D - I - - 0x02B1C6 14:B1B6: FE        .byte $FE
- D - I - - 0x02B1C7 14:B1B7: 01        .byte $01   ; <あ>
- D - I - - 0x02B1C8 14:B1B8: 74        .byte $74   ; <ィ>
- D - I - - 0x02B1C9 14:B1B9: F6        .byte $F6
- D - I - - 0x02B1CA 14:B1BA: EC        .byte $EC
- D - I - - 0x02B1CB 14:B1BB: 00        .byte $00
- D - I - - 0x02B1CC 14:B1BC: 01        .byte $01   ; <あ>
- D - I - - 0x02B1CD 14:B1BD: 74        .byte $74   ; <ィ>
- D - I - - 0x02B1CE 14:B1BE: F6        .byte $F6
- D - I - - 0x02B1CF 14:B1BF: 00        .byte $00
- D - I - - 0x02B1D0 14:B1C0: 18        .byte $18   ; <ね>
- D - I - - 0x02B1D1 14:B1C1: 01        .byte $01   ; <あ>
- D - I - - 0x02B1D2 14:B1C2: 74        .byte $74   ; <ィ>
- D - I - - 0x02B1D3 14:B1C3: F6        .byte $F6
- D - I - - 0x02B1D4 14:B1C4: E8        .byte $E8
- D - I - - 0x02B1D5 14:B1C5: 1C        .byte $1C   ; <ふ>
- D - I - - 0x02B1D6 14:B1C6: 01        .byte $01   ; <あ>
- D - I - - 0x02B1D7 14:B1C7: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B1D8 14:B1C8: F6        .byte $F6
- D - I - - 0x02B1D9 14:B1C9: 18        .byte $18   ; <ね>
- D - I - - 0x02B1DA 14:B1CA: E8        .byte $E8
- D - I - - 0x02B1DB 14:B1CB: 01        .byte $01   ; <あ>
- D - I - - 0x02B1DC 14:B1CC: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B1DD 14:B1CD: F6        .byte $F6
- D - I - - 0x02B1DE 14:B1CE: 1B        .byte $1B   ; <ひ>
- D - I - - 0x02B1DF 14:B1CF: 18        .byte $18   ; <ね>
- D - I - - 0x02B1E0 14:B1D0: 01        .byte $01   ; <あ>
- D - I - - 0x02B1E1 14:B1D1: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B1E2 14:B1D2: 01        .byte $01   ; <あ>
- D - I - - 0x02B1E3 14:B1D3: 73        .byte $73   ; <ヮ>
off_B1D4:
- D - I - - 0x02B1E4 14:B1D4: F6        .byte $F6
- D - I - - 0x02B1E5 14:B1D5: 00        .byte $00
- D - I - - 0x02B1E6 14:B1D6: E0        .byte $E0
- D - I - - 0x02B1E7 14:B1D7: 01        .byte $01   ; <あ>
- D - I - - 0x02B1E8 14:B1D8: 72        .byte $72   ; <ョ>
- D - I - - 0x02B1E9 14:B1D9: F6        .byte $F6
- D - I - - 0x02B1EA 14:B1DA: D8        .byte $D8
- D - I - - 0x02B1EB 14:B1DB: 14        .byte $14   ; <と>
- D - I - - 0x02B1EC 14:B1DC: 01        .byte $01   ; <あ>
- D - I - - 0x02B1ED 14:B1DD: 71        .byte $71   ; <ュ>
- D - I - - 0x02B1EE 14:B1DE: F6        .byte $F6
- D - I - - 0x02B1EF 14:B1DF: E8        .byte $E8
- D - I - - 0x02B1F0 14:B1E0: E0        .byte $E0
- D - I - - 0x02B1F1 14:B1E1: 01        .byte $01   ; <あ>
- D - I - - 0x02B1F2 14:B1E2: 72        .byte $72   ; <ョ>
- D - I - - 0x02B1F3 14:B1E3: F6        .byte $F6
- D - I - - 0x02B1F4 14:B1E4: 02        .byte $02   ; <い>
- D - I - - 0x02B1F5 14:B1E5: D8        .byte $D8
- D - I - - 0x02B1F6 14:B1E6: 01        .byte $01   ; <あ>
- D - I - - 0x02B1F7 14:B1E7: 71        .byte $71   ; <ュ>
- D - I - - 0x02B1F8 14:B1E8: F6        .byte $F6
- D - I - - 0x02B1F9 14:B1E9: 00        .byte $00
- D - I - - 0x02B1FA 14:B1EA: 20        .byte $20   ; <み>
- D - I - - 0x02B1FB 14:B1EB: 01        .byte $01   ; <あ>
- D - I - - 0x02B1FC 14:B1EC: 72        .byte $72   ; <ョ>
- D - I - - 0x02B1FD 14:B1ED: F6        .byte $F6
- D - I - - 0x02B1FE 14:B1EE: 28        .byte $28   ; <り>
- D - I - - 0x02B1FF 14:B1EF: 10        .byte $10   ; <た>
- D - I - - 0x02B200 14:B1F0: 01        .byte $01   ; <あ>
- D - I - - 0x02B201 14:B1F1: 71        .byte $71   ; <ュ>
- D - I - - 0x02B202 14:B1F2: F6        .byte $F6
- D - I - - 0x02B203 14:B1F3: 20        .byte $20   ; <み>
- D - I - - 0x02B204 14:B1F4: F0        .byte $F0
- D - I - - 0x02B205 14:B1F5: 01        .byte $01   ; <あ>
- D - I - - 0x02B206 14:B1F6: 72        .byte $72   ; <ョ>
- D - I - - 0x02B207 14:B1F7: F6        .byte $F6
- D - I - - 0x02B208 14:B1F8: D8        .byte $D8
- D - I - - 0x02B209 14:B1F9: E0        .byte $E0
- D - I - - 0x02B20A 14:B1FA: 01        .byte $01   ; <あ>
- D - I - - 0x02B20B 14:B1FB: 71        .byte $71   ; <ュ>
- D - I - - 0x02B20C 14:B1FC: F6        .byte $F6
- D - I - - 0x02B20D 14:B1FD: E0        .byte $E0
- D - I - - 0x02B20E 14:B1FE: FD        .byte $FD
- D - I - - 0x02B20F 14:B1FF: 01        .byte $01   ; <あ>
- D - I - - 0x02B210 14:B200: 72        .byte $72   ; <ョ>
- D - I - - 0x02B211 14:B201: F6        .byte $F6
- D - I - - 0x02B212 14:B202: 10        .byte $10   ; <た>
- D - I - - 0x02B213 14:B203: 28        .byte $28   ; <り>
- D - I - - 0x02B214 14:B204: 01        .byte $01   ; <あ>
- D - I - - 0x02B215 14:B205: 71        .byte $71   ; <ュ>
- D - I - - 0x02B216 14:B206: F6        .byte $F6
- D - I - - 0x02B217 14:B207: 40        .byte $40   ; <「>
- D - I - - 0x02B218 14:B208: 03        .byte $03   ; <う>
- D - I - - 0x02B219 14:B209: 01        .byte $01   ; <あ>
- D - I - - 0x02B21A 14:B20A: 71        .byte $71   ; <ュ>
- D - I - - 0x02B21B 14:B20B: F3        .byte $F3
- D - I - - 0x02B21C 14:B20C: D4 B1     .word off_B1D4

off_B20E_72:
- D - I - - 0x02B21E 14:B20E: 03        .byte $03   ; <う>
- D - I - - 0x02B21F 14:B20F: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B220 14:B210: F6        .byte $F6
- D - I - - 0x02B221 14:B211: 01        .byte $01   ; <あ>
- D - I - - 0x02B222 14:B212: FF        .byte $FF
- D - I - - 0x02B223 14:B213: 01        .byte $01   ; <あ>
- D - I - - 0x02B224 14:B214: 7C        .byte $7C   ; <~>
- D - I - - 0x02B225 14:B215: F6        .byte $F6
- D - I - - 0x02B226 14:B216: FE        .byte $FE
- D - I - - 0x02B227 14:B217: 02        .byte $02   ; <い>
- D - I - - 0x02B228 14:B218: 01        .byte $01   ; <あ>
- D - I - - 0x02B229 14:B219: 7B        .byte $7B   ; <。>
- D - I - - 0x02B22A 14:B21A: F6        .byte $F6
- D - I - - 0x02B22B 14:B21B: FE        .byte $FE
- D - I - - 0x02B22C 14:B21C: FE        .byte $FE
- D - I - - 0x02B22D 14:B21D: 01        .byte $01   ; <あ>
- D - I - - 0x02B22E 14:B21E: 7A        .byte $7A   ; <、>
- D - I - - 0x02B22F 14:B21F: F6        .byte $F6
- D - I - - 0x02B230 14:B220: 04        .byte $04   ; <え>
- D - I - - 0x02B231 14:B221: 04        .byte $04   ; <え>
- D - I - - 0x02B232 14:B222: 01        .byte $01   ; <あ>
- D - I - - 0x02B233 14:B223: 79        .byte $79   ; <!>
- D - I - - 0x02B234 14:B224: F6        .byte $F6
- D - I - - 0x02B235 14:B225: FC        .byte $FC
- D - I - - 0x02B236 14:B226: 04        .byte $04   ; <え>
- D - I - - 0x02B237 14:B227: 01        .byte $01   ; <あ>
- D - I - - 0x02B238 14:B228: 78        .byte $78   ; <?>
- D - I - - 0x02B239 14:B229: F6        .byte $F6
- D - I - - 0x02B23A 14:B22A: 06        .byte $06   ; <か>
- D - I - - 0x02B23B 14:B22B: FA        .byte $FA
- D - I - - 0x02B23C 14:B22C: 01        .byte $01   ; <あ>
- D - I - - 0x02B23D 14:B22D: 77        .byte $77   ; <:>
- D - I - - 0x02B23E 14:B22E: F6        .byte $F6
- D - I - - 0x02B23F 14:B22F: 06        .byte $06   ; <か>
- D - I - - 0x02B240 14:B230: 06        .byte $06   ; <か>
- D - I - - 0x02B241 14:B231: 01        .byte $01   ; <あ>
- D - I - - 0x02B242 14:B232: 76        .byte $76   ; <ォ>
- D - I - - 0x02B243 14:B233: F6        .byte $F6
- D - I - - 0x02B244 14:B234: F8        .byte $F8
- D - I - - 0x02B245 14:B235: F8        .byte $F8
- D - I - - 0x02B246 14:B236: 01        .byte $01   ; <あ>
- D - I - - 0x02B247 14:B237: 76        .byte $76   ; <ォ>
- D - I - - 0x02B248 14:B238: F6        .byte $F6
- D - I - - 0x02B249 14:B239: 08        .byte $08   ; <く>
- D - I - - 0x02B24A 14:B23A: F8        .byte $F8
- D - I - - 0x02B24B 14:B23B: 01        .byte $01   ; <あ>
- D - I - - 0x02B24C 14:B23C: 75        .byte $75   ; <ェ>
- D - I - - 0x02B24D 14:B23D: F6        .byte $F6
- D - I - - 0x02B24E 14:B23E: F4        .byte $F4
- D - I - - 0x02B24F 14:B23F: 0C        .byte $0C   ; <し>
- D - I - - 0x02B250 14:B240: 01        .byte $01   ; <あ>
- D - I - - 0x02B251 14:B241: 75        .byte $75   ; <ェ>
- D - I - - 0x02B252 14:B242: F6        .byte $F6
- D - I - - 0x02B253 14:B243: F4        .byte $F4
- D - I - - 0x02B254 14:B244: F4        .byte $F4
- D - I - - 0x02B255 14:B245: 01        .byte $01   ; <あ>
- D - I - - 0x02B256 14:B246: 74        .byte $74   ; <ィ>
- D - I - - 0x02B257 14:B247: F6        .byte $F6
- D - I - - 0x02B258 14:B248: 10        .byte $10   ; <た>
- D - I - - 0x02B259 14:B249: 10        .byte $10   ; <た>
- D - I - - 0x02B25A 14:B24A: 01        .byte $01   ; <あ>
- D - I - - 0x02B25B 14:B24B: 74        .byte $74   ; <ィ>
- D - I - - 0x02B25C 14:B24C: F6        .byte $F6
- D - I - - 0x02B25D 14:B24D: F0        .byte $F0
- D - I - - 0x02B25E 14:B24E: 10        .byte $10   ; <た>
- D - I - - 0x02B25F 14:B24F: 01        .byte $01   ; <あ>
- D - I - - 0x02B260 14:B250: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B261 14:B251: F6        .byte $F6
- D - I - - 0x02B262 14:B252: 18        .byte $18   ; <ね>
- D - I - - 0x02B263 14:B253: E8        .byte $E8
- D - I - - 0x02B264 14:B254: 01        .byte $01   ; <あ>
- D - I - - 0x02B265 14:B255: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B266 14:B256: F6        .byte $F6
- D - I - - 0x02B267 14:B257: 18        .byte $18   ; <ね>
- D - I - - 0x02B268 14:B258: 18        .byte $18   ; <ね>
- D - I - - 0x02B269 14:B259: 01        .byte $01   ; <あ>
- D - I - - 0x02B26A 14:B25A: 72        .byte $72   ; <ョ>
- D - I - - 0x02B26B 14:B25B: F6        .byte $F6
- D - I - - 0x02B26C 14:B25C: E0        .byte $E0
- D - I - - 0x02B26D 14:B25D: E0        .byte $E0
- D - I - - 0x02B26E 14:B25E: 01        .byte $01   ; <あ>
- D - I - - 0x02B26F 14:B25F: 72        .byte $72   ; <ョ>
- D - I - - 0x02B270 14:B260: F6        .byte $F6
- D - I - - 0x02B271 14:B261: 20        .byte $20   ; <み>
- D - I - - 0x02B272 14:B262: E0        .byte $E0
- D - I - - 0x02B273 14:B263: 01        .byte $01   ; <あ>
- D - I - - 0x02B274 14:B264: 72        .byte $72   ; <ョ>
- D - I - - 0x02B275 14:B265: F6        .byte $F6
- D - I - - 0x02B276 14:B266: 28        .byte $28   ; <り>
- D - I - - 0x02B277 14:B267: 28        .byte $28   ; <り>
- D - I - - 0x02B278 14:B268: 01        .byte $01   ; <あ>
- D - I - - 0x02B279 14:B269: 71        .byte $71   ; <ュ>
- D - I - - 0x02B27A 14:B26A: F6        .byte $F6
- D - I - - 0x02B27B 14:B26B: 00        .byte $00
- D - I - - 0x02B27C 14:B26C: D8        .byte $D8
- D - I - - 0x02B27D 14:B26D: 01        .byte $01   ; <あ>
- D - I - - 0x02B27E 14:B26E: 71        .byte $71   ; <ュ>
- D - I - - 0x02B27F 14:B26F: F6        .byte $F6
- D - I - - 0x02B280 14:B270: D8        .byte $D8
- D - I - - 0x02B281 14:B271: 28        .byte $28   ; <り>
- D - I - - 0x02B282 14:B272: 01        .byte $01   ; <あ>
- D - I - - 0x02B283 14:B273: 71        .byte $71   ; <ュ>
- D - I - - 0x02B284 14:B274: F3        .byte $F3
- D - I - - 0x02B285 14:B275: D4 B1     .word off_B1D4

off_B277_73:
- D - I - - 0x02B287 14:B277: F8        .byte $F8
- D - I - - 0x02B288 14:B278: 04        .byte $04   ; <え>
- D - I - - 0x02B289 14:B279: F3        .byte $F3
- D - I - - 0x02B28A 14:B27A: 78 AE     .word off_AE78

off_B27C_74:
- D - I - - 0x02B28C 14:B27C: F8        .byte $F8
- D - I - - 0x02B28D 14:B27D: 06        .byte $06   ; <か>
- D - I - - 0x02B28E 14:B27E: F3        .byte $F3
- D - I - - 0x02B28F 14:B27F: 07 B0     .word off_B007

off_B281_75:
- D - I - - 0x02B291 14:B281: F8        .byte $F8
- D - I - - 0x02B292 14:B282: 01        .byte $01   ; <あ>
- D - I - - 0x02B293 14:B283: F3        .byte $F3
- D - I - - 0x02B294 14:B284: 63 AF     .word off_AF63

off_B286_76:
- D - I - - 0x02B296 14:B286: F8        .byte $F8
- D - I - - 0x02B297 14:B287: 04        .byte $04   ; <え>
- D - I - - 0x02B298 14:B288: F3        .byte $F3
- D - I - - 0x02B299 14:B289: 63 AF     .word off_AF63

off_B28B_77:
- D - I - - 0x02B29B 14:B28B: F8        .byte $F8
- D - I - - 0x02B29C 14:B28C: 00        .byte $00
- D - I - - 0x02B29D 14:B28D: F3        .byte $F3
- D - I - - 0x02B29E 14:B28E: 63 AF     .word off_AF63

off_B290_78:
- D - I - - 0x02B2A0 14:B290: F7        .byte $F7
- D - I - - 0x02B2A1 14:B291: C0        .byte $C0   ; <ヅ>

off_B292_79:
- D - I - - 0x02B2A2 14:B292: F7        .byte $F7
- D - I - - 0x02B2A3 14:B293: C2        .byte $C2   ; <ド>

off_B294_7A:
- - - - - - 0x02B2A4 14:B294: F3        .byte $F3
- - - - - - 0x02B2A5 14:B295: 50 B1     .word off_B150

off_B297_7B:
off_B297:
- D - I - - 0x02B2A7 14:B297: F8        .byte $F8
- D - I - - 0x02B2A8 14:B298: 00        .byte $00
- D - I - - 0x02B2A9 14:B299: 01        .byte $01   ; <あ>
- D - I - - 0x02B2AA 14:B29A: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2AB 14:B29B: F8        .byte $F8
- D - I - - 0x02B2AC 14:B29C: 07        .byte $07   ; <き>
- D - I - - 0x02B2AD 14:B29D: F1        .byte $F1
- D - I - - 0x02B2AE 14:B29E: 01        .byte $01   ; <あ>
- D - I - - 0x02B2AF 14:B29F: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2B0 14:B2A0: F3        .byte $F3
- D - I - - 0x02B2B1 14:B2A1: 97 B2     .word off_B297

off_B2A3_7C:
off_B2A3:
- D - I - - 0x02B2B3 14:B2A3: F8        .byte $F8
- D - I - - 0x02B2B4 14:B2A4: 03        .byte $03   ; <う>
- D - I - - 0x02B2B5 14:B2A5: 01        .byte $01   ; <あ>
- D - I - - 0x02B2B6 14:B2A6: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2B7 14:B2A7: F8        .byte $F8
- D - I - - 0x02B2B8 14:B2A8: 03        .byte $03   ; <う>
- D - I - - 0x02B2B9 14:B2A9: F1        .byte $F1
- D - I - - 0x02B2BA 14:B2AA: 01        .byte $01   ; <あ>
- D - I - - 0x02B2BB 14:B2AB: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2BC 14:B2AC: F3        .byte $F3
- D - I - - 0x02B2BD 14:B2AD: A3 B2     .word off_B2A3

off_B2AF_7D:
off_B2AF:
- D - I - - 0x02B2BF 14:B2AF: F8        .byte $F8
- D - I - - 0x02B2C0 14:B2B0: 07        .byte $07   ; <き>
- D - I - - 0x02B2C1 14:B2B1: 01        .byte $01   ; <あ>
- D - I - - 0x02B2C2 14:B2B2: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2C3 14:B2B3: F8        .byte $F8
- D - I - - 0x02B2C4 14:B2B4: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B2C5 14:B2B5: F1        .byte $F1
- D - I - - 0x02B2C6 14:B2B6: 01        .byte $01   ; <あ>
- D - I - - 0x02B2C7 14:B2B7: 2C        .byte $2C   ; <わ>
- D - I - - 0x02B2C8 14:B2B8: F3        .byte $F3
- D - I - - 0x02B2C9 14:B2B9: AF B2     .word off_B2AF

off_B2BB_7E:
- D - I - - 0x02B2CB 14:B2BB: F8        .byte $F8
- D - I - - 0x02B2CC 14:B2BC: 01        .byte $01   ; <あ>
- D - I - - 0x02B2CD 14:B2BD: F3        .byte $F3
- D - I - - 0x02B2CE 14:B2BE: 63 AF     .word off_AF63

off_B2C0_7F:
off_B2C0:
- D - I - - 0x02B2D0 14:B2C0: F1        .byte $F1
- D - I - - 0x02B2D1 14:B2C1: 02        .byte $02   ; <い>
- D - I - - 0x02B2D2 14:B2C2: 43        .byte $43   ; <ウ>
- D - I - - 0x02B2D3 14:B2C3: F1        .byte $F1
- D - I - - 0x02B2D4 14:B2C4: 02        .byte $02   ; <い>
- D - I - - 0x02B2D5 14:B2C5: 44        .byte $44   ; <エ>
- D - I - - 0x02B2D6 14:B2C6: F1        .byte $F1
- D - I - - 0x02B2D7 14:B2C7: 02        .byte $02   ; <い>
- D - I - - 0x02B2D8 14:B2C8: 45        .byte $45   ; <オ>
- D - I - - 0x02B2D9 14:B2C9: F1        .byte $F1
- D - I - - 0x02B2DA 14:B2CA: 02        .byte $02   ; <い>
- D - I - - 0x02B2DB 14:B2CB: 46        .byte $46   ; <カ>
- - - - - - 0x02B2DC 14:B2CC: F3        .byte $F3
- - - - - - 0x02B2DD 14:B2CD: C0 B2     .word off_B2C0

off_B2CF_80:
- D - I - - 0x02B2DF 14:B2CF: F1        .byte $F1
- D - I - - 0x02B2E0 14:B2D0: F7        .byte $F7
- D - I - - 0x02B2E1 14:B2D1: 41        .byte $41   ; <ア>

off_B2D2_81:
- D - I - - 0x02B2E2 14:B2D2: F7        .byte $F7
- D - I - - 0x02B2E3 14:B2D3: 30        .byte $30   ; <ゃ>

off_B2D4_82:
- D - I - - 0x02B2E4 14:B2D4: E1        .byte $E1
- D - I - - 0x02B2E5 14:B2D5: C2        .byte $C2   ; <ド>
- D - I - - 0x02B2E6 14:B2D6: 30        .byte $30   ; <ゃ>
- D - I - - 0x02B2E7 14:B2D7: C2        .byte $C2   ; <ド>
- D - I - - 0x02B2E8 14:B2D8: F7        .byte $F7
- D - I - - 0x02B2E9 14:B2D9: C1        .byte $C1   ; <デ>

off_B2DA_83:
- D - I - - 0x02B2EA 14:B2DA: F1        .byte $F1
- D - I - - 0x02B2EB 14:B2DB: 06        .byte $06   ; <か>
- D - I - - 0x02B2EC 14:B2DC: A0        .byte $A0   ; <が>
- D - I - - 0x02B2ED 14:B2DD: F1        .byte $F1
- D - I - - 0x02B2EE 14:B2DE: F7        .byte $F7
- D - I - - 0x02B2EF 14:B2DF: A1        .byte $A1   ; <ぎ>

off_B2E0_84:
off_B2E0:
- D - I - - 0x02B2F0 14:B2E0: F1        .byte $F1
- D - I - - 0x02B2F1 14:B2E1: 01        .byte $01   ; <あ>
- D - I - - 0x02B2F2 14:B2E2: 10        .byte $10   ; <た>
- D - I - - 0x02B2F3 14:B2E3: F4        .byte $F4
- D - I - - 0x02B2F4 14:B2E4: 01        .byte $01   ; <あ>
- D - I - - 0x02B2F5 14:B2E5: F1        .byte $F1
- D - I - - 0x02B2F6 14:B2E6: 01        .byte $01   ; <あ>
- D - I - - 0x02B2F7 14:B2E7: 11        .byte $11   ; <ち>
- D - I - - 0x02B2F8 14:B2E8: F1        .byte $F1
- D - I - - 0x02B2F9 14:B2E9: 01        .byte $01   ; <あ>
- D - I - - 0x02B2FA 14:B2EA: 12        .byte $12   ; <つ>
- D - I - - 0x02B2FB 14:B2EB: F5        .byte $F5
- D - I - - 0x02B2FC 14:B2EC: F1        .byte $F1
- D - I - - 0x02B2FD 14:B2ED: F7        .byte $F7
- D - I - - 0x02B2FE 14:B2EE: 10        .byte $10   ; <た>

off_B2EF_85:
off_B2EF:
- D - I - - 0x02B2FF 14:B2EF: F1        .byte $F1
- D - I - - 0x02B300 14:B2F0: F7        .byte $F7
- D - I - - 0x02B301 14:B2F1: 0F        .byte $0F   ; <そ>

off_B2F2_86:
- D - I - - 0x02B302 14:B2F2: F1        .byte $F1
- D - I - - 0x02B303 14:B2F3: F7        .byte $F7
- D - I - - 0x02B304 14:B2F4: 13        .byte $13   ; <て>

off_B2F5_87:
- - - - - - 0x02B305 14:B2F5: F1        .byte $F1
- - - - - - 0x02B306 14:B2F6: F7        .byte $F7
- - - - - - 0x02B307 14:B2F7: 9E        .byte $9E

off_B2F8_88:
- - - - - - 0x02B308 14:B2F8: F7        .byte $F7
- - - - - - 0x02B309 14:B2F9: 7D        .byte $7D   ; <ー>

off_B2FA_89:
- - - - - - 0x02B30A 14:B2FA: F1        .byte $F1
- - - - - - 0x02B30B 14:B2FB: F7        .byte $F7
- - - - - - 0x02B30C 14:B2FC: A9        .byte $A9   ; <ぞ>

off_B2FD_8A:
- D - I - - 0x02B30D 14:B2FD: 06        .byte $06   ; <か>
- D - I - - 0x02B30E 14:B2FE: A0        .byte $A0   ; <が>
- D - I - - 0x02B30F 14:B2FF: F7        .byte $F7
- D - I - - 0x02B310 14:B300: A1        .byte $A1   ; <ぎ>

off_B301_8B:
- D - I - - 0x02B311 14:B301: F1        .byte $F1
- D - I - - 0x02B312 14:B302: F7        .byte $F7
- D - I - - 0x02B313 14:B303: 98        .byte $98

off_B304_8C:
- D - I - - 0x02B314 14:B304: F7        .byte $F7
- D - I - - 0x02B315 14:B305: 52        .byte $52   ; <ツ>

off_B306_8D:
- D - I - - 0x02B316 14:B306: F7        .byte $F7
- D - I - - 0x02B317 14:B307: 53        .byte $53   ; <テ>

off_B308_8E:
- D - I - - 0x02B318 14:B308: F7        .byte $F7
- D - I - - 0x02B319 14:B309: 54        .byte $54   ; <ト>

off_B30A_8F:
- D - I - - 0x02B31A 14:B30A: F7        .byte $F7
- D - I - - 0x02B31B 14:B30B: CF        .byte $CF   ; <プ>

off_B30C_90:
- D - I - - 0x02B31C 14:B30C: F7        .byte $F7
- D - I - - 0x02B31D 14:B30D: D0        .byte $D0   ; <ペ>

off_B30E_91:
- D - I - - 0x02B31E 14:B30E: F7        .byte $F7
- D - I - - 0x02B31F 14:B30F: B8        .byte $B8   ; <ゴ>

off_B310_92:
- D - I - - 0x02B320 14:B310: F7        .byte $F7
- D - I - - 0x02B321 14:B311: BA        .byte $BA   ; <ジ>

off_B312_93:
- D - I - - 0x02B322 14:B312: F7        .byte $F7
- D - I - - 0x02B323 14:B313: B9        .byte $B9   ; <ザ>

off_B314_94:
off_B314:
- D - I - - 0x02B324 14:B314: F6        .byte $F6
- D - I - - 0x02B325 14:B315: 04        .byte $04   ; <え>
- D - I - - 0x02B326 14:B316: 00        .byte $00
- D - I - - 0x02B327 14:B317: 04        .byte $04   ; <え>
- D - I - - 0x02B328 14:B318: 02        .byte $02   ; <い>
- D - I - - 0x02B329 14:B319: F6        .byte $F6
- D - I - - 0x02B32A 14:B31A: FF        .byte $FF
- D - I - - 0x02B32B 14:B31B: 00        .byte $00
- D - I - - 0x02B32C 14:B31C: 04        .byte $04   ; <え>
- D - I - - 0x02B32D 14:B31D: 03        .byte $03   ; <う>
- D - I - - 0x02B32E 14:B31E: 04        .byte $04   ; <え>
- D - I - - 0x02B32F 14:B31F: 00        .byte $00
- D - I - - 0x02B330 14:B320: F6        .byte $F6
- D - I - - 0x02B331 14:B321: 04        .byte $04   ; <え>
- D - I - - 0x02B332 14:B322: 00        .byte $00
- D - I - - 0x02B333 14:B323: 04        .byte $04   ; <え>
- D - I - - 0x02B334 14:B324: 01        .byte $01   ; <あ>
- D - I - - 0x02B335 14:B325: F3        .byte $F3
- D - I - - 0x02B336 14:B326: 14 B3     .word off_B314

off_B328_95:
off_B328:
- D - I - - 0x02B338 14:B328: F3        .byte $F3
- D - I - - 0x02B339 14:B329: 52 B0     .word off_B052

off_B32B_96:
- D - I - - 0x02B33B 14:B32B: F3        .byte $F3
- D - I - - 0x02B33C 14:B32C: 6B B0     .word off_B06B

off_B32E_97:
- D - I - - 0x02B33E 14:B32E: F8        .byte $F8
- D - I - - 0x02B33F 14:B32F: 07        .byte $07   ; <き>
- D - I - - 0x02B340 14:B330: F3        .byte $F3
- D - I - - 0x02B341 14:B331: 31 B0     .word off_B031

off_B333_98:
- D - I - - 0x02B343 14:B333: F7        .byte $F7
- D - I - - 0x02B344 14:B334: 55        .byte $55   ; <ナ>

off_B335_99:
- D - I - - 0x02B345 14:B335: F7        .byte $F7
- D - I - - 0x02B346 14:B336: 56        .byte $56   ; <ニ>

off_B337_9A:
- D - I - - 0x02B347 14:B337: F7        .byte $F7
- D - I - - 0x02B348 14:B338: 57        .byte $57   ; <ヌ>

off_B339_9B:
- D - I - - 0x02B349 14:B339: F7        .byte $F7
- D - I - - 0x02B34A 14:B33A: 58        .byte $58   ; <ネ>

off_B33B_9C:
- D - I - - 0x02B34B 14:B33B: F7        .byte $F7
- D - I - - 0x02B34C 14:B33C: 59        .byte $59   ; <ノ>

off_B33D_9D:
- D - I - - 0x02B34D 14:B33D: F7        .byte $F7
- D - I - - 0x02B34E 14:B33E: 5A        .byte $5A   ; <ハ>

off_B33F_9E:
- D - I - - 0x02B34F 14:B33F: F7        .byte $F7
- D - I - - 0x02B350 14:B340: 5B        .byte $5B   ; <ヒ>

off_B341_9F:
- D - I - - 0x02B351 14:B341: F7        .byte $F7
- D - I - - 0x02B352 14:B342: 5C        .byte $5C   ; <フ>

off_B343_A0:
- D - I - - 0x02B353 14:B343: F7        .byte $F7
- D - I - - 0x02B354 14:B344: 5D        .byte $5D   ; <ヘ>

off_B345_A1:
- D - I - - 0x02B355 14:B345: F7        .byte $F7
- D - I - - 0x02B356 14:B346: 5E        .byte $5E   ; <ホ>

off_B347_A2:
- D - I - - 0x02B357 14:B347: F7        .byte $F7
- D - I - - 0x02B358 14:B348: 5F        .byte $5F   ; <マ>

off_B349_A3:
- D - I - - 0x02B359 14:B349: F7        .byte $F7
- D - I - - 0x02B35A 14:B34A: 60        .byte $60   ; <ミ>

off_B34B_A4:
- D - I - - 0x02B35B 14:B34B: F7        .byte $F7
- D - I - - 0x02B35C 14:B34C: 61        .byte $61   ; <ム>

off_B34D_A5:
- D - I - - 0x02B35D 14:B34D: F7        .byte $F7
- D - I - - 0x02B35E 14:B34E: 62        .byte $62   ; <メ>

off_B34F_A6:
- D - I - - 0x02B35F 14:B34F: F7        .byte $F7
- D - I - - 0x02B360 14:B350: 63        .byte $63   ; <モ>

off_B351_A7:
- D - I - - 0x02B361 14:B351: F7        .byte $F7
- D - I - - 0x02B362 14:B352: 64        .byte $64   ; <ヤ>

off_B353_A8:
- D - I - - 0x02B363 14:B353: F7        .byte $F7
- D - I - - 0x02B364 14:B354: 65        .byte $65   ; <ユ>

off_B355_A9:
- D - I - - 0x02B365 14:B355: F7        .byte $F7
- D - I - - 0x02B366 14:B356: 66        .byte $66   ; <ヨ>

off_B357_AA:
- D - I - - 0x02B367 14:B357: F7        .byte $F7
- D - I - - 0x02B368 14:B358: 67        .byte $67   ; <ラ>

off_B359_AB:
- D - I - - 0x02B369 14:B359: F7        .byte $F7
- D - I - - 0x02B36A 14:B35A: 68        .byte $68   ; <リ>

off_B35B_AC:
- D - I - - 0x02B36B 14:B35B: F7        .byte $F7
- D - I - - 0x02B36C 14:B35C: 69        .byte $69   ; <ル>

off_B35D_AD:
- D - I - - 0x02B36D 14:B35D: F7        .byte $F7
- D - I - - 0x02B36E 14:B35E: B3        .byte $B3   ; <ぼ>

off_B35F_AE:
- D - I - - 0x02B36F 14:B35F: F7        .byte $F7
- D - I - - 0x02B370 14:B360: B4        .byte $B4   ; <ガ>

off_B361_AF:
- D - I - - 0x02B371 14:B361: F7        .byte $F7
- D - I - - 0x02B372 14:B362: B5        .byte $B5   ; <ギ>

off_B363_B0:
- D - I - - 0x02B373 14:B363: F7        .byte $F7
- D - I - - 0x02B374 14:B364: B6        .byte $B6   ; <グ>

off_B365_B1:
- D - I - - 0x02B375 14:B365: F7        .byte $F7
- D - I - - 0x02B376 14:B366: D1        .byte $D1   ; <ポ>

off_B367_B2:
off_B367:
- D - I - - 0x02B377 14:B367: 01        .byte $01   ; <あ>
- D - I - - 0x02B378 14:B368: BF        .byte $BF   ; <ヂ>
- D - I - - 0x02B379 14:B369: F6        .byte $F6
- D - I - - 0x02B37A 14:B36A: 01        .byte $01   ; <あ>
- D - I - - 0x02B37B 14:B36B: 00        .byte $00
- D - I - - 0x02B37C 14:B36C: 01        .byte $01   ; <あ>
- D - I - - 0x02B37D 14:B36D: BF        .byte $BF   ; <ヂ>
- D - I - - 0x02B37E 14:B36E: F3        .byte $F3
- D - I - - 0x02B37F 14:B36F: 67 B3     .word off_B367

off_B371_B3:
- D - I - - 0x02B381 14:B371: F7        .byte $F7
- D - I - - 0x02B382 14:B372: B2        .byte $B2   ; <べ>

off_B373_B4:
- D - I - - 0x02B383 14:B373: 06        .byte $06   ; <か>
- D - I - - 0x02B384 14:B374: 87        .byte $87   ; <G>
- D - I - - 0x02B385 14:B375: 06        .byte $06   ; <か>
- D - I - - 0x02B386 14:B376: 86        .byte $86   ; <F>
- D - I - - 0x02B387 14:B377: 06        .byte $06   ; <か>
- D - I - - 0x02B388 14:B378: 85        .byte $85   ; <E>
- D - I - - 0x02B389 14:B379: 06        .byte $06   ; <か>
- D - I - - 0x02B38A 14:B37A: 84        .byte $84   ; <D>
- D - I - - 0x02B38B 14:B37B: 06        .byte $06   ; <か>
- D - I - - 0x02B38C 14:B37C: 83        .byte $83   ; <C>
- D - I - - 0x02B38D 14:B37D: F6        .byte $F6
- D - I - - 0x02B38E 14:B37E: 00        .byte $00
- D - I - - 0x02B38F 14:B37F: FF        .byte $FF
- D - I - - 0x02B390 14:B380: 06        .byte $06   ; <か>
- D - I - - 0x02B391 14:B381: 82        .byte $82   ; <B>
- D - I - - 0x02B392 14:B382: F6        .byte $F6
- D - I - - 0x02B393 14:B383: 00        .byte $00
- D - I - - 0x02B394 14:B384: 01        .byte $01   ; <あ>
- D - I - - 0x02B395 14:B385: 06        .byte $06   ; <か>
- D - I - - 0x02B396 14:B386: 81        .byte $81   ; <A>
- D - I - - 0x02B397 14:B387: F6        .byte $F6
- D - I - - 0x02B398 14:B388: 00        .byte $00
- D - I - - 0x02B399 14:B389: FF        .byte $FF
- D - I - - 0x02B39A 14:B38A: 06        .byte $06   ; <か>
- D - I - - 0x02B39B 14:B38B: 80        .byte $80
- D - I - - 0x02B39C 14:B38C: F6        .byte $F6
- D - I - - 0x02B39D 14:B38D: 00        .byte $00
- D - I - - 0x02B39E 14:B38E: 04        .byte $04   ; <え>
- D - I - - 0x02B39F 14:B38F: 06        .byte $06   ; <か>
- D - I - - 0x02B3A0 14:B390: 7F        .byte $7F   ; <,>
off_B391:
- D - I - - 0x02B3A1 14:B391: F6        .byte $F6
- D - I - - 0x02B3A2 14:B392: 00        .byte $00
- D - I - - 0x02B3A3 14:B393: 01        .byte $01   ; <あ>
- D - I - - 0x02B3A4 14:B394: 01        .byte $01   ; <あ>
- D - I - - 0x02B3A5 14:B395: 7E        .byte $7E   ; <.>
- D - I - - 0x02B3A6 14:B396: F2        .byte $F2
- D - I - - 0x02B3A7 14:B397: F1        .byte $F1
- D - I - - 0x02B3A8 14:B398: F6        .byte $F6
- D - I - - 0x02B3A9 14:B399: 00        .byte $00
- D - I - - 0x02B3AA 14:B39A: 01        .byte $01   ; <あ>
- D - I - - 0x02B3AB 14:B39B: 01        .byte $01   ; <あ>
- D - I - - 0x02B3AC 14:B39C: 7E        .byte $7E   ; <.>
- D - I - - 0x02B3AD 14:B39D: F3        .byte $F3
- D - I - - 0x02B3AE 14:B39E: 91 B3     .word off_B391

off_B3A0_B5:
- - - - - - 0x02B3B0 14:B3A0: 01        .byte $01   ; <あ>
- - - - - - 0x02B3B1 14:B3A1: 87        .byte $87   ; <G>
- - - - - - 0x02B3B2 14:B3A2: 01        .byte $01   ; <あ>
- - - - - - 0x02B3B3 14:B3A3: 86        .byte $86   ; <F>
- - - - - - 0x02B3B4 14:B3A4: 01        .byte $01   ; <あ>
- - - - - - 0x02B3B5 14:B3A5: 85        .byte $85   ; <E>
- - - - - - 0x02B3B6 14:B3A6: 02        .byte $02   ; <い>
- - - - - - 0x02B3B7 14:B3A7: 84        .byte $84   ; <D>
- - - - - - 0x02B3B8 14:B3A8: 02        .byte $02   ; <い>
- - - - - - 0x02B3B9 14:B3A9: 83        .byte $83   ; <C>
- - - - - - 0x02B3BA 14:B3AA: F6        .byte $F6
- - - - - - 0x02B3BB 14:B3AB: 00        .byte $00
- - - - - - 0x02B3BC 14:B3AC: FF        .byte $FF
- - - - - - 0x02B3BD 14:B3AD: 02        .byte $02   ; <い>
- - - - - - 0x02B3BE 14:B3AE: 82        .byte $82   ; <B>
- - - - - - 0x02B3BF 14:B3AF: F6        .byte $F6
- - - - - - 0x02B3C0 14:B3B0: 00        .byte $00
- - - - - - 0x02B3C1 14:B3B1: 01        .byte $01   ; <あ>
- - - - - - 0x02B3C2 14:B3B2: 03        .byte $03   ; <う>
- - - - - - 0x02B3C3 14:B3B3: 81        .byte $81   ; <A>
- - - - - - 0x02B3C4 14:B3B4: F6        .byte $F6
- - - - - - 0x02B3C5 14:B3B5: 00        .byte $00
- - - - - - 0x02B3C6 14:B3B6: FF        .byte $FF
- - - - - - 0x02B3C7 14:B3B7: 03        .byte $03   ; <う>
- - - - - - 0x02B3C8 14:B3B8: 80        .byte $80
- - - - - - 0x02B3C9 14:B3B9: F6        .byte $F6
- - - - - - 0x02B3CA 14:B3BA: 00        .byte $00
- - - - - - 0x02B3CB 14:B3BB: 04        .byte $04   ; <え>
- - - - - - 0x02B3CC 14:B3BC: 03        .byte $03   ; <う>
- - - - - - 0x02B3CD 14:B3BD: 7F        .byte $7F   ; <,>
- - - - - - 0x02B3CE 14:B3BE: F3        .byte $F3
- - - - - - 0x02B3CF 14:B3BF: 91 B3     .word off_B391

off_B3C1_B6:
- D - I - - 0x02B3D1 14:B3C1: F6        .byte $F6
- D - I - - 0x02B3D2 14:B3C2: 00        .byte $00
- D - I - - 0x02B3D3 14:B3C3: 01        .byte $01   ; <あ>
- D - I - - 0x02B3D4 14:B3C4: 03        .byte $03   ; <う>
- D - I - - 0x02B3D5 14:B3C5: 7E        .byte $7E   ; <.>
- D - I - - 0x02B3D6 14:B3C6: F6        .byte $F6
- D - I - - 0x02B3D7 14:B3C7: 00        .byte $00
- D - I - - 0x02B3D8 14:B3C8: 04        .byte $04   ; <え>
- D - I - - 0x02B3D9 14:B3C9: 03        .byte $03   ; <う>
- D - I - - 0x02B3DA 14:B3CA: 7F        .byte $7F   ; <,>
- D - I - - 0x02B3DB 14:B3CB: F6        .byte $F6
- D - I - - 0x02B3DC 14:B3CC: 00        .byte $00
- D - I - - 0x02B3DD 14:B3CD: FF        .byte $FF
- D - I - - 0x02B3DE 14:B3CE: 03        .byte $03   ; <う>
- D - I - - 0x02B3DF 14:B3CF: 80        .byte $80
- D - I - - 0x02B3E0 14:B3D0: F6        .byte $F6
- D - I - - 0x02B3E1 14:B3D1: 00        .byte $00
- D - I - - 0x02B3E2 14:B3D2: 01        .byte $01   ; <あ>
- D - I - - 0x02B3E3 14:B3D3: 03        .byte $03   ; <う>
- D - I - - 0x02B3E4 14:B3D4: 81        .byte $81   ; <A>
- D - I - - 0x02B3E5 14:B3D5: F6        .byte $F6
- D - I - - 0x02B3E6 14:B3D6: 00        .byte $00
- D - I - - 0x02B3E7 14:B3D7: FF        .byte $FF
- D - I - - 0x02B3E8 14:B3D8: 03        .byte $03   ; <う>
- D - I - - 0x02B3E9 14:B3D9: 82        .byte $82   ; <B>
- D - I - - 0x02B3EA 14:B3DA: 03        .byte $03   ; <う>
- D - I - - 0x02B3EB 14:B3DB: 83        .byte $83   ; <C>
- D - I - - 0x02B3EC 14:B3DC: 03        .byte $03   ; <う>
- D - I - - 0x02B3ED 14:B3DD: 84        .byte $84   ; <D>
- D - I - - 0x02B3EE 14:B3DE: 03        .byte $03   ; <う>
- D - I - - 0x02B3EF 14:B3DF: 85        .byte $85   ; <E>
- D - I - - 0x02B3F0 14:B3E0: F4        .byte $F4
- D - I - - 0x02B3F1 14:B3E1: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B3F2 14:B3E2: 03        .byte $03   ; <う>
- D - I - - 0x02B3F3 14:B3E3: 86        .byte $86   ; <F>
- D - I - - 0x02B3F4 14:B3E4: 01        .byte $01   ; <あ>
- D - I - - 0x02B3F5 14:B3E5: 87        .byte $87   ; <G>
- D - I - - 0x02B3F6 14:B3E6: F5        .byte $F5
- D - I - - 0x02B3F7 14:B3E7: F0        .byte $F0

off_B3E8_B7:
- D - I - - 0x02B3F8 14:B3E8: F6        .byte $F6
- D - I - - 0x02B3F9 14:B3E9: 00        .byte $00
- D - I - - 0x02B3FA 14:B3EA: 01        .byte $01   ; <あ>
- D - I - - 0x02B3FB 14:B3EB: 05        .byte $05   ; <お>
- D - I - - 0x02B3FC 14:B3EC: 7E        .byte $7E   ; <.>
- D - I - - 0x02B3FD 14:B3ED: F6        .byte $F6
- D - I - - 0x02B3FE 14:B3EE: 00        .byte $00
- D - I - - 0x02B3FF 14:B3EF: 04        .byte $04   ; <え>
- D - I - - 0x02B400 14:B3F0: 05        .byte $05   ; <お>
- D - I - - 0x02B401 14:B3F1: 7F        .byte $7F   ; <,>
- D - I - - 0x02B402 14:B3F2: F6        .byte $F6
- D - I - - 0x02B403 14:B3F3: 00        .byte $00
- D - I - - 0x02B404 14:B3F4: FF        .byte $FF
- D - I - - 0x02B405 14:B3F5: 05        .byte $05   ; <お>
- D - I - - 0x02B406 14:B3F6: 80        .byte $80
- D - I - - 0x02B407 14:B3F7: F6        .byte $F6
- D - I - - 0x02B408 14:B3F8: 00        .byte $00
- D - I - - 0x02B409 14:B3F9: 01        .byte $01   ; <あ>
- D - I - - 0x02B40A 14:B3FA: 05        .byte $05   ; <お>
- D - I - - 0x02B40B 14:B3FB: 81        .byte $81   ; <A>
- D - I - - 0x02B40C 14:B3FC: F6        .byte $F6
- D - I - - 0x02B40D 14:B3FD: 00        .byte $00
- D - I - - 0x02B40E 14:B3FE: FF        .byte $FF
- D - I - - 0x02B40F 14:B3FF: 05        .byte $05   ; <お>
- D - I - - 0x02B410 14:B400: 82        .byte $82   ; <B>
- D - I - - 0x02B411 14:B401: 05        .byte $05   ; <お>
- D - I - - 0x02B412 14:B402: 83        .byte $83   ; <C>
- D - I - - 0x02B413 14:B403: 05        .byte $05   ; <お>
- D - I - - 0x02B414 14:B404: 84        .byte $84   ; <D>
- D - I - - 0x02B415 14:B405: 05        .byte $05   ; <お>
- D - I - - 0x02B416 14:B406: 85        .byte $85   ; <E>
- D - I - - 0x02B417 14:B407: 05        .byte $05   ; <お>
- D - I - - 0x02B418 14:B408: 86        .byte $86   ; <F>
off_B409:
- D - I - - 0x02B419 14:B409: 01        .byte $01   ; <あ>
- D - I - - 0x02B41A 14:B40A: 87        .byte $87   ; <G>
- D - I - - 0x02B41B 14:B40B: F1        .byte $F1
- D - I - - 0x02B41C 14:B40C: F2        .byte $F2
- D - I - - 0x02B41D 14:B40D: 01        .byte $01   ; <あ>
- D - I - - 0x02B41E 14:B40E: 87        .byte $87   ; <G>
- D - I - - 0x02B41F 14:B40F: F3        .byte $F3
- D - I - - 0x02B420 14:B410: 09 B4     .word off_B409

off_B412_B8:
- D - I - - 0x02B422 14:B412: F6        .byte $F6
- D - I - - 0x02B423 14:B413: 01        .byte $01   ; <あ>
- D - I - - 0x02B424 14:B414: 00        .byte $00
- D - I - - 0x02B425 14:B415: 04        .byte $04   ; <え>
- D - I - - 0x02B426 14:B416: 72        .byte $72   ; <ョ>
- D - I - - 0x02B427 14:B417: F6        .byte $F6
- D - I - - 0x02B428 14:B418: 00        .byte $00
- D - I - - 0x02B429 14:B419: 01        .byte $01   ; <あ>
- D - I - - 0x02B42A 14:B41A: 04        .byte $04   ; <え>
- D - I - - 0x02B42B 14:B41B: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B42C 14:B41C: 04        .byte $04   ; <え>
- D - I - - 0x02B42D 14:B41D: 74        .byte $74   ; <ィ>
- D - I - - 0x02B42E 14:B41E: F6        .byte $F6
- D - I - - 0x02B42F 14:B41F: FE        .byte $FE
- D - I - - 0x02B430 14:B420: 01        .byte $01   ; <あ>
- D - I - - 0x02B431 14:B421: 04        .byte $04   ; <え>
- D - I - - 0x02B432 14:B422: 75        .byte $75   ; <ェ>
- D - I - - 0x02B433 14:B423: F6        .byte $F6
- D - I - - 0x02B434 14:B424: FE        .byte $FE
- D - I - - 0x02B435 14:B425: 01        .byte $01   ; <あ>
- D - I - - 0x02B436 14:B426: 04        .byte $04   ; <え>
- D - I - - 0x02B437 14:B427: 76        .byte $76   ; <ォ>
- D - I - - 0x02B438 14:B428: 04        .byte $04   ; <え>
- D - I - - 0x02B439 14:B429: 77        .byte $77   ; <:>
- D - I - - 0x02B43A 14:B42A: 04        .byte $04   ; <え>
- D - I - - 0x02B43B 14:B42B: 78        .byte $78   ; <?>
- D - I - - 0x02B43C 14:B42C: 04        .byte $04   ; <え>
- D - I - - 0x02B43D 14:B42D: 79        .byte $79   ; <!>
- D - I - - 0x02B43E 14:B42E: 04        .byte $04   ; <え>
- D - I - - 0x02B43F 14:B42F: 7A        .byte $7A   ; <、>
- D - I - - 0x02B440 14:B430: 04        .byte $04   ; <え>
- D - I - - 0x02B441 14:B431: 7B        .byte $7B   ; <。>
off_B432:
- D - I - - 0x02B442 14:B432: 04        .byte $04   ; <え>
- D - I - - 0x02B443 14:B433: 7C        .byte $7C   ; <~>
- - - - - - 0x02B444 14:B434: 04        .byte $04   ; <え>
- - - - - - 0x02B445 14:B435: 7D        .byte $7D   ; <ー>
- - - - - - 0x02B446 14:B436: F3        .byte $F3
- - - - - - 0x02B447 14:B437: 32 B4     .word off_B432

off_B439_B9:
- D - I - - 0x02B449 14:B439: F8        .byte $F8
- D - I - - 0x02B44A 14:B43A: 03        .byte $03   ; <う>
- D - I - - 0x02B44B 14:B43B: F3        .byte $F3
- D - I - - 0x02B44C 14:B43C: 14 B3     .word off_B314

off_B43E_BA:
- D - I - - 0x02B44E 14:B43E: 03        .byte $03   ; <う>
- D - I - - 0x02B44F 14:B43F: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B450 14:B440: 03        .byte $03   ; <う>
- D - I - - 0x02B451 14:B441: 7C        .byte $7C   ; <~>
- D - I - - 0x02B452 14:B442: 03        .byte $03   ; <う>
- D - I - - 0x02B453 14:B443: 7B        .byte $7B   ; <。>
- D - I - - 0x02B454 14:B444: 03        .byte $03   ; <う>
- D - I - - 0x02B455 14:B445: 7A        .byte $7A   ; <、>
- D - I - - 0x02B456 14:B446: 03        .byte $03   ; <う>
- D - I - - 0x02B457 14:B447: 79        .byte $79   ; <!>
- D - I - - 0x02B458 14:B448: 03        .byte $03   ; <う>
- D - I - - 0x02B459 14:B449: 78        .byte $78   ; <?>
- D - I - - 0x02B45A 14:B44A: 03        .byte $03   ; <う>
- D - I - - 0x02B45B 14:B44B: 77        .byte $77   ; <:>
- D - I - - 0x02B45C 14:B44C: F6        .byte $F6
- D - I - - 0x02B45D 14:B44D: FE        .byte $FE
- D - I - - 0x02B45E 14:B44E: 01        .byte $01   ; <あ>
- D - I - - 0x02B45F 14:B44F: 03        .byte $03   ; <う>
- D - I - - 0x02B460 14:B450: 76        .byte $76   ; <ォ>
- D - I - - 0x02B461 14:B451: F6        .byte $F6
- D - I - - 0x02B462 14:B452: FE        .byte $FE
- D - I - - 0x02B463 14:B453: 01        .byte $01   ; <あ>
- D - I - - 0x02B464 14:B454: 03        .byte $03   ; <う>
- D - I - - 0x02B465 14:B455: 75        .byte $75   ; <ェ>
- D - I - - 0x02B466 14:B456: 03        .byte $03   ; <う>
- D - I - - 0x02B467 14:B457: 74        .byte $74   ; <ィ>
- D - I - - 0x02B468 14:B458: F6        .byte $F6
- D - I - - 0x02B469 14:B459: 00        .byte $00
- D - I - - 0x02B46A 14:B45A: 01        .byte $01   ; <あ>
- D - I - - 0x02B46B 14:B45B: 03        .byte $03   ; <う>
- D - I - - 0x02B46C 14:B45C: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B46D 14:B45D: F6        .byte $F6
- D - I - - 0x02B46E 14:B45E: 01        .byte $01   ; <あ>
- D - I - - 0x02B46F 14:B45F: 00        .byte $00
- D - I - - 0x02B470 14:B460: 03        .byte $03   ; <う>
- D - I - - 0x02B471 14:B461: 72        .byte $72   ; <ョ>
off_B462:
- D - I - - 0x02B472 14:B462: F6        .byte $F6
- D - I - - 0x02B473 14:B463: 00        .byte $00
- D - I - - 0x02B474 14:B464: 01        .byte $01   ; <あ>
- D - I - - 0x02B475 14:B465: 03        .byte $03   ; <う>
- D - I - - 0x02B476 14:B466: 71        .byte $71   ; <ュ>
- D - I - - 0x02B477 14:B467: F1        .byte $F1
- D - I - - 0x02B478 14:B468: F2        .byte $F2
- D - I - - 0x02B479 14:B469: F6        .byte $F6
- D - I - - 0x02B47A 14:B46A: 00        .byte $00
- D - I - - 0x02B47B 14:B46B: 01        .byte $01   ; <あ>
- D - I - - 0x02B47C 14:B46C: 03        .byte $03   ; <う>
- D - I - - 0x02B47D 14:B46D: 71        .byte $71   ; <ュ>
- D - I - - 0x02B47E 14:B46E: F3        .byte $F3
- D - I - - 0x02B47F 14:B46F: 62 B4     .word off_B462

off_B471_BB:
off_B471:
- D - I - - 0x02B481 14:B471: F1        .byte $F1
- D - I - - 0x02B482 14:B472: 02        .byte $02   ; <い>
- D - I - - 0x02B483 14:B473: 00        .byte $00
- D - I - - 0x02B484 14:B474: F1        .byte $F1
- D - I - - 0x02B485 14:B475: 02        .byte $02   ; <い>
- D - I - - 0x02B486 14:B476: 01        .byte $01   ; <あ>
- D - I - - 0x02B487 14:B477: F1        .byte $F1
- D - I - - 0x02B488 14:B478: 02        .byte $02   ; <い>
- D - I - - 0x02B489 14:B479: 02        .byte $02   ; <い>
- D - I - - 0x02B48A 14:B47A: F1        .byte $F1
- D - I - - 0x02B48B 14:B47B: 02        .byte $02   ; <い>
- D - I - - 0x02B48C 14:B47C: 03        .byte $03   ; <う>
- D - I - - 0x02B48D 14:B47D: F3        .byte $F3
- D - I - - 0x02B48E 14:B47E: 71 B4     .word off_B471

off_B480_BC:
- D - I - - 0x02B490 14:B480: F6        .byte $F6
- D - I - - 0x02B491 14:B481: 00        .byte $00
- D - I - - 0x02B492 14:B482: 01        .byte $01   ; <あ>
- D - I - - 0x02B493 14:B483: 04        .byte $04   ; <え>
- D - I - - 0x02B494 14:B484: 71        .byte $71   ; <ュ>
- D - I - - 0x02B495 14:B485: F6        .byte $F6
- D - I - - 0x02B496 14:B486: 01        .byte $01   ; <あ>
- D - I - - 0x02B497 14:B487: 00        .byte $00
- D - I - - 0x02B498 14:B488: 04        .byte $04   ; <え>
- D - I - - 0x02B499 14:B489: 72        .byte $72   ; <ョ>
- D - I - - 0x02B49A 14:B48A: F6        .byte $F6
- D - I - - 0x02B49B 14:B48B: 00        .byte $00
- D - I - - 0x02B49C 14:B48C: 01        .byte $01   ; <あ>
- D - I - - 0x02B49D 14:B48D: 04        .byte $04   ; <え>
- D - I - - 0x02B49E 14:B48E: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B49F 14:B48F: 04        .byte $04   ; <え>
- D - I - - 0x02B4A0 14:B490: 74        .byte $74   ; <ィ>
- D - I - - 0x02B4A1 14:B491: F6        .byte $F6
- D - I - - 0x02B4A2 14:B492: FE        .byte $FE
- D - I - - 0x02B4A3 14:B493: 01        .byte $01   ; <あ>
- D - I - - 0x02B4A4 14:B494: 04        .byte $04   ; <え>
- D - I - - 0x02B4A5 14:B495: 75        .byte $75   ; <ェ>
- D - I - - 0x02B4A6 14:B496: F6        .byte $F6
- D - I - - 0x02B4A7 14:B497: FE        .byte $FE
- D - I - - 0x02B4A8 14:B498: 01        .byte $01   ; <あ>
- D - I - - 0x02B4A9 14:B499: 04        .byte $04   ; <え>
- D - I - - 0x02B4AA 14:B49A: 76        .byte $76   ; <ォ>
- D - I - - 0x02B4AB 14:B49B: 04        .byte $04   ; <え>
- D - I - - 0x02B4AC 14:B49C: 77        .byte $77   ; <:>
- D - I - - 0x02B4AD 14:B49D: 04        .byte $04   ; <え>
- D - I - - 0x02B4AE 14:B49E: 78        .byte $78   ; <?>
- D - I - - 0x02B4AF 14:B49F: 04        .byte $04   ; <え>
- D - I - - 0x02B4B0 14:B4A0: 79        .byte $79   ; <!>
- D - I - - 0x02B4B1 14:B4A1: 04        .byte $04   ; <え>
- D - I - - 0x02B4B2 14:B4A2: 7A        .byte $7A   ; <、>
- D - I - - 0x02B4B3 14:B4A3: 04        .byte $04   ; <え>
- D - I - - 0x02B4B4 14:B4A4: 7B        .byte $7B   ; <。>
off_B4A5:
- D - I - - 0x02B4B5 14:B4A5: 03        .byte $03   ; <う>
- D - I - - 0x02B4B6 14:B4A6: 7C        .byte $7C   ; <~>
- D - I - - 0x02B4B7 14:B4A7: 03        .byte $03   ; <う>
- D - I - - 0x02B4B8 14:B4A8: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B4B9 14:B4A9: F3        .byte $F3
- D - I - - 0x02B4BA 14:B4AA: A5 B4     .word off_B4A5

off_B4AC_BD:
- D - I - - 0x02B4BC 14:B4AC: F6        .byte $F6
- D - I - - 0x02B4BD 14:B4AD: 00        .byte $00
- D - I - - 0x02B4BE 14:B4AE: 01        .byte $01   ; <あ>
- D - I - - 0x02B4BF 14:B4AF: 07        .byte $07   ; <き>
- D - I - - 0x02B4C0 14:B4B0: 71        .byte $71   ; <ュ>
- D - I - - 0x02B4C1 14:B4B1: F6        .byte $F6
- D - I - - 0x02B4C2 14:B4B2: 01        .byte $01   ; <あ>
- D - I - - 0x02B4C3 14:B4B3: 00        .byte $00
- D - I - - 0x02B4C4 14:B4B4: 07        .byte $07   ; <き>
- D - I - - 0x02B4C5 14:B4B5: 72        .byte $72   ; <ョ>
- D - I - - 0x02B4C6 14:B4B6: F6        .byte $F6
- D - I - - 0x02B4C7 14:B4B7: 00        .byte $00
- D - I - - 0x02B4C8 14:B4B8: 01        .byte $01   ; <あ>
- D - I - - 0x02B4C9 14:B4B9: 07        .byte $07   ; <き>
- D - I - - 0x02B4CA 14:B4BA: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B4CB 14:B4BB: 07        .byte $07   ; <き>
- D - I - - 0x02B4CC 14:B4BC: 74        .byte $74   ; <ィ>
- D - I - - 0x02B4CD 14:B4BD: F6        .byte $F6
- D - I - - 0x02B4CE 14:B4BE: FE        .byte $FE
- D - I - - 0x02B4CF 14:B4BF: 01        .byte $01   ; <あ>
- D - I - - 0x02B4D0 14:B4C0: 07        .byte $07   ; <き>
- D - I - - 0x02B4D1 14:B4C1: 75        .byte $75   ; <ェ>
- D - I - - 0x02B4D2 14:B4C2: F6        .byte $F6
- D - I - - 0x02B4D3 14:B4C3: FE        .byte $FE
- D - I - - 0x02B4D4 14:B4C4: 01        .byte $01   ; <あ>
- D - I - - 0x02B4D5 14:B4C5: 07        .byte $07   ; <き>
- D - I - - 0x02B4D6 14:B4C6: 76        .byte $76   ; <ォ>
- D - I - - 0x02B4D7 14:B4C7: 07        .byte $07   ; <き>
- D - I - - 0x02B4D8 14:B4C8: 77        .byte $77   ; <:>
- D - I - - 0x02B4D9 14:B4C9: 07        .byte $07   ; <き>
- D - I - - 0x02B4DA 14:B4CA: 78        .byte $78   ; <?>
- D - I - - 0x02B4DB 14:B4CB: 07        .byte $07   ; <き>
- D - I - - 0x02B4DC 14:B4CC: 79        .byte $79   ; <!>
- D - I - - 0x02B4DD 14:B4CD: 07        .byte $07   ; <き>
- D - I - - 0x02B4DE 14:B4CE: 7A        .byte $7A   ; <、>
- D - I - - 0x02B4DF 14:B4CF: 07        .byte $07   ; <き>
- D - I - - 0x02B4E0 14:B4D0: 7B        .byte $7B   ; <。>
- D - I - - 0x02B4E1 14:B4D1: F3        .byte $F3
- D - I - - 0x02B4E2 14:B4D2: A5 B4     .word off_B4A5

off_B4D4_BE:
off_B4D4:
- D - I - - 0x02B4E4 14:B4D4: F1        .byte $F1
- D - I - - 0x02B4E5 14:B4D5: 02        .byte $02   ; <い>
- D - I - - 0x02B4E6 14:B4D6: 04        .byte $04   ; <え>
- D - I - - 0x02B4E7 14:B4D7: 02        .byte $02   ; <い>
- D - I - - 0x02B4E8 14:B4D8: 05        .byte $05   ; <お>
- D - I - - 0x02B4E9 14:B4D9: 02        .byte $02   ; <い>
- D - I - - 0x02B4EA 14:B4DA: 04        .byte $04   ; <え>
- D - I - - 0x02B4EB 14:B4DB: F1        .byte $F1
- D - I - - 0x02B4EC 14:B4DC: 02        .byte $02   ; <い>
- D - I - - 0x02B4ED 14:B4DD: 05        .byte $05   ; <お>
- D - I - - 0x02B4EE 14:B4DE: F3        .byte $F3
- D - I - - 0x02B4EF 14:B4DF: D4 B4     .word off_B4D4

off_B4E1_BF:
off_B4E1:
- - - - - - 0x02B4F1 14:B4E1: F1        .byte $F1
- - - - - - 0x02B4F2 14:B4E2: 02        .byte $02   ; <い>
- - - - - - 0x02B4F3 14:B4E3: 06        .byte $06   ; <か>
- - - - - - 0x02B4F4 14:B4E4: F1        .byte $F1
- - - - - - 0x02B4F5 14:B4E5: 02        .byte $02   ; <い>
- - - - - - 0x02B4F6 14:B4E6: 07        .byte $07   ; <き>
- - - - - - 0x02B4F7 14:B4E7: F1        .byte $F1
- - - - - - 0x02B4F8 14:B4E8: 02        .byte $02   ; <い>
- - - - - - 0x02B4F9 14:B4E9: 08        .byte $08   ; <く>
- - - - - - 0x02B4FA 14:B4EA: F1        .byte $F1
- - - - - - 0x02B4FB 14:B4EB: 02        .byte $02   ; <い>
- - - - - - 0x02B4FC 14:B4EC: 09        .byte $09   ; <け>
- - - - - - 0x02B4FD 14:B4ED: F3        .byte $F3
- - - - - - 0x02B4FE 14:B4EE: E1 B4     .word off_B4E1

off_B4F0_C0:
- D - I - - 0x02B500 14:B4F0: F6        .byte $F6
- D - I - - 0x02B501 14:B4F1: 00        .byte $00
- D - I - - 0x02B502 14:B4F2: 01        .byte $01   ; <あ>
- D - I - - 0x02B503 14:B4F3: 03        .byte $03   ; <う>
- D - I - - 0x02B504 14:B4F4: 71        .byte $71   ; <ュ>
- D - I - - 0x02B505 14:B4F5: F6        .byte $F6
- D - I - - 0x02B506 14:B4F6: 01        .byte $01   ; <あ>
- D - I - - 0x02B507 14:B4F7: 00        .byte $00
- D - I - - 0x02B508 14:B4F8: 03        .byte $03   ; <う>
- D - I - - 0x02B509 14:B4F9: 72        .byte $72   ; <ョ>
- D - I - - 0x02B50A 14:B4FA: F6        .byte $F6
- D - I - - 0x02B50B 14:B4FB: 00        .byte $00
- D - I - - 0x02B50C 14:B4FC: 01        .byte $01   ; <あ>
- D - I - - 0x02B50D 14:B4FD: 03        .byte $03   ; <う>
- D - I - - 0x02B50E 14:B4FE: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B50F 14:B4FF: 03        .byte $03   ; <う>
- D - I - - 0x02B510 14:B500: 74        .byte $74   ; <ィ>
- D - I - - 0x02B511 14:B501: F6        .byte $F6
- D - I - - 0x02B512 14:B502: FE        .byte $FE
- D - I - - 0x02B513 14:B503: 01        .byte $01   ; <あ>
- D - I - - 0x02B514 14:B504: 03        .byte $03   ; <う>
- D - I - - 0x02B515 14:B505: 75        .byte $75   ; <ェ>
- D - I - - 0x02B516 14:B506: F6        .byte $F6
- D - I - - 0x02B517 14:B507: FE        .byte $FE
- D - I - - 0x02B518 14:B508: 01        .byte $01   ; <あ>
- D - I - - 0x02B519 14:B509: 03        .byte $03   ; <う>
- D - I - - 0x02B51A 14:B50A: 76        .byte $76   ; <ォ>
- D - I - - 0x02B51B 14:B50B: 03        .byte $03   ; <う>
- D - I - - 0x02B51C 14:B50C: 77        .byte $77   ; <:>
- D - I - - 0x02B51D 14:B50D: 03        .byte $03   ; <う>
- D - I - - 0x02B51E 14:B50E: 78        .byte $78   ; <?>
- D - I - - 0x02B51F 14:B50F: 03        .byte $03   ; <う>
- D - I - - 0x02B520 14:B510: 79        .byte $79   ; <!>
- D - I - - 0x02B521 14:B511: 03        .byte $03   ; <う>
- D - I - - 0x02B522 14:B512: 7A        .byte $7A   ; <、>
- D - I - - 0x02B523 14:B513: 03        .byte $03   ; <う>
- D - I - - 0x02B524 14:B514: 7B        .byte $7B   ; <。>
- D - I - - 0x02B525 14:B515: F3        .byte $F3
- D - I - - 0x02B526 14:B516: A5 B4     .word off_B4A5

off_B518_C1:
off_B518:
- D - I - - 0x02B528 14:B518: F1        .byte $F1
- D - I - - 0x02B529 14:B519: 02        .byte $02   ; <い>
- D - I - - 0x02B52A 14:B51A: 0A        .byte $0A   ; <こ>
- D - I - - 0x02B52B 14:B51B: F1        .byte $F1
- D - I - - 0x02B52C 14:B51C: 02        .byte $02   ; <い>
- D - I - - 0x02B52D 14:B51D: 0B        .byte $0B   ; <さ>
- D - I - - 0x02B52E 14:B51E: F1        .byte $F1
- D - I - - 0x02B52F 14:B51F: 02        .byte $02   ; <い>
- D - I - - 0x02B530 14:B520: 0C        .byte $0C   ; <し>
- D - I - - 0x02B531 14:B521: F1        .byte $F1
- D - I - - 0x02B532 14:B522: 02        .byte $02   ; <い>
- D - I - - 0x02B533 14:B523: 0D        .byte $0D   ; <す>
- D - I - - 0x02B534 14:B524: F3        .byte $F3
- D - I - - 0x02B535 14:B525: 18 B5     .word off_B518

off_B527_C2:
off_B527:
- D - I - - 0x02B537 14:B527: 01        .byte $01   ; <あ>
- D - I - - 0x02B538 14:B528: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B539 14:B529: F8        .byte $F8
- D - I - - 0x02B53A 14:B52A: 04        .byte $04   ; <え>
- D - I - - 0x02B53B 14:B52B: 01        .byte $01   ; <あ>
- D - I - - 0x02B53C 14:B52C: 1F        .byte $1F   ; <ま>
- D - I - - 0x02B53D 14:B52D: F3        .byte $F3
- D - I - - 0x02B53E 14:B52E: 27 B5     .word off_B527

off_B530_C3:
off_B530:
- D - I - - 0x02B540 14:B530: 01        .byte $01   ; <あ>
- D - I - - 0x02B541 14:B531: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B542 14:B532: 01        .byte $01   ; <あ>
- D - I - - 0x02B543 14:B533: 20        .byte $20   ; <み>
- D - I - - 0x02B544 14:B534: F3        .byte $F3
- D - I - - 0x02B545 14:B535: 30 B5     .word off_B530

off_B537_C4:
- D - I - - 0x02B547 14:B537: 04        .byte $04   ; <え>
- D - I - - 0x02B548 14:B538: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B549 14:B539: 04        .byte $04   ; <え>
- D - I - - 0x02B54A 14:B53A: 7C        .byte $7C   ; <~>
- D - I - - 0x02B54B 14:B53B: 04        .byte $04   ; <え>
- D - I - - 0x02B54C 14:B53C: 7B        .byte $7B   ; <。>
- D - I - - 0x02B54D 14:B53D: 04        .byte $04   ; <え>
- D - I - - 0x02B54E 14:B53E: 7A        .byte $7A   ; <、>
- D - I - - 0x02B54F 14:B53F: 04        .byte $04   ; <え>
- D - I - - 0x02B550 14:B540: 79        .byte $79   ; <!>
- D - I - - 0x02B551 14:B541: 04        .byte $04   ; <え>
- D - I - - 0x02B552 14:B542: 78        .byte $78   ; <?>
- D - I - - 0x02B553 14:B543: 04        .byte $04   ; <え>
- D - I - - 0x02B554 14:B544: 77        .byte $77   ; <:>
- D - I - - 0x02B555 14:B545: F6        .byte $F6
- D - I - - 0x02B556 14:B546: FE        .byte $FE
- D - I - - 0x02B557 14:B547: 01        .byte $01   ; <あ>
- D - I - - 0x02B558 14:B548: 04        .byte $04   ; <え>
- D - I - - 0x02B559 14:B549: 76        .byte $76   ; <ォ>
- D - I - - 0x02B55A 14:B54A: F6        .byte $F6
- D - I - - 0x02B55B 14:B54B: FE        .byte $FE
- D - I - - 0x02B55C 14:B54C: 01        .byte $01   ; <あ>
- D - I - - 0x02B55D 14:B54D: 04        .byte $04   ; <え>
- D - I - - 0x02B55E 14:B54E: 75        .byte $75   ; <ェ>
- D - I - - 0x02B55F 14:B54F: 04        .byte $04   ; <え>
- D - I - - 0x02B560 14:B550: 74        .byte $74   ; <ィ>
- D - I - - 0x02B561 14:B551: F6        .byte $F6
- D - I - - 0x02B562 14:B552: 00        .byte $00
- D - I - - 0x02B563 14:B553: 01        .byte $01   ; <あ>
- D - I - - 0x02B564 14:B554: 04        .byte $04   ; <え>
- D - I - - 0x02B565 14:B555: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B566 14:B556: F6        .byte $F6
- D - I - - 0x02B567 14:B557: 01        .byte $01   ; <あ>
- D - I - - 0x02B568 14:B558: 00        .byte $00
- D - I - - 0x02B569 14:B559: 04        .byte $04   ; <え>
- D - I - - 0x02B56A 14:B55A: 72        .byte $72   ; <ョ>
off_B55B:
- D - I - - 0x02B56B 14:B55B: F6        .byte $F6
- D - I - - 0x02B56C 14:B55C: 00        .byte $00
- D - I - - 0x02B56D 14:B55D: 01        .byte $01   ; <あ>
- D - I - - 0x02B56E 14:B55E: 04        .byte $04   ; <え>
- D - I - - 0x02B56F 14:B55F: 71        .byte $71   ; <ュ>
- D - I - - 0x02B570 14:B560: F1        .byte $F1
- D - I - - 0x02B571 14:B561: F2        .byte $F2
- D - I - - 0x02B572 14:B562: F6        .byte $F6
- D - I - - 0x02B573 14:B563: 00        .byte $00
- D - I - - 0x02B574 14:B564: 01        .byte $01   ; <あ>
- D - I - - 0x02B575 14:B565: 04        .byte $04   ; <え>
- D - I - - 0x02B576 14:B566: 71        .byte $71   ; <ュ>
- D - I - - 0x02B577 14:B567: F3        .byte $F3
- D - I - - 0x02B578 14:B568: 5B B5     .word off_B55B

off_B56A_C5:
off_B56A:
- D - I - - 0x02B57A 14:B56A: F8        .byte $F8
- D - I - - 0x02B57B 14:B56B: 01        .byte $01   ; <あ>
- D - I - - 0x02B57C 14:B56C: F1        .byte $F1
- D - I - - 0x02B57D 14:B56D: 01        .byte $01   ; <あ>
- D - I - - 0x02B57E 14:B56E: D2        .byte $D2
- D - I - - 0x02B57F 14:B56F: F6        .byte $F6
- D - I - - 0x02B580 14:B570: 00        .byte $00
- D - I - - 0x02B581 14:B571: B0        .byte $B0   ; <び>
- D - I - - 0x02B582 14:B572: 01        .byte $01   ; <あ>
- D - I - - 0x02B583 14:B573: C8        .byte $C8   ; <ぱ>
- D - I - - 0x02B584 14:B574: F3        .byte $F3
- D - I - - 0x02B585 14:B575: 6A B5     .word off_B56A

off_B577_C6:
- D - I - - 0x02B587 14:B577: F6        .byte $F6
- D - I - - 0x02B588 14:B578: 00        .byte $00
- D - I - - 0x02B589 14:B579: 01        .byte $01   ; <あ>
- D - I - - 0x02B58A 14:B57A: 02        .byte $02   ; <い>
- D - I - - 0x02B58B 14:B57B: 71        .byte $71   ; <ュ>
- D - I - - 0x02B58C 14:B57C: F6        .byte $F6
- D - I - - 0x02B58D 14:B57D: 01        .byte $01   ; <あ>
- D - I - - 0x02B58E 14:B57E: 00        .byte $00
- D - I - - 0x02B58F 14:B57F: 02        .byte $02   ; <い>
- D - I - - 0x02B590 14:B580: 72        .byte $72   ; <ョ>
- D - I - - 0x02B591 14:B581: F6        .byte $F6
- D - I - - 0x02B592 14:B582: 00        .byte $00
- D - I - - 0x02B593 14:B583: 01        .byte $01   ; <あ>
- D - I - - 0x02B594 14:B584: 02        .byte $02   ; <い>
- D - I - - 0x02B595 14:B585: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B596 14:B586: 02        .byte $02   ; <い>
- D - I - - 0x02B597 14:B587: 74        .byte $74   ; <ィ>
- D - I - - 0x02B598 14:B588: F6        .byte $F6
- D - I - - 0x02B599 14:B589: FE        .byte $FE
- D - I - - 0x02B59A 14:B58A: 01        .byte $01   ; <あ>
- D - I - - 0x02B59B 14:B58B: 02        .byte $02   ; <い>
- D - I - - 0x02B59C 14:B58C: 75        .byte $75   ; <ェ>
- D - I - - 0x02B59D 14:B58D: F6        .byte $F6
- D - I - - 0x02B59E 14:B58E: FE        .byte $FE
- D - I - - 0x02B59F 14:B58F: 01        .byte $01   ; <あ>
- D - I - - 0x02B5A0 14:B590: 02        .byte $02   ; <い>
- D - I - - 0x02B5A1 14:B591: 76        .byte $76   ; <ォ>
- D - I - - 0x02B5A2 14:B592: 02        .byte $02   ; <い>
- D - I - - 0x02B5A3 14:B593: 77        .byte $77   ; <:>
- D - I - - 0x02B5A4 14:B594: 02        .byte $02   ; <い>
- D - I - - 0x02B5A5 14:B595: 78        .byte $78   ; <?>
- D - I - - 0x02B5A6 14:B596: 02        .byte $02   ; <い>
- D - I - - 0x02B5A7 14:B597: 79        .byte $79   ; <!>
- D - I - - 0x02B5A8 14:B598: 02        .byte $02   ; <い>
- D - I - - 0x02B5A9 14:B599: 7A        .byte $7A   ; <、>
- D - I - - 0x02B5AA 14:B59A: 02        .byte $02   ; <い>
- D - I - - 0x02B5AB 14:B59B: 7B        .byte $7B   ; <。>
- - - - - - 0x02B5AC 14:B59C: F3        .byte $F3
- - - - - - 0x02B5AD 14:B59D: A5 B4     .word off_B4A5

off_B59F_C7:
- D - I - - 0x02B5AF 14:B59F: F8        .byte $F8
- D - I - - 0x02B5B0 14:B5A0: 03        .byte $03   ; <う>
- D - I - - 0x02B5B1 14:B5A1: F3        .byte $F3
- D - I - - 0x02B5B2 14:B5A2: E0 B2     .word off_B2E0
- - - - - - 0x02B5B4 14:B5A4: F0        .byte $F0

off_B5A5_C8:
- D - I - - 0x02B5B5 14:B5A5: F8        .byte $F8
- D - I - - 0x02B5B6 14:B5A6: 07        .byte $07   ; <き>
- D - I - - 0x02B5B7 14:B5A7: F3        .byte $F3
- D - I - - 0x02B5B8 14:B5A8: 4D B0     .word off_B04D

off_B5AA_C9:
- D - I - - 0x02B5BA 14:B5AA: F7        .byte $F7
- D - I - - 0x02B5BB 14:B5AB: 2F        .byte $2F   ; <っ>

off_B5AC_CA:
- D - I - - 0x02B5BC 14:B5AC: F7        .byte $F7
- D - I - - 0x02B5BD 14:B5AD: 00        .byte $00

off_B5AE_CB:
- D - I - - 0x02B5BE 14:B5AE: F7        .byte $F7
- D - I - - 0x02B5BF 14:B5AF: 04        .byte $04   ; <え>

off_B5B0_CC:
- - - - - - 0x02B5C0 14:B5B0: F7        .byte $F7
- - - - - - 0x02B5C1 14:B5B1: 06        .byte $06   ; <か>

off_B5B2_CD:
- D - I - - 0x02B5C2 14:B5B2: F7        .byte $F7
- D - I - - 0x02B5C3 14:B5B3: 0A        .byte $0A   ; <こ>

off_B5B4_CE:
off_B5B4:
- D - I - - 0x02B5C4 14:B5B4: 02        .byte $02   ; <い>
- D - I - - 0x02B5C5 14:B5B5: 43        .byte $43   ; <ウ>
- D - I - - 0x02B5C6 14:B5B6: 02        .byte $02   ; <い>
- D - I - - 0x02B5C7 14:B5B7: 44        .byte $44   ; <エ>
- - - - - - 0x02B5C8 14:B5B8: 02        .byte $02   ; <い>
- - - - - - 0x02B5C9 14:B5B9: 45        .byte $45   ; <オ>
- - - - - - 0x02B5CA 14:B5BA: 02        .byte $02   ; <い>
- - - - - - 0x02B5CB 14:B5BB: 46        .byte $46   ; <カ>
- - - - - - 0x02B5CC 14:B5BC: F3        .byte $F3
- - - - - - 0x02B5CD 14:B5BD: B4 B5     .word off_B5B4

off_B5BF_CF:
- D - I - - 0x02B5CF 14:B5BF: 02        .byte $02   ; <い>
- D - I - - 0x02B5D0 14:B5C0: 7D        .byte $7D   ; <ー>
- D - I - - 0x02B5D1 14:B5C1: 02        .byte $02   ; <い>
- D - I - - 0x02B5D2 14:B5C2: 7C        .byte $7C   ; <~>
- D - I - - 0x02B5D3 14:B5C3: 02        .byte $02   ; <い>
- D - I - - 0x02B5D4 14:B5C4: 7B        .byte $7B   ; <。>
- D - I - - 0x02B5D5 14:B5C5: 02        .byte $02   ; <い>
- D - I - - 0x02B5D6 14:B5C6: 7A        .byte $7A   ; <、>
- D - I - - 0x02B5D7 14:B5C7: 02        .byte $02   ; <い>
- D - I - - 0x02B5D8 14:B5C8: 79        .byte $79   ; <!>
- D - I - - 0x02B5D9 14:B5C9: 02        .byte $02   ; <い>
- D - I - - 0x02B5DA 14:B5CA: 78        .byte $78   ; <?>
- D - I - - 0x02B5DB 14:B5CB: 02        .byte $02   ; <い>
- D - I - - 0x02B5DC 14:B5CC: 77        .byte $77   ; <:>
- D - I - - 0x02B5DD 14:B5CD: F6        .byte $F6
- D - I - - 0x02B5DE 14:B5CE: FE        .byte $FE
- D - I - - 0x02B5DF 14:B5CF: 01        .byte $01   ; <あ>
- D - I - - 0x02B5E0 14:B5D0: 02        .byte $02   ; <い>
- D - I - - 0x02B5E1 14:B5D1: 76        .byte $76   ; <ォ>
- D - I - - 0x02B5E2 14:B5D2: F6        .byte $F6
- D - I - - 0x02B5E3 14:B5D3: FE        .byte $FE
- D - I - - 0x02B5E4 14:B5D4: 01        .byte $01   ; <あ>
- D - I - - 0x02B5E5 14:B5D5: 02        .byte $02   ; <い>
- D - I - - 0x02B5E6 14:B5D6: 75        .byte $75   ; <ェ>
- D - I - - 0x02B5E7 14:B5D7: 02        .byte $02   ; <い>
- D - I - - 0x02B5E8 14:B5D8: 74        .byte $74   ; <ィ>
- D - I - - 0x02B5E9 14:B5D9: F6        .byte $F6
- D - I - - 0x02B5EA 14:B5DA: 00        .byte $00
- D - I - - 0x02B5EB 14:B5DB: 01        .byte $01   ; <あ>
- D - I - - 0x02B5EC 14:B5DC: 02        .byte $02   ; <い>
- D - I - - 0x02B5ED 14:B5DD: 73        .byte $73   ; <ヮ>
- D - I - - 0x02B5EE 14:B5DE: F6        .byte $F6
- D - I - - 0x02B5EF 14:B5DF: 01        .byte $01   ; <あ>
- D - I - - 0x02B5F0 14:B5E0: 00        .byte $00
- D - I - - 0x02B5F1 14:B5E1: 02        .byte $02   ; <い>
- D - I - - 0x02B5F2 14:B5E2: 72        .byte $72   ; <ョ>
off_B5E3:
- D - I - - 0x02B5F3 14:B5E3: F6        .byte $F6
- D - I - - 0x02B5F4 14:B5E4: 00        .byte $00
- D - I - - 0x02B5F5 14:B5E5: 01        .byte $01   ; <あ>
- D - I - - 0x02B5F6 14:B5E6: 02        .byte $02   ; <い>
- D - I - - 0x02B5F7 14:B5E7: 71        .byte $71   ; <ュ>
- D - I - - 0x02B5F8 14:B5E8: F1        .byte $F1
- D - I - - 0x02B5F9 14:B5E9: F2        .byte $F2
- D - I - - 0x02B5FA 14:B5EA: F6        .byte $F6
- D - I - - 0x02B5FB 14:B5EB: 00        .byte $00
- D - I - - 0x02B5FC 14:B5EC: 01        .byte $01   ; <あ>
- D - I - - 0x02B5FD 14:B5ED: 02        .byte $02   ; <い>
- D - I - - 0x02B5FE 14:B5EE: 71        .byte $71   ; <ュ>
- D - I - - 0x02B5FF 14:B5EF: F3        .byte $F3
- D - I - - 0x02B600 14:B5F0: E3 B5     .word off_B5E3

off_B5F2_D0:
- D - I - - 0x02B602 14:B5F2: F8        .byte $F8
- D - I - - 0x02B603 14:B5F3: 01        .byte $01   ; <あ>
- D - I - - 0x02B604 14:B5F4: F3        .byte $F3
- D - I - - 0x02B605 14:B5F5: 0E AF     .word off_AF0E

off_B5F7_D1:
- D - I - - 0x02B607 14:B5F7: F8        .byte $F8
- D - I - - 0x02B608 14:B5F8: 01        .byte $01   ; <あ>
- D - I - - 0x02B609 14:B5F9: F3        .byte $F3
- D - I - - 0x02B60A 14:B5FA: 0E B0     .word off_B00E

off_B5FC_D2:
- D - I - - 0x02B60C 14:B5FC: F8        .byte $F8
- D - I - - 0x02B60D 14:B5FD: 01        .byte $01   ; <あ>
- D - I - - 0x02B60E 14:B5FE: F3        .byte $F3
- D - I - - 0x02B60F 14:B5FF: 1E AF     .word off_AF1E

off_B601_D3:
- D - I - - 0x02B611 14:B601: F8        .byte $F8
- D - I - - 0x02B612 14:B602: 00        .byte $00
- D - I - - 0x02B613 14:B603: F3        .byte $F3
- D - I - - 0x02B614 14:B604: 14 B3     .word off_B314

off_B606_D4:
- D - I - - 0x02B616 14:B606: F8        .byte $F8
- D - I - - 0x02B617 14:B607: 02        .byte $02   ; <い>
- D - I - - 0x02B618 14:B608: F3        .byte $F3
- D - I - - 0x02B619 14:B609: 14 B3     .word off_B314

off_B60B_D5:
- D - I - - 0x02B61B 14:B60B: F8        .byte $F8
- D - I - - 0x02B61C 14:B60C: 07        .byte $07   ; <き>
- D - I - - 0x02B61D 14:B60D: F3        .byte $F3
- D - I - - 0x02B61E 14:B60E: 14 B3     .word off_B314

off_B610_D6:
- D - I - - 0x02B620 14:B610: F8        .byte $F8
- D - I - - 0x02B621 14:B611: 04        .byte $04   ; <え>
- D - I - - 0x02B622 14:B612: F3        .byte $F3
- D - I - - 0x02B623 14:B613: 14 B3     .word off_B314

off_B615_D7:
- - - - - - 0x02B625 14:B615: F8        .byte $F8
- - - - - - 0x02B626 14:B616: 05        .byte $05   ; <お>
- - - - - - 0x02B627 14:B617: F3        .byte $F3
- - - - - - 0x02B628 14:B618: 14 B3     .word off_B314

off_B61A_D8:
- D - I - - 0x02B62A 14:B61A: F8        .byte $F8
- D - I - - 0x02B62B 14:B61B: 01        .byte $01   ; <あ>
- D - I - - 0x02B62C 14:B61C: F3        .byte $F3
- D - I - - 0x02B62D 14:B61D: 14 B3     .word off_B314

off_B61F_D9:
- D - I - - 0x02B62F 14:B61F: F8        .byte $F8
- D - I - - 0x02B630 14:B620: 07        .byte $07   ; <き>
- D - I - - 0x02B631 14:B621: F3        .byte $F3
- D - I - - 0x02B632 14:B622: 28 B3     .word off_B328

off_B624_DA:
- D - I - - 0x02B634 14:B624: F8        .byte $F8
- D - I - - 0x02B635 14:B625: 00        .byte $00
- D - I - - 0x02B636 14:B626: F3        .byte $F3
- D - I - - 0x02B637 14:B627: E0 B2     .word off_B2E0

off_B629_DB:
- D - I - - 0x02B639 14:B629: F8        .byte $F8
- D - I - - 0x02B63A 14:B62A: 02        .byte $02   ; <い>
- D - I - - 0x02B63B 14:B62B: F3        .byte $F3
- D - I - - 0x02B63C 14:B62C: E0 B2     .word off_B2E0

off_B62E_DC:
- D - I - - 0x02B63E 14:B62E: F8        .byte $F8
- D - I - - 0x02B63F 14:B62F: 07        .byte $07   ; <き>
- D - I - - 0x02B640 14:B630: F3        .byte $F3
- D - I - - 0x02B641 14:B631: E0 B2     .word off_B2E0

off_B633_DD:
- D - I - - 0x02B643 14:B633: F8        .byte $F8
- D - I - - 0x02B644 14:B634: 04        .byte $04   ; <え>
- D - I - - 0x02B645 14:B635: F3        .byte $F3
- D - I - - 0x02B646 14:B636: E0 B2     .word off_B2E0

off_B638_DE:
- - - - - - 0x02B648 14:B638: F8        .byte $F8
- - - - - - 0x02B649 14:B639: 05        .byte $05   ; <お>
- - - - - - 0x02B64A 14:B63A: F3        .byte $F3
- - - - - - 0x02B64B 14:B63B: E0 B2     .word off_B2E0

off_B63D_DF:
- D - I - - 0x02B64D 14:B63D: F8        .byte $F8
- D - I - - 0x02B64E 14:B63E: 01        .byte $01   ; <あ>
- D - I - - 0x02B64F 14:B63F: F3        .byte $F3
- D - I - - 0x02B650 14:B640: E0 B2     .word off_B2E0

off_B642_E0:
- D - I - - 0x02B652 14:B642: F8        .byte $F8
- D - I - - 0x02B653 14:B643: 00        .byte $00
- D - I - - 0x02B654 14:B644: F3        .byte $F3
- D - I - - 0x02B655 14:B645: EF B2     .word off_B2EF

off_B647_E1:
- D - I - - 0x02B657 14:B647: F8        .byte $F8
- D - I - - 0x02B658 14:B648: 02        .byte $02   ; <い>
- D - I - - 0x02B659 14:B649: F3        .byte $F3
- D - I - - 0x02B65A 14:B64A: EF B2     .word off_B2EF

off_B64C_E2:
- D - I - - 0x02B65C 14:B64C: F8        .byte $F8
- D - I - - 0x02B65D 14:B64D: 07        .byte $07   ; <き>
- D - I - - 0x02B65E 14:B64E: F3        .byte $F3
- D - I - - 0x02B65F 14:B64F: EF B2     .word off_B2EF

off_B651_E3:
- D - I - - 0x02B661 14:B651: F8        .byte $F8
- D - I - - 0x02B662 14:B652: 04        .byte $04   ; <え>
- D - I - - 0x02B663 14:B653: F3        .byte $F3
- D - I - - 0x02B664 14:B654: EF B2     .word off_B2EF

off_B656_E4:
- - - - - - 0x02B666 14:B656: F8        .byte $F8
- - - - - - 0x02B667 14:B657: 05        .byte $05   ; <お>
- - - - - - 0x02B668 14:B658: F3        .byte $F3
- - - - - - 0x02B669 14:B659: EF B2     .word off_B2EF

off_B65B_E5:
- D - I - - 0x02B66B 14:B65B: F8        .byte $F8
- D - I - - 0x02B66C 14:B65C: 01        .byte $01   ; <あ>
- D - I - - 0x02B66D 14:B65D: F3        .byte $F3
- D - I - - 0x02B66E 14:B65E: EF B2     .word off_B2EF

off_B660_E6:
- D - I - - 0x02B670 14:B660: F8        .byte $F8
- D - I - - 0x02B671 14:B661: 03        .byte $03   ; <う>
- D - I - - 0x02B672 14:B662: F3        .byte $F3
- D - I - - 0x02B673 14:B663: EF B2     .word off_B2EF
- - - - - - 0x02B675 14:B665: F0        .byte $F0

off_B666_E7:
- D - I - - 0x02B676 14:B666: F7        .byte $F7
- D - I - - 0x02B677 14:B667: 70        .byte $70   ; <ャ>

off_B668_E8:
- D - I - - 0x02B678 14:B668: F7        .byte $F7
- D - I - - 0x02B679 14:B669: D3        .byte $D3

off_B66A_E9:
- D - I - - 0x02B67A 14:B66A: F7        .byte $F7
- D - I - - 0x02B67B 14:B66B: D4        .byte $D4

off_B66C_EA:
- D - I - - 0x02B67C 14:B66C: F7        .byte $F7
- D - I - - 0x02B67D 14:B66D: D5        .byte $D5

off_B66E_EB:
off_B66E:
- - - - - - 0x02B67E 14:B66E: 01        .byte $01   ; <あ>
- - - - - - 0x02B67F 14:B66F: 71        .byte $71   ; <ュ>
- - - - - - 0x02B680 14:B670: F1        .byte $F1
- - - - - - 0x02B681 14:B671: 01        .byte $01   ; <あ>
- - - - - - 0x02B682 14:B672: 71        .byte $71   ; <ュ>
- - - - - - 0x02B683 14:B673: F2        .byte $F2
- - - - - - 0x02B684 14:B674: F1        .byte $F1
- - - - - - 0x02B685 14:B675: 01        .byte $01   ; <あ>
- - - - - - 0x02B686 14:B676: 71        .byte $71   ; <ュ>
- - - - - - 0x02B687 14:B677: F2        .byte $F2
- - - - - - 0x02B688 14:B678: 01        .byte $01   ; <あ>
- - - - - - 0x02B689 14:B679: 71        .byte $71   ; <ュ>
- - - - - - 0x02B68A 14:B67A: F3        .byte $F3
- - - - - - 0x02B68B 14:B67B: 6E B6     .word off_B66E

off_B67D_EC:
off_B67D:
- D - I - - 0x02B68D 14:B67D: F6        .byte $F6
- D - I - - 0x02B68E 14:B67E: F0        .byte $F0
- D - I - - 0x02B68F 14:B67F: 10        .byte $10   ; <た>
- D - I - - 0x02B690 14:B680: 01        .byte $01   ; <あ>
- D - I - - 0x02B691 14:B681: 71        .byte $71   ; <ュ>
- D - I - - 0x02B692 14:B682: F6        .byte $F6
- D - I - - 0x02B693 14:B683: E0        .byte $E0
- D - I - - 0x02B694 14:B684: 00        .byte $00
- D - I - - 0x02B695 14:B685: 01        .byte $01   ; <あ>
- D - I - - 0x02B696 14:B686: 71        .byte $71   ; <ュ>
- D - I - - 0x02B697 14:B687: F6        .byte $F6
- D - I - - 0x02B698 14:B688: F0        .byte $F0
- D - I - - 0x02B699 14:B689: 10        .byte $10   ; <た>
- D - I - - 0x02B69A 14:B68A: 01        .byte $01   ; <あ>
- D - I - - 0x02B69B 14:B68B: 71        .byte $71   ; <ュ>
- D - I - - 0x02B69C 14:B68C: F1        .byte $F1
- D - I - - 0x02B69D 14:B68D: F6        .byte $F6
- D - I - - 0x02B69E 14:B68E: 10        .byte $10   ; <た>
- D - I - - 0x02B69F 14:B68F: 10        .byte $10   ; <た>
- D - I - - 0x02B6A0 14:B690: 01        .byte $01   ; <あ>
- D - I - - 0x02B6A1 14:B691: 71        .byte $71   ; <ュ>
- D - I - - 0x02B6A2 14:B692: F1        .byte $F1
- D - I - - 0x02B6A3 14:B693: F6        .byte $F6
- D - I - - 0x02B6A4 14:B694: 20        .byte $20   ; <み>
- D - I - - 0x02B6A5 14:B695: 00        .byte $00
- D - I - - 0x02B6A6 14:B696: 01        .byte $01   ; <あ>
- D - I - - 0x02B6A7 14:B697: 71        .byte $71   ; <ュ>
- D - I - - 0x02B6A8 14:B698: F1        .byte $F1
- D - I - - 0x02B6A9 14:B699: F6        .byte $F6
- D - I - - 0x02B6AA 14:B69A: 10        .byte $10   ; <た>
- D - I - - 0x02B6AB 14:B69B: 10        .byte $10   ; <た>
- D - I - - 0x02B6AC 14:B69C: 01        .byte $01   ; <あ>
- D - I - - 0x02B6AD 14:B69D: 71        .byte $71   ; <ュ>
- D - I - - 0x02B6AE 14:B69E: F3        .byte $F3
- D - I - - 0x02B6AF 14:B69F: 7D B6     .word off_B67D

off_B6A1_ED:
- D - I - - 0x02B6B1 14:B6A1: F8        .byte $F8
- D - I - - 0x02B6B2 14:B6A2: 0E        .byte $0E   ; <せ>
- D - I - - 0x02B6B3 14:B6A3: 78        .byte $78   ; <?>
- D - I - - 0x02B6B4 14:B6A4: 51        .byte $51   ; <チ>
off_B6A5:
- D - I - - 0x02B6B5 14:B6A5: F6        .byte $F6
- D - I - - 0x02B6B6 14:B6A6: FF        .byte $FF
- D - I - - 0x02B6B7 14:B6A7: 00        .byte $00
- D - I - - 0x02B6B8 14:B6A8: 01        .byte $01   ; <あ>
- D - I - - 0x02B6B9 14:B6A9: 51        .byte $51   ; <チ>
- D - I - - 0x02B6BA 14:B6AA: F6        .byte $F6
- D - I - - 0x02B6BB 14:B6AB: FE        .byte $FE
- D - I - - 0x02B6BC 14:B6AC: 00        .byte $00
- D - I - - 0x02B6BD 14:B6AD: 02        .byte $02   ; <い>
- D - I - - 0x02B6BE 14:B6AE: 51        .byte $51   ; <チ>
- D - I - - 0x02B6BF 14:B6AF: F6        .byte $F6
- D - I - - 0x02B6C0 14:B6B0: FD        .byte $FD
- D - I - - 0x02B6C1 14:B6B1: 00        .byte $00
- D - I - - 0x02B6C2 14:B6B2: 03        .byte $03   ; <う>
- D - I - - 0x02B6C3 14:B6B3: 51        .byte $51   ; <チ>
- D - I - - 0x02B6C4 14:B6B4: F6        .byte $F6
- D - I - - 0x02B6C5 14:B6B5: FE        .byte $FE
- D - I - - 0x02B6C6 14:B6B6: 00        .byte $00
- D - I - - 0x02B6C7 14:B6B7: 02        .byte $02   ; <い>
- D - I - - 0x02B6C8 14:B6B8: 51        .byte $51   ; <チ>
- D - I - - 0x02B6C9 14:B6B9: F6        .byte $F6
- D - I - - 0x02B6CA 14:B6BA: FF        .byte $FF
- D - I - - 0x02B6CB 14:B6BB: 00        .byte $00
- D - I - - 0x02B6CC 14:B6BC: 01        .byte $01   ; <あ>
- D - I - - 0x02B6CD 14:B6BD: 51        .byte $51   ; <チ>
- D - I - - 0x02B6CE 14:B6BE: F6        .byte $F6
- D - I - - 0x02B6CF 14:B6BF: 00        .byte $00
- D - I - - 0x02B6D0 14:B6C0: 00        .byte $00
- D - I - - 0x02B6D1 14:B6C1: 01        .byte $01   ; <あ>
- D - I - - 0x02B6D2 14:B6C2: 51        .byte $51   ; <チ>
- D - I - - 0x02B6D3 14:B6C3: F3        .byte $F3
- D - I - - 0x02B6D4 14:B6C4: A5 B6     .word off_B6A5

off_B6C6_EE:
- - - - - - 0x02B6D6 14:B6C6: F0        .byte $F0



off_B6C7:
- D - I - - 0x02B6D7 14:B6C7: 15        .byte $15   ; 
- D - I - - 0x02B6D8 14:B6C8: 0F        .byte $0F   ; 
- D - I - - 0x02B6D9 14:B6C9: 32        .byte $32   ; 
- D - I - - 0x02B6DA 14:B6CA: 30        .byte $30   ; 
- D - I - - 0x02B6DB 14:B6CB: 30        .byte $30   ; 
- D - I - - 0x02B6DC 14:B6CC: 36        .byte $36   ; 
- D - I - - 0x02B6DD 14:B6CD: 0F        .byte $0F   ; 
- D - I - - 0x02B6DE 14:B6CE: 14        .byte $14   ; 
- D - I - - 0x02B6DF 14:B6CF: 30        .byte $30   ; 
- D - I - - 0x02B6E0 14:B6D0: 30        .byte $30   ; 
- D - I - - 0x02B6E1 14:B6D1: 26        .byte $26   ; 
- D - I - - 0x02B6E2 14:B6D2: 00        .byte $00   ; 
- D - I - - 0x02B6E3 14:B6D3: 2C        .byte $2C   ; 
- D - I - - 0x02B6E4 14:B6D4: 16        .byte $16   ; 
- D - I - - 0x02B6E5 14:B6D5: 30        .byte $30   ; 
- D - I - - 0x02B6E6 14:B6D6: 15        .byte $15   ; 
- D - I - - 0x02B6E7 14:B6D7: 0F        .byte $0F   ; 
- D - I - - 0x02B6E8 14:B6D8: 29        .byte $29   ; 
- D - I - - 0x02B6E9 14:B6D9: 30        .byte $30   ; 
- D - I - - 0x02B6EA 14:B6DA: 30        .byte $30   ; 
- D - I - - 0x02B6EB 14:B6DB: 26        .byte $26   ; 
- D - I - - 0x02B6EC 14:B6DC: 0F        .byte $0F   ; 
- D - I - - 0x02B6ED 14:B6DD: 00        .byte $00   ; 
- D - I - - 0x02B6EE 14:B6DE: 30        .byte $30   ; 
- D - I - - 0x02B6EF 14:B6DF: 30        .byte $30   ; 
- D - I - - 0x02B6F0 14:B6E0: 15        .byte $15   ; 
- D - I - - 0x02B6F1 14:B6E1: 0F        .byte $0F   ; 
- D - I - - 0x02B6F2 14:B6E2: 16        .byte $16   ; 
- D - I - - 0x02B6F3 14:B6E3: 00        .byte $00   ; 
- D - I - - 0x02B6F4 14:B6E4: 30        .byte $30   ; 
- D - I - - 0x02B6F5 14:B6E5: 36        .byte $36   ; 
- D - I - - 0x02B6F6 14:B6E6: 0F        .byte $0F   ; 
- D - I - - 0x02B6F7 14:B6E7: 11        .byte $11   ; 
- D - I - - 0x02B6F8 14:B6E8: 37        .byte $37   ; 
- D - I - - 0x02B6F9 14:B6E9: 30        .byte $30   ; 
- D - I - - 0x02B6FA 14:B6EA: 36        .byte $36   ; 
- D - I - - 0x02B6FB 14:B6EB: 0F        .byte $0F   ; 
- D - I - - 0x02B6FC 14:B6EC: 19        .byte $19   ; 
- D - I - - 0x02B6FD 14:B6ED: 30        .byte $30   ; 
- D - I - - 0x02B6FE 14:B6EE: 30        .byte $30   ; 
- D - I - - 0x02B6FF 14:B6EF: 36        .byte $36   ; 
- D - I - - 0x02B700 14:B6F0: 0F        .byte $0F   ; 
- D - I - - 0x02B701 14:B6F1: 12        .byte $12   ; 
- D - I - - 0x02B702 14:B6F2: 31        .byte $31   ; 
- D - I - - 0x02B703 14:B6F3: 30        .byte $30   ; 
- D - I - - 0x02B704 14:B6F4: 36        .byte $36   ; 
- D - I - - 0x02B705 14:B6F5: 0F        .byte $0F   ; 
- D - I - - 0x02B706 14:B6F6: 30        .byte $30   ; 
- D - I - - 0x02B707 14:B6F7: 24        .byte $24   ; 
- D - I - - 0x02B708 14:B6F8: 30        .byte $30   ; 
- D - I - - 0x02B709 14:B6F9: 36        .byte $36   ; 
- D - I - - 0x02B70A 14:B6FA: 0F        .byte $0F   ; 
- D - I - - 0x02B70B 14:B6FB: 37        .byte $37   ; 
- D - I - - 0x02B70C 14:B6FC: 30        .byte $30   ; 
- D - I - - 0x02B70D 14:B6FD: 30        .byte $30   ; 
- D - I - - 0x02B70E 14:B6FE: 36        .byte $36   ; 
- D - I - - 0x02B70F 14:B6FF: 0F        .byte $0F   ; 
- D - I - - 0x02B710 14:B700: 00        .byte $00   ; 
- D - I - - 0x02B711 14:B701: 0F        .byte $0F   ; 
- D - I - - 0x02B712 14:B702: 30        .byte $30   ; 
- D - I - - 0x02B713 14:B703: 35        .byte $35   ; 
- D - I - - 0x02B714 14:B704: 27        .byte $27   ; 
- D - I - - 0x02B715 14:B705: 16        .byte $16   ; 
- D - I - - 0x02B716 14:B706: 16        .byte $16   ; 
- D - I - - 0x02B717 14:B707: 30        .byte $30   ; 
- D - I - - 0x02B718 14:B708: 36        .byte $36   ; 
- D - I - - 0x02B719 14:B709: 0F        .byte $0F   ; 
- D - I - - 0x02B71A 14:B70A: 31        .byte $31   ; 
- D - I - - 0x02B71B 14:B70B: 30        .byte $30   ; 
- D - I - - 0x02B71C 14:B70C: 30        .byte $30   ; 
- D - I - - 0x02B71D 14:B70D: 35        .byte $35   ; 
- D - I - - 0x02B71E 14:B70E: 27        .byte $27   ; 
- D - I - - 0x02B71F 14:B70F: 30        .byte $30   ; 
- D - I - - 0x02B720 14:B710: 29        .byte $29   ; 
- D - I - - 0x02B721 14:B711: 30        .byte $30   ; 
- - - - - - 0x02B722 14:B712: 00        .byte $00   ; 
- - - - - - 0x02B723 14:B713: 00        .byte $00   ; 
- - - - - - 0x02B724 14:B714: 00        .byte $00   ; 
- - - - - - 0x02B725 14:B715: 00        .byte $00   ; 
- - - - - - 0x02B726 14:B716: 00        .byte $00   ; 
- D - I - - 0x02B727 14:B717: 27        .byte $27   ; 
- D - I - - 0x02B728 14:B718: 00        .byte $00   ; 
- D - I - - 0x02B729 14:B719: 23        .byte $23   ; 
- D - I - - 0x02B72A 14:B71A: 30        .byte $30   ; 
- D - I - - 0x02B72B 14:B71B: 30        .byte $30   ; 
- D - I - - 0x02B72C 14:B71C: 36        .byte $36   ; 
- D - I - - 0x02B72D 14:B71D: 00        .byte $00   ; 
- D - I - - 0x02B72E 14:B71E: 37        .byte $37   ; 
- D - I - - 0x02B72F 14:B71F: 16        .byte $16   ; 
- D - I - - 0x02B730 14:B720: 30        .byte $30   ; 
- D - I - - 0x02B731 14:B721: 27        .byte $27   ; 
- D - I - - 0x02B732 14:B722: 0F        .byte $0F   ; 
- D - I - - 0x02B733 14:B723: 29        .byte $29   ; 
- D - I - - 0x02B734 14:B724: 19        .byte $19   ; 
- D - I - - 0x02B735 14:B725: 30        .byte $30   ; 
- D - I - - 0x02B736 14:B726: 36        .byte $36   ; 
- D - I - - 0x02B737 14:B727: 0F        .byte $0F   ; 
- D - I - - 0x02B738 14:B728: 27        .byte $27   ; 
- D - I - - 0x02B739 14:B729: 16        .byte $16   ; 
- D - I - - 0x02B73A 14:B72A: 30        .byte $30   ; 
- D - I - - 0x02B73B 14:B72B: 27        .byte $27   ; 
- D - I - - 0x02B73C 14:B72C: 0F        .byte $0F   ; 
- D - I - - 0x02B73D 14:B72D: 11        .byte $11   ; 
- D - I - - 0x02B73E 14:B72E: 11        .byte $11   ; 
- D - I - - 0x02B73F 14:B72F: 30        .byte $30   ; 
- D - I - - 0x02B740 14:B730: 36        .byte $36   ; 
- D - I - - 0x02B741 14:B731: 0F        .byte $0F   ; 
- D - I - - 0x02B742 14:B732: 11        .byte $11   ; 
- D - I - - 0x02B743 14:B733: 16        .byte $16   ; 
- D - I - - 0x02B744 14:B734: 30        .byte $30   ; 
- D - I - - 0x02B745 14:B735: 15        .byte $15   ; 
- D - I - - 0x02B746 14:B736: 0F        .byte $0F   ; 
- D - I - - 0x02B747 14:B737: 30        .byte $30   ; 
- D - I - - 0x02B748 14:B738: 29        .byte $29   ; 
- D - I - - 0x02B749 14:B739: 30        .byte $30   ; 
- D - I - - 0x02B74A 14:B73A: 35        .byte $35   ; 
- D - I - - 0x02B74B 14:B73B: 37        .byte $37   ; 
- D - I - - 0x02B74C 14:B73C: 30        .byte $30   ; 
- D - I - - 0x02B74D 14:B73D: 16        .byte $16   ; 
- D - I - - 0x02B74E 14:B73E: 30        .byte $30   ; 
- D - I - - 0x02B74F 14:B73F: 35        .byte $35   ; 
- D - I - - 0x02B750 14:B740: 27        .byte $27   ; 
- D - I - - 0x02B751 14:B741: 37        .byte $37   ; 
- D - I - - 0x02B752 14:B742: 37        .byte $37   ; 
- D - I - - 0x02B753 14:B743: 30        .byte $30   ; 
- D - I - - 0x02B754 14:B744: 35        .byte $35   ; 
- D - I - - 0x02B755 14:B745: 0F        .byte $0F   ; 
- D - I - - 0x02B756 14:B746: 30        .byte $30   ; 
- D - I - - 0x02B757 14:B747: 26        .byte $26   ; 
- D - I - - 0x02B758 14:B748: 30        .byte $30   ; 
- D - I - - 0x02B759 14:B749: 35        .byte $35   ; 
- D - I - - 0x02B75A 14:B74A: 37        .byte $37   ; 
- D - I - - 0x02B75B 14:B74B: 11        .byte $11   ; 
- D - I - - 0x02B75C 14:B74C: 30        .byte $30   ; 
- D - I - - 0x02B75D 14:B74D: 30        .byte $30   ; 
- D - I - - 0x02B75E 14:B74E: 36        .byte $36   ; 
- D - I - - 0x02B75F 14:B74F: 0F        .byte $0F   ; 
- D - I - - 0x02B760 14:B750: 29        .byte $29   ; 
- D - I - - 0x02B761 14:B751: 16        .byte $16   ; 
- D - I - - 0x02B762 14:B752: 30        .byte $30   ; 
- D - I - - 0x02B763 14:B753: 36        .byte $36   ; 
- D - I - - 0x02B764 14:B754: 37        .byte $37   ; 
- D - I - - 0x02B765 14:B755: 30        .byte $30   ; 
- D - I - - 0x02B766 14:B756: 11        .byte $11   ; 
- D - I - - 0x02B767 14:B757: 30        .byte $30   ; 
- D - I - - 0x02B768 14:B758: 35        .byte $35   ; 
- D - I - - 0x02B769 14:B759: 37        .byte $37   ; 
- D - I - - 0x02B76A 14:B75A: 26        .byte $26   ; 
- D - I - - 0x02B76B 14:B75B: 30        .byte $30   ; 
- D - I - - 0x02B76C 14:B75C: 30        .byte $30   ; 
- D - I - - 0x02B76D 14:B75D: 35        .byte $35   ; 
- D - I - - 0x02B76E 14:B75E: 0F        .byte $0F   ; 
- D - I - - 0x02B76F 14:B75F: 31        .byte $31   ; 
- D - I - - 0x02B770 14:B760: 0F        .byte $0F   ; 
- D - I - - 0x02B771 14:B761: 30        .byte $30   ; 
- D - I - - 0x02B772 14:B762: 35        .byte $35   ; 
- D - I - - 0x02B773 14:B763: 27        .byte $27   ; 
- D - I - - 0x02B774 14:B764: 30        .byte $30   ; 
- D - I - - 0x02B775 14:B765: 0F        .byte $0F   ; 
- D - I - - 0x02B776 14:B766: 30        .byte $30   ; 

off_B767:
- D - I - - 0x02B777 14:B767: 15        .byte $15   ; 
- D - I - - 0x02B778 14:B768: 31        .byte $31   ; 
- D - I - - 0x02B779 14:B769: 28        .byte $28   ; 
- D - I - - 0x02B77A 14:B76A: 1B        .byte $1B   ; 
- D - I - - 0x02B77B 14:B76B: 30        .byte $30   ; 
- D - I - - 0x02B77C 14:B76C: 36        .byte $36   ; 
- D - I - - 0x02B77D 14:B76D: 0F        .byte $0F   ; 
- D - I - - 0x02B77E 14:B76E: 22        .byte $22   ; 
- D - I - - 0x02B77F 14:B76F: 25        .byte $25   ; 
- D - I - - 0x02B780 14:B770: 30        .byte $30   ; 
- - - - - - 0x02B781 14:B771: 00        .byte $00   ; 
- - - - - - 0x02B782 14:B772: 00        .byte $00   ; 
- - - - - - 0x02B783 14:B773: 00        .byte $00   ; 
- - - - - - 0x02B784 14:B774: 00        .byte $00   ; 
- - - - - - 0x02B785 14:B775: 00        .byte $00   ; 
- D - I - - 0x02B786 14:B776: 36        .byte $36   ; 
- D - I - - 0x02B787 14:B777: 09        .byte $09   ; 
- D - I - - 0x02B788 14:B778: 26        .byte $26   ; 
- D - I - - 0x02B789 14:B779: 33        .byte $33   ; 
- D - I - - 0x02B78A 14:B77A: 30        .byte $30   ; 
- D - I - - 0x02B78B 14:B77B: 36        .byte $36   ; 
- D - I - - 0x02B78C 14:B77C: 25        .byte $25   ; 
- D - I - - 0x02B78D 14:B77D: 31        .byte $31   ; 
- D - I - - 0x02B78E 14:B77E: 27        .byte $27   ; 
- D - I - - 0x02B78F 14:B77F: 30        .byte $30   ; 
- D - I - - 0x02B790 14:B780: 15        .byte $15   ; 
- D - I - - 0x02B791 14:B781: 0F        .byte $0F   ; 
- D - I - - 0x02B792 14:B782: 37        .byte $37   ; 
- D - I - - 0x02B793 14:B783: 22        .byte $22   ; 
- D - I - - 0x02B794 14:B784: 30        .byte $30   ; 
- D - I - - 0x02B795 14:B785: 36        .byte $36   ; 
- D - I - - 0x02B796 14:B786: 11        .byte $11   ; 
- D - I - - 0x02B797 14:B787: 19        .byte $19   ; 
- D - I - - 0x02B798 14:B788: 29        .byte $29   ; 
- D - I - - 0x02B799 14:B789: 30        .byte $30   ; 
- D - I - - 0x02B79A 14:B78A: 36        .byte $36   ; 
- D - I - - 0x02B79B 14:B78B: 05        .byte $05   ; 
- D - I - - 0x02B79C 14:B78C: 19        .byte $19   ; 
- D - I - - 0x02B79D 14:B78D: 27        .byte $27   ; 
- D - I - - 0x02B79E 14:B78E: 30        .byte $30   ; 
- - - - - - 0x02B79F 14:B78F: 00        .byte $00   ; 
- - - - - - 0x02B7A0 14:B790: 00        .byte $00   ; 
- - - - - - 0x02B7A1 14:B791: 00        .byte $00   ; 
- - - - - - 0x02B7A2 14:B792: 00        .byte $00   ; 
- - - - - - 0x02B7A3 14:B793: 00        .byte $00   ; 
- D - I - - 0x02B7A4 14:B794: 36        .byte $36   ; 
- D - I - - 0x02B7A5 14:B795: 00        .byte $00   ; 
- D - I - - 0x02B7A6 14:B796: 16        .byte $16   ; 
- D - I - - 0x02B7A7 14:B797: 2C        .byte $2C   ; 
- D - I - - 0x02B7A8 14:B798: 30        .byte $30   ; 
- D - I - - 0x02B7A9 14:B799: 36        .byte $36   ; 
- D - I - - 0x02B7AA 14:B79A: 01        .byte $01   ; 
- D - I - - 0x02B7AB 14:B79B: 16        .byte $16   ; 
- D - I - - 0x02B7AC 14:B79C: 16        .byte $16   ; 
- D - I - - 0x02B7AD 14:B79D: 30        .byte $30   ; 
- - - - - - 0x02B7AE 14:B79E: 00        .byte $00   ; 
- - - - - - 0x02B7AF 14:B79F: 00        .byte $00   ; 
- - - - - - 0x02B7B0 14:B7A0: 00        .byte $00   ; 
- - - - - - 0x02B7B1 14:B7A1: 00        .byte $00   ; 
- - - - - - 0x02B7B2 14:B7A2: 00        .byte $00   ; 
- D - I - - 0x02B7B3 14:B7A3: 36        .byte $36   ; 
- D - I - - 0x02B7B4 14:B7A4: 26        .byte $26   ; 
- D - I - - 0x02B7B5 14:B7A5: 10        .byte $10   ; 
- D - I - - 0x02B7B6 14:B7A6: 27        .byte $27   ; 
- D - I - - 0x02B7B7 14:B7A7: 30        .byte $30   ; 
- D - I - - 0x02B7B8 14:B7A8: 26        .byte $26   ; 
- D - I - - 0x02B7B9 14:B7A9: 0F        .byte $0F   ; 
- D - I - - 0x02B7BA 14:B7AA: 0F        .byte $0F   ; 
- D - I - - 0x02B7BB 14:B7AB: 00        .byte $00   ; 
- D - I - - 0x02B7BC 14:B7AC: 30        .byte $30   ; 
- - - - - - 0x02B7BD 14:B7AD: 00        .byte $00   ; 
- - - - - - 0x02B7BE 14:B7AE: 00        .byte $00   ; 
- - - - - - 0x02B7BF 14:B7AF: 00        .byte $00   ; 
- - - - - - 0x02B7C0 14:B7B0: 00        .byte $00   ; 
- - - - - - 0x02B7C1 14:B7B1: 00        .byte $00   ; 
- - - - - - 0x02B7C2 14:B7B2: 00        .byte $00   ; 
- - - - - - 0x02B7C3 14:B7B3: 00        .byte $00   ; 
- - - - - - 0x02B7C4 14:B7B4: 00        .byte $00   ; 
- - - - - - 0x02B7C5 14:B7B5: 00        .byte $00   ; 
- - - - - - 0x02B7C6 14:B7B6: 00        .byte $00   ; 
- D - I - - 0x02B7C7 14:B7B7: 35        .byte $35   ; 
- D - I - - 0x02B7C8 14:B7B8: 27        .byte $27   ; 
- D - I - - 0x02B7C9 14:B7B9: 2B        .byte $2B   ; 
- D - I - - 0x02B7CA 14:B7BA: 28        .byte $28   ; 
- D - I - - 0x02B7CB 14:B7BB: 30        .byte $30   ; 
- D - I - - 0x02B7CC 14:B7BC: 36        .byte $36   ; 
- D - I - - 0x02B7CD 14:B7BD: 0F        .byte $0F   ; 
- D - I - - 0x02B7CE 14:B7BE: 25        .byte $25   ; 
- D - I - - 0x02B7CF 14:B7BF: 0B        .byte $0B   ; 
- D - I - - 0x02B7D0 14:B7C0: 30        .byte $30   ; 
- D - I - - 0x02B7D1 14:B7C1: 27        .byte $27   ; 
- D - I - - 0x02B7D2 14:B7C2: 0F        .byte $0F   ; 
- D - I - - 0x02B7D3 14:B7C3: 23        .byte $23   ; 
- D - I - - 0x02B7D4 14:B7C4: 26        .byte $26   ; 
- D - I - - 0x02B7D5 14:B7C5: 30        .byte $30   ; 
- D - I - - 0x02B7D6 14:B7C6: 36        .byte $36   ; 
- D - I - - 0x02B7D7 14:B7C7: 0C        .byte $0C   ; 
- D - I - - 0x02B7D8 14:B7C8: 3C        .byte $3C   ; 
- D - I - - 0x02B7D9 14:B7C9: 15        .byte $15   ; 
- D - I - - 0x02B7DA 14:B7CA: 30        .byte $30   ; 
- D - I - - 0x02B7DB 14:B7CB: 27        .byte $27   ; 
- D - I - - 0x02B7DC 14:B7CC: 01        .byte $01   ; 
- D - I - - 0x02B7DD 14:B7CD: 30        .byte $30   ; 
- D - I - - 0x02B7DE 14:B7CE: 10        .byte $10   ; 
- D - I - - 0x02B7DF 14:B7CF: 30        .byte $30   ; 
- D - I - - 0x02B7E0 14:B7D0: 36        .byte $36   ; 
- D - I - - 0x02B7E1 14:B7D1: 11        .byte $11   ; 
- D - I - - 0x02B7E2 14:B7D2: 30        .byte $30   ; 
- D - I - - 0x02B7E3 14:B7D3: 2B        .byte $2B   ; 
- D - I - - 0x02B7E4 14:B7D4: 30        .byte $30   ; 
- D - I - - 0x02B7E5 14:B7D5: 15        .byte $15   ; 
- D - I - - 0x02B7E6 14:B7D6: 0F        .byte $0F   ; 
- D - I - - 0x02B7E7 14:B7D7: 30        .byte $30   ; 
- D - I - - 0x02B7E8 14:B7D8: 25        .byte $25   ; 
- D - I - - 0x02B7E9 14:B7D9: 30        .byte $30   ; 
- - - - - - 0x02B7EA 14:B7DA: 00        .byte $00   ; 
- - - - - - 0x02B7EB 14:B7DB: 00        .byte $00   ; 
- - - - - - 0x02B7EC 14:B7DC: 00        .byte $00   ; 
- - - - - - 0x02B7ED 14:B7DD: 00        .byte $00   ; 
- - - - - - 0x02B7EE 14:B7DE: 00        .byte $00   ; 
- D - I - - 0x02B7EF 14:B7DF: 36        .byte $36   ; 
- D - I - - 0x02B7F0 14:B7E0: 26        .byte $26   ; 
- D - I - - 0x02B7F1 14:B7E1: 37        .byte $37   ; 
- D - I - - 0x02B7F2 14:B7E2: 00        .byte $00   ; 
- D - I - - 0x02B7F3 14:B7E3: 30        .byte $30   ; 
- - - - - - 0x02B7F4 14:B7E4: 00        .byte $00   ; 
- - - - - - 0x02B7F5 14:B7E5: 00        .byte $00   ; 
- - - - - - 0x02B7F6 14:B7E6: 00        .byte $00   ; 
- - - - - - 0x02B7F7 14:B7E7: 00        .byte $00   ; 
- - - - - - 0x02B7F8 14:B7E8: 00        .byte $00   ; 
- D - I - - 0x02B7F9 14:B7E9: 35        .byte $35   ; 
- D - I - - 0x02B7FA 14:B7EA: 37        .byte $37   ; 
- D - I - - 0x02B7FB 14:B7EB: 16        .byte $16   ; 
- D - I - - 0x02B7FC 14:B7EC: 29        .byte $29   ; 
- D - I - - 0x02B7FD 14:B7ED: 30        .byte $30   ; 
- D - I - - 0x02B7FE 14:B7EE: 36        .byte $36   ; 
- D - I - - 0x02B7FF 14:B7EF: 24        .byte $24   ; 
- D - I - - 0x02B800 14:B7F0: 30        .byte $30   ; 
- D - I - - 0x02B801 14:B7F1: 15        .byte $15   ; 
- D - I - - 0x02B802 14:B7F2: 30        .byte $30   ; 
- - - - - - 0x02B803 14:B7F3: 00        .byte $00   ; 
- - - - - - 0x02B804 14:B7F4: 00        .byte $00   ; 
- - - - - - 0x02B805 14:B7F5: 00        .byte $00   ; 
- - - - - - 0x02B806 14:B7F6: 00        .byte $00   ; 
- - - - - - 0x02B807 14:B7F7: 00        .byte $00   ; 
- D - I - - 0x02B808 14:B7F8: 36        .byte $36   ; 
- D - I - - 0x02B809 14:B7F9: 25        .byte $25   ; 
- D - I - - 0x02B80A 14:B7FA: 30        .byte $30   ; 
- D - I - - 0x02B80B 14:B7FB: 38        .byte $38   ; 
- D - I - - 0x02B80C 14:B7FC: 30        .byte $30   ; 
- D - I - - 0x02B80D 14:B7FD: 36        .byte $36   ; 
- D - I - - 0x02B80E 14:B7FE: 16        .byte $16   ; 
- D - I - - 0x02B80F 14:B7FF: 00        .byte $00   ; 
- D - I - - 0x02B810 14:B800: 10        .byte $10   ; 
- D - I - - 0x02B811 14:B801: 30        .byte $30   ; 
- - - - - - 0x02B812 14:B802: 00        .byte $00   ; 
- - - - - - 0x02B813 14:B803: 00        .byte $00   ; 
- - - - - - 0x02B814 14:B804: 00        .byte $00   ; 
- - - - - - 0x02B815 14:B805: 00        .byte $00   ; 
- - - - - - 0x02B816 14:B806: 00        .byte $00   ; 
- - - - - - 0x02B817 14:B807: 00        .byte $00   ; 
- - - - - - 0x02B818 14:B808: 00        .byte $00   ; 
- - - - - - 0x02B819 14:B809: 00        .byte $00   ; 
- - - - - - 0x02B81A 14:B80A: 00        .byte $00   ; 
- - - - - - 0x02B81B 14:B80B: 00        .byte $00   ; 

off_B80C:
- - - - - - 0x02B81C 14:B80C: 00        .byte $00   ; 
- - - - - - 0x02B81D 14:B80D: 00        .byte $00   ; 
- - - - - - 0x02B81E 14:B80E: 00        .byte $00   ; 
- - - - - - 0x02B81F 14:B80F: 00        .byte $00   ; 
- - - - - - 0x02B820 14:B810: 00        .byte $00   ; 
- D - I - - 0x02B821 14:B811: 36        .byte $36   ; 
- D - I - - 0x02B822 14:B812: 0F        .byte $0F   ; 
- D - I - - 0x02B823 14:B813: 30        .byte $30   ; 
- D - I - - 0x02B824 14:B814: 30        .byte $30   ; 
- D - I - - 0x02B825 14:B815: 30        .byte $30   ; 
- D - I - - 0x02B826 14:B816: 26        .byte $26   ; 
- D - I - - 0x02B827 14:B817: 00        .byte $00   ; 
- D - I - - 0x02B828 14:B818: 30        .byte $30   ; 
- D - I - - 0x02B829 14:B819: 37        .byte $37   ; 
- D - I - - 0x02B82A 14:B81A: 30        .byte $30   ; 
- D - I - - 0x02B82B 14:B81B: 15        .byte $15   ; 
- D - I - - 0x02B82C 14:B81C: 00        .byte $00   ; 
- D - I - - 0x02B82D 14:B81D: 30        .byte $30   ; 
- D - I - - 0x02B82E 14:B81E: 30        .byte $30   ; 
- D - I - - 0x02B82F 14:B81F: 30        .byte $30   ; 
- D - I - - 0x02B830 14:B820: 15        .byte $15   ; 
- D - I - - 0x02B831 14:B821: 0F        .byte $0F   ; 
- D - I - - 0x02B832 14:B822: 30        .byte $30   ; 
- D - I - - 0x02B833 14:B823: 30        .byte $30   ; 
- D - I - - 0x02B834 14:B824: 30        .byte $30   ; 
- D - I - - 0x02B835 14:B825: 15        .byte $15   ; 
- D - I - - 0x02B836 14:B826: 0F        .byte $0F   ; 
- D - I - - 0x02B837 14:B827: 30        .byte $30   ; 
- D - I - - 0x02B838 14:B828: 30        .byte $30   ; 
- D - I - - 0x02B839 14:B829: 30        .byte $30   ; 
- D - I - - 0x02B83A 14:B82A: 15        .byte $15   ; 
- D - I - - 0x02B83B 14:B82B: 37        .byte $37   ; 
- D - I - - 0x02B83C 14:B82C: 30        .byte $30   ; 
- D - I - - 0x02B83D 14:B82D: 30        .byte $30   ; 
- D - I - - 0x02B83E 14:B82E: 30        .byte $30   ; 
- D - I - - 0x02B83F 14:B82F: 36        .byte $36   ; 
- D - I - - 0x02B840 14:B830: 37        .byte $37   ; 
- D - I - - 0x02B841 14:B831: 30        .byte $30   ; 
- D - I - - 0x02B842 14:B832: 30        .byte $30   ; 
- D - I - - 0x02B843 14:B833: 30        .byte $30   ; 
- D - I - - 0x02B844 14:B834: 15        .byte $15   ; 
- D - I - - 0x02B845 14:B835: 0F        .byte $0F   ; 
- D - I - - 0x02B846 14:B836: 30        .byte $30   ; 
- D - I - - 0x02B847 14:B837: 30        .byte $30   ; 
- D - I - - 0x02B848 14:B838: 30        .byte $30   ; 
- D - I - - 0x02B849 14:B839: 35        .byte $35   ; 
- D - I - - 0x02B84A 14:B83A: 16        .byte $16   ; 
- D - I - - 0x02B84B 14:B83B: 30        .byte $30   ; 
- D - I - - 0x02B84C 14:B83C: 30        .byte $30   ; 
- D - I - - 0x02B84D 14:B83D: 30        .byte $30   ; 
- D - I - - 0x02B84E 14:B83E: 15        .byte $15   ; 
- D - I - - 0x02B84F 14:B83F: 26        .byte $26   ; 
- D - I - - 0x02B850 14:B840: 30        .byte $30   ; 
- D - I - - 0x02B851 14:B841: 30        .byte $30   ; 
- D - I - - 0x02B852 14:B842: 30        .byte $30   ; 
- D - I - - 0x02B853 14:B843: 15        .byte $15   ; 
- D - I - - 0x02B854 14:B844: 10        .byte $10   ; 
- D - I - - 0x02B855 14:B845: 30        .byte $30   ; 
- D - I - - 0x02B856 14:B846: 30        .byte $30   ; 
- D - I - - 0x02B857 14:B847: 30        .byte $30   ; 
- D - I - - 0x02B858 14:B848: 36        .byte $36   ; 
- D - I - - 0x02B859 14:B849: 0F        .byte $0F   ; 
- D - I - - 0x02B85A 14:B84A: 30        .byte $30   ; 
- D - I - - 0x02B85B 14:B84B: 11        .byte $11   ; 
- D - I - - 0x02B85C 14:B84C: 30        .byte $30   ; 
- D - I - - 0x02B85D 14:B84D: 36        .byte $36   ; 
- D - I - - 0x02B85E 14:B84E: 0F        .byte $0F   ; 
- D - I - - 0x02B85F 14:B84F: 30        .byte $30   ; 
- D - I - - 0x02B860 14:B850: 11        .byte $11   ; 
- D - I - - 0x02B861 14:B851: 30        .byte $30   ; 
- D - I - - 0x02B862 14:B852: 36        .byte $36   ; 
- D - I - - 0x02B863 14:B853: 0F        .byte $0F   ; 
- D - I - - 0x02B864 14:B854: 30        .byte $30   ; 
- D - I - - 0x02B865 14:B855: 11        .byte $11   ; 
- D - I - - 0x02B866 14:B856: 30        .byte $30   ; 
- D - I - - 0x02B867 14:B857: 36        .byte $36   ; 
- D - I - - 0x02B868 14:B858: 0F        .byte $0F   ; 
- D - I - - 0x02B869 14:B859: 30        .byte $30   ; 
- D - I - - 0x02B86A 14:B85A: 00        .byte $00   ; 
- D - I - - 0x02B86B 14:B85B: 30        .byte $30   ; 
- D - I - - 0x02B86C 14:B85C: 36        .byte $36   ; 
- D - I - - 0x02B86D 14:B85D: 0F        .byte $0F   ; 
- D - I - - 0x02B86E 14:B85E: 30        .byte $30   ; 
- D - I - - 0x02B86F 14:B85F: 11        .byte $11   ; 
- D - I - - 0x02B870 14:B860: 30        .byte $30   ; 
- D - I - - 0x02B871 14:B861: 36        .byte $36   ; 
- D - I - - 0x02B872 14:B862: 17        .byte $17   ; 
- D - I - - 0x02B873 14:B863: 30        .byte $30   ; 
- D - I - - 0x02B874 14:B864: 11        .byte $11   ; 
- D - I - - 0x02B875 14:B865: 30        .byte $30   ; 
- D - I - - 0x02B876 14:B866: 36        .byte $36   ; 
- D - I - - 0x02B877 14:B867: 0F        .byte $0F   ; 
- D - I - - 0x02B878 14:B868: 30        .byte $30   ; 
- D - I - - 0x02B879 14:B869: 11        .byte $11   ; 
- D - I - - 0x02B87A 14:B86A: 30        .byte $30   ; 
- D - I - - 0x02B87B 14:B86B: 36        .byte $36   ; 
- D - I - - 0x02B87C 14:B86C: 07        .byte $07   ; 
- D - I - - 0x02B87D 14:B86D: 30        .byte $30   ; 
- D - I - - 0x02B87E 14:B86E: 11        .byte $11   ; 
- D - I - - 0x02B87F 14:B86F: 30        .byte $30   ; 
- D - I - - 0x02B880 14:B870: 36        .byte $36   ; 
- D - I - - 0x02B881 14:B871: 0F        .byte $0F   ; 
- D - I - - 0x02B882 14:B872: 30        .byte $30   ; 
- D - I - - 0x02B883 14:B873: 11        .byte $11   ; 
- D - I - - 0x02B884 14:B874: 30        .byte $30   ; 
- D - I - - 0x02B885 14:B875: 36        .byte $36   ; 
- D - I - - 0x02B886 14:B876: 0F        .byte $0F   ; 
- D - I - - 0x02B887 14:B877: 30        .byte $30   ; 
- D - I - - 0x02B888 14:B878: 11        .byte $11   ; 
- D - I - - 0x02B889 14:B879: 30        .byte $30   ; 
- D - I - - 0x02B88A 14:B87A: 36        .byte $36   ; 
- D - I - - 0x02B88B 14:B87B: 00        .byte $00   ; 
- D - I - - 0x02B88C 14:B87C: 30        .byte $30   ; 
- D - I - - 0x02B88D 14:B87D: 11        .byte $11   ; 
- D - I - - 0x02B88E 14:B87E: 30        .byte $30   ; 
- D - I - - 0x02B88F 14:B87F: 36        .byte $36   ; 
- D - I - - 0x02B890 14:B880: 0F        .byte $0F   ; 
- D - I - - 0x02B891 14:B881: 16        .byte $16   ; 
- D - I - - 0x02B892 14:B882: 30        .byte $30   ; 
- D - I - - 0x02B893 14:B883: 30        .byte $30   ; 
- D - I - - 0x02B894 14:B884: 36        .byte $36   ; 
- D - I - - 0x02B895 14:B885: 0F        .byte $0F   ; 
- D - I - - 0x02B896 14:B886: 16        .byte $16   ; 
- D - I - - 0x02B897 14:B887: 30        .byte $30   ; 
- D - I - - 0x02B898 14:B888: 30        .byte $30   ; 
- D - I - - 0x02B899 14:B889: 36        .byte $36   ; 
- D - I - - 0x02B89A 14:B88A: 07        .byte $07   ; 
- D - I - - 0x02B89B 14:B88B: 16        .byte $16   ; 
- D - I - - 0x02B89C 14:B88C: 30        .byte $30   ; 
- D - I - - 0x02B89D 14:B88D: 30        .byte $30   ; 
- D - I - - 0x02B89E 14:B88E: 36        .byte $36   ; 
- D - I - - 0x02B89F 14:B88F: 0F        .byte $0F   ; 
- D - I - - 0x02B8A0 14:B890: 16        .byte $16   ; 
- D - I - - 0x02B8A1 14:B891: 30        .byte $30   ; 
- D - I - - 0x02B8A2 14:B892: 30        .byte $30   ; 
- D - I - - 0x02B8A3 14:B893: 36        .byte $36   ; 
- D - I - - 0x02B8A4 14:B894: 07        .byte $07   ; 
- D - I - - 0x02B8A5 14:B895: 16        .byte $16   ; 
- D - I - - 0x02B8A6 14:B896: 30        .byte $30   ; 
- D - I - - 0x02B8A7 14:B897: 30        .byte $30   ; 
- D - I - - 0x02B8A8 14:B898: 36        .byte $36   ; 
- D - I - - 0x02B8A9 14:B899: 00        .byte $00   ; 
- D - I - - 0x02B8AA 14:B89A: 16        .byte $16   ; 
- D - I - - 0x02B8AB 14:B89B: 30        .byte $30   ; 
- D - I - - 0x02B8AC 14:B89C: 30        .byte $30   ; 
- D - I - - 0x02B8AD 14:B89D: 36        .byte $36   ; 
- D - I - - 0x02B8AE 14:B89E: 00        .byte $00   ; 
- D - I - - 0x02B8AF 14:B89F: 16        .byte $16   ; 
- D - I - - 0x02B8B0 14:B8A0: 30        .byte $30   ; 
- D - I - - 0x02B8B1 14:B8A1: 30        .byte $30   ; 
- - - - - - 0x02B8B2 14:B8A2: 36        .byte $36   ; 
- - - - - - 0x02B8B3 14:B8A3: 0F        .byte $0F   ; 
- - - - - - 0x02B8B4 14:B8A4: 16        .byte $16   ; 
- - - - - - 0x02B8B5 14:B8A5: 30        .byte $30   ; 
- - - - - - 0x02B8B6 14:B8A6: 30        .byte $30   ; 
- - - - - - 0x02B8B7 14:B8A7: 36        .byte $36   ; 
- - - - - - 0x02B8B8 14:B8A8: 0F        .byte $0F   ; 
- - - - - - 0x02B8B9 14:B8A9: 16        .byte $16   ; 
- - - - - - 0x02B8BA 14:B8AA: 30        .byte $30   ; 
- - - - - - 0x02B8BB 14:B8AB: 30        .byte $30   ; 
- D - I - - 0x02B8BC 14:B8AC: 36        .byte $36   ; 
- D - I - - 0x02B8BD 14:B8AD: 15        .byte $15   ; 
- D - I - - 0x02B8BE 14:B8AE: 16        .byte $16   ; 
- D - I - - 0x02B8BF 14:B8AF: 30        .byte $30   ; 
- D - I - - 0x02B8C0 14:B8B0: 30        .byte $30   ; 
- D - I - - 0x02B8C1 14:B8B1: 36        .byte $36   ; 
- D - I - - 0x02B8C2 14:B8B2: 30        .byte $30   ; 
- D - I - - 0x02B8C3 14:B8B3: 30        .byte $30   ; 
- D - I - - 0x02B8C4 14:B8B4: 11        .byte $11   ; 
- D - I - - 0x02B8C5 14:B8B5: 30        .byte $30   ; 
- D - I - - 0x02B8C6 14:B8B6: 36        .byte $36   ; 
- D - I - - 0x02B8C7 14:B8B7: 0F        .byte $0F   ; 
- D - I - - 0x02B8C8 14:B8B8: 30        .byte $30   ; 
- D - I - - 0x02B8C9 14:B8B9: 11        .byte $11   ; 
- D - I - - 0x02B8CA 14:B8BA: 30        .byte $30   ; 
- D - I - - 0x02B8CB 14:B8BB: 35        .byte $35   ; 
- D - I - - 0x02B8CC 14:B8BC: 00        .byte $00   ; 
- D - I - - 0x02B8CD 14:B8BD: 14        .byte $14   ; 
- D - I - - 0x02B8CE 14:B8BE: 30        .byte $30   ; 
- D - I - - 0x02B8CF 14:B8BF: 30        .byte $30   ; 
- D - I - - 0x02B8D0 14:B8C0: 15        .byte $15   ; 
- D - I - - 0x02B8D1 14:B8C1: 00        .byte $00   ; 
- D - I - - 0x02B8D2 14:B8C2: 14        .byte $14   ; 
- D - I - - 0x02B8D3 14:B8C3: 30        .byte $30   ; 
- D - I - - 0x02B8D4 14:B8C4: 30        .byte $30   ; 
- D - I - - 0x02B8D5 14:B8C5: 36        .byte $36   ; 
- D - I - - 0x02B8D6 14:B8C6: 16        .byte $16   ; 
- D - I - - 0x02B8D7 14:B8C7: 2C        .byte $2C   ; 
- D - I - - 0x02B8D8 14:B8C8: 16        .byte $16   ; 
- D - I - - 0x02B8D9 14:B8C9: 30        .byte $30   ; 
- D - I - - 0x02B8DA 14:B8CA: 35        .byte $35   ; 
- D - I - - 0x02B8DB 14:B8CB: 11        .byte $11   ; 
- D - I - - 0x02B8DC 14:B8CC: 30        .byte $30   ; 
- D - I - - 0x02B8DD 14:B8CD: 22        .byte $22   ; 
- D - I - - 0x02B8DE 14:B8CE: 30        .byte $30   ; 
- D - I - - 0x02B8DF 14:B8CF: 35        .byte $35   ; 
- D - I - - 0x02B8E0 14:B8D0: 00        .byte $00   ; 
- D - I - - 0x02B8E1 14:B8D1: 29        .byte $29   ; 
- D - I - - 0x02B8E2 14:B8D2: 30        .byte $30   ; 
- D - I - - 0x02B8E3 14:B8D3: 30        .byte $30   ; 
- D - I - - 0x02B8E4 14:B8D4: 26        .byte $26   ; 
- D - I - - 0x02B8E5 14:B8D5: 00        .byte $00   ; 
- D - I - - 0x02B8E6 14:B8D6: 29        .byte $29   ; 
- D - I - - 0x02B8E7 14:B8D7: 30        .byte $30   ; 
- D - I - - 0x02B8E8 14:B8D8: 30        .byte $30   ; 
- D - I - - 0x02B8E9 14:B8D9: 15        .byte $15   ; 
- D - I - - 0x02B8EA 14:B8DA: 37        .byte $37   ; 
- D - I - - 0x02B8EB 14:B8DB: 00        .byte $00   ; 
- D - I - - 0x02B8EC 14:B8DC: 30        .byte $30   ; 
- D - I - - 0x02B8ED 14:B8DD: 30        .byte $30   ; 
- D - I - - 0x02B8EE 14:B8DE: 36        .byte $36   ; 
- D - I - - 0x02B8EF 14:B8DF: 25        .byte $25   ; 
- D - I - - 0x02B8F0 14:B8E0: 00        .byte $00   ; 
- D - I - - 0x02B8F1 14:B8E1: 30        .byte $30   ; 
- D - I - - 0x02B8F2 14:B8E2: 30        .byte $30   ; 
- D - I - - 0x02B8F3 14:B8E3: 26        .byte $26   ; 
- D - I - - 0x02B8F4 14:B8E4: 27        .byte $27   ; 
- D - I - - 0x02B8F5 14:B8E5: 16        .byte $16   ; 
- D - I - - 0x02B8F6 14:B8E6: 00        .byte $00   ; 
- D - I - - 0x02B8F7 14:B8E7: 30        .byte $30   ; 
- D - I - - 0x02B8F8 14:B8E8: 35        .byte $35   ; 
- D - I - - 0x02B8F9 14:B8E9: 37        .byte $37   ; 
- D - I - - 0x02B8FA 14:B8EA: 16        .byte $16   ; 
- D - I - - 0x02B8FB 14:B8EB: 00        .byte $00   ; 
- D - I - - 0x02B8FC 14:B8EC: 30        .byte $30   ; 
- D - I - - 0x02B8FD 14:B8ED: 15        .byte $15   ; 
- D - I - - 0x02B8FE 14:B8EE: 00        .byte $00   ; 
- D - I - - 0x02B8FF 14:B8EF: 16        .byte $16   ; 
- D - I - - 0x02B900 14:B8F0: 00        .byte $00   ; 
- D - I - - 0x02B901 14:B8F1: 30        .byte $30   ; 
- D - I - - 0x02B902 14:B8F2: 36        .byte $36   ; 
- D - I - - 0x02B903 14:B8F3: 00        .byte $00   ; 
- D - I - - 0x02B904 14:B8F4: 11        .byte $11   ; 
- D - I - - 0x02B905 14:B8F5: 37        .byte $37   ; 
- D - I - - 0x02B906 14:B8F6: 30        .byte $30   ; 
- D - I - - 0x02B907 14:B8F7: 36        .byte $36   ; 
- D - I - - 0x02B908 14:B8F8: 07        .byte $07   ; 
- D - I - - 0x02B909 14:B8F9: 11        .byte $11   ; 
- D - I - - 0x02B90A 14:B8FA: 37        .byte $37   ; 
- D - I - - 0x02B90B 14:B8FB: 30        .byte $30   ; 
- D - I - - 0x02B90C 14:B8FC: 36        .byte $36   ; 
- D - I - - 0x02B90D 14:B8FD: 0F        .byte $0F   ; 
- D - I - - 0x02B90E 14:B8FE: 19        .byte $19   ; 
- D - I - - 0x02B90F 14:B8FF: 30        .byte $30   ; 
- D - I - - 0x02B910 14:B900: 30        .byte $30   ; 
- D - I - - 0x02B911 14:B901: 36        .byte $36   ; 
- D - I - - 0x02B912 14:B902: 0F        .byte $0F   ; 
- D - I - - 0x02B913 14:B903: 19        .byte $19   ; 
- D - I - - 0x02B914 14:B904: 30        .byte $30   ; 
- D - I - - 0x02B915 14:B905: 30        .byte $30   ; 
- D - I - - 0x02B916 14:B906: 36        .byte $36   ; 
- D - I - - 0x02B917 14:B907: 07        .byte $07   ; 
- D - I - - 0x02B918 14:B908: 12        .byte $12   ; 
- D - I - - 0x02B919 14:B909: 31        .byte $31   ; 
- D - I - - 0x02B91A 14:B90A: 30        .byte $30   ; 
- D - I - - 0x02B91B 14:B90B: 36        .byte $36   ; 
- D - I - - 0x02B91C 14:B90C: 0F        .byte $0F   ; 
- D - I - - 0x02B91D 14:B90D: 00        .byte $00   ; 
- D - I - - 0x02B91E 14:B90E: 19        .byte $19   ; 
- D - I - - 0x02B91F 14:B90F: 30        .byte $30   ; 
- D - I - - 0x02B920 14:B910: 36        .byte $36   ; 
- D - I - - 0x02B921 14:B911: 15        .byte $15   ; 
- D - I - - 0x02B922 14:B912: 30        .byte $30   ; 
- D - I - - 0x02B923 14:B913: 24        .byte $24   ; 
- D - I - - 0x02B924 14:B914: 30        .byte $30   ; 
- D - I - - 0x02B925 14:B915: 36        .byte $36   ; 
- D - I - - 0x02B926 14:B916: 00        .byte $00   ; 
- D - I - - 0x02B927 14:B917: 37        .byte $37   ; 
- D - I - - 0x02B928 14:B918: 30        .byte $30   ; 
- D - I - - 0x02B929 14:B919: 30        .byte $30   ; 
- D - I - - 0x02B92A 14:B91A: 36        .byte $36   ; 
- D - I - - 0x02B92B 14:B91B: 0F        .byte $0F   ; 
- D - I - - 0x02B92C 14:B91C: 00        .byte $00   ; 
- D - I - - 0x02B92D 14:B91D: 0F        .byte $0F   ; 
- D - I - - 0x02B92E 14:B91E: 30        .byte $30   ; 
- D - I - - 0x02B92F 14:B91F: 36        .byte $36   ; 
- D - I - - 0x02B930 14:B920: 0F        .byte $0F   ; 
- D - I - - 0x02B931 14:B921: 00        .byte $00   ; 
- D - I - - 0x02B932 14:B922: 0F        .byte $0F   ; 
- D - I - - 0x02B933 14:B923: 30        .byte $30   ; 
- D - I - - 0x02B934 14:B924: 36        .byte $36   ; 
- D - I - - 0x02B935 14:B925: 0F        .byte $0F   ; 
- D - I - - 0x02B936 14:B926: 00        .byte $00   ; 
- D - I - - 0x02B937 14:B927: 0F        .byte $0F   ; 
- D - I - - 0x02B938 14:B928: 30        .byte $30   ; 
- D - I - - 0x02B939 14:B929: 36        .byte $36   ; 
- D - I - - 0x02B93A 14:B92A: 0F        .byte $0F   ; 
- D - I - - 0x02B93B 14:B92B: 30        .byte $30   ; 
- D - I - - 0x02B93C 14:B92C: 16        .byte $16   ; 
- D - I - - 0x02B93D 14:B92D: 30        .byte $30   ; 
- D - I - - 0x02B93E 14:B92E: 36        .byte $36   ; 
- D - I - - 0x02B93F 14:B92F: 11        .byte $11   ; 
- D - I - - 0x02B940 14:B930: 16        .byte $16   ; 
- D - I - - 0x02B941 14:B931: 16        .byte $16   ; 
- D - I - - 0x02B942 14:B932: 30        .byte $30   ; 
- D - I - - 0x02B943 14:B933: 26        .byte $26   ; 
- D - I - - 0x02B944 14:B934: 0F        .byte $0F   ; 
- D - I - - 0x02B945 14:B935: 31        .byte $31   ; 
- D - I - - 0x02B946 14:B936: 30        .byte $30   ; 
- D - I - - 0x02B947 14:B937: 30        .byte $30   ; 
- D - I - - 0x02B948 14:B938: 36        .byte $36   ; 
- D - I - - 0x02B949 14:B939: 16        .byte $16   ; 
- D - I - - 0x02B94A 14:B93A: 31        .byte $31   ; 
- D - I - - 0x02B94B 14:B93B: 30        .byte $30   ; 
- D - I - - 0x02B94C 14:B93C: 30        .byte $30   ; 
- D - I - - 0x02B94D 14:B93D: 35        .byte $35   ; 
- D - I - - 0x02B94E 14:B93E: 37        .byte $37   ; 
- D - I - - 0x02B94F 14:B93F: 30        .byte $30   ; 
- D - I - - 0x02B950 14:B940: 29        .byte $29   ; 
- D - I - - 0x02B951 14:B941: 30        .byte $30   ; 
- D - I - - 0x02B952 14:B942: 35        .byte $35   ; 
- D - I - - 0x02B953 14:B943: 37        .byte $37   ; 
- D - I - - 0x02B954 14:B944: 30        .byte $30   ; 
- D - I - - 0x02B955 14:B945: 29        .byte $29   ; 
- D - I - - 0x02B956 14:B946: 30        .byte $30   ; 
- D - I - - 0x02B957 14:B947: 35        .byte $35   ; 
- D - I - - 0x02B958 14:B948: 37        .byte $37   ; 
- D - I - - 0x02B959 14:B949: 30        .byte $30   ; 
- D - I - - 0x02B95A 14:B94A: 29        .byte $29   ; 
- D - I - - 0x02B95B 14:B94B: 30        .byte $30   ; 
- D - I - - 0x02B95C 14:B94C: 36        .byte $36   ; 
- D - I - - 0x02B95D 14:B94D: 30        .byte $30   ; 
- D - I - - 0x02B95E 14:B94E: 32        .byte $32   ; 
- D - I - - 0x02B95F 14:B94F: 22        .byte $22   ; 
- D - I - - 0x02B960 14:B950: 30        .byte $30   ; 
- D - I - - 0x02B961 14:B951: 36        .byte $36   ; 
- D - I - - 0x02B962 14:B952: 0F        .byte $0F   ; 
- D - I - - 0x02B963 14:B953: 16        .byte $16   ; 
- D - I - - 0x02B964 14:B954: 30        .byte $30   ; 
- D - I - - 0x02B965 14:B955: 30        .byte $30   ; 
- D - I - - 0x02B966 14:B956: 36        .byte $36   ; 
- D - I - - 0x02B967 14:B957: 0F        .byte $0F   ; 
- D - I - - 0x02B968 14:B958: 16        .byte $16   ; 
- D - I - - 0x02B969 14:B959: 30        .byte $30   ; 
- D - I - - 0x02B96A 14:B95A: 30        .byte $30   ; 
- D - I - - 0x02B96B 14:B95B: 36        .byte $36   ; 
- D - I - - 0x02B96C 14:B95C: 07        .byte $07   ; 
- D - I - - 0x02B96D 14:B95D: 16        .byte $16   ; 
- D - I - - 0x02B96E 14:B95E: 30        .byte $30   ; 
- D - I - - 0x02B96F 14:B95F: 30        .byte $30   ; 
- D - I - - 0x02B970 14:B960: 36        .byte $36   ; 
- D - I - - 0x02B971 14:B961: 17        .byte $17   ; 
- D - I - - 0x02B972 14:B962: 16        .byte $16   ; 
- D - I - - 0x02B973 14:B963: 30        .byte $30   ; 
- D - I - - 0x02B974 14:B964: 30        .byte $30   ; 
- D - I - - 0x02B975 14:B965: 36        .byte $36   ; 
- D - I - - 0x02B976 14:B966: 15        .byte $15   ; 
- D - I - - 0x02B977 14:B967: 16        .byte $16   ; 
- D - I - - 0x02B978 14:B968: 30        .byte $30   ; 
- D - I - - 0x02B979 14:B969: 30        .byte $30   ; 
- D - I - - 0x02B97A 14:B96A: 36        .byte $36   ; 
- D - I - - 0x02B97B 14:B96B: 0F        .byte $0F   ; 
- D - I - - 0x02B97C 14:B96C: 16        .byte $16   ; 
- D - I - - 0x02B97D 14:B96D: 30        .byte $30   ; 
- D - I - - 0x02B97E 14:B96E: 30        .byte $30   ; 
- D - I - - 0x02B97F 14:B96F: 36        .byte $36   ; 
- D - I - - 0x02B980 14:B970: 0F        .byte $0F   ; 
- D - I - - 0x02B981 14:B971: 16        .byte $16   ; 
- D - I - - 0x02B982 14:B972: 30        .byte $30   ; 
- D - I - - 0x02B983 14:B973: 30        .byte $30   ; 
- D - I - - 0x02B984 14:B974: 36        .byte $36   ; 
- D - I - - 0x02B985 14:B975: 00        .byte $00   ; 
- D - I - - 0x02B986 14:B976: 16        .byte $16   ; 
- D - I - - 0x02B987 14:B977: 30        .byte $30   ; 
- D - I - - 0x02B988 14:B978: 30        .byte $30   ; 
- D - I - - 0x02B989 14:B979: 36        .byte $36   ; 
- D - I - - 0x02B98A 14:B97A: 0F        .byte $0F   ; 
- D - I - - 0x02B98B 14:B97B: 16        .byte $16   ; 
- D - I - - 0x02B98C 14:B97C: 30        .byte $30   ; 
- D - I - - 0x02B98D 14:B97D: 30        .byte $30   ; 
- D - I - - 0x02B98E 14:B97E: 36        .byte $36   ; 
- D - I - - 0x02B98F 14:B97F: 07        .byte $07   ; 
- D - I - - 0x02B990 14:B980: 16        .byte $16   ; 
- D - I - - 0x02B991 14:B981: 30        .byte $30   ; 
- D - I - - 0x02B992 14:B982: 30        .byte $30   ; 
- D - I - - 0x02B993 14:B983: 36        .byte $36   ; 
- D - I - - 0x02B994 14:B984: 00        .byte $00   ; 
- D - I - - 0x02B995 14:B985: 16        .byte $16   ; 
- D - I - - 0x02B996 14:B986: 30        .byte $30   ; 
- D - I - - 0x02B997 14:B987: 30        .byte $30   ; 
- D - I - - 0x02B998 14:B988: 36        .byte $36   ; 
- D - I - - 0x02B999 14:B989: 0F        .byte $0F   ; 
- D - I - - 0x02B99A 14:B98A: 30        .byte $30   ; 
- D - I - - 0x02B99B 14:B98B: 11        .byte $11   ; 
- D - I - - 0x02B99C 14:B98C: 30        .byte $30   ; 
- D - I - - 0x02B99D 14:B98D: 36        .byte $36   ; 
- D - I - - 0x02B99E 14:B98E: 10        .byte $10   ; 
- D - I - - 0x02B99F 14:B98F: 37        .byte $37   ; 
- D - I - - 0x02B9A0 14:B990: 16        .byte $16   ; 
- D - I - - 0x02B9A1 14:B991: 30        .byte $30   ; 
- D - I - - 0x02B9A2 14:B992: 36        .byte $36   ; 
- D - I - - 0x02B9A3 14:B993: 10        .byte $10   ; 
- D - I - - 0x02B9A4 14:B994: 37        .byte $37   ; 
- D - I - - 0x02B9A5 14:B995: 16        .byte $16   ; 
- D - I - - 0x02B9A6 14:B996: 30        .byte $30   ; 
- D - I - - 0x02B9A7 14:B997: 36        .byte $36   ; 
- D - I - - 0x02B9A8 14:B998: 10        .byte $10   ; 
- D - I - - 0x02B9A9 14:B999: 11        .byte $11   ; 
- D - I - - 0x02B9AA 14:B99A: 16        .byte $16   ; 
- D - I - - 0x02B9AB 14:B99B: 30        .byte $30   ; 
- D - I - - 0x02B9AC 14:B99C: 36        .byte $36   ; 
- D - I - - 0x02B9AD 14:B99D: 10        .byte $10   ; 
- D - I - - 0x02B9AE 14:B99E: 11        .byte $11   ; 
- D - I - - 0x02B9AF 14:B99F: 16        .byte $16   ; 
- D - I - - 0x02B9B0 14:B9A0: 30        .byte $30   ; 
- D - I - - 0x02B9B1 14:B9A1: 35        .byte $35   ; 
- D - I - - 0x02B9B2 14:B9A2: 37        .byte $37   ; 
- D - I - - 0x02B9B3 14:B9A3: 30        .byte $30   ; 
- D - I - - 0x02B9B4 14:B9A4: 16        .byte $16   ; 
- D - I - - 0x02B9B5 14:B9A5: 30        .byte $30   ; 
- D - I - - 0x02B9B6 14:B9A6: 35        .byte $35   ; 
- D - I - - 0x02B9B7 14:B9A7: 0F        .byte $0F   ; 
- D - I - - 0x02B9B8 14:B9A8: 29        .byte $29   ; 
- D - I - - 0x02B9B9 14:B9A9: 16        .byte $16   ; 
- D - I - - 0x02B9BA 14:B9AA: 30        .byte $30   ; 
- D - I - - 0x02B9BB 14:B9AB: 36        .byte $36   ; 
- D - I - - 0x02B9BC 14:B9AC: 26        .byte $26   ; 
- D - I - - 0x02B9BD 14:B9AD: 37        .byte $37   ; 
- D - I - - 0x02B9BE 14:B9AE: 37        .byte $37   ; 
- D - I - - 0x02B9BF 14:B9AF: 30        .byte $30   ; 
- D - I - - 0x02B9C0 14:B9B0: 36        .byte $36   ; 
- D - I - - 0x02B9C1 14:B9B1: 26        .byte $26   ; 
- D - I - - 0x02B9C2 14:B9B2: 37        .byte $37   ; 
- D - I - - 0x02B9C3 14:B9B3: 37        .byte $37   ; 
- D - I - - 0x02B9C4 14:B9B4: 30        .byte $30   ; 
- D - I - - 0x02B9C5 14:B9B5: 35        .byte $35   ; 
- D - I - - 0x02B9C6 14:B9B6: 16        .byte $16   ; 
- D - I - - 0x02B9C7 14:B9B7: 30        .byte $30   ; 
- D - I - - 0x02B9C8 14:B9B8: 26        .byte $26   ; 
- D - I - - 0x02B9C9 14:B9B9: 30        .byte $30   ; 
- D - I - - 0x02B9CA 14:B9BA: 36        .byte $36   ; 
- D - I - - 0x02B9CB 14:B9BB: 25        .byte $25   ; 
- D - I - - 0x02B9CC 14:B9BC: 10        .byte $10   ; 
- D - I - - 0x02B9CD 14:B9BD: 00        .byte $00   ; 
- D - I - - 0x02B9CE 14:B9BE: 30        .byte $30   ; 
- D - I - - 0x02B9CF 14:B9BF: 35        .byte $35   ; 
- D - I - - 0x02B9D0 14:B9C0: 37        .byte $37   ; 
- D - I - - 0x02B9D1 14:B9C1: 11        .byte $11   ; 
- D - I - - 0x02B9D2 14:B9C2: 30        .byte $30   ; 
- D - I - - 0x02B9D3 14:B9C3: 30        .byte $30   ; 
- D - I - - 0x02B9D4 14:B9C4: 35        .byte $35   ; 
- D - I - - 0x02B9D5 14:B9C5: 37        .byte $37   ; 
- D - I - - 0x02B9D6 14:B9C6: 11        .byte $11   ; 
- D - I - - 0x02B9D7 14:B9C7: 30        .byte $30   ; 
- D - I - - 0x02B9D8 14:B9C8: 30        .byte $30   ; 
- D - I - - 0x02B9D9 14:B9C9: 36        .byte $36   ; 
- D - I - - 0x02B9DA 14:B9CA: 26        .byte $26   ; 
- D - I - - 0x02B9DB 14:B9CB: 29        .byte $29   ; 
- D - I - - 0x02B9DC 14:B9CC: 16        .byte $16   ; 
- D - I - - 0x02B9DD 14:B9CD: 30        .byte $30   ; 
- D - I - - 0x02B9DE 14:B9CE: 36        .byte $36   ; 
- D - I - - 0x02B9DF 14:B9CF: 11        .byte $11   ; 
- D - I - - 0x02B9E0 14:B9D0: 30        .byte $30   ; 
- D - I - - 0x02B9E1 14:B9D1: 11        .byte $11   ; 
- D - I - - 0x02B9E2 14:B9D2: 30        .byte $30   ; 
- D - I - - 0x02B9E3 14:B9D3: 35        .byte $35   ; 
- D - I - - 0x02B9E4 14:B9D4: 37        .byte $37   ; 
- D - I - - 0x02B9E5 14:B9D5: 00        .byte $00   ; 
- D - I - - 0x02B9E6 14:B9D6: 10        .byte $10   ; 
- D - I - - 0x02B9E7 14:B9D7: 30        .byte $30   ; 
- D - I - - 0x02B9E8 14:B9D8: 36        .byte $36   ; 
- D - I - - 0x02B9E9 14:B9D9: 0F        .byte $0F   ; 
- D - I - - 0x02B9EA 14:B9DA: 26        .byte $26   ; 
- D - I - - 0x02B9EB 14:B9DB: 30        .byte $30   ; 
- D - I - - 0x02B9EC 14:B9DC: 30        .byte $30   ; 
- D - I - - 0x02B9ED 14:B9DD: 15        .byte $15   ; 
- D - I - - 0x02B9EE 14:B9DE: 10        .byte $10   ; 
- D - I - - 0x02B9EF 14:B9DF: 26        .byte $26   ; 
- D - I - - 0x02B9F0 14:B9E0: 30        .byte $30   ; 
- D - I - - 0x02B9F1 14:B9E1: 30        .byte $30   ; 
- D - I - - 0x02B9F2 14:B9E2: 35        .byte $35   ; 
- D - I - - 0x02B9F3 14:B9E3: 17        .byte $17   ; 
- D - I - - 0x02B9F4 14:B9E4: 31        .byte $31   ; 
- D - I - - 0x02B9F5 14:B9E5: 0F        .byte $0F   ; 
- D - I - - 0x02B9F6 14:B9E6: 30        .byte $30   ; 
- D - I - - 0x02B9F7 14:B9E7: 35        .byte $35   ; 
- D - I - - 0x02B9F8 14:B9E8: 00        .byte $00   ; 
- D - I - - 0x02B9F9 14:B9E9: 31        .byte $31   ; 
- D - I - - 0x02B9FA 14:B9EA: 0F        .byte $0F   ; 
- D - I - - 0x02B9FB 14:B9EB: 30        .byte $30   ; 
- D - I - - 0x02B9FC 14:B9EC: 35        .byte $35   ; 
- D - I - - 0x02B9FD 14:B9ED: 0F        .byte $0F   ; 
- D - I - - 0x02B9FE 14:B9EE: 31        .byte $31   ; 
- D - I - - 0x02B9FF 14:B9EF: 0F        .byte $0F   ; 
- D - I - - 0x02BA00 14:B9F0: 30        .byte $30   ; 
- D - I - - 0x02BA01 14:B9F1: 35        .byte $35   ; 
- D - I - - 0x02BA02 14:B9F2: 16        .byte $16   ; 
- D - I - - 0x02BA03 14:B9F3: 31        .byte $31   ; 
- D - I - - 0x02BA04 14:B9F4: 0F        .byte $0F   ; 
- D - I - - 0x02BA05 14:B9F5: 30        .byte $30   ; 
- D - I - - 0x02BA06 14:B9F6: 35        .byte $35   ; 
- D - I - - 0x02BA07 14:B9F7: 00        .byte $00   ; 
- D - I - - 0x02BA08 14:B9F8: 31        .byte $31   ; 
- D - I - - 0x02BA09 14:B9F9: 0F        .byte $0F   ; 
- D - I - - 0x02BA0A 14:B9FA: 30        .byte $30   ; 
- D - I - - 0x02BA0B 14:B9FB: 35        .byte $35   ; 
- D - I - - 0x02BA0C 14:B9FC: 37        .byte $37   ; 
- D - I - - 0x02BA0D 14:B9FD: 30        .byte $30   ; 
- D - I - - 0x02BA0E 14:B9FE: 0F        .byte $0F   ; 
- D - I - - 0x02BA0F 14:B9FF: 30        .byte $30   ; 
- D - I - - 0x02BA10 14:BA00: 35        .byte $35   ; 
- D - I - - 0x02BA11 14:BA01: 37        .byte $37   ; 
- D - I - - 0x02BA12 14:BA02: 30        .byte $30   ; 
- D - I - - 0x02BA13 14:BA03: 0F        .byte $0F   ; 
- D - I - - 0x02BA14 14:BA04: 30        .byte $30   ; 
- D - I - - 0x02BA15 14:BA05: 35        .byte $35   ; 
- D - I - - 0x02BA16 14:BA06: 37        .byte $37   ; 
- D - I - - 0x02BA17 14:BA07: 30        .byte $30   ; 
- D - I - - 0x02BA18 14:BA08: 0F        .byte $0F   ; 
- D - I - - 0x02BA19 14:BA09: 30        .byte $30   ; 
- D - I - - 0x02BA1A 14:BA0A: 35        .byte $35   ; 
- D - I - - 0x02BA1B 14:BA0B: 37        .byte $37   ; 
- D - I - - 0x02BA1C 14:BA0C: 30        .byte $30   ; 
- D - I - - 0x02BA1D 14:BA0D: 0F        .byte $0F   ; 
- D - I - - 0x02BA1E 14:BA0E: 30        .byte $30   ; 
- D - I - - 0x02BA1F 14:BA0F: 35        .byte $35   ; 
- D - I - - 0x02BA20 14:BA10: 37        .byte $37   ; 
- D - I - - 0x02BA21 14:BA11: 30        .byte $30   ; 
- D - I - - 0x02BA22 14:BA12: 0F        .byte $0F   ; 
- D - I - - 0x02BA23 14:BA13: 30        .byte $30   ; 
- D - I - - 0x02BA24 14:BA14: 35        .byte $35   ; 
- D - I - - 0x02BA25 14:BA15: 37        .byte $37   ; 
- D - I - - 0x02BA26 14:BA16: 30        .byte $30   ; 
- D - I - - 0x02BA27 14:BA17: 0F        .byte $0F   ; 
- D - I - - 0x02BA28 14:BA18: 30        .byte $30   ; 
- D - I - - 0x02BA29 14:BA19: 35        .byte $35   ; 
- D - I - - 0x02BA2A 14:BA1A: 37        .byte $37   ; 
- D - I - - 0x02BA2B 14:BA1B: 00        .byte $00   ; 
- D - I - - 0x02BA2C 14:BA1C: 16        .byte $16   ; 
- D - I - - 0x02BA2D 14:BA1D: 30        .byte $30   ; 
- D - I - - 0x02BA2E 14:BA1E: 26        .byte $26   ; 
- D - I - - 0x02BA2F 14:BA1F: 27        .byte $27   ; 
- D - I - - 0x02BA30 14:BA20: 37        .byte $37   ; 
- D - I - - 0x02BA31 14:BA21: 11        .byte $11   ; 
- D - I - - 0x02BA32 14:BA22: 30        .byte $30   ; 
- D - I - - 0x02BA33 14:BA23: 15        .byte $15   ; 
- D - I - - 0x02BA34 14:BA24: 37        .byte $37   ; 
- D - I - - 0x02BA35 14:BA25: 37        .byte $37   ; 
- D - I - - 0x02BA36 14:BA26: 11        .byte $11   ; 
- D - I - - 0x02BA37 14:BA27: 30        .byte $30   ; 
- D - I - - 0x02BA38 14:BA28: 15        .byte $15   ; 
- D - I - - 0x02BA39 14:BA29: 00        .byte $00   ; 
- D - I - - 0x02BA3A 14:BA2A: 37        .byte $37   ; 
- D - I - - 0x02BA3B 14:BA2B: 11        .byte $11   ; 
- D - I - - 0x02BA3C 14:BA2C: 30        .byte $30   ; 
- D - I - - 0x02BA3D 14:BA2D: 26        .byte $26   ; 
- D - I - - 0x02BA3E 14:BA2E: 00        .byte $00   ; 
- D - I - - 0x02BA3F 14:BA2F: 37        .byte $37   ; 
- D - I - - 0x02BA40 14:BA30: 11        .byte $11   ; 
- D - I - - 0x02BA41 14:BA31: 30        .byte $30   ; 
- D - I - - 0x02BA42 14:BA32: 35        .byte $35   ; 
- D - I - - 0x02BA43 14:BA33: 37        .byte $37   ; 
- D - I - - 0x02BA44 14:BA34: 37        .byte $37   ; 
- D - I - - 0x02BA45 14:BA35: 11        .byte $11   ; 
- D - I - - 0x02BA46 14:BA36: 30        .byte $30   ; 
- D - I - - 0x02BA47 14:BA37: 35        .byte $35   ; 
- D - I - - 0x02BA48 14:BA38: 00        .byte $00   ; 
- D - I - - 0x02BA49 14:BA39: 37        .byte $37   ; 
- D - I - - 0x02BA4A 14:BA3A: 11        .byte $11   ; 
- D - I - - 0x02BA4B 14:BA3B: 30        .byte $30   ; 
- D - I - - 0x02BA4C 14:BA3C: 15        .byte $15   ; 
- D - I - - 0x02BA4D 14:BA3D: 37        .byte $37   ; 
- D - I - - 0x02BA4E 14:BA3E: 37        .byte $37   ; 
- D - I - - 0x02BA4F 14:BA3F: 11        .byte $11   ; 
- D - I - - 0x02BA50 14:BA40: 30        .byte $30   ; 
- D - I - - 0x02BA51 14:BA41: 15        .byte $15   ; 
- D - I - - 0x02BA52 14:BA42: 0F        .byte $0F   ; 
- D - I - - 0x02BA53 14:BA43: 37        .byte $37   ; 
- D - I - - 0x02BA54 14:BA44: 11        .byte $11   ; 
- D - I - - 0x02BA55 14:BA45: 30        .byte $30   ; 
- D - I - - 0x02BA56 14:BA46: 36        .byte $36   ; 
- D - I - - 0x02BA57 14:BA47: 25        .byte $25   ; 
- D - I - - 0x02BA58 14:BA48: 37        .byte $37   ; 
- D - I - - 0x02BA59 14:BA49: 11        .byte $11   ; 
- D - I - - 0x02BA5A 14:BA4A: 30        .byte $30   ; 
- D - I - - 0x02BA5B 14:BA4B: 15        .byte $15   ; 
- D - I - - 0x02BA5C 14:BA4C: 00        .byte $00   ; 
- D - I - - 0x02BA5D 14:BA4D: 37        .byte $37   ; 
- D - I - - 0x02BA5E 14:BA4E: 11        .byte $11   ; 
- D - I - - 0x02BA5F 14:BA4F: 30        .byte $30   ; 
- D - I - - 0x02BA60 14:BA50: 15        .byte $15   ; 
- D - I - - 0x02BA61 14:BA51: 0F        .byte $0F   ; 
- D - I - - 0x02BA62 14:BA52: 30        .byte $30   ; 
- D - I - - 0x02BA63 14:BA53: 37        .byte $37   ; 
- D - I - - 0x02BA64 14:BA54: 30        .byte $30   ; 
- D - I - - 0x02BA65 14:BA55: 26        .byte $26   ; 
- D - I - - 0x02BA66 14:BA56: 16        .byte $16   ; 
- D - I - - 0x02BA67 14:BA57: 37        .byte $37   ; 
- D - I - - 0x02BA68 14:BA58: 11        .byte $11   ; 
- D - I - - 0x02BA69 14:BA59: 30        .byte $30   ; 
- D - I - - 0x02BA6A 14:BA5A: 36        .byte $36   ; 
- D - I - - 0x02BA6B 14:BA5B: 0F        .byte $0F   ; 
- D - I - - 0x02BA6C 14:BA5C: 16        .byte $16   ; 
- D - I - - 0x02BA6D 14:BA5D: 30        .byte $30   ; 
- D - I - - 0x02BA6E 14:BA5E: 30        .byte $30   ; 
- D - I - - 0x02BA6F 14:BA5F: 36        .byte $36   ; 
- D - I - - 0x02BA70 14:BA60: 0F        .byte $0F   ; 
- D - I - - 0x02BA71 14:BA61: 30        .byte $30   ; 
- D - I - - 0x02BA72 14:BA62: 11        .byte $11   ; 
- D - I - - 0x02BA73 14:BA63: 30        .byte $30   ; 
- - - - - - 0x02BA74 14:BA64: 36        .byte $36   ; 
- - - - - - 0x02BA75 14:BA65: 0F        .byte $0F   ; 
- - - - - - 0x02BA76 14:BA66: 16        .byte $16   ; 
- - - - - - 0x02BA77 14:BA67: 30        .byte $30   ; 
- - - - - - 0x02BA78 14:BA68: 30        .byte $30   ; 
- D - I - - 0x02BA79 14:BA69: 36        .byte $36   ; 
- D - I - - 0x02BA7A 14:BA6A: 17        .byte $17   ; 
- D - I - - 0x02BA7B 14:BA6B: 16        .byte $16   ; 
- D - I - - 0x02BA7C 14:BA6C: 30        .byte $30   ; 
- D - I - - 0x02BA7D 14:BA6D: 30        .byte $30   ; 
- - - - - - 0x02BA7E 14:BA6E: 36        .byte $36   ; 
- - - - - - 0x02BA7F 14:BA6F: 0F        .byte $0F   ; 
- - - - - - 0x02BA80 14:BA70: 16        .byte $16   ; 
- - - - - - 0x02BA81 14:BA71: 30        .byte $30   ; 
- - - - - - 0x02BA82 14:BA72: 30        .byte $30   ; 
- - - - - - 0x02BA83 14:BA73: 36        .byte $36   ; 
- - - - - - 0x02BA84 14:BA74: 07        .byte $07   ; 
- - - - - - 0x02BA85 14:BA75: 16        .byte $16   ; 
- - - - - - 0x02BA86 14:BA76: 30        .byte $30   ; 
- - - - - - 0x02BA87 14:BA77: 30        .byte $30   ; 
- D - I - - 0x02BA88 14:BA78: 36        .byte $36   ; 
- D - I - - 0x02BA89 14:BA79: 0F        .byte $0F   ; 
- D - I - - 0x02BA8A 14:BA7A: 16        .byte $16   ; 
- D - I - - 0x02BA8B 14:BA7B: 30        .byte $30   ; 
- D - I - - 0x02BA8C 14:BA7C: 30        .byte $30   ; 
- D - I - - 0x02BA8D 14:BA7D: 36        .byte $36   ; 
- D - I - - 0x02BA8E 14:BA7E: 0F        .byte $0F   ; 
- D - I - - 0x02BA8F 14:BA7F: 16        .byte $16   ; 
- D - I - - 0x02BA90 14:BA80: 30        .byte $30   ; 
- D - I - - 0x02BA91 14:BA81: 30        .byte $30   ; 
- D - I - - 0x02BA92 14:BA82: 36        .byte $36   ; 
- D - I - - 0x02BA93 14:BA83: 00        .byte $00   ; 
- D - I - - 0x02BA94 14:BA84: 16        .byte $16   ; 
- D - I - - 0x02BA95 14:BA85: 30        .byte $30   ; 
- D - I - - 0x02BA96 14:BA86: 30        .byte $30   ; 



tbl_BA87:
- D - - - - 0x02BA97 14:BA87: 31        .byte $31   ; 
- D - - - - 0x02BA98 14:BA88: 30        .byte $30   ; 

- D - - - - 0x02BA99 14:BA89: 31        .byte $31   ; 
- D - - - - 0x02BA9A 14:BA8A: 30        .byte $30   ; 

- D - - - - 0x02BA9B 14:BA8B: 06        .byte $06   ; 
- D - - - - 0x02BA9C 14:BA8C: 15        .byte $15   ; 

- D - - - - 0x02BA9D 14:BA8D: 22        .byte $22   ; 
- D - - - - 0x02BA9E 14:BA8E: 32        .byte $32   ; 

- D - - - - 0x02BA9F 14:BA8F: 14        .byte $14   ; 
- D - - - - 0x02BAA0 14:BA90: 24        .byte $24   ; 

- D - - - - 0x02BAA1 14:BA91: 1C        .byte $1C   ; 
- D - - - - 0x02BAA2 14:BA92: 2C        .byte $2C   ; 

- D - - - - 0x02BAA3 14:BA93: 19        .byte $19   ; 
- D - - - - 0x02BAA4 14:BA94: 3A        .byte $3A   ; 

- D - - - - 0x02BAA5 14:BA95: 00        .byte $00   ; 
- D - - - - 0x02BAA6 14:BA96: 10        .byte $10   ; 

- D - - - - 0x02BAA7 14:BA97: 06        .byte $06   ; 
- D - - - - 0x02BAA8 14:BA98: 15        .byte $15   ; 

- D - - - - 0x02BAA9 14:BA99: 11        .byte $11   ; 
- D - - - - 0x02BAAA 14:BA9A: 21        .byte $21   ; 

- D - - - - 0x02BAAB 14:BA9B: 09        .byte $09   ; 
- D - - - - 0x02BAAC 14:BA9C: 19        .byte $19   ; 

- D - - - - 0x02BAAD 14:BA9D: 12        .byte $12   ; 
- D - - - - 0x02BAAE 14:BA9E: 22        .byte $22   ; 

- D - - - - 0x02BAAF 14:BA9F: 31        .byte $31   ; 
- D - - - - 0x02BAB0 14:BAA0: 30        .byte $30   ; 

- D - - - - 0x02BAB1 14:BAA1: 27        .byte $27   ; 
- D - - - - 0x02BAB2 14:BAA2: 37        .byte $37   ; 

- D - - - - 0x02BAB3 14:BAA3: 00        .byte $00   ; 
- D - - - - 0x02BAB4 14:BAA4: 10        .byte $10   ; 

- D - - - - 0x02BAB5 14:BAA5: 06        .byte $06   ; 
- D - - - - 0x02BAB6 14:BAA6: 15        .byte $15   ; 

- D - - - - 0x02BAB7 14:BAA7: 32        .byte $32   ; 
- D - - - - 0x02BAB8 14:BAA8: 31        .byte $31   ; 

- D - - - - 0x02BAB9 14:BAA9: 31        .byte $31   ; 
- D - - - - 0x02BABA 14:BAAA: 30        .byte $30   ; 

- D - - - - 0x02BABB 14:BAAB: 06        .byte $06   ; 
- D - - - - 0x02BABC 14:BAAC: 15        .byte $15   ; 

- D - - - - 0x02BABD 14:BAAD: 23        .byte $23   ; 
- D - - - - 0x02BABE 14:BAAE: 33        .byte $33   ; 

- D - - - - 0x02BABF 14:BAAF: 27        .byte $27   ; 
- D - - - - 0x02BAC0 14:BAB0: 37        .byte $37   ; 

- D - - - - 0x02BAC1 14:BAB1: 19        .byte $19   ; 
- D - - - - 0x02BAC2 14:BAB2: 3A        .byte $3A   ; 

- D - - - - 0x02BAC3 14:BAB3: 26        .byte $26   ; 
- D - - - - 0x02BAC4 14:BAB4: 27        .byte $27   ; 

- D - - - - 0x02BAC5 14:BAB5: 11        .byte $11   ; 
- D - - - - 0x02BAC6 14:BAB6: 21        .byte $21   ; 

- D - - - - 0x02BAC7 14:BAB7: 11        .byte $11   ; 
- D - - - - 0x02BAC8 14:BAB8: 21        .byte $21   ; 

- D - - - - 0x02BAC9 14:BAB9: 31        .byte $31   ; 
- D - - - - 0x02BACA 14:BABA: 30        .byte $30   ; 

- D - - - - 0x02BACB 14:BABB: 31        .byte $31   ; 
- D - - - - 0x02BACC 14:BABC: 30        .byte $30   ; 

- D - - - - 0x02BACD 14:BABD: 27        .byte $27   ; 
- D - - - - 0x02BACE 14:BABE: 37        .byte $37   ; 

- D - - - - 0x02BACF 14:BABF: 31        .byte $31   ; 
- D - - - - 0x02BAD0 14:BAC0: 30        .byte $30   ; 

- D - - - - 0x02BAD1 14:BAC1: 11        .byte $11   ; 
- D - - - - 0x02BAD2 14:BAC2: 21        .byte $21   ; 

- D - - - - 0x02BAD3 14:BAC3: 19        .byte $19   ; 
- D - - - - 0x02BAD4 14:BAC4: 3A        .byte $3A   ; 

- D - - - - 0x02BAD5 14:BAC5: 31        .byte $31   ; 
- D - - - - 0x02BAD6 14:BAC6: 30        .byte $30   ; 

- D - - - - 0x02BAD7 14:BAC7: 16        .byte $16   ; 
- D - - - - 0x02BAD8 14:BAC8: 26        .byte $26   ; 

- D - - - - 0x02BAD9 14:BAC9: 32        .byte $32   ; 
- D - - - - 0x02BADA 14:BACA: 31        .byte $31   ; 

- D - - - - 0x02BADB 14:BACB: 31        .byte $31   ; 
- D - - - - 0x02BADC 14:BACC: 30        .byte $30   ; 

- D - - - - 0x02BADD 14:BACD: 27        .byte $27   ; 
- D - - - - 0x02BADE 14:BACE: 37        .byte $37   ; 



tbl_BACF:
; 0x02BADF
; последний байт из списка (0F) не используется
;          00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $30, $31, $30, $37, $30, $37, $00   ; 00
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 01
    .byte $26, $17, $00, $17, $30, $11, $0F, $26, $30, $26, $17, $37, $16, $37, $30, $00   ; 02
    .byte $36, $27, $30, $27, $30, $31, $0F, $30, $36, $36, $27, $00, $16, $00, $30, $00   ; 03
    .byte $36, $27, $30, $27, $30, $31, $0F, $30, $36, $36, $27, $11, $16, $11, $30, $00   ; 04
    .byte $36, $27, $17, $27, $36, $30, $0F, $17, $36, $30, $31, $30, $37, $30, $37, $00   ; 05
    .byte $36, $27, $17, $27, $36, $30, $0F, $17, $36, $15, $06, $15, $37, $30, $37, $00   ; 06
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $30, $31, $30, $37, $30, $37, $00   ; 07
    .byte $31, $30, $36, $26, $30, $31, $00, $00, $00, $25, $30, $31, $30, $10, $30, $30   ; 08
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 09
    .byte $06, $15, $36, $26, $30, $31, $00, $00, $00, $25, $30, $31, $30, $10, $30, $30   ; 0A
    .byte $36, $27, $0F, $27, $36, $30, $0F, $0F, $36, $30, $31, $30, $37, $30, $37, $00   ; 0B
    .byte $36, $27, $0F, $27, $36, $30, $0F, $0F, $36, $15, $06, $15, $37, $30, $37, $00   ; 0C
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 0D
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 0E
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 0F
    .byte $36, $27, $36, $30, $30, $27, $0F, $07, $27, $15, $06, $15, $37, $30, $37, $00   ; 10
    .byte $36, $27, $24, $27, $36, $30, $0F, $00, $27, $15, $06, $15, $37, $30, $37, $00   ; 11
    .byte $36, $27, $24, $27, $36, $30, $0F, $00, $27, $15, $06, $15, $37, $30, $37, $00   ; 12
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 13
    .byte $36, $27, $15, $27, $36, $30, $0F, $00, $27, $15, $06, $15, $37, $30, $37, $00   ; 14
    .byte $36, $27, $30, $27, $30, $31, $0F, $30, $36, $36, $27, $11, $16, $11, $30, $00   ; 15
    .byte $36, $27, $30, $27, $11, $27, $0F, $11, $30, $25, $30, $31, $30, $10, $30, $30   ; 16
    .byte $36, $27, $0F, $27, $30, $0F, $0F, $36, $30, $36, $27, $11, $16, $11, $30, $00   ; 17
    .byte $35, $27, $11, $27, $30, $1A, $0F, $35, $30, $35, $26, $22, $16, $22, $30, $00   ; 18
    .byte $26, $17, $27, $17, $26, $30, $0F, $1A, $30, $15, $06, $15, $37, $30, $37, $00   ; 19
    .byte $36, $27, $24, $27, $36, $30, $0F, $00, $27, $22, $11, $22, $37, $30, $37, $00   ; 1A
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $29, $19, $29, $37, $30, $37, $00   ; 1B
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $29, $19, $29, $37, $30, $37, $00   ; 1C
    .byte $36, $27, $36, $30, $30, $27, $0F, $07, $27, $22, $12, $22, $37, $30, $37, $00   ; 1D
    .byte $36, $27, $15, $27, $36, $30, $0F, $00, $27, $30, $31, $30, $37, $30, $37, $00   ; 1E
    .byte $36, $27, $24, $27, $36, $30, $0F, $00, $27, $37, $27, $37, $37, $30, $37, $00   ; 1F
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $10, $00, $10, $37, $30, $37, $00   ; 20
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $10, $00, $10, $37, $30, $37, $00   ; 21
    .byte $36, $27, $0F, $27, $30, $0F, $0F, $36, $30, $36, $27, $11, $16, $11, $30, $00   ; 22
    .byte $27, $26, $0F, $26, $27, $30, $0F, $1C, $30, $31, $32, $31, $37, $30, $37, $00   ; 23
    .byte $35, $27, $37, $27, $35, $30, $0F, $1A, $30, $30, $31, $30, $27, $30, $27, $00   ; 24
    .byte $36, $27, $30, $27, $30, $31, $0F, $30, $36, $36, $27, $22, $16, $22, $32, $00   ; 25
    .byte $36, $27, $30, $27, $22, $27, $0F, $22, $32, $25, $30, $31, $30, $10, $30, $30   ; 26
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $06, $15, $37, $30, $37, $00   ; 27
    .byte $36, $27, $0F, $27, $36, $20, $0F, $0F, $36, $15, $06, $15, $37, $30, $37, $00   ; 28
    .byte $36, $27, $17, $27, $36, $30, $0F, $17, $36, $15, $16, $15, $37, $30, $37, $00   ; 29
    .byte $36, $27, $25, $27, $36, $30, $0F, $00, $27, $15, $16, $15, $37, $30, $37, $00   ; 2A
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $16, $15, $37, $30, $37, $00   ; 2B
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $16, $15, $37, $30, $37, $00   ; 2C
    .byte $36, $27, $25, $27, $36, $30, $0F, $00, $27, $15, $16, $15, $37, $30, $37, $00   ; 2D
    .byte $36, $27, $36, $30, $30, $27, $0F, $17, $00, $15, $16, $15, $37, $30, $37, $00   ; 2E
    .byte $06, $15, $36, $26, $30, $31, $00, $00, $00, $25, $30, $31, $30, $10, $30, $30   ; 2F
    .byte $36, $27, $36, $30, $30, $27, $0F, $07, $27, $15, $16, $15, $37, $30, $37, $00   ; 30
    .byte $36, $27, $25, $27, $36, $30, $0F, $00, $27, $15, $16, $15, $37, $30, $37, $00   ; 31
    .byte $36, $27, $0F, $27, $30, $0F, $0F, $36, $30, $36, $27, $11, $16, $11, $30, $00   ; 32
    .byte $35, $27, $37, $27, $35, $30, $0F, $1A, $30, $22, $11, $22, $37, $30, $37, $00   ; 33
    .byte $35, $27, $37, $27, $35, $30, $0F, $1A, $27, $22, $11, $22, $37, $30, $37, $00   ; 34
    .byte $36, $27, $17, $27, $36, $30, $0F, $1C, $30, $31, $32, $31, $37, $30, $37, $00   ; 35
    .byte $36, $27, $0F, $27, $36, $30, $0F, $0F, $36, $31, $32, $31, $37, $30, $37, $00   ; 36
    .byte $35, $27, $37, $27, $35, $30, $0F, $1C, $30, $30, $31, $30, $37, $30, $37, $00   ; 37
    .byte $35, $27, $37, $27, $35, $30, $0F, $1C, $30, $30, $31, $30, $37, $30, $37, $00   ; 38
    .byte $35, $27, $37, $27, $35, $30, $0F, $1C, $30, $30, $31, $30, $37, $30, $37, $00   ; 39
    .byte $26, $17, $27, $17, $26, $30, $0F, $1A, $30, $37, $27, $37, $37, $30, $37, $00   ; 3A
    .byte $26, $15, $0F, $15, $30, $0F, $0F, $26, $30, $26, $15, $37, $16, $37, $30, $00   ; 3B
    .byte $26, $17, $16, $17, $26, $30, $0F, $16, $26, $37, $27, $37, $37, $30, $37, $00   ; 3C


