.segment "BANK_20"
.include "copy_bank_ram.inc"
.export sub_0x028010
sub_0x028010:
C D - - - 0x028010 20:8000: 4C 0F 80  JMP loc_800F

.export sub_0x028013
sub_0x028013:
C - - - - 0x028013 20:8003: 4C DC 84  JMP loc_84DC

.export sub_0x028016
sub_0x028016:
C - - - - 0x028016 20:8006: 4C D9 83  JMP loc_83D9

.export sub_0x028019
sub_0x028019:
C - - - - 0x028019 20:8009: 4C 24 86  JMP loc_8624

.export sub_0x02801C
sub_0x02801C:
C - - - - 0x02801C 20:800C: 4C 96 87  JMP loc_8796

loc_800F:
C D - - - 0x02801F 20:800F: AD 3A 05  LDA $053A
C - - - - 0x028022 20:8012: F0 6F     BEQ bra_8083_выход
C - - - - 0x028024 20:8014: 10 51     BPL bra_8067
C - - - - 0x028026 20:8016: A2 01     LDX #$01
C - - - - 0x028028 20:8018: 8E 3A 05  STX $053A
C - - - - 0x02802B 20:801B: AD 3C 05  LDA ram_номер_анимации
C - - - - 0x02802E 20:801E: A2 68     LDX #< tbl_8968
C - - - - 0x028030 20:8020: 86 4C     STX ram_004C
C - - - - 0x028032 20:8022: A2 89     LDX #> tbl_8968
C - - - - 0x028036 20:8026: 0A        ASL
C - - - - 0x028037 20:8027: 90 02     BCC bra_802A
C - - - - 0x028039 20:8029: E6 4D     INX
bra_802A:
C - - - - 0x028034 20:802A: 86 4D     STX ram_004D
C - - - - 0x02803B 20:802B: A8        TAY
C - - - - 0x02803C 20:802C: B1 4C     LDA (ram_004C),Y
C - - - - 0x02803E 20:802E: AA        TAX
C - - - - 0x02803F 20:802F: C8        INY
C - - - - 0x028040 20:8030: B1 4C     LDA (ram_004C),Y
C - - - - 0x028042 20:8032: 86 4C     STX ram_004C
C - - - - 0x028044 20:8034: 85 4D     STA ram_004D
C - - - - 0x028046 20:8036: A2 00     LDX #$00
bra_8038:
C - - - - 0x028048 20:8038: A9 00     LDA #$00
C - - - - 0x02804A 20:803A: 9D 47 05  STA $0547,X
C - - - - 0x02804D 20:803D: 8A        TXA
C - - - - 0x02804E 20:803E: 18        CLC
C - - - - 0x02804F 20:803F: 69 15     ADC #$15
C - - - - 0x028051 20:8041: AA        TAX
C - - - - 0x028052 20:8042: C9 7E     CMP #$7E
C - - - - 0x028054 20:8044: D0 F2     BNE bra_8038
C - - - - 0x028056 20:8046: A9 01     LDA #$01
C - - - - 0x028058 20:8048: 8D 3B 05  STA $053B
C - - - - 0x02805B 20:804B: A9 00     LDA #$00
C - - - - 0x02805D 20:804D: 8D 3D 05  STA $053D
C - - - - 0x028060 20:8050: 8D 40 05  STA $0540
C - - - - 0x028063 20:8053: A9 FF     LDA #$FF
C - - - - 0x028065 20:8055: 8D 41 05  STA $0541
C - - - - 0x028068 20:8058: A9 01     LDA #$01
C - - - - 0x02806A 20:805A: 8D 43 05  STA $0543
C - - - - 0x02806D 20:805D: A9 23     LDA #$23
C - - - - 0x02806F 20:805F: 8D 44 05  STA $0544
C - - - - 0x028072 20:8062: A9 45     LDA #$45
C - - - - 0x028074 20:8064: 8D 45 05  STA $0545
bra_8067:
C - - - - 0x028077 20:8067: CE 3B 05  DEC $053B
C - - - - 0x02807A 20:806A: F0 01     BEQ bra_806D
C - - - - 0x02807C 20:806C: 60        RTS
bra_806D:
loc_806D:
C D - - - 0x02807D 20:806D: A0 00     LDY #$00
C - - - - 0x02807F 20:806F: B1 4C     LDA (ram_004C),Y
C - - - - 0x028081 20:8071: C9 F0     CMP #$F0
C - - - - 0x028083 20:8073: 90 06     BCC bra_807B
C - - - - 0x028085 20:8075: 20 84 80  JSR sub_8084
C - - - - 0x028088 20:8078: 4C 6D 80  JMP loc_806D
bra_807B:
C - - - - 0x02808B 20:807B: 8D 3B 05  STA $053B
C - - - - 0x02808E 20:807E: A9 01     LDA #$01
C - - - - 0x028090 20:8080: 20 CF 83  JSR sub_83CF
bra_8083_выход:
C - - - - 0x028093 20:8083: 60        RTS

sub_8084:
C - - - - 0x028094 20:8084: 38        SEC
C - - - - 0x028095 20:8085: E9 F0     SBC #$F0
C - - - - 0x028097 20:8087: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02809A 20:808A: A2 80     .word ofs_80A2_F0
- D - I - 0x02809C 20:808C: AA 80     .word ofs_80AA_F1
- - - - - 0x02809E 20:808E: 2B 81     .word ofs_812B_F2
- - - - - 0x0280A0 20:8090: 38 81     .word ofs_8138_F3
- D - I - 0x0280A2 20:8092: 42 81     .word ofs_8142_F4
- D - I - 0x0280A4 20:8094: 53 81     .word ofs_8153_F5
- D - I - 0x0280A6 20:8096: AE 83     .word ofs_83AE_F6
- D - I - 0x0280A8 20:8098: BD 83     .word ofs_83BD_F7
- D - I - 0x0280AA 20:809A: 6F 81     .word ofs_816F_F8
- D - I - 0x0280AC 20:809C: 7C 81     .word ofs_817C_F9
- D - I - 0x0280AE 20:809E: 95 81     .word ofs_8195_FA
- D - I - 0x0280B0 20:80A0: A9 81     .word ofs_81A9_FB

ofs_80A2_F0:
C - J - - 0x0280B2 20:80A2: 68        PLA
C - - - - 0x0280B3 20:80A3: 68        PLA
C - - - - 0x0280B4 20:80A4: A9 00     LDA #$00
C - - - - 0x0280B6 20:80A6: 8D 3A 05  STA $053A
C - - - - 0x0280B9 20:80A9: 60        RTS

ofs_80AA_F1:
C - J - - 0x0280BA 20:80AA: A0 05     LDY #$05
C - - - - 0x0280BC 20:80AC: B1 4C     LDA (ram_004C),Y
C - - - - 0x0280BE 20:80AE: 29 1C     AND #$1C
C - - - - 0x0280C0 20:80B0: 4A        LSR
C - - - - 0x0280C1 20:80B1: AA        TAX
C - - - - 0x0280C2 20:80B2: BD E4 88  LDA tbl_88E4,X
C - - - - 0x0280C5 20:80B5: 85 3A     STA ram_003A
C - - - - 0x0280C7 20:80B7: BD E5 88  LDA tbl_88E4 + 1,X
C - - - - 0x0280CA 20:80BA: 85 3B     STA ram_003B
C - - - - 0x0280CC 20:80BC: A0 00     LDY #$00
C - - - - 0x0280CE 20:80BE: 98        TYA
bra_80BF:
C - - - - 0x0280CF 20:80BF: 91 3A     STA (ram_003A),Y
C - - - - 0x0280D1 20:80C1: C8        INY
C - - - - 0x0280D2 20:80C2: C0 15     CPY #$15
C - - - - 0x0280D4 20:80C4: D0 F9     BNE bra_80BF
C - - - - 0x0280D6 20:80C6: A0 01     LDY #$01
C - - - - 0x0280D8 20:80C8: B1 4C     LDA (ram_004C),Y
C - - - - 0x0280DA 20:80CA: A2 B4     LDX #< tbl_A1B4
C - - - - 0x0280DC 20:80CC: 86 3E     STX ram_003E
C - - - - 0x0280DE 20:80CE: A2 A1     LDX #> tbl_A1B4
C - - - - 0x0280E0 20:80D0: 0A        ASL
C - - - - 0x0280E1 20:80D1: 90 01     BCC bra_80D4
C - - - - 0x0280E3 20:80D3: E8        INX
bra_80D4:
C - - - - 0x0280E4 20:80D4: 86 3F     STX ram_003F
C - - - - 0x0280E6 20:80D6: A8        TAY
C - - - - 0x0280E7 20:80D7: B1 3E     LDA (ram_003E),Y
C - - - - 0x0280E9 20:80D9: AA        TAX
C - - - - 0x0280EA 20:80DA: C8        INY
C - - - - 0x0280EB 20:80DB: B1 3E     LDA (ram_003E),Y
C - - - - 0x0280ED 20:80DD: A0 02     LDY #$02
C - - - - 0x0280EF 20:80DF: 91 3A     STA (ram_003A),Y
C - - - - 0x0280F1 20:80E1: 88        DEY
C - - - - 0x0280F2 20:80E2: 8A        TXA
C - - - - 0x0280F3 20:80E3: 91 3A     STA (ram_003A),Y
C - - - - 0x0280F5 20:80E5: A0 02     LDY #$02
C - - - - 0x0280F7 20:80E7: B1 4C     LDA (ram_004C),Y
C - - - - 0x0280F9 20:80E9: A2 47     LDX #< tbl_AC47
C - - - - 0x0280FB 20:80EB: 86 3E     STX ram_003E
C - - - - 0x0280FD 20:80ED: A2 AC     LDX #> tbl_AC47
C - - - - 0x0280FF 20:80EF: 0A        ASL
C - - - - 0x028100 20:80F0: 90 01     BCC bra_80F3
C - - - - 0x028102 20:80F2: E8        INX
bra_80F3:
C - - - - 0x028103 20:80F3: 86 3F     STX ram_003F
C - - - - 0x028105 20:80F5: A8        TAY
C - - - - 0x028106 20:80F6: B1 3E     LDA (ram_003E),Y
C - - - - 0x028108 20:80F8: AA        TAX
C - - - - 0x028109 20:80F9: C8        INY
C - - - - 0x02810A 20:80FA: B1 3E     LDA (ram_003E),Y
C - - - - 0x02810C 20:80FC: A0 04     LDY #$04
C - - - - 0x02810E 20:80FE: 91 3A     STA (ram_003A),Y
C - - - - 0x028110 20:8100: 88        DEY
C - - - - 0x028111 20:8101: 8A        TXA
C - - - - 0x028112 20:8102: 91 3A     STA (ram_003A),Y
C - - - - 0x028114 20:8104: A0 03     LDY #$03
C - - - - 0x028116 20:8106: B1 4C     LDA (ram_004C),Y
C - - - - 0x028118 20:8108: A0 08     LDY #$08
C - - - - 0x02811A 20:810A: 91 3A     STA (ram_003A),Y
C - - - - 0x02811C 20:810C: A0 04     LDY #$04
C - - - - 0x02811E 20:810E: B1 4C     LDA (ram_004C),Y
C - - - - 0x028120 20:8110: A0 0C     LDY #$0C
C - - - - 0x028122 20:8112: 91 3A     STA (ram_003A),Y
C - - - - 0x028124 20:8114: A0 05     LDY #$05
C - - - - 0x028126 20:8116: B1 4C     LDA (ram_004C),Y
C - - - - 0x028128 20:8118: AA        TAX
C - - - - 0x028129 20:8119: 29 03     AND #$03
C - - - - 0x02812B 20:811B: 85 3C     STA ram_003C
C - - - - 0x02812D 20:811D: 05 3C     ORA ram_003C
C - - - - 0x02812F 20:811F: 09 80     ORA #$80
C - - - - 0x028131 20:8121: A0 00     LDY #$00
C - - - - 0x028133 20:8123: 91 3A     STA (ram_003A),Y
C - - - - 0x028135 20:8125: A9 06     LDA #$06
C - - - - 0x028137 20:8127: 20 CF 83  JSR sub_83CF
C - - - - 0x02813A 20:812A: 60        RTS

ofs_812B_F2:
- - - - - 0x02813B 20:812B: A9 00     LDA #$00
- - - - - 0x02813D 20:812D: 8D 3E 05  STA $053E
- - - - - 0x028140 20:8130: A9 01     LDA #$01
- - - - - 0x028142 20:8132: 8D 3D 05  STA $053D
- - - - - 0x028145 20:8135: 4C CF 83  JMP loc_83CF

ofs_8138_F3:
- - - - - 0x028148 20:8138: A9 00     LDA #$00
- - - - - 0x02814A 20:813A: 8D 3D 05  STA $053D
- - - - - 0x02814D 20:813D: A9 01     LDA #$01
- - - - - 0x02814F 20:813F: 4C CF 83  JMP loc_83CF

ofs_8142_F4:
C - J - - 0x028152 20:8142: A0 01     LDY #$01
bra_8144:
C - - - - 0x028154 20:8144: B1 4C     LDA (ram_004C),Y
C - - - - 0x028156 20:8146: 99 93 04  STA $0493,Y
C - - - - 0x028159 20:8149: C8        INY
C - - - - 0x02815A 20:814A: C0 05     CPY #$05
C - - - - 0x02815C 20:814C: D0 F6     BNE bra_8144
C - - - - 0x02815E 20:814E: A9 05     LDA #$05
C - - - - 0x028160 20:8150: 4C CF 83  JMP loc_83CF

ofs_8153_F5:
C - J - - 0x028163 20:8153: A0 01     LDY #$01
C - - - - 0x028165 20:8155: B1 4C     LDA (ram_004C),Y
C - - - - 0x028167 20:8157: 10 06     BPL bra_815F
C - - - - 0x028169 20:8159: 20 BA 81  JSR sub_81BA
C - - - - 0x02816C 20:815C: 4C 64 81  JMP loc_8164
bra_815F:
C - - - - 0x02816F 20:815F: A2 10     LDX #$10
C - - - - 0x028171 20:8161: 20 30 C5  JSR sub_0x03CC12
loc_8164:
C D - - - 0x028174 20:8164: 20 33 C5  JSR sub_0x03CCE2
- D - I - 0x028177 20:8167: 00        .byte $00
- D - I - 0x028178 20:8168: 6C 04     .word ram_копия_спрайт_Y + 4
C - - - - 0x02817A 20:816A: A9 02     LDA #$02
C - - - - 0x02817C 20:816C: 4C CF 83  JMP loc_83CF

ofs_816F_F8:
C - J - - 0x02817F 20:816F: A0 01     LDY #$01
C - - - - 0x028181 20:8171: B1 4C     LDA (ram_004C),Y
C - - - - 0x028183 20:8173: AA        TAX
C - - - - 0x028184 20:8174: C8        INY
C - - - - 0x028185 20:8175: B1 4C     LDA (ram_004C),Y
C - - - - 0x028187 20:8177: 86 4C     STX ram_004C
C - - - - 0x028189 20:8179: 85 4D     STA ram_004D
C - - - - 0x02818B 20:817B: 60        RTS

ofs_817C_F9:
C - J - - 0x02818C 20:817C: A0 01     LDY #$01
C - - - - 0x02818E 20:817E: B1 4C     LDA (ram_004C),Y
C - - - - 0x028190 20:8180: 8D 42 05  STA $0542
C - - - - 0x028193 20:8183: C8        INY
C - - - - 0x028194 20:8184: 98        TYA
C - - - - 0x028195 20:8185: 18        CLC
C - - - - 0x028196 20:8186: 65 4C     ADC ram_004C
C - - - - 0x028198 20:8188: 85 4E     STA ram_004E
C - - - - 0x02819A 20:818A: A5 4D     LDA ram_004D
C - - - - 0x02819C 20:818C: 69 00     ADC #$00
C - - - - 0x02819E 20:818E: 85 4F     STA ram_004F
C - - - - 0x0281A0 20:8190: A9 02     LDA #$02
C - - - - 0x0281A2 20:8192: 4C CF 83  JMP loc_83CF

ofs_8195_FA:
C - J - - 0x0281A5 20:8195: A9 01     LDA #$01
C - - - - 0x0281A7 20:8197: CE 42 05  DEC $0542
C - - - - 0x0281AA 20:819A: F0 0A     BEQ bra_81A6
C - - - - 0x0281AC 20:819C: A5 4E     LDA ram_004E
C - - - - 0x0281AE 20:819E: 85 4C     STA ram_004C
C - - - - 0x0281B0 20:81A0: A5 4F     LDA ram_004F
C - - - - 0x0281B2 20:81A2: 85 4D     STA ram_004D
C - - - - 0x0281B4 20:81A4: A9 00     LDA #$00
bra_81A6:
C - - - - 0x0281B6 20:81A6: 4C CF 83  JMP loc_83CF

ofs_81A9_FB:
C - J - - 0x0281B9 20:81A9: A0 01     LDY #$01
bra_81AB:
C - - - - 0x0281BB 20:81AB: B1 4C     LDA (ram_004C),Y
C - - - - 0x0281BD 20:81AD: 99 42 05  STA $0542,Y
C - - - - 0x0281C0 20:81B0: C8        INY
C - - - - 0x0281C1 20:81B1: C0 04     CPY #$04
C - - - - 0x0281C3 20:81B3: D0 F6     BNE bra_81AB
C - - - - 0x0281C5 20:81B5: A9 04     LDA #$04
C - - - - 0x0281C7 20:81B7: 4C CF 83  JMP loc_83CF

sub_81BA:
C - - - - 0x0281CA 20:81BA: 29 7F     AND #$7F
C - - - - 0x0281CC 20:81BC: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0281CF 20:81BF: CF 81     .word ofs_81CF_00
- D - I - 0x0281D1 20:81C1: E9 81     .word ofs_81E9_01
- D - I - 0x0281D3 20:81C3: DB 81     .word ofs_81DB_02
- D - I - 0x0281D5 20:81C5: E1 81     .word ofs_81E1_03
- D - I - 0x0281D7 20:81C7: BC 82     .word ofs_82BC_04
- D - I - 0x0281D9 20:81C9: 7F 83     .word ofs_837F_05_06
- - - - - 0x0281DB 20:81CB: 7F 83     .word ofs_837F_05_06
- D - I - 0x0281DD 20:81CD: D5 81     .word ofs_81D5_07

ofs_81CF_00:
C - J - - 0x0281DF 20:81CF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0281E2 20:81D2: 4C EC 81  JMP loc_81EC

ofs_81D5_07:
C - J - - 0x0281E5 20:81D5: AD FC 05  LDA ram_принимающий
C - - - - 0x0281E8 20:81D8: 4C EC 81  JMP loc_81EC

ofs_81DB_02:
C - J - - 0x0281EB 20:81DB: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0281EE 20:81DE: 4C EC 81  JMP loc_81EC

ofs_81E1_03:
C - J - - 0x0281F1 20:81E1: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0281F4 20:81E4: 49 0B     EOR #$0B
C - - - - 0x0281F6 20:81E6: 4C EC 81  JMP loc_81EC

ofs_81E9_01:
C - J - - 0x0281F9 20:81E9: AD 42 04  LDA ram_игрок_без_мяча
loc_81EC:
C D - - - 0x0281FC 20:81EC: 85 3A     STA ram_003A
C - - - - 0x0281FE 20:81EE: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x028201 20:81F1: 20 6A 82  JSR sub_826A
C - - - - 0x028204 20:81F4: A0 00     LDY #con_игрок_номер
C - - - - 0x028206 20:81F6: B1 34     LDA (ram_plr_data),Y
C - - - - 0x028208 20:81F8: F0 07     BEQ bra_8201
C - - - - 0x02820A 20:81FA: 20 82 82  JSR sub_8282
C - - - - 0x02820D 20:81FD: A2 00     LDX #$00
C - - - - 0x02820F 20:81FF: F0 12     BEQ bra_8213
bra_8201:
C - - - - 0x028211 20:8201: AD 2B 00  LDA ram_команда_соперника
C - - - - 0x028214 20:8204: 38        SEC
C - - - - 0x028215 20:8205: E9 03     SBC #$03
C - - - - 0x028217 20:8207: A2 02     LDX #$02
C - - - - 0x028219 20:8209: A4 3A     LDY ram_003A
C - - - - 0x02821B 20:820B: F0 04     BEQ bra_8211
C - - - - 0x02821D 20:820D: C0 0B     CPY #$0B
C - - - - 0x02821F 20:820F: D0 02     BNE bra_8213
bra_8211:
C - - - - 0x028221 20:8211: A2 04     LDX #$04
bra_8213:
C - - - - 0x028223 20:8213: 85 3A     STA ram_003A
C - - - - 0x028225 20:8215: A0 00     LDY #$00
C - - - - 0x028227 20:8217: 84 3B     STY ram_003B
C - - - - 0x028229 20:8219: A8        TAY
C - - - - 0x02822A 20:821A: 0A        ASL
C - - - - 0x02822B 20:821B: 26 3B     ROL ram_003B
C - - - - 0x02822D 20:821D: 0A        ASL
C - - - - 0x02822E 20:821E: 26 3B     ROL ram_003B
C - - - - 0x028230 20:8220: 65 3A     ADC ram_003A
C - - - - 0x028232 20:8222: 85 3A     STA ram_003A
C - - - - 0x028234 20:8224: A9 00     LDA #$00
C - - - - 0x028236 20:8226: 65 3B     ADC ram_003B
C - - - - 0x028238 20:8228: 85 3B     STA ram_003B
C - - - - 0x02823A 20:822A: 18        CLC
C - - - - 0x02823B 20:822B: A5 3A     LDA ram_003A
C - - - - 0x02823D 20:822D: 7D 64 82  ADC tbl_8264,X
C - - - - 0x028240 20:8230: 85 3A     STA ram_003A
C - - - - 0x028242 20:8232: A5 3B     LDA ram_003B
C - - - - 0x028244 20:8234: 7D 65 82  ADC tbl_8264 + 1,X
C - - - - 0x028247 20:8237: 85 3B     STA ram_003B
C - - - - 0x028249 20:8239: A0 00     LDY #$00
C - - - - 0x02824B 20:823B: B1 3A     LDA (ram_003A),Y
C - - - - 0x02824D 20:823D: C8        INY
C - - - - 0x02824E 20:823E: 48        PHA
C - - - - 0x02824F 20:823F: A2 00     LDX #$00
bra_8241:
C - - - - 0x028251 20:8241: 8A        TXA
C - - - - 0x028252 20:8242: 29 03     AND #$03
C - - - - 0x028254 20:8244: F0 17     BEQ bra_825D
C - - - - 0x028256 20:8246: C9 01     CMP #$01
C - - - - 0x028258 20:8248: F0 0E     BEQ bra_8258
C - - - - 0x02825A 20:824A: C9 02     CMP #$02
C - - - - 0x02825C 20:824C: F0 05     BEQ bra_8253
C - - - - 0x02825E 20:824E: 68        PLA
C - - - - 0x02825F 20:824F: 48        PHA
C - - - - 0x028260 20:8250: 4C 5A 82  JMP loc_825A
bra_8253:
C - - - - 0x028263 20:8253: B1 3A     LDA (ram_003A),Y
C - - - - 0x028265 20:8255: C8        INY
C - - - - 0x028266 20:8256: D0 02     BNE bra_825A
bra_8258:
C - - - - 0x028268 20:8258: A9 0F     LDA #$0F
bra_825A:
loc_825A:
C D - - - 0x02826A 20:825A: 9D 7F 04  STA $047F,X
bra_825D:
C - - - - 0x02826D 20:825D: E8        INX
C - - - - 0x02826E 20:825E: E0 10     CPX #$10
C - - - - 0x028270 20:8260: D0 DF     BNE bra_8241
C - - - - 0x028272 20:8262: 68        PLA
C - - - - 0x028273 20:8263: 60        RTS

tbl_8264:
- D - - - 0x028274 20:8264: 0C B8     .word off_B80C
- D - - - 0x028276 20:8266: C7 B6     .word off_B6C7
- D - - - 0x028278 20:8268: 67 B7     .word off_B767

sub_826A:
C - - - - 0x02827A 20:826A: A0 00     LDY #con_игрок_номер
C - - - - 0x02827C 20:826C: B1 34     LDA (ram_plr_data),Y
C - - - - 0x02827E 20:826E: 08        PHP
C - - - - 0x02827F 20:826F: AA        TAX
C - - - - 0x028280 20:8270: BD F0 88  LDA tbl_88F0,X
C - - - - 0x028283 20:8273: 28        PLP
C - - - - 0x028284 20:8274: D0 08     BNE bra_827E
C - - - - 0x028286 20:8276: A6 3A     LDX ram_003A
C - - - - 0x028288 20:8278: E0 0B     CPX #$0B
C - - - - 0x02828A 20:827A: D0 02     BNE bra_827E
C - - - - 0x02828C 20:827C: A9 04     LDA #$04
bra_827E:
C - - - - 0x02828E 20:827E: 8D 46 05  STA $0546
C - - - - 0x028291 20:8281: 60        RTS

sub_8282:
C - - - - 0x028292 20:8282: A2 01     LDX #$01
C - - - - 0x028294 20:8284: 85 3B     STA ram_003B
C - - - - 0x028296 20:8286: C9 01     CMP #$01
C - - - - 0x028298 20:8288: F0 0C     BEQ bra_8296
C - - - - 0x02829A 20:828A: A2 00     LDX #$00
C - - - - 0x02829C 20:828C: C9 0F     CMP #$0F
C - - - - 0x02829E 20:828E: 90 06     BCC bra_8296
C - - - - 0x0282A0 20:8290: C9 17     CMP #$17
C - - - - 0x0282A2 20:8292: B0 02     BCS bra_8296
C - - - - 0x0282A4 20:8294: A2 02     LDX #$02
bra_8296:
C - - - - 0x0282A6 20:8296: 8A        TXA
C - - - - 0x0282A7 20:8297: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0282AA 20:829A: A0 82     .word ofs_82A0_00
- D - I - 0x0282AC 20:829C: A3 82     .word ofs_82A3_01
- D - I - 0x0282AE 20:829E: AD 82     .word ofs_82AD_02

ofs_82A0_00:
C - J - - 0x0282B0 20:82A0: A5 3B     LDA ram_003B
C - - - - 0x0282B2 20:82A2: 60        RTS

ofs_82A3_01:
C - J - - 0x0282B3 20:82A3: A9 01     LDA #$01
C - - - - 0x0282B5 20:82A5: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x0282B8 20:82A8: F0 02     BEQ bra_82AC_выход
C - - - - 0x0282BA 20:82AA: A9 76     LDA #$76
bra_82AC_выход:
C - - - - 0x0282BC 20:82AC: 60        RTS

ofs_82AD_02:
C - J - - 0x0282BD 20:82AD: A9 00     LDA #$00
C - - - - 0x0282BF 20:82AF: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x0282C2 20:82B2: E0 01     CPX #$01
C - - - - 0x0282C4 20:82B4: F0 02     BEQ bra_82B8
C - - - - 0x0282C6 20:82B6: A9 68     LDA #$68
bra_82B8:
C - - - - 0x0282C8 20:82B8: 18        CLC
C - - - - 0x0282C9 20:82B9: 65 3B     ADC ram_003B
C - - - - 0x0282CB 20:82BB: 60        RTS

ofs_82BC_04:
C - J - - 0x0282CC 20:82BC: A0 02     LDY #$02
C - - - - 0x0282CE 20:82BE: B1 4C     LDA (ram_004C),Y
C - - - - 0x0282D0 20:82C0: 10 03     BPL bra_82C5
C - - - - 0x0282D2 20:82C2: 20 16 83  JSR sub_8316
bra_82C5:
C - - - - 0x0282D5 20:82C5: A2 00     LDX #$00
C - - - - 0x0282D7 20:82C7: 86 3B     STX ram_003B
C - - - - 0x0282D9 20:82C9: 0A        ASL
C - - - - 0x0282DA 20:82CA: 26 3B     ROL ram_003B
C - - - - 0x0282DC 20:82CC: 0A        ASL
C - - - - 0x0282DD 20:82CD: 26 3B     ROL ram_003B
C - - - - 0x0282DF 20:82CF: 0A        ASL
C - - - - 0x0282E0 20:82D0: 26 3B     ROL ram_003B
C - - - - 0x0282E2 20:82D2: 0A        ASL
C - - - - 0x0282E3 20:82D3: 26 3B     ROL ram_003B
C - - - - 0x0282E5 20:82D5: 69 CF     ADC #< tbl_BACF
C - - - - 0x0282E7 20:82D7: 85 3A     STA ram_003A
C - - - - 0x0282E9 20:82D9: A5 3B     LDA ram_003B
C - - - - 0x0282EB 20:82DB: 69 BA     ADC #> tbl_BACF
C - - - - 0x0282ED 20:82DD: 85 3B     STA ram_003B
bra_82DF:
C - - - - 0x0282EF 20:82DF: BD F6 82  LDA tbl_82F6,X
C - - - - 0x0282F2 20:82E2: 10 05     BPL bra_82E9
C - - - - 0x0282F4 20:82E4: 29 7F     AND #$7F
C - - - - 0x0282F6 20:82E6: A8        TAY
C - - - - 0x0282F7 20:82E7: B1 3A     LDA (ram_003A),Y
bra_82E9:
C - - - - 0x0282F9 20:82E9: 9D 6F 04  STA $046F,X
C - - - - 0x0282FC 20:82EC: E8        INX
C - - - - 0x0282FD 20:82ED: E0 20     CPX #$20
C - - - - 0x0282FF 20:82EF: D0 EE     BNE bra_82DF
C - - - - 0x028301 20:82F1: A9 01     LDA #$01
C - - - - 0x028303 20:82F3: 4C CF 83  JMP loc_83CF

tbl_82F6:
- D - - - 0x028306 20:82F6: 0F        .byte $0F	; <そ>
- D - - - 0x028307 20:82F7: 0F        .byte $0F	; <そ>
- D - - - 0x028308 20:82F8: 0F        .byte $0F	; <そ>
- D - - - 0x028309 20:82F9: 30        .byte $30	; <ゃ>
- D - - - 0x02830A 20:82FA: 0F        .byte $0F	; <そ>
- D - - - 0x02830B 20:82FB: 21        .byte $21	; <む>
- D - - - 0x02830C 20:82FC: 89        .byte $89	; <I>
- D - - - 0x02830D 20:82FD: 8A        .byte $8A	; <N>
- D - - - 0x02830E 20:82FE: 0F        .byte $0F	; <そ>
- D - - - 0x02830F 20:82FF: 21        .byte $21	; <む>
- D - - - 0x028310 20:8300: 8B        .byte $8B	; <K>
- D - - - 0x028311 20:8301: 8C        .byte $8C	; <M>
- D - - - 0x028312 20:8302: 0F        .byte $0F	; <そ>
- D - - - 0x028313 20:8303: 21        .byte $21	; <む>
- D - - - 0x028314 20:8304: 8D        .byte $8D	; <P>
- D - - - 0x028315 20:8305: 8E        .byte $8E	; <L>
- D - - - 0x028316 20:8306: 0F        .byte $0F	; <そ>
- D - - - 0x028317 20:8307: 0F        .byte $0F	; <そ>
- D - - - 0x028318 20:8308: 80        .byte $80
- D - - - 0x028319 20:8309: 81        .byte $81	; <A>
- D - - - 0x02831A 20:830A: 0F        .byte $0F	; <そ>
- D - - - 0x02831B 20:830B: 0F        .byte $0F	; <そ>
- D - - - 0x02831C 20:830C: 82        .byte $82	; <B>
- D - - - 0x02831D 20:830D: 83        .byte $83	; <C>
- D - - - 0x02831E 20:830E: 0F        .byte $0F	; <そ>
- D - - - 0x02831F 20:830F: 0F        .byte $0F	; <そ>
- D - - - 0x028320 20:8310: 84        .byte $84	; <D>
- D - - - 0x028321 20:8311: 85        .byte $85	; <E>
- D - - - 0x028322 20:8312: 0F        .byte $0F	; <そ>
- D - - - 0x028323 20:8313: 86        .byte $86	; <F>
- D - - - 0x028324 20:8314: 87        .byte $87	; <G>
- D - - - 0x028325 20:8315: 88        .byte $88	; <H>

sub_8316:
C - - - - 0x028326 20:8316: 29 7F     AND #$7F
C - - - - 0x028328 20:8318: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02832B 20:831B: 2B 83     .word ofs_832B_00
- D - I - 0x02832D 20:831D: 35 83     .word ofs_8335_01
- D - I - 0x02832F 20:831F: 42 83     .word ofs_8342_02
- D - I - 0x028331 20:8321: 47 83     .word ofs_8347_03
- D - I - 0x028333 20:8323: 61 83     .word ofs_8361_04
- D - I - 0x028335 20:8325: 65 83     .word ofs_8365_05
- - - - - 0x028337 20:8327: 6A 83     .word ofs_836A_06
- - - - - 0x028339 20:8329: 7B 83     .word ofs_837B_07

ofs_832B_00:
C - J - - 0x02833B 20:832B: A9 00     LDA #$00
C - - - - 0x02833D 20:832D: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x028340 20:8330: F0 02     BEQ bra_8334_выход
C - - - - 0x028342 20:8332: A9 01     LDA #$01
bra_8334_выход:
C - - - - 0x028344 20:8334: 60        RTS

ofs_8335_01:
C - J - - 0x028345 20:8335: A9 03     LDA #$03
                                      BNE bra_8337
ofs_8342_02:
                                      LDA #$05
                                      BNE bra_8337
ofs_8365_05:
                                      LDA #$0B
bra_8337:
C D - - - 0x028347 20:8337: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x02834A 20:833A: E0 01     CPX #$01
C - - - - 0x02834C 20:833C: F0 03     BEQ bra_8341_выход
C - - - - 0x02834E 20:833E: 18        CLC
C - - - - 0x02834F 20:833F: 69 01     ADC #$01
bra_8341_выход:
C - - - - 0x028351 20:8341: 60        RTS

ofs_8347_03:
C - J - - 0x028357 20:8347: 18        CLC
                                      BCC bra_8348
ofs_8361_04:
                                      SEC
bra_8348:
C D - - - 0x028358 20:8348: 08        PHP
C - - - - 0x028359 20:8349: A9 2E     LDA #$2E
C - - - - 0x02835B 20:834B: AE 2B 00  LDX ram_команда_соперника
C - - - - 0x02835E 20:834E: E0 12     CPX #$12
C - - - - 0x028360 20:8350: F0 0B     BEQ bra_835D
C - - - - 0x028362 20:8352: A9 07     LDA #$07
C - - - - 0x028364 20:8354: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x028367 20:8357: E0 01     CPX #$01
C - - - - 0x028369 20:8359: F0 02     BEQ bra_835D
C - - - - 0x02836B 20:835B: A9 09     LDA #$09
bra_835D:
C - - - - 0x02836D 20:835D: 28        PLP
C - - - - 0x02836E 20:835E: 69 00     ADC #$00
C - - - - 0x028370 20:8360: 60        RTS

ofs_836A_06:
- - - - - 0x02837A 20:836A: 18        CLC
loc_836B:
- - - - - 0x02837B 20:836B: 08        PHP
- - - - - 0x02837C 20:836C: A9 15     LDA #$15
- - - - - 0x02837E 20:836E: AE 2A 00  LDX ram_твоя_команда
- - - - - 0x028381 20:8371: E0 02     CPX #$02
- - - - - 0x028383 20:8373: F0 02     BEQ bra_8377
- - - - - 0x028385 20:8375: A9 26     LDA #$26
bra_8377:
- - - - - 0x028387 20:8377: 28        PLP
- - - - - 0x028388 20:8378: 69 00     ADC #$00
- - - - - 0x02838A 20:837A: 60        RTS

ofs_837B_07:
- - - - - 0x02838B 20:837B: 38        SEC
- - - - - 0x02838C 20:837C: 4C 6B 83  JMP loc_836B

ofs_837F_05_06:
C - J - - 0x02838F 20:837F: A2 00     LDX #$00
C - - - - 0x028391 20:8381: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x028394 20:8384: F0 01     BEQ bra_8387
C - - - - 0x028396 20:8386: E8        INX
bra_8387:
C - - - - 0x028397 20:8387: BD 2A 00  LDA ram_твоя_команда,X
C - - - - 0x02839A 20:838A: 0A        ASL
C - - - - 0x02839B 20:838B: A8        TAY
C - - - - 0x02839C 20:838C: A2 00     LDX #$00
bra_838E:
C - - - - 0x02839E 20:838E: BD A6 83  LDA tbl_83A6,X
C - - - - 0x0283A1 20:8391: 9D 7F 04  STA $047F,X
C - - - - 0x0283A4 20:8394: E8        INX
C - - - - 0x0283A5 20:8395: E0 08     CPX #$08
C - - - - 0x0283A7 20:8397: D0 F5     BNE bra_838E
C - - - - 0x0283A9 20:8399: B9 87 BA  LDA tbl_BA87,Y
C - - - - 0x0283AC 20:839C: 8D 81 04  STA $0481
C - - - - 0x0283AF 20:839F: B9 88 BA  LDA tbl_BA87 + 1,Y
C - - - - 0x0283B2 20:83A2: 8D 82 04  STA $0482
C - - - - 0x0283B5 20:83A5: 60        RTS

tbl_83A6:
- D - - - 0x0283B6 20:83A6: 0F        .byte $0F	; <そ>
- D - - - 0x0283B7 20:83A7: 0F        .byte $0F	; <そ>
- D - - - 0x0283B8 20:83A8: 00        .byte $00
- D - - - 0x0283B9 20:83A9: 00        .byte $00
- D - - - 0x0283BA 20:83AA: 0F        .byte $0F	; <そ>
- D - - - 0x0283BB 20:83AB: 0F        .byte $0F	; <そ>
- D - - - 0x0283BC 20:83AC: 30        .byte $30	; <ゃ>
- D - - - 0x0283BD 20:83AD: 00        .byte $00

ofs_83AE_F6:
C - J - - 0x0283BE 20:83AE: A0 01     LDY #$01
C - - - - 0x0283C0 20:83B0: B1 4C     LDA (ram_004C),Y
C - - - - 0x0283C2 20:83B2: AA        TAX
C - - - - 0x0283C3 20:83B3: A9 00     LDA #$00
C - - - - 0x0283C5 20:83B5: 9D 47 05  STA $0547,X
C - - - - 0x0283C8 20:83B8: A9 02     LDA #$02
C - - - - 0x0283CA 20:83BA: 4C CF 83  JMP loc_83CF

ofs_83BD_F7:
C - J - - 0x0283CD 20:83BD: A0 01     LDY #$01
C - - - - 0x0283CF 20:83BF: B1 4C     LDA (ram_004C),Y
C - - - - 0x0283D1 20:83C1: 8D 40 05  STA $0540
C - - - - 0x0283D4 20:83C4: C8        INY
C - - - - 0x0283D5 20:83C5: B1 4C     LDA (ram_004C),Y
C - - - - 0x0283D7 20:83C7: 8D 41 05  STA $0541
C - - - - 0x0283DA 20:83CA: A9 03     LDA #$03
C - - - - 0x0283DC 20:83CC: 4C CF 83  JMP loc_83CF

sub_83CF:
loc_83CF:
C D - - - 0x0283DF 20:83CF: 18        CLC
C - - - - 0x0283E0 20:83D0: 65 4C     ADC ram_004C
C - - - - 0x0283E2 20:83D2: 85 4C     STA ram_004C
C - - - - 0x0283E4 20:83D4: 90 02     BCC bra_83D8_выход
C - - - - 0x0283E6 20:83D6: E6 4D     INC ram_004D
bra_83D8_выход:
C - - - - 0x0283E8 20:83D8: 60        RTS

loc_83D9:
C D - - - 0x0283E9 20:83D9: A0 10     LDY #$10
C - - - - 0x0283EB 20:83DB: B1 3C     LDA (ram_003C),Y
C - - - - 0x0283ED 20:83DD: F0 0A     BEQ bra_83E9
C - - - - 0x0283EF 20:83DF: C9 FF     CMP #$FF
C - - - - 0x0283F1 20:83E1: F0 05     BEQ bra_83E8_выход
C - - - - 0x0283F3 20:83E3: 38        SEC
C - - - - 0x0283F4 20:83E4: E9 01     SBC #$01
C - - - - 0x0283F6 20:83E6: 91 3C     STA (ram_003C),Y
bra_83E8_выход:
C - - - - 0x0283F8 20:83E8: 60        RTS
bra_83E9:
C - - - - 0x0283F9 20:83E9: A0 00     LDY #$00
C - - - - 0x0283FB 20:83EB: B1 3C     LDA (ram_003C),Y
C - - - - 0x0283FD 20:83ED: 29 9F     AND #$9F
C - - - - 0x0283FF 20:83EF: 91 3C     STA (ram_003C),Y
C - - - - 0x028401 20:83F1: A0 13     LDY #$13
C - - - - 0x028403 20:83F3: A9 00     LDA #$00
C - - - - 0x028405 20:83F5: 91 3C     STA (ram_003C),Y
C - - - - 0x028407 20:83F7: C8        INY
C - - - - 0x028408 20:83F8: 91 3C     STA (ram_003C),Y
C - - - - 0x02840A 20:83FA: A0 03     LDY #$03
C - - - - 0x02840C 20:83FC: B1 3C     LDA (ram_003C),Y
C - - - - 0x02840E 20:83FE: 85 3E     STA ram_003E
C - - - - 0x028410 20:8400: C8        INY
C - - - - 0x028411 20:8401: B1 3C     LDA (ram_003C),Y
C - - - - 0x028413 20:8403: 85 3F     STA ram_003F
C - - - - 0x028415 20:8405: A0 00     LDY #$00
C - - - - 0x028417 20:8407: 84 40     STY ram_0040
loc_8409:
C D - - - 0x028419 20:8409: A4 40     LDY ram_0040
C - - - - 0x02841B 20:840B: E6 40     INC ram_0040
C - - - - 0x02841D 20:840D: B1 3E     LDA (ram_003E),Y
C - - - - 0x02841F 20:840F: C9 F0     CMP #$F0
C - - - - 0x028421 20:8411: 90 06     BCC bra_8419
C - - - - 0x028423 20:8413: 20 38 84  JSR sub_8438
C - - - - 0x028426 20:8416: 4C 09 84  JMP loc_8409
bra_8419:
C - - - - 0x028429 20:8419: AA        TAX
C - - - - 0x02842A 20:841A: C8        INY
C - - - - 0x02842B 20:841B: 98        TYA
C - - - - 0x02842C 20:841C: 48        PHA
C - - - - 0x02842D 20:841D: B1 3E     LDA (ram_003E),Y
C - - - - 0x02842F 20:841F: A0 12     LDY #$12
C - - - - 0x028431 20:8421: 91 3C     STA (ram_003C),Y
C - - - - 0x028433 20:8423: 8A        TXA
C - - - - 0x028434 20:8424: A0 10     LDY #$10
C - - - - 0x028436 20:8426: 91 3C     STA (ram_003C),Y
C - - - - 0x028438 20:8428: 68        PLA
C - - - - 0x028439 20:8429: A0 03     LDY #$03
C - - - - 0x02843B 20:842B: 38        SEC
C - - - - 0x02843C 20:842C: 65 3E     ADC ram_003E
C - - - - 0x02843E 20:842E: 91 3C     STA (ram_003C),Y
C - - - - 0x028440 20:8430: C8        INY
C - - - - 0x028441 20:8431: A9 00     LDA #$00
C - - - - 0x028443 20:8433: 65 3F     ADC ram_003F
C - - - - 0x028445 20:8435: 91 3C     STA (ram_003C),Y
C - - - - 0x028447 20:8437: 60        RTS

sub_8438:
C - - - - 0x028448 20:8438: 38        SEC
C - - - - 0x028449 20:8439: E9 F0     SBC #$F0
C - - - - 0x02844B 20:843B: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02844E 20:843E: 50 84     .word ofs_8450_F0
- D - I - 0x028450 20:8440: 59 84     .word ofs_8459_F1
- D - I - 0x028452 20:8442: 5D 84     .word ofs_845D_F2
- D - I - 0x028454 20:8444: 66 84     .word ofs_8466_F3
- D - I - 0x028456 20:8446: 77 84     .word ofs_8477_F4
- D - I - 0x028458 20:8448: 96 84     .word ofs_8496_F5
- D - I - 0x02845A 20:844A: B3 84     .word ofs_84B3_F6
- D - I - 0x02845C 20:844C: C7 84     .word ofs_84C7_F7
- D - I - 0x02845E 20:844E: D2 84     .word ofs_84D2_F8

loc_8450:
ofs_8450_F0:
C D - - - 0x028460 20:8450: A0 10     LDY #$10
C - - - - 0x028462 20:8452: A9 FF     LDA #$FF
C - - - - 0x028464 20:8454: 91 3C     STA (ram_003C),Y
C - - - - 0x028466 20:8456: 68        PLA
C - - - - 0x028467 20:8457: 68        PLA
C - - - - 0x028468 20:8458: 60        RTS

ofs_8459_F1:
C - J - - 0x028469 20:8459: A9 20     LDA #$20
C - - - - 0x02846B 20:845B: D0 02     BNE bra_845F

ofs_845D_F2:
C - J - - 0x02846D 20:845D: A9 40     LDA #$40
bra_845F:
C - - - - 0x02846F 20:845F: A0 00     LDY #$00
C - - - - 0x028471 20:8461: 11 3C     ORA (ram_003C),Y
C - - - - 0x028473 20:8463: 91 3C     STA (ram_003C),Y
C - - - - 0x028475 20:8465: 60        RTS

ofs_8466_F3:
C - J - - 0x028476 20:8466: A4 40     LDY ram_0040
C - - - - 0x028478 20:8468: B1 3E     LDA (ram_003E),Y
C - - - - 0x02847A 20:846A: AA        TAX
C - - - - 0x02847B 20:846B: C8        INY
C - - - - 0x02847C 20:846C: B1 3E     LDA (ram_003E),Y
C - - - - 0x02847E 20:846E: 85 3F     STA ram_003F
C - - - - 0x028480 20:8470: 86 3E     STX ram_003E
C - - - - 0x028482 20:8472: A9 00     LDA #$00
C - - - - 0x028484 20:8474: 85 40     STA ram_0040
C - - - - 0x028486 20:8476: 60        RTS

ofs_8477_F4:
C - J - - 0x028487 20:8477: A4 40     LDY ram_0040
C - - - - 0x028489 20:8479: B1 3E     LDA (ram_003E),Y
C - - - - 0x02848B 20:847B: 48        PHA
C - - - - 0x02848C 20:847C: C8        INY
C - - - - 0x02848D 20:847D: 84 40     STY ram_0040
C - - - - 0x02848F 20:847F: 98        TYA
C - - - - 0x028490 20:8480: A6 3F     LDX ram_003F
C - - - - 0x028492 20:8482: 18        CLC
C - - - - 0x028493 20:8483: 65 3E     ADC ram_003E
C - - - - 0x028495 20:8485: 90 01     BCC bra_8488
- - - - - 0x028497 20:8487: E8        INX
bra_8488:
C - - - - 0x028498 20:8488: A0 0E     LDY #$0E
C - - - - 0x02849A 20:848A: 91 3C     STA (ram_003C),Y
C - - - - 0x02849C 20:848C: 8A        TXA
C - - - - 0x02849D 20:848D: C8        INY
C - - - - 0x02849E 20:848E: 91 3C     STA (ram_003C),Y
C - - - - 0x0284A0 20:8490: A0 0D     LDY #$0D
C - - - - 0x0284A2 20:8492: 68        PLA
C - - - - 0x0284A3 20:8493: 91 3C     STA (ram_003C),Y
C - - - - 0x0284A5 20:8495: 60        RTS

ofs_8496_F5:
C - J - - 0x0284A6 20:8496: A0 0D     LDY #$0D
C - - - - 0x0284A8 20:8498: B1 3C     LDA (ram_003C),Y
C - - - - 0x0284AA 20:849A: 38        SEC
C - - - - 0x0284AB 20:849B: E9 01     SBC #$01
C - - - - 0x0284AD 20:849D: D0 01     BNE bra_84A0
C - - - - 0x0284AF 20:849F: 60        RTS
bra_84A0:
C - - - - 0x0284B0 20:84A0: 91 3C     STA (ram_003C),Y
C - - - - 0x0284B2 20:84A2: A0 0E     LDY #$0E
C - - - - 0x0284B4 20:84A4: B1 3C     LDA (ram_003C),Y
C - - - - 0x0284B6 20:84A6: AA        TAX
C - - - - 0x0284B7 20:84A7: C8        INY
C - - - - 0x0284B8 20:84A8: B1 3C     LDA (ram_003C),Y
C - - - - 0x0284BA 20:84AA: 85 3F     STA ram_003F
C - - - - 0x0284BC 20:84AC: 86 3E     STX ram_003E
C - - - - 0x0284BE 20:84AE: A9 00     LDA #$00
C - - - - 0x0284C0 20:84B0: 85 40     STA ram_0040
C - - - - 0x0284C2 20:84B2: 60        RTS

ofs_84B3_F6:
C - J - - 0x0284C3 20:84B3: A4 40     LDY ram_0040
C - - - - 0x0284C5 20:84B5: B1 3E     LDA (ram_003E),Y
C - - - - 0x0284C7 20:84B7: AA        TAX
C - - - - 0x0284C8 20:84B8: C8        INY
C - - - - 0x0284C9 20:84B9: B1 3E     LDA (ram_003E),Y
C - - - - 0x0284CB 20:84BB: C8        INY
C - - - - 0x0284CC 20:84BC: 84 40     STY ram_0040
C - - - - 0x0284CE 20:84BE: A0 14     LDY #$14
C - - - - 0x0284D0 20:84C0: 91 3C     STA (ram_003C),Y
C - - - - 0x0284D2 20:84C2: 88        DEY
C - - - - 0x0284D3 20:84C3: 8A        TXA
C - - - - 0x0284D4 20:84C4: 91 3C     STA (ram_003C),Y
C - - - - 0x0284D6 20:84C6: 60        RTS

ofs_84C7_F7:
C - J - - 0x0284D7 20:84C7: A4 40     LDY ram_0040
C - - - - 0x0284D9 20:84C9: B1 3E     LDA (ram_003E),Y
C - - - - 0x0284DB 20:84CB: A0 12     LDY #$12
C - - - - 0x0284DD 20:84CD: 91 3C     STA (ram_003C),Y
C - - - - 0x0284DF 20:84CF: 4C 50 84  JMP loc_8450

ofs_84D2_F8:
C - J - - 0x0284E2 20:84D2: A4 40     LDY ram_0040
C - - - - 0x0284E4 20:84D4: E6 40     INC ram_0040
C - - - - 0x0284E6 20:84D6: B1 3E     LDA (ram_003E),Y
C - - - - 0x0284E8 20:84D8: 8D 46 05  STA $0546
C - - - - 0x0284EB 20:84DB: 60        RTS

loc_84DC:
C D - - - 0x0284EC 20:84DC: A0 11     LDY #$11
C - - - - 0x0284EE 20:84DE: B1 3C     LDA (ram_003C),Y
C - - - - 0x0284F0 20:84E0: F0 0D     BEQ bra_84EF
C - - - - 0x0284F2 20:84E2: C9 FF     CMP #$FF
C - - - - 0x0284F4 20:84E4: D0 01     BNE bra_84E7
C - - - - 0x0284F6 20:84E6: 60        RTS
bra_84E7:
C - - - - 0x0284F7 20:84E7: 38        SEC
C - - - - 0x0284F8 20:84E8: E9 01     SBC #$01
C - - - - 0x0284FA 20:84EA: 91 3C     STA (ram_003C),Y
C - - - - 0x0284FC 20:84EC: 4C 2A 85  JMP loc_852A
bra_84EF:
C - - - - 0x0284FF 20:84EF: 85 40     STA ram_0040
C - - - - 0x028501 20:84F1: A0 01     LDY #$01
C - - - - 0x028503 20:84F3: B1 3C     LDA (ram_003C),Y
C - - - - 0x028505 20:84F5: 85 3E     STA ram_003E
C - - - - 0x028507 20:84F7: C8        INY
C - - - - 0x028508 20:84F8: B1 3C     LDA (ram_003C),Y
C - - - - 0x02850A 20:84FA: 85 3F     STA ram_003F
C - - - - 0x02850C 20:84FC: A0 00     LDY #$00
C - - - - 0x02850E 20:84FE: B1 3C     LDA (ram_003C),Y
C - - - - 0x028510 20:8500: 29 10     AND #$10
C - - - - 0x028512 20:8502: F0 0B     BEQ bra_850F
C - - - - 0x028514 20:8504: A9 04     LDA #$04
C - - - - 0x028516 20:8506: 18        CLC
C - - - - 0x028517 20:8507: 65 3E     ADC ram_003E
C - - - - 0x028519 20:8509: 85 3E     STA ram_003E
C - - - - 0x02851B 20:850B: 90 02     BCC bra_850F
C - - - - 0x02851D 20:850D: E6 3F     INC ram_003F
bra_850F:
C - - - - 0x02851F 20:850F: A0 00     LDY #$00
C - - - - 0x028521 20:8511: B1 3C     LDA (ram_003C),Y
C - - - - 0x028523 20:8513: 29 EF     AND #$EF
C - - - - 0x028525 20:8515: 91 3C     STA (ram_003C),Y
C - - - - 0x028527 20:8517: 20 7A 85  JSR sub_857A
C - - - - 0x02852A 20:851A: A5 40     LDA ram_0040
C - - - - 0x02852C 20:851C: A0 01     LDY #$01
C - - - - 0x02852E 20:851E: 18        CLC
C - - - - 0x02852F 20:851F: 65 3E     ADC ram_003E
C - - - - 0x028531 20:8521: 91 3C     STA (ram_003C),Y
C - - - - 0x028533 20:8523: C8        INY
C - - - - 0x028534 20:8524: A5 3F     LDA ram_003F
C - - - - 0x028536 20:8526: 69 00     ADC #$00
C - - - - 0x028538 20:8528: 91 3C     STA (ram_003C),Y
loc_852A:
C D - - - 0x02853A 20:852A: A9 00     LDA #$00
C - - - - 0x02853C 20:852C: 85 42     STA ram_0042
C - - - - 0x02853E 20:852E: 85 43     STA ram_0043
C - - - - 0x028540 20:8530: A0 00     LDY #$00
C - - - - 0x028542 20:8532: B1 3C     LDA (ram_003C),Y
C - - - - 0x028544 20:8534: 29 FC     AND #$FC
C - - - - 0x028546 20:8536: 85 41     STA ram_0041
C - - - - 0x028548 20:8538: B1 3C     LDA (ram_003C),Y
C - - - - 0x02854A 20:853A: 4A        LSR
C - - - - 0x02854B 20:853B: 26 42     ROL ram_0042
C - - - - 0x02854D 20:853D: 4A        LSR
C - - - - 0x02854E 20:853E: 26 43     ROL ram_0043
C - - - - 0x028550 20:8540: A2 00     LDX #$00
C - - - - 0x028552 20:8542: A0 05     LDY #$05
C - - - - 0x028554 20:8544: 20 F2 85  JSR sub_85F2
C - - - - 0x028557 20:8547: A2 01     LDX #$01
C - - - - 0x028559 20:8549: A0 09     LDY #$09
C - - - - 0x02855B 20:854B: 20 F2 85  JSR sub_85F2
C - - - - 0x02855E 20:854E: A9 00     LDA #$00
C - - - - 0x028560 20:8550: 46 43     LSR ram_0043
C - - - - 0x028562 20:8552: 2A        ROL
C - - - - 0x028563 20:8553: 46 42     LSR ram_0042
C - - - - 0x028565 20:8555: 2A        ROL
C - - - - 0x028566 20:8556: 05 41     ORA ram_0041
C - - - - 0x028568 20:8558: A0 00     LDY #$00
C - - - - 0x02856A 20:855A: 91 3C     STA (ram_003C),Y
C - - - - 0x02856C 20:855C: 29 10     AND #$10
C - - - - 0x02856E 20:855E: F0 19     BEQ bra_8579_выход
C - - - - 0x028570 20:8560: A0 01     LDY #$01
C - - - - 0x028572 20:8562: B1 3C     LDA (ram_003C),Y
C - - - - 0x028574 20:8564: 85 3E     STA ram_003E
C - - - - 0x028576 20:8566: C8        INY
C - - - - 0x028577 20:8567: B1 3C     LDA (ram_003C),Y
C - - - - 0x028579 20:8569: 85 3F     STA ram_003F
C - - - - 0x02857B 20:856B: A2 05     LDX #$05
C - - - - 0x02857D 20:856D: A0 01     LDY #$01
C - - - - 0x02857F 20:856F: 20 0D 86  JSR sub_860D
C - - - - 0x028582 20:8572: A2 09     LDX #$09
C - - - - 0x028584 20:8574: A0 03     LDY #$03
C - - - - 0x028586 20:8576: 20 0D 86  JSR sub_860D
bra_8579_выход:
C - - - - 0x028589 20:8579: 60        RTS

sub_857A:
loc_857A:
C D - - - 0x02858A 20:857A: A4 40     LDY ram_0040
C - - - - 0x02858C 20:857C: E6 40     INC ram_0040
C - - - - 0x02858E 20:857E: B1 3E     LDA (ram_003E),Y
C - - - - 0x028590 20:8580: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x028593 20:8583: A0 85     .word ofs_85A0_00
- D - I - 0x028595 20:8585: A9 85     .word ofs_85A9_01
- D - I - 0x028597 20:8587: D5 85     .word ofs_85D5_02
- D - I - 0x028599 20:8589: E1 85     .word ofs_85E1_03
- D - I - 0x02859B 20:858B: 8D 85     .word ofs_858D_04

ofs_858D_04:
C - J - - 0x02859D 20:858D: A4 40     LDY ram_0040
C - - - - 0x02859F 20:858F: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285A1 20:8591: AA        TAX
C - - - - 0x0285A2 20:8592: C8        INY
C - - - - 0x0285A3 20:8593: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285A5 20:8595: 85 3F     STA ram_003F
C - - - - 0x0285A7 20:8597: 86 3E     STX ram_003E
C - - - - 0x0285A9 20:8599: A9 00     LDA #$00
C - - - - 0x0285AB 20:859B: 85 40     STA ram_0040
C - - - - 0x0285AD 20:859D: 4C 7A 85  JMP loc_857A

ofs_85A0_00:
C - J - - 0x0285B0 20:85A0: A0 11     LDY #$11
C - - - - 0x0285B2 20:85A2: A9 FF     LDA #$FF
C - - - - 0x0285B4 20:85A4: 91 3C     STA (ram_003C),Y
C - - - - 0x0285B6 20:85A6: 68        PLA
C - - - - 0x0285B7 20:85A7: 68        PLA
C - - - - 0x0285B8 20:85A8: 60        RTS

sub_85A9:
ofs_85A9_01:
C - J - - 0x0285B9 20:85A9: 20 E7 85  JSR sub_85E7
C - - - - 0x0285BC 20:85AC: A4 40     LDY ram_0040
C - - - - 0x0285BE 20:85AE: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285C0 20:85B0: AA        TAX
C - - - - 0x0285C1 20:85B1: C8        INY
C - - - - 0x0285C2 20:85B2: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285C4 20:85B4: C8        INY
C - - - - 0x0285C5 20:85B5: 84 40     STY ram_0040
C - - - - 0x0285C7 20:85B7: A0 07     LDY #$07
C - - - - 0x0285C9 20:85B9: 91 3C     STA (ram_003C),Y
C - - - - 0x0285CB 20:85BB: 88        DEY
C - - - - 0x0285CC 20:85BC: 88        DEY
C - - - - 0x0285CD 20:85BD: 8A        TXA
C - - - - 0x0285CE 20:85BE: 91 3C     STA (ram_003C),Y
C - - - - 0x0285D0 20:85C0: A4 40     LDY ram_0040
C - - - - 0x0285D2 20:85C2: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285D4 20:85C4: AA        TAX
C - - - - 0x0285D5 20:85C5: C8        INY
C - - - - 0x0285D6 20:85C6: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285D8 20:85C8: C8        INY
C - - - - 0x0285D9 20:85C9: 84 40     STY ram_0040
C - - - - 0x0285DB 20:85CB: A0 0B     LDY #$0B
C - - - - 0x0285DD 20:85CD: 91 3C     STA (ram_003C),Y
C - - - - 0x0285DF 20:85CF: 88        DEY
C - - - - 0x0285E0 20:85D0: 88        DEY
C - - - - 0x0285E1 20:85D1: 8A        TXA
C - - - - 0x0285E2 20:85D2: 91 3C     STA (ram_003C),Y
C - - - - 0x0285E4 20:85D4: 60        RTS

ofs_85D5_02:
C - J - - 0x0285E5 20:85D5: 20 E7 85  JSR sub_85E7
loc_85D8:
C D - - - 0x0285E8 20:85D8: A0 00     LDY #$00
C - - - - 0x0285EA 20:85DA: B1 3C     LDA (ram_003C),Y
C - - - - 0x0285EC 20:85DC: 09 10     ORA #$10
C - - - - 0x0285EE 20:85DE: 91 3C     STA (ram_003C),Y
C - - - - 0x0285F0 20:85E0: 60        RTS

ofs_85E1_03:
C - J - - 0x0285F1 20:85E1: 20 A9 85  JSR sub_85A9
C - - - - 0x0285F4 20:85E4: 4C D8 85  JMP loc_85D8

sub_85E7:
C - - - - 0x0285F7 20:85E7: A4 40     LDY ram_0040
C - - - - 0x0285F9 20:85E9: B1 3E     LDA (ram_003E),Y
C - - - - 0x0285FB 20:85EB: A0 11     LDY #$11
C - - - - 0x0285FD 20:85ED: 91 3C     STA (ram_003C),Y
C - - - - 0x0285FF 20:85EF: E6 40     INC ram_0040
C - - - - 0x028601 20:85F1: 60        RTS

sub_85F2:
C - - - - 0x028602 20:85F2: 18        CLC
C - - - - 0x028603 20:85F3: B1 3C     LDA (ram_003C),Y
C - - - - 0x028605 20:85F5: C8        INY
C - - - - 0x028606 20:85F6: 71 3C     ADC (ram_003C),Y
C - - - - 0x028608 20:85F8: 91 3C     STA (ram_003C),Y
C - - - - 0x02860A 20:85FA: C8        INY
C - - - - 0x02860B 20:85FB: B1 3C     LDA (ram_003C),Y
C - - - - 0x02860D 20:85FD: 10 02     BPL bra_8601
C - - - - 0x02860F 20:85FF: D6 42     DEC ram_0042,X
bra_8601:
C - - - - 0x028611 20:8601: C8        INY
C - - - - 0x028612 20:8602: 71 3C     ADC (ram_003C),Y
C - - - - 0x028614 20:8604: 91 3C     STA (ram_003C),Y
C - - - - 0x028616 20:8606: B5 42     LDA ram_0042,X
C - - - - 0x028618 20:8608: 69 00     ADC #$00
C - - - - 0x02861A 20:860A: 95 42     STA ram_0042,X
C - - - - 0x02861C 20:860C: 60        RTS

sub_860D:
C - - - - 0x02861D 20:860D: B1 3E     LDA (ram_003E),Y
C - - - - 0x02861F 20:860F: 48        PHA
C - - - - 0x028620 20:8610: 88        DEY
C - - - - 0x028621 20:8611: B1 3E     LDA (ram_003E),Y
C - - - - 0x028623 20:8613: 48        PHA
C - - - - 0x028624 20:8614: 8A        TXA
C - - - - 0x028625 20:8615: A8        TAY
C - - - - 0x028626 20:8616: 68        PLA
C - - - - 0x028627 20:8617: 18        CLC
C - - - - 0x028628 20:8618: 71 3C     ADC (ram_003C),Y
C - - - - 0x02862A 20:861A: 91 3C     STA (ram_003C),Y
C - - - - 0x02862C 20:861C: C8        INY
C - - - - 0x02862D 20:861D: C8        INY
C - - - - 0x02862E 20:861E: 68        PLA
C - - - - 0x02862F 20:861F: 71 3C     ADC (ram_003C),Y
C - - - - 0x028631 20:8621: 91 3C     STA (ram_003C),Y
C - - - - 0x028633 20:8623: 60        RTS

loc_8624:
C D - - - 0x028634 20:8624: AD 2D 06  LDA $062D
C - - - - 0x028637 20:8627: 29 0F     AND #$0F
C - - - - 0x028639 20:8629: C9 05     CMP #$05
C - - - - 0x02863B 20:862B: D0 03     BNE bra_8630
C - - - - 0x02863D 20:862D: 4C 61 88  JMP loc_8861
bra_8630:
C - - - - 0x028640 20:8630: 20 53 87  JSR sub_8753
C - - - - 0x028643 20:8633: A9 00     LDA #$00
C - - - - 0x028645 20:8635: 85 46     STA ram_0046
loc_8637:
C D - - - 0x028647 20:8637: A5 46     LDA ram_0046
C - - - - 0x028649 20:8639: D0 03     BNE bra_863E
C - - - - 0x02864B 20:863B: 4C CF 86  JMP loc_86CF
bra_863E:
C - - - - 0x02864E 20:863E: C9 0B     CMP #$0B
C - - - - 0x028650 20:8640: D0 03     BNE bra_8645
C - - - - 0x028652 20:8642: 4C CF 86  JMP loc_86CF
bra_8645:
C - - - - 0x028655 20:8645: 20 DB 86  JSR sub_86DB
C - - - - 0x028658 20:8648: B0 03     BCS bra_864D
C - - - - 0x02865A 20:864A: 4C CF 86  JMP loc_86CF
bra_864D:
C - - - - 0x02865D 20:864D: A6 3B     LDX ram_003B
C - - - - 0x02865F 20:864F: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x028661 20:8651: B1 34     LDA (ram_plr_data),Y
C - - - - 0x028663 20:8653: C9 34     CMP #$34
C - - - - 0x028665 20:8655: B0 02     BCS bra_8659
C - - - - 0x028667 20:8657: A9 34     LDA #$34
bra_8659:
C - - - - 0x028669 20:8659: C9 CC     CMP #$CC
C - - - - 0x02866B 20:865B: 90 02     BCC bra_865F
C - - - - 0x02866D 20:865D: A9 CC     LDA #$CC
bra_865F:
C - - - - 0x02866F 20:865F: 48        PHA
C - - - - 0x028670 20:8660: AD 2D 06  LDA $062D
C - - - - 0x028673 20:8663: 29 0F     AND #$0F
C - - - - 0x028675 20:8665: A8        TAY
C - - - - 0x028676 20:8666: 68        PLA
C - - - - 0x028677 20:8667: 18        CLC
C - - - - 0x028678 20:8668: 79 DA 88  ADC tbl_88DA,Y
C - - - - 0x02867B 20:866B: 9D 03 02  STA ram_спрайт_X,X
C - - - - 0x02867E 20:866E: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x028680 20:8670: B1 34     LDA (ram_plr_data),Y
C - - - - 0x028682 20:8672: C9 54     CMP #$54
C - - - - 0x028684 20:8674: B0 02     BCS bra_8678
C - - - - 0x028686 20:8676: A9 54     LDA #$54
bra_8678:
C - - - - 0x028688 20:8678: C9 AC     CMP #$AC
C - - - - 0x02868A 20:867A: 90 02     BCC bra_867E
C - - - - 0x02868C 20:867C: A9 AC     LDA #$AC
bra_867E:
C - - - - 0x02868E 20:867E: 48        PHA
C - - - - 0x02868F 20:867F: AD 2D 06  LDA $062D
C - - - - 0x028692 20:8682: 29 0F     AND #$0F
C - - - - 0x028694 20:8684: A8        TAY
C - - - - 0x028695 20:8685: 68        PLA
C - - - - 0x028696 20:8686: 18        CLC
C - - - - 0x028697 20:8687: 79 DF 88  ADC tbl_88DF,Y
C - - - - 0x02869A 20:868A: 9D 00 02  STA ram_спрайт_Y,X
C - - - - 0x02869D 20:868D: A9 03     LDA #$03
C - - - - 0x02869F 20:868F: 9D 02 02  STA ram_спрайт_атрибут,X
C - - - - 0x0286A2 20:8692: 2C 15 06  BIT $0615
C - - - - 0x0286A5 20:8695: 10 11     BPL bra_86A8
C - - - - 0x0286A7 20:8697: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0286AA 20:869A: F0 0C     BEQ bra_86A8
C - - - - 0x0286AC 20:869C: A5 46     LDA ram_0046
C - - - - 0x0286AE 20:869E: C9 0B     CMP #$0B
C - - - - 0x0286B0 20:86A0: B0 06     BCS bra_86A8
C - - - - 0x0286B2 20:86A2: 20 F2 86  JSR sub_86F2
C - - - - 0x0286B5 20:86A5: 4C B5 86  JMP loc_86B5
bra_86A8:
C - - - - 0x0286B8 20:86A8: A5 46     LDA ram_0046
C - - - - 0x0286BA 20:86AA: CD 41 04  CMP ram_игрок_с_мячом
C - - - - 0x0286BD 20:86AD: D0 06     BNE bra_86B5
C - - - - 0x0286BF 20:86AF: 20 1D 88  JSR sub_881D_анимация_мяча_миникарты
C - - - - 0x0286C2 20:86B2: 4C C4 86  JMP loc_86C4
bra_86B5:
loc_86B5:
C D - - - 0x0286C5 20:86B5: C9 0B     CMP #$0B
C - - - - 0x0286C7 20:86B7: 90 02     BCC bra_86BB
C - - - - 0x0286C9 20:86B9: E9 01     SBC #$01
bra_86BB:
C - - - - 0x0286CB 20:86BB: 18        CLC
C - - - - 0x0286CC 20:86BC: 69 11     ADC #$11
C - - - - 0x0286CE 20:86BE: C9 20     CMP #$20
C - - - - 0x0286D0 20:86C0: 90 02     BCC bra_86C4
C - - - - 0x0286D2 20:86C2: 69 0F     ADC #$0F
bra_86C4:
loc_86C4:
C D - - - 0x0286D4 20:86C4: 9D 01 02  STA ram_спрайт_тайл,X
C - - - - 0x0286D7 20:86C7: E8        INX
C - - - - 0x0286D8 20:86C8: E8        INX
C - - - - 0x0286D9 20:86C9: E8        INX
C - - - - 0x0286DA 20:86CA: E8        INX
C - - - - 0x0286DB 20:86CB: 86 3B     STX ram_003B
C - - - - 0x0286DD 20:86CD: E6 48     INC ram_0048
loc_86CF:
C D - - - 0x0286DF 20:86CF: E6 46     INC ram_0046
C - - - - 0x0286E1 20:86D1: A5 46     LDA ram_0046
C - - - - 0x0286E3 20:86D3: C9 16     CMP #$16
C - - - - 0x0286E5 20:86D5: F0 03     BEQ bra_86DA_выход
C - - - - 0x0286E7 20:86D7: 4C 37 86  JMP loc_8637
bra_86DA_выход:
C - - - - 0x0286EA 20:86DA: 60        RTS

sub_86DB:
C - - - - 0x0286EB 20:86DB: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0286EE 20:86DE: AD 2D 06  LDA $062D
C - - - - 0x0286F1 20:86E1: 29 0F     AND #$0F
C - - - - 0x0286F3 20:86E3: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0286F6 20:86E6: 1D 87     .word ofs_871D_00_01_04
- D - I - 0x0286F8 20:86E8: 1D 87     .word ofs_871D_00_01_04
- D - I - 0x0286FA 20:86EA: 1F 87     .word ofs_871F_02
- D - I - 0x0286FC 20:86EC: 3B 87     .word ofs_873B_03
- D - I - 0x0286FE 20:86EE: 1D 87     .word ofs_871D_00_01_04

sub_86F2:
C - - - - 0x028702 20:86F2: A5 46     LDA ram_0046
C - - - - 0x028704 20:86F4: CD FD 05  CMP ram_управляемый
C - - - - 0x028707 20:86F7: D0 23     BNE bra_871C_выход
C - - - - 0x028709 20:86F9: AD 2E 06  LDA $062E
C - - - - 0x02870C 20:86FC: D0 11     BNE bra_870F
C - - - - 0x02870E 20:86FE: A0 07     LDY #$07
C - - - - 0x028710 20:8700: AD 2D 06  LDA $062D
C - - - - 0x028713 20:8703: 49 40     EOR #$40
C - - - - 0x028715 20:8705: 8D 2D 06  STA $062D
C - - - - 0x028718 20:8708: 70 02     BVS bra_870C
C - - - - 0x02871A 20:870A: A0 04     LDY #$04
bra_870C:
C - - - - 0x02871C 20:870C: 8C 2E 06  STY $062E
bra_870F:
C - - - - 0x02871F 20:870F: CE 2E 06  DEC $062E
C - - - - 0x028722 20:8712: A5 46     LDA ram_0046
C - - - - 0x028724 20:8714: 2C 2D 06  BIT $062D
C - - - - 0x028727 20:8717: 70 03     BVS bra_871C_выход
C - - - - 0x028729 20:8719: 18        CLC
C - - - - 0x02872A 20:871A: 69 0B     ADC #$0B
bra_871C_выход:
C - - - - 0x02872C 20:871C: 60        RTS

ofs_871F_02:
C - J - - 0x02872F 20:871F: A5 46     LDA ram_0046
C - - - - 0x028731 20:8721: C9 0B     CMP #$0B
C - - - - 0x028733 20:8723: B0 14     BCS bra_8739
C - - - - 0x028735 20:8725: CD 41 04  CMP ram_игрок_с_мячом
C - - - - 0x028738 20:8728: F0 0F     BEQ bra_8739
C - - - - 0x02873A 20:872A: AE 30 04  LDX $0430
C - - - - 0x02873D 20:872D: F0 08     BEQ bra_8737
bra_872F:
C - - - - 0x02873F 20:872F: DD 30 04  CMP $0430,X
C - - - - 0x028742 20:8732: F0 05     BEQ bra_8739
C - - - - 0x028744 20:8734: CA        DEX
C - - - - 0x028745 20:8735: D0 F8     BNE bra_872F
bra_8737:
C - - - - 0x028747 20:8737: 18        CLC
C - - - - 0x028748 20:8738: 60        RTS
bra_8739:
ofs_871D_00_01_04:
C - - - - 0x028749 20:8739: 38        SEC
C - - - - 0x02874A 20:873A: 60        RTS

ofs_873B_03:
C - J - - 0x02874B 20:873B: A5 46     LDA ram_0046
C - - - - 0x02874D 20:873D: CD 41 04  CMP ram_игрок_с_мячом
C - - - - 0x028750 20:8740: F0 0F     BEQ bra_8751
C - - - - 0x028752 20:8742: AE 00 06  LDX $0600
C - - - - 0x028755 20:8745: F0 08     BEQ bra_874F
bra_8747:
C - - - - 0x028757 20:8747: DD 00 06  CMP $0600,X
C - - - - 0x02875A 20:874A: F0 05     BEQ bra_8751
C - - - - 0x02875C 20:874C: CA        DEX
C - - - - 0x02875D 20:874D: D0 F8     BNE bra_8747
bra_874F:
C - - - - 0x02875F 20:874F: 38        SEC
C - - - - 0x028760 20:8750: 60        RTS
bra_8751:
C - - - - 0x028761 20:8751: 18        CLC
C - - - - 0x028762 20:8752: 60        RTS

sub_8753:
C - - - - 0x028763 20:8753: AD 2D 06  LDA $062D
C - - - - 0x028766 20:8756: 29 0F     AND #$0F
C - - - - 0x028768 20:8758: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02876B 20:875B: 67 87     .word _общий_RTS
- D - I - 0x02876D 20:875D: 68 87     .word ofs_8768_01
- D - I - 0x02876F 20:875F: 71 87     .word ofs_8771_02
- D - I - 0x028771 20:8761: 84 87     .word ofs_8784_03
- D - I - 0x028773 20:8763: 67 87     .word _общий_RTS

ofs_8768_01:
C - J - - 0x028778 20:8768: AD 24 06  LDA $0624
C - - - - 0x02877B 20:876B: 20 36 C5  JSR sub_0x03CDD9
C - - - - 0x02877E 20:876E: 4C E7 87  JMP loc_87E7

ofs_8771_02:
C - J - - 0x028781 20:8771: AD FC 05  LDA ram_принимающий
C - - - - 0x028784 20:8774: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x028787 20:8777: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x028789 20:8779: B1 34     LDA (ram_plr_data),Y
C - - - - 0x02878B 20:877B: AA        TAX
C - - - - 0x02878C 20:877C: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x02878E 20:877E: B1 34     LDA (ram_plr_data),Y
C - - - - 0x028790 20:8780: A8        TAY
C - - - - 0x028791 20:8781: 4C E7 87  JMP loc_87E7

ofs_8784_03:
C - J - - 0x028794 20:8784: AD 24 06  LDA $0624
C - - - - 0x028797 20:8787: 20 A7 87  JSR sub_87A7
C - - - - 0x02879A 20:878A: 48        PHA
C - - - - 0x02879B 20:878B: AD 24 06  LDA $0624
C - - - - 0x02879E 20:878E: 20 C7 87  JSR sub_87C7
C - - - - 0x0287A1 20:8791: 68        PLA
C - - - - 0x0287A2 20:8792: AA        TAX
C - - - - 0x0287A3 20:8793: 4C E7 87  JMP loc_87E7

loc_8796:
C D - - - 0x0287A6 20:8796: A9 10     LDA #$10
C - - - - 0x0287A8 20:8798: 20 A7 87  JSR sub_87A7
C - - - - 0x0287AB 20:879B: 8D 35 06  STA $0635
C - - - - 0x0287AE 20:879E: A9 10     LDA #$10
C - - - - 0x0287B0 20:87A0: 20 C7 87  JSR sub_87C7
C - - - - 0x0287B3 20:87A3: 8D 37 06  STA $0637
C - - - - 0x0287B6 20:87A6: 60        RTS

sub_87A7:
C - - - - 0x0287B7 20:87A7: 85 3E     STA ram_003E
C - - - - 0x0287B9 20:87A9: AD 2C 06  LDA $062C
C - - - - 0x0287BC 20:87AC: 20 45 C5  JSR sub_0x03C555
C - - - - 0x0287BF 20:87AF: 86 3C     STX ram_003C
C - - - - 0x0287C1 20:87B1: 84 3D     STY ram_003D
C - - - - 0x0287C3 20:87B3: AE 39 06  LDX $0639
C - - - - 0x0287C6 20:87B6: AC 35 06  LDY $0635
bra_87B9:
C - - - - 0x0287C9 20:87B9: 18        CLC
C - - - - 0x0287CA 20:87BA: 8A        TXA
C - - - - 0x0287CB 20:87BB: 65 3C     ADC ram_003C
C - - - - 0x0287CD 20:87BD: AA        TAX
C - - - - 0x0287CE 20:87BE: 98        TYA
C - - - - 0x0287CF 20:87BF: 65 3D     ADC ram_003D
C - - - - 0x0287D1 20:87C1: A8        TAY
C - - - - 0x0287D2 20:87C2: C6 3E     DEC ram_003E
C - - - - 0x0287D4 20:87C4: 10 F3     BPL bra_87B9
C - - - - 0x0287D6 20:87C6: 60        RTS

sub_87C7:
C - - - - 0x0287D7 20:87C7: 85 3E     STA ram_003E
C - - - - 0x0287D9 20:87C9: AD 2C 06  LDA $062C
C - - - - 0x0287DC 20:87CC: 20 42 C5  JSR sub_0x03C552
C - - - - 0x0287DF 20:87CF: 86 3C     STX ram_003C
C - - - - 0x0287E1 20:87D1: 84 3D     STY ram_003D
C - - - - 0x0287E3 20:87D3: AE 3B 06  LDX $063B
C - - - - 0x0287E6 20:87D6: AC 37 06  LDY $0637
bra_87D9:
C - - - - 0x0287E9 20:87D9: 18        CLC
C - - - - 0x0287EA 20:87DA: 8A        TXA
C - - - - 0x0287EB 20:87DB: 65 3C     ADC ram_003C
C - - - - 0x0287ED 20:87DD: AA        TAX
C - - - - 0x0287EE 20:87DE: 98        TYA
C - - - - 0x0287EF 20:87DF: 65 3D     ADC ram_003D
C - - - - 0x0287F1 20:87E1: A8        TAY
C - - - - 0x0287F2 20:87E2: C6 3E     DEC ram_003E
C - - - - 0x0287F4 20:87E4: 10 F3     BPL bra_87D9
C - - - - 0x0287F6 20:87E6: 60        RTS

loc_87E7:
C D - - - 0x0287F7 20:87E7: 8A        TXA
C - - - - 0x0287F8 20:87E8: 18        CLC
C - - - - 0x0287F9 20:87E9: 69 FD     ADC #$FD
C - - - - 0x0287FB 20:87EB: A6 3B     LDX ram_003B
C - - - - 0x0287FD 20:87ED: 9D 03 02  STA ram_спрайт_X,X
C - - - - 0x028800 20:87F0: 98        TYA
C - - - - 0x028801 20:87F1: 18        CLC
C - - - - 0x028802 20:87F2: 69 C7     ADC #$C7
C - - - - 0x028804 20:87F4: 9D 00 02  STA ram_спрайт_Y,X
C - - - - 0x028807 20:87F7: A9 3C     LDA #$3C
C - - - - 0x028809 20:87F9: AC 2D 06  LDY $062D
C - - - - 0x02880C 20:87FC: C0 83     CPY #$83
C - - - - 0x02880E 20:87FE: 08        PHP
C - - - - 0x02880F 20:87FF: A0 01     LDY #$01
C - - - - 0x028811 20:8801: 28        PLP
C - - - - 0x028812 20:8802: D0 04     BNE bra_8808
C - - - - 0x028814 20:8804: A0 03     LDY #$03
C - - - - 0x028816 20:8806: A9 11     LDA #$11
bra_8808:
C - - - - 0x028818 20:8808: 9D 01 02  STA ram_спрайт_тайл,X
C - - - - 0x02881B 20:880B: 98        TYA
C - - - - 0x02881C 20:880C: 9D 02 02  STA ram_спрайт_атрибут,X
C - - - - 0x02881F 20:880F: E8        INX
C - - - - 0x028820 20:8810: E8        INX
C - - - - 0x028821 20:8811: E8        INX
C - - - - 0x028822 20:8812: E8        INX
C - - - - 0x028823 20:8813: 86 3B     STX ram_003B
C - - - - 0x028825 20:8815: E6 48     INC ram_0048
C - - - - 0x028827 20:8817: A9 01     LDA #$01
C - - - - 0x028829 20:8819: 8D 32 05  STA $0532
C - - - - 0x02882C 20:881C: 60        RTS

sub_881D_анимация_мяча_миникарты:
C - - - - 0x02882D 20:881D: AC 40 06  LDY ram_счетчик_анимации_мяча_миникарты_lo
C - - - - 0x028830 20:8820: D0 12     BNE bra_8834_пропуск_изменения_счетчика
C - - - - 0x028832 20:8822: AC 41 06  LDY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - 0x028835 20:8825: C8        INY
C - - - - 0x028836 20:8826: C0 03     CPY #$03
C - - - - 0x028838 20:8828: D0 02     BNE bra_882C_не_обнулять_счетчик
C - - - - 0x02883A 20:882A: A0 00     LDY #$00
bra_882C_не_обнулять_счетчик:
C - - - - 0x02883C 20:882C: 8C 41 06  STY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - 0x02883F 20:882F: A9 04     LDA #$04
C - - - - 0x028841 20:8831: 8D 40 06  STA ram_счетчик_анимации_мяча_миникарты_lo
bra_8834_пропуск_изменения_счетчика:
C - - - - 0x028844 20:8834: A9 00     LDA #$00
C - - - - 0x028846 20:8836: AC FB 05  LDY ram_команда_с_мячом
C - - - - 0x028849 20:8839: 08        PHP
C - - - - 0x02884A 20:883A: AC 41 06  LDY ram_счетчик_анимации_мяча_миникарты_hi
C - - - - 0x02884D 20:883D: 28        PLP
C - - - - 0x02884E 20:883E: D0 07     BNE bra_8847_мяч_у_команды_справа
C - - - - 0x028850 20:8840: 98        TYA
C - - - - 0x028851 20:8841: 18        CLC
C - - - - 0x028852 20:8842: 69 03     ADC #$03
C - - - - 0x028854 20:8844: A8        TAY
C - - - - 0x028855 20:8845: A9 80     LDA #$80
bra_8847_мяч_у_команды_справа:
C - - - - 0x028857 20:8847: 2C 37 06  BIT $0637
C - - - - 0x02885A 20:884A: 30 02     BMI bra_884E_не_менять_флаг_зеркала
C - - - - 0x02885C 20:884C: 49 80     EOR #$80
bra_884E_не_менять_флаг_зеркала:
C - - - - 0x02885E 20:884E: 1D 02 02  ORA ram_спрайт_атрибут,X
C - - - - 0x028861 20:8851: 9D 02 02  STA ram_спрайт_атрибут,X
C - - - - 0x028864 20:8854: B9 5B 88  LDA tbl_885B_тайлы_спрайта_мяча_миникарты,Y
C - - - - 0x028867 20:8857: CE 40 06  DEC ram_счетчик_анимации_мяча_миникарты_lo
C - - - - 0x02886A 20:885A: 60        RTS



tbl_885B_тайлы_спрайта_мяча_миникарты:
; вращение диагонально вниз
- D - - - 0x02886B 20:885B: 36        .byte $36	; <3>
- D - - - 0x02886C 20:885C: 37        .byte $37	; <4>
- D - - - 0x02886D 20:885D: 3D        .byte $3D	; <+>
; вращение диагонально вверх
- D - - - 0x02886E 20:885E: 3D        .byte $3D	; <+>
- D - - - 0x02886F 20:885F: 37        .byte $37	; <4>
- D - - - 0x028870 20:8860: 36        .byte $36	; <3>



loc_8861:
C D - - - 0x028871 20:8861: AD 2C 00  LDA ram_расстановка_слева
C - - - - 0x028874 20:8864: 0A        ASL
C - - - - 0x028875 20:8865: 85 46     STA ram_0046
C - - - - 0x028877 20:8867: 0A        ASL
C - - - - 0x028878 20:8868: 0A        ASL
C - - - - 0x028879 20:8869: 65 46     ADC ram_0046
C - - - - 0x02887B 20:886B: AA        TAX
C - - - - 0x02887C 20:886C: A9 00     LDA #$00
C - - - - 0x02887E 20:886E: 85 46     STA ram_0046
bra_8870:
C - - - - 0x028880 20:8870: A4 46     LDY ram_0046
C - - - - 0x028882 20:8872: B9 D0 88  LDA tbl_88D0,Y
C - - - - 0x028885 20:8875: A4 3B     LDY ram_003B
C - - - - 0x028887 20:8877: 99 01 02  STA ram_спрайт_тайл,Y
C - - - - 0x02888A 20:887A: BD A8 88  LDA tbl_88A8,X
C - - - - 0x02888D 20:887D: 48        PHA
C - - - - 0x02888E 20:887E: 29 F0     AND #$F0
C - - - - 0x028890 20:8880: 4A        LSR
C - - - - 0x028891 20:8881: 18        CLC
C - - - - 0x028892 20:8882: 69 A0     ADC #$A0
C - - - - 0x028894 20:8884: 99 03 02  STA ram_спрайт_X,Y
C - - - - 0x028897 20:8887: 68        PLA
C - - - - 0x028898 20:8888: 29 0F     AND #$0F
C - - - - 0x02889A 20:888A: 0A        ASL
C - - - - 0x02889B 20:888B: 0A        ASL
C - - - - 0x02889C 20:888C: 69 A2     ADC #$A2
C - - - - 0x02889E 20:888E: 99 00 02  STA ram_спрайт_Y,Y
C - - - - 0x0288A1 20:8891: A9 00     LDA #$00
C - - - - 0x0288A3 20:8893: 99 02 02  STA ram_спрайт_атрибут,Y
C - - - - 0x0288A6 20:8896: E8        INX
C - - - - 0x0288A7 20:8897: C8        INY
C - - - - 0x0288A8 20:8898: C8        INY
C - - - - 0x0288A9 20:8899: C8        INY
C - - - - 0x0288AA 20:889A: C8        INY
C - - - - 0x0288AB 20:889B: 84 3B     STY ram_003B
C - - - - 0x0288AD 20:889D: E6 48     INC ram_0048
C - - - - 0x0288AF 20:889F: E6 46     INC ram_0046
C - - - - 0x0288B1 20:88A1: A5 46     LDA ram_0046
C - - - - 0x0288B3 20:88A3: C9 0A     CMP #$0A
C - - - - 0x0288B5 20:88A5: D0 C9     BNE bra_8870
C - - - - 0x0288B7 20:88A7: 60        RTS

tbl_88A8:
- D - - - 0x0288B8 20:88A8: 30        .byte $30	; <ゃ>
- D - - - 0x0288B9 20:88A9: 3A        .byte $3A	; <7>
- D - - - 0x0288BA 20:88AA: 35        .byte $35	; <2>
- D - - - 0x0288BB 20:88AB: 25        .byte $25	; <ゆ>
- D - - - 0x0288BC 20:88AC: 52        .byte $52	; <ツ>
- D - - - 0x0288BD 20:88AD: 7A        .byte $7A	; <、>
- D - - - 0x0288BE 20:88AE: 58        .byte $58	; <ネ>
- D - - - 0x0288BF 20:88AF: 75        .byte $75	; <ェ>
- D - - - 0x0288C0 20:88B0: 55        .byte $55	; <ナ>
- D - - - 0x0288C1 20:88B1: 70        .byte $70	; <ャ>
- D - - - 0x0288C2 20:88B2: 20        .byte $20	; <み>
- D - - - 0x0288C3 20:88B3: 2A        .byte $2A	; <れ>
- D - - - 0x0288C4 20:88B4: 25        .byte $25	; <ゆ>
- D - - - 0x0288C5 20:88B5: 15        .byte $15	; <な>
- D - - - 0x0288C6 20:88B6: 51        .byte $51	; <チ>
- D - - - 0x0288C7 20:88B7: 59        .byte $59	; <ノ>
- D - - - 0x0288C8 20:88B8: 46        .byte $46	; <カ>
- D - - - 0x0288C9 20:88B9: 77        .byte $77	; <:>
- D - - - 0x0288CA 20:88BA: 44        .byte $44	; <エ>
- D - - - 0x0288CB 20:88BB: 73        .byte $73	; <ヮ>
- D - - - 0x0288CC 20:88BC: 20        .byte $20	; <み>
- D - - - 0x0288CD 20:88BD: 2A        .byte $2A	; <れ>
- D - - - 0x0288CE 20:88BE: 25        .byte $25	; <ゆ>
- D - - - 0x0288CF 20:88BF: 43        .byte $43	; <ウ>
- D - - - 0x0288D0 20:88C0: 51        .byte $51	; <チ>
- D - - - 0x0288D1 20:88C1: 59        .byte $59	; <ノ>
- D - - - 0x0288D2 20:88C2: 47        .byte $47	; <キ>
- D - - - 0x0288D3 20:88C3: 77        .byte $77	; <:>
- D - - - 0x0288D4 20:88C4: 55        .byte $55	; <ナ>
- D - - - 0x0288D5 20:88C5: 73        .byte $73	; <ヮ>
- D - - - 0x0288D6 20:88C6: 20        .byte $20	; <み>
- D - - - 0x0288D7 20:88C7: 2A        .byte $2A	; <れ>
- D - - - 0x0288D8 20:88C8: 24        .byte $24	; <や>
- D - - - 0x0288D9 20:88C9: 26        .byte $26	; <よ>
- D - - - 0x0288DA 20:88CA: 45        .byte $45	; <オ>
- D - - - 0x0288DB 20:88CB: 7A        .byte $7A	; <、>
- D - - - 0x0288DC 20:88CC: 48        .byte $48	; <ク>
- D - - - 0x0288DD 20:88CD: 75        .byte $75	; <ェ>
- D - - - 0x0288DE 20:88CE: 63        .byte $63	; <モ>
- D - - - 0x0288DF 20:88CF: 42        .byte $42	; <イ>

tbl_88D0:
- D - - - 0x0288E0 20:88D0: 1C        .byte $1C	; <ふ>
- D - - - 0x0288E1 20:88D1: 1D        .byte $1D	; <へ>
- D - - - 0x0288E2 20:88D2: 1E        .byte $1E	; <ほ>
- D - - - 0x0288E3 20:88D3: 1F        .byte $1F	; <ま>
- D - - - 0x0288E4 20:88D4: 30        .byte $30	; <ゃ>
- D - - - 0x0288E5 20:88D5: 31        .byte $31	; <ゅ>
- D - - - 0x0288E6 20:88D6: 32        .byte $32	; <ょ>
- D - - - 0x0288E7 20:88D7: 33        .byte $33	; <0>
- D - - - 0x0288E8 20:88D8: 34        .byte $34	; <1>
- D - - - 0x0288E9 20:88D9: 35        .byte $35	; <2>

tbl_88DA:
- D - - - 0x0288EA 20:88DA: 1D        .byte $1D	; <へ>
- D - - - 0x0288EB 20:88DB: FD        .byte $FD
- D - - - 0x0288EC 20:88DC: FD        .byte $FD
- D - - - 0x0288ED 20:88DD: FD        .byte $FD
- D - - - 0x0288EE 20:88DE: FD        .byte $FD

tbl_88DF:
- D - - - 0x0288EF 20:88DF: 2C        .byte $2C	; <わ>
- D - - - 0x0288F0 20:88E0: C7        .byte $C7	; <ボ>
- D - - - 0x0288F1 20:88E1: C7        .byte $C7	; <ボ>
- D - - - 0x0288F2 20:88E2: C7        .byte $C7	; <ボ>
- D - - - 0x0288F3 20:88E3: C7        .byte $C7	; <ボ>

tbl_88E4:
; какие-то адреса оперативки
- D - - - 0x0288F4 20:88E4: 47 05     .word $0547
- D - - - 0x0288F6 20:88E6: 5C 05     .word $055C
- D - - - 0x0288F8 20:88E8: 71 05     .word $0571
- D - - - 0x0288FA 20:88EA: 86 05     .word $0586
- D - - - 0x0288FC 20:88EC: 9B 05     .word $059B
- D - - - 0x0288FE 20:88EE: B0 05     .word $05B0

tbl_88F0:
- D - - - 0x028900 20:88F0: 08        .byte $08	; <く>
- D - - - 0x028901 20:88F1: 00        .byte $00
- D - - - 0x028902 20:88F2: 0F        .byte $0F	; <そ>
- D - - - 0x028903 20:88F3: 06        .byte $06	; <か>
- D - - - 0x028904 20:88F4: 04        .byte $04	; <え>
- D - - - 0x028905 20:88F5: 09        .byte $09	; <け>
- D - - - 0x028906 20:88F6: 05        .byte $05	; <お>
- D - - - 0x028907 20:88F7: 08        .byte $08	; <く>
- D - - - 0x028908 20:88F8: 08        .byte $08	; <く>
- D - - - 0x028909 20:88F9: 01        .byte $01	; <あ>
- D - - - 0x02890A 20:88FA: 02        .byte $02	; <い>
- D - - - 0x02890B 20:88FB: 08        .byte $08	; <く>
- D - - - 0x02890C 20:88FC: 09        .byte $09	; <け>
- D - - - 0x02890D 20:88FD: 04        .byte $04	; <え>
- D - - - 0x02890E 20:88FE: 08        .byte $08	; <く>
- D - - - 0x02890F 20:88FF: 10        .byte $10	; <た>
- D - - - 0x028910 20:8900: 08        .byte $08	; <く>
- D - - - 0x028911 20:8901: 02        .byte $02	; <い>
- D - - - 0x028912 20:8902: 01        .byte $01	; <あ>
- D - - - 0x028913 20:8903: 03        .byte $03	; <う>
- D - - - 0x028914 20:8904: 06        .byte $06	; <か>
- D - - - 0x028915 20:8905: 0B        .byte $0B	; <さ>
- D - - - 0x028916 20:8906: 05        .byte $05	; <お>
- D - - - 0x028917 20:8907: 03        .byte $03	; <う>
- D - - - 0x028918 20:8908: 03        .byte $03	; <う>
- D - - - 0x028919 20:8909: 01        .byte $01	; <あ>
- D - - - 0x02891A 20:890A: 07        .byte $07	; <き>
- D - - - 0x02891B 20:890B: 04        .byte $04	; <え>
- D - - - 0x02891C 20:890C: 04        .byte $04	; <え>
- D - - - 0x02891D 20:890D: 02        .byte $02	; <い>
- - - - - 0x02891E 20:890E: 02        .byte $02	; <い>
- - - - - 0x02891F 20:890F: 04        .byte $04	; <え>
- D - - - 0x028920 20:8910: 02        .byte $02	; <い>
- D - - - 0x028921 20:8911: 0C        .byte $0C	; <し>
- D - - - 0x028922 20:8912: 0E        .byte $0E	; <せ>
- D - - - 0x028923 20:8913: 03        .byte $03	; <う>
- D - - - 0x028924 20:8914: 01        .byte $01	; <あ>
- D - - - 0x028925 20:8915: 0B        .byte $0B	; <さ>
- D - - - 0x028926 20:8916: 0F        .byte $0F	; <そ>
- D - - - 0x028927 20:8917: 06        .byte $06	; <か>
- D - - - 0x028928 20:8918: 02        .byte $02	; <い>
- D - - - 0x028929 20:8919: 07        .byte $07	; <き>
- D - - - 0x02892A 20:891A: 04        .byte $04	; <え>
- D - - - 0x02892B 20:891B: 0A        .byte $0A	; <こ>
- D - - - 0x02892C 20:891C: 09        .byte $09	; <け>
- D - - - 0x02892D 20:891D: 08        .byte $08	; <く>
- D - - - 0x02892E 20:891E: 04        .byte $04	; <え>
- D - - - 0x02892F 20:891F: 01        .byte $01	; <あ>
- D - - - 0x028930 20:8920: 03        .byte $03	; <う>
- D - - - 0x028931 20:8921: 03        .byte $03	; <う>
- D - - - 0x028932 20:8922: 04        .byte $04	; <え>
- D - - - 0x028933 20:8923: 11        .byte $11	; <ち>
- D - - - 0x028934 20:8924: 02        .byte $02	; <い>
- D - - - 0x028935 20:8925: 02        .byte $02	; <い>
- D - - - 0x028936 20:8926: 07        .byte $07	; <き>
- D - - - 0x028937 20:8927: 02        .byte $02	; <い>
- D - - - 0x028938 20:8928: 04        .byte $04	; <え>
- D - - - 0x028939 20:8929: 0E        .byte $0E	; <せ>
- D - - - 0x02893A 20:892A: 09        .byte $09	; <け>
- D - - - 0x02893B 20:892B: 02        .byte $02	; <い>
- D - - - 0x02893C 20:892C: 0B        .byte $0B	; <さ>
- D - - - 0x02893D 20:892D: 01        .byte $01	; <あ>
- D - - - 0x02893E 20:892E: 04        .byte $04	; <え>
- D - - - 0x02893F 20:892F: 02        .byte $02	; <い>
- D - - - 0x028940 20:8930: 0C        .byte $0C	; <し>
- D - - - 0x028941 20:8931: 07        .byte $07	; <き>
- D - - - 0x028942 20:8932: 0B        .byte $0B	; <さ>
- D - - - 0x028943 20:8933: 01        .byte $01	; <あ>
- D - - - 0x028944 20:8934: 02        .byte $02	; <い>
- D - - - 0x028945 20:8935: 02        .byte $02	; <い>
- D - - - 0x028946 20:8936: 03        .byte $03	; <う>
- D - - - 0x028947 20:8937: 03        .byte $03	; <う>
- D - - - 0x028948 20:8938: 04        .byte $04	; <え>
- D - - - 0x028949 20:8939: 06        .byte $06	; <か>
- D - - - 0x02894A 20:893A: 04        .byte $04	; <え>
- D - - - 0x02894B 20:893B: 02        .byte $02	; <い>
- D - - - 0x02894C 20:893C: 0E        .byte $0E	; <せ>
- D - - - 0x02894D 20:893D: 06        .byte $06	; <か>
- D - - - 0x02894E 20:893E: 06        .byte $06	; <か>
- D - - - 0x02894F 20:893F: 07        .byte $07	; <き>
- D - - - 0x028950 20:8940: 0A        .byte $0A	; <こ>
- D - - - 0x028951 20:8941: 06        .byte $06	; <か>
- D - - - 0x028952 20:8942: 11        .byte $11	; <ち>
- D - - - 0x028953 20:8943: 01        .byte $01	; <あ>
- D - - - 0x028954 20:8944: 04        .byte $04	; <え>
- D - - - 0x028955 20:8945: 05        .byte $05	; <お>
- D - - - 0x028956 20:8946: 0F        .byte $0F	; <そ>
- D - - - 0x028957 20:8947: 04        .byte $04	; <え>
- D - - - 0x028958 20:8948: 01        .byte $01	; <あ>
- D - - - 0x028959 20:8949: 0B        .byte $0B	; <さ>
- D - - - 0x02895A 20:894A: 09        .byte $09	; <け>
- D - - - 0x02895B 20:894B: 0F        .byte $0F	; <そ>
- D - - - 0x02895C 20:894C: 02        .byte $02	; <い>
- D - - - 0x02895D 20:894D: 09        .byte $09	; <け>
- D - - - 0x02895E 20:894E: 0B        .byte $0B	; <さ>
- D - - - 0x02895F 20:894F: 03        .byte $03	; <う>
- D - - - 0x028960 20:8950: 05        .byte $05	; <お>
- D - - - 0x028961 20:8951: 01        .byte $01	; <あ>
- D - - - 0x028962 20:8952: 01        .byte $01	; <あ>
- D - - - 0x028963 20:8953: 00        .byte $00
- D - - - 0x028964 20:8954: 03        .byte $03	; <う>
- D - - - 0x028965 20:8955: 04        .byte $04	; <え>
- D - - - 0x028966 20:8956: 02        .byte $02	; <い>
- D - - - 0x028967 20:8957: 0B        .byte $0B	; <さ>
- D - - - 0x028968 20:8958: 01        .byte $01	; <あ>
- D - - - 0x028969 20:8959: 0D        .byte $0D	; <す>
- D - - - 0x02896A 20:895A: 0A        .byte $0A	; <こ>
- D - - - 0x02896B 20:895B: 07        .byte $07	; <き>
- D - - - 0x02896C 20:895C: 01        .byte $01	; <あ>
- D - - - 0x02896D 20:895D: 02        .byte $02	; <い>
- D - - - 0x02896E 20:895E: 09        .byte $09	; <け>
- D - - - 0x02896F 20:895F: 06        .byte $06	; <か>
- D - - - 0x028970 20:8960: 05        .byte $05	; <お>
- D - - - 0x028971 20:8961: 09        .byte $09	; <け>
- D - - - 0x028972 20:8962: 04        .byte $04	; <え>
- D - - - 0x028973 20:8963: 08        .byte $08	; <く>
- D - - - 0x028974 20:8964: 0E        .byte $0E	; <せ>
- D - - - 0x028975 20:8965: 0B        .byte $0B	; <さ>
- - - - - 0x028976 20:8966: 60        .byte $60	; <ミ>
- - - - - 0x028977 20:8967: 60        .byte $60	; <ミ>

tbl_8968:
- D - I - 0x028978 20:8968: 48 8B     .word off_8B48_00
- D - I - 0x02897A 20:896A: 5C 8B     .word off_8B5C_01
- D - I - 0x02897C 20:896C: 6A 8B     .word off_8B6A_02
- D - I - 0x02897E 20:896E: 78 8B     .word off_8B78_03
- D - I - 0x028980 20:8970: 86 8B     .word off_8B86_04
- D - I - 0x028982 20:8972: 94 8B     .word off_8B94_05
- D - I - 0x028984 20:8974: B4 8B     .word off_8BB4_06
- D - I - 0x028986 20:8976: CA 8B     .word off_8BCA_07
- D - I - 0x028988 20:8978: E0 8B     .word off_8BE0_08
- D - I - 0x02898A 20:897A: EE 8B     .word off_8BEE_09
- - - - - 0x02898C 20:897C: 04 8C     .word off_8C04_0A
- D - I - 0x02898E 20:897E: 12 8C     .word off_8C12_0B
- D - I - 0x028990 20:8980: 28 8C     .word off_8C28_0C
- D - I - 0x028992 20:8982: 3C 8C     .word off_8C3C_0D
- D - I - 0x028994 20:8984: 4A 8C     .word off_8C4A_0E
- D - I - 0x028996 20:8986: 61 8C     .word off_8C61_0F
- D - I - 0x028998 20:8988: 78 8C     .word off_8C78_10
- D - I - 0x02899A 20:898A: 86 8C     .word off_8C86_11
- D - I - 0x02899C 20:898C: 94 8C     .word off_8C94_12
- D - I - 0x02899E 20:898E: A2 8C     .word off_8CA2_13
- D - I - 0x0289A0 20:8990: B9 8C     .word off_8CB9_14
- D - I - 0x0289A2 20:8992: D0 8C     .word off_8CD0_15
- D - I - 0x0289A4 20:8994: DE 8C     .word off_8CDE_16
- D - I - 0x0289A6 20:8996: EC 8C     .word off_8CEC_17
- D - I - 0x0289A8 20:8998: 09 8D     .word off_8D09_18
- D - I - 0x0289AA 20:899A: 1F 8D     .word off_8D1F_19
- D - I - 0x0289AC 20:899C: 52 8D     .word off_8D52_1A
- D - I - 0x0289AE 20:899E: 60 8D     .word off_8D60_1B
- D - I - 0x0289B0 20:89A0: 89 8D     .word off_8D89_1C
- D - I - 0x0289B2 20:89A2: 97 8D     .word off_8D97_1D
- D - I - 0x0289B4 20:89A4: A5 8D     .word off_8DA5_1E
- D - I - 0x0289B6 20:89A6: B3 8D     .word off_8DB3_1F
- D - I - 0x0289B8 20:89A8: C1 8D     .word off_8DC1_20
- D - I - 0x0289BA 20:89AA: CF 8D     .word off_8DCF_21
- D - I - 0x0289BC 20:89AC: 05 8E     .word off_8E05_22
- D - I - 0x0289BE 20:89AE: 1B 8E     .word off_8E1B_23
- D - I - 0x0289C0 20:89B0: 32 8E     .word off_8E32_24
- D - I - 0x0289C2 20:89B2: 5B 8E     .word off_8E5B_25
- D - I - 0x0289C4 20:89B4: 7A 8E     .word off_8E7A_26
- D - I - 0x0289C6 20:89B6: 8E 8E     .word off_8E8E_27
- D - I - 0x0289C8 20:89B8: C6 8E     .word off_8EC6_28
- D - I - 0x0289CA 20:89BA: E5 8E     .word off_8EE5_29
- D - I - 0x0289CC 20:89BC: F3 8E     .word off_8EF3_2A
- D - I - 0x0289CE 20:89BE: 29 8F     .word off_8F29_2B
- D - I - 0x0289D0 20:89C0: 53 8F     .word off_8F53_2C
- D - I - 0x0289D2 20:89C2: 7C 8F     .word off_8F7C_2D
- D - I - 0x0289D4 20:89C4: 99 8F     .word off_8F99_2E
- D - I - 0x0289D6 20:89C6: A7 8F     .word off_8FA7_2F
- D - I - 0x0289D8 20:89C8: BE 8F     .word off_8FBE_30
- D - I - 0x0289DA 20:89CA: CC 8F     .word off_8FCC_31
- D - I - 0x0289DC 20:89CC: E2 8F     .word off_8FE2_32
- D - I - 0x0289DE 20:89CE: F9 8F     .word off_8FF9_33
- D - I - 0x0289E0 20:89D0: 3A 90     .word off_903A_34
- D - I - 0x0289E2 20:89D2: 6F 90     .word off_906F_35
- D - I - 0x0289E4 20:89D4: A5 90     .word off_90A5_36
- D - I - 0x0289E6 20:89D6: B3 90     .word off_90B3_37
- D - I - 0x0289E8 20:89D8: CD 90     .word off_90CD_38
- D - I - 0x0289EA 20:89DA: D2 90     .word off_90D2_39
- D - I - 0x0289EC 20:89DC: D7 90     .word off_90D7_3A
- D - I - 0x0289EE 20:89DE: 0C 91     .word off_910C_3B
- D - I - 0x0289F0 20:89E0: 41 91     .word off_9141_3C
- D - I - 0x0289F2 20:89E2: 52 91     .word off_9152_3D
- D - I - 0x0289F4 20:89E4: 60 91     .word off_9160_3E
- D - I - 0x0289F6 20:89E6: 77 91     .word off_9177_3F
- D - I - 0x0289F8 20:89E8: 8E 91     .word off_918E_40
- D - I - 0x0289FA 20:89EA: A5 91     .word off_91A5_41
- D - I - 0x0289FC 20:89EC: BC 91     .word off_91BC_42
- D - I - 0x0289FE 20:89EE: CA 91     .word off_91CA_43
- D - I - 0x028A00 20:89F0: D8 91     .word off_91D8_44
- D - I - 0x028A02 20:89F2: E6 91     .word off_91E6_45
- D - I - 0x028A04 20:89F4: F4 91     .word off_91F4_46
- D - I - 0x028A06 20:89F6: 02 92     .word off_9202_47
- D - I - 0x028A08 20:89F8: 10 92     .word off_9210_48
- D - I - 0x028A0A 20:89FA: 1E 92     .word off_921E_49
- D - I - 0x028A0C 20:89FC: 32 92     .word off_9232_4A
- D - I - 0x028A0E 20:89FE: 40 92     .word off_9240_4B
- D - I - 0x028A10 20:8A00: 45 92     .word off_9245_4C
- D - I - 0x028A12 20:8A02: 53 92     .word off_9253_4D
- D - I - 0x028A14 20:8A04: 61 92     .word off_9261_4E
- D - I - 0x028A16 20:8A06: 6F 92     .word off_926F_4F
- D - I - 0x028A18 20:8A08: 7D 92     .word off_927D_50
- D - I - 0x028A1A 20:8A0A: 8B 92     .word off_928B_51
- D - I - 0x028A1C 20:8A0C: 9F 92     .word off_929F_52
- - - - - 0x028A1E 20:8A0E: AD 92     .word off_92AD_53
- - - - - 0x028A20 20:8A10: BB 92     .word off_92BB_54
- D - I - 0x028A22 20:8A12: C9 92     .word off_92C9_55
- D - I - 0x028A24 20:8A14: D7 92     .word off_92D7_56
- D - I - 0x028A26 20:8A16: E5 92     .word off_92E5_57
- D - I - 0x028A28 20:8A18: F3 92     .word off_92F3_58
- - - - - 0x028A2A 20:8A1A: 0D 93     .word off_930D_59
- D - I - 0x028A2C 20:8A1C: 23 93     .word off_9323_5A
- D - I - 0x028A2E 20:8A1E: 3D 93     .word off_933D_5B
- D - I - 0x028A30 20:8A20: 57 93     .word off_9357_5C
- D - I - 0x028A32 20:8A22: 71 93     .word off_9371_5D
- D - I - 0x028A34 20:8A24: 7F 93     .word off_937F_5E
- D - I - 0x028A36 20:8A26: 8D 93     .word off_938D_5F
- D - I - 0x028A38 20:8A28: A4 93     .word off_93A4_60
- D - I - 0x028A3A 20:8A2A: EC 93     .word off_93EC_61
- D - I - 0x028A3C 20:8A2C: 03 94     .word off_9403_62
- D - I - 0x028A3E 20:8A2E: 11 94     .word off_9411_63
- D - I - 0x028A40 20:8A30: 25 94     .word off_9425_64
- - - - - 0x028A42 20:8A32: 33 94     .word off_9433_65
- D - I - 0x028A44 20:8A34: 41 94     .word off_9441_66
- D - I - 0x028A46 20:8A36: 56 94     .word off_9456_67
- D - I - 0x028A48 20:8A38: 6A 94     .word off_946A_68
- D - I - 0x028A4A 20:8A3A: 7E 94     .word off_947E_69
- D - I - 0x028A4C 20:8A3C: 8C 94     .word off_948C_6A
- D - I - 0x028A4E 20:8A3E: A2 94     .word off_94A2_6B
- D - I - 0x028A50 20:8A40: BC 94     .word off_94BC_6C
- D - I - 0x028A52 20:8A42: F4 94     .word off_94F4_6D
- D - I - 0x028A54 20:8A44: 2C 95     .word off_952C_6E
- D - I - 0x028A56 20:8A46: 49 95     .word off_9549_6F
- D - I - 0x028A58 20:8A48: 79 95     .word off_9579_70
- D - I - 0x028A5A 20:8A4A: 87 95     .word off_9587_71
- - - - - 0x028A5C 20:8A4C: 98 95     .word off_9598_72
- D - I - 0x028A5E 20:8A4E: A6 95     .word off_95A6_73
- D - I - 0x028A60 20:8A50: B4 95     .word off_95B4_74
- D - I - 0x028A62 20:8A52: E6 95     .word off_95E6_75
- D - I - 0x028A64 20:8A54: F5 95     .word off_95F5_76
- D - I - 0x028A66 20:8A56: 03 96     .word off_9603_77
- D - I - 0x028A68 20:8A58: 18 96     .word off_9618_78
- D - I - 0x028A6A 20:8A5A: 51 96     .word off_9651_79
- D - I - 0x028A6C 20:8A5C: 5F 96     .word off_965F_7A
- D - I - 0x028A6E 20:8A5E: 89 96     .word off_9689_7B
- D - I - 0x028A70 20:8A60: 97 96     .word off_9697_7C
- D - I - 0x028A72 20:8A62: D2 96     .word off_96D2_7D
- D - I - 0x028A74 20:8A64: 3B 97     .word off_973B_7E
- D - I - 0x028A76 20:8A66: 49 97     .word off_9749_7F
- D - I - 0x028A78 20:8A68: 60 97     .word off_9760_80
- D - I - 0x028A7A 20:8A6A: 6E 97     .word off_976E_81
- D - I - 0x028A7C 20:8A6C: 84 97     .word off_9784_82
- D - I - 0x028A7E 20:8A6E: 98 97     .word off_9798_83
- D - I - 0x028A80 20:8A70: AF 97     .word off_97AF_84
- D - I - 0x028A82 20:8A72: BD 97     .word off_97BD_85
- D - I - 0x028A84 20:8A74: D1 97     .word off_97D1_86
- D - I - 0x028A86 20:8A76: E7 97     .word off_97E7_87
- D - I - 0x028A88 20:8A78: F7 97     .word off_97F7_88
- D - I - 0x028A8A 20:8A7A: 07 98     .word off_9807_89
- D - I - 0x028A8C 20:8A7C: 17 98     .word off_9817_8A
- D - I - 0x028A8E 20:8A7E: 27 98     .word off_9827_8B
- D - I - 0x028A90 20:8A80: 35 98     .word off_9835_8C
- D - I - 0x028A92 20:8A82: 63 98     .word off_9863_8D
- D - I - 0x028A94 20:8A84: 71 98     .word off_9871_8E
- D - I - 0x028A96 20:8A86: 85 98     .word off_9885_8F
- D - I - 0x028A98 20:8A88: AB 98     .word off_98AB_90
- D - I - 0x028A9A 20:8A8A: C5 98     .word off_98C5_91
- D - I - 0x028A9C 20:8A8C: D4 98     .word off_98D4_92
- D - I - 0x028A9E 20:8A8E: 13 99     .word off_9913_93
- D - I - 0x028AA0 20:8A90: 22 99     .word off_9922_94
- D - I - 0x028AA2 20:8A92: 31 99     .word off_9931_95
- D - I - 0x028AA4 20:8A94: 6C 99     .word off_996C_96
- D - I - 0x028AA6 20:8A96: 7B 99     .word off_997B_97
- D - I - 0x028AA8 20:8A98: 81 99     .word off_9981_98
- D - I - 0x028AAA 20:8A9A: 90 99     .word off_9990_99
- D - I - 0x028AAC 20:8A9C: 96 99     .word off_9996_9A
- - - - - 0x028AAE 20:8A9E: A5 99     .word off_99A5_9B
- D - I - 0x028AB0 20:8AA0: AB 99     .word off_99AB_9C
- D - I - 0x028AB2 20:8AA2: B1 99     .word off_99B1_9D
- D - I - 0x028AB4 20:8AA4: D4 99     .word off_99D4_9E
- D - I - 0x028AB6 20:8AA6: DA 99     .word off_99DA_9F
- D - I - 0x028AB8 20:8AA8: E0 99     .word off_99E0_A0
- D - I - 0x028ABA 20:8AAA: E6 99     .word off_99E6_A1
- - - - - 0x028ABC 20:8AAC: EC 99     .word off_99EC_A2
- D - I - 0x028ABE 20:8AAE: F2 99     .word off_99F2_A3
- D - I - 0x028AC0 20:8AB0: F8 99     .word off_99F8_A4
- D - I - 0x028AC2 20:8AB2: 07 9A     .word off_9A07_A5
- D - I - 0x028AC4 20:8AB4: 42 9A     .word off_9A42_A6
- D - I - 0x028AC6 20:8AB6: 50 9A     .word off_9A50_A7
- D - I - 0x028AC8 20:8AB8: 8B 9A     .word off_9A8B_A8
- D - I - 0x028ACA 20:8ABA: 9A 9A     .word off_9A9A_A9
- D - I - 0x028ACC 20:8ABC: A0 9A     .word off_9AA0_AA
- D - I - 0x028ACE 20:8ABE: AF 9A     .word off_9AAF_AB
- D - I - 0x028AD0 20:8AC0: BE 9A     .word off_9ABE_AC
- D - I - 0x028AD2 20:8AC2: D5 9A     .word off_9AD5_AD
- D - I - 0x028AD4 20:8AC4: E4 9A     .word off_9AE4_AE
- D - I - 0x028AD6 20:8AC6: F3 9A     .word off_9AF3_AF
- D - I - 0x028AD8 20:8AC8: 02 9B     .word off_9B02_B0
- D - I - 0x028ADA 20:8ACA: 11 9B     .word off_9B11_B1
- D - I - 0x028ADC 20:8ACC: 20 9B     .word off_9B20_B2
- D - I - 0x028ADE 20:8ACE: 2F 9B     .word off_9B2F_B3
- D - I - 0x028AE0 20:8AD0: 35 9B     .word off_9B35_B4
- D - I - 0x028AE2 20:8AD2: 44 9B     .word off_9B44_B5
- D - I - 0x028AE4 20:8AD4: 53 9B     .word off_9B53_B6
- D - I - 0x028AE6 20:8AD6: 62 9B     .word off_9B62_B7
- D - I - 0x028AE8 20:8AD8: 71 9B     .word off_9B71_B8
- D - I - 0x028AEA 20:8ADA: 80 9B     .word off_9B80_B9
- D - I - 0x028AEC 20:8ADC: 8F 9B     .word off_9B8F_BA
- D - I - 0x028AEE 20:8ADE: 9E 9B     .word off_9B9E_BB
- D - I - 0x028AF0 20:8AE0: AD 9B     .word off_9BAD_BC
- D - I - 0x028AF2 20:8AE2: BC 9B     .word off_9BBC_BD
- - - - - 0x028AF4 20:8AE4: CB 9B     .word off_9BCB_BE
- D - I - 0x028AF6 20:8AE6: 06 9C     .word off_9C06_BF
- D - I - 0x028AF8 20:8AE8: 38 9C     .word off_9C38_C0
- D - I - 0x028AFA 20:8AEA: 46 9C     .word off_9C46_C1
- D - I - 0x028AFC 20:8AEC: 54 9C     .word off_9C54_C2
- D - I - 0x028AFE 20:8AEE: 62 9C     .word off_9C62_C3
- D - I - 0x028B00 20:8AF0: 70 9C     .word off_9C70_C4
- D - I - 0x028B02 20:8AF2: 93 9C     .word off_9C93_C5
- D - I - 0x028B04 20:8AF4: AD 9C     .word off_9CAD_C6
- D - I - 0x028B06 20:8AF6: D7 9C     .word off_9CD7_C7
- D - I - 0x028B08 20:8AF8: FB 9C     .word off_9CFB_C8
- D - I - 0x028B0A 20:8AFA: 0F 9D     .word off_9D0F_C9
- D - I - 0x028B0C 20:8AFC: 34 9D     .word off_9D34_CA
- D - I - 0x028B0E 20:8AFE: 79 9D     .word off_9D79_CB
- D - I - 0x028B10 20:8B00: 87 9D     .word off_9D87_CC
- D - I - 0x028B12 20:8B02: A4 9D     .word off_9DA4_CD
- D - I - 0x028B14 20:8B04: B8 9D     .word off_9DB8_CE
- D - I - 0x028B16 20:8B06: E9 9D     .word off_9DE9_CF
- D - I - 0x028B18 20:8B08: 07 9E     .word off_9E07_D0
- D - I - 0x028B1A 20:8B0A: 21 9E     .word off_9E21_D1
- D - I - 0x028B1C 20:8B0C: 3B 9E     .word off_9E3B_D2
- D - I - 0x028B1E 20:8B0E: 55 9E     .word off_9E55_D3
- D - I - 0x028B20 20:8B10: 6B 9E     .word off_9E6B_D4
- D - I - 0x028B22 20:8B12: 7A 9E     .word off_9E7A_D5
- D - I - 0x028B24 20:8B14: 89 9E     .word off_9E89_D6
- D - I - 0x028B26 20:8B16: 97 9E     .word off_9E97_D7
- D - I - 0x028B28 20:8B18: A5 9E     .word off_9EA5_D8
- D - I - 0x028B2A 20:8B1A: B3 9E     .word off_9EB3_D9
- D - I - 0x028B2C 20:8B1C: C1 9E     .word off_9EC1_DA
- D - I - 0x028B2E 20:8B1E: CF 9E     .word off_9ECF_DB
- D - I - 0x028B30 20:8B20: 1F 9F     .word off_9F1F_DC
- D - I - 0x028B32 20:8B22: 3C 9F     .word off_9F3C_DD
- D - I - 0x028B34 20:8B24: 56 9F     .word off_9F56_DE
- - - - - 0x028B36 20:8B26: 6D 9F     .word off_9F6D_DF
- D - I - 0x028B38 20:8B28: A8 9F     .word off_9FA8_E0
- D - I - 0x028B3A 20:8B2A: C4 9F     .word off_9FC4_E1
- D - I - 0x028B3C 20:8B2C: C9 9F     .word off_9FC9_E2
- D - I - 0x028B3E 20:8B2E: 4C A0     .word off_A04C_E3
- D - I - 0x028B40 20:8B30: 66 A0     .word off_A066_E4
- D - I - 0x028B42 20:8B32: 8F A0     .word off_A08F_E5
- D - I - 0x028B44 20:8B34: A3 A0     .word off_A0A3_E6
- D - I - 0x028B46 20:8B36: A8 A0     .word off_A0A8_E7
- D - I - 0x028B48 20:8B38: BE A0     .word off_A0BE_E8
- D - I - 0x028B4A 20:8B3A: EA A0     .word off_A0EA_E9
- D - I - 0x028B4C 20:8B3C: F8 A0     .word off_A0F8_EA
- D - I - 0x028B4E 20:8B3E: 06 A1     .word off_A106_EB
- D - I - 0x028B50 20:8B40: 1D A1     .word off_A11D_EC
- D - I - 0x028B52 20:8B42: 30 A1     .word off_A130_ED
- D - I - 0x028B54 20:8B44: 3E A1     .word off_A13E_EE
- D - I - 0x028B56 20:8B46: 79 A1     .word off_A179_EF

off_8B48_00:
- D - I - 0x028B58 20:8B48: F5        .byte $F5
- D - I - 0x028B59 20:8B49: 0B        .byte $0B	; <さ>
- D - I - 0x028B5A 20:8B4A: F4        .byte $F4
- D - I - 0x028B5B 20:8B4B: 1F        .byte $1F	; <ま>
- D - I - 0x028B5C 20:8B4C: 00        .byte $00
- D - I - 0x028B5D 20:8B4D: 00        .byte $00
- D - I - 0x028B5E 20:8B4E: 00        .byte $00
- D - I - 0x028B5F 20:8B4F: F6        .byte $F6
- D - I - 0x028B60 20:8B50: 00        .byte $00
- D - I - 0x028B61 20:8B51: F6        .byte $F6
- D - I - 0x028B62 20:8B52: 15        .byte $15	; <な>
- D - I - 0x028B63 20:8B53: F6        .byte $F6
- D - I - 0x028B64 20:8B54: 2A        .byte $2A	; <れ>
- D - I - 0x028B65 20:8B55: F6        .byte $F6
- D - I - 0x028B66 20:8B56: 3F        .byte $3F	; <•>
- D - I - 0x028B67 20:8B57: F6        .byte $F6
- D - I - 0x028B68 20:8B58: 54        .byte $54	; <ト>
- D - I - 0x028B69 20:8B59: F6        .byte $F6
- D - I - 0x028B6A 20:8B5A: 69        .byte $69	; <ル>
- D - I - 0x028B6B 20:8B5B: F0        .byte $F0
off_8B5C_01:
- D - I - 0x028B6C 20:8B5C: F5        .byte $F5
- D - I - 0x028B6D 20:8B5D: 09        .byte $09	; <け>
- D - I - 0x028B6E 20:8B5E: F4        .byte $F4
- D - I - 0x028B6F 20:8B5F: 04        .byte $04	; <え>
- D - I - 0x028B70 20:8B60: 05        .byte $05	; <お>
- D - I - 0x028B71 20:8B61: 00        .byte $00
- D - I - 0x028B72 20:8B62: 00        .byte $00
- D - I - 0x028B73 20:8B63: F1        .byte $F1
- D - I - 0x028B74 20:8B64: 0B        .byte $0B	; <さ>
- D - I - 0x028B75 20:8B65: BA        .byte $BA	; <ジ>
- D - I - 0x028B76 20:8B66: B8        .byte $B8	; <ゴ>
- D - I - 0x028B77 20:8B67: F3        .byte $F3
- D - I - 0x028B78 20:8B68: 00        .byte $00
- D - I - 0x028B79 20:8B69: F0        .byte $F0
off_8B6A_02:
- D - I - 0x028B7A 20:8B6A: F5        .byte $F5
- D - I - 0x028B7B 20:8B6B: 83        .byte $83	; <C>
- D - I - 0x028B7C 20:8B6C: F4        .byte $F4
- D - I - 0x028B7D 20:8B6D: 12        .byte $12	; <つ>
- D - I - 0x028B7E 20:8B6E: 00        .byte $00
- D - I - 0x028B7F 20:8B6F: 00        .byte $00
- D - I - 0x028B80 20:8B70: 00        .byte $00
- D - I - 0x028B81 20:8B71: F1        .byte $F1
- D - I - 0x028B82 20:8B72: 00        .byte $00
- D - I - 0x028B83 20:8B73: 01        .byte $01	; <あ>
- D - I - 0x028B84 20:8B74: 00        .byte $00
- D - I - 0x028B85 20:8B75: C3        .byte $C3	; <バ>
- D - I - 0x028B86 20:8B76: 01        .byte $01	; <あ>
- D - I - 0x028B87 20:8B77: F0        .byte $F0
off_8B78_03:
- D - I - 0x028B88 20:8B78: F5        .byte $F5
- D - I - 0x028B89 20:8B79: 83        .byte $83	; <C>
- D - I - 0x028B8A 20:8B7A: F4        .byte $F4
- D - I - 0x028B8B 20:8B7B: 18        .byte $18	; <ね>
- D - I - 0x028B8C 20:8B7C: 19        .byte $19	; <の>
- D - I - 0x028B8D 20:8B7D: 1A        .byte $1A	; <は>
- D - I - 0x028B8E 20:8B7E: 1B        .byte $1B	; <ひ>
- D - I - 0x028B8F 20:8B7F: F1        .byte $F1
- D - I - 0x028B90 20:8B80: 46        .byte $46	; <カ>
- D - I - 0x028B91 20:8B81: 40        .byte $40	; <「>
- D - I - 0x028B92 20:8B82: E8        .byte $E8
- D - I - 0x028B93 20:8B83: BB        .byte $BB	; <ズ>
- D - I - 0x028B94 20:8B84: 00        .byte $00
- D - I - 0x028B95 20:8B85: F0        .byte $F0
off_8B86_04:
- D - I - 0x028B96 20:8B86: F5        .byte $F5
- D - I - 0x028B97 20:8B87: 83        .byte $83	; <C>
- D - I - 0x028B98 20:8B88: F4        .byte $F4
- D - I - 0x028B99 20:8B89: 18        .byte $18	; <ね>
- D - I - 0x028B9A 20:8B8A: 19        .byte $19	; <の>
- D - I - 0x028B9B 20:8B8B: 1A        .byte $1A	; <は>
- D - I - 0x028B9C 20:8B8C: 2B        .byte $2B	; <ろ>
- D - I - 0x028B9D 20:8B8D: F1        .byte $F1
- D - I - 0x028B9E 20:8B8E: 37        .byte $37	; <4>
- D - I - 0x028B9F 20:8B8F: 05        .byte $05	; <お>
- D - I - 0x028BA0 20:8B90: 18        .byte $18	; <ね>
- D - I - 0x028BA1 20:8B91: CB        .byte $CB	; <ぺ>
- D - I - 0x028BA2 20:8B92: 01        .byte $01	; <あ>
- D - I - 0x028BA3 20:8B93: F0        .byte $F0
off_8B94_05:
- D - I - 0x028BA4 20:8B94: F5        .byte $F5
- D - I - 0x028BA5 20:8B95: 81        .byte $81	; <A>
- D - I - 0x028BA6 20:8B96: F4        .byte $F4
- D - I - 0x028BA7 20:8B97: 24        .byte $24	; <や>
- D - I - 0x028BA8 20:8B98: 25        .byte $25	; <ゆ>
- D - I - 0x028BA9 20:8B99: 26        .byte $26	; <よ>
- D - I - 0x028BAA 20:8B9A: 4F        .byte $4F	; <ソ>
- D - I - 0x028BAB 20:8B9B: F1        .byte $F1
- D - I - 0x028BAC 20:8B9C: 02        .byte $02	; <い>
- D - I - 0x028BAD 20:8B9D: 07        .byte $07	; <き>
- D - I - 0x028BAE 20:8B9E: E4        .byte $E4
- D - I - 0x028BAF 20:8B9F: CF        .byte $CF	; <プ>
- D - I - 0x028BB0 20:8BA0: 00        .byte $00
- D - I - 0x028BB1 20:8BA1: F1        .byte $F1
- D - I - 0x028BB2 20:8BA2: 01        .byte $01	; <あ>
- D - I - 0x028BB3 20:8BA3: 06        .byte $06	; <か>
- D - I - 0x028BB4 20:8BA4: F8        .byte $F8
- D - I - 0x028BB5 20:8BA5: BB        .byte $BB	; <ズ>
- D - I - 0x028BB6 20:8BA6: 04        .byte $04	; <え>
off_8BA7:
- D - I - 0x028BB7 20:8BA7: 01        .byte $01	; <あ>
- D - I - 0x028BB8 20:8BA8: FB        .byte $FB
- D - I - 0x028BB9 20:8BA9: 01        .byte $01	; <あ>
- D - I - 0x028BBA 20:8BAA: 23        .byte $23	; <も>
- D - I - 0x028BBB 20:8BAB: 45        .byte $45	; <オ>
- D - I - 0x028BBC 20:8BAC: 01        .byte $01	; <あ>
- D - I - 0x028BBD 20:8BAD: FB        .byte $FB
- D - I - 0x028BBE 20:8BAE: 10        .byte $10	; <た>
- D - I - 0x028BBF 20:8BAF: 23        .byte $23	; <も>
- D - I - 0x028BC0 20:8BB0: 45        .byte $45	; <オ>
- D - I - 0x028BC1 20:8BB1: F8        .byte $F8
- D - I - 0x028BC2 20:8BB2: A7 8B     .word off_8BA7
off_8BB4_06:
- D - I - 0x028BC4 20:8BB4: F5        .byte $F5
- D - I - 0x028BC5 20:8BB5: 81        .byte $81	; <A>
- D - I - 0x028BC6 20:8BB6: F4        .byte $F4
- D - I - 0x028BC7 20:8BB7: 24        .byte $24	; <や>
- D - I - 0x028BC8 20:8BB8: 25        .byte $25	; <ゆ>
- D - I - 0x028BC9 20:8BB9: 26        .byte $26	; <よ>
- D - I - 0x028BCA 20:8BBA: 4F        .byte $4F	; <ソ>
- D - I - 0x028BCB 20:8BBB: F1        .byte $F1
- D - I - 0x028BCC 20:8BBC: 04        .byte $04	; <え>
- D - I - 0x028BCD 20:8BBD: 07        .byte $07	; <き>
- D - I - 0x028BCE 20:8BBE: 50        .byte $50	; <タ>
- D - I - 0x028BCF 20:8BBF: 04        .byte $04	; <え>
- D - I - 0x028BD0 20:8BC0: 02        .byte $02	; <い>
- D - I - 0x028BD1 20:8BC1: F1        .byte $F1
- D - I - 0x028BD2 20:8BC2: 03        .byte $03	; <う>
- D - I - 0x028BD3 20:8BC3: 06        .byte $06	; <か>
- D - I - 0x028BD4 20:8BC4: 10        .byte $10	; <た>
- D - I - 0x028BD5 20:8BC5: B3        .byte $B3	; <ぼ>
- D - I - 0x028BD6 20:8BC6: 05        .byte $05	; <お>
- D - I - 0x028BD7 20:8BC7: F8        .byte $F8
- D - I - 0x028BD8 20:8BC8: A7 8B     .word off_8BA7
off_8BCA_07:
- D - I - 0x028BDA 20:8BCA: F5        .byte $F5
- D - I - 0x028BDB 20:8BCB: 81        .byte $81	; <A>
- D - I - 0x028BDC 20:8BCC: F4        .byte $F4
- D - I - 0x028BDD 20:8BCD: 24        .byte $24	; <や>
- D - I - 0x028BDE 20:8BCE: 25        .byte $25	; <ゆ>
- D - I - 0x028BDF 20:8BCF: 26        .byte $26	; <よ>
- D - I - 0x028BE0 20:8BD0: 4F        .byte $4F	; <ソ>
- D - I - 0x028BE1 20:8BD1: F1        .byte $F1
- D - I - 0x028BE2 20:8BD2: 06        .byte $06	; <か>
- D - I - 0x028BE3 20:8BD3: 07        .byte $07	; <き>
- D - I - 0x028BE4 20:8BD4: 58        .byte $58	; <ネ>
- D - I - 0x028BE5 20:8BD5: EF        .byte $EF
- D - I - 0x028BE6 20:8BD6: 00        .byte $00
- D - I - 0x028BE7 20:8BD7: F1        .byte $F1
- D - I - 0x028BE8 20:8BD8: 05        .byte $05	; <お>
- D - I - 0x028BE9 20:8BD9: 06        .byte $06	; <か>
- D - I - 0x028BEA 20:8BDA: 10        .byte $10	; <た>
- D - I - 0x028BEB 20:8BDB: B3        .byte $B3	; <ぼ>
- D - I - 0x028BEC 20:8BDC: 05        .byte $05	; <お>
- D - I - 0x028BED 20:8BDD: F8        .byte $F8
- D - I - 0x028BEE 20:8BDE: A7 8B     .word off_8BA7
off_8BE0_08:
- D - I - 0x028BF0 20:8BE0: F5        .byte $F5
- D - I - 0x028BF1 20:8BE1: 81        .byte $81	; <A>
- D - I - 0x028BF2 20:8BE2: F4        .byte $F4
- D - I - 0x028BF3 20:8BE3: 24        .byte $24	; <や>
- D - I - 0x028BF4 20:8BE4: 25        .byte $25	; <ゆ>
- D - I - 0x028BF5 20:8BE5: 26        .byte $26	; <よ>
- D - I - 0x028BF6 20:8BE6: 4F        .byte $4F	; <ソ>
- D - I - 0x028BF7 20:8BE7: F1        .byte $F1
- D - I - 0x028BF8 20:8BE8: 00        .byte $00
- D - I - 0x028BF9 20:8BE9: 08        .byte $08	; <く>
- D - I - 0x028BFA 20:8BEA: F8        .byte $F8
- D - I - 0x028BFB 20:8BEB: BB        .byte $BB	; <ズ>
- D - I - 0x028BFC 20:8BEC: 00        .byte $00
- D - I - 0x028BFD 20:8BED: F0        .byte $F0
off_8BEE_09:
- D - I - 0x028BFE 20:8BEE: F5        .byte $F5
- D - I - 0x028BFF 20:8BEF: 81        .byte $81	; <A>
- D - I - 0x028C00 20:8BF0: F4        .byte $F4
- D - I - 0x028C01 20:8BF1: 24        .byte $24	; <や>
- D - I - 0x028C02 20:8BF2: 25        .byte $25	; <ゆ>
- D - I - 0x028C03 20:8BF3: 26        .byte $26	; <よ>
- D - I - 0x028C04 20:8BF4: 4F        .byte $4F	; <ソ>
- D - I - 0x028C05 20:8BF5: F1        .byte $F1
- D - I - 0x028C06 20:8BF6: 09        .byte $09	; <け>
- D - I - 0x028C07 20:8BF7: 07        .byte $07	; <き>
- D - I - 0x028C08 20:8BF8: 32        .byte $32	; <ょ>
- D - I - 0x028C09 20:8BF9: FE        .byte $FE
- D - I - 0x028C0A 20:8BFA: 00        .byte $00
- D - I - 0x028C0B 20:8BFB: F1        .byte $F1
- D - I - 0x028C0C 20:8BFC: DA        .byte $DA
- D - I - 0x028C0D 20:8BFD: 06        .byte $06	; <か>
- D - I - 0x028C0E 20:8BFE: 11        .byte $11	; <ち>
- D - I - 0x028C0F 20:8BFF: B2        .byte $B2	; <べ>
- D - I - 0x028C10 20:8C00: 05        .byte $05	; <お>
- D - I - 0x028C11 20:8C01: F8        .byte $F8
- D - I - 0x028C12 20:8C02: A7 8B     .word off_8BA7
off_8C04_0A:
- - - - - 0x028C14 20:8C04: F5        .byte $F5
- - - - - 0x028C15 20:8C05: 09        .byte $09	; <け>
- - - - - 0x028C16 20:8C06: F4        .byte $F4
- - - - - 0x028C17 20:8C07: 04        .byte $04	; <え>
- - - - - 0x028C18 20:8C08: 05        .byte $05	; <お>
- - - - - 0x028C19 20:8C09: 00        .byte $00
- - - - - 0x028C1A 20:8C0A: 00        .byte $00
- - - - - 0x028C1B 20:8C0B: F1        .byte $F1
- - - - - 0x028C1C 20:8C0C: 0D        .byte $0D	; <す>
- - - - - 0x028C1D 20:8C0D: C4        .byte $C4	; <ビ>
- - - - - 0x028C1E 20:8C0E: 98        .byte $98
- - - - - 0x028C1F 20:8C0F: E3        .byte $E3
- - - - - 0x028C20 20:8C10: 00        .byte $00
- - - - - 0x028C21 20:8C11: F0        .byte $F0
off_8C12_0B:
- D - I - 0x028C22 20:8C12: F5        .byte $F5
- D - I - 0x028C23 20:8C13: 81        .byte $81	; <A>
- D - I - 0x028C24 20:8C14: F4        .byte $F4
- D - I - 0x028C25 20:8C15: 24        .byte $24	; <や>
- D - I - 0x028C26 20:8C16: 25        .byte $25	; <ゆ>
- D - I - 0x028C27 20:8C17: 26        .byte $26	; <よ>
- D - I - 0x028C28 20:8C18: 4F        .byte $4F	; <ソ>
- D - I - 0x028C29 20:8C19: F1        .byte $F1
- D - I - 0x028C2A 20:8C1A: 0A        .byte $0A	; <こ>
- D - I - 0x028C2B 20:8C1B: 0A        .byte $0A	; <こ>
- D - I - 0x028C2C 20:8C1C: F0        .byte $F0
- D - I - 0x028C2D 20:8C1D: BB        .byte $BB	; <ズ>
- D - I - 0x028C2E 20:8C1E: 00        .byte $00
- D - I - 0x028C2F 20:8C1F: F1        .byte $F1
- D - I - 0x028C30 20:8C20: 01        .byte $01	; <あ>
- D - I - 0x028C31 20:8C21: 09        .byte $09	; <け>
- D - I - 0x028C32 20:8C22: F8        .byte $F8
- D - I - 0x028C33 20:8C23: BB        .byte $BB	; <ズ>
- D - I - 0x028C34 20:8C24: 04        .byte $04	; <え>
- D - I - 0x028C35 20:8C25: F8        .byte $F8
- D - I - 0x028C36 20:8C26: A7 8B     .word off_8BA7
off_8C28_0C:
- D - I - 0x028C38 20:8C28: F5        .byte $F5
- D - I - 0x028C39 20:8C29: 81        .byte $81	; <A>
- D - I - 0x028C3A 20:8C2A: F4        .byte $F4
- D - I - 0x028C3B 20:8C2B: 24        .byte $24	; <や>
- D - I - 0x028C3C 20:8C2C: 25        .byte $25	; <ゆ>
- D - I - 0x028C3D 20:8C2D: 26        .byte $26	; <よ>
- D - I - 0x028C3E 20:8C2E: 4F        .byte $4F	; <ソ>
- D - I - 0x028C3F 20:8C2F: F1        .byte $F1
- D - I - 0x028C40 20:8C30: 05        .byte $05	; <お>
- D - I - 0x028C41 20:8C31: 09        .byte $09	; <け>
- D - I - 0x028C42 20:8C32: 10        .byte $10	; <た>
- D - I - 0x028C43 20:8C33: B3        .byte $B3	; <ぼ>
- D - I - 0x028C44 20:8C34: 05        .byte $05	; <お>
- D - I - 0x028C45 20:8C35: F1        .byte $F1
- D - I - 0x028C46 20:8C36: 06        .byte $06	; <か>
- D - I - 0x028C47 20:8C37: 0A        .byte $0A	; <こ>
- D - I - 0x028C48 20:8C38: 58        .byte $58	; <ネ>
- D - I - 0x028C49 20:8C39: EF        .byte $EF
- D - I - 0x028C4A 20:8C3A: 00        .byte $00
- D - I - 0x028C4B 20:8C3B: F0        .byte $F0
off_8C3C_0D:
- D - I - 0x028C4C 20:8C3C: F5        .byte $F5
- D - I - 0x028C4D 20:8C3D: 81        .byte $81	; <A>
- D - I - 0x028C4E 20:8C3E: F4        .byte $F4
- D - I - 0x028C4F 20:8C3F: 24        .byte $24	; <や>
- D - I - 0x028C50 20:8C40: 25        .byte $25	; <ゆ>
- D - I - 0x028C51 20:8C41: 26        .byte $26	; <よ>
- D - I - 0x028C52 20:8C42: 4F        .byte $4F	; <ソ>
- D - I - 0x028C53 20:8C43: F1        .byte $F1
- D - I - 0x028C54 20:8C44: 00        .byte $00
- D - I - 0x028C55 20:8C45: 3A        .byte $3A	; <7>
- D - I - 0x028C56 20:8C46: F8        .byte $F8
- D - I - 0x028C57 20:8C47: BB        .byte $BB	; <ズ>
- D - I - 0x028C58 20:8C48: 00        .byte $00
- D - I - 0x028C59 20:8C49: F0        .byte $F0
off_8C4A_0E:
- D - I - 0x028C5A 20:8C4A: F5        .byte $F5
- D - I - 0x028C5B 20:8C4B: 09        .byte $09	; <け>
- D - I - 0x028C5C 20:8C4C: F4        .byte $F4
- D - I - 0x028C5D 20:8C4D: 04        .byte $04	; <え>
- D - I - 0x028C5E 20:8C4E: 05        .byte $05	; <お>
- D - I - 0x028C5F 20:8C4F: 00        .byte $00
- D - I - 0x028C60 20:8C50: 00        .byte $00
- D - I - 0x028C61 20:8C51: F7        .byte $F7
- D - I - 0x028C62 20:8C52: 03        .byte $03	; <う>
- D - I - 0x028C63 20:8C53: 7B        .byte $7B	; <。>
- D - I - 0x028C64 20:8C54: F1        .byte $F1
- D - I - 0x028C65 20:8C55: 00        .byte $00
- D - I - 0x028C66 20:8C56: 00        .byte $00
- D - I - 0x028C67 20:8C57: 80        .byte $80
- D - I - 0x028C68 20:8C58: FB        .byte $FB
- D - I - 0x028C69 20:8C59: 00        .byte $00
- D - I - 0x028C6A 20:8C5A: F1        .byte $F1
- D - I - 0x028C6B 20:8C5B: 3B        .byte $3B	; <8>
- D - I - 0x028C6C 20:8C5C: BA        .byte $BA	; <ジ>
- D - I - 0x028C6D 20:8C5D: D0        .byte $D0	; <ペ>
- D - I - 0x028C6E 20:8C5E: C3        .byte $C3	; <バ>
- D - I - 0x028C6F 20:8C5F: 04        .byte $04	; <え>
- D - I - 0x028C70 20:8C60: F0        .byte $F0
off_8C61_0F:
- D - I - 0x028C71 20:8C61: F5        .byte $F5
- D - I - 0x028C72 20:8C62: 09        .byte $09	; <け>
- D - I - 0x028C73 20:8C63: F4        .byte $F4
- D - I - 0x028C74 20:8C64: 04        .byte $04	; <え>
- D - I - 0x028C75 20:8C65: 05        .byte $05	; <お>
- D - I - 0x028C76 20:8C66: 00        .byte $00
- D - I - 0x028C77 20:8C67: 00        .byte $00
- D - I - 0x028C78 20:8C68: F7        .byte $F7
- D - I - 0x028C79 20:8C69: 03        .byte $03	; <う>
- D - I - 0x028C7A 20:8C6A: 7B        .byte $7B	; <。>
- D - I - 0x028C7B 20:8C6B: F1        .byte $F1
- D - I - 0x028C7C 20:8C6C: 3C        .byte $3C	; <9>
- D - I - 0x028C7D 20:8C6D: CF        .byte $CF	; <プ>
- D - I - 0x028C7E 20:8C6E: E0        .byte $E0
- D - I - 0x028C7F 20:8C6F: 7B        .byte $7B	; <。>
- D - I - 0x028C80 20:8C70: 04        .byte $04	; <え>
- D - I - 0x028C81 20:8C71: F1        .byte $F1
- D - I - 0x028C82 20:8C72: 00        .byte $00
- D - I - 0x028C83 20:8C73: 00        .byte $00
- D - I - 0x028C84 20:8C74: 80        .byte $80
- D - I - 0x028C85 20:8C75: FB        .byte $FB
- D - I - 0x028C86 20:8C76: 00        .byte $00
- D - I - 0x028C87 20:8C77: F0        .byte $F0
off_8C78_10:
- D - I - 0x028C88 20:8C78: F5        .byte $F5
- D - I - 0x028C89 20:8C79: 09        .byte $09	; <け>
- D - I - 0x028C8A 20:8C7A: F4        .byte $F4
- D - I - 0x028C8B 20:8C7B: 04        .byte $04	; <え>
- D - I - 0x028C8C 20:8C7C: 05        .byte $05	; <お>
- D - I - 0x028C8D 20:8C7D: 00        .byte $00
- D - I - 0x028C8E 20:8C7E: 00        .byte $00
- D - I - 0x028C8F 20:8C7F: F1        .byte $F1
- D - I - 0x028C90 20:8C80: 48        .byte $48	; <ク>
- D - I - 0x028C91 20:8C81: C4        .byte $C4	; <ビ>
- D - I - 0x028C92 20:8C82: 98        .byte $98
- D - I - 0x028C93 20:8C83: A4        .byte $A4	; <ご>
- D - I - 0x028C94 20:8C84: 00        .byte $00
- D - I - 0x028C95 20:8C85: F0        .byte $F0
off_8C86_11:
- D - I - 0x028C96 20:8C86: F5        .byte $F5
- D - I - 0x028C97 20:8C87: 09        .byte $09	; <け>
- D - I - 0x028C98 20:8C88: F4        .byte $F4
- D - I - 0x028C99 20:8C89: 04        .byte $04	; <え>
- D - I - 0x028C9A 20:8C8A: 05        .byte $05	; <お>
- D - I - 0x028C9B 20:8C8B: 00        .byte $00
- D - I - 0x028C9C 20:8C8C: 00        .byte $00
- D - I - 0x028C9D 20:8C8D: F1        .byte $F1
- D - I - 0x028C9E 20:8C8E: 00        .byte $00
- D - I - 0x028C9F 20:8C8F: BA        .byte $BA	; <ジ>
- D - I - 0x028CA0 20:8C90: 00        .byte $00
- D - I - 0x028CA1 20:8C91: C3        .byte $C3	; <バ>
- D - I - 0x028CA2 20:8C92: 01        .byte $01	; <あ>
- D - I - 0x028CA3 20:8C93: F0        .byte $F0
off_8C94_12:
- D - I - 0x028CA4 20:8C94: F5        .byte $F5
- D - I - 0x028CA5 20:8C95: 09        .byte $09	; <け>
- D - I - 0x028CA6 20:8C96: F4        .byte $F4
- D - I - 0x028CA7 20:8C97: 04        .byte $04	; <え>
- D - I - 0x028CA8 20:8C98: 05        .byte $05	; <お>
- D - I - 0x028CA9 20:8C99: 00        .byte $00
- D - I - 0x028CAA 20:8C9A: 00        .byte $00
- D - I - 0x028CAB 20:8C9B: F1        .byte $F1
- D - I - 0x028CAC 20:8C9C: 5F        .byte $5F	; <マ>
- D - I - 0x028CAD 20:8C9D: CF        .byte $CF	; <プ>
- D - I - 0x028CAE 20:8C9E: 98        .byte $98
- D - I - 0x028CAF 20:8C9F: AB        .byte $AB	; <ぢ>
- D - I - 0x028CB0 20:8CA0: 00        .byte $00
- D - I - 0x028CB1 20:8CA1: F0        .byte $F0
off_8CA2_13:
- D - I - 0x028CB2 20:8CA2: F5        .byte $F5
- D - I - 0x028CB3 20:8CA3: 81        .byte $81	; <A>
- D - I - 0x028CB4 20:8CA4: F4        .byte $F4
- D - I - 0x028CB5 20:8CA5: 1C        .byte $1C	; <ふ>
- D - I - 0x028CB6 20:8CA6: 1D        .byte $1D	; <へ>
- D - I - 0x028CB7 20:8CA7: 00        .byte $00
- D - I - 0x028CB8 20:8CA8: 00        .byte $00
- D - I - 0x028CB9 20:8CA9: F7        .byte $F7
- D - I - 0x028CBA 20:8CAA: 03        .byte $03	; <う>
- D - I - 0x028CBB 20:8CAB: 7B        .byte $7B	; <。>
- D - I - 0x028CBC 20:8CAC: F1        .byte $F1
- D - I - 0x028CBD 20:8CAD: 76        .byte $76	; <ォ>
- D - I - 0x028CBE 20:8CAE: 0D        .byte $0D	; <す>
- D - I - 0x028CBF 20:8CAF: 80        .byte $80
- D - I - 0x028CC0 20:8CB0: 23        .byte $23	; <も>
- D - I - 0x028CC1 20:8CB1: 06        .byte $06	; <か>
- D - I - 0x028CC2 20:8CB2: F1        .byte $F1
- D - I - 0x028CC3 20:8CB3: 00        .byte $00
- D - I - 0x028CC4 20:8CB4: 00        .byte $00
- D - I - 0x028CC5 20:8CB5: 80        .byte $80
- D - I - 0x028CC6 20:8CB6: FB        .byte $FB
- D - I - 0x028CC7 20:8CB7: 00        .byte $00
- D - I - 0x028CC8 20:8CB8: F0        .byte $F0
off_8CB9_14:
- D - I - 0x028CC9 20:8CB9: F5        .byte $F5
- D - I - 0x028CCA 20:8CBA: 81        .byte $81	; <A>
- D - I - 0x028CCB 20:8CBB: F4        .byte $F4
- D - I - 0x028CCC 20:8CBC: 1C        .byte $1C	; <ふ>
- D - I - 0x028CCD 20:8CBD: 1D        .byte $1D	; <へ>
- D - I - 0x028CCE 20:8CBE: 00        .byte $00
- D - I - 0x028CCF 20:8CBF: 00        .byte $00
- D - I - 0x028CD0 20:8CC0: F7        .byte $F7
- D - I - 0x028CD1 20:8CC1: 03        .byte $03	; <う>
- D - I - 0x028CD2 20:8CC2: 7B        .byte $7B	; <。>
- D - I - 0x028CD3 20:8CC3: F1        .byte $F1
- D - I - 0x028CD4 20:8CC4: 76        .byte $76	; <ォ>
- D - I - 0x028CD5 20:8CC5: 0F        .byte $0F	; <そ>
- D - I - 0x028CD6 20:8CC6: 80        .byte $80
- D - I - 0x028CD7 20:8CC7: 23        .byte $23	; <も>
- D - I - 0x028CD8 20:8CC8: 06        .byte $06	; <か>
- D - I - 0x028CD9 20:8CC9: F1        .byte $F1
- D - I - 0x028CDA 20:8CCA: 00        .byte $00
- D - I - 0x028CDB 20:8CCB: 00        .byte $00
- D - I - 0x028CDC 20:8CCC: 80        .byte $80
- D - I - 0x028CDD 20:8CCD: FB        .byte $FB
- D - I - 0x028CDE 20:8CCE: 00        .byte $00
- D - I - 0x028CDF 20:8CCF: F0        .byte $F0
off_8CD0_15:
- D - I - 0x028CE0 20:8CD0: F5        .byte $F5
- D - I - 0x028CE1 20:8CD1: 81        .byte $81	; <A>
- D - I - 0x028CE2 20:8CD2: F4        .byte $F4
- D - I - 0x028CE3 20:8CD3: 28        .byte $28	; <り>
- D - I - 0x028CE4 20:8CD4: 29        .byte $29	; <る>
- D - I - 0x028CE5 20:8CD5: 2A        .byte $2A	; <れ>
- D - I - 0x028CE6 20:8CD6: 0B        .byte $0B	; <さ>
- D - I - 0x028CE7 20:8CD7: F1        .byte $F1
- D - I - 0x028CE8 20:8CD8: 0E        .byte $0E	; <せ>
- D - I - 0x028CE9 20:8CD9: 3C        .byte $3C	; <9>
- D - I - 0x028CEA 20:8CDA: E8        .byte $E8
- D - I - 0x028CEB 20:8CDB: BB        .byte $BB	; <ズ>
- D - I - 0x028CEC 20:8CDC: 00        .byte $00
- D - I - 0x028CED 20:8CDD: F0        .byte $F0
off_8CDE_16:
- D - I - 0x028CEE 20:8CDE: F5        .byte $F5
- D - I - 0x028CEF 20:8CDF: 83        .byte $83	; <C>
- D - I - 0x028CF0 20:8CE0: F4        .byte $F4
- D - I - 0x028CF1 20:8CE1: 18        .byte $18	; <ね>
- D - I - 0x028CF2 20:8CE2: 19        .byte $19	; <の>
- D - I - 0x028CF3 20:8CE3: 1A        .byte $1A	; <は>
- D - I - 0x028CF4 20:8CE4: 1B        .byte $1B	; <ひ>
- D - I - 0x028CF5 20:8CE5: F1        .byte $F1
- D - I - 0x028CF6 20:8CE6: 99        .byte $99
- D - I - 0x028CF7 20:8CE7: 40        .byte $40	; <「>
- D - I - 0x028CF8 20:8CE8: D0        .byte $D0	; <ペ>
- D - I - 0x028CF9 20:8CE9: BB        .byte $BB	; <ズ>
- D - I - 0x028CFA 20:8CEA: 00        .byte $00
- D - I - 0x028CFB 20:8CEB: F0        .byte $F0
off_8CEC_17:
- D - I - 0x028CFC 20:8CEC: F5        .byte $F5
- D - I - 0x028CFD 20:8CED: 83        .byte $83	; <C>
- D - I - 0x028CFE 20:8CEE: F4        .byte $F4
- D - I - 0x028CFF 20:8CEF: 18        .byte $18	; <ね>
- D - I - 0x028D00 20:8CF0: 19        .byte $19	; <の>
- D - I - 0x028D01 20:8CF1: 1A        .byte $1A	; <は>
- D - I - 0x028D02 20:8CF2: 1B        .byte $1B	; <ひ>
- D - I - 0x028D03 20:8CF3: F1        .byte $F1
- D - I - 0x028D04 20:8CF4: 11        .byte $11	; <ち>
- D - I - 0x028D05 20:8CF5: 15        .byte $15	; <な>
- D - I - 0x028D06 20:8CF6: 64        .byte $64	; <ヤ>
- D - I - 0x028D07 20:8CF7: EF        .byte $EF
- D - I - 0x028D08 20:8CF8: 00        .byte $00
- D - I - 0x028D09 20:8CF9: F1        .byte $F1
- D - I - 0x028D0A 20:8CFA: 9A        .byte $9A
- D - I - 0x028D0B 20:8CFB: 14        .byte $14	; <と>
- D - I - 0x028D0C 20:8CFC: CE        .byte $CE	; <ピ>
- D - I - 0x028D0D 20:8CFD: B7        .byte $B7	; <ゲ>
- D - I - 0x028D0E 20:8CFE: 04        .byte $04	; <え>
- D - I - 0x028D0F 20:8CFF: 1E        .byte $1E	; <ほ>
- D - I - 0x028D10 20:8D00: F6        .byte $F6
- D - I - 0x028D11 20:8D01: 00        .byte $00
- D - I - 0x028D12 20:8D02: F1        .byte $F1
- D - I - 0x028D13 20:8D03: 10        .byte $10	; <た>
- D - I - 0x028D14 20:8D04: 40        .byte $40	; <「>
- D - I - 0x028D15 20:8D05: E8        .byte $E8
- D - I - 0x028D16 20:8D06: BB        .byte $BB	; <ズ>
- D - I - 0x028D17 20:8D07: 04        .byte $04	; <え>
- D - I - 0x028D18 20:8D08: F0        .byte $F0
off_8D09_18:
- D - I - 0x028D19 20:8D09: F5        .byte $F5
- D - I - 0x028D1A 20:8D0A: 83        .byte $83	; <C>
- D - I - 0x028D1B 20:8D0B: F4        .byte $F4
- D - I - 0x028D1C 20:8D0C: 18        .byte $18	; <ね>
- D - I - 0x028D1D 20:8D0D: 19        .byte $19	; <の>
- D - I - 0x028D1E 20:8D0E: 1A        .byte $1A	; <は>
- D - I - 0x028D1F 20:8D0F: 1B        .byte $1B	; <ひ>
- D - I - 0x028D20 20:8D10: F1        .byte $F1
- D - I - 0x028D21 20:8D11: 12        .byte $12	; <つ>
- D - I - 0x028D22 20:8D12: 15        .byte $15	; <な>
- D - I - 0x028D23 20:8D13: 40        .byte $40	; <「>
- D - I - 0x028D24 20:8D14: CB        .byte $CB	; <ぺ>
- D - I - 0x028D25 20:8D15: 00        .byte $00
- D - I - 0x028D26 20:8D16: F1        .byte $F1
- D - I - 0x028D27 20:8D17: 9B        .byte $9B
- D - I - 0x028D28 20:8D18: 14        .byte $14	; <と>
- D - I - 0x028D29 20:8D19: DC        .byte $DC
- D - I - 0x028D2A 20:8D1A: C6        .byte $C6	; <ベ>
- D - I - 0x028D2B 20:8D1B: 04        .byte $04	; <え>
- D - I - 0x028D2C 20:8D1C: F8        .byte $F8
- D - I - 0x028D2D 20:8D1D: A7 8B     .word off_8BA7
off_8D1F_19:
- D - I - 0x028D2F 20:8D1F: F5        .byte $F5
- D - I - 0x028D30 20:8D20: 80        .byte $80
- D - I - 0x028D31 20:8D21: F4        .byte $F4
- D - I - 0x028D32 20:8D22: 0C        .byte $0C	; <し>
- D - I - 0x028D33 20:8D23: 0D        .byte $0D	; <す>
- D - I - 0x028D34 20:8D24: 0E        .byte $0E	; <せ>
- D - I - 0x028D35 20:8D25: 0F        .byte $0F	; <そ>
- D - I - 0x028D36 20:8D26: F7        .byte $F7
- D - I - 0x028D37 20:8D27: 03        .byte $03	; <う>
- D - I - 0x028D38 20:8D28: 7B        .byte $7B	; <。>
- D - I - 0x028D39 20:8D29: F1        .byte $F1
- D - I - 0x028D3A 20:8D2A: 00        .byte $00
- D - I - 0x028D3B 20:8D2B: 00        .byte $00
- D - I - 0x028D3C 20:8D2C: 80        .byte $80
- D - I - 0x028D3D 20:8D2D: FB        .byte $FB
- D - I - 0x028D3E 20:8D2E: 00        .byte $00
- D - I - 0x028D3F 20:8D2F: F1        .byte $F1
- D - I - 0x028D40 20:8D30: 9D        .byte $9D
- D - I - 0x028D41 20:8D31: 1E        .byte $1E	; <ほ>
- D - I - 0x028D42 20:8D32: 7C        .byte $7C	; <~>
- D - I - 0x028D43 20:8D33: 9F        .byte $9F
- D - I - 0x028D44 20:8D34: 04        .byte $04	; <え>
- D - I - 0x028D45 20:8D35: F1        .byte $F1
- D - I - 0x028D46 20:8D36: 24        .byte $24	; <や>
- D - I - 0x028D47 20:8D37: 1D        .byte $1D	; <へ>
- D - I - 0x028D48 20:8D38: F0        .byte $F0
- D - I - 0x028D49 20:8D39: C3        .byte $C3	; <バ>
- D - I - 0x028D4A 20:8D3A: 08        .byte $08	; <く>
- D - I - 0x028D4B 20:8D3B: 1E        .byte $1E	; <ほ>
- D - I - 0x028D4C 20:8D3C: F6        .byte $F6
- D - I - 0x028D4D 20:8D3D: 15        .byte $15	; <な>
- D - I - 0x028D4E 20:8D3E: F1        .byte $F1
- D - I - 0x028D4F 20:8D3F: 00        .byte $00
- D - I - 0x028D50 20:8D40: 47        .byte $47	; <キ>
- D - I - 0x028D51 20:8D41: EB        .byte $EB
- D - I - 0x028D52 20:8D42: C1        .byte $C1	; <デ>
- D - I - 0x028D53 20:8D43: 08        .byte $08	; <く>
- D - I - 0x028D54 20:8D44: 02        .byte $02	; <い>
- D - I - 0x028D55 20:8D45: F1        .byte $F1
- D - I - 0x028D56 20:8D46: E7        .byte $E7
- D - I - 0x028D57 20:8D47: 1E        .byte $1E	; <ほ>
- D - I - 0x028D58 20:8D48: FC        .byte $FC
- D - I - 0x028D59 20:8D49: B3        .byte $B3	; <ぼ>
- D - I - 0x028D5A 20:8D4A: 04        .byte $04	; <え>
- D - I - 0x028D5B 20:8D4B: F1        .byte $F1
- D - I - 0x028D5C 20:8D4C: 26        .byte $26	; <よ>
- D - I - 0x028D5D 20:8D4D: 20        .byte $20	; <み>
- D - I - 0x028D5E 20:8D4E: EB        .byte $EB
- D - I - 0x028D5F 20:8D4F: C1        .byte $C1	; <デ>
- D - I - 0x028D60 20:8D50: 08        .byte $08	; <く>
- D - I - 0x028D61 20:8D51: F0        .byte $F0
off_8D52_1A:
- D - I - 0x028D62 20:8D52: F5        .byte $F5
- D - I - 0x028D63 20:8D53: 09        .byte $09	; <け>
- D - I - 0x028D64 20:8D54: F4        .byte $F4
- D - I - 0x028D65 20:8D55: 04        .byte $04	; <え>
- D - I - 0x028D66 20:8D56: 05        .byte $05	; <お>
- D - I - 0x028D67 20:8D57: 00        .byte $00
- D - I - 0x028D68 20:8D58: 00        .byte $00
- D - I - 0x028D69 20:8D59: F1        .byte $F1
- D - I - 0x028D6A 20:8D5A: 60        .byte $60	; <ミ>
- D - I - 0x028D6B 20:8D5B: CF        .byte $CF	; <プ>
- D - I - 0x028D6C 20:8D5C: 98        .byte $98
- D - I - 0x028D6D 20:8D5D: E3        .byte $E3
- D - I - 0x028D6E 20:8D5E: 00        .byte $00
- D - I - 0x028D6F 20:8D5F: F0        .byte $F0
off_8D60_1B:
- D - I - 0x028D70 20:8D60: F5        .byte $F5
- D - I - 0x028D71 20:8D61: 83        .byte $83	; <C>
- D - I - 0x028D72 20:8D62: F4        .byte $F4
- D - I - 0x028D73 20:8D63: 18        .byte $18	; <ね>
- D - I - 0x028D74 20:8D64: 19        .byte $19	; <の>
- D - I - 0x028D75 20:8D65: 1A        .byte $1A	; <は>
- D - I - 0x028D76 20:8D66: 1B        .byte $1B	; <ひ>
- D - I - 0x028D77 20:8D67: F1        .byte $F1
- D - I - 0x028D78 20:8D68: 49        .byte $49	; <ケ>
- D - I - 0x028D79 20:8D69: 15        .byte $15	; <な>
- D - I - 0x028D7A 20:8D6A: 40        .byte $40	; <「>
- D - I - 0x028D7B 20:8D6B: CB        .byte $CB	; <ぺ>
- D - I - 0x028D7C 20:8D6C: 00        .byte $00
- D - I - 0x028D7D 20:8D6D: F1        .byte $F1
- D - I - 0x028D7E 20:8D6E: A5        .byte $A5	; <ざ>
- D - I - 0x028D7F 20:8D6F: 14        .byte $14	; <と>
- D - I - 0x028D80 20:8D70: DC        .byte $DC
- D - I - 0x028D81 20:8D71: C6        .byte $C6	; <ベ>
- D - I - 0x028D82 20:8D72: 04        .byte $04	; <え>
- D - I - 0x028D83 20:8D73: F9        .byte $F9
- D - I - 0x028D84 20:8D74: 0F        .byte $0F	; <そ>
- D - I - 0x028D85 20:8D75: 01        .byte $01	; <あ>
- D - I - 0x028D86 20:8D76: FB        .byte $FB
- D - I - 0x028D87 20:8D77: 10        .byte $10	; <た>
- D - I - 0x028D88 20:8D78: 23        .byte $23	; <も>
- D - I - 0x028D89 20:8D79: 45        .byte $45	; <オ>
- D - I - 0x028D8A 20:8D7A: 01        .byte $01	; <あ>
- D - I - 0x028D8B 20:8D7B: FB        .byte $FB
- D - I - 0x028D8C 20:8D7C: 01        .byte $01	; <あ>
- D - I - 0x028D8D 20:8D7D: 23        .byte $23	; <も>
- D - I - 0x028D8E 20:8D7E: 45        .byte $45	; <オ>
- D - I - 0x028D8F 20:8D7F: FA        .byte $FA
- D - I - 0x028D90 20:8D80: F6        .byte $F6
- D - I - 0x028D91 20:8D81: 00        .byte $00
- D - I - 0x028D92 20:8D82: F1        .byte $F1
- D - I - 0x028D93 20:8D83: 4A        .byte $4A	; <コ>
- D - I - 0x028D94 20:8D84: 40        .byte $40	; <「>
- D - I - 0x028D95 20:8D85: 08        .byte $08	; <く>
- D - I - 0x028D96 20:8D86: BB        .byte $BB	; <ズ>
- D - I - 0x028D97 20:8D87: 05        .byte $05	; <お>
- D - I - 0x028D98 20:8D88: F0        .byte $F0
off_8D89_1C:
- D - I - 0x028D99 20:8D89: F5        .byte $F5
- D - I - 0x028D9A 20:8D8A: 81        .byte $81	; <A>
- D - I - 0x028D9B 20:8D8B: F4        .byte $F4
- D - I - 0x028D9C 20:8D8C: 13        .byte $13	; <て>
- D - I - 0x028D9D 20:8D8D: 00        .byte $00
- D - I - 0x028D9E 20:8D8E: 00        .byte $00
- D - I - 0x028D9F 20:8D8F: 00        .byte $00
- D - I - 0x028DA0 20:8D90: F1        .byte $F1
- D - I - 0x028DA1 20:8D91: 90        .byte $90	; <U>
- D - I - 0x028DA2 20:8D92: 2A        .byte $2A	; <れ>
- D - I - 0x028DA3 20:8D93: 00        .byte $00
- D - I - 0x028DA4 20:8D94: CB        .byte $CB	; <ぺ>
- D - I - 0x028DA5 20:8D95: 01        .byte $01	; <あ>
- D - I - 0x028DA6 20:8D96: F0        .byte $F0
off_8D97_1D:
- D - I - 0x028DA7 20:8D97: F5        .byte $F5
- D - I - 0x028DA8 20:8D98: 09        .byte $09	; <け>
- D - I - 0x028DA9 20:8D99: F4        .byte $F4
- D - I - 0x028DAA 20:8D9A: 04        .byte $04	; <え>
- D - I - 0x028DAB 20:8D9B: 05        .byte $05	; <お>
- D - I - 0x028DAC 20:8D9C: 00        .byte $00
- D - I - 0x028DAD 20:8D9D: 00        .byte $00
- D - I - 0x028DAE 20:8D9E: F1        .byte $F1
- D - I - 0x028DAF 20:8D9F: 61        .byte $61	; <ム>
- D - I - 0x028DB0 20:8DA0: C4        .byte $C4	; <ビ>
- D - I - 0x028DB1 20:8DA1: 00        .byte $00
- D - I - 0x028DB2 20:8DA2: EB        .byte $EB
- D - I - 0x028DB3 20:8DA3: 01        .byte $01	; <あ>
- D - I - 0x028DB4 20:8DA4: F0        .byte $F0
off_8DA5_1E:
- D - I - 0x028DB5 20:8DA5: F5        .byte $F5
- D - I - 0x028DB6 20:8DA6: 09        .byte $09	; <け>
- D - I - 0x028DB7 20:8DA7: F4        .byte $F4
- D - I - 0x028DB8 20:8DA8: 04        .byte $04	; <え>
- D - I - 0x028DB9 20:8DA9: 05        .byte $05	; <お>
- D - I - 0x028DBA 20:8DAA: 00        .byte $00
- D - I - 0x028DBB 20:8DAB: 00        .byte $00
- D - I - 0x028DBC 20:8DAC: F1        .byte $F1
- D - I - 0x028DBD 20:8DAD: 73        .byte $73	; <ヮ>
- D - I - 0x028DBE 20:8DAE: 72        .byte $72	; <ョ>
- D - I - 0x028DBF 20:8DAF: 9F        .byte $9F
- D - I - 0x028DC0 20:8DB0: BB        .byte $BB	; <ズ>
- D - I - 0x028DC1 20:8DB1: 00        .byte $00
- D - I - 0x028DC2 20:8DB2: F0        .byte $F0
off_8DB3_1F:
- D - I - 0x028DC3 20:8DB3: F5        .byte $F5
- D - I - 0x028DC4 20:8DB4: 09        .byte $09	; <け>
- D - I - 0x028DC5 20:8DB5: F4        .byte $F4
- D - I - 0x028DC6 20:8DB6: 04        .byte $04	; <え>
- D - I - 0x028DC7 20:8DB7: 05        .byte $05	; <お>
- D - I - 0x028DC8 20:8DB8: 00        .byte $00
- D - I - 0x028DC9 20:8DB9: 00        .byte $00
- D - I - 0x028DCA 20:8DBA: F1        .byte $F1
- D - I - 0x028DCB 20:8DBB: 00        .byte $00
- D - I - 0x028DCC 20:8DBC: 71        .byte $71	; <ュ>
- D - I - 0x028DCD 20:8DBD: 00        .byte $00
- D - I - 0x028DCE 20:8DBE: BB        .byte $BB	; <ズ>
- D - I - 0x028DCF 20:8DBF: 01        .byte $01	; <あ>
- D - I - 0x028DD0 20:8DC0: F0        .byte $F0
off_8DC1_20:
- D - I - 0x028DD1 20:8DC1: F5        .byte $F5
- D - I - 0x028DD2 20:8DC2: 81        .byte $81	; <A>
- D - I - 0x028DD3 20:8DC3: F4        .byte $F4
- D - I - 0x028DD4 20:8DC4: 13        .byte $13	; <て>
- D - I - 0x028DD5 20:8DC5: 00        .byte $00
- D - I - 0x028DD6 20:8DC6: 00        .byte $00
- D - I - 0x028DD7 20:8DC7: 00        .byte $00
- D - I - 0x028DD8 20:8DC8: F1        .byte $F1
- D - I - 0x028DD9 20:8DC9: 38        .byte $38	; <5>
- D - I - 0x028DDA 20:8DCA: 2A        .byte $2A	; <れ>
- D - I - 0x028DDB 20:8DCB: 00        .byte $00
- D - I - 0x028DDC 20:8DCC: CB        .byte $CB	; <ぺ>
- D - I - 0x028DDD 20:8DCD: 01        .byte $01	; <あ>
- D - I - 0x028DDE 20:8DCE: F0        .byte $F0
off_8DCF_21:
- D - I - 0x028DDF 20:8DCF: F5        .byte $F5
- D - I - 0x028DE0 20:8DD0: 81        .byte $81	; <A>
- D - I - 0x028DE1 20:8DD1: F4        .byte $F4
- D - I - 0x028DE2 20:8DD2: 28        .byte $28	; <り>
- D - I - 0x028DE3 20:8DD3: 29        .byte $29	; <る>
- D - I - 0x028DE4 20:8DD4: 2A        .byte $2A	; <れ>
- D - I - 0x028DE5 20:8DD5: 0B        .byte $0B	; <さ>
- D - I - 0x028DE6 20:8DD6: F1        .byte $F1
- D - I - 0x028DE7 20:8DD7: 4C        .byte $4C	; <シ>
- D - I - 0x028DE8 20:8DD8: 12        .byte $12	; <つ>
- D - I - 0x028DE9 20:8DD9: 70        .byte $70	; <ャ>
- D - I - 0x028DEA 20:8DDA: CB        .byte $CB	; <ぺ>
- D - I - 0x028DEB 20:8DDB: 00        .byte $00
- D - I - 0x028DEC 20:8DDC: F1        .byte $F1
- D - I - 0x028DED 20:8DDD: 4B        .byte $4B	; <サ>
- D - I - 0x028DEE 20:8DDE: 10        .byte $10	; <た>
- D - I - 0x028DEF 20:8DDF: 23        .byte $23	; <も>
- D - I - 0x028DF0 20:8DE0: C0        .byte $C0	; <ヅ>
- D - I - 0x028DF1 20:8DE1: 05        .byte $05	; <お>
- D - I - 0x028DF2 20:8DE2: F9        .byte $F9
- D - I - 0x028DF3 20:8DE3: 0C        .byte $0C	; <し>
- D - I - 0x028DF4 20:8DE4: 01        .byte $01	; <あ>
- D - I - 0x028DF5 20:8DE5: FB        .byte $FB
- D - I - 0x028DF6 20:8DE6: 10        .byte $10	; <た>
- D - I - 0x028DF7 20:8DE7: 23        .byte $23	; <も>
- D - I - 0x028DF8 20:8DE8: 45        .byte $45	; <オ>
- D - I - 0x028DF9 20:8DE9: 01        .byte $01	; <あ>
- D - I - 0x028DFA 20:8DEA: FB        .byte $FB
- D - I - 0x028DFB 20:8DEB: 01        .byte $01	; <あ>
- D - I - 0x028DFC 20:8DEC: 23        .byte $23	; <も>
- D - I - 0x028DFD 20:8DED: 45        .byte $45	; <オ>
- D - I - 0x028DFE 20:8DEE: FA        .byte $FA
- D - I - 0x028DFF 20:8DEF: F6        .byte $F6
- D - I - 0x028E00 20:8DF0: 00        .byte $00
- D - I - 0x028E01 20:8DF1: F1        .byte $F1
- D - I - 0x028E02 20:8DF2: 00        .byte $00
- D - I - 0x028E03 20:8DF3: 37        .byte $37	; <4>
- D - I - 0x028E04 20:8DF4: 20        .byte $20	; <み>
- D - I - 0x028E05 20:8DF5: BB        .byte $BB	; <ズ>
- D - I - 0x028E06 20:8DF6: 05        .byte $05	; <お>
- D - I - 0x028E07 20:8DF7: 02        .byte $02	; <い>
- D - I - 0x028E08 20:8DF8: F1        .byte $F1
- D - I - 0x028E09 20:8DF9: DE        .byte $DE
- D - I - 0x028E0A 20:8DFA: 12        .byte $12	; <つ>
- D - I - 0x028E0B 20:8DFB: 16        .byte $16	; <に>
- D - I - 0x028E0C 20:8DFC: CB        .byte $CB	; <ぺ>
- D - I - 0x028E0D 20:8DFD: 01        .byte $01	; <あ>
- D - I - 0x028E0E 20:8DFE: F1        .byte $F1
- D - I - 0x028E0F 20:8DFF: 4B        .byte $4B	; <サ>
- D - I - 0x028E10 20:8E00: 10        .byte $10	; <た>
- D - I - 0x028E11 20:8E01: 20        .byte $20	; <み>
- D - I - 0x028E12 20:8E02: BB        .byte $BB	; <ズ>
- D - I - 0x028E13 20:8E03: 05        .byte $05	; <お>
- D - I - 0x028E14 20:8E04: F0        .byte $F0
off_8E05_22:
- D - I - 0x028E15 20:8E05: F5        .byte $F5
- D - I - 0x028E16 20:8E06: 81        .byte $81	; <A>
- D - I - 0x028E17 20:8E07: F4        .byte $F4
- D - I - 0x028E18 20:8E08: 28        .byte $28	; <り>
- D - I - 0x028E19 20:8E09: 29        .byte $29	; <る>
- D - I - 0x028E1A 20:8E0A: 2A        .byte $2A	; <れ>
- D - I - 0x028E1B 20:8E0B: 2B        .byte $2B	; <ろ>
- D - I - 0x028E1C 20:8E0C: F1        .byte $F1
- D - I - 0x028E1D 20:8E0D: 4E        .byte $4E	; <セ>
- D - I - 0x028E1E 20:8E0E: 12        .byte $12	; <つ>
- D - I - 0x028E1F 20:8E0F: 70        .byte $70	; <ャ>
- D - I - 0x028E20 20:8E10: CB        .byte $CB	; <ぺ>
- D - I - 0x028E21 20:8E11: 00        .byte $00
- D - I - 0x028E22 20:8E12: F1        .byte $F1
- D - I - 0x028E23 20:8E13: 4D        .byte $4D	; <ス>
- D - I - 0x028E24 20:8E14: 10        .byte $10	; <た>
- D - I - 0x028E25 20:8E15: 28        .byte $28	; <り>
- D - I - 0x028E26 20:8E16: C3        .byte $C3	; <バ>
- D - I - 0x028E27 20:8E17: 05        .byte $05	; <お>
- D - I - 0x028E28 20:8E18: F8        .byte $F8
- D - I - 0x028E29 20:8E19: A7 8B     .word off_8BA7
off_8E1B_23:
- D - I - 0x028E2B 20:8E1B: F5        .byte $F5
- D - I - 0x028E2C 20:8E1C: 83        .byte $83	; <C>
- D - I - 0x028E2D 20:8E1D: F4        .byte $F4
- D - I - 0x028E2E 20:8E1E: 18        .byte $18	; <ね>
- D - I - 0x028E2F 20:8E1F: 19        .byte $19	; <の>
- D - I - 0x028E30 20:8E20: 1A        .byte $1A	; <は>
- D - I - 0x028E31 20:8E21: 2B        .byte $2B	; <ろ>
- D - I - 0x028E32 20:8E22: F7        .byte $F7
- D - I - 0x028E33 20:8E23: 03        .byte $03	; <う>
- D - I - 0x028E34 20:8E24: 7B        .byte $7B	; <。>
- D - I - 0x028E35 20:8E25: F1        .byte $F1
- D - I - 0x028E36 20:8E26: 00        .byte $00
- D - I - 0x028E37 20:8E27: 00        .byte $00
- D - I - 0x028E38 20:8E28: 80        .byte $80
- D - I - 0x028E39 20:8E29: FB        .byte $FB
- D - I - 0x028E3A 20:8E2A: 00        .byte $00
- D - I - 0x028E3B 20:8E2B: F1        .byte $F1
- D - I - 0x028E3C 20:8E2C: E8        .byte $E8
- D - I - 0x028E3D 20:8E2D: 05        .byte $05	; <お>
- D - I - 0x028E3E 20:8E2E: F8        .byte $F8
- D - I - 0x028E3F 20:8E2F: C3        .byte $C3	; <バ>
- D - I - 0x028E40 20:8E30: 04        .byte $04	; <え>
- D - I - 0x028E41 20:8E31: F0        .byte $F0
off_8E32_24:
- D - I - 0x028E42 20:8E32: F5        .byte $F5
- D - I - 0x028E43 20:8E33: 83        .byte $83	; <C>
- D - I - 0x028E44 20:8E34: F4        .byte $F4
- D - I - 0x028E45 20:8E35: 18        .byte $18	; <ね>
- D - I - 0x028E46 20:8E36: 19        .byte $19	; <の>
- D - I - 0x028E47 20:8E37: 1A        .byte $1A	; <は>
- D - I - 0x028E48 20:8E38: 1B        .byte $1B	; <ひ>
- D - I - 0x028E49 20:8E39: F7        .byte $F7
- D - I - 0x028E4A 20:8E3A: 03        .byte $03	; <う>
- D - I - 0x028E4B 20:8E3B: 7B        .byte $7B	; <。>
- D - I - 0x028E4C 20:8E3C: F1        .byte $F1
- D - I - 0x028E4D 20:8E3D: 00        .byte $00
- D - I - 0x028E4E 20:8E3E: 00        .byte $00
- D - I - 0x028E4F 20:8E3F: 80        .byte $80
- D - I - 0x028E50 20:8E40: FB        .byte $FB
- D - I - 0x028E51 20:8E41: 00        .byte $00
- D - I - 0x028E52 20:8E42: F1        .byte $F1
- D - I - 0x028E53 20:8E43: 14        .byte $14	; <と>
- D - I - 0x028E54 20:8E44: 15        .byte $15	; <な>
- D - I - 0x028E55 20:8E45: 56        .byte $56	; <ニ>
- D - I - 0x028E56 20:8E46: 7C        .byte $7C	; <~>
- D - I - 0x028E57 20:8E47: 04        .byte $04	; <え>
- D - I - 0x028E58 20:8E48: F1        .byte $F1
- D - I - 0x028E59 20:8E49: 4A        .byte $4A	; <コ>
- D - I - 0x028E5A 20:8E4A: 80        .byte $80
- D - I - 0x028E5B 20:8E4B: E8        .byte $E8
- D - I - 0x028E5C 20:8E4C: BB        .byte $BB	; <ズ>
- D - I - 0x028E5D 20:8E4D: 08        .byte $08	; <く>
off_8E4E:
- D - I - 0x028E5E 20:8E4E: 01        .byte $01	; <あ>
- D - I - 0x028E5F 20:8E4F: FB        .byte $FB
- D - I - 0x028E60 20:8E50: 01        .byte $01	; <あ>
- D - I - 0x028E61 20:8E51: 23        .byte $23	; <も>
- D - I - 0x028E62 20:8E52: 45        .byte $45	; <オ>
- D - I - 0x028E63 20:8E53: 01        .byte $01	; <あ>
- D - I - 0x028E64 20:8E54: FB        .byte $FB
- D - I - 0x028E65 20:8E55: 02        .byte $02	; <い>
- D - I - 0x028E66 20:8E56: 13        .byte $13	; <て>
- D - I - 0x028E67 20:8E57: 45        .byte $45	; <オ>
- D - I - 0x028E68 20:8E58: F8        .byte $F8
- D - I - 0x028E69 20:8E59: 4E 8E     .word off_8E4E
off_8E5B_25:
- D - I - 0x028E6B 20:8E5B: F5        .byte $F5
- D - I - 0x028E6C 20:8E5C: 83        .byte $83	; <C>
- D - I - 0x028E6D 20:8E5D: F4        .byte $F4
- D - I - 0x028E6E 20:8E5E: 18        .byte $18	; <ね>
- D - I - 0x028E6F 20:8E5F: 19        .byte $19	; <の>
- D - I - 0x028E70 20:8E60: 1A        .byte $1A	; <は>
- D - I - 0x028E71 20:8E61: 1B        .byte $1B	; <ひ>
- D - I - 0x028E72 20:8E62: F7        .byte $F7
- D - I - 0x028E73 20:8E63: 03        .byte $03	; <う>
- D - I - 0x028E74 20:8E64: 7B        .byte $7B	; <。>
- D - I - 0x028E75 20:8E65: F1        .byte $F1
- D - I - 0x028E76 20:8E66: 00        .byte $00
- D - I - 0x028E77 20:8E67: 00        .byte $00
- D - I - 0x028E78 20:8E68: 80        .byte $80
- D - I - 0x028E79 20:8E69: FB        .byte $FB
- D - I - 0x028E7A 20:8E6A: 00        .byte $00
- D - I - 0x028E7B 20:8E6B: F1        .byte $F1
- D - I - 0x028E7C 20:8E6C: 14        .byte $14	; <と>
- D - I - 0x028E7D 20:8E6D: 15        .byte $15	; <な>
- D - I - 0x028E7E 20:8E6E: 39        .byte $39	; <6>
- D - I - 0x028E7F 20:8E6F: 7E        .byte $7E	; <.>
- D - I - 0x028E80 20:8E70: 04        .byte $04	; <え>
- D - I - 0x028E81 20:8E71: F1        .byte $F1
- D - I - 0x028E82 20:8E72: 13        .byte $13	; <て>
- D - I - 0x028E83 20:8E73: 17        .byte $17	; <ぬ>
- D - I - 0x028E84 20:8E74: 04        .byte $04	; <え>
- D - I - 0x028E85 20:8E75: BB        .byte $BB	; <ズ>
- D - I - 0x028E86 20:8E76: 09        .byte $09	; <け>
- D - I - 0x028E87 20:8E77: F8        .byte $F8
- D - I - 0x028E88 20:8E78: 4E 8E     .word off_8E4E
off_8E7A_26:
- D - I - 0x028E8A 20:8E7A: F5        .byte $F5
- D - I - 0x028E8B 20:8E7B: 83        .byte $83	; <C>
- D - I - 0x028E8C 20:8E7C: F4        .byte $F4
- D - I - 0x028E8D 20:8E7D: 2A        .byte $2A	; <れ>
- D - I - 0x028E8E 20:8E7E: 2B        .byte $2B	; <ろ>
- D - I - 0x028E8F 20:8E7F: 00        .byte $00
- D - I - 0x028E90 20:8E80: 00        .byte $00
- D - I - 0x028E91 20:8E81: F1        .byte $F1
- D - I - 0x028E92 20:8E82: 16        .byte $16	; <に>
- D - I - 0x028E93 20:8E83: 04        .byte $04	; <え>
- D - I - 0x028E94 20:8E84: 90        .byte $90	; <U>
- D - I - 0x028E95 20:8E85: 9B        .byte $9B
- D - I - 0x028E96 20:8E86: 00        .byte $00
- D - I - 0x028E97 20:8E87: F1        .byte $F1
- D - I - 0x028E98 20:8E88: 15        .byte $15	; <な>
- D - I - 0x028E99 20:8E89: 03        .byte $03	; <う>
- D - I - 0x028E9A 20:8E8A: F6        .byte $F6
- D - I - 0x028E9B 20:8E8B: D5        .byte $D5
- D - I - 0x028E9C 20:8E8C: 04        .byte $04	; <え>
- D - I - 0x028E9D 20:8E8D: F0        .byte $F0
off_8E8E_27:
- D - I - 0x028E9E 20:8E8E: F5        .byte $F5
- D - I - 0x028E9F 20:8E8F: 83        .byte $83	; <C>
- D - I - 0x028EA0 20:8E90: F4        .byte $F4
- D - I - 0x028EA1 20:8E91: 18        .byte $18	; <ね>
- D - I - 0x028EA2 20:8E92: 19        .byte $19	; <の>
- D - I - 0x028EA3 20:8E93: 1A        .byte $1A	; <は>
- D - I - 0x028EA4 20:8E94: 1B        .byte $1B	; <ひ>
- D - I - 0x028EA5 20:8E95: F1        .byte $F1
- D - I - 0x028EA6 20:8E96: 17        .byte $17	; <ぬ>
- D - I - 0x028EA7 20:8E97: 15        .byte $15	; <な>
- D - I - 0x028EA8 20:8E98: 39        .byte $39	; <6>
- D - I - 0x028EA9 20:8E99: 7E        .byte $7E	; <.>
- D - I - 0x028EAA 20:8E9A: 00        .byte $00
- D - I - 0x028EAB 20:8E9B: F1        .byte $F1
- D - I - 0x028EAC 20:8E9C: 52        .byte $52	; <ツ>
- D - I - 0x028EAD 20:8E9D: 17        .byte $17	; <ぬ>
- D - I - 0x028EAE 20:8E9E: 02        .byte $02	; <い>
- D - I - 0x028EAF 20:8E9F: BD        .byte $BD	; <ゾ>
- D - I - 0x028EB0 20:8EA0: 05        .byte $05	; <お>
- D - I - 0x028EB1 20:8EA1: F9        .byte $F9
- D - I - 0x028EB2 20:8EA2: 0F        .byte $0F	; <そ>
- D - I - 0x028EB3 20:8EA3: 01        .byte $01	; <あ>
- D - I - 0x028EB4 20:8EA4: FB        .byte $FB
- D - I - 0x028EB5 20:8EA5: 10        .byte $10	; <た>
- D - I - 0x028EB6 20:8EA6: 23        .byte $23	; <も>
- D - I - 0x028EB7 20:8EA7: 45        .byte $45	; <オ>
- D - I - 0x028EB8 20:8EA8: 01        .byte $01	; <あ>
- D - I - 0x028EB9 20:8EA9: FB        .byte $FB
- D - I - 0x028EBA 20:8EAA: 01        .byte $01	; <あ>
- D - I - 0x028EBB 20:8EAB: 23        .byte $23	; <も>
- D - I - 0x028EBC 20:8EAC: 45        .byte $45	; <オ>
- D - I - 0x028EBD 20:8EAD: FA        .byte $FA
- D - I - 0x028EBE 20:8EAE: F6        .byte $F6
- D - I - 0x028EBF 20:8EAF: 00        .byte $00
- D - I - 0x028EC0 20:8EB0: F1        .byte $F1
- D - I - 0x028EC1 20:8EB1: 00        .byte $00
- D - I - 0x028EC2 20:8EB2: CE        .byte $CE	; <ピ>
- D - I - 0x028EC3 20:8EB3: F4        .byte $F4
- D - I - 0x028EC4 20:8EB4: C3        .byte $C3	; <バ>
- D - I - 0x028EC5 20:8EB5: 04        .byte $04	; <え>
- D - I - 0x028EC6 20:8EB6: 04        .byte $04	; <え>
- D - I - 0x028EC7 20:8EB7: F1        .byte $F1
- D - I - 0x028EC8 20:8EB8: 1B        .byte $1B	; <ひ>
- D - I - 0x028EC9 20:8EB9: 15        .byte $15	; <な>
- D - I - 0x028ECA 20:8EBA: E6        .byte $E6
- D - I - 0x028ECB 20:8EBB: DD        .byte $DD
- D - I - 0x028ECC 20:8EBC: 00        .byte $00
- D - I - 0x028ECD 20:8EBD: F1        .byte $F1
- D - I - 0x028ECE 20:8EBE: 53        .byte $53	; <テ>
- D - I - 0x028ECF 20:8EBF: 17        .byte $17	; <ぬ>
- D - I - 0x028ED0 20:8EC0: F4        .byte $F4
- D - I - 0x028ED1 20:8EC1: C3        .byte $C3	; <バ>
- D - I - 0x028ED2 20:8EC2: 04        .byte $04	; <え>
- D - I - 0x028ED3 20:8EC3: F8        .byte $F8
- D - I - 0x028ED4 20:8EC4: A7 8B     .word off_8BA7
off_8EC6_28:
- D - I - 0x028ED6 20:8EC6: F5        .byte $F5
- D - I - 0x028ED7 20:8EC7: 09        .byte $09	; <け>
- D - I - 0x028ED8 20:8EC8: F4        .byte $F4
- D - I - 0x028ED9 20:8EC9: 04        .byte $04	; <え>
- D - I - 0x028EDA 20:8ECA: 05        .byte $05	; <お>
- D - I - 0x028EDB 20:8ECB: 00        .byte $00
- D - I - 0x028EDC 20:8ECC: 00        .byte $00
- D - I - 0x028EDD 20:8ECD: F7        .byte $F7
- D - I - 0x028EDE 20:8ECE: 03        .byte $03	; <う>
- D - I - 0x028EDF 20:8ECF: 73        .byte $73	; <ヮ>
- D - I - 0x028EE0 20:8ED0: F1        .byte $F1
- D - I - 0x028EE1 20:8ED1: 75        .byte $75	; <ェ>
- D - I - 0x028EE2 20:8ED2: 71        .byte $71	; <ュ>
- D - I - 0x028EE3 20:8ED3: 00        .byte $00
- D - I - 0x028EE4 20:8ED4: C3        .byte $C3	; <バ>
- D - I - 0x028EE5 20:8ED5: 01        .byte $01	; <あ>
- D - I - 0x028EE6 20:8ED6: 0A        .byte $0A	; <こ>
- D - I - 0x028EE7 20:8ED7: F1        .byte $F1
- D - I - 0x028EE8 20:8ED8: D9        .byte $D9
- D - I - 0x028EE9 20:8ED9: 71        .byte $71	; <ュ>
- D - I - 0x028EEA 20:8EDA: 00        .byte $00
- D - I - 0x028EEB 20:8EDB: C3        .byte $C3	; <バ>
- D - I - 0x028EEC 20:8EDC: 05        .byte $05	; <お>
- D - I - 0x028EED 20:8EDD: 0A        .byte $0A	; <こ>
- D - I - 0x028EEE 20:8EDE: F1        .byte $F1
- D - I - 0x028EEF 20:8EDF: 00        .byte $00
- D - I - 0x028EF0 20:8EE0: 71        .byte $71	; <ュ>
- D - I - 0x028EF1 20:8EE1: 00        .byte $00
- D - I - 0x028EF2 20:8EE2: C3        .byte $C3	; <バ>
- D - I - 0x028EF3 20:8EE3: 09        .byte $09	; <け>
- D - I - 0x028EF4 20:8EE4: F0        .byte $F0
off_8EE5_29:
- D - I - 0x028EF5 20:8EE5: F5        .byte $F5
- D - I - 0x028EF6 20:8EE6: 09        .byte $09	; <け>
- D - I - 0x028EF7 20:8EE7: F4        .byte $F4
- D - I - 0x028EF8 20:8EE8: 04        .byte $04	; <え>
- D - I - 0x028EF9 20:8EE9: 05        .byte $05	; <お>
- D - I - 0x028EFA 20:8EEA: 00        .byte $00
- D - I - 0x028EFB 20:8EEB: 00        .byte $00
- D - I - 0x028EFC 20:8EEC: F1        .byte $F1
- D - I - 0x028EFD 20:8EED: 87        .byte $87	; <G>
- D - I - 0x028EFE 20:8EEE: 71        .byte $71	; <ュ>
- D - I - 0x028EFF 20:8EEF: 00        .byte $00
- D - I - 0x028F00 20:8EF0: EB        .byte $EB
- D - I - 0x028F01 20:8EF1: 01        .byte $01	; <あ>
- D - I - 0x028F02 20:8EF2: F0        .byte $F0
off_8EF3_2A:
- D - I - 0x028F03 20:8EF3: F5        .byte $F5
- D - I - 0x028F04 20:8EF4: 83        .byte $83	; <C>
- D - I - 0x028F05 20:8EF5: F4        .byte $F4
- D - I - 0x028F06 20:8EF6: 18        .byte $18	; <ね>
- D - I - 0x028F07 20:8EF7: 19        .byte $19	; <の>
- D - I - 0x028F08 20:8EF8: 1A        .byte $1A	; <は>
- D - I - 0x028F09 20:8EF9: 1B        .byte $1B	; <ひ>
- D - I - 0x028F0A 20:8EFA: F1        .byte $F1
- D - I - 0x028F0B 20:8EFB: 17        .byte $17	; <ぬ>
- D - I - 0x028F0C 20:8EFC: 15        .byte $15	; <な>
- D - I - 0x028F0D 20:8EFD: 56        .byte $56	; <ニ>
- D - I - 0x028F0E 20:8EFE: 7C        .byte $7C	; <~>
- D - I - 0x028F0F 20:8EFF: 00        .byte $00
- D - I - 0x028F10 20:8F00: F1        .byte $F1
- D - I - 0x028F11 20:8F01: 08        .byte $08	; <く>
- D - I - 0x028F12 20:8F02: 80        .byte $80
- D - I - 0x028F13 20:8F03: E6        .byte $E6
- D - I - 0x028F14 20:8F04: BC        .byte $BC	; <ゼ>
- D - I - 0x028F15 20:8F05: 04        .byte $04	; <え>
- D - I - 0x028F16 20:8F06: F9        .byte $F9
- D - I - 0x028F17 20:8F07: 0F        .byte $0F	; <そ>
- D - I - 0x028F18 20:8F08: 01        .byte $01	; <あ>
- D - I - 0x028F19 20:8F09: FB        .byte $FB
- D - I - 0x028F1A 20:8F0A: 10        .byte $10	; <た>
- D - I - 0x028F1B 20:8F0B: 23        .byte $23	; <も>
- D - I - 0x028F1C 20:8F0C: 45        .byte $45	; <オ>
- D - I - 0x028F1D 20:8F0D: 01        .byte $01	; <あ>
- D - I - 0x028F1E 20:8F0E: FB        .byte $FB
- D - I - 0x028F1F 20:8F0F: 01        .byte $01	; <あ>
- D - I - 0x028F20 20:8F10: 23        .byte $23	; <も>
- D - I - 0x028F21 20:8F11: 45        .byte $45	; <オ>
- D - I - 0x028F22 20:8F12: FA        .byte $FA
- D - I - 0x028F23 20:8F13: F6        .byte $F6
- D - I - 0x028F24 20:8F14: 00        .byte $00
- D - I - 0x028F25 20:8F15: F1        .byte $F1
- D - I - 0x028F26 20:8F16: 00        .byte $00
- D - I - 0x028F27 20:8F17: 7F        .byte $7F	; <,>
- D - I - 0x028F28 20:8F18: F8        .byte $F8
- D - I - 0x028F29 20:8F19: C3        .byte $C3	; <バ>
- D - I - 0x028F2A 20:8F1A: 04        .byte $04	; <え>
- D - I - 0x028F2B 20:8F1B: 04        .byte $04	; <え>
- D - I - 0x028F2C 20:8F1C: F1        .byte $F1
- D - I - 0x028F2D 20:8F1D: 1B        .byte $1B	; <ひ>
- D - I - 0x028F2E 20:8F1E: 15        .byte $15	; <な>
- D - I - 0x028F2F 20:8F1F: 06        .byte $06	; <か>
- D - I - 0x028F30 20:8F20: DD        .byte $DD
- D - I - 0x028F31 20:8F21: 01        .byte $01	; <あ>
- D - I - 0x028F32 20:8F22: F1        .byte $F1
- D - I - 0x028F33 20:8F23: 1C        .byte $1C	; <ふ>
- D - I - 0x028F34 20:8F24: 80        .byte $80
- D - I - 0x028F35 20:8F25: F8        .byte $F8
- D - I - 0x028F36 20:8F26: C3        .byte $C3	; <バ>
- D - I - 0x028F37 20:8F27: 04        .byte $04	; <え>
- D - I - 0x028F38 20:8F28: F0        .byte $F0
off_8F29_2B:
- D - I - 0x028F39 20:8F29: F5        .byte $F5
- D - I - 0x028F3A 20:8F2A: 83        .byte $83	; <C>
- D - I - 0x028F3B 20:8F2B: F4        .byte $F4
- D - I - 0x028F3C 20:8F2C: 2A        .byte $2A	; <れ>
- D - I - 0x028F3D 20:8F2D: 2B        .byte $2B	; <ろ>
- D - I - 0x028F3E 20:8F2E: 00        .byte $00
- D - I - 0x028F3F 20:8F2F: 00        .byte $00
- D - I - 0x028F40 20:8F30: F1        .byte $F1
- D - I - 0x028F41 20:8F31: 19        .byte $19	; <の>
- D - I - 0x028F42 20:8F32: 04        .byte $04	; <え>
- D - I - 0x028F43 20:8F33: 90        .byte $90	; <U>
- D - I - 0x028F44 20:8F34: 9B        .byte $9B
- D - I - 0x028F45 20:8F35: 00        .byte $00
- D - I - 0x028F46 20:8F36: F1        .byte $F1
- D - I - 0x028F47 20:8F37: 18        .byte $18	; <ね>
- D - I - 0x028F48 20:8F38: 03        .byte $03	; <う>
- D - I - 0x028F49 20:8F39: FA        .byte $FA
- D - I - 0x028F4A 20:8F3A: D0        .byte $D0	; <ペ>
- D - I - 0x028F4B 20:8F3B: 04        .byte $04	; <え>
- D - I - 0x028F4C 20:8F3C: 1E        .byte $1E	; <ほ>
- D - I - 0x028F4D 20:8F3D: F6        .byte $F6
- D - I - 0x028F4E 20:8F3E: 00        .byte $00
- D - I - 0x028F4F 20:8F3F: F1        .byte $F1
- D - I - 0x028F50 20:8F40: 00        .byte $00
- D - I - 0x028F51 20:8F41: 3E        .byte $3E	; <Jr>
- D - I - 0x028F52 20:8F42: 00        .byte $00
- D - I - 0x028F53 20:8F43: CB        .byte $CB	; <ぺ>
- D - I - 0x028F54 20:8F44: 05        .byte $05	; <お>
- D - I - 0x028F55 20:8F45: 04        .byte $04	; <え>
- D - I - 0x028F56 20:8F46: F1        .byte $F1
- D - I - 0x028F57 20:8F47: 1D        .byte $1D	; <へ>
- D - I - 0x028F58 20:8F48: 04        .byte $04	; <え>
- D - I - 0x028F59 20:8F49: 1C        .byte $1C	; <ふ>
- D - I - 0x028F5A 20:8F4A: AB        .byte $AB	; <ぢ>
- D - I - 0x028F5B 20:8F4B: 01        .byte $01	; <あ>
- D - I - 0x028F5C 20:8F4C: F1        .byte $F1
- D - I - 0x028F5D 20:8F4D: 18        .byte $18	; <ね>
- D - I - 0x028F5E 20:8F4E: 03        .byte $03	; <う>
- D - I - 0x028F5F 20:8F4F: 00        .byte $00
- D - I - 0x028F60 20:8F50: CB        .byte $CB	; <ぺ>
- D - I - 0x028F61 20:8F51: 05        .byte $05	; <お>
- D - I - 0x028F62 20:8F52: F0        .byte $F0
off_8F53_2C:
- D - I - 0x028F63 20:8F53: F5        .byte $F5
- D - I - 0x028F64 20:8F54: 83        .byte $83	; <C>
- D - I - 0x028F65 20:8F55: F4        .byte $F4
- D - I - 0x028F66 20:8F56: 18        .byte $18	; <ね>
- D - I - 0x028F67 20:8F57: 19        .byte $19	; <の>
- D - I - 0x028F68 20:8F58: 1A        .byte $1A	; <は>
- D - I - 0x028F69 20:8F59: 1B        .byte $1B	; <ひ>
- D - I - 0x028F6A 20:8F5A: F1        .byte $F1
- D - I - 0x028F6B 20:8F5B: 17        .byte $17	; <ぬ>
- D - I - 0x028F6C 20:8F5C: 15        .byte $15	; <な>
- D - I - 0x028F6D 20:8F5D: 56        .byte $56	; <ニ>
- D - I - 0x028F6E 20:8F5E: 7C        .byte $7C	; <~>
- D - I - 0x028F6F 20:8F5F: 00        .byte $00
- D - I - 0x028F70 20:8F60: F1        .byte $F1
- D - I - 0x028F71 20:8F61: 08        .byte $08	; <く>
- D - I - 0x028F72 20:8F62: 80        .byte $80
- D - I - 0x028F73 20:8F63: E6        .byte $E6
- D - I - 0x028F74 20:8F64: BC        .byte $BC	; <ゼ>
- D - I - 0x028F75 20:8F65: 04        .byte $04	; <え>
- D - I - 0x028F76 20:8F66: F9        .byte $F9
- D - I - 0x028F77 20:8F67: 0F        .byte $0F	; <そ>
- D - I - 0x028F78 20:8F68: 01        .byte $01	; <あ>
- D - I - 0x028F79 20:8F69: FB        .byte $FB
- D - I - 0x028F7A 20:8F6A: 10        .byte $10	; <た>
- D - I - 0x028F7B 20:8F6B: 23        .byte $23	; <も>
- D - I - 0x028F7C 20:8F6C: 45        .byte $45	; <オ>
- D - I - 0x028F7D 20:8F6D: 01        .byte $01	; <あ>
- D - I - 0x028F7E 20:8F6E: FB        .byte $FB
- D - I - 0x028F7F 20:8F6F: 01        .byte $01	; <あ>
- D - I - 0x028F80 20:8F70: 23        .byte $23	; <も>
- D - I - 0x028F81 20:8F71: 45        .byte $45	; <オ>
- D - I - 0x028F82 20:8F72: FA        .byte $FA
- D - I - 0x028F83 20:8F73: F6        .byte $F6
- D - I - 0x028F84 20:8F74: 00        .byte $00
- D - I - 0x028F85 20:8F75: F1        .byte $F1
- D - I - 0x028F86 20:8F76: 00        .byte $00
- D - I - 0x028F87 20:8F77: 7F        .byte $7F	; <,>
- D - I - 0x028F88 20:8F78: F8        .byte $F8
- D - I - 0x028F89 20:8F79: C3        .byte $C3	; <バ>
- D - I - 0x028F8A 20:8F7A: 04        .byte $04	; <え>
- D - I - 0x028F8B 20:8F7B: F0        .byte $F0
off_8F7C_2D:
- D - I - 0x028F8C 20:8F7C: F5        .byte $F5
- D - I - 0x028F8D 20:8F7D: 83        .byte $83	; <C>
- D - I - 0x028F8E 20:8F7E: F4        .byte $F4
- D - I - 0x028F8F 20:8F7F: 2A        .byte $2A	; <れ>
- D - I - 0x028F90 20:8F80: 2B        .byte $2B	; <ろ>
- D - I - 0x028F91 20:8F81: 00        .byte $00
- D - I - 0x028F92 20:8F82: 00        .byte $00
- D - I - 0x028F93 20:8F83: F1        .byte $F1
- D - I - 0x028F94 20:8F84: 19        .byte $19	; <の>
- D - I - 0x028F95 20:8F85: 04        .byte $04	; <え>
- D - I - 0x028F96 20:8F86: 90        .byte $90	; <U>
- D - I - 0x028F97 20:8F87: 9B        .byte $9B
- D - I - 0x028F98 20:8F88: 00        .byte $00
- D - I - 0x028F99 20:8F89: F1        .byte $F1
- D - I - 0x028F9A 20:8F8A: 18        .byte $18	; <ね>
- D - I - 0x028F9B 20:8F8B: 03        .byte $03	; <う>
- D - I - 0x028F9C 20:8F8C: FA        .byte $FA
- D - I - 0x028F9D 20:8F8D: D0        .byte $D0	; <ペ>
- D - I - 0x028F9E 20:8F8E: 04        .byte $04	; <え>
- D - I - 0x028F9F 20:8F8F: 1E        .byte $1E	; <ほ>
- D - I - 0x028FA0 20:8F90: F6        .byte $F6
- D - I - 0x028FA1 20:8F91: 00        .byte $00
- D - I - 0x028FA2 20:8F92: F1        .byte $F1
- D - I - 0x028FA3 20:8F93: 00        .byte $00
- D - I - 0x028FA4 20:8F94: 3E        .byte $3E	; <Jr>
- D - I - 0x028FA5 20:8F95: 00        .byte $00
- D - I - 0x028FA6 20:8F96: CB        .byte $CB	; <ぺ>
- D - I - 0x028FA7 20:8F97: 05        .byte $05	; <お>
- D - I - 0x028FA8 20:8F98: F0        .byte $F0
off_8F99_2E:
- D - I - 0x028FA9 20:8F99: F5        .byte $F5
- D - I - 0x028FAA 20:8F9A: 81        .byte $81	; <A>
- D - I - 0x028FAB 20:8F9B: F4        .byte $F4
- D - I - 0x028FAC 20:8F9C: 24        .byte $24	; <や>
- D - I - 0x028FAD 20:8F9D: 25        .byte $25	; <ゆ>
- D - I - 0x028FAE 20:8F9E: 26        .byte $26	; <よ>
- D - I - 0x028FAF 20:8F9F: 4F        .byte $4F	; <ソ>
- D - I - 0x028FB0 20:8FA0: F1        .byte $F1
- D - I - 0x028FB1 20:8FA1: 9C        .byte $9C
- D - I - 0x028FB2 20:8FA2: 38        .byte $38	; <5>
- D - I - 0x028FB3 20:8FA3: 08        .byte $08	; <く>
- D - I - 0x028FB4 20:8FA4: BB        .byte $BB	; <ズ>
- D - I - 0x028FB5 20:8FA5: 01        .byte $01	; <あ>
- D - I - 0x028FB6 20:8FA6: F0        .byte $F0
off_8FA7_2F:
- D - I - 0x028FB7 20:8FA7: F5        .byte $F5
- D - I - 0x028FB8 20:8FA8: 09        .byte $09	; <け>
- D - I - 0x028FB9 20:8FA9: F4        .byte $F4
- D - I - 0x028FBA 20:8FAA: 04        .byte $04	; <え>
- D - I - 0x028FBB 20:8FAB: 05        .byte $05	; <お>
- D - I - 0x028FBC 20:8FAC: 00        .byte $00
- D - I - 0x028FBD 20:8FAD: 00        .byte $00
- D - I - 0x028FBE 20:8FAE: F7        .byte $F7
- D - I - 0x028FBF 20:8FAF: 03        .byte $03	; <う>
- D - I - 0x028FC0 20:8FB0: 7B        .byte $7B	; <。>
- D - I - 0x028FC1 20:8FB1: F1        .byte $F1
- D - I - 0x028FC2 20:8FB2: 00        .byte $00
- D - I - 0x028FC3 20:8FB3: 00        .byte $00
- D - I - 0x028FC4 20:8FB4: 80        .byte $80
- D - I - 0x028FC5 20:8FB5: FB        .byte $FB
- D - I - 0x028FC6 20:8FB6: 00        .byte $00
- D - I - 0x028FC7 20:8FB7: F1        .byte $F1
- D - I - 0x028FC8 20:8FB8: 88        .byte $88	; <H>
- D - I - 0x028FC9 20:8FB9: 71        .byte $71	; <ュ>
- D - I - 0x028FCA 20:8FBA: D0        .byte $D0	; <ペ>
- D - I - 0x028FCB 20:8FBB: C3        .byte $C3	; <バ>
- D - I - 0x028FCC 20:8FBC: 04        .byte $04	; <え>
- D - I - 0x028FCD 20:8FBD: F0        .byte $F0
off_8FBE_30:
- D - I - 0x028FCE 20:8FBE: F5        .byte $F5
- D - I - 0x028FCF 20:8FBF: 81        .byte $81	; <A>
- D - I - 0x028FD0 20:8FC0: F4        .byte $F4
- D - I - 0x028FD1 20:8FC1: 24        .byte $24	; <や>
- D - I - 0x028FD2 20:8FC2: 25        .byte $25	; <ゆ>
- D - I - 0x028FD3 20:8FC3: 26        .byte $26	; <よ>
- D - I - 0x028FD4 20:8FC4: 4F        .byte $4F	; <ソ>
- D - I - 0x028FD5 20:8FC5: F1        .byte $F1
- D - I - 0x028FD6 20:8FC6: 1F        .byte $1F	; <ま>
- D - I - 0x028FD7 20:8FC7: 3A        .byte $3A	; <7>
- D - I - 0x028FD8 20:8FC8: 08        .byte $08	; <く>
- D - I - 0x028FD9 20:8FC9: BB        .byte $BB	; <ズ>
- D - I - 0x028FDA 20:8FCA: 01        .byte $01	; <あ>
- D - I - 0x028FDB 20:8FCB: F0        .byte $F0
off_8FCC_31:
- D - I - 0x028FDC 20:8FCC: F5        .byte $F5
- D - I - 0x028FDD 20:8FCD: 81        .byte $81	; <A>
- D - I - 0x028FDE 20:8FCE: F4        .byte $F4
- D - I - 0x028FDF 20:8FCF: 24        .byte $24	; <や>
- D - I - 0x028FE0 20:8FD0: 25        .byte $25	; <ゆ>
- D - I - 0x028FE1 20:8FD1: 26        .byte $26	; <よ>
- D - I - 0x028FE2 20:8FD2: 4F        .byte $4F	; <ソ>
- D - I - 0x028FE3 20:8FD3: F1        .byte $F1
- D - I - 0x028FE4 20:8FD4: 04        .byte $04	; <え>
- D - I - 0x028FE5 20:8FD5: 0A        .byte $0A	; <こ>
- D - I - 0x028FE6 20:8FD6: 50        .byte $50	; <タ>
- D - I - 0x028FE7 20:8FD7: 03        .byte $03	; <う>
- D - I - 0x028FE8 20:8FD8: 02        .byte $02	; <い>
- D - I - 0x028FE9 20:8FD9: F1        .byte $F1
- D - I - 0x028FEA 20:8FDA: 03        .byte $03	; <う>
- D - I - 0x028FEB 20:8FDB: 09        .byte $09	; <け>
- D - I - 0x028FEC 20:8FDC: 10        .byte $10	; <た>
- D - I - 0x028FED 20:8FDD: B3        .byte $B3	; <ぼ>
- D - I - 0x028FEE 20:8FDE: 05        .byte $05	; <お>
- D - I - 0x028FEF 20:8FDF: F8        .byte $F8
- D - I - 0x028FF0 20:8FE0: A7 8B     .word off_8BA7
off_8FE2_32:
- D - I - 0x028FF2 20:8FE2: F5        .byte $F5
- D - I - 0x028FF3 20:8FE3: 09        .byte $09	; <け>
- D - I - 0x028FF4 20:8FE4: F4        .byte $F4
- D - I - 0x028FF5 20:8FE5: 04        .byte $04	; <え>
- D - I - 0x028FF6 20:8FE6: 05        .byte $05	; <お>
- D - I - 0x028FF7 20:8FE7: 00        .byte $00
- D - I - 0x028FF8 20:8FE8: 00        .byte $00
- D - I - 0x028FF9 20:8FE9: F7        .byte $F7
- D - I - 0x028FFA 20:8FEA: 03        .byte $03	; <う>
- D - I - 0x028FFB 20:8FEB: 7B        .byte $7B	; <。>
- D - I - 0x028FFC 20:8FEC: F1        .byte $F1
- D - I - 0x028FFD 20:8FED: 89        .byte $89	; <I>
- D - I - 0x028FFE 20:8FEE: 23        .byte $23	; <も>
- D - I - 0x028FFF 20:8FEF: C0        .byte $C0	; <ヅ>
- D - I - 0x029000 20:8FF0: 7B        .byte $7B	; <。>
- D - I - 0x029001 20:8FF1: 04        .byte $04	; <え>
- D - I - 0x029002 20:8FF2: F1        .byte $F1
- D - I - 0x029003 20:8FF3: 00        .byte $00
- D - I - 0x029004 20:8FF4: 00        .byte $00
- D - I - 0x029005 20:8FF5: 80        .byte $80
- D - I - 0x029006 20:8FF6: FB        .byte $FB
- D - I - 0x029007 20:8FF7: 00        .byte $00
- D - I - 0x029008 20:8FF8: F0        .byte $F0
off_8FF9_33:
- D - I - 0x029009 20:8FF9: F5        .byte $F5
- D - I - 0x02900A 20:8FFA: 81        .byte $81	; <A>
off_8FFB:
- D - I - 0x02900B 20:8FFB: F4        .byte $F4
- D - I - 0x02900C 20:8FFC: 08        .byte $08	; <く>
- D - I - 0x02900D 20:8FFD: 09        .byte $09	; <け>
- D - I - 0x02900E 20:8FFE: 0A        .byte $0A	; <こ>
- D - I - 0x02900F 20:8FFF: 0B        .byte $0B	; <さ>
- D - I - 0x029010 20:9000: F1        .byte $F1
- D - I - 0x029011 20:9001: 21        .byte $21	; <む>
- D - I - 0x029012 20:9002: 49        .byte $49	; <ケ>
- D - I - 0x029013 20:9003: 80        .byte $80
- D - I - 0x029014 20:9004: 8F        .byte $8F	; <S>
- D - I - 0x029015 20:9005: 00        .byte $00
- D - I - 0x029016 20:9006: F1        .byte $F1
- D - I - 0x029017 20:9007: 20        .byte $20	; <み>
- D - I - 0x029018 20:9008: 59        .byte $59	; <ノ>
- D - I - 0x029019 20:9009: 98        .byte $98
- D - I - 0x02901A 20:900A: BB        .byte $BB	; <ズ>
- D - I - 0x02901B 20:900B: 04        .byte $04	; <え>
- D - I - 0x02901C 20:900C: F1        .byte $F1
- D - I - 0x02901D 20:900D: 20        .byte $20	; <み>
- D - I - 0x02901E 20:900E: 5A        .byte $5A	; <ハ>
- D - I - 0x02901F 20:900F: 98        .byte $98
- D - I - 0x029020 20:9010: BB        .byte $BB	; <ズ>
- D - I - 0x029021 20:9011: 08        .byte $08	; <く>
- D - I - 0x029022 20:9012: F1        .byte $F1
- D - I - 0x029023 20:9013: 20        .byte $20	; <み>
- D - I - 0x029024 20:9014: 5B        .byte $5B	; <ヒ>
- D - I - 0x029025 20:9015: 98        .byte $98
- D - I - 0x029026 20:9016: BB        .byte $BB	; <ズ>
- D - I - 0x029027 20:9017: 0C        .byte $0C	; <し>
- D - I - 0x029028 20:9018: 2A        .byte $2A	; <れ>
- D - I - 0x029029 20:9019: F4        .byte $F4
- D - I - 0x02902A 20:901A: 16        .byte $16	; <に>
- D - I - 0x02902B 20:901B: 17        .byte $17	; <ぬ>
- D - I - 0x02902C 20:901C: 2D        .byte $2D	; <を>
- D - I - 0x02902D 20:901D: 53        .byte $53	; <テ>
- D - I - 0x02902E 20:901E: F6        .byte $F6
- D - I - 0x02902F 20:901F: 00        .byte $00
- D - I - 0x029030 20:9020: F6        .byte $F6
- D - I - 0x029031 20:9021: 2A        .byte $2A	; <れ>
- D - I - 0x029032 20:9022: F6        .byte $F6
- D - I - 0x029033 20:9023: 3F        .byte $3F	; <•>
- D - I - 0x029034 20:9024: F1        .byte $F1
- D - I - 0x029035 20:9025: 00        .byte $00
- D - I - 0x029036 20:9026: 45        .byte $45	; <オ>
- D - I - 0x029037 20:9027: 28        .byte $28	; <り>
- D - I - 0x029038 20:9028: C3        .byte $C3	; <バ>
- D - I - 0x029039 20:9029: 05        .byte $05	; <お>
- D - I - 0x02903A 20:902A: 04        .byte $04	; <え>
- D - I - 0x02903B 20:902B: F1        .byte $F1
- D - I - 0x02903C 20:902C: 23        .byte $23	; <も>
- D - I - 0x02903D 20:902D: 1A        .byte $1A	; <は>
- D - I - 0x02903E 20:902E: 58        .byte $58	; <ネ>
- D - I - 0x02903F 20:902F: EB        .byte $EB
- D - I - 0x029040 20:9030: 01        .byte $01	; <あ>
- D - I - 0x029041 20:9031: F1        .byte $F1
- D - I - 0x029042 20:9032: 22        .byte $22	; <め>
- D - I - 0x029043 20:9033: 18        .byte $18	; <ね>
- D - I - 0x029044 20:9034: 28        .byte $28	; <り>
- D - I - 0x029045 20:9035: C3        .byte $C3	; <バ>
- D - I - 0x029046 20:9036: 05        .byte $05	; <お>
- D - I - 0x029047 20:9037: F8        .byte $F8
- D - I - 0x029048 20:9038: A7 8B     .word off_8BA7
off_903A_34:
- D - I - 0x02904A 20:903A: F5        .byte $F5
- D - I - 0x02904B 20:903B: 81        .byte $81	; <A>
off_903C:
- D - I - 0x02904C 20:903C: F4        .byte $F4
- D - I - 0x02904D 20:903D: 0C        .byte $0C	; <し>
- D - I - 0x02904E 20:903E: 0D        .byte $0D	; <す>
- D - I - 0x02904F 20:903F: 0E        .byte $0E	; <せ>
- D - I - 0x029050 20:9040: 0F        .byte $0F	; <そ>
- D - I - 0x029051 20:9041: F7        .byte $F7
- D - I - 0x029052 20:9042: 03        .byte $03	; <う>
- D - I - 0x029053 20:9043: 7B        .byte $7B	; <。>
- D - I - 0x029054 20:9044: F1        .byte $F1
- D - I - 0x029055 20:9045: 00        .byte $00
- D - I - 0x029056 20:9046: 00        .byte $00
- D - I - 0x029057 20:9047: 80        .byte $80
- D - I - 0x029058 20:9048: FB        .byte $FB
- D - I - 0x029059 20:9049: 00        .byte $00
- D - I - 0x02905A 20:904A: F1        .byte $F1
- D - I - 0x02905B 20:904B: 9D        .byte $9D
- D - I - 0x02905C 20:904C: 1E        .byte $1E	; <ほ>
- D - I - 0x02905D 20:904D: 90        .byte $90	; <U>
- D - I - 0x02905E 20:904E: 97        .byte $97
- D - I - 0x02905F 20:904F: 04        .byte $04	; <え>
- D - I - 0x029060 20:9050: F1        .byte $F1
- D - I - 0x029061 20:9051: 24        .byte $24	; <や>
- D - I - 0x029062 20:9052: 1D        .byte $1D	; <へ>
- D - I - 0x029063 20:9053: 20        .byte $20	; <み>
- D - I - 0x029064 20:9054: C3        .byte $C3	; <バ>
- D - I - 0x029065 20:9055: 09        .byte $09	; <け>
- D - I - 0x029066 20:9056: 1E        .byte $1E	; <ほ>
- D - I - 0x029067 20:9057: F6        .byte $F6
- D - I - 0x029068 20:9058: 00        .byte $00
- D - I - 0x029069 20:9059: F6        .byte $F6
- D - I - 0x02906A 20:905A: 15        .byte $15	; <な>
- D - I - 0x02906B 20:905B: F1        .byte $F1
- D - I - 0x02906C 20:905C: 25        .byte $25	; <ゆ>
- D - I - 0x02906D 20:905D: 48        .byte $48	; <ク>
- D - I - 0x02906E 20:905E: 10        .byte $10	; <た>
- D - I - 0x02906F 20:905F: BB        .byte $BB	; <ズ>
- D - I - 0x029070 20:9060: 09        .byte $09	; <け>
- D - I - 0x029071 20:9061: 02        .byte $02	; <い>
- D - I - 0x029072 20:9062: F1        .byte $F1
- D - I - 0x029073 20:9063: 27        .byte $27	; <ら>
- D - I - 0x029074 20:9064: 1E        .byte $1E	; <ほ>
- D - I - 0x029075 20:9065: F4        .byte $F4
- D - I - 0x029076 20:9066: AB        .byte $AB	; <ぢ>
- D - I - 0x029077 20:9067: 04        .byte $04	; <え>
- D - I - 0x029078 20:9068: F1        .byte $F1
- D - I - 0x029079 20:9069: 26        .byte $26	; <よ>
- D - I - 0x02907A 20:906A: 21        .byte $21	; <む>
- D - I - 0x02907B 20:906B: 08        .byte $08	; <く>
- D - I - 0x02907C 20:906C: BB        .byte $BB	; <ズ>
- D - I - 0x02907D 20:906D: 09        .byte $09	; <け>
- D - I - 0x02907E 20:906E: F0        .byte $F0
off_906F_35:
- D - I - 0x02907F 20:906F: F5        .byte $F5
- D - I - 0x029080 20:9070: 81        .byte $81	; <A>
- D - I - 0x029081 20:9071: F4        .byte $F4
- D - I - 0x029082 20:9072: 24        .byte $24	; <や>
- D - I - 0x029083 20:9073: 25        .byte $25	; <ゆ>
- D - I - 0x029084 20:9074: 26        .byte $26	; <よ>
- D - I - 0x029085 20:9075: 4F        .byte $4F	; <ソ>
- D - I - 0x029086 20:9076: F1        .byte $F1
- D - I - 0x029087 20:9077: 0C        .byte $0C	; <し>
- D - I - 0x029088 20:9078: 0A        .byte $0A	; <こ>
- D - I - 0x029089 20:9079: 48        .byte $48	; <ク>
- D - I - 0x02908A 20:907A: FC        .byte $FC
- D - I - 0x02908B 20:907B: 00        .byte $00
- D - I - 0x02908C 20:907C: F1        .byte $F1
- D - I - 0x02908D 20:907D: DA        .byte $DA
- D - I - 0x02908E 20:907E: 09        .byte $09	; <け>
- D - I - 0x02908F 20:907F: 10        .byte $10	; <た>
- D - I - 0x029090 20:9080: B3        .byte $B3	; <ぼ>
- D - I - 0x029091 20:9081: 05        .byte $05	; <お>
- D - I - 0x029092 20:9082: F9        .byte $F9
- D - I - 0x029093 20:9083: 0F        .byte $0F	; <そ>
- D - I - 0x029094 20:9084: 01        .byte $01	; <あ>
- D - I - 0x029095 20:9085: FB        .byte $FB
- D - I - 0x029096 20:9086: 10        .byte $10	; <た>
- D - I - 0x029097 20:9087: 23        .byte $23	; <も>
- D - I - 0x029098 20:9088: 45        .byte $45	; <オ>
- D - I - 0x029099 20:9089: 01        .byte $01	; <あ>
- D - I - 0x02909A 20:908A: FB        .byte $FB
- D - I - 0x02909B 20:908B: 01        .byte $01	; <あ>
- D - I - 0x02909C 20:908C: 23        .byte $23	; <も>
- D - I - 0x02909D 20:908D: 45        .byte $45	; <オ>
- D - I - 0x02909E 20:908E: FA        .byte $FA
- D - I - 0x02909F 20:908F: F6        .byte $F6
- D - I - 0x0290A0 20:9090: 00        .byte $00
- D - I - 0x0290A1 20:9091: F1        .byte $F1
- D - I - 0x0290A2 20:9092: 00        .byte $00
- D - I - 0x0290A3 20:9093: 3B        .byte $3B	; <8>
- D - I - 0x0290A4 20:9094: FA        .byte $FA
- D - I - 0x0290A5 20:9095: BB        .byte $BB	; <ズ>
- D - I - 0x0290A6 20:9096: 04        .byte $04	; <え>
- D - I - 0x0290A7 20:9097: 04        .byte $04	; <え>
- D - I - 0x0290A8 20:9098: F1        .byte $F1
- D - I - 0x0290A9 20:9099: A6        .byte $A6	; <じ>
- D - I - 0x0290AA 20:909A: 0A        .byte $0A	; <こ>
- D - I - 0x0290AB 20:909B: F2        .byte $F2
- D - I - 0x0290AC 20:909C: BB        .byte $BB	; <ズ>
- D - I - 0x0290AD 20:909D: 00        .byte $00
- D - I - 0x0290AE 20:909E: F1        .byte $F1
- D - I - 0x0290AF 20:909F: 26        .byte $26	; <よ>
- D - I - 0x0290B0 20:90A0: 09        .byte $09	; <け>
- D - I - 0x0290B1 20:90A1: FA        .byte $FA
- D - I - 0x0290B2 20:90A2: BB        .byte $BB	; <ズ>
- D - I - 0x0290B3 20:90A3: 04        .byte $04	; <え>
- D - I - 0x0290B4 20:90A4: F0        .byte $F0
off_90A5_36:
- D - I - 0x0290B5 20:90A5: F5        .byte $F5
- D - I - 0x0290B6 20:90A6: 09        .byte $09	; <け>
- D - I - 0x0290B7 20:90A7: F4        .byte $F4
- D - I - 0x0290B8 20:90A8: 04        .byte $04	; <え>
- D - I - 0x0290B9 20:90A9: 05        .byte $05	; <お>
- D - I - 0x0290BA 20:90AA: 00        .byte $00
- D - I - 0x0290BB 20:90AB: 00        .byte $00
- D - I - 0x0290BC 20:90AC: F1        .byte $F1
- D - I - 0x0290BD 20:90AD: 8A        .byte $8A	; <N>
- D - I - 0x0290BE 20:90AE: BA        .byte $BA	; <ジ>
- D - I - 0x0290BF 20:90AF: 00        .byte $00
- D - I - 0x0290C0 20:90B0: EB        .byte $EB
- D - I - 0x0290C1 20:90B1: 01        .byte $01	; <あ>
- D - I - 0x0290C2 20:90B2: F0        .byte $F0
off_90B3_37:
- D - I - 0x0290C3 20:90B3: F5        .byte $F5
- D - I - 0x0290C4 20:90B4: 81        .byte $81	; <A>
- D - I - 0x0290C5 20:90B5: F4        .byte $F4
- D - I - 0x0290C6 20:90B6: 08        .byte $08	; <く>
- D - I - 0x0290C7 20:90B7: 09        .byte $09	; <け>
- D - I - 0x0290C8 20:90B8: 0A        .byte $0A	; <こ>
- D - I - 0x0290C9 20:90B9: 0B        .byte $0B	; <さ>
- D - I - 0x0290CA 20:90BA: F1        .byte $F1
- D - I - 0x0290CB 20:90BB: 54        .byte $54	; <ト>
- D - I - 0x0290CC 20:90BC: 4B        .byte $4B	; <サ>
- D - I - 0x0290CD 20:90BD: B0        .byte $B0	; <び>
- D - I - 0x0290CE 20:90BE: BB        .byte $BB	; <ズ>
- D - I - 0x0290CF 20:90BF: 01        .byte $01	; <あ>
- D - I - 0x0290D0 20:90C0: F1        .byte $F1
- D - I - 0x0290D1 20:90C1: 54        .byte $54	; <ト>
- D - I - 0x0290D2 20:90C2: 4D        .byte $4D	; <ス>
- D - I - 0x0290D3 20:90C3: B0        .byte $B0	; <び>
- D - I - 0x0290D4 20:90C4: BB        .byte $BB	; <ズ>
- D - I - 0x0290D5 20:90C5: 05        .byte $05	; <お>
- D - I - 0x0290D6 20:90C6: F1        .byte $F1
- D - I - 0x0290D7 20:90C7: 54        .byte $54	; <ト>
- D - I - 0x0290D8 20:90C8: 4F        .byte $4F	; <ソ>
- D - I - 0x0290D9 20:90C9: B0        .byte $B0	; <び>
- D - I - 0x0290DA 20:90CA: BB        .byte $BB	; <ズ>
- D - I - 0x0290DB 20:90CB: 09        .byte $09	; <け>
- D - I - 0x0290DC 20:90CC: F0        .byte $F0
off_90CD_38:
- D - I - 0x0290DD 20:90CD: F5        .byte $F5
- D - I - 0x0290DE 20:90CE: 80        .byte $80
- D - I - 0x0290DF 20:90CF: F8        .byte $F8
- D - I - 0x0290E0 20:90D0: FB 8F     .word off_8FFB
off_90D2_39:
- D - I - 0x0290E2 20:90D2: F5        .byte $F5
- D - I - 0x0290E3 20:90D3: 80        .byte $80
- D - I - 0x0290E4 20:90D4: F8        .byte $F8
- D - I - 0x0290E5 20:90D5: 3C 90     .word off_903C
off_90D7_3A:
- D - I - 0x0290E7 20:90D7: F5        .byte $F5
- D - I - 0x0290E8 20:90D8: 83        .byte $83	; <C>
- D - I - 0x0290E9 20:90D9: F4        .byte $F4
- D - I - 0x0290EA 20:90DA: 18        .byte $18	; <ね>
- D - I - 0x0290EB 20:90DB: 19        .byte $19	; <の>
- D - I - 0x0290EC 20:90DC: 1A        .byte $1A	; <は>
- D - I - 0x0290ED 20:90DD: 1B        .byte $1B	; <ひ>
- D - I - 0x0290EE 20:90DE: F7        .byte $F7
- D - I - 0x0290EF 20:90DF: 23        .byte $23	; <も>
- D - I - 0x0290F0 20:90E0: 5B        .byte $5B	; <ヒ>
- D - I - 0x0290F1 20:90E1: F1        .byte $F1
- D - I - 0x0290F2 20:90E2: 00        .byte $00
- D - I - 0x0290F3 20:90E3: 00        .byte $00
- D - I - 0x0290F4 20:90E4: 80        .byte $80
- D - I - 0x0290F5 20:90E5: A3        .byte $A3	; <げ>
- D - I - 0x0290F6 20:90E6: 00        .byte $00
- D - I - 0x0290F7 20:90E7: F1        .byte $F1
- D - I - 0x0290F8 20:90E8: 00        .byte $00
- D - I - 0x0290F9 20:90E9: 00        .byte $00
- D - I - 0x0290FA 20:90EA: 80        .byte $80
- D - I - 0x0290FB 20:90EB: DB        .byte $DB
- D - I - 0x0290FC 20:90EC: 04        .byte $04	; <え>
- D - I - 0x0290FD 20:90ED: F1        .byte $F1
- D - I - 0x0290FE 20:90EE: 00        .byte $00
- D - I - 0x0290FF 20:90EF: 70        .byte $70	; <ャ>
- D - I - 0x029100 20:90F0: 00        .byte $00
- D - I - 0x029101 20:90F1: BB        .byte $BB	; <ズ>
- D - I - 0x029102 20:90F2: 09        .byte $09	; <け>
- D - I - 0x029103 20:90F3: F1        .byte $F1
- D - I - 0x029104 20:90F4: E5        .byte $E5
- D - I - 0x029105 20:90F5: 1B        .byte $1B	; <ひ>
- D - I - 0x029106 20:90F6: 00        .byte $00
- D - I - 0x029107 20:90F7: BB        .byte $BB	; <ズ>
- D - I - 0x029108 20:90F8: 0D        .byte $0D	; <す>
- D - I - 0x029109 20:90F9: F1        .byte $F1
- D - I - 0x02910A 20:90FA: E6        .byte $E6
- D - I - 0x02910B 20:90FB: 1F        .byte $1F	; <ま>
- D - I - 0x02910C 20:90FC: 00        .byte $00
- D - I - 0x02910D 20:90FD: BB        .byte $BB	; <ズ>
- D - I - 0x02910E 20:90FE: 11        .byte $11	; <ち>
- D - I - 0x02910F 20:90FF: 96        .byte $96
- D - I - 0x029110 20:9100: F7        .byte $F7
- D - I - 0x029111 20:9101: 03        .byte $03	; <う>
- D - I - 0x029112 20:9102: 7B        .byte $7B	; <。>
- D - I - 0x029113 20:9103: F6        .byte $F6
- D - I - 0x029114 20:9104: 00        .byte $00
- D - I - 0x029115 20:9105: F6        .byte $F6
- D - I - 0x029116 20:9106: 15        .byte $15	; <な>
- D - I - 0x029117 20:9107: F6        .byte $F6
- D - I - 0x029118 20:9108: 3F        .byte $3F	; <•>
- D - I - 0x029119 20:9109: F6        .byte $F6
- D - I - 0x02911A 20:910A: 54        .byte $54	; <ト>
- D - I - 0x02911B 20:910B: F0        .byte $F0
off_910C_3B:
- D - I - 0x02911C 20:910C: F5        .byte $F5
- D - I - 0x02911D 20:910D: 80        .byte $80
- D - I - 0x02911E 20:910E: F4        .byte $F4
- D - I - 0x02911F 20:910F: 0C        .byte $0C	; <し>
- D - I - 0x029120 20:9110: 0D        .byte $0D	; <す>
- D - I - 0x029121 20:9111: 0E        .byte $0E	; <せ>
- D - I - 0x029122 20:9112: 0F        .byte $0F	; <そ>
- D - I - 0x029123 20:9113: F7        .byte $F7
- D - I - 0x029124 20:9114: 03        .byte $03	; <う>
- D - I - 0x029125 20:9115: 7B        .byte $7B	; <。>
- D - I - 0x029126 20:9116: F1        .byte $F1
- D - I - 0x029127 20:9117: 9E        .byte $9E
- D - I - 0x029128 20:9118: 1E        .byte $1E	; <ほ>
- D - I - 0x029129 20:9119: 68        .byte $68	; <リ>
- D - I - 0x02912A 20:911A: 93        .byte $93	; <Y>
- D - I - 0x02912B 20:911B: 05        .byte $05	; <お>
- D - I - 0x02912C 20:911C: F1        .byte $F1
- D - I - 0x02912D 20:911D: 28        .byte $28	; <り>
- D - I - 0x02912E 20:911E: 1C        .byte $1C	; <ふ>
- D - I - 0x02912F 20:911F: C8        .byte $C8	; <ぱ>
- D - I - 0x029130 20:9120: BB        .byte $BB	; <ズ>
- D - I - 0x029131 20:9121: 08        .byte $08	; <く>
- D - I - 0x029132 20:9122: 1E        .byte $1E	; <ほ>
- D - I - 0x029133 20:9123: F6        .byte $F6
- D - I - 0x029134 20:9124: 15        .byte $15	; <な>
- D - I - 0x029135 20:9125: F1        .byte $F1
- D - I - 0x029136 20:9126: 29        .byte $29	; <る>
- D - I - 0x029137 20:9127: 47        .byte $47	; <キ>
- D - I - 0x029138 20:9128: E0        .byte $E0
- D - I - 0x029139 20:9129: BB        .byte $BB	; <ズ>
- D - I - 0x02913A 20:912A: 08        .byte $08	; <く>
- D - I - 0x02913B 20:912B: 02        .byte $02	; <い>
- D - I - 0x02913C 20:912C: F1        .byte $F1
- D - I - 0x02913D 20:912D: 2A        .byte $2A	; <れ>
- D - I - 0x02913E 20:912E: 20        .byte $20	; <み>
- D - I - 0x02913F 20:912F: E8        .byte $E8
- D - I - 0x029140 20:9130: BB        .byte $BB	; <ズ>
- D - I - 0x029141 20:9131: 08        .byte $08	; <く>
off_9132:
- D - I - 0x029142 20:9132: F1        .byte $F1
- D - I - 0x029143 20:9133: 00        .byte $00
- D - I - 0x029144 20:9134: 00        .byte $00
- D - I - 0x029145 20:9135: 80        .byte $80
- D - I - 0x029146 20:9136: FB        .byte $FB
- D - I - 0x029147 20:9137: 00        .byte $00
- D - I - 0x029148 20:9138: F1        .byte $F1
- D - I - 0x029149 20:9139: 9F        .byte $9F
- D - I - 0x02914A 20:913A: 1E        .byte $1E	; <ほ>
- D - I - 0x02914B 20:913B: FC        .byte $FC
- D - I - 0x02914C 20:913C: AB        .byte $AB	; <ぢ>
- D - I - 0x02914D 20:913D: 04        .byte $04	; <え>
- D - I - 0x02914E 20:913E: F8        .byte $F8
- D - I - 0x02914F 20:913F: 4E 8E     .word off_8E4E
off_9141_3C:
- D - I - 0x029151 20:9141: F5        .byte $F5
- D - I - 0x029152 20:9142: 09        .byte $09	; <け>
- D - I - 0x029153 20:9143: F4        .byte $F4
- D - I - 0x029154 20:9144: 04        .byte $04	; <え>
- D - I - 0x029155 20:9145: 05        .byte $05	; <お>
- D - I - 0x029156 20:9146: 00        .byte $00
- D - I - 0x029157 20:9147: 00        .byte $00
- D - I - 0x029158 20:9148: F7        .byte $F7
- D - I - 0x029159 20:9149: 23        .byte $23	; <も>
- D - I - 0x02915A 20:914A: 5B        .byte $5B	; <ヒ>
- D - I - 0x02915B 20:914B: F1        .byte $F1
- D - I - 0x02915C 20:914C: 8D        .byte $8D	; <P>
- D - I - 0x02915D 20:914D: CF        .byte $CF	; <プ>
- D - I - 0x02915E 20:914E: 98        .byte $98
- D - I - 0x02915F 20:914F: C3        .byte $C3	; <バ>
- D - I - 0x029160 20:9150: 00        .byte $00
- D - I - 0x029161 20:9151: F0        .byte $F0
off_9152_3D:
- D - I - 0x029162 20:9152: F5        .byte $F5
- D - I - 0x029163 20:9153: 09        .byte $09	; <け>
- D - I - 0x029164 20:9154: F4        .byte $F4
- D - I - 0x029165 20:9155: 04        .byte $04	; <え>
- D - I - 0x029166 20:9156: 05        .byte $05	; <お>
- D - I - 0x029167 20:9157: 00        .byte $00
- D - I - 0x029168 20:9158: 00        .byte $00
- D - I - 0x029169 20:9159: F1        .byte $F1
- D - I - 0x02916A 20:915A: 00        .byte $00
- D - I - 0x02916B 20:915B: EC        .byte $EC
- D - I - 0x02916C 20:915C: 00        .byte $00
- D - I - 0x02916D 20:915D: C3        .byte $C3	; <バ>
- D - I - 0x02916E 20:915E: 01        .byte $01	; <あ>
- D - I - 0x02916F 20:915F: F0        .byte $F0
off_9160_3E:
- D - I - 0x029170 20:9160: F5        .byte $F5
- D - I - 0x029171 20:9161: 80        .byte $80
- D - I - 0x029172 20:9162: F4        .byte $F4
- D - I - 0x029173 20:9163: 1C        .byte $1C	; <ふ>
- D - I - 0x029174 20:9164: 1D        .byte $1D	; <へ>
- D - I - 0x029175 20:9165: 00        .byte $00
- D - I - 0x029176 20:9166: 00        .byte $00
- D - I - 0x029177 20:9167: F7        .byte $F7
- D - I - 0x029178 20:9168: 03        .byte $03	; <う>
- D - I - 0x029179 20:9169: 7B        .byte $7B	; <。>
- D - I - 0x02917A 20:916A: F1        .byte $F1
- D - I - 0x02917B 20:916B: 95        .byte $95
- D - I - 0x02917C 20:916C: 0C        .byte $0C	; <し>
- D - I - 0x02917D 20:916D: 7F        .byte $7F	; <,>
- D - I - 0x02917E 20:916E: 23        .byte $23	; <も>
- D - I - 0x02917F 20:916F: 07        .byte $07	; <き>
- D - I - 0x029180 20:9170: F1        .byte $F1
- D - I - 0x029181 20:9171: 00        .byte $00
- D - I - 0x029182 20:9172: 00        .byte $00
- D - I - 0x029183 20:9173: 80        .byte $80
- D - I - 0x029184 20:9174: FB        .byte $FB
- D - I - 0x029185 20:9175: 00        .byte $00
- D - I - 0x029186 20:9176: F0        .byte $F0
off_9177_3F:
- D - I - 0x029187 20:9177: F5        .byte $F5
- D - I - 0x029188 20:9178: 80        .byte $80
- D - I - 0x029189 20:9179: F4        .byte $F4
- D - I - 0x02918A 20:917A: 1C        .byte $1C	; <ふ>
- D - I - 0x02918B 20:917B: 1D        .byte $1D	; <へ>
- D - I - 0x02918C 20:917C: 00        .byte $00
- D - I - 0x02918D 20:917D: 00        .byte $00
- D - I - 0x02918E 20:917E: F7        .byte $F7
- D - I - 0x02918F 20:917F: 03        .byte $03	; <う>
- D - I - 0x029190 20:9180: 7B        .byte $7B	; <。>
- D - I - 0x029191 20:9181: F1        .byte $F1
- D - I - 0x029192 20:9182: 95        .byte $95
- D - I - 0x029193 20:9183: 0E        .byte $0E	; <せ>
- D - I - 0x029194 20:9184: 7F        .byte $7F	; <,>
- D - I - 0x029195 20:9185: 23        .byte $23	; <も>
- D - I - 0x029196 20:9186: 07        .byte $07	; <き>
- D - I - 0x029197 20:9187: F1        .byte $F1
- D - I - 0x029198 20:9188: 00        .byte $00
- D - I - 0x029199 20:9189: 00        .byte $00
- D - I - 0x02919A 20:918A: 80        .byte $80
- D - I - 0x02919B 20:918B: FB        .byte $FB
- D - I - 0x02919C 20:918C: 00        .byte $00
- D - I - 0x02919D 20:918D: F0        .byte $F0
off_918E_40:
- D - I - 0x02919E 20:918E: F5        .byte $F5
- D - I - 0x02919F 20:918F: 09        .byte $09	; <け>
- D - I - 0x0291A0 20:9190: F4        .byte $F4
- D - I - 0x0291A1 20:9191: 04        .byte $04	; <え>
- D - I - 0x0291A2 20:9192: 05        .byte $05	; <お>
- D - I - 0x0291A3 20:9193: 00        .byte $00
- D - I - 0x0291A4 20:9194: 00        .byte $00
- D - I - 0x0291A5 20:9195: F7        .byte $F7
- D - I - 0x0291A6 20:9196: 03        .byte $03	; <う>
- D - I - 0x0291A7 20:9197: 7B        .byte $7B	; <。>
- D - I - 0x0291A8 20:9198: F1        .byte $F1
- D - I - 0x0291A9 20:9199: 8F        .byte $8F	; <S>
- D - I - 0x0291AA 20:919A: BC        .byte $BC	; <ゼ>
- D - I - 0x0291AB 20:919B: A0        .byte $A0	; <が>
- D - I - 0x0291AC 20:919C: A3        .byte $A3	; <げ>
- D - I - 0x0291AD 20:919D: 04        .byte $04	; <え>
- D - I - 0x0291AE 20:919E: F1        .byte $F1
- D - I - 0x0291AF 20:919F: 00        .byte $00
- D - I - 0x0291B0 20:91A0: 00        .byte $00
- D - I - 0x0291B1 20:91A1: 78        .byte $78	; <?>
- D - I - 0x0291B2 20:91A2: FB        .byte $FB
- D - I - 0x0291B3 20:91A3: 00        .byte $00
- D - I - 0x0291B4 20:91A4: F0        .byte $F0
off_91A5_41:
- D - I - 0x0291B5 20:91A5: F5        .byte $F5
- D - I - 0x0291B6 20:91A6: 09        .byte $09	; <け>
- D - I - 0x0291B7 20:91A7: F4        .byte $F4
- D - I - 0x0291B8 20:91A8: 04        .byte $04	; <え>
- D - I - 0x0291B9 20:91A9: 05        .byte $05	; <お>
- D - I - 0x0291BA 20:91AA: 00        .byte $00
- D - I - 0x0291BB 20:91AB: 00        .byte $00
- D - I - 0x0291BC 20:91AC: F7        .byte $F7
- D - I - 0x0291BD 20:91AD: 03        .byte $03	; <う>
- D - I - 0x0291BE 20:91AE: 7B        .byte $7B	; <。>
- D - I - 0x0291BF 20:91AF: F1        .byte $F1
- D - I - 0x0291C0 20:91B0: 91        .byte $91	; <V>
- D - I - 0x0291C1 20:91B1: BC        .byte $BC	; <ゼ>
- D - I - 0x0291C2 20:91B2: C0        .byte $C0	; <ヅ>
- D - I - 0x0291C3 20:91B3: EB        .byte $EB
- D - I - 0x0291C4 20:91B4: 04        .byte $04	; <え>
- D - I - 0x0291C5 20:91B5: F1        .byte $F1
- D - I - 0x0291C6 20:91B6: 00        .byte $00
- D - I - 0x0291C7 20:91B7: 00        .byte $00
- D - I - 0x0291C8 20:91B8: 80        .byte $80
- D - I - 0x0291C9 20:91B9: FB        .byte $FB
- D - I - 0x0291CA 20:91BA: 00        .byte $00
- D - I - 0x0291CB 20:91BB: F0        .byte $F0
off_91BC_42:
- D - I - 0x0291CC 20:91BC: F5        .byte $F5
- D - I - 0x0291CD 20:91BD: 09        .byte $09	; <け>
- D - I - 0x0291CE 20:91BE: F4        .byte $F4
- D - I - 0x0291CF 20:91BF: 06        .byte $06	; <か>
- D - I - 0x0291D0 20:91C0: 00        .byte $00
- D - I - 0x0291D1 20:91C1: 00        .byte $00
- D - I - 0x0291D2 20:91C2: 00        .byte $00
- D - I - 0x0291D3 20:91C3: F1        .byte $F1
- D - I - 0x0291D4 20:91C4: 77        .byte $77	; <:>
- D - I - 0x0291D5 20:91C5: B4        .byte $B4	; <ガ>
- D - I - 0x0291D6 20:91C6: 40        .byte $40	; <「>
- D - I - 0x0291D7 20:91C7: EB        .byte $EB
- D - I - 0x0291D8 20:91C8: 01        .byte $01	; <あ>
- D - I - 0x0291D9 20:91C9: F0        .byte $F0
off_91CA_43:
- D - I - 0x0291DA 20:91CA: F5        .byte $F5
- D - I - 0x0291DB 20:91CB: 09        .byte $09	; <け>
- D - I - 0x0291DC 20:91CC: F4        .byte $F4
- D - I - 0x0291DD 20:91CD: 04        .byte $04	; <え>
- D - I - 0x0291DE 20:91CE: 05        .byte $05	; <お>
- D - I - 0x0291DF 20:91CF: 00        .byte $00
- D - I - 0x0291E0 20:91D0: 00        .byte $00
- D - I - 0x0291E1 20:91D1: F1        .byte $F1
- D - I - 0x0291E2 20:91D2: 00        .byte $00
- D - I - 0x0291E3 20:91D3: 34        .byte $34	; <1>
- D - I - 0x0291E4 20:91D4: 08        .byte $08	; <く>
- D - I - 0x0291E5 20:91D5: CB        .byte $CB	; <ぺ>
- D - I - 0x0291E6 20:91D6: 01        .byte $01	; <あ>
- D - I - 0x0291E7 20:91D7: F0        .byte $F0
off_91D8_44:
- D - I - 0x0291E8 20:91D8: F5        .byte $F5
- D - I - 0x0291E9 20:91D9: 09        .byte $09	; <け>
- D - I - 0x0291EA 20:91DA: F4        .byte $F4
- D - I - 0x0291EB 20:91DB: 3B        .byte $3B	; <8>
- D - I - 0x0291EC 20:91DC: 47        .byte $47	; <キ>
- D - I - 0x0291ED 20:91DD: 00        .byte $00
- D - I - 0x0291EE 20:91DE: 00        .byte $00
- D - I - 0x0291EF 20:91DF: F1        .byte $F1
- D - I - 0x0291F0 20:91E0: 00        .byte $00
- D - I - 0x0291F1 20:91E1: 35        .byte $35	; <2>
- D - I - 0x0291F2 20:91E2: 00        .byte $00
- D - I - 0x0291F3 20:91E3: CB        .byte $CB	; <ぺ>
- D - I - 0x0291F4 20:91E4: 01        .byte $01	; <あ>
- D - I - 0x0291F5 20:91E5: F0        .byte $F0
off_91E6_45:
- D - I - 0x0291F6 20:91E6: F5        .byte $F5
- D - I - 0x0291F7 20:91E7: 09        .byte $09	; <け>
- D - I - 0x0291F8 20:91E8: F4        .byte $F4
- D - I - 0x0291F9 20:91E9: 3B        .byte $3B	; <8>
- D - I - 0x0291FA 20:91EA: 47        .byte $47	; <キ>
- D - I - 0x0291FB 20:91EB: 00        .byte $00
- D - I - 0x0291FC 20:91EC: 00        .byte $00
- D - I - 0x0291FD 20:91ED: F1        .byte $F1
- D - I - 0x0291FE 20:91EE: 00        .byte $00
- D - I - 0x0291FF 20:91EF: 36        .byte $36	; <3>
- D - I - 0x029200 20:91F0: 00        .byte $00
- D - I - 0x029201 20:91F1: CB        .byte $CB	; <ぺ>
- D - I - 0x029202 20:91F2: 01        .byte $01	; <あ>
- D - I - 0x029203 20:91F3: F0        .byte $F0
off_91F4_46:
- D - I - 0x029204 20:91F4: F5        .byte $F5
- D - I - 0x029205 20:91F5: 0B        .byte $0B	; <さ>
- D - I - 0x029206 20:91F6: F4        .byte $F4
- D - I - 0x029207 20:91F7: 43        .byte $43	; <ウ>
- D - I - 0x029208 20:91F8: 45        .byte $45	; <オ>
- D - I - 0x029209 20:91F9: 47        .byte $47	; <キ>
- D - I - 0x02920A 20:91FA: 44        .byte $44	; <エ>
- D - I - 0x02920B 20:91FB: F1        .byte $F1
- D - I - 0x02920C 20:91FC: 00        .byte $00
- D - I - 0x02920D 20:91FD: 24        .byte $24	; <や>
- D - I - 0x02920E 20:91FE: F0        .byte $F0
- D - I - 0x02920F 20:91FF: BB        .byte $BB	; <ズ>
- D - I - 0x029210 20:9200: 00        .byte $00
- D - I - 0x029211 20:9201: F0        .byte $F0
off_9202_47:
- D - I - 0x029212 20:9202: F5        .byte $F5
- D - I - 0x029213 20:9203: 0B        .byte $0B	; <さ>
- D - I - 0x029214 20:9204: F4        .byte $F4
- D - I - 0x029215 20:9205: 43        .byte $43	; <ウ>
- D - I - 0x029216 20:9206: 45        .byte $45	; <オ>
- D - I - 0x029217 20:9207: 47        .byte $47	; <キ>
- D - I - 0x029218 20:9208: 44        .byte $44	; <エ>
- D - I - 0x029219 20:9209: F1        .byte $F1
- D - I - 0x02921A 20:920A: 00        .byte $00
- D - I - 0x02921B 20:920B: 25        .byte $25	; <ゆ>
- D - I - 0x02921C 20:920C: F0        .byte $F0
- D - I - 0x02921D 20:920D: BB        .byte $BB	; <ズ>
- D - I - 0x02921E 20:920E: 00        .byte $00
- D - I - 0x02921F 20:920F: F0        .byte $F0
off_9210_48:
- D - I - 0x029220 20:9210: F5        .byte $F5
- D - I - 0x029221 20:9211: 0B        .byte $0B	; <さ>
- D - I - 0x029222 20:9212: F4        .byte $F4
- D - I - 0x029223 20:9213: 43        .byte $43	; <ウ>
- D - I - 0x029224 20:9214: 45        .byte $45	; <オ>
- D - I - 0x029225 20:9215: 47        .byte $47	; <キ>
- D - I - 0x029226 20:9216: 44        .byte $44	; <エ>
- D - I - 0x029227 20:9217: F1        .byte $F1
- D - I - 0x029228 20:9218: 00        .byte $00
- D - I - 0x029229 20:9219: 26        .byte $26	; <よ>
- D - I - 0x02922A 20:921A: F0        .byte $F0
- D - I - 0x02922B 20:921B: BB        .byte $BB	; <ズ>
- D - I - 0x02922C 20:921C: 00        .byte $00
- D - I - 0x02922D 20:921D: F0        .byte $F0
off_921E_49:
- D - I - 0x02922E 20:921E: F5        .byte $F5
- D - I - 0x02922F 20:921F: 81        .byte $81	; <A>
- D - I - 0x029230 20:9220: F4        .byte $F4
- D - I - 0x029231 20:9221: 04        .byte $04	; <え>
- D - I - 0x029232 20:9222: 05        .byte $05	; <お>
- D - I - 0x029233 20:9223: 0F        .byte $0F	; <そ>
- D - I - 0x029234 20:9224: 00        .byte $00
- D - I - 0x029235 20:9225: F1        .byte $F1
- D - I - 0x029236 20:9226: 32        .byte $32	; <ょ>
- D - I - 0x029237 20:9227: C0        .byte $C0	; <ヅ>
- D - I - 0x029238 20:9228: 88        .byte $88	; <H>
- D - I - 0x029239 20:9229: E3        .byte $E3
- D - I - 0x02923A 20:922A: 00        .byte $00
- D - I - 0x02923B 20:922B: F1        .byte $F1
- D - I - 0x02923C 20:922C: 07        .byte $07	; <き>
- D - I - 0x02923D 20:922D: 2B        .byte $2B	; <ろ>
- D - I - 0x02923E 20:922E: 50        .byte $50	; <タ>
- D - I - 0x02923F 20:922F: DB        .byte $DB
- D - I - 0x029240 20:9230: 05        .byte $05	; <お>
- D - I - 0x029241 20:9231: F0        .byte $F0
off_9232_4A:
- D - I - 0x029242 20:9232: F5        .byte $F5
- D - I - 0x029243 20:9233: 81        .byte $81	; <A>
- D - I - 0x029244 20:9234: F4        .byte $F4
- D - I - 0x029245 20:9235: 0C        .byte $0C	; <し>
- D - I - 0x029246 20:9236: 0D        .byte $0D	; <す>
- D - I - 0x029247 20:9237: 0E        .byte $0E	; <せ>
- D - I - 0x029248 20:9238: 0F        .byte $0F	; <そ>
- D - I - 0x029249 20:9239: F1        .byte $F1
- D - I - 0x02924A 20:923A: 29        .byte $29	; <る>
- D - I - 0x02924B 20:923B: 3F        .byte $3F	; <•>
- D - I - 0x02924C 20:923C: F8        .byte $F8
- D - I - 0x02924D 20:923D: B3        .byte $B3	; <ぼ>
- D - I - 0x02924E 20:923E: 04        .byte $04	; <え>
- D - I - 0x02924F 20:923F: F0        .byte $F0
off_9240_4B:
- D - I - 0x029250 20:9240: F5        .byte $F5
- D - I - 0x029251 20:9241: 80        .byte $80
- D - I - 0x029252 20:9242: F8        .byte $F8
- D - I - 0x029253 20:9243: 48 9C     .word off_9C48
off_9245_4C:
- D - I - 0x029255 20:9245: F5        .byte $F5
- D - I - 0x029256 20:9246: 09        .byte $09	; <け>
- D - I - 0x029257 20:9247: F4        .byte $F4
- D - I - 0x029258 20:9248: 04        .byte $04	; <え>
- D - I - 0x029259 20:9249: 05        .byte $05	; <お>
- D - I - 0x02925A 20:924A: 00        .byte $00
- D - I - 0x02925B 20:924B: 00        .byte $00
- D - I - 0x02925C 20:924C: F1        .byte $F1
- D - I - 0x02925D 20:924D: 7E        .byte $7E	; <.>
- D - I - 0x02925E 20:924E: BA        .byte $BA	; <ジ>
- D - I - 0x02925F 20:924F: E0        .byte $E0
- D - I - 0x029260 20:9250: BB        .byte $BB	; <ズ>
- D - I - 0x029261 20:9251: 00        .byte $00
- D - I - 0x029262 20:9252: F0        .byte $F0
off_9253_4D:
- D - I - 0x029263 20:9253: F5        .byte $F5
- D - I - 0x029264 20:9254: 83        .byte $83	; <C>
- D - I - 0x029265 20:9255: F4        .byte $F4
- D - I - 0x029266 20:9256: 1B        .byte $1B	; <ひ>
- D - I - 0x029267 20:9257: 00        .byte $00
- D - I - 0x029268 20:9258: 00        .byte $00
- D - I - 0x029269 20:9259: 00        .byte $00
- D - I - 0x02926A 20:925A: F1        .byte $F1
- D - I - 0x02926B 20:925B: 00        .byte $00
- D - I - 0x02926C 20:925C: 2C        .byte $2C	; <わ>
- D - I - 0x02926D 20:925D: 00        .byte $00
- D - I - 0x02926E 20:925E: BB        .byte $BB	; <ズ>
- D - I - 0x02926F 20:925F: 01        .byte $01	; <あ>
- D - I - 0x029270 20:9260: F0        .byte $F0
off_9261_4E:
- D - I - 0x029271 20:9261: F5        .byte $F5
- D - I - 0x029272 20:9262: 0A        .byte $0A	; <こ>
- D - I - 0x029273 20:9263: F4        .byte $F4
- D - I - 0x029274 20:9264: 2C        .byte $2C	; <わ>
- D - I - 0x029275 20:9265: 0B        .byte $0B	; <さ>
- D - I - 0x029276 20:9266: 05        .byte $05	; <お>
- D - I - 0x029277 20:9267: 07        .byte $07	; <き>
- D - I - 0x029278 20:9268: F1        .byte $F1
- D - I - 0x029279 20:9269: 00        .byte $00
- D - I - 0x02927A 20:926A: 27        .byte $27	; <ら>
- D - I - 0x02927B 20:926B: 10        .byte $10	; <た>
- D - I - 0x02927C 20:926C: CB        .byte $CB	; <ぺ>
- D - I - 0x02927D 20:926D: 01        .byte $01	; <あ>
- D - I - 0x02927E 20:926E: F0        .byte $F0
off_926F_4F:
- D - I - 0x02927F 20:926F: F5        .byte $F5
- D - I - 0x029280 20:9270: 09        .byte $09	; <け>
- D - I - 0x029281 20:9271: F4        .byte $F4
- D - I - 0x029282 20:9272: 04        .byte $04	; <え>
- D - I - 0x029283 20:9273: 05        .byte $05	; <お>
- D - I - 0x029284 20:9274: 00        .byte $00
- D - I - 0x029285 20:9275: 00        .byte $00
- D - I - 0x029286 20:9276: F1        .byte $F1
- D - I - 0x029287 20:9277: 35        .byte $35	; <2>
- D - I - 0x029288 20:9278: 28        .byte $28	; <り>
- D - I - 0x029289 20:9279: 00        .byte $00
- D - I - 0x02928A 20:927A: B7        .byte $B7	; <ゲ>
- D - I - 0x02928B 20:927B: 01        .byte $01	; <あ>
- D - I - 0x02928C 20:927C: F0        .byte $F0
off_927D_50:
- D - I - 0x02928D 20:927D: F5        .byte $F5
- D - I - 0x02928E 20:927E: 81        .byte $81	; <A>
- D - I - 0x02928F 20:927F: F4        .byte $F4
- D - I - 0x029290 20:9280: 28        .byte $28	; <り>
- D - I - 0x029291 20:9281: 29        .byte $29	; <る>
- D - I - 0x029292 20:9282: 2A        .byte $2A	; <れ>
- D - I - 0x029293 20:9283: 0B        .byte $0B	; <さ>
- D - I - 0x029294 20:9284: F1        .byte $F1
- D - I - 0x029295 20:9285: 00        .byte $00
- D - I - 0x029296 20:9286: 11        .byte $11	; <ち>
- D - I - 0x029297 20:9287: E8        .byte $E8
- D - I - 0x029298 20:9288: BB        .byte $BB	; <ズ>
- D - I - 0x029299 20:9289: 00        .byte $00
- D - I - 0x02929A 20:928A: F0        .byte $F0
off_928B_51:
- D - I - 0x02929B 20:928B: F5        .byte $F5
- D - I - 0x02929C 20:928C: 09        .byte $09	; <け>
- D - I - 0x02929D 20:928D: F4        .byte $F4
- D - I - 0x02929E 20:928E: 04        .byte $04	; <え>
- D - I - 0x02929F 20:928F: 05        .byte $05	; <お>
- D - I - 0x0292A0 20:9290: 00        .byte $00
- D - I - 0x0292A1 20:9291: 00        .byte $00
- D - I - 0x0292A2 20:9292: F1        .byte $F1
- D - I - 0x0292A3 20:9293: 00        .byte $00
- D - I - 0x0292A4 20:9294: 00        .byte $00
- D - I - 0x0292A5 20:9295: 80        .byte $80
- D - I - 0x0292A6 20:9296: FB        .byte $FB
- D - I - 0x0292A7 20:9297: 00        .byte $00
- D - I - 0x0292A8 20:9298: F1        .byte $F1
- D - I - 0x0292A9 20:9299: E8        .byte $E8
- D - I - 0x0292AA 20:929A: BA        .byte $BA	; <ジ>
- D - I - 0x0292AB 20:929B: FC        .byte $FC
- D - I - 0x0292AC 20:929C: C3        .byte $C3	; <バ>
- D - I - 0x0292AD 20:929D: 04        .byte $04	; <え>
- D - I - 0x0292AE 20:929E: F0        .byte $F0
off_929F_52:
- D - I - 0x0292AF 20:929F: F5        .byte $F5
- D - I - 0x0292B0 20:92A0: 09        .byte $09	; <け>
- D - I - 0x0292B1 20:92A1: F4        .byte $F4
- D - I - 0x0292B2 20:92A2: 04        .byte $04	; <え>
- D - I - 0x0292B3 20:92A3: 05        .byte $05	; <お>
- D - I - 0x0292B4 20:92A4: 00        .byte $00
- D - I - 0x0292B5 20:92A5: 00        .byte $00
- D - I - 0x0292B6 20:92A6: F1        .byte $F1
- D - I - 0x0292B7 20:92A7: 7A        .byte $7A	; <、>
- D - I - 0x0292B8 20:92A8: BD        .byte $BD	; <ゾ>
- D - I - 0x0292B9 20:92A9: E0        .byte $E0
- D - I - 0x0292BA 20:92AA: E3        .byte $E3
- D - I - 0x0292BB 20:92AB: 00        .byte $00
- D - I - 0x0292BC 20:92AC: F0        .byte $F0
off_92AD_53:
- - - - - 0x0292BD 20:92AD: F5        .byte $F5
- - - - - 0x0292BE 20:92AE: 09        .byte $09	; <け>
- - - - - 0x0292BF 20:92AF: F4        .byte $F4
- - - - - 0x0292C0 20:92B0: 04        .byte $04	; <え>
- - - - - 0x0292C1 20:92B1: 05        .byte $05	; <お>
- - - - - 0x0292C2 20:92B2: 00        .byte $00
- - - - - 0x0292C3 20:92B3: 00        .byte $00
- - - - - 0x0292C4 20:92B4: F1        .byte $F1
- - - - - 0x0292C5 20:92B5: 7B        .byte $7B	; <。>
- - - - - 0x0292C6 20:92B6: BC        .byte $BC	; <ゼ>
- - - - - 0x0292C7 20:92B7: A8        .byte $A8	; <ぜ>
- - - - - 0x0292C8 20:92B8: EB        .byte $EB
- - - - - 0x0292C9 20:92B9: 00        .byte $00
- - - - - 0x0292CA 20:92BA: F0        .byte $F0
off_92BB_54:
- - - - - 0x0292CB 20:92BB: F5        .byte $F5
- - - - - 0x0292CC 20:92BC: 09        .byte $09	; <け>
- - - - - 0x0292CD 20:92BD: F4        .byte $F4
- - - - - 0x0292CE 20:92BE: 04        .byte $04	; <え>
- - - - - 0x0292CF 20:92BF: 05        .byte $05	; <お>
- - - - - 0x0292D0 20:92C0: 00        .byte $00
- - - - - 0x0292D1 20:92C1: 00        .byte $00
- - - - - 0x0292D2 20:92C2: F1        .byte $F1
- - - - - 0x0292D3 20:92C3: 7F        .byte $7F	; <,>
- - - - - 0x0292D4 20:92C4: C0        .byte $C0	; <ヅ>
- - - - - 0x0292D5 20:92C5: 60        .byte $60	; <ミ>
- - - - - 0x0292D6 20:92C6: A3        .byte $A3	; <げ>
- - - - - 0x0292D7 20:92C7: 01        .byte $01	; <あ>
- - - - - 0x0292D8 20:92C8: F0        .byte $F0
off_92C9_55:
- D - I - 0x0292D9 20:92C9: F5        .byte $F5
- D - I - 0x0292DA 20:92CA: 09        .byte $09	; <け>
- D - I - 0x0292DB 20:92CB: F4        .byte $F4
- D - I - 0x0292DC 20:92CC: 04        .byte $04	; <え>
- D - I - 0x0292DD 20:92CD: 05        .byte $05	; <お>
- D - I - 0x0292DE 20:92CE: 00        .byte $00
- D - I - 0x0292DF 20:92CF: 00        .byte $00
- D - I - 0x0292E0 20:92D0: F1        .byte $F1
- D - I - 0x0292E1 20:92D1: 80        .byte $80
- D - I - 0x0292E2 20:92D2: C0        .byte $C0	; <ヅ>
- D - I - 0x0292E3 20:92D3: E0        .byte $E0
- D - I - 0x0292E4 20:92D4: A3        .byte $A3	; <げ>
- D - I - 0x0292E5 20:92D5: 00        .byte $00
- D - I - 0x0292E6 20:92D6: F0        .byte $F0
off_92D7_56:
- D - I - 0x0292E7 20:92D7: F5        .byte $F5
- D - I - 0x0292E8 20:92D8: 09        .byte $09	; <け>
- D - I - 0x0292E9 20:92D9: F4        .byte $F4
- D - I - 0x0292EA 20:92DA: 04        .byte $04	; <え>
- D - I - 0x0292EB 20:92DB: 05        .byte $05	; <お>
- D - I - 0x0292EC 20:92DC: 00        .byte $00
- D - I - 0x0292ED 20:92DD: 00        .byte $00
- D - I - 0x0292EE 20:92DE: F1        .byte $F1
- D - I - 0x0292EF 20:92DF: 7C        .byte $7C	; <~>
- D - I - 0x0292F0 20:92E0: BA        .byte $BA	; <ジ>
- D - I - 0x0292F1 20:92E1: 90        .byte $90	; <U>
- D - I - 0x0292F2 20:92E2: AB        .byte $AB	; <ぢ>
- D - I - 0x0292F3 20:92E3: 00        .byte $00
- D - I - 0x0292F4 20:92E4: F0        .byte $F0
off_92E5_57:
- D - I - 0x0292F5 20:92E5: F5        .byte $F5
- D - I - 0x0292F6 20:92E6: 83        .byte $83	; <C>
- D - I - 0x0292F7 20:92E7: F4        .byte $F4
- D - I - 0x0292F8 20:92E8: 2A        .byte $2A	; <れ>
- D - I - 0x0292F9 20:92E9: 2B        .byte $2B	; <ろ>
- D - I - 0x0292FA 20:92EA: 00        .byte $00
- D - I - 0x0292FB 20:92EB: 00        .byte $00
- D - I - 0x0292FC 20:92EC: F1        .byte $F1
- D - I - 0x0292FD 20:92ED: 36        .byte $36	; <3>
- D - I - 0x0292FE 20:92EE: 02        .byte $02	; <い>
- D - I - 0x0292FF 20:92EF: 10        .byte $10	; <た>
- D - I - 0x029300 20:92F0: D3        .byte $D3
- D - I - 0x029301 20:92F1: 01        .byte $01	; <あ>
- D - I - 0x029302 20:92F2: F0        .byte $F0
off_92F3_58:
- D - I - 0x029303 20:92F3: F5        .byte $F5
- D - I - 0x029304 20:92F4: 81        .byte $81	; <A>
- D - I - 0x029305 20:92F5: F4        .byte $F4
- D - I - 0x029306 20:92F6: 08        .byte $08	; <く>
- D - I - 0x029307 20:92F7: 09        .byte $09	; <け>
- D - I - 0x029308 20:92F8: 0A        .byte $0A	; <こ>
- D - I - 0x029309 20:92F9: 0B        .byte $0B	; <さ>
- D - I - 0x02930A 20:92FA: F1        .byte $F1
- D - I - 0x02930B 20:92FB: 98        .byte $98
- D - I - 0x02930C 20:92FC: 4B        .byte $4B	; <サ>
- D - I - 0x02930D 20:92FD: 90        .byte $90	; <U>
- D - I - 0x02930E 20:92FE: B3        .byte $B3	; <ぼ>
- D - I - 0x02930F 20:92FF: 01        .byte $01	; <あ>
- D - I - 0x029310 20:9300: F1        .byte $F1
- D - I - 0x029311 20:9301: 98        .byte $98
- D - I - 0x029312 20:9302: 4D        .byte $4D	; <ス>
- D - I - 0x029313 20:9303: 90        .byte $90	; <U>
- D - I - 0x029314 20:9304: B3        .byte $B3	; <ぼ>
- D - I - 0x029315 20:9305: 05        .byte $05	; <お>
- D - I - 0x029316 20:9306: F1        .byte $F1
- D - I - 0x029317 20:9307: 98        .byte $98
- D - I - 0x029318 20:9308: 4F        .byte $4F	; <ソ>
- D - I - 0x029319 20:9309: 90        .byte $90	; <U>
- D - I - 0x02931A 20:930A: B3        .byte $B3	; <ぼ>
- D - I - 0x02931B 20:930B: 09        .byte $09	; <け>
- D - I - 0x02931C 20:930C: F0        .byte $F0
off_930D_59:
- - - - - 0x02931D 20:930D: F5        .byte $F5
- - - - - 0x02931E 20:930E: 83        .byte $83	; <C>
- - - - - 0x02931F 20:930F: F4        .byte $F4
- - - - - 0x029320 20:9310: 18        .byte $18	; <ね>
- - - - - 0x029321 20:9311: 19        .byte $19	; <の>
- - - - - 0x029322 20:9312: 1A        .byte $1A	; <は>
- - - - - 0x029323 20:9313: 1B        .byte $1B	; <ひ>
- - - - - 0x029324 20:9314: F1        .byte $F1
- - - - - 0x029325 20:9315: E3        .byte $E3
- - - - - 0x029326 20:9316: 15        .byte $15	; <な>
- - - - - 0x029327 20:9317: 64        .byte $64	; <ヤ>
- - - - - 0x029328 20:9318: EF        .byte $EF
- - - - - 0x029329 20:9319: 00        .byte $00
- - - - - 0x02932A 20:931A: F1        .byte $F1
- - - - - 0x02932B 20:931B: 9A        .byte $9A
- - - - - 0x02932C 20:931C: 14        .byte $14	; <と>
- - - - - 0x02932D 20:931D: D0        .byte $D0	; <ペ>
- - - - - 0x02932E 20:931E: B3        .byte $B3	; <ぼ>
- - - - - 0x02932F 20:931F: 04        .byte $04	; <え>
- - - - - 0x029330 20:9320: F8        .byte $F8
- - - - - 0x029331 20:9321: A7 8B     .word off_8BA7
off_9323_5A:
- D - I - 0x029333 20:9323: F5        .byte $F5
- D - I - 0x029334 20:9324: 81        .byte $81	; <A>
- D - I - 0x029335 20:9325: F4        .byte $F4
- D - I - 0x029336 20:9326: 08        .byte $08	; <く>
- D - I - 0x029337 20:9327: 09        .byte $09	; <け>
- D - I - 0x029338 20:9328: 0A        .byte $0A	; <こ>
- D - I - 0x029339 20:9329: 0B        .byte $0B	; <さ>
- D - I - 0x02933A 20:932A: F1        .byte $F1
- D - I - 0x02933B 20:932B: 8B        .byte $8B	; <K>
- D - I - 0x02933C 20:932C: 4B        .byte $4B	; <サ>
- D - I - 0x02933D 20:932D: 80        .byte $80
- D - I - 0x02933E 20:932E: BB        .byte $BB	; <ズ>
- D - I - 0x02933F 20:932F: 01        .byte $01	; <あ>
- D - I - 0x029340 20:9330: F1        .byte $F1
- D - I - 0x029341 20:9331: 8B        .byte $8B	; <K>
- D - I - 0x029342 20:9332: 4D        .byte $4D	; <ス>
- D - I - 0x029343 20:9333: 80        .byte $80
- D - I - 0x029344 20:9334: BB        .byte $BB	; <ズ>
- D - I - 0x029345 20:9335: 05        .byte $05	; <お>
- D - I - 0x029346 20:9336: F1        .byte $F1
- D - I - 0x029347 20:9337: 8B        .byte $8B	; <K>
- D - I - 0x029348 20:9338: 4F        .byte $4F	; <ソ>
- D - I - 0x029349 20:9339: 80        .byte $80
- D - I - 0x02934A 20:933A: BB        .byte $BB	; <ズ>
- D - I - 0x02934B 20:933B: 09        .byte $09	; <け>
- D - I - 0x02934C 20:933C: F0        .byte $F0
off_933D_5B:
- D - I - 0x02934D 20:933D: F5        .byte $F5
- D - I - 0x02934E 20:933E: 81        .byte $81	; <A>
- D - I - 0x02934F 20:933F: F4        .byte $F4
- D - I - 0x029350 20:9340: 08        .byte $08	; <く>
- D - I - 0x029351 20:9341: 09        .byte $09	; <け>
- D - I - 0x029352 20:9342: 0A        .byte $0A	; <こ>
- D - I - 0x029353 20:9343: 0B        .byte $0B	; <さ>
- D - I - 0x029354 20:9344: F1        .byte $F1
- D - I - 0x029355 20:9345: 8C        .byte $8C	; <M>
- D - I - 0x029356 20:9346: 4B        .byte $4B	; <サ>
- D - I - 0x029357 20:9347: 80        .byte $80
- D - I - 0x029358 20:9348: BB        .byte $BB	; <ズ>
- D - I - 0x029359 20:9349: 01        .byte $01	; <あ>
- D - I - 0x02935A 20:934A: F1        .byte $F1
- D - I - 0x02935B 20:934B: 8C        .byte $8C	; <M>
- D - I - 0x02935C 20:934C: 4D        .byte $4D	; <ス>
- D - I - 0x02935D 20:934D: 80        .byte $80
- D - I - 0x02935E 20:934E: BB        .byte $BB	; <ズ>
- D - I - 0x02935F 20:934F: 05        .byte $05	; <お>
- D - I - 0x029360 20:9350: F1        .byte $F1
- D - I - 0x029361 20:9351: 8C        .byte $8C	; <M>
- D - I - 0x029362 20:9352: 4F        .byte $4F	; <ソ>
- D - I - 0x029363 20:9353: 80        .byte $80
- D - I - 0x029364 20:9354: BB        .byte $BB	; <ズ>
- D - I - 0x029365 20:9355: 09        .byte $09	; <け>
- D - I - 0x029366 20:9356: F0        .byte $F0
off_9357_5C:
- D - I - 0x029367 20:9357: F5        .byte $F5
- D - I - 0x029368 20:9358: 80        .byte $80
- D - I - 0x029369 20:9359: F4        .byte $F4
- D - I - 0x02936A 20:935A: 08        .byte $08	; <く>
- D - I - 0x02936B 20:935B: 09        .byte $09	; <け>
- D - I - 0x02936C 20:935C: 0A        .byte $0A	; <こ>
- D - I - 0x02936D 20:935D: 0B        .byte $0B	; <さ>
- D - I - 0x02936E 20:935E: F1        .byte $F1
- D - I - 0x02936F 20:935F: 00        .byte $00
- D - I - 0x029370 20:9360: CD        .byte $CD	; <パ>
- D - I - 0x029371 20:9361: 00        .byte $00
- D - I - 0x029372 20:9362: C3        .byte $C3	; <バ>
- D - I - 0x029373 20:9363: 0D        .byte $0D	; <す>
- D - I - 0x029374 20:9364: F1        .byte $F1
- D - I - 0x029375 20:9365: 00        .byte $00
- D - I - 0x029376 20:9366: CA        .byte $CA	; <ぷ>
- D - I - 0x029377 20:9367: 00        .byte $00
- D - I - 0x029378 20:9368: C3        .byte $C3	; <バ>
- D - I - 0x029379 20:9369: 01        .byte $01	; <あ>
- D - I - 0x02937A 20:936A: F1        .byte $F1
- D - I - 0x02937B 20:936B: 00        .byte $00
- D - I - 0x02937C 20:936C: CB        .byte $CB	; <ぺ>
- D - I - 0x02937D 20:936D: 00        .byte $00
- D - I - 0x02937E 20:936E: C3        .byte $C3	; <バ>
- D - I - 0x02937F 20:936F: 05        .byte $05	; <お>
- D - I - 0x029380 20:9370: F0        .byte $F0
off_9371_5D:
- D - I - 0x029381 20:9371: F5        .byte $F5
- D - I - 0x029382 20:9372: 09        .byte $09	; <け>
- D - I - 0x029383 20:9373: F4        .byte $F4
- D - I - 0x029384 20:9374: 04        .byte $04	; <え>
- D - I - 0x029385 20:9375: 05        .byte $05	; <お>
- D - I - 0x029386 20:9376: 00        .byte $00
- D - I - 0x029387 20:9377: 00        .byte $00
- D - I - 0x029388 20:9378: F1        .byte $F1
- D - I - 0x029389 20:9379: 93        .byte $93	; <Y>
- D - I - 0x02938A 20:937A: C4        .byte $C4	; <ビ>
- D - I - 0x02938B 20:937B: A0        .byte $A0	; <が>
- D - I - 0x02938C 20:937C: A3        .byte $A3	; <げ>
- D - I - 0x02938D 20:937D: 00        .byte $00
- D - I - 0x02938E 20:937E: F0        .byte $F0
off_937F_5E:
- D - I - 0x02938F 20:937F: F5        .byte $F5
- D - I - 0x029390 20:9380: 09        .byte $09	; <け>
- D - I - 0x029391 20:9381: F4        .byte $F4
- D - I - 0x029392 20:9382: 04        .byte $04	; <え>
- D - I - 0x029393 20:9383: 05        .byte $05	; <お>
- D - I - 0x029394 20:9384: 00        .byte $00
- D - I - 0x029395 20:9385: 00        .byte $00
- D - I - 0x029396 20:9386: F1        .byte $F1
- D - I - 0x029397 20:9387: 94        .byte $94
- D - I - 0x029398 20:9388: BA        .byte $BA	; <ジ>
- D - I - 0x029399 20:9389: 80        .byte $80
- D - I - 0x02939A 20:938A: E3        .byte $E3
- D - I - 0x02939B 20:938B: 00        .byte $00
- D - I - 0x02939C 20:938C: F0        .byte $F0
off_938D_5F:
- D - I - 0x02939D 20:938D: F5        .byte $F5
- D - I - 0x02939E 20:938E: 09        .byte $09	; <け>
- D - I - 0x02939F 20:938F: F4        .byte $F4
- D - I - 0x0293A0 20:9390: 04        .byte $04	; <え>
- D - I - 0x0293A1 20:9391: 05        .byte $05	; <お>
- D - I - 0x0293A2 20:9392: 00        .byte $00
- D - I - 0x0293A3 20:9393: 00        .byte $00
- D - I - 0x0293A4 20:9394: F7        .byte $F7
- D - I - 0x0293A5 20:9395: 03        .byte $03	; <う>
- D - I - 0x0293A6 20:9396: 7B        .byte $7B	; <。>
- D - I - 0x0293A7 20:9397: F1        .byte $F1
- D - I - 0x0293A8 20:9398: 00        .byte $00
- D - I - 0x0293A9 20:9399: 00        .byte $00
- D - I - 0x0293AA 20:939A: 80        .byte $80
- D - I - 0x0293AB 20:939B: FB        .byte $FB
- D - I - 0x0293AC 20:939C: 00        .byte $00
- D - I - 0x0293AD 20:939D: F1        .byte $F1
- D - I - 0x0293AE 20:939E: E9        .byte $E9
- D - I - 0x0293AF 20:939F: CF        .byte $CF	; <プ>
- D - I - 0x0293B0 20:93A0: 00        .byte $00
- D - I - 0x0293B1 20:93A1: 83        .byte $83	; <C>
- D - I - 0x0293B2 20:93A2: 05        .byte $05	; <お>
- D - I - 0x0293B3 20:93A3: F0        .byte $F0
off_93A4_60:
- D - I - 0x0293B4 20:93A4: F5        .byte $F5
- D - I - 0x0293B5 20:93A5: 80        .byte $80
- D - I - 0x0293B6 20:93A6: F4        .byte $F4
- D - I - 0x0293B7 20:93A7: 08        .byte $08	; <く>
- D - I - 0x0293B8 20:93A8: 09        .byte $09	; <け>
- D - I - 0x0293B9 20:93A9: 0A        .byte $0A	; <こ>
- D - I - 0x0293BA 20:93AA: 0B        .byte $0B	; <さ>
- D - I - 0x0293BB 20:93AB: F1        .byte $F1
- D - I - 0x0293BC 20:93AC: 3A        .byte $3A	; <7>
- D - I - 0x0293BD 20:93AD: 56        .byte $56	; <ニ>
- D - I - 0x0293BE 20:93AE: E0        .byte $E0
- D - I - 0x0293BF 20:93AF: BB        .byte $BB	; <ズ>
- D - I - 0x0293C0 20:93B0: 08        .byte $08	; <く>
- D - I - 0x0293C1 20:93B1: F1        .byte $F1
- D - I - 0x0293C2 20:93B2: 3A        .byte $3A	; <7>
- D - I - 0x0293C3 20:93B3: 4C        .byte $4C	; <シ>
- D - I - 0x0293C4 20:93B4: E0        .byte $E0
- D - I - 0x0293C5 20:93B5: BB        .byte $BB	; <ズ>
- D - I - 0x0293C6 20:93B6: 00        .byte $00
- D - I - 0x0293C7 20:93B7: F1        .byte $F1
- D - I - 0x0293C8 20:93B8: 3A        .byte $3A	; <7>
- D - I - 0x0293C9 20:93B9: 4E        .byte $4E	; <セ>
- D - I - 0x0293CA 20:93BA: E0        .byte $E0
- D - I - 0x0293CB 20:93BB: BB        .byte $BB	; <ズ>
- D - I - 0x0293CC 20:93BC: 04        .byte $04	; <え>
- D - I - 0x0293CD 20:93BD: 14        .byte $14	; <と>
- D - I - 0x0293CE 20:93BE: F1        .byte $F1
- D - I - 0x0293CF 20:93BF: 3F        .byte $3F	; <•>
- D - I - 0x0293D0 20:93C0: 49        .byte $49	; <ケ>
- D - I - 0x0293D1 20:93C1: 28        .byte $28	; <り>
- D - I - 0x0293D2 20:93C2: EB        .byte $EB
- D - I - 0x0293D3 20:93C3: 01        .byte $01	; <あ>
- D - I - 0x0293D4 20:93C4: F1        .byte $F1
- D - I - 0x0293D5 20:93C5: 3E        .byte $3E	; <Jr>
- D - I - 0x0293D6 20:93C6: 5C        .byte $5C	; <フ>
- D - I - 0x0293D7 20:93C7: 00        .byte $00
- D - I - 0x0293D8 20:93C8: C3        .byte $C3	; <バ>
- D - I - 0x0293D9 20:93C9: 05        .byte $05	; <お>
- D - I - 0x0293DA 20:93CA: F1        .byte $F1
- D - I - 0x0293DB 20:93CB: 3E        .byte $3E	; <Jr>
- D - I - 0x0293DC 20:93CC: 5D        .byte $5D	; <ヘ>
- D - I - 0x0293DD 20:93CD: 00        .byte $00
- D - I - 0x0293DE 20:93CE: C3        .byte $C3	; <バ>
- D - I - 0x0293DF 20:93CF: 09        .byte $09	; <け>
- D - I - 0x0293E0 20:93D0: F1        .byte $F1
- D - I - 0x0293E1 20:93D1: 3E        .byte $3E	; <Jr>
- D - I - 0x0293E2 20:93D2: 5E        .byte $5E	; <ホ>
- D - I - 0x0293E3 20:93D3: 00        .byte $00
- D - I - 0x0293E4 20:93D4: C3        .byte $C3	; <バ>
- D - I - 0x0293E5 20:93D5: 0D        .byte $0D	; <す>
- D - I - 0x0293E6 20:93D6: 14        .byte $14	; <と>
- D - I - 0x0293E7 20:93D7: F6        .byte $F6
- D - I - 0x0293E8 20:93D8: 3F        .byte $3F	; <•>
- D - I - 0x0293E9 20:93D9: F1        .byte $F1
- D - I - 0x0293EA 20:93DA: 3D        .byte $3D	; <+>
- D - I - 0x0293EB 20:93DB: 56        .byte $56	; <ニ>
- D - I - 0x0293EC 20:93DC: AB        .byte $AB	; <ぢ>
- D - I - 0x0293ED 20:93DD: C3        .byte $C3	; <バ>
- D - I - 0x0293EE 20:93DE: 08        .byte $08	; <く>
- D - I - 0x0293EF 20:93DF: F1        .byte $F1
- D - I - 0x0293F0 20:93E0: 3D        .byte $3D	; <+>
- D - I - 0x0293F1 20:93E1: 4C        .byte $4C	; <シ>
- D - I - 0x0293F2 20:93E2: AB        .byte $AB	; <ぢ>
- D - I - 0x0293F3 20:93E3: C3        .byte $C3	; <バ>
- D - I - 0x0293F4 20:93E4: 00        .byte $00
- D - I - 0x0293F5 20:93E5: F1        .byte $F1
- D - I - 0x0293F6 20:93E6: 3D        .byte $3D	; <+>
- D - I - 0x0293F7 20:93E7: 4E        .byte $4E	; <セ>
- D - I - 0x0293F8 20:93E8: AB        .byte $AB	; <ぢ>
- D - I - 0x0293F9 20:93E9: C3        .byte $C3	; <バ>
- D - I - 0x0293FA 20:93EA: 04        .byte $04	; <え>
- D - I - 0x0293FB 20:93EB: F0        .byte $F0
off_93EC_61:
- D - I - 0x0293FC 20:93EC: F5        .byte $F5
- D - I - 0x0293FD 20:93ED: 80        .byte $80
- D - I - 0x0293FE 20:93EE: F4        .byte $F4
- D - I - 0x0293FF 20:93EF: 10        .byte $10	; <た>
- D - I - 0x029400 20:93F0: 11        .byte $11	; <ち>
- D - I - 0x029401 20:93F1: 12        .byte $12	; <つ>
- D - I - 0x029402 20:93F2: 00        .byte $00
- D - I - 0x029403 20:93F3: F1        .byte $F1
- D - I - 0x029404 20:93F4: DB        .byte $DB
- D - I - 0x029405 20:93F5: 2D        .byte $2D	; <を>
- D - I - 0x029406 20:93F6: 18        .byte $18	; <ね>
- D - I - 0x029407 20:93F7: B3        .byte $B3	; <ぼ>
- D - I - 0x029408 20:93F8: 01        .byte $01	; <あ>
- D - I - 0x029409 20:93F9: F1        .byte $F1
- D - I - 0x02940A 20:93FA: 59        .byte $59	; <ノ>
- D - I - 0x02940B 20:93FB: 2E        .byte $2E	; <ん>
- D - I - 0x02940C 20:93FC: 20        .byte $20	; <み>
- D - I - 0x02940D 20:93FD: AB        .byte $AB	; <ぢ>
- D - I - 0x02940E 20:93FE: 05        .byte $05	; <お>
- D - I - 0x02940F 20:93FF: 64        .byte $64	; <ヤ>
- D - I - 0x029410 20:9400: F6        .byte $F6
- D - I - 0x029411 20:9401: 15        .byte $15	; <な>
- D - I - 0x029412 20:9402: F0        .byte $F0
off_9403_62:
- D - I - 0x029413 20:9403: F5        .byte $F5
- D - I - 0x029414 20:9404: 85        .byte $85	; <E>
- D - I - 0x029415 20:9405: F4        .byte $F4
- D - I - 0x029416 20:9406: 41        .byte $41	; <ア>
- D - I - 0x029417 20:9407: 04        .byte $04	; <え>
- D - I - 0x029418 20:9408: 00        .byte $00
- D - I - 0x029419 20:9409: 00        .byte $00
- D - I - 0x02941A 20:940A: F1        .byte $F1
- D - I - 0x02941B 20:940B: 00        .byte $00
- D - I - 0x02941C 20:940C: 2F        .byte $2F	; <っ>
- D - I - 0x02941D 20:940D: 00        .byte $00
- D - I - 0x02941E 20:940E: D3        .byte $D3
- D - I - 0x02941F 20:940F: 01        .byte $01	; <あ>
- D - I - 0x029420 20:9410: F0        .byte $F0
off_9411_63:
- D - I - 0x029421 20:9411: F5        .byte $F5
- D - I - 0x029422 20:9412: 80        .byte $80
- D - I - 0x029423 20:9413: F4        .byte $F4
- D - I - 0x029424 20:9414: 04        .byte $04	; <え>
- D - I - 0x029425 20:9415: 05        .byte $05	; <お>
- D - I - 0x029426 20:9416: 23        .byte $23	; <も>
- D - I - 0x029427 20:9417: 00        .byte $00
- D - I - 0x029428 20:9418: F1        .byte $F1
- D - I - 0x029429 20:9419: A8        .byte $A8	; <ぜ>
- D - I - 0x02942A 20:941A: CF        .byte $CF	; <プ>
- D - I - 0x02942B 20:941B: 10        .byte $10	; <た>
- D - I - 0x02942C 20:941C: D3        .byte $D3
- D - I - 0x02942D 20:941D: 01        .byte $01	; <あ>
- D - I - 0x02942E 20:941E: F1        .byte $F1
- D - I - 0x02942F 20:941F: 5A        .byte $5A	; <ハ>
- D - I - 0x029430 20:9420: E7        .byte $E7
- D - I - 0x029431 20:9421: 10        .byte $10	; <た>
- D - I - 0x029432 20:9422: CB        .byte $CB	; <ぺ>
- D - I - 0x029433 20:9423: 05        .byte $05	; <お>
- D - I - 0x029434 20:9424: F0        .byte $F0
off_9425_64:
- D - I - 0x029435 20:9425: F5        .byte $F5
- D - I - 0x029436 20:9426: 80        .byte $80
- D - I - 0x029437 20:9427: F4        .byte $F4
- D - I - 0x029438 20:9428: 13        .byte $13	; <て>
- D - I - 0x029439 20:9429: 00        .byte $00
- D - I - 0x02943A 20:942A: 00        .byte $00
- D - I - 0x02943B 20:942B: 00        .byte $00
- D - I - 0x02943C 20:942C: F1        .byte $F1
- D - I - 0x02943D 20:942D: 40        .byte $40	; <「>
- D - I - 0x02943E 20:942E: 29        .byte $29	; <る>
- D - I - 0x02943F 20:942F: D8        .byte $D8
- D - I - 0x029440 20:9430: CB        .byte $CB	; <ぺ>
- D - I - 0x029441 20:9431: 00        .byte $00
- D - I - 0x029442 20:9432: F0        .byte $F0
off_9433_65:
- - - - - 0x029443 20:9433: F5        .byte $F5
- - - - - 0x029444 20:9434: 09        .byte $09	; <け>
- - - - - 0x029445 20:9435: F4        .byte $F4
- - - - - 0x029446 20:9436: 06        .byte $06	; <か>
- - - - - 0x029447 20:9437: 00        .byte $00
- - - - - 0x029448 20:9438: 00        .byte $00
- - - - - 0x029449 20:9439: 00        .byte $00
- - - - - 0x02944A 20:943A: F1        .byte $F1
- - - - - 0x02944B 20:943B: 5C        .byte $5C	; <フ>
- - - - - 0x02944C 20:943C: B5        .byte $B5	; <ギ>
- - - - - 0x02944D 20:943D: 00        .byte $00
- - - - - 0x02944E 20:943E: 93        .byte $93	; <Y>
- - - - - 0x02944F 20:943F: 01        .byte $01	; <あ>
- - - - - 0x029450 20:9440: F0        .byte $F0
off_9441_66:
- D - I - 0x029451 20:9441: F5        .byte $F5
- D - I - 0x029452 20:9442: 80        .byte $80
- D - I - 0x029453 20:9443: F4        .byte $F4
- D - I - 0x029454 20:9444: 04        .byte $04	; <え>
- D - I - 0x029455 20:9445: 05        .byte $05	; <お>
- D - I - 0x029456 20:9446: 22        .byte $22	; <め>
- D - I - 0x029457 20:9447: 00        .byte $00
- D - I - 0x029458 20:9448: F1        .byte $F1
- D - I - 0x029459 20:9449: 5D        .byte $5D	; <ヘ>
- D - I - 0x02945A 20:944A: 31        .byte $31	; <ゅ>
- D - I - 0x02945B 20:944B: B0        .byte $B0	; <び>
- D - I - 0x02945C 20:944C: D3        .byte $D3
- D - I - 0x02945D 20:944D: 04        .byte $04	; <え>
- D - I - 0x02945E 20:944E: 06        .byte $06	; <か>
- D - I - 0x02945F 20:944F: F1        .byte $F1
- D - I - 0x029460 20:9450: A9        .byte $A9	; <ぞ>
- D - I - 0x029461 20:9451: C4        .byte $C4	; <ビ>
- D - I - 0x029462 20:9452: B8        .byte $B8	; <ゴ>
- D - I - 0x029463 20:9453: DB        .byte $DB
- D - I - 0x029464 20:9454: 00        .byte $00
- D - I - 0x029465 20:9455: F0        .byte $F0
off_9456_67:
- D - I - 0x029466 20:9456: F5        .byte $F5
- D - I - 0x029467 20:9457: 09        .byte $09	; <け>
- D - I - 0x029468 20:9458: F4        .byte $F4
- D - I - 0x029469 20:9459: 04        .byte $04	; <え>
- D - I - 0x02946A 20:945A: 05        .byte $05	; <お>
- D - I - 0x02946B 20:945B: 00        .byte $00
- D - I - 0x02946C 20:945C: 00        .byte $00
- D - I - 0x02946D 20:945D: F1        .byte $F1
- D - I - 0x02946E 20:945E: 00        .byte $00
- D - I - 0x02946F 20:945F: 00        .byte $00
- D - I - 0x029470 20:9460: 80        .byte $80
- D - I - 0x029471 20:9461: FB        .byte $FB
- D - I - 0x029472 20:9462: 00        .byte $00
- D - I - 0x029473 20:9463: F1        .byte $F1
- D - I - 0x029474 20:9464: EA        .byte $EA
- D - I - 0x029475 20:9465: 23        .byte $23	; <も>
- D - I - 0x029476 20:9466: 70        .byte $70	; <ャ>
- D - I - 0x029477 20:9467: CB        .byte $CB	; <ぺ>
- D - I - 0x029478 20:9468: 05        .byte $05	; <お>
- D - I - 0x029479 20:9469: F0        .byte $F0
off_946A_68:
- D - I - 0x02947A 20:946A: F5        .byte $F5
- D - I - 0x02947B 20:946B: 80        .byte $80
- D - I - 0x02947C 20:946C: F4        .byte $F4
- D - I - 0x02947D 20:946D: 04        .byte $04	; <え>
- D - I - 0x02947E 20:946E: 05        .byte $05	; <お>
- D - I - 0x02947F 20:946F: 20        .byte $20	; <み>
- D - I - 0x029480 20:9470: 21        .byte $21	; <む>
- D - I - 0x029481 20:9471: F1        .byte $F1
- D - I - 0x029482 20:9472: AA        .byte $AA	; <だ>
- D - I - 0x029483 20:9473: C6        .byte $C6	; <ベ>
- D - I - 0x029484 20:9474: 90        .byte $90	; <U>
- D - I - 0x029485 20:9475: CB        .byte $CB	; <ぺ>
- D - I - 0x029486 20:9476: 00        .byte $00
- D - I - 0x029487 20:9477: F1        .byte $F1
- D - I - 0x029488 20:9478: 5E        .byte $5E	; <ホ>
- D - I - 0x029489 20:9479: 32        .byte $32	; <ょ>
- D - I - 0x02948A 20:947A: 80        .byte $80
- D - I - 0x02948B 20:947B: 9B        .byte $9B
- D - I - 0x02948C 20:947C: 05        .byte $05	; <お>
- D - I - 0x02948D 20:947D: F0        .byte $F0
off_947E_69:
- D - I - 0x02948E 20:947E: F5        .byte $F5
- D - I - 0x02948F 20:947F: 80        .byte $80
- D - I - 0x029490 20:9480: F4        .byte $F4
- D - I - 0x029491 20:9481: 16        .byte $16	; <に>
- D - I - 0x029492 20:9482: 17        .byte $17	; <ぬ>
- D - I - 0x029493 20:9483: 2D        .byte $2D	; <を>
- D - I - 0x029494 20:9484: 53        .byte $53	; <テ>
- D - I - 0x029495 20:9485: F1        .byte $F1
- D - I - 0x029496 20:9486: 00        .byte $00
- D - I - 0x029497 20:9487: 46        .byte $46	; <カ>
- D - I - 0x029498 20:9488: 08        .byte $08	; <く>
- D - I - 0x029499 20:9489: BB        .byte $BB	; <ズ>
- D - I - 0x02949A 20:948A: 01        .byte $01	; <あ>
- D - I - 0x02949B 20:948B: F0        .byte $F0
off_948C_6A:
- D - I - 0x02949C 20:948C: F5        .byte $F5
- D - I - 0x02949D 20:948D: 80        .byte $80
- D - I - 0x02949E 20:948E: F4        .byte $F4
- D - I - 0x02949F 20:948F: 04        .byte $04	; <え>
- D - I - 0x0294A0 20:9490: 05        .byte $05	; <お>
- D - I - 0x0294A1 20:9491: 20        .byte $20	; <み>
- D - I - 0x0294A2 20:9492: 21        .byte $21	; <む>
- D - I - 0x0294A3 20:9493: F1        .byte $F1
- D - I - 0x0294A4 20:9494: AB        .byte $AB	; <ぢ>
- D - I - 0x0294A5 20:9495: CF        .byte $CF	; <プ>
- D - I - 0x0294A6 20:9496: E8        .byte $E8
- D - I - 0x0294A7 20:9497: DB        .byte $DB
- D - I - 0x0294A8 20:9498: 00        .byte $00
- D - I - 0x0294A9 20:9499: F1        .byte $F1
- D - I - 0x0294AA 20:949A: 2D        .byte $2D	; <を>
- D - I - 0x0294AB 20:949B: 33        .byte $33	; <0>
- D - I - 0x0294AC 20:949C: F8        .byte $F8
- D - I - 0x0294AD 20:949D: CB        .byte $CB	; <ぺ>
- D - I - 0x0294AE 20:949E: 04        .byte $04	; <え>
- D - I - 0x0294AF 20:949F: F8        .byte $F8
- D - I - 0x0294B0 20:94A0: A7 8B     .word off_8BA7
off_94A2_6B:
- D - I - 0x0294B2 20:94A2: F5        .byte $F5
- D - I - 0x0294B3 20:94A3: 80        .byte $80
- D - I - 0x0294B4 20:94A4: F4        .byte $F4
- D - I - 0x0294B5 20:94A5: 08        .byte $08	; <く>
- D - I - 0x0294B6 20:94A6: 09        .byte $09	; <け>
- D - I - 0x0294B7 20:94A7: 0A        .byte $0A	; <こ>
- D - I - 0x0294B8 20:94A8: 0B        .byte $0B	; <さ>
- D - I - 0x0294B9 20:94A9: F1        .byte $F1
- D - I - 0x0294BA 20:94AA: 42        .byte $42	; <イ>
- D - I - 0x0294BB 20:94AB: 4C        .byte $4C	; <シ>
- D - I - 0x0294BC 20:94AC: 80        .byte $80
- D - I - 0x0294BD 20:94AD: BB        .byte $BB	; <ズ>
- D - I - 0x0294BE 20:94AE: 00        .byte $00
- D - I - 0x0294BF 20:94AF: F1        .byte $F1
- D - I - 0x0294C0 20:94B0: 42        .byte $42	; <イ>
- D - I - 0x0294C1 20:94B1: 4E        .byte $4E	; <セ>
- D - I - 0x0294C2 20:94B2: 80        .byte $80
- D - I - 0x0294C3 20:94B3: BB        .byte $BB	; <ズ>
- D - I - 0x0294C4 20:94B4: 04        .byte $04	; <え>
off_94B5:
- D - I - 0x0294C5 20:94B5: F1        .byte $F1
- D - I - 0x0294C6 20:94B6: 42        .byte $42	; <イ>
- D - I - 0x0294C7 20:94B7: 50        .byte $50	; <タ>
- D - I - 0x0294C8 20:94B8: 80        .byte $80
- D - I - 0x0294C9 20:94B9: BB        .byte $BB	; <ズ>
- D - I - 0x0294CA 20:94BA: 08        .byte $08	; <く>
- D - I - 0x0294CB 20:94BB: F0        .byte $F0
off_94BC_6C:
- D - I - 0x0294CC 20:94BC: F5        .byte $F5
- D - I - 0x0294CD 20:94BD: 80        .byte $80
- D - I - 0x0294CE 20:94BE: F4        .byte $F4
- D - I - 0x0294CF 20:94BF: 24        .byte $24	; <や>
- D - I - 0x0294D0 20:94C0: 25        .byte $25	; <ゆ>
- D - I - 0x0294D1 20:94C1: 26        .byte $26	; <よ>
- D - I - 0x0294D2 20:94C2: 4F        .byte $4F	; <ソ>
- D - I - 0x0294D3 20:94C3: F1        .byte $F1
- D - I - 0x0294D4 20:94C4: 1A        .byte $1A	; <は>
- D - I - 0x0294D5 20:94C5: 07        .byte $07	; <き>
- D - I - 0x0294D6 20:94C6: 4C        .byte $4C	; <シ>
- D - I - 0x0294D7 20:94C7: 76        .byte $76	; <ォ>
- D - I - 0x0294D8 20:94C8: 00        .byte $00
- D - I - 0x0294D9 20:94C9: F1        .byte $F1
- D - I - 0x0294DA 20:94CA: A0        .byte $A0	; <が>
- D - I - 0x0294DB 20:94CB: 06        .byte $06	; <か>
- D - I - 0x0294DC 20:94CC: 10        .byte $10	; <た>
- D - I - 0x0294DD 20:94CD: B3        .byte $B3	; <ぼ>
- D - I - 0x0294DE 20:94CE: 05        .byte $05	; <お>
- D - I - 0x0294DF 20:94CF: F9        .byte $F9
- D - I - 0x0294E0 20:94D0: 0F        .byte $0F	; <そ>
- D - I - 0x0294E1 20:94D1: 01        .byte $01	; <あ>
- D - I - 0x0294E2 20:94D2: FB        .byte $FB
- D - I - 0x0294E3 20:94D3: 10        .byte $10	; <た>
- D - I - 0x0294E4 20:94D4: 23        .byte $23	; <も>
- D - I - 0x0294E5 20:94D5: 45        .byte $45	; <オ>
- D - I - 0x0294E6 20:94D6: 01        .byte $01	; <あ>
- D - I - 0x0294E7 20:94D7: FB        .byte $FB
- D - I - 0x0294E8 20:94D8: 01        .byte $01	; <あ>
- D - I - 0x0294E9 20:94D9: 23        .byte $23	; <も>
- D - I - 0x0294EA 20:94DA: 45        .byte $45	; <オ>
- D - I - 0x0294EB 20:94DB: FA        .byte $FA
- D - I - 0x0294EC 20:94DC: F6        .byte $F6
- D - I - 0x0294ED 20:94DD: 00        .byte $00
- D - I - 0x0294EE 20:94DE: F1        .byte $F1
- D - I - 0x0294EF 20:94DF: 00        .byte $00
- D - I - 0x0294F0 20:94E0: 39        .byte $39	; <6>
- D - I - 0x0294F1 20:94E1: F9        .byte $F9
- D - I - 0x0294F2 20:94E2: BB        .byte $BB	; <ズ>
- D - I - 0x0294F3 20:94E3: 04        .byte $04	; <え>
- D - I - 0x0294F4 20:94E4: 04        .byte $04	; <え>
- D - I - 0x0294F5 20:94E5: F1        .byte $F1
- D - I - 0x0294F6 20:94E6: A1        .byte $A1	; <ぎ>
- D - I - 0x0294F7 20:94E7: 07        .byte $07	; <き>
- D - I - 0x0294F8 20:94E8: E4        .byte $E4
- D - I - 0x0294F9 20:94E9: CF        .byte $CF	; <プ>
- D - I - 0x0294FA 20:94EA: 00        .byte $00
- D - I - 0x0294FB 20:94EB: F1        .byte $F1
- D - I - 0x0294FC 20:94EC: 26        .byte $26	; <よ>
- D - I - 0x0294FD 20:94ED: 06        .byte $06	; <か>
- D - I - 0x0294FE 20:94EE: F9        .byte $F9
- D - I - 0x0294FF 20:94EF: BB        .byte $BB	; <ズ>
- D - I - 0x029500 20:94F0: 04        .byte $04	; <え>
- D - I - 0x029501 20:94F1: F8        .byte $F8
- D - I - 0x029502 20:94F2: A7 8B     .word off_8BA7
off_94F4_6D:
- D - I - 0x029504 20:94F4: F5        .byte $F5
- D - I - 0x029505 20:94F5: 80        .byte $80
- D - I - 0x029506 20:94F6: F4        .byte $F4
- D - I - 0x029507 20:94F7: 24        .byte $24	; <や>
- D - I - 0x029508 20:94F8: 25        .byte $25	; <ゆ>
- D - I - 0x029509 20:94F9: 26        .byte $26	; <よ>
- D - I - 0x02950A 20:94FA: 4F        .byte $4F	; <ソ>
- D - I - 0x02950B 20:94FB: F1        .byte $F1
- D - I - 0x02950C 20:94FC: A2        .byte $A2	; <ぐ>
- D - I - 0x02950D 20:94FD: 0A        .byte $0A	; <こ>
- D - I - 0x02950E 20:94FE: 5F        .byte $5F	; <マ>
- D - I - 0x02950F 20:94FF: 7B        .byte $7B	; <。>
- D - I - 0x029510 20:9500: 00        .byte $00
- D - I - 0x029511 20:9501: F1        .byte $F1
- D - I - 0x029512 20:9502: A0        .byte $A0	; <が>
- D - I - 0x029513 20:9503: 09        .byte $09	; <け>
- D - I - 0x029514 20:9504: 10        .byte $10	; <た>
- D - I - 0x029515 20:9505: B3        .byte $B3	; <ぼ>
- D - I - 0x029516 20:9506: 05        .byte $05	; <お>
- D - I - 0x029517 20:9507: F9        .byte $F9
- D - I - 0x029518 20:9508: 0F        .byte $0F	; <そ>
- D - I - 0x029519 20:9509: 01        .byte $01	; <あ>
- D - I - 0x02951A 20:950A: FB        .byte $FB
- D - I - 0x02951B 20:950B: 10        .byte $10	; <た>
- D - I - 0x02951C 20:950C: 23        .byte $23	; <も>
- D - I - 0x02951D 20:950D: 45        .byte $45	; <オ>
- D - I - 0x02951E 20:950E: 01        .byte $01	; <あ>
- D - I - 0x02951F 20:950F: FB        .byte $FB
- D - I - 0x029520 20:9510: 01        .byte $01	; <あ>
- D - I - 0x029521 20:9511: 23        .byte $23	; <も>
- D - I - 0x029522 20:9512: 45        .byte $45	; <オ>
- D - I - 0x029523 20:9513: FA        .byte $FA
- D - I - 0x029524 20:9514: F6        .byte $F6
- D - I - 0x029525 20:9515: 00        .byte $00
- D - I - 0x029526 20:9516: F1        .byte $F1
- D - I - 0x029527 20:9517: 00        .byte $00
- D - I - 0x029528 20:9518: 3B        .byte $3B	; <8>
- D - I - 0x029529 20:9519: F9        .byte $F9
- D - I - 0x02952A 20:951A: BB        .byte $BB	; <ズ>
- D - I - 0x02952B 20:951B: 04        .byte $04	; <え>
- D - I - 0x02952C 20:951C: 04        .byte $04	; <え>
- D - I - 0x02952D 20:951D: F1        .byte $F1
- D - I - 0x02952E 20:951E: A3        .byte $A3	; <げ>
- D - I - 0x02952F 20:951F: 0A        .byte $0A	; <こ>
- D - I - 0x029530 20:9520: F0        .byte $F0
- D - I - 0x029531 20:9521: BB        .byte $BB	; <ズ>
- D - I - 0x029532 20:9522: 00        .byte $00
- D - I - 0x029533 20:9523: F1        .byte $F1
- D - I - 0x029534 20:9524: 26        .byte $26	; <よ>
- D - I - 0x029535 20:9525: 09        .byte $09	; <け>
- D - I - 0x029536 20:9526: F9        .byte $F9
- D - I - 0x029537 20:9527: BB        .byte $BB	; <ズ>
- D - I - 0x029538 20:9528: 04        .byte $04	; <え>
- D - I - 0x029539 20:9529: F8        .byte $F8
- D - I - 0x02953A 20:952A: A7 8B     .word off_8BA7
off_952C_6E:
- D - I - 0x02953C 20:952C: F5        .byte $F5
- D - I - 0x02953D 20:952D: 80        .byte $80
- D - I - 0x02953E 20:952E: F4        .byte $F4
- D - I - 0x02953F 20:952F: 0C        .byte $0C	; <し>
- D - I - 0x029540 20:9530: 0D        .byte $0D	; <す>
- D - I - 0x029541 20:9531: 0E        .byte $0E	; <せ>
- D - I - 0x029542 20:9532: 0F        .byte $0F	; <そ>
- D - I - 0x029543 20:9533: F1        .byte $F1
- D - I - 0x029544 20:9534: 33        .byte $33	; <0>
- D - I - 0x029545 20:9535: 1E        .byte $1E	; <ほ>
- D - I - 0x029546 20:9536: 60        .byte $60	; <ミ>
- D - I - 0x029547 20:9537: 97        .byte $97
- D - I - 0x029548 20:9538: 04        .byte $04	; <え>
- D - I - 0x029549 20:9539: F1        .byte $F1
- D - I - 0x02954A 20:953A: 24        .byte $24	; <や>
- D - I - 0x02954B 20:953B: 1D        .byte $1D	; <へ>
- D - I - 0x02954C 20:953C: 20        .byte $20	; <み>
- D - I - 0x02954D 20:953D: B7        .byte $B7	; <ゲ>
- D - I - 0x02954E 20:953E: 09        .byte $09	; <け>
- D - I - 0x02954F 20:953F: 1E        .byte $1E	; <ほ>
- D - I - 0x029550 20:9540: F6        .byte $F6
- D - I - 0x029551 20:9541: 2A        .byte $2A	; <れ>
- D - I - 0x029552 20:9542: F1        .byte $F1
- D - I - 0x029553 20:9543: 34        .byte $34	; <1>
- D - I - 0x029554 20:9544: 21        .byte $21	; <む>
- D - I - 0x029555 20:9545: 10        .byte $10	; <た>
- D - I - 0x029556 20:9546: B7        .byte $B7	; <ゲ>
- D - I - 0x029557 20:9547: 01        .byte $01	; <あ>
- D - I - 0x029558 20:9548: F0        .byte $F0
off_9549_6F:
- D - I - 0x029559 20:9549: F5        .byte $F5
- D - I - 0x02955A 20:954A: 80        .byte $80
- D - I - 0x02955B 20:954B: F4        .byte $F4
- D - I - 0x02955C 20:954C: 08        .byte $08	; <く>
- D - I - 0x02955D 20:954D: 09        .byte $09	; <け>
- D - I - 0x02955E 20:954E: 0A        .byte $0A	; <こ>
- D - I - 0x02955F 20:954F: 0B        .byte $0B	; <さ>
- D - I - 0x029560 20:9550: F1        .byte $F1
- D - I - 0x029561 20:9551: 33        .byte $33	; <0>
- D - I - 0x029562 20:9552: 49        .byte $49	; <ケ>
- D - I - 0x029563 20:9553: 60        .byte $60	; <ミ>
- D - I - 0x029564 20:9554: E3        .byte $E3
- D - I - 0x029565 20:9555: 04        .byte $04	; <え>
- D - I - 0x029566 20:9556: F1        .byte $F1
- D - I - 0x029567 20:9557: 67        .byte $67	; <ラ>
- D - I - 0x029568 20:9558: 94        .byte $94
- D - I - 0x029569 20:9559: F0        .byte $F0
- D - I - 0x02956A 20:955A: BB        .byte $BB	; <ズ>
- D - I - 0x02956B 20:955B: 00        .byte $00
- D - I - 0x02956C 20:955C: F1        .byte $F1
- D - I - 0x02956D 20:955D: 67        .byte $67	; <ラ>
- D - I - 0x02956E 20:955E: 95        .byte $95
- D - I - 0x02956F 20:955F: F0        .byte $F0
- D - I - 0x029570 20:9560: BB        .byte $BB	; <ズ>
- D - I - 0x029571 20:9561: 08        .byte $08	; <く>
- D - I - 0x029572 20:9562: F1        .byte $F1
- D - I - 0x029573 20:9563: 67        .byte $67	; <ラ>
- D - I - 0x029574 20:9564: 96        .byte $96
- D - I - 0x029575 20:9565: F0        .byte $F0
- D - I - 0x029576 20:9566: BB        .byte $BB	; <ズ>
- D - I - 0x029577 20:9567: 0C        .byte $0C	; <し>
- D - I - 0x029578 20:9568: 1E        .byte $1E	; <ほ>
- D - I - 0x029579 20:9569: F4        .byte $F4
- D - I - 0x02957A 20:956A: 0A        .byte $0A	; <こ>
- D - I - 0x02957B 20:956B: 0B        .byte $0B	; <さ>
- D - I - 0x02957C 20:956C: 00        .byte $00
- D - I - 0x02957D 20:956D: 0B        .byte $0B	; <さ>
- D - I - 0x02957E 20:956E: F6        .byte $F6
- D - I - 0x02957F 20:956F: 2A        .byte $2A	; <れ>
- D - I - 0x029580 20:9570: F6        .byte $F6
- D - I - 0x029581 20:9571: 3F        .byte $3F	; <•>
- D - I - 0x029582 20:9572: F1        .byte $F1
- D - I - 0x029583 20:9573: 68        .byte $68	; <リ>
- D - I - 0x029584 20:9574: 85        .byte $85	; <E>
- D - I - 0x029585 20:9575: 20        .byte $20	; <み>
- D - I - 0x029586 20:9576: C3        .byte $C3	; <バ>
- D - I - 0x029587 20:9577: 01        .byte $01	; <あ>
- D - I - 0x029588 20:9578: F0        .byte $F0
off_9579_70:
- D - I - 0x029589 20:9579: F5        .byte $F5
- D - I - 0x02958A 20:957A: 09        .byte $09	; <け>
- D - I - 0x02958B 20:957B: F4        .byte $F4
- D - I - 0x02958C 20:957C: 04        .byte $04	; <え>
- D - I - 0x02958D 20:957D: 05        .byte $05	; <お>
- D - I - 0x02958E 20:957E: 00        .byte $00
- D - I - 0x02958F 20:957F: 00        .byte $00
- D - I - 0x029590 20:9580: F1        .byte $F1
- D - I - 0x029591 20:9581: 81        .byte $81	; <A>
- D - I - 0x029592 20:9582: C0        .byte $C0	; <ヅ>
- D - I - 0x029593 20:9583: C0        .byte $C0	; <ヅ>
- D - I - 0x029594 20:9584: EB        .byte $EB
- D - I - 0x029595 20:9585: 00        .byte $00
- D - I - 0x029596 20:9586: F0        .byte $F0
off_9587_71:
- D - I - 0x029597 20:9587: F5        .byte $F5
- D - I - 0x029598 20:9588: 80        .byte $80
- D - I - 0x029599 20:9589: F4        .byte $F4
- D - I - 0x02959A 20:958A: 13        .byte $13	; <て>
- D - I - 0x02959B 20:958B: 00        .byte $00
- D - I - 0x02959C 20:958C: 00        .byte $00
- D - I - 0x02959D 20:958D: 00        .byte $00
- D - I - 0x02959E 20:958E: F1        .byte $F1
- D - I - 0x02959F 20:958F: 40        .byte $40	; <「>
- D - I - 0x0295A0 20:9590: 7E        .byte $7E	; <.>
- D - I - 0x0295A1 20:9591: D8        .byte $D8
- D - I - 0x0295A2 20:9592: CB        .byte $CB	; <ぺ>
- D - I - 0x0295A3 20:9593: 00        .byte $00
- D - I - 0x0295A4 20:9594: F0        .byte $F0
- - - - - 0x0295A5 20:9595: F8        .byte $F8
- - - - - 0x0295A6 20:9596: A7 8B     .word off_8BA7
off_9598_72:
- - - - - 0x0295A8 20:9598: F5        .byte $F5
- - - - - 0x0295A9 20:9599: 09        .byte $09	; <け>
- - - - - 0x0295AA 20:959A: F4        .byte $F4
- - - - - 0x0295AB 20:959B: 04        .byte $04	; <え>
- - - - - 0x0295AC 20:959C: 05        .byte $05	; <お>
- - - - - 0x0295AD 20:959D: 00        .byte $00
- - - - - 0x0295AE 20:959E: 00        .byte $00
- - - - - 0x0295AF 20:959F: F1        .byte $F1
- - - - - 0x0295B0 20:95A0: 96        .byte $96
- - - - - 0x0295B1 20:95A1: C0        .byte $C0	; <ヅ>
- - - - - 0x0295B2 20:95A2: D0        .byte $D0	; <ペ>
- - - - - 0x0295B3 20:95A3: 9B        .byte $9B
- - - - - 0x0295B4 20:95A4: 00        .byte $00
- - - - - 0x0295B5 20:95A5: F0        .byte $F0
off_95A6_73:
- D - I - 0x0295B6 20:95A6: F5        .byte $F5
- D - I - 0x0295B7 20:95A7: 09        .byte $09	; <け>
- D - I - 0x0295B8 20:95A8: F4        .byte $F4
- D - I - 0x0295B9 20:95A9: 04        .byte $04	; <え>
- D - I - 0x0295BA 20:95AA: 05        .byte $05	; <お>
- D - I - 0x0295BB 20:95AB: 00        .byte $00
- D - I - 0x0295BC 20:95AC: 00        .byte $00
- D - I - 0x0295BD 20:95AD: F1        .byte $F1
- D - I - 0x0295BE 20:95AE: 97        .byte $97
- D - I - 0x0295BF 20:95AF: C0        .byte $C0	; <ヅ>
- D - I - 0x0295C0 20:95B0: 00        .byte $00
- D - I - 0x0295C1 20:95B1: E3        .byte $E3
- D - I - 0x0295C2 20:95B2: 01        .byte $01	; <あ>
- D - I - 0x0295C3 20:95B3: F0        .byte $F0
off_95B4_74:
- D - I - 0x0295C4 20:95B4: F5        .byte $F5
- D - I - 0x0295C5 20:95B5: 09        .byte $09	; <け>
- D - I - 0x0295C6 20:95B6: F4        .byte $F4
- D - I - 0x0295C7 20:95B7: 04        .byte $04	; <え>
- D - I - 0x0295C8 20:95B8: 05        .byte $05	; <お>
- D - I - 0x0295C9 20:95B9: 00        .byte $00
- D - I - 0x0295CA 20:95BA: 00        .byte $00
- D - I - 0x0295CB 20:95BB: F7        .byte $F7
- D - I - 0x0295CC 20:95BC: 2B        .byte $2B	; <ろ>
- D - I - 0x0295CD 20:95BD: 53        .byte $53	; <テ>
- D - I - 0x0295CE 20:95BE: F1        .byte $F1
- D - I - 0x0295CF 20:95BF: 00        .byte $00
- D - I - 0x0295D0 20:95C0: 00        .byte $00
- D - I - 0x0295D1 20:95C1: 80        .byte $80
- D - I - 0x0295D2 20:95C2: A3        .byte $A3	; <げ>
- D - I - 0x0295D3 20:95C3: 00        .byte $00
- D - I - 0x0295D4 20:95C4: F1        .byte $F1
- D - I - 0x0295D5 20:95C5: 00        .byte $00
- D - I - 0x0295D6 20:95C6: 00        .byte $00
- D - I - 0x0295D7 20:95C7: 80        .byte $80
- D - I - 0x0295D8 20:95C8: DB        .byte $DB
- D - I - 0x0295D9 20:95C9: 04        .byte $04	; <え>
- D - I - 0x0295DA 20:95CA: F1        .byte $F1
- D - I - 0x0295DB 20:95CB: B1        .byte $B1	; <ぶ>
- D - I - 0x0295DC 20:95CC: C4        .byte $C4	; <ビ>
- D - I - 0x0295DD 20:95CD: 90        .byte $90	; <U>
- D - I - 0x0295DE 20:95CE: 93        .byte $93	; <Y>
- D - I - 0x0295DF 20:95CF: 08        .byte $08	; <く>
- D - I - 0x0295E0 20:95D0: 03        .byte $03	; <う>
- D - I - 0x0295E1 20:95D1: F1        .byte $F1
- D - I - 0x0295E2 20:95D2: B1        .byte $B1	; <ぶ>
- D - I - 0x0295E3 20:95D3: C4        .byte $C4	; <ビ>
- D - I - 0x0295E4 20:95D4: 90        .byte $90	; <U>
- D - I - 0x0295E5 20:95D5: 93        .byte $93	; <Y>
- D - I - 0x0295E6 20:95D6: 0C        .byte $0C	; <し>
- D - I - 0x0295E7 20:95D7: 03        .byte $03	; <う>
- D - I - 0x0295E8 20:95D8: F1        .byte $F1
- D - I - 0x0295E9 20:95D9: B1        .byte $B1	; <ぶ>
- D - I - 0x0295EA 20:95DA: C4        .byte $C4	; <ビ>
- D - I - 0x0295EB 20:95DB: 90        .byte $90	; <U>
- D - I - 0x0295EC 20:95DC: 93        .byte $93	; <Y>
- D - I - 0x0295ED 20:95DD: 10        .byte $10	; <た>
- D - I - 0x0295EE 20:95DE: 03        .byte $03	; <う>
- D - I - 0x0295EF 20:95DF: F1        .byte $F1
- D - I - 0x0295F0 20:95E0: B1        .byte $B1	; <ぶ>
- D - I - 0x0295F1 20:95E1: C4        .byte $C4	; <ビ>
- D - I - 0x0295F2 20:95E2: 90        .byte $90	; <U>
- D - I - 0x0295F3 20:95E3: 93        .byte $93	; <Y>
- D - I - 0x0295F4 20:95E4: 14        .byte $14	; <と>
- D - I - 0x0295F5 20:95E5: F0        .byte $F0
off_95E6_75:
- D - I - 0x0295F6 20:95E6: F5        .byte $F5
- D - I - 0x0295F7 20:95E7: 84        .byte $84	; <D>
- D - I - 0x0295F8 20:95E8: 16        .byte $16	; <に>
- D - I - 0x0295F9 20:95E9: F4        .byte $F4
- D - I - 0x0295FA 20:95EA: 2D        .byte $2D	; <を>
- D - I - 0x0295FB 20:95EB: 00        .byte $00
- D - I - 0x0295FC 20:95EC: 00        .byte $00
- D - I - 0x0295FD 20:95ED: 00        .byte $00
- D - I - 0x0295FE 20:95EE: F1        .byte $F1
- D - I - 0x0295FF 20:95EF: CB        .byte $CB	; <ぺ>
- D - I - 0x029600 20:95F0: B3        .byte $B3	; <ぼ>
- D - I - 0x029601 20:95F1: 53        .byte $53	; <テ>
- D - I - 0x029602 20:95F2: C3        .byte $C3	; <バ>
- D - I - 0x029603 20:95F3: 00        .byte $00
- D - I - 0x029604 20:95F4: F0        .byte $F0
off_95F5_76:
- D - I - 0x029605 20:95F5: F5        .byte $F5
- D - I - 0x029606 20:95F6: 80        .byte $80
- D - I - 0x029607 20:95F7: F4        .byte $F4
- D - I - 0x029608 20:95F8: 28        .byte $28	; <り>
- D - I - 0x029609 20:95F9: 29        .byte $29	; <る>
- D - I - 0x02960A 20:95FA: 2A        .byte $2A	; <れ>
- D - I - 0x02960B 20:95FB: 0B        .byte $0B	; <さ>
- D - I - 0x02960C 20:95FC: F1        .byte $F1
- D - I - 0x02960D 20:95FD: 39        .byte $39	; <6>
- D - I - 0x02960E 20:95FE: 11        .byte $11	; <ち>
- D - I - 0x02960F 20:95FF: E8        .byte $E8
- D - I - 0x029610 20:9600: BB        .byte $BB	; <ズ>
- D - I - 0x029611 20:9601: 00        .byte $00
- D - I - 0x029612 20:9602: F0        .byte $F0
off_9603_77:
- D - I - 0x029613 20:9603: F5        .byte $F5
- D - I - 0x029614 20:9604: 82        .byte $82	; <B>
- D - I - 0x029615 20:9605: F4        .byte $F4
- D - I - 0x029616 20:9606: 04        .byte $04	; <え>
- D - I - 0x029617 20:9607: 05        .byte $05	; <お>
- D - I - 0x029618 20:9608: 22        .byte $22	; <め>
- D - I - 0x029619 20:9609: 00        .byte $00
- D - I - 0x02961A 20:960A: F1        .byte $F1
- D - I - 0x02961B 20:960B: 5D        .byte $5D	; <ヘ>
- D - I - 0x02961C 20:960C: 83        .byte $83	; <C>
- D - I - 0x02961D 20:960D: B8        .byte $B8	; <ゴ>
- D - I - 0x02961E 20:960E: D3        .byte $D3
- D - I - 0x02961F 20:960F: 04        .byte $04	; <え>
- D - I - 0x029620 20:9610: 06        .byte $06	; <か>
- D - I - 0x029621 20:9611: F1        .byte $F1
- D - I - 0x029622 20:9612: A9        .byte $A9	; <ぞ>
- D - I - 0x029623 20:9613: C4        .byte $C4	; <ビ>
- D - I - 0x029624 20:9614: B8        .byte $B8	; <ゴ>
- D - I - 0x029625 20:9615: DB        .byte $DB
- D - I - 0x029626 20:9616: 00        .byte $00
- D - I - 0x029627 20:9617: F0        .byte $F0

off_9618_78:
- D - I - 0x029628 20:9618: F5        .byte $F5
- D - I - 0x029629 20:9619: 80        .byte $80
off_961A:
- D - I - 0x02962A 20:961A: F4        .byte $F4
- D - I - 0x02962B 20:961B: 08        .byte $08	; <く>
- D - I - 0x02962C 20:961C: 09        .byte $09	; <け>
- D - I - 0x02962D 20:961D: 0A        .byte $0A	; <こ>
- D - I - 0x02962E 20:961E: 0B        .byte $0B	; <さ>
- D - I - 0x02962F 20:961F: F1        .byte $F1
- D - I - 0x029630 20:9620: 62        .byte $62	; <メ>
- D - I - 0x029631 20:9621: 5E        .byte $5E	; <ホ>
- D - I - 0x029632 20:9622: 20        .byte $20	; <み>
- D - I - 0x029633 20:9623: BB        .byte $BB	; <ズ>
- D - I - 0x029634 20:9624: 0D        .byte $0D	; <す>
- D - I - 0x029635 20:9625: F1        .byte $F1
- D - I - 0x029636 20:9626: 62        .byte $62	; <メ>
- D - I - 0x029637 20:9627: 5D        .byte $5D	; <ヘ>
- D - I - 0x029638 20:9628: 20        .byte $20	; <み>
- D - I - 0x029639 20:9629: BB        .byte $BB	; <ズ>
- D - I - 0x02963A 20:962A: 09        .byte $09	; <け>
- D - I - 0x02963B 20:962B: F1        .byte $F1
- D - I - 0x02963C 20:962C: 62        .byte $62	; <メ>
- D - I - 0x02963D 20:962D: 5C        .byte $5C	; <フ>
- D - I - 0x02963E 20:962E: 20        .byte $20	; <み>
- D - I - 0x02963F 20:962F: BB        .byte $BB	; <ズ>
- D - I - 0x029640 20:9630: 05        .byte $05	; <お>
- D - I - 0x029641 20:9631: F1        .byte $F1
- D - I - 0x029642 20:9632: 63        .byte $63	; <モ>
- D - I - 0x029643 20:9633: 49        .byte $49	; <ケ>
- D - I - 0x029644 20:9634: A0        .byte $A0	; <が>
- D - I - 0x029645 20:9635: 9F        .byte $9F
- D - I - 0x029646 20:9636: 00        .byte $00
- D - I - 0x029647 20:9637: 14        .byte $14	; <と>
- D - I - 0x029648 20:9638: F4        .byte $F4
- D - I - 0x029649 20:9639: 0A        .byte $0A	; <こ>
- D - I - 0x02964A 20:963A: 0B        .byte $0B	; <さ>
- D - I - 0x02964B 20:963B: 00        .byte $00
- D - I - 0x02964C 20:963C: 00        .byte $00
- D - I - 0x02964D 20:963D: F6        .byte $F6
- D - I - 0x02964E 20:963E: 00        .byte $00
- D - I - 0x02964F 20:963F: F6        .byte $F6
- D - I - 0x029650 20:9640: 2A        .byte $2A	; <れ>
- D - I - 0x029651 20:9641: F6        .byte $F6
- D - I - 0x029652 20:9642: 3F        .byte $3F	; <•>
- D - I - 0x029653 20:9643: F1        .byte $F1
- D - I - 0x029654 20:9644: 00        .byte $00
- D - I - 0x029655 20:9645: 85        .byte $85	; <E>
- D - I - 0x029656 20:9646: 08        .byte $08	; <く>
- D - I - 0x029657 20:9647: BB        .byte $BB	; <ズ>
- D - I - 0x029658 20:9648: 05        .byte $05	; <お>
- D - I - 0x029659 20:9649: 02        .byte $02	; <い>
- D - I - 0x02965A 20:964A: F1        .byte $F1
- D - I - 0x02965B 20:964B: 8E        .byte $8E	; <L>
- D - I - 0x02965C 20:964C: 84        .byte $84	; <D>
- D - I - 0x02965D 20:964D: 0C        .byte $0C	; <し>
- D - I - 0x02965E 20:964E: BB        .byte $BB	; <ズ>
- D - I - 0x02965F 20:964F: 05        .byte $05	; <お>
- D - I - 0x029660 20:9650: F0        .byte $F0

off_9651_79:
- D - I - 0x029661 20:9651: F5        .byte $F5
- D - I - 0x029662 20:9652: 09        .byte $09	; <け>
- D - I - 0x029663 20:9653: F4        .byte $F4
- D - I - 0x029664 20:9654: 60        .byte $60	; <ミ>
- D - I - 0x029665 20:9655: 61        .byte $61	; <ム>
- D - I - 0x029666 20:9656: 62        .byte $62	; <メ>
- D - I - 0x029667 20:9657: 63        .byte $63	; <モ>
- D - I - 0x029668 20:9658: F1        .byte $F1
- D - I - 0x029669 20:9659: 00        .byte $00
- D - I - 0x02966A 20:965A: 79        .byte $79	; <!>
- D - I - 0x02966B 20:965B: F0        .byte $F0
- D - I - 0x02966C 20:965C: BB        .byte $BB	; <ズ>
- D - I - 0x02966D 20:965D: 00        .byte $00
- D - I - 0x02966E 20:965E: F0        .byte $F0
off_965F_7A:
- D - I - 0x02966F 20:965F: F5        .byte $F5
- D - I - 0x029670 20:9660: 80        .byte $80
- D - I - 0x029671 20:9661: F4        .byte $F4
- D - I - 0x029672 20:9662: 0C        .byte $0C	; <し>
- D - I - 0x029673 20:9663: 0D        .byte $0D	; <す>
- D - I - 0x029674 20:9664: 0E        .byte $0E	; <せ>
- D - I - 0x029675 20:9665: 0F        .byte $0F	; <そ>
- D - I - 0x029676 20:9666: F1        .byte $F1
- D - I - 0x029677 20:9667: 65        .byte $65	; <ユ>
- D - I - 0x029678 20:9668: 1E        .byte $1E	; <ほ>
- D - I - 0x029679 20:9669: D0        .byte $D0	; <ペ>
- D - I - 0x02967A 20:966A: 93        .byte $93	; <Y>
- D - I - 0x02967B 20:966B: 00        .byte $00
- D - I - 0x02967C 20:966C: F1        .byte $F1
- D - I - 0x02967D 20:966D: 64        .byte $64	; <ヤ>
- D - I - 0x02967E 20:966E: 1D        .byte $1D	; <へ>
- D - I - 0x02967F 20:966F: 1F        .byte $1F	; <ま>
- D - I - 0x029680 20:9670: B7        .byte $B7	; <ゲ>
- D - I - 0x029681 20:9671: 05        .byte $05	; <お>
- D - I - 0x029682 20:9672: 14        .byte $14	; <と>
- D - I - 0x029683 20:9673: F6        .byte $F6
- D - I - 0x029684 20:9674: 00        .byte $00
- D - I - 0x029685 20:9675: F1        .byte $F1
- D - I - 0x029686 20:9676: 00        .byte $00
- D - I - 0x029687 20:9677: 3F        .byte $3F	; <•>
- D - I - 0x029688 20:9678: 16        .byte $16	; <に>
- D - I - 0x029689 20:9679: B3        .byte $B3	; <ぼ>
- D - I - 0x02968A 20:967A: 05        .byte $05	; <お>
- D - I - 0x02968B 20:967B: 04        .byte $04	; <え>
- D - I - 0x02968C 20:967C: F1        .byte $F1
- D - I - 0x02968D 20:967D: 66        .byte $66	; <ヨ>
- D - I - 0x02968E 20:967E: 1D        .byte $1D	; <へ>
- D - I - 0x02968F 20:967F: 16        .byte $16	; <に>
- D - I - 0x029690 20:9680: B3        .byte $B3	; <ぼ>
- D - I - 0x029691 20:9681: 05        .byte $05	; <お>
- D - I - 0x029692 20:9682: F1        .byte $F1
- D - I - 0x029693 20:9683: A7        .byte $A7	; <ず>
- D - I - 0x029694 20:9684: 22        .byte $22	; <め>
- D - I - 0x029695 20:9685: 0E        .byte $0E	; <せ>
- D - I - 0x029696 20:9686: AF        .byte $AF	; <ば>
- D - I - 0x029697 20:9687: 01        .byte $01	; <あ>
- D - I - 0x029698 20:9688: F0        .byte $F0
off_9689_7B:
- D - I - 0x029699 20:9689: F5        .byte $F5
- D - I - 0x02969A 20:968A: 09        .byte $09	; <け>
- D - I - 0x02969B 20:968B: F4        .byte $F4
- D - I - 0x02969C 20:968C: 04        .byte $04	; <え>
- D - I - 0x02969D 20:968D: 05        .byte $05	; <お>
- D - I - 0x02969E 20:968E: 00        .byte $00
- D - I - 0x02969F 20:968F: 00        .byte $00
- D - I - 0x0296A0 20:9690: F1        .byte $F1
- D - I - 0x0296A1 20:9691: 83        .byte $83	; <C>
- D - I - 0x0296A2 20:9692: BA        .byte $BA	; <ジ>
- D - I - 0x0296A3 20:9693: B8        .byte $B8	; <ゴ>
- D - I - 0x0296A4 20:9694: BB        .byte $BB	; <ズ>
- D - I - 0x0296A5 20:9695: 00        .byte $00
- D - I - 0x0296A6 20:9696: F0        .byte $F0
off_9697_7C:
- D - I - 0x0296A7 20:9697: F5        .byte $F5
- D - I - 0x0296A8 20:9698: 87        .byte $87	; <G>
- D - I - 0x0296A9 20:9699: F4        .byte $F4
- D - I - 0x0296AA 20:969A: 08        .byte $08	; <く>
- D - I - 0x0296AB 20:969B: 09        .byte $09	; <け>
- D - I - 0x0296AC 20:969C: 0A        .byte $0A	; <こ>
- D - I - 0x0296AD 20:969D: 0B        .byte $0B	; <さ>
- D - I - 0x0296AE 20:969E: F1        .byte $F1
- D - I - 0x0296AF 20:969F: AC        .byte $AC	; <づ>
- D - I - 0x0296B0 20:96A0: 49        .byte $49	; <ケ>
- D - I - 0x0296B1 20:96A1: 9C        .byte $9C
- D - I - 0x0296B2 20:96A2: 63        .byte $63	; <モ>
- D - I - 0x0296B3 20:96A3: 00        .byte $00
- D - I - 0x0296B4 20:96A4: F1        .byte $F1
- D - I - 0x0296B5 20:96A5: 67        .byte $67	; <ラ>
- D - I - 0x0296B6 20:96A6: 94        .byte $94
- D - I - 0x0296B7 20:96A7: F0        .byte $F0
- D - I - 0x0296B8 20:96A8: B3        .byte $B3	; <ぼ>
- D - I - 0x0296B9 20:96A9: 04        .byte $04	; <え>
- D - I - 0x0296BA 20:96AA: F1        .byte $F1
- D - I - 0x0296BB 20:96AB: 67        .byte $67	; <ラ>
- D - I - 0x0296BC 20:96AC: 95        .byte $95
- D - I - 0x0296BD 20:96AD: F0        .byte $F0
- D - I - 0x0296BE 20:96AE: B3        .byte $B3	; <ぼ>
- D - I - 0x0296BF 20:96AF: 08        .byte $08	; <く>
- D - I - 0x0296C0 20:96B0: F1        .byte $F1
- D - I - 0x0296C1 20:96B1: 67        .byte $67	; <ラ>
- D - I - 0x0296C2 20:96B2: 96        .byte $96
- D - I - 0x0296C3 20:96B3: F0        .byte $F0
- D - I - 0x0296C4 20:96B4: B3        .byte $B3	; <ぼ>
- D - I - 0x0296C5 20:96B5: 0C        .byte $0C	; <し>
- D - I - 0x0296C6 20:96B6: 16        .byte $16	; <に>
- D - I - 0x0296C7 20:96B7: F4        .byte $F4
- D - I - 0x0296C8 20:96B8: 0A        .byte $0A	; <こ>
- D - I - 0x0296C9 20:96B9: 0B        .byte $0B	; <さ>
- D - I - 0x0296CA 20:96BA: 00        .byte $00
- D - I - 0x0296CB 20:96BB: 00        .byte $00
- D - I - 0x0296CC 20:96BC: F6        .byte $F6
- D - I - 0x0296CD 20:96BD: 00        .byte $00
- D - I - 0x0296CE 20:96BE: F6        .byte $F6
- D - I - 0x0296CF 20:96BF: 2A        .byte $2A	; <れ>
- D - I - 0x0296D0 20:96C0: F6        .byte $F6
- D - I - 0x0296D1 20:96C1: 3F        .byte $3F	; <•>
- D - I - 0x0296D2 20:96C2: F1        .byte $F1
- D - I - 0x0296D3 20:96C3: 00        .byte $00
- D - I - 0x0296D4 20:96C4: 84        .byte $84	; <D>
- D - I - 0x0296D5 20:96C5: 20        .byte $20	; <み>
- D - I - 0x0296D6 20:96C6: BB        .byte $BB	; <ズ>
- D - I - 0x0296D7 20:96C7: 05        .byte $05	; <お>
- D - I - 0x0296D8 20:96C8: 04        .byte $04	; <え>
- D - I - 0x0296D9 20:96C9: F1        .byte $F1
- D - I - 0x0296DA 20:96CA: 68        .byte $68	; <リ>
- D - I - 0x0296DB 20:96CB: 85        .byte $85	; <E>
- D - I - 0x0296DC 20:96CC: 20        .byte $20	; <み>
- D - I - 0x0296DD 20:96CD: BB        .byte $BB	; <ズ>
- D - I - 0x0296DE 20:96CE: 05        .byte $05	; <お>
- D - I - 0x0296DF 20:96CF: F8        .byte $F8
- D - I - 0x0296E0 20:96D0: 0C 99     .word off_990C
off_96D2_7D:
- D - I - 0x0296E2 20:96D2: F5        .byte $F5
- D - I - 0x0296E3 20:96D3: 83        .byte $83	; <C>
- D - I - 0x0296E4 20:96D4: F4        .byte $F4
- D - I - 0x0296E5 20:96D5: 18        .byte $18	; <ね>
- D - I - 0x0296E6 20:96D6: 19        .byte $19	; <の>
- D - I - 0x0296E7 20:96D7: 1A        .byte $1A	; <は>
- D - I - 0x0296E8 20:96D8: 2B        .byte $2B	; <ろ>
- D - I - 0x0296E9 20:96D9: F7        .byte $F7
- D - I - 0x0296EA 20:96DA: 03        .byte $03	; <う>
- D - I - 0x0296EB 20:96DB: 7B        .byte $7B	; <。>
- D - I - 0x0296EC 20:96DC: F1        .byte $F1
- D - I - 0x0296ED 20:96DD: 30        .byte $30	; <ゃ>
- D - I - 0x0296EE 20:96DE: 00        .byte $00
- D - I - 0x0296EF 20:96DF: 80        .byte $80
- D - I - 0x0296F0 20:96E0: 9B        .byte $9B
- D - I - 0x0296F1 20:96E1: 04        .byte $04	; <え>
- D - I - 0x0296F2 20:96E2: F1        .byte $F1
- D - I - 0x0296F3 20:96E3: 43        .byte $43	; <ウ>
- D - I - 0x0296F4 20:96E4: 00        .byte $00
- D - I - 0x0296F5 20:96E5: 80        .byte $80
- D - I - 0x0296F6 20:96E6: E4        .byte $E4
- D - I - 0x0296F7 20:96E7: 08        .byte $08	; <く>
- D - I - 0x0296F8 20:96E8: F1        .byte $F1
- D - I - 0x0296F9 20:96E9: 2C        .byte $2C	; <わ>
- D - I - 0x0296FA 20:96EA: ED        .byte $ED
- D - I - 0x0296FB 20:96EB: 70        .byte $70	; <ャ>
- D - I - 0x0296FC 20:96EC: C3        .byte $C3	; <バ>
- D - I - 0x0296FD 20:96ED: 11        .byte $11	; <ち>
- D - I - 0x0296FE 20:96EE: C0        .byte $C0	; <ヅ>
- D - I - 0x0296FF 20:96EF: F7        .byte $F7
- D - I - 0x029700 20:96F0: 1C        .byte $1C	; <ふ>
- D - I - 0x029701 20:96F1: 63        .byte $63	; <モ>
- D - I - 0x029702 20:96F2: F1        .byte $F1
- D - I - 0x029703 20:96F3: 00        .byte $00
- D - I - 0x029704 20:96F4: 00        .byte $00
- D - I - 0x029705 20:96F5: 80        .byte $80
- D - I - 0x029706 20:96F6: E3        .byte $E3
- D - I - 0x029707 20:96F7: 0C        .byte $0C	; <し>
- D - I - 0x029708 20:96F8: 10        .byte $10	; <た>
- D - I - 0x029709 20:96F9: F7        .byte $F7
- D - I - 0x02970A 20:96FA: 24        .byte $24	; <や>
- D - I - 0x02970B 20:96FB: 5B        .byte $5B	; <ヒ>
- D - I - 0x02970C 20:96FC: F1        .byte $F1
- D - I - 0x02970D 20:96FD: 00        .byte $00
- D - I - 0x02970E 20:96FE: 00        .byte $00
- D - I - 0x02970F 20:96FF: 80        .byte $80
- D - I - 0x029710 20:9700: A4        .byte $A4	; <ご>
- D - I - 0x029711 20:9701: 00        .byte $00
- D - I - 0x029712 20:9702: F1        .byte $F1
- D - I - 0x029713 20:9703: 00        .byte $00
- D - I - 0x029714 20:9704: 00        .byte $00
- D - I - 0x029715 20:9705: 80        .byte $80
- D - I - 0x029716 20:9706: DB        .byte $DB
- D - I - 0x029717 20:9707: 0C        .byte $0C	; <し>
- D - I - 0x029718 20:9708: 10        .byte $10	; <た>
- D - I - 0x029719 20:9709: F7        .byte $F7
- D - I - 0x02971A 20:970A: 2B        .byte $2B	; <ろ>
- D - I - 0x02971B 20:970B: 53        .byte $53	; <テ>
- D - I - 0x02971C 20:970C: F1        .byte $F1
- D - I - 0x02971D 20:970D: 00        .byte $00
- D - I - 0x02971E 20:970E: 00        .byte $00
- D - I - 0x02971F 20:970F: 80        .byte $80
- D - I - 0x029720 20:9710: AB        .byte $AB	; <ぢ>
- D - I - 0x029721 20:9711: 00        .byte $00
- D - I - 0x029722 20:9712: F1        .byte $F1
- D - I - 0x029723 20:9713: 00        .byte $00
- D - I - 0x029724 20:9714: 00        .byte $00
- D - I - 0x029725 20:9715: 80        .byte $80
- D - I - 0x029726 20:9716: D3        .byte $D3
- D - I - 0x029727 20:9717: 0C        .byte $0C	; <し>
- D - I - 0x029728 20:9718: 10        .byte $10	; <た>
- D - I - 0x029729 20:9719: F7        .byte $F7
- D - I - 0x02972A 20:971A: 33        .byte $33	; <0>
- D - I - 0x02972B 20:971B: 4B        .byte $4B	; <サ>
- D - I - 0x02972C 20:971C: F1        .byte $F1
- D - I - 0x02972D 20:971D: 00        .byte $00
- D - I - 0x02972E 20:971E: 00        .byte $00
- D - I - 0x02972F 20:971F: 80        .byte $80
- D - I - 0x029730 20:9720: B3        .byte $B3	; <ぼ>
- D - I - 0x029731 20:9721: 00        .byte $00
- D - I - 0x029732 20:9722: F1        .byte $F1
- D - I - 0x029733 20:9723: 00        .byte $00
- D - I - 0x029734 20:9724: 00        .byte $00
- D - I - 0x029735 20:9725: 80        .byte $80
- D - I - 0x029736 20:9726: CB        .byte $CB	; <ぺ>
- D - I - 0x029737 20:9727: 0C        .byte $0C	; <し>
- D - I - 0x029738 20:9728: 60        .byte $60	; <ミ>
- D - I - 0x029739 20:9729: F7        .byte $F7
- D - I - 0x02973A 20:972A: 03        .byte $03	; <う>
- D - I - 0x02973B 20:972B: 7B        .byte $7B	; <。>
- D - I - 0x02973C 20:972C: F6        .byte $F6
- D - I - 0x02973D 20:972D: 00        .byte $00
- D - I - 0x02973E 20:972E: F6        .byte $F6
- D - I - 0x02973F 20:972F: 15        .byte $15	; <な>
- D - I - 0x029740 20:9730: F6        .byte $F6
- D - I - 0x029741 20:9731: 2A        .byte $2A	; <れ>
- D - I - 0x029742 20:9732: F6        .byte $F6
- D - I - 0x029743 20:9733: 3F        .byte $3F	; <•>
- D - I - 0x029744 20:9734: F1        .byte $F1
- D - I - 0x029745 20:9735: 2E        .byte $2E	; <ん>
- D - I - 0x029746 20:9736: 17        .byte $17	; <ぬ>
- D - I - 0x029747 20:9737: 00        .byte $00
- D - I - 0x029748 20:9738: C3        .byte $C3	; <バ>
- D - I - 0x029749 20:9739: 11        .byte $11	; <ち>
- D - I - 0x02974A 20:973A: F0        .byte $F0
off_973B_7E:
- D - I - 0x02974B 20:973B: F5        .byte $F5
- D - I - 0x02974C 20:973C: 09        .byte $09	; <け>
- D - I - 0x02974D 20:973D: F4        .byte $F4
- D - I - 0x02974E 20:973E: 06        .byte $06	; <か>
- D - I - 0x02974F 20:973F: 00        .byte $00
- D - I - 0x029750 20:9740: 00        .byte $00
- D - I - 0x029751 20:9741: 00        .byte $00
- D - I - 0x029752 20:9742: F1        .byte $F1
- D - I - 0x029753 20:9743: 84        .byte $84	; <D>
- D - I - 0x029754 20:9744: B6        .byte $B6	; <グ>
- D - I - 0x029755 20:9745: E0        .byte $E0
- D - I - 0x029756 20:9746: 63        .byte $63	; <モ>
- D - I - 0x029757 20:9747: 00        .byte $00
- D - I - 0x029758 20:9748: F0        .byte $F0
off_9749_7F:
- D - I - 0x029759 20:9749: F5        .byte $F5
- D - I - 0x02975A 20:974A: 82        .byte $82	; <B>
- D - I - 0x02975B 20:974B: F4        .byte $F4
- D - I - 0x02975C 20:974C: 04        .byte $04	; <え>
- D - I - 0x02975D 20:974D: 05        .byte $05	; <お>
- D - I - 0x02975E 20:974E: 22        .byte $22	; <め>
- D - I - 0x02975F 20:974F: 00        .byte $00
- D - I - 0x029760 20:9750: F1        .byte $F1
- D - I - 0x029761 20:9751: 00        .byte $00
- D - I - 0x029762 20:9752: 8A        .byte $8A	; <N>
- D - I - 0x029763 20:9753: 20        .byte $20	; <み>
- D - I - 0x029764 20:9754: CB        .byte $CB	; <ぺ>
- D - I - 0x029765 20:9755: 05        .byte $05	; <お>
- D - I - 0x029766 20:9756: 06        .byte $06	; <か>
- D - I - 0x029767 20:9757: F1        .byte $F1
- D - I - 0x029768 20:9758: 69        .byte $69	; <ル>
- D - I - 0x029769 20:9759: BA        .byte $BA	; <ジ>
- D - I - 0x02976A 20:975A: 18        .byte $18	; <ね>
- D - I - 0x02976B 20:975B: D3        .byte $D3
- D - I - 0x02976C 20:975C: 01        .byte $01	; <あ>
- D - I - 0x02976D 20:975D: F8        .byte $F8
- D - I - 0x02976E 20:975E: A7 8B     .word off_8BA7
off_9760_80:
- D - I - 0x029770 20:9760: F5        .byte $F5
- D - I - 0x029771 20:9761: 09        .byte $09	; <け>
- D - I - 0x029772 20:9762: F4        .byte $F4
- D - I - 0x029773 20:9763: 06        .byte $06	; <か>
- D - I - 0x029774 20:9764: 00        .byte $00
- D - I - 0x029775 20:9765: 00        .byte $00
- D - I - 0x029776 20:9766: 00        .byte $00
- D - I - 0x029777 20:9767: F1        .byte $F1
- D - I - 0x029778 20:9768: 85        .byte $85	; <E>
- D - I - 0x029779 20:9769: B7        .byte $B7	; <ゲ>
- D - I - 0x02977A 20:976A: 60        .byte $60	; <ミ>
- D - I - 0x02977B 20:976B: 93        .byte $93	; <Y>
- D - I - 0x02977C 20:976C: 00        .byte $00
- D - I - 0x02977D 20:976D: F0        .byte $F0
off_976E_81:
- D - I - 0x02977E 20:976E: F5        .byte $F5
- D - I - 0x02977F 20:976F: 80        .byte $80
- D - I - 0x029780 20:9770: F4        .byte $F4
- D - I - 0x029781 20:9771: 04        .byte $04	; <え>
- D - I - 0x029782 20:9772: 05        .byte $05	; <お>
- D - I - 0x029783 20:9773: 23        .byte $23	; <も>
- D - I - 0x029784 20:9774: 00        .byte $00
- D - I - 0x029785 20:9775: F1        .byte $F1
- D - I - 0x029786 20:9776: AE        .byte $AE	; <ど>
- D - I - 0x029787 20:9777: BA        .byte $BA	; <ジ>
- D - I - 0x029788 20:9778: D0        .byte $D0	; <ペ>
- D - I - 0x029789 20:9779: B5        .byte $B5	; <ギ>
- D - I - 0x02978A 20:977A: 00        .byte $00
- D - I - 0x02978B 20:977B: F1        .byte $F1
- D - I - 0x02978C 20:977C: 6A        .byte $6A	; <レ>
- D - I - 0x02978D 20:977D: 8B        .byte $8B	; <K>
- D - I - 0x02978E 20:977E: C0        .byte $C0	; <ヅ>
- D - I - 0x02978F 20:977F: C5        .byte $C5	; <ブ>
- D - I - 0x029790 20:9780: 04        .byte $04	; <え>
- D - I - 0x029791 20:9781: F8        .byte $F8
- D - I - 0x029792 20:9782: A7 8B     .word off_8BA7
off_9784_82:
- D - I - 0x029794 20:9784: F5        .byte $F5
- D - I - 0x029795 20:9785: 80        .byte $80
- D - I - 0x029796 20:9786: F4        .byte $F4
- D - I - 0x029797 20:9787: 04        .byte $04	; <え>
- D - I - 0x029798 20:9788: 05        .byte $05	; <お>
- D - I - 0x029799 20:9789: 23        .byte $23	; <も>
- D - I - 0x02979A 20:978A: 00        .byte $00
- D - I - 0x02979B 20:978B: F1        .byte $F1
- D - I - 0x02979C 20:978C: AF        .byte $AF	; <ば>
- D - I - 0x02979D 20:978D: BA        .byte $BA	; <ジ>
- D - I - 0x02979E 20:978E: D0        .byte $D0	; <ペ>
- D - I - 0x02979F 20:978F: D7        .byte $D7
- D - I - 0x0297A0 20:9790: 00        .byte $00
- D - I - 0x0297A1 20:9791: F1        .byte $F1
- D - I - 0x0297A2 20:9792: 00        .byte $00
- D - I - 0x0297A3 20:9793: 30        .byte $30	; <ゃ>
- D - I - 0x0297A4 20:9794: C8        .byte $C8	; <ぱ>
- D - I - 0x0297A5 20:9795: CF        .byte $CF	; <プ>
- D - I - 0x0297A6 20:9796: 04        .byte $04	; <え>
- D - I - 0x0297A7 20:9797: F0        .byte $F0
off_9798_83:
- D - I - 0x0297A8 20:9798: F5        .byte $F5
- D - I - 0x0297A9 20:9799: 80        .byte $80
- D - I - 0x0297AA 20:979A: F4        .byte $F4
- D - I - 0x0297AB 20:979B: 04        .byte $04	; <え>
- D - I - 0x0297AC 20:979C: 05        .byte $05	; <お>
- D - I - 0x0297AD 20:979D: 22        .byte $22	; <め>
- D - I - 0x0297AE 20:979E: 00        .byte $00
- D - I - 0x0297AF 20:979F: F1        .byte $F1
- D - I - 0x0297B0 20:97A0: 00        .byte $00
- D - I - 0x0297B1 20:97A1: 31        .byte $31	; <ゅ>
- D - I - 0x0297B2 20:97A2: E4        .byte $E4
- D - I - 0x0297B3 20:97A3: CB        .byte $CB	; <ぺ>
- D - I - 0x0297B4 20:97A4: 04        .byte $04	; <え>
- D - I - 0x0297B5 20:97A5: 06        .byte $06	; <か>
- D - I - 0x0297B6 20:97A6: F1        .byte $F1
- D - I - 0x0297B7 20:97A7: B0        .byte $B0	; <び>
- D - I - 0x0297B8 20:97A8: BA        .byte $BA	; <ジ>
- D - I - 0x0297B9 20:97A9: E8        .byte $E8
- D - I - 0x0297BA 20:97AA: DB        .byte $DB
- D - I - 0x0297BB 20:97AB: 00        .byte $00
- D - I - 0x0297BC 20:97AC: F8        .byte $F8
- D - I - 0x0297BD 20:97AD: A7 8B     .word off_8BA7
off_97AF_84:
- D - I - 0x0297BF 20:97AF: F5        .byte $F5
- D - I - 0x0297C0 20:97B0: 09        .byte $09	; <け>
- D - I - 0x0297C1 20:97B1: F4        .byte $F4
- D - I - 0x0297C2 20:97B2: 04        .byte $04	; <え>
- D - I - 0x0297C3 20:97B3: 05        .byte $05	; <お>
- D - I - 0x0297C4 20:97B4: 00        .byte $00
- D - I - 0x0297C5 20:97B5: 00        .byte $00
- D - I - 0x0297C6 20:97B6: F1        .byte $F1
- D - I - 0x0297C7 20:97B7: 86        .byte $86	; <F>
- D - I - 0x0297C8 20:97B8: C4        .byte $C4	; <ビ>
- D - I - 0x0297C9 20:97B9: A8        .byte $A8	; <ぜ>
- D - I - 0x0297CA 20:97BA: AB        .byte $AB	; <ぢ>
- D - I - 0x0297CB 20:97BB: 00        .byte $00
- D - I - 0x0297CC 20:97BC: F0        .byte $F0
off_97BD_85:
- D - I - 0x0297CD 20:97BD: F5        .byte $F5
- D - I - 0x0297CE 20:97BE: 83        .byte $83	; <C>
- D - I - 0x0297CF 20:97BF: F4        .byte $F4
- D - I - 0x0297D0 20:97C0: 04        .byte $04	; <え>
- D - I - 0x0297D1 20:97C1: 05        .byte $05	; <お>
- D - I - 0x0297D2 20:97C2: 1E        .byte $1E	; <ほ>
- D - I - 0x0297D3 20:97C3: 1F        .byte $1F	; <ま>
- D - I - 0x0297D4 20:97C4: F1        .byte $F1
- D - I - 0x0297D5 20:97C5: 00        .byte $00
- D - I - 0x0297D6 20:97C6: 8E        .byte $8E	; <L>
- D - I - 0x0297D7 20:97C7: 00        .byte $00
- D - I - 0x0297D8 20:97C8: EB        .byte $EB
- D - I - 0x0297D9 20:97C9: 01        .byte $01	; <あ>
off_97CA:
- D - I - 0x0297DA 20:97CA: F1        .byte $F1
- D - I - 0x0297DB 20:97CB: 00        .byte $00
- D - I - 0x0297DC 20:97CC: 8C        .byte $8C	; <M>
- D - I - 0x0297DD 20:97CD: 00        .byte $00
- D - I - 0x0297DE 20:97CE: D3        .byte $D3
- D - I - 0x0297DF 20:97CF: 05        .byte $05	; <お>
- D - I - 0x0297E0 20:97D0: F0        .byte $F0
off_97D1_86:
- D - I - 0x0297E1 20:97D1: F5        .byte $F5
- D - I - 0x0297E2 20:97D2: 83        .byte $83	; <C>
- D - I - 0x0297E3 20:97D3: F4        .byte $F4
- D - I - 0x0297E4 20:97D4: 04        .byte $04	; <え>
- D - I - 0x0297E5 20:97D5: 05        .byte $05	; <お>
- D - I - 0x0297E6 20:97D6: 1E        .byte $1E	; <ほ>
- D - I - 0x0297E7 20:97D7: 1F        .byte $1F	; <ま>
- D - I - 0x0297E8 20:97D8: F1        .byte $F1
- D - I - 0x0297E9 20:97D9: 6C        .byte $6C	; <ワ>
- D - I - 0x0297EA 20:97DA: B8        .byte $B8	; <ゴ>
- D - I - 0x0297EB 20:97DB: 00        .byte $00
- D - I - 0x0297EC 20:97DC: EB        .byte $EB
- D - I - 0x0297ED 20:97DD: 01        .byte $01	; <あ>
off_97DE:
- D - I - 0x0297EE 20:97DE: F1        .byte $F1
- D - I - 0x0297EF 20:97DF: 6B        .byte $6B	; <ロ>
- D - I - 0x0297F0 20:97E0: 8D        .byte $8D	; <P>
- D - I - 0x0297F1 20:97E1: 10        .byte $10	; <た>
- D - I - 0x0297F2 20:97E2: C7        .byte $C7	; <ボ>
- D - I - 0x0297F3 20:97E3: 05        .byte $05	; <お>
- D - I - 0x0297F4 20:97E4: F8        .byte $F8
- D - I - 0x0297F5 20:97E5: A7 8B     .word off_8BA7
off_97E7_87:
- D - I - 0x0297F7 20:97E7: F5        .byte $F5
- D - I - 0x0297F8 20:97E8: 83        .byte $83	; <C>
- D - I - 0x0297F9 20:97E9: F4        .byte $F4
- D - I - 0x0297FA 20:97EA: 04        .byte $04	; <え>
- D - I - 0x0297FB 20:97EB: 05        .byte $05	; <お>
- D - I - 0x0297FC 20:97EC: 1E        .byte $1E	; <ほ>
- D - I - 0x0297FD 20:97ED: 1F        .byte $1F	; <ま>
- D - I - 0x0297FE 20:97EE: F1        .byte $F1
- D - I - 0x0297FF 20:97EF: 6D        .byte $6D	; <ヲ>
- D - I - 0x029800 20:97F0: B8        .byte $B8	; <ゴ>
- D - I - 0x029801 20:97F1: 00        .byte $00
- D - I - 0x029802 20:97F2: EB        .byte $EB
- D - I - 0x029803 20:97F3: 01        .byte $01	; <あ>
- D - I - 0x029804 20:97F4: F8        .byte $F8
- D - I - 0x029805 20:97F5: DE 97     .word off_97DE
off_97F7_88:
- D - I - 0x029807 20:97F7: F5        .byte $F5
- D - I - 0x029808 20:97F8: 83        .byte $83	; <C>
- D - I - 0x029809 20:97F9: F4        .byte $F4
- D - I - 0x02980A 20:97FA: 04        .byte $04	; <え>
- D - I - 0x02980B 20:97FB: 05        .byte $05	; <お>
- D - I - 0x02980C 20:97FC: 1E        .byte $1E	; <ほ>
- D - I - 0x02980D 20:97FD: 1F        .byte $1F	; <ま>
- D - I - 0x02980E 20:97FE: F1        .byte $F1
- D - I - 0x02980F 20:97FF: 6E        .byte $6E	; <ン>
- D - I - 0x029810 20:9800: B8        .byte $B8	; <ゴ>
- D - I - 0x029811 20:9801: 00        .byte $00
- D - I - 0x029812 20:9802: EB        .byte $EB
- D - I - 0x029813 20:9803: 01        .byte $01	; <あ>
- D - I - 0x029814 20:9804: F8        .byte $F8
- D - I - 0x029815 20:9805: DE 97     .word off_97DE
off_9807_89:
- D - I - 0x029817 20:9807: F5        .byte $F5
- D - I - 0x029818 20:9808: 83        .byte $83	; <C>
- D - I - 0x029819 20:9809: F4        .byte $F4
- D - I - 0x02981A 20:980A: 04        .byte $04	; <え>
- D - I - 0x02981B 20:980B: 05        .byte $05	; <お>
- D - I - 0x02981C 20:980C: 1E        .byte $1E	; <ほ>
- D - I - 0x02981D 20:980D: 1F        .byte $1F	; <ま>
- D - I - 0x02981E 20:980E: F1        .byte $F1
- D - I - 0x02981F 20:980F: 6C        .byte $6C	; <ワ>
- D - I - 0x029820 20:9810: B8        .byte $B8	; <ゴ>
- D - I - 0x029821 20:9811: 00        .byte $00
- D - I - 0x029822 20:9812: EB        .byte $EB
- D - I - 0x029823 20:9813: 01        .byte $01	; <あ>
- D - I - 0x029824 20:9814: F8        .byte $F8
- D - I - 0x029825 20:9815: CA 97     .word off_97CA
off_9817_8A:
- D - I - 0x029827 20:9817: F5        .byte $F5
- D - I - 0x029828 20:9818: 83        .byte $83	; <C>
- D - I - 0x029829 20:9819: F4        .byte $F4
- D - I - 0x02982A 20:981A: 04        .byte $04	; <え>
- D - I - 0x02982B 20:981B: 05        .byte $05	; <お>
- D - I - 0x02982C 20:981C: 1E        .byte $1E	; <ほ>
- D - I - 0x02982D 20:981D: 1F        .byte $1F	; <ま>
- D - I - 0x02982E 20:981E: F1        .byte $F1
- D - I - 0x02982F 20:981F: 6E        .byte $6E	; <ン>
- D - I - 0x029830 20:9820: B8        .byte $B8	; <ゴ>
- D - I - 0x029831 20:9821: 00        .byte $00
- D - I - 0x029832 20:9822: EB        .byte $EB
- D - I - 0x029833 20:9823: 01        .byte $01	; <あ>
- D - I - 0x029834 20:9824: F8        .byte $F8
- D - I - 0x029835 20:9825: CA 97     .word off_97CA
off_9827_8B:
- D - I - 0x029837 20:9827: F5        .byte $F5
- D - I - 0x029838 20:9828: 80        .byte $80
- D - I - 0x029839 20:9829: F4        .byte $F4
- D - I - 0x02983A 20:982A: 20        .byte $20	; <み>
- D - I - 0x02983B 20:982B: 21        .byte $21	; <む>
- D - I - 0x02983C 20:982C: 00        .byte $00
- D - I - 0x02983D 20:982D: 00        .byte $00
- D - I - 0x02983E 20:982E: F1        .byte $F1
- D - I - 0x02983F 20:982F: 00        .byte $00
- D - I - 0x029840 20:9830: 8F        .byte $8F	; <S>
- D - I - 0x029841 20:9831: 10        .byte $10	; <た>
- D - I - 0x029842 20:9832: BB        .byte $BB	; <ズ>
- D - I - 0x029843 20:9833: 01        .byte $01	; <あ>
- D - I - 0x029844 20:9834: F0        .byte $F0
off_9835_8C:
- D - I - 0x029845 20:9835: F5        .byte $F5
- D - I - 0x029846 20:9836: 85        .byte $85	; <E>
- D - I - 0x029847 20:9837: F4        .byte $F4
- D - I - 0x029848 20:9838: 06        .byte $06	; <か>
- D - I - 0x029849 20:9839: 07        .byte $07	; <き>
- D - I - 0x02984A 20:983A: 00        .byte $00
- D - I - 0x02984B 20:983B: 00        .byte $00
- D - I - 0x02984C 20:983C: F1        .byte $F1
- D - I - 0x02984D 20:983D: 00        .byte $00
- D - I - 0x02984E 20:983E: 64        .byte $64	; <ヤ>
- D - I - 0x02984F 20:983F: 10        .byte $10	; <た>
- D - I - 0x029850 20:9840: D3        .byte $D3
- D - I - 0x029851 20:9841: 01        .byte $01	; <あ>
- D - I - 0x029852 20:9842: 10        .byte $10	; <た>
- D - I - 0x029853 20:9843: F1        .byte $F1
- D - I - 0x029854 20:9844: 00        .byte $00
- D - I - 0x029855 20:9845: 65        .byte $65	; <ユ>
- D - I - 0x029856 20:9846: 30        .byte $30	; <ゃ>
- D - I - 0x029857 20:9847: CB        .byte $CB	; <ぺ>
- D - I - 0x029858 20:9848: 05        .byte $05	; <お>
- D - I - 0x029859 20:9849: 04        .byte $04	; <え>
- D - I - 0x02985A 20:984A: F1        .byte $F1
- D - I - 0x02985B 20:984B: 00        .byte $00
- D - I - 0x02985C 20:984C: 67        .byte $67	; <ラ>
- D - I - 0x02985D 20:984D: 00        .byte $00
- D - I - 0x02985E 20:984E: D3        .byte $D3
- D - I - 0x02985F 20:984F: 05        .byte $05	; <お>
- D - I - 0x029860 20:9850: F1        .byte $F1
- D - I - 0x029861 20:9851: 00        .byte $00
- D - I - 0x029862 20:9852: 66        .byte $66	; <ヨ>
- D - I - 0x029863 20:9853: 00        .byte $00
- D - I - 0x029864 20:9854: D3        .byte $D3
- D - I - 0x029865 20:9855: 01        .byte $01	; <あ>
- D - I - 0x029866 20:9856: 06        .byte $06	; <か>
- D - I - 0x029867 20:9857: F6        .byte $F6
- D - I - 0x029868 20:9858: 15        .byte $15	; <な>
- D - I - 0x029869 20:9859: F1        .byte $F1
- D - I - 0x02986A 20:985A: 00        .byte $00
- D - I - 0x02986B 20:985B: 68        .byte $68	; <リ>
- D - I - 0x02986C 20:985C: C0        .byte $C0	; <ヅ>
- D - I - 0x02986D 20:985D: C3        .byte $C3	; <バ>
- D - I - 0x02986E 20:985E: 00        .byte $00
- D - I - 0x02986F 20:985F: 02        .byte $02	; <い>
- D - I - 0x029870 20:9860: F6        .byte $F6
- D - I - 0x029871 20:9861: 00        .byte $00
- D - I - 0x029872 20:9862: F0        .byte $F0
off_9863_8D:
- D - I - 0x029873 20:9863: F5        .byte $F5
- D - I - 0x029874 20:9864: 80        .byte $80
- D - I - 0x029875 20:9865: F4        .byte $F4
- D - I - 0x029876 20:9866: 20        .byte $20	; <み>
- D - I - 0x029877 20:9867: 21        .byte $21	; <む>
- D - I - 0x029878 20:9868: 00        .byte $00
- D - I - 0x029879 20:9869: 00        .byte $00
- D - I - 0x02987A 20:986A: F1        .byte $F1
- D - I - 0x02987B 20:986B: 00        .byte $00
- D - I - 0x02987C 20:986C: 90        .byte $90	; <U>
- D - I - 0x02987D 20:986D: 10        .byte $10	; <た>
- D - I - 0x02987E 20:986E: BB        .byte $BB	; <ズ>
- D - I - 0x02987F 20:986F: 01        .byte $01	; <あ>
- D - I - 0x029880 20:9870: F0        .byte $F0
off_9871_8E:
- D - I - 0x029881 20:9871: F5        .byte $F5
- D - I - 0x029882 20:9872: 80        .byte $80
- D - I - 0x029883 20:9873: F4        .byte $F4
- D - I - 0x029884 20:9874: 10        .byte $10	; <た>
- D - I - 0x029885 20:9875: 11        .byte $11	; <ち>
- D - I - 0x029886 20:9876: 12        .byte $12	; <つ>
- D - I - 0x029887 20:9877: 13        .byte $13	; <て>
- D - I - 0x029888 20:9878: F1        .byte $F1
- D - I - 0x029889 20:9879: D0        .byte $D0	; <ペ>
- D - I - 0x02988A 20:987A: 2E        .byte $2E	; <ん>
- D - I - 0x02988B 20:987B: 20        .byte $20	; <み>
- D - I - 0x02988C 20:987C: B3        .byte $B3	; <ぼ>
- D - I - 0x02988D 20:987D: 05        .byte $05	; <お>
- D - I - 0x02988E 20:987E: F1        .byte $F1
- D - I - 0x02988F 20:987F: B2        .byte $B2	; <べ>
- D - I - 0x029890 20:9880: 2D        .byte $2D	; <を>
- D - I - 0x029891 20:9881: 18        .byte $18	; <ね>
- D - I - 0x029892 20:9882: BB        .byte $BB	; <ズ>
- D - I - 0x029893 20:9883: 01        .byte $01	; <あ>
- D - I - 0x029894 20:9884: F0        .byte $F0
off_9885_8F:
- D - I - 0x029895 20:9885: F5        .byte $F5
- D - I - 0x029896 20:9886: 0A        .byte $0A	; <こ>
- D - I - 0x029897 20:9887: F4        .byte $F4
- D - I - 0x029898 20:9888: 2C        .byte $2C	; <わ>
- D - I - 0x029899 20:9889: 0B        .byte $0B	; <さ>
- D - I - 0x02989A 20:988A: 05        .byte $05	; <お>
- D - I - 0x02989B 20:988B: 07        .byte $07	; <き>
- D - I - 0x02989C 20:988C: F1        .byte $F1
- D - I - 0x02989D 20:988D: 00        .byte $00
- D - I - 0x02989E 20:988E: 91        .byte $91	; <V>
- D - I - 0x02989F 20:988F: 00        .byte $00
- D - I - 0x0298A0 20:9890: D3        .byte $D3
- D - I - 0x0298A1 20:9891: 01        .byte $01	; <あ>
- D - I - 0x0298A2 20:9892: F1        .byte $F1
- D - I - 0x0298A3 20:9893: 70        .byte $70	; <ャ>
- D - I - 0x0298A4 20:9894: 92        .byte $92	; <W>
- D - I - 0x0298A5 20:9895: 28        .byte $28	; <り>
- D - I - 0x0298A6 20:9896: C3        .byte $C3	; <バ>
- D - I - 0x0298A7 20:9897: 05        .byte $05	; <お>
- D - I - 0x0298A8 20:9898: F1        .byte $F1
- D - I - 0x0298A9 20:9899: 70        .byte $70	; <ャ>
- D - I - 0x0298AA 20:989A: 92        .byte $92	; <W>
- D - I - 0x0298AB 20:989B: 00        .byte $00
- D - I - 0x0298AC 20:989C: C3        .byte $C3	; <バ>
- D - I - 0x0298AD 20:989D: 08        .byte $08	; <く>
- D - I - 0x0298AE 20:989E: F1        .byte $F1
- D - I - 0x0298AF 20:989F: 71        .byte $71	; <ュ>
- D - I - 0x0298B0 20:98A0: 93        .byte $93	; <Y>
- D - I - 0x0298B1 20:98A1: B8        .byte $B8	; <ゴ>
- D - I - 0x0298B2 20:98A2: B3        .byte $B3	; <ぼ>
- D - I - 0x0298B3 20:98A3: 0C        .byte $0C	; <し>
- D - I - 0x0298B4 20:98A4: F1        .byte $F1
- D - I - 0x0298B5 20:98A5: 71        .byte $71	; <ュ>
- D - I - 0x0298B6 20:98A6: 93        .byte $93	; <Y>
- D - I - 0x0298B7 20:98A7: 00        .byte $00
- D - I - 0x0298B8 20:98A8: B3        .byte $B3	; <ぼ>
- D - I - 0x0298B9 20:98A9: 10        .byte $10	; <た>
- D - I - 0x0298BA 20:98AA: F0        .byte $F0
off_98AB_90:
- D - I - 0x0298BB 20:98AB: F5        .byte $F5
- D - I - 0x0298BC 20:98AC: 80        .byte $80
- D - I - 0x0298BD 20:98AD: F4        .byte $F4
- D - I - 0x0298BE 20:98AE: 08        .byte $08	; <く>
- D - I - 0x0298BF 20:98AF: 09        .byte $09	; <け>
- D - I - 0x0298C0 20:98B0: 0A        .byte $0A	; <こ>
- D - I - 0x0298C1 20:98B1: 0B        .byte $0B	; <さ>
- D - I - 0x0298C2 20:98B2: F1        .byte $F1
- D - I - 0x0298C3 20:98B3: 00        .byte $00
- D - I - 0x0298C4 20:98B4: 58        .byte $58	; <ネ>
- D - I - 0x0298C5 20:98B5: 00        .byte $00
- D - I - 0x0298C6 20:98B6: C3        .byte $C3	; <バ>
- D - I - 0x0298C7 20:98B7: 09        .byte $09	; <け>
- D - I - 0x0298C8 20:98B8: F1        .byte $F1
- D - I - 0x0298C9 20:98B9: 00        .byte $00
- D - I - 0x0298CA 20:98BA: 4B        .byte $4B	; <サ>
- D - I - 0x0298CB 20:98BB: 00        .byte $00
- D - I - 0x0298CC 20:98BC: C3        .byte $C3	; <バ>
- D - I - 0x0298CD 20:98BD: 01        .byte $01	; <あ>
- D - I - 0x0298CE 20:98BE: F1        .byte $F1
- D - I - 0x0298CF 20:98BF: 00        .byte $00
- D - I - 0x0298D0 20:98C0: 4D        .byte $4D	; <ス>
- D - I - 0x0298D1 20:98C1: 00        .byte $00
- D - I - 0x0298D2 20:98C2: C3        .byte $C3	; <バ>
- D - I - 0x0298D3 20:98C3: 05        .byte $05	; <お>
- D - I - 0x0298D4 20:98C4: F0        .byte $F0
off_98C5_91:
- D - I - 0x0298D5 20:98C5: F5        .byte $F5
- D - I - 0x0298D6 20:98C6: 84        .byte $84	; <D>
- D - I - 0x0298D7 20:98C7: 80        .byte $80
- D - I - 0x0298D8 20:98C8: F4        .byte $F4
; !!! 33 это номер банка спрайтов, разобрать таблицу получше
- D - I - 0x0298D9 20:98C9: 33        .byte $33	; <0>
- D - I - 0x0298DA 20:98CA: 00        .byte $00
- D - I - 0x0298DB 20:98CB: 00        .byte $00
- D - I - 0x0298DC 20:98CC: 00        .byte $00
- D - I - 0x0298DD 20:98CD: F1        .byte $F1
- D - I - 0x0298DE 20:98CE: 00        .byte $00
- D - I - 0x0298DF 20:98CF: 98        .byte $98
- D - I - 0x0298E0 20:98D0: 00        .byte $00
- D - I - 0x0298E1 20:98D1: D3        .byte $D3
- D - I - 0x0298E2 20:98D2: 01        .byte $01	; <あ>
- D - I - 0x0298E3 20:98D3: F0        .byte $F0
off_98D4_92:
- D - I - 0x0298E4 20:98D4: F5        .byte $F5
- D - I - 0x0298E5 20:98D5: 0F        .byte $0F	; <そ>
- D - I - 0x0298E6 20:98D6: F4        .byte $F4
- D - I - 0x0298E7 20:98D7: 08        .byte $08	; <く>
- D - I - 0x0298E8 20:98D8: 09        .byte $09	; <け>
- D - I - 0x0298E9 20:98D9: 0A        .byte $0A	; <こ>
- D - I - 0x0298EA 20:98DA: 0B        .byte $0B	; <さ>
- D - I - 0x0298EB 20:98DB: F1        .byte $F1
- D - I - 0x0298EC 20:98DC: AC        .byte $AC	; <づ>
- D - I - 0x0298ED 20:98DD: 49        .byte $49	; <ケ>
- D - I - 0x0298EE 20:98DE: 9C        .byte $9C
- D - I - 0x0298EF 20:98DF: 63        .byte $63	; <モ>
- D - I - 0x0298F0 20:98E0: 00        .byte $00
- D - I - 0x0298F1 20:98E1: F1        .byte $F1
- D - I - 0x0298F2 20:98E2: 67        .byte $67	; <ラ>
- D - I - 0x0298F3 20:98E3: D3        .byte $D3
- D - I - 0x0298F4 20:98E4: F0        .byte $F0
- D - I - 0x0298F5 20:98E5: B3        .byte $B3	; <ぼ>
- D - I - 0x0298F6 20:98E6: 04        .byte $04	; <え>
- D - I - 0x0298F7 20:98E7: F1        .byte $F1
- D - I - 0x0298F8 20:98E8: 67        .byte $67	; <ラ>
- D - I - 0x0298F9 20:98E9: 95        .byte $95
- D - I - 0x0298FA 20:98EA: F0        .byte $F0
- D - I - 0x0298FB 20:98EB: B3        .byte $B3	; <ぼ>
- D - I - 0x0298FC 20:98EC: 08        .byte $08	; <く>
- D - I - 0x0298FD 20:98ED: F1        .byte $F1
- D - I - 0x0298FE 20:98EE: 67        .byte $67	; <ラ>
- D - I - 0x0298FF 20:98EF: 96        .byte $96
- D - I - 0x029900 20:98F0: F0        .byte $F0
- D - I - 0x029901 20:98F1: B3        .byte $B3	; <ぼ>
- D - I - 0x029902 20:98F2: 0C        .byte $0C	; <し>
- D - I - 0x029903 20:98F3: 16        .byte $16	; <に>
- D - I - 0x029904 20:98F4: F4        .byte $F4
- D - I - 0x029905 20:98F5: 0A        .byte $0A	; <こ>
- D - I - 0x029906 20:98F6: 0B        .byte $0B	; <さ>
- D - I - 0x029907 20:98F7: 00        .byte $00
- D - I - 0x029908 20:98F8: 00        .byte $00
- D - I - 0x029909 20:98F9: F6        .byte $F6
- D - I - 0x02990A 20:98FA: 00        .byte $00
- D - I - 0x02990B 20:98FB: F6        .byte $F6
- D - I - 0x02990C 20:98FC: 2A        .byte $2A	; <れ>
- D - I - 0x02990D 20:98FD: F6        .byte $F6
- D - I - 0x02990E 20:98FE: 3F        .byte $3F	; <•>
- D - I - 0x02990F 20:98FF: F1        .byte $F1
- D - I - 0x029910 20:9900: 00        .byte $00
- D - I - 0x029911 20:9901: DA        .byte $DA
- D - I - 0x029912 20:9902: 20        .byte $20	; <み>
- D - I - 0x029913 20:9903: BB        .byte $BB	; <ズ>
- D - I - 0x029914 20:9904: 05        .byte $05	; <お>
- D - I - 0x029915 20:9905: 04        .byte $04	; <え>
- D - I - 0x029916 20:9906: F1        .byte $F1
- D - I - 0x029917 20:9907: 68        .byte $68	; <リ>
- D - I - 0x029918 20:9908: E0        .byte $E0
- D - I - 0x029919 20:9909: 20        .byte $20	; <み>
- D - I - 0x02991A 20:990A: BB        .byte $BB	; <ズ>
- D - I - 0x02991B 20:990B: 05        .byte $05	; <お>
off_990C:
- D - I - 0x02991C 20:990C: F1        .byte $F1
- D - I - 0x02991D 20:990D: AD        .byte $AD	; <で>
- D - I - 0x02991E 20:990E: 86        .byte $86	; <F>
- D - I - 0x02991F 20:990F: 08        .byte $08	; <く>
- D - I - 0x029920 20:9910: EB        .byte $EB
- D - I - 0x029921 20:9911: 01        .byte $01	; <あ>
- D - I - 0x029922 20:9912: F0        .byte $F0
off_9913_93:
- D - I - 0x029923 20:9913: F5        .byte $F5
- D - I - 0x029924 20:9914: 84        .byte $84	; <D>
- D - I - 0x029925 20:9915: 02        .byte $02	; <い>
- D - I - 0x029926 20:9916: F4        .byte $F4
- D - I - 0x029927 20:9917: 38        .byte $38	; <5>
- D - I - 0x029928 20:9918: 39        .byte $39	; <6>
- D - I - 0x029929 20:9919: 42        .byte $42	; <イ>
- D - I - 0x02992A 20:991A: 41        .byte $41	; <ア>
- D - I - 0x02992B 20:991B: F1        .byte $F1
- D - I - 0x02992C 20:991C: 00        .byte $00
- D - I - 0x02992D 20:991D: B1        .byte $B1	; <ぶ>
- D - I - 0x02992E 20:991E: 10        .byte $10	; <た>
- D - I - 0x02992F 20:991F: CB        .byte $CB	; <ぺ>
- D - I - 0x029930 20:9920: 01        .byte $01	; <あ>
- D - I - 0x029931 20:9921: F0        .byte $F0
off_9922_94:
- D - I - 0x029932 20:9922: F5        .byte $F5
- D - I - 0x029933 20:9923: 84        .byte $84	; <D>
- D - I - 0x029934 20:9924: 81        .byte $81	; <A>
- D - I - 0x029935 20:9925: F4        .byte $F4
- D - I - 0x029936 20:9926: 38        .byte $38	; <5>
- D - I - 0x029937 20:9927: 39        .byte $39	; <6>
- D - I - 0x029938 20:9928: 42        .byte $42	; <イ>
- D - I - 0x029939 20:9929: 41        .byte $41	; <ア>
- D - I - 0x02993A 20:992A: F1        .byte $F1
- D - I - 0x02993B 20:992B: 00        .byte $00
- D - I - 0x02993C 20:992C: AE        .byte $AE	; <ど>
- D - I - 0x02993D 20:992D: 10        .byte $10	; <た>
- D - I - 0x02993E 20:992E: CB        .byte $CB	; <ぺ>
- D - I - 0x02993F 20:992F: 01        .byte $01	; <あ>
- D - I - 0x029940 20:9930: F0        .byte $F0
off_9931_95:
- D - I - 0x029941 20:9931: F5        .byte $F5
- D - I - 0x029942 20:9932: 10        .byte $10	; <た>
- D - I - 0x029943 20:9933: F4        .byte $F4
- D - I - 0x029944 20:9934: 08        .byte $08	; <く>
- D - I - 0x029945 20:9935: 09        .byte $09	; <け>
- D - I - 0x029946 20:9936: 0A        .byte $0A	; <こ>
- D - I - 0x029947 20:9937: 0B        .byte $0B	; <さ>
- D - I - 0x029948 20:9938: F1        .byte $F1
- D - I - 0x029949 20:9939: AC        .byte $AC	; <づ>
- D - I - 0x02994A 20:993A: 49        .byte $49	; <ケ>
- D - I - 0x02994B 20:993B: 9C        .byte $9C
- D - I - 0x02994C 20:993C: 63        .byte $63	; <モ>
- D - I - 0x02994D 20:993D: 00        .byte $00
- D - I - 0x02994E 20:993E: F1        .byte $F1
- D - I - 0x02994F 20:993F: 67        .byte $67	; <ラ>
- D - I - 0x029950 20:9940: D4        .byte $D4
- D - I - 0x029951 20:9941: F0        .byte $F0
- D - I - 0x029952 20:9942: B3        .byte $B3	; <ぼ>
- D - I - 0x029953 20:9943: 04        .byte $04	; <え>
- D - I - 0x029954 20:9944: F1        .byte $F1
- D - I - 0x029955 20:9945: 67        .byte $67	; <ラ>
- D - I - 0x029956 20:9946: 95        .byte $95
- D - I - 0x029957 20:9947: F0        .byte $F0
- D - I - 0x029958 20:9948: B3        .byte $B3	; <ぼ>
- D - I - 0x029959 20:9949: 08        .byte $08	; <く>
- D - I - 0x02995A 20:994A: F1        .byte $F1
- D - I - 0x02995B 20:994B: 67        .byte $67	; <ラ>
- D - I - 0x02995C 20:994C: 96        .byte $96
- D - I - 0x02995D 20:994D: F0        .byte $F0
- D - I - 0x02995E 20:994E: B3        .byte $B3	; <ぼ>
- D - I - 0x02995F 20:994F: 0C        .byte $0C	; <し>
- D - I - 0x029960 20:9950: 16        .byte $16	; <に>
- D - I - 0x029961 20:9951: F4        .byte $F4
- D - I - 0x029962 20:9952: 0A        .byte $0A	; <こ>
- D - I - 0x029963 20:9953: 0B        .byte $0B	; <さ>
- D - I - 0x029964 20:9954: 00        .byte $00
- D - I - 0x029965 20:9955: 00        .byte $00
- D - I - 0x029966 20:9956: F6        .byte $F6
- D - I - 0x029967 20:9957: 00        .byte $00
- D - I - 0x029968 20:9958: F6        .byte $F6
- D - I - 0x029969 20:9959: 2A        .byte $2A	; <れ>
- D - I - 0x02996A 20:995A: F6        .byte $F6
- D - I - 0x02996B 20:995B: 3F        .byte $3F	; <•>
- D - I - 0x02996C 20:995C: F1        .byte $F1
- D - I - 0x02996D 20:995D: 00        .byte $00
- D - I - 0x02996E 20:995E: DB        .byte $DB
- D - I - 0x02996F 20:995F: 20        .byte $20	; <み>
- D - I - 0x029970 20:9960: BB        .byte $BB	; <ズ>
- D - I - 0x029971 20:9961: 05        .byte $05	; <お>
- D - I - 0x029972 20:9962: 04        .byte $04	; <え>
- D - I - 0x029973 20:9963: F1        .byte $F1
- D - I - 0x029974 20:9964: 68        .byte $68	; <リ>
- D - I - 0x029975 20:9965: E1        .byte $E1
- D - I - 0x029976 20:9966: 20        .byte $20	; <み>
- D - I - 0x029977 20:9967: BB        .byte $BB	; <ズ>
- D - I - 0x029978 20:9968: 05        .byte $05	; <お>
- D - I - 0x029979 20:9969: F8        .byte $F8
- D - I - 0x02997A 20:996A: 0C 99     .word off_990C
off_996C_96:
- D - I - 0x02997C 20:996C: F5        .byte $F5
- D - I - 0x02997D 20:996D: 84        .byte $84	; <D>
- D - I - 0x02997E 20:996E: 82        .byte $82	; <B>
off_996F:
- D - I - 0x02997F 20:996F: F4        .byte $F4
- D - I - 0x029980 20:9970: 36        .byte $36	; <3>
- D - I - 0x029981 20:9971: 37        .byte $37	; <4>
- D - I - 0x029982 20:9972: 00        .byte $00
- D - I - 0x029983 20:9973: 00        .byte $00
- D - I - 0x029984 20:9974: F1        .byte $F1
- D - I - 0x029985 20:9975: 00        .byte $00
- D - I - 0x029986 20:9976: 9E        .byte $9E
- D - I - 0x029987 20:9977: 00        .byte $00
- D - I - 0x029988 20:9978: D3        .byte $D3
- D - I - 0x029989 20:9979: 01        .byte $01	; <あ>
- D - I - 0x02998A 20:997A: F0        .byte $F0
off_997B_97:
- D - I - 0x02998B 20:997B: F5        .byte $F5
- D - I - 0x02998C 20:997C: 84        .byte $84	; <D>
- D - I - 0x02998D 20:997D: 06        .byte $06	; <か>
- D - I - 0x02998E 20:997E: F8        .byte $F8
- D - I - 0x02998F 20:997F: 6F 99     .word off_996F
off_9981_98:
- D - I - 0x029991 20:9981: F5        .byte $F5
- D - I - 0x029992 20:9982: 84        .byte $84	; <D>
- D - I - 0x029993 20:9983: 83        .byte $83	; <C>
off_9984:
- D - I - 0x029994 20:9984: F4        .byte $F4
- D - I - 0x029995 20:9985: 34        .byte $34	; <1>
- D - I - 0x029996 20:9986: 00        .byte $00
- D - I - 0x029997 20:9987: 00        .byte $00
- D - I - 0x029998 20:9988: 00        .byte $00
- D - I - 0x029999 20:9989: F1        .byte $F1
- D - I - 0x02999A 20:998A: 00        .byte $00
- D - I - 0x02999B 20:998B: 9D        .byte $9D
- D - I - 0x02999C 20:998C: 00        .byte $00
- D - I - 0x02999D 20:998D: D3        .byte $D3
- D - I - 0x02999E 20:998E: 01        .byte $01	; <あ>
- D - I - 0x02999F 20:998F: F0        .byte $F0
off_9990_99:
- D - I - 0x0299A0 20:9990: F5        .byte $F5
- D - I - 0x0299A1 20:9991: 84        .byte $84	; <D>
- D - I - 0x0299A2 20:9992: 09        .byte $09	; <け>
- D - I - 0x0299A3 20:9993: F8        .byte $F8
- D - I - 0x0299A4 20:9994: 84 99     .word off_9984
off_9996_9A:
- D - I - 0x0299A6 20:9996: F5        .byte $F5
- D - I - 0x0299A7 20:9997: 84        .byte $84	; <D>
- D - I - 0x0299A8 20:9998: 85        .byte $85	; <E>
off_9999:
- D - I - 0x0299A9 20:9999: F4        .byte $F4
- D - I - 0x0299AA 20:999A: 36        .byte $36	; <3>
- D - I - 0x0299AB 20:999B: 37        .byte $37	; <4>
- D - I - 0x0299AC 20:999C: 00        .byte $00
- D - I - 0x0299AD 20:999D: 00        .byte $00
- D - I - 0x0299AE 20:999E: F1        .byte $F1
- D - I - 0x0299AF 20:999F: 00        .byte $00
- D - I - 0x0299B0 20:99A0: AA        .byte $AA	; <だ>
- D - I - 0x0299B1 20:99A1: 00        .byte $00
- D - I - 0x0299B2 20:99A2: D3        .byte $D3
- D - I - 0x0299B3 20:99A3: 01        .byte $01	; <あ>
- D - I - 0x0299B4 20:99A4: F0        .byte $F0
off_99A5_9B:
- - - - - 0x0299B5 20:99A5: F5        .byte $F5
- - - - - 0x0299B6 20:99A6: 84        .byte $84	; <D>
- - - - - 0x0299B7 20:99A7: 0C        .byte $0C	; <し>
- - - - - 0x0299B8 20:99A8: F8        .byte $F8
- - - - - 0x0299B9 20:99A9: 99 99     .word off_9999
off_99AB_9C:
- D - I - 0x0299BB 20:99AB: F5        .byte $F5
- D - I - 0x0299BC 20:99AC: 84        .byte $84	; <D>
- D - I - 0x0299BD 20:99AD: 0D        .byte $0D	; <す>
- D - I - 0x0299BE 20:99AE: F8        .byte $F8
- D - I - 0x0299BF 20:99AF: B2 9A     .word off_9AB2
off_99B1_9D:
- D - I - 0x0299C1 20:99B1: F5        .byte $F5
- D - I - 0x0299C2 20:99B2: 80        .byte $80
- D - I - 0x0299C3 20:99B3: F4        .byte $F4
- D - I - 0x0299C4 20:99B4: 10        .byte $10	; <た>
- D - I - 0x0299C5 20:99B5: 11        .byte $11	; <ち>
- D - I - 0x0299C6 20:99B6: 12        .byte $12	; <つ>
- D - I - 0x0299C7 20:99B7: 13        .byte $13	; <て>
- D - I - 0x0299C8 20:99B8: F7        .byte $F7
- D - I - 0x0299C9 20:99B9: 23        .byte $23	; <も>
- D - I - 0x0299CA 20:99BA: 5B        .byte $5B	; <ヒ>
- D - I - 0x0299CB 20:99BB: F1        .byte $F1
- D - I - 0x0299CC 20:99BC: D2        .byte $D2
- D - I - 0x0299CD 20:99BD: 2E        .byte $2E	; <ん>
- D - I - 0x0299CE 20:99BE: 20        .byte $20	; <み>
- D - I - 0x0299CF 20:99BF: BB        .byte $BB	; <ズ>
- D - I - 0x0299D0 20:99C0: 0D        .byte $0D	; <す>
- D - I - 0x0299D1 20:99C1: F1        .byte $F1
- D - I - 0x0299D2 20:99C2: D1        .byte $D1	; <ポ>
- D - I - 0x0299D3 20:99C3: 2D        .byte $2D	; <を>
- D - I - 0x0299D4 20:99C4: 18        .byte $18	; <ね>
- D - I - 0x0299D5 20:99C5: C3        .byte $C3	; <バ>
- D - I - 0x0299D6 20:99C6: 09        .byte $09	; <け>
- D - I - 0x0299D7 20:99C7: F1        .byte $F1
- D - I - 0x0299D8 20:99C8: 00        .byte $00
- D - I - 0x0299D9 20:99C9: 00        .byte $00
- D - I - 0x0299DA 20:99CA: 80        .byte $80
- D - I - 0x0299DB 20:99CB: A3        .byte $A3	; <げ>
- D - I - 0x0299DC 20:99CC: 04        .byte $04	; <え>
- D - I - 0x0299DD 20:99CD: F1        .byte $F1
- D - I - 0x0299DE 20:99CE: 00        .byte $00
- D - I - 0x0299DF 20:99CF: 00        .byte $00
- D - I - 0x0299E0 20:99D0: 80        .byte $80
- D - I - 0x0299E1 20:99D1: DB        .byte $DB
- D - I - 0x0299E2 20:99D2: 00        .byte $00
- D - I - 0x0299E3 20:99D3: F0        .byte $F0
off_99D4_9E:
- D - I - 0x0299E4 20:99D4: F5        .byte $F5
- D - I - 0x0299E5 20:99D5: 84        .byte $84	; <D>
- D - I - 0x0299E6 20:99D6: 0F        .byte $0F	; <そ>
- D - I - 0x0299E7 20:99D7: F8        .byte $F8
- D - I - 0x0299E8 20:99D8: 05 9B     .word off_9B05
off_99DA_9F:
- D - I - 0x0299EA 20:99DA: F5        .byte $F5
- D - I - 0x0299EB 20:99DB: 84        .byte $84	; <D>
- D - I - 0x0299EC 20:99DC: 10        .byte $10	; <た>
- D - I - 0x0299ED 20:99DD: F8        .byte $F8
- D - I - 0x0299EE 20:99DE: D8 9A     .word off_9AD8
off_99E0_A0:
- D - I - 0x0299F0 20:99E0: F5        .byte $F5
- D - I - 0x0299F1 20:99E1: 84        .byte $84	; <D>
- D - I - 0x0299F2 20:99E2: 11        .byte $11	; <ち>
- D - I - 0x0299F3 20:99E3: F8        .byte $F8
- D - I - 0x0299F4 20:99E4: A3 9A     .word off_9AA3
off_99E6_A1:
- D - I - 0x0299F6 20:99E6: F5        .byte $F5
- D - I - 0x0299F7 20:99E7: 84        .byte $84	; <D>
- D - I - 0x0299F8 20:99E8: 12        .byte $12	; <つ>
- D - I - 0x0299F9 20:99E9: F8        .byte $F8
- D - I - 0x0299FA 20:99EA: F6 9A     .word off_9AF6
off_99EC_A2:
- - - - - 0x0299FC 20:99EC: F5        .byte $F5
- - - - - 0x0299FD 20:99ED: 84        .byte $84	; <D>
- - - - - 0x0299FE 20:99EE: 13        .byte $13	; <て>
- - - - - 0x0299FF 20:99EF: F8        .byte $F8
- - - - - 0x029A00 20:99F0: 14 9B     .word off_9B14
off_99F2_A3:
- D - I - 0x029A02 20:99F2: F5        .byte $F5
- D - I - 0x029A03 20:99F3: 84        .byte $84	; <D>
- D - I - 0x029A04 20:99F4: 14        .byte $14	; <と>
- D - I - 0x029A05 20:99F5: F8        .byte $F8
- D - I - 0x029A06 20:99F6: E7 9A     .word off_9AE7
off_99F8_A4:
- D - I - 0x029A08 20:99F8: F5        .byte $F5
- D - I - 0x029A09 20:99F9: 84        .byte $84	; <D>
- D - I - 0x029A0A 20:99FA: 15        .byte $15	; <な>
- D - I - 0x029A0B 20:99FB: F4        .byte $F4
- D - I - 0x029A0C 20:99FC: 38        .byte $38	; <5>
- D - I - 0x029A0D 20:99FD: 39        .byte $39	; <6>
- D - I - 0x029A0E 20:99FE: 42        .byte $42	; <イ>
- D - I - 0x029A0F 20:99FF: 41        .byte $41	; <ア>
- D - I - 0x029A10 20:9A00: F1        .byte $F1
- D - I - 0x029A11 20:9A01: 00        .byte $00
- D - I - 0x029A12 20:9A02: B0        .byte $B0	; <び>
- D - I - 0x029A13 20:9A03: 10        .byte $10	; <た>
- D - I - 0x029A14 20:9A04: CB        .byte $CB	; <ぺ>
- D - I - 0x029A15 20:9A05: 01        .byte $01	; <あ>
- D - I - 0x029A16 20:9A06: F0        .byte $F0
off_9A07_A5:
- D - I - 0x029A17 20:9A07: F5        .byte $F5
- D - I - 0x029A18 20:9A08: 80        .byte $80
- D - I - 0x029A19 20:9A09: F4        .byte $F4
- D - I - 0x029A1A 20:9A0A: 08        .byte $08	; <く>
- D - I - 0x029A1B 20:9A0B: 09        .byte $09	; <け>
- D - I - 0x029A1C 20:9A0C: 0A        .byte $0A	; <こ>
- D - I - 0x029A1D 20:9A0D: 0B        .byte $0B	; <さ>
- D - I - 0x029A1E 20:9A0E: F1        .byte $F1
- D - I - 0x029A1F 20:9A0F: AC        .byte $AC	; <づ>
- D - I - 0x029A20 20:9A10: 49        .byte $49	; <ケ>
- D - I - 0x029A21 20:9A11: 9C        .byte $9C
- D - I - 0x029A22 20:9A12: 63        .byte $63	; <モ>
- D - I - 0x029A23 20:9A13: 00        .byte $00
- D - I - 0x029A24 20:9A14: F1        .byte $F1
- D - I - 0x029A25 20:9A15: 67        .byte $67	; <ラ>
- D - I - 0x029A26 20:9A16: D5        .byte $D5
- D - I - 0x029A27 20:9A17: F0        .byte $F0
- D - I - 0x029A28 20:9A18: B3        .byte $B3	; <ぼ>
- D - I - 0x029A29 20:9A19: 04        .byte $04	; <え>
- D - I - 0x029A2A 20:9A1A: F1        .byte $F1
- D - I - 0x029A2B 20:9A1B: 67        .byte $67	; <ラ>
- D - I - 0x029A2C 20:9A1C: D9        .byte $D9
- D - I - 0x029A2D 20:9A1D: F0        .byte $F0
- D - I - 0x029A2E 20:9A1E: B3        .byte $B3	; <ぼ>
- D - I - 0x029A2F 20:9A1F: 08        .byte $08	; <く>
- D - I - 0x029A30 20:9A20: F1        .byte $F1
- D - I - 0x029A31 20:9A21: 67        .byte $67	; <ラ>
- D - I - 0x029A32 20:9A22: 96        .byte $96
- D - I - 0x029A33 20:9A23: F0        .byte $F0
- D - I - 0x029A34 20:9A24: B3        .byte $B3	; <ぼ>
- D - I - 0x029A35 20:9A25: 0C        .byte $0C	; <し>
- D - I - 0x029A36 20:9A26: 16        .byte $16	; <に>
- D - I - 0x029A37 20:9A27: F4        .byte $F4
- D - I - 0x029A38 20:9A28: 0A        .byte $0A	; <こ>
- D - I - 0x029A39 20:9A29: 0B        .byte $0B	; <さ>
- D - I - 0x029A3A 20:9A2A: 00        .byte $00
- D - I - 0x029A3B 20:9A2B: 00        .byte $00
- D - I - 0x029A3C 20:9A2C: F6        .byte $F6
- D - I - 0x029A3D 20:9A2D: 00        .byte $00
- D - I - 0x029A3E 20:9A2E: F6        .byte $F6
- D - I - 0x029A3F 20:9A2F: 2A        .byte $2A	; <れ>
- D - I - 0x029A40 20:9A30: F6        .byte $F6
- D - I - 0x029A41 20:9A31: 3F        .byte $3F	; <•>
- D - I - 0x029A42 20:9A32: F1        .byte $F1
- D - I - 0x029A43 20:9A33: 00        .byte $00
- D - I - 0x029A44 20:9A34: DC        .byte $DC
- D - I - 0x029A45 20:9A35: 20        .byte $20	; <み>
- D - I - 0x029A46 20:9A36: BB        .byte $BB	; <ズ>
- D - I - 0x029A47 20:9A37: 05        .byte $05	; <お>
- D - I - 0x029A48 20:9A38: 04        .byte $04	; <え>
- D - I - 0x029A49 20:9A39: F1        .byte $F1
- D - I - 0x029A4A 20:9A3A: 68        .byte $68	; <リ>
- D - I - 0x029A4B 20:9A3B: E2        .byte $E2
- D - I - 0x029A4C 20:9A3C: 20        .byte $20	; <み>
- D - I - 0x029A4D 20:9A3D: BB        .byte $BB	; <ズ>
- D - I - 0x029A4E 20:9A3E: 05        .byte $05	; <お>
- D - I - 0x029A4F 20:9A3F: F8        .byte $F8
- D - I - 0x029A50 20:9A40: 0C 99     .word off_990C
off_9A42_A6:
- D - I - 0x029A52 20:9A42: F5        .byte $F5
- D - I - 0x029A53 20:9A43: 1A        .byte $1A	; <は>
- D - I - 0x029A54 20:9A44: F4        .byte $F4
- D - I - 0x029A55 20:9A45: 38        .byte $38	; <5>
- D - I - 0x029A56 20:9A46: 39        .byte $39	; <6>
- D - I - 0x029A57 20:9A47: 42        .byte $42	; <イ>
- D - I - 0x029A58 20:9A48: 41        .byte $41	; <ア>
- D - I - 0x029A59 20:9A49: F1        .byte $F1
- D - I - 0x029A5A 20:9A4A: 00        .byte $00
- D - I - 0x029A5B 20:9A4B: AF        .byte $AF	; <ば>
- D - I - 0x029A5C 20:9A4C: 10        .byte $10	; <た>
- D - I - 0x029A5D 20:9A4D: CB        .byte $CB	; <ぺ>
- D - I - 0x029A5E 20:9A4E: 01        .byte $01	; <あ>
- D - I - 0x029A5F 20:9A4F: F0        .byte $F0
off_9A50_A7:
- D - I - 0x029A60 20:9A50: F5        .byte $F5
- D - I - 0x029A61 20:9A51: 80        .byte $80
- D - I - 0x029A62 20:9A52: F4        .byte $F4
- D - I - 0x029A63 20:9A53: 08        .byte $08	; <く>
- D - I - 0x029A64 20:9A54: 09        .byte $09	; <け>
- D - I - 0x029A65 20:9A55: 0A        .byte $0A	; <こ>
- D - I - 0x029A66 20:9A56: 0B        .byte $0B	; <さ>
- D - I - 0x029A67 20:9A57: F1        .byte $F1
- D - I - 0x029A68 20:9A58: AC        .byte $AC	; <づ>
- D - I - 0x029A69 20:9A59: 49        .byte $49	; <ケ>
- D - I - 0x029A6A 20:9A5A: 9C        .byte $9C
- D - I - 0x029A6B 20:9A5B: 63        .byte $63	; <モ>
- D - I - 0x029A6C 20:9A5C: 00        .byte $00
- D - I - 0x029A6D 20:9A5D: F1        .byte $F1
- D - I - 0x029A6E 20:9A5E: 67        .byte $67	; <ラ>
- D - I - 0x029A6F 20:9A5F: D6        .byte $D6
- D - I - 0x029A70 20:9A60: F0        .byte $F0
- D - I - 0x029A71 20:9A61: B3        .byte $B3	; <ぼ>
- D - I - 0x029A72 20:9A62: 04        .byte $04	; <え>
- D - I - 0x029A73 20:9A63: F1        .byte $F1
- D - I - 0x029A74 20:9A64: 67        .byte $67	; <ラ>
- D - I - 0x029A75 20:9A65: 95        .byte $95
- D - I - 0x029A76 20:9A66: F0        .byte $F0
- D - I - 0x029A77 20:9A67: B3        .byte $B3	; <ぼ>
- D - I - 0x029A78 20:9A68: 08        .byte $08	; <く>
- D - I - 0x029A79 20:9A69: F1        .byte $F1
- D - I - 0x029A7A 20:9A6A: 67        .byte $67	; <ラ>
- D - I - 0x029A7B 20:9A6B: 96        .byte $96
- D - I - 0x029A7C 20:9A6C: F0        .byte $F0
- D - I - 0x029A7D 20:9A6D: B3        .byte $B3	; <ぼ>
- D - I - 0x029A7E 20:9A6E: 0C        .byte $0C	; <し>
- D - I - 0x029A7F 20:9A6F: 16        .byte $16	; <に>
- D - I - 0x029A80 20:9A70: F4        .byte $F4
- D - I - 0x029A81 20:9A71: 0A        .byte $0A	; <こ>
- D - I - 0x029A82 20:9A72: 0B        .byte $0B	; <さ>
- D - I - 0x029A83 20:9A73: 00        .byte $00
- D - I - 0x029A84 20:9A74: 00        .byte $00
- D - I - 0x029A85 20:9A75: F6        .byte $F6
- D - I - 0x029A86 20:9A76: 00        .byte $00
- D - I - 0x029A87 20:9A77: F6        .byte $F6
- D - I - 0x029A88 20:9A78: 2A        .byte $2A	; <れ>
- D - I - 0x029A89 20:9A79: F6        .byte $F6
- D - I - 0x029A8A 20:9A7A: 3F        .byte $3F	; <•>
- D - I - 0x029A8B 20:9A7B: F1        .byte $F1
- D - I - 0x029A8C 20:9A7C: 00        .byte $00
- D - I - 0x029A8D 20:9A7D: DD        .byte $DD
- D - I - 0x029A8E 20:9A7E: 20        .byte $20	; <み>
- D - I - 0x029A8F 20:9A7F: BB        .byte $BB	; <ズ>
- D - I - 0x029A90 20:9A80: 05        .byte $05	; <お>
- D - I - 0x029A91 20:9A81: 04        .byte $04	; <え>
- D - I - 0x029A92 20:9A82: F1        .byte $F1
- D - I - 0x029A93 20:9A83: 68        .byte $68	; <リ>
- D - I - 0x029A94 20:9A84: E3        .byte $E3
- D - I - 0x029A95 20:9A85: 20        .byte $20	; <み>
- D - I - 0x029A96 20:9A86: BB        .byte $BB	; <ズ>
- D - I - 0x029A97 20:9A87: 05        .byte $05	; <お>
- D - I - 0x029A98 20:9A88: F8        .byte $F8
- D - I - 0x029A99 20:9A89: 0C 99     .word off_990C
off_9A8B_A8:
- D - I - 0x029A9B 20:9A8B: F5        .byte $F5
- D - I - 0x029A9C 20:9A8C: 84        .byte $84	; <D>
- D - I - 0x029A9D 20:9A8D: 18        .byte $18	; <ね>
- D - I - 0x029A9E 20:9A8E: F4        .byte $F4
- D - I - 0x029A9F 20:9A8F: 38        .byte $38	; <5>
- D - I - 0x029AA0 20:9A90: 39        .byte $39	; <6>
- D - I - 0x029AA1 20:9A91: 42        .byte $42	; <イ>
- D - I - 0x029AA2 20:9A92: 41        .byte $41	; <ア>
- D - I - 0x029AA3 20:9A93: F1        .byte $F1
- D - I - 0x029AA4 20:9A94: 00        .byte $00
- D - I - 0x029AA5 20:9A95: AD        .byte $AD	; <で>
- D - I - 0x029AA6 20:9A96: 10        .byte $10	; <た>
- D - I - 0x029AA7 20:9A97: CB        .byte $CB	; <ぺ>
- D - I - 0x029AA8 20:9A98: 01        .byte $01	; <あ>
- D - I - 0x029AA9 20:9A99: F0        .byte $F0
off_9A9A_A9:
- D - I - 0x029AAA 20:9A9A: F5        .byte $F5
- D - I - 0x029AAB 20:9A9B: 84        .byte $84	; <D>
- D - I - 0x029AAC 20:9A9C: 19        .byte $19	; <の>
- D - I - 0x029AAD 20:9A9D: F8        .byte $F8
- D - I - 0x029AAE 20:9A9E: A1 9B     .word off_9BA1
off_9AA0_AA:
- D - I - 0x029AB0 20:9AA0: F5        .byte $F5
- D - I - 0x029AB1 20:9AA1: 84        .byte $84	; <D>
- D - I - 0x029AB2 20:9AA2: 1A        .byte $1A	; <は>
off_9AA3:
- D - I - 0x029AB3 20:9AA3: F4        .byte $F4
- D - I - 0x029AB4 20:9AA4: 35        .byte $35	; <2>
- D - I - 0x029AB5 20:9AA5: 00        .byte $00
- D - I - 0x029AB6 20:9AA6: 00        .byte $00
- D - I - 0x029AB7 20:9AA7: 00        .byte $00
- D - I - 0x029AB8 20:9AA8: F1        .byte $F1
- D - I - 0x029AB9 20:9AA9: 00        .byte $00
- D - I - 0x029ABA 20:9AAA: A9        .byte $A9	; <ぞ>
- D - I - 0x029ABB 20:9AAB: 00        .byte $00
- D - I - 0x029ABC 20:9AAC: D3        .byte $D3
- D - I - 0x029ABD 20:9AAD: 01        .byte $01	; <あ>
- D - I - 0x029ABE 20:9AAE: F0        .byte $F0
off_9AAF_AB:
- D - I - 0x029ABF 20:9AAF: F5        .byte $F5
- D - I - 0x029AC0 20:9AB0: 84        .byte $84	; <D>
- D - I - 0x029AC1 20:9AB1: 1B        .byte $1B	; <ひ>
off_9AB2:
- D - I - 0x029AC2 20:9AB2: F4        .byte $F4
- D - I - 0x029AC3 20:9AB3: 33        .byte $33	; <0>
- D - I - 0x029AC4 20:9AB4: 00        .byte $00
- D - I - 0x029AC5 20:9AB5: 00        .byte $00
- D - I - 0x029AC6 20:9AB6: 00        .byte $00
- D - I - 0x029AC7 20:9AB7: F1        .byte $F1
- D - I - 0x029AC8 20:9AB8: 00        .byte $00
- D - I - 0x029AC9 20:9AB9: 99        .byte $99
- D - I - 0x029ACA 20:9ABA: 00        .byte $00
- D - I - 0x029ACB 20:9ABB: D3        .byte $D3
- D - I - 0x029ACC 20:9ABC: 01        .byte $01	; <あ>
- D - I - 0x029ACD 20:9ABD: F0        .byte $F0
off_9ABE_AC:
- D - I - 0x029ACE 20:9ABE: F5        .byte $F5
- D - I - 0x029ACF 20:9ABF: 80        .byte $80
- D - I - 0x029AD0 20:9AC0: F4        .byte $F4
- D - I - 0x029AD1 20:9AC1: 13        .byte $13	; <て>
- D - I - 0x029AD2 20:9AC2: 00        .byte $00
- D - I - 0x029AD3 20:9AC3: 00        .byte $00
- D - I - 0x029AD4 20:9AC4: 00        .byte $00
- D - I - 0x029AD5 20:9AC5: F7        .byte $F7
- D - I - 0x029AD6 20:9AC6: 03        .byte $03	; <う>
- D - I - 0x029AD7 20:9AC7: 7B        .byte $7B	; <。>
- D - I - 0x029AD8 20:9AC8: F1        .byte $F1
- D - I - 0x029AD9 20:9AC9: B4        .byte $B4	; <ガ>
- D - I - 0x029ADA 20:9ACA: 29        .byte $29	; <る>
- D - I - 0x029ADB 20:9ACB: E0        .byte $E0
- D - I - 0x029ADC 20:9ACC: 1B        .byte $1B	; <ひ>
- D - I - 0x029ADD 20:9ACD: 06        .byte $06	; <か>
- D - I - 0x029ADE 20:9ACE: F1        .byte $F1
- D - I - 0x029ADF 20:9ACF: 00        .byte $00
- D - I - 0x029AE0 20:9AD0: 00        .byte $00
- D - I - 0x029AE1 20:9AD1: 80        .byte $80
- D - I - 0x029AE2 20:9AD2: FB        .byte $FB
- D - I - 0x029AE3 20:9AD3: 00        .byte $00
- D - I - 0x029AE4 20:9AD4: F0        .byte $F0
off_9AD5_AD:
- D - I - 0x029AE5 20:9AD5: F5        .byte $F5
- D - I - 0x029AE6 20:9AD6: 84        .byte $84	; <D>
- D - I - 0x029AE7 20:9AD7: 1D        .byte $1D	; <へ>
off_9AD8:
- D - I - 0x029AE8 20:9AD8: F4        .byte $F4
- D - I - 0x029AE9 20:9AD9: 33        .byte $33	; <0>
- D - I - 0x029AEA 20:9ADA: 30        .byte $30	; <ゃ>
- D - I - 0x029AEB 20:9ADB: 00        .byte $00
- D - I - 0x029AEC 20:9ADC: 00        .byte $00
- D - I - 0x029AED 20:9ADD: F1        .byte $F1
- D - I - 0x029AEE 20:9ADE: 00        .byte $00
- D - I - 0x029AEF 20:9ADF: 9A        .byte $9A
- D - I - 0x029AF0 20:9AE0: 00        .byte $00
- D - I - 0x029AF1 20:9AE1: D3        .byte $D3
- D - I - 0x029AF2 20:9AE2: 01        .byte $01	; <あ>
- D - I - 0x029AF3 20:9AE3: F0        .byte $F0
off_9AE4_AE:
- D - I - 0x029AF4 20:9AE4: F5        .byte $F5
- D - I - 0x029AF5 20:9AE5: 84        .byte $84	; <D>
- D - I - 0x029AF6 20:9AE6: 1E        .byte $1E	; <ほ>
off_9AE7:
- D - I - 0x029AF7 20:9AE7: F4        .byte $F4
- D - I - 0x029AF8 20:9AE8: 36        .byte $36	; <3>
- D - I - 0x029AF9 20:9AE9: 37        .byte $37	; <4>
- D - I - 0x029AFA 20:9AEA: 00        .byte $00
- D - I - 0x029AFB 20:9AEB: 00        .byte $00
- D - I - 0x029AFC 20:9AEC: F1        .byte $F1
- D - I - 0x029AFD 20:9AED: 00        .byte $00
- D - I - 0x029AFE 20:9AEE: A7        .byte $A7	; <ず>
- D - I - 0x029AFF 20:9AEF: 00        .byte $00
- D - I - 0x029B00 20:9AF0: D3        .byte $D3
- D - I - 0x029B01 20:9AF1: 01        .byte $01	; <あ>
- D - I - 0x029B02 20:9AF2: F0        .byte $F0
off_9AF3_AF:
- D - I - 0x029B03 20:9AF3: F5        .byte $F5
- D - I - 0x029B04 20:9AF4: 84        .byte $84	; <D>
- D - I - 0x029B05 20:9AF5: 1F        .byte $1F	; <ま>
off_9AF6:
- D - I - 0x029B06 20:9AF6: F4        .byte $F4
- D - I - 0x029B07 20:9AF7: 36        .byte $36	; <3>
- D - I - 0x029B08 20:9AF8: 37        .byte $37	; <4>
- D - I - 0x029B09 20:9AF9: 00        .byte $00
- D - I - 0x029B0A 20:9AFA: 00        .byte $00
- D - I - 0x029B0B 20:9AFB: F1        .byte $F1
- D - I - 0x029B0C 20:9AFC: 00        .byte $00
- D - I - 0x029B0D 20:9AFD: A8        .byte $A8	; <ぜ>
- D - I - 0x029B0E 20:9AFE: 00        .byte $00
- D - I - 0x029B0F 20:9AFF: D3        .byte $D3
- D - I - 0x029B10 20:9B00: 01        .byte $01	; <あ>
- D - I - 0x029B11 20:9B01: F0        .byte $F0
off_9B02_B0:
- D - I - 0x029B12 20:9B02: F5        .byte $F5
- D - I - 0x029B13 20:9B03: 84        .byte $84	; <D>
- D - I - 0x029B14 20:9B04: 20        .byte $20	; <み>
off_9B05:
- D - I - 0x029B15 20:9B05: F4        .byte $F4
- D - I - 0x029B16 20:9B06: 30        .byte $30	; <ゃ>
- D - I - 0x029B17 20:9B07: 31        .byte $31	; <ゅ>
- D - I - 0x029B18 20:9B08: 32        .byte $32	; <ょ>
- D - I - 0x029B19 20:9B09: 00        .byte $00
- D - I - 0x029B1A 20:9B0A: F1        .byte $F1
- D - I - 0x029B1B 20:9B0B: 00        .byte $00
- D - I - 0x029B1C 20:9B0C: 9B        .byte $9B
- D - I - 0x029B1D 20:9B0D: 00        .byte $00
- D - I - 0x029B1E 20:9B0E: D3        .byte $D3
- D - I - 0x029B1F 20:9B0F: 01        .byte $01	; <あ>
- D - I - 0x029B20 20:9B10: F0        .byte $F0
off_9B11_B1:
- D - I - 0x029B21 20:9B11: F5        .byte $F5
- D - I - 0x029B22 20:9B12: 84        .byte $84	; <D>
- D - I - 0x029B23 20:9B13: 21        .byte $21	; <む>
off_9B14:
- D - I - 0x029B24 20:9B14: F4        .byte $F4
- D - I - 0x029B25 20:9B15: 34        .byte $34	; <1>
- D - I - 0x029B26 20:9B16: 00        .byte $00
- D - I - 0x029B27 20:9B17: 00        .byte $00
- D - I - 0x029B28 20:9B18: 00        .byte $00
- D - I - 0x029B29 20:9B19: F1        .byte $F1
- D - I - 0x029B2A 20:9B1A: 00        .byte $00
- D - I - 0x029B2B 20:9B1B: 9C        .byte $9C
- D - I - 0x029B2C 20:9B1C: 00        .byte $00
- D - I - 0x029B2D 20:9B1D: D3        .byte $D3
- D - I - 0x029B2E 20:9B1E: 01        .byte $01	; <あ>
- D - I - 0x029B2F 20:9B1F: F0        .byte $F0
off_9B20_B2:
- D - I - 0x029B30 20:9B20: F5        .byte $F5
- D - I - 0x029B31 20:9B21: 84        .byte $84	; <D>
- D - I - 0x029B32 20:9B22: 23        .byte $23	; <も>
- D - I - 0x029B33 20:9B23: F4        .byte $F4
- D - I - 0x029B34 20:9B24: 36        .byte $36	; <3>
- D - I - 0x029B35 20:9B25: 37        .byte $37	; <4>
- D - I - 0x029B36 20:9B26: 00        .byte $00
- D - I - 0x029B37 20:9B27: 00        .byte $00
- D - I - 0x029B38 20:9B28: F1        .byte $F1
- D - I - 0x029B39 20:9B29: 00        .byte $00
- D - I - 0x029B3A 20:9B2A: AC        .byte $AC	; <づ>
- D - I - 0x029B3B 20:9B2B: 00        .byte $00
- D - I - 0x029B3C 20:9B2C: D3        .byte $D3
- D - I - 0x029B3D 20:9B2D: 01        .byte $01	; <あ>
- D - I - 0x029B3E 20:9B2E: F0        .byte $F0
off_9B2F_B3:
- D - I - 0x029B3F 20:9B2F: F5        .byte $F5
- D - I - 0x029B40 20:9B30: 84        .byte $84	; <D>
- D - I - 0x029B41 20:9B31: 24        .byte $24	; <や>
- D - I - 0x029B42 20:9B32: F8        .byte $F8
- D - I - 0x029B43 20:9B33: 83 9B     .word off_9B83
off_9B35_B4:
- D - I - 0x029B45 20:9B35: F5        .byte $F5
- D - I - 0x029B46 20:9B36: 84        .byte $84	; <D>
- D - I - 0x029B47 20:9B37: 33        .byte $33	; <0>
- D - I - 0x029B48 20:9B38: F4        .byte $F4
- D - I - 0x029B49 20:9B39: 30        .byte $30	; <ゃ>
- D - I - 0x029B4A 20:9B3A: 31        .byte $31	; <ゅ>
- D - I - 0x029B4B 20:9B3B: 32        .byte $32	; <ょ>
- D - I - 0x029B4C 20:9B3C: 00        .byte $00
- D - I - 0x029B4D 20:9B3D: F1        .byte $F1
- D - I - 0x029B4E 20:9B3E: 00        .byte $00
- D - I - 0x029B4F 20:9B3F: A6        .byte $A6	; <じ>
- D - I - 0x029B50 20:9B40: 00        .byte $00
- D - I - 0x029B51 20:9B41: D3        .byte $D3
- D - I - 0x029B52 20:9B42: 01        .byte $01	; <あ>
- D - I - 0x029B53 20:9B43: F0        .byte $F0
off_9B44_B5:
- D - I - 0x029B54 20:9B44: F5        .byte $F5
- D - I - 0x029B55 20:9B45: 84        .byte $84	; <D>
- D - I - 0x029B56 20:9B46: 34        .byte $34	; <1>
- D - I - 0x029B57 20:9B47: F4        .byte $F4
- D - I - 0x029B58 20:9B48: 30        .byte $30	; <ゃ>
- D - I - 0x029B59 20:9B49: 31        .byte $31	; <ゅ>
- D - I - 0x029B5A 20:9B4A: 32        .byte $32	; <ょ>
- D - I - 0x029B5B 20:9B4B: 00        .byte $00
- D - I - 0x029B5C 20:9B4C: F1        .byte $F1
- D - I - 0x029B5D 20:9B4D: 00        .byte $00
- D - I - 0x029B5E 20:9B4E: A5        .byte $A5	; <ざ>
- D - I - 0x029B5F 20:9B4F: 00        .byte $00
- D - I - 0x029B60 20:9B50: D3        .byte $D3
- D - I - 0x029B61 20:9B51: 01        .byte $01	; <あ>
- D - I - 0x029B62 20:9B52: F0        .byte $F0
off_9B53_B6:
- D - I - 0x029B63 20:9B53: F5        .byte $F5
- D - I - 0x029B64 20:9B54: 84        .byte $84	; <D>
- D - I - 0x029B65 20:9B55: 35        .byte $35	; <2>
- D - I - 0x029B66 20:9B56: F4        .byte $F4
- D - I - 0x029B67 20:9B57: 36        .byte $36	; <3>
- D - I - 0x029B68 20:9B58: 37        .byte $37	; <4>
- D - I - 0x029B69 20:9B59: 00        .byte $00
- D - I - 0x029B6A 20:9B5A: 00        .byte $00
- D - I - 0x029B6B 20:9B5B: F1        .byte $F1
- D - I - 0x029B6C 20:9B5C: 00        .byte $00
- D - I - 0x029B6D 20:9B5D: A0        .byte $A0	; <が>
- D - I - 0x029B6E 20:9B5E: 00        .byte $00
- D - I - 0x029B6F 20:9B5F: D3        .byte $D3
- D - I - 0x029B70 20:9B60: 01        .byte $01	; <あ>
- D - I - 0x029B71 20:9B61: F0        .byte $F0
off_9B62_B7:
- D - I - 0x029B72 20:9B62: F5        .byte $F5
- D - I - 0x029B73 20:9B63: 84        .byte $84	; <D>
- D - I - 0x029B74 20:9B64: 36        .byte $36	; <3>
- D - I - 0x029B75 20:9B65: F4        .byte $F4
- D - I - 0x029B76 20:9B66: 30        .byte $30	; <ゃ>
- D - I - 0x029B77 20:9B67: 31        .byte $31	; <ゅ>
- D - I - 0x029B78 20:9B68: 32        .byte $32	; <ょ>
- D - I - 0x029B79 20:9B69: 00        .byte $00
- D - I - 0x029B7A 20:9B6A: F1        .byte $F1
- D - I - 0x029B7B 20:9B6B: 00        .byte $00
- D - I - 0x029B7C 20:9B6C: 9F        .byte $9F
- D - I - 0x029B7D 20:9B6D: 00        .byte $00
- D - I - 0x029B7E 20:9B6E: D3        .byte $D3
- D - I - 0x029B7F 20:9B6F: 01        .byte $01	; <あ>
- D - I - 0x029B80 20:9B70: F0        .byte $F0
off_9B71_B8:
- D - I - 0x029B81 20:9B71: F5        .byte $F5
- D - I - 0x029B82 20:9B72: 84        .byte $84	; <D>
- D - I - 0x029B83 20:9B73: 37        .byte $37	; <4>
- D - I - 0x029B84 20:9B74: F4        .byte $F4
- D - I - 0x029B85 20:9B75: 30        .byte $30	; <ゃ>
- D - I - 0x029B86 20:9B76: 31        .byte $31	; <ゅ>
- D - I - 0x029B87 20:9B77: 32        .byte $32	; <ょ>
- D - I - 0x029B88 20:9B78: 00        .byte $00
- D - I - 0x029B89 20:9B79: F1        .byte $F1
- D - I - 0x029B8A 20:9B7A: 00        .byte $00
- D - I - 0x029B8B 20:9B7B: A3        .byte $A3	; <げ>
- D - I - 0x029B8C 20:9B7C: 00        .byte $00
- D - I - 0x029B8D 20:9B7D: D3        .byte $D3
- D - I - 0x029B8E 20:9B7E: 01        .byte $01	; <あ>
- D - I - 0x029B8F 20:9B7F: F0        .byte $F0
off_9B80_B9:
- D - I - 0x029B90 20:9B80: F5        .byte $F5
- D - I - 0x029B91 20:9B81: 84        .byte $84	; <D>
- D - I - 0x029B92 20:9B82: 38        .byte $38	; <5>
off_9B83:
- D - I - 0x029B93 20:9B83: F4        .byte $F4
- D - I - 0x029B94 20:9B84: 35        .byte $35	; <2>
- D - I - 0x029B95 20:9B85: 00        .byte $00
- D - I - 0x029B96 20:9B86: 00        .byte $00
- D - I - 0x029B97 20:9B87: 00        .byte $00
- D - I - 0x029B98 20:9B88: F1        .byte $F1
- D - I - 0x029B99 20:9B89: 00        .byte $00
- D - I - 0x029B9A 20:9B8A: A2        .byte $A2	; <ぐ>
- D - I - 0x029B9B 20:9B8B: 00        .byte $00
- D - I - 0x029B9C 20:9B8C: D3        .byte $D3
- D - I - 0x029B9D 20:9B8D: 01        .byte $01	; <あ>
- D - I - 0x029B9E 20:9B8E: F0        .byte $F0
off_9B8F_BA:
- D - I - 0x029B9F 20:9B8F: F5        .byte $F5
- D - I - 0x029BA0 20:9B90: 84        .byte $84	; <D>
- D - I - 0x029BA1 20:9B91: 39        .byte $39	; <6>
- D - I - 0x029BA2 20:9B92: F4        .byte $F4
- D - I - 0x029BA3 20:9B93: 36        .byte $36	; <3>
- D - I - 0x029BA4 20:9B94: 37        .byte $37	; <4>
- D - I - 0x029BA5 20:9B95: 00        .byte $00
- D - I - 0x029BA6 20:9B96: 00        .byte $00
- D - I - 0x029BA7 20:9B97: F1        .byte $F1
- D - I - 0x029BA8 20:9B98: 00        .byte $00
- D - I - 0x029BA9 20:9B99: A4        .byte $A4	; <ご>
- D - I - 0x029BAA 20:9B9A: 00        .byte $00
- D - I - 0x029BAB 20:9B9B: D3        .byte $D3
- D - I - 0x029BAC 20:9B9C: 01        .byte $01	; <あ>
- D - I - 0x029BAD 20:9B9D: F0        .byte $F0
off_9B9E_BB:
- D - I - 0x029BAE 20:9B9E: F5        .byte $F5
- D - I - 0x029BAF 20:9B9F: 84        .byte $84	; <D>
- D - I - 0x029BB0 20:9BA0: 3A        .byte $3A	; <7>
off_9BA1:
- D - I - 0x029BB1 20:9BA1: F4        .byte $F4
- D - I - 0x029BB2 20:9BA2: 30        .byte $30	; <ゃ>
- D - I - 0x029BB3 20:9BA3: 31        .byte $31	; <ゅ>
- D - I - 0x029BB4 20:9BA4: 32        .byte $32	; <ょ>
- D - I - 0x029BB5 20:9BA5: 00        .byte $00
- D - I - 0x029BB6 20:9BA6: F1        .byte $F1
- D - I - 0x029BB7 20:9BA7: 00        .byte $00
- D - I - 0x029BB8 20:9BA8: A1        .byte $A1	; <ぎ>
- D - I - 0x029BB9 20:9BA9: 00        .byte $00
- D - I - 0x029BBA 20:9BAA: D3        .byte $D3
- D - I - 0x029BBB 20:9BAB: 01        .byte $01	; <あ>
- D - I - 0x029BBC 20:9BAC: F0        .byte $F0
off_9BAD_BC:
- D - I - 0x029BBD 20:9BAD: F5        .byte $F5
- D - I - 0x029BBE 20:9BAE: 84        .byte $84	; <D>
- D - I - 0x029BBF 20:9BAF: 3C        .byte $3C	; <9>
- D - I - 0x029BC0 20:9BB0: F4        .byte $F4
- D - I - 0x029BC1 20:9BB1: 30        .byte $30	; <ゃ>
- D - I - 0x029BC2 20:9BB2: 31        .byte $31	; <ゅ>
- D - I - 0x029BC3 20:9BB3: 32        .byte $32	; <ょ>
- D - I - 0x029BC4 20:9BB4: 00        .byte $00
- D - I - 0x029BC5 20:9BB5: F1        .byte $F1
- D - I - 0x029BC6 20:9BB6: 00        .byte $00
- D - I - 0x029BC7 20:9BB7: AB        .byte $AB	; <ぢ>
- D - I - 0x029BC8 20:9BB8: 00        .byte $00
- D - I - 0x029BC9 20:9BB9: D3        .byte $D3
- D - I - 0x029BCA 20:9BBA: 01        .byte $01	; <あ>
- D - I - 0x029BCB 20:9BBB: F0        .byte $F0
off_9BBC_BD:
- D - I - 0x029BCC 20:9BBC: F5        .byte $F5
- D - I - 0x029BCD 20:9BBD: 84        .byte $84	; <D>
- D - I - 0x029BCE 20:9BBE: 84        .byte $84	; <D>
- D - I - 0x029BCF 20:9BBF: F4        .byte $F4
- D - I - 0x029BD0 20:9BC0: 1D        .byte $1D	; <へ>
- D - I - 0x029BD1 20:9BC1: 00        .byte $00
- D - I - 0x029BD2 20:9BC2: 80        .byte $80
- D - I - 0x029BD3 20:9BC3: 48        .byte $48	; <ク>
- D - I - 0x029BD4 20:9BC4: F1        .byte $F1
- D - I - 0x029BD5 20:9BC5: 72        .byte $72	; <ョ>
- D - I - 0x029BD6 20:9BC6: B2        .byte $B2	; <べ>
- D - I - 0x029BD7 20:9BC7: 08        .byte $08	; <く>
- D - I - 0x029BD8 20:9BC8: CB        .byte $CB	; <ぺ>
- D - I - 0x029BD9 20:9BC9: 01        .byte $01	; <あ>
- D - I - 0x029BDA 20:9BCA: F0        .byte $F0
off_9BCB_BE:
- - - - - 0x029BDB 20:9BCB: F5        .byte $F5
- - - - - 0x029BDC 20:9BCC: 17        .byte $17	; <ぬ>
- - - - - 0x029BDD 20:9BCD: F4        .byte $F4
- - - - - 0x029BDE 20:9BCE: 08        .byte $08	; <く>
- - - - - 0x029BDF 20:9BCF: 09        .byte $09	; <け>
- - - - - 0x029BE0 20:9BD0: 0A        .byte $0A	; <こ>
- - - - - 0x029BE1 20:9BD1: 0B        .byte $0B	; <さ>
- - - - - 0x029BE2 20:9BD2: F1        .byte $F1
- - - - - 0x029BE3 20:9BD3: AC        .byte $AC	; <づ>
- - - - - 0x029BE4 20:9BD4: 49        .byte $49	; <ケ>
- - - - - 0x029BE5 20:9BD5: 9C        .byte $9C
- - - - - 0x029BE6 20:9BD6: 63        .byte $63	; <モ>
- - - - - 0x029BE7 20:9BD7: 00        .byte $00
- - - - - 0x029BE8 20:9BD8: F1        .byte $F1
- - - - - 0x029BE9 20:9BD9: 67        .byte $67	; <ラ>
- - - - - 0x029BEA 20:9BDA: D7        .byte $D7
- - - - - 0x029BEB 20:9BDB: F0        .byte $F0
- - - - - 0x029BEC 20:9BDC: B3        .byte $B3	; <ぼ>
- - - - - 0x029BED 20:9BDD: 04        .byte $04	; <え>
- - - - - 0x029BEE 20:9BDE: F1        .byte $F1
- - - - - 0x029BEF 20:9BDF: 67        .byte $67	; <ラ>
- - - - - 0x029BF0 20:9BE0: 95        .byte $95
- - - - - 0x029BF1 20:9BE1: F0        .byte $F0
- - - - - 0x029BF2 20:9BE2: B3        .byte $B3	; <ぼ>
- - - - - 0x029BF3 20:9BE3: 08        .byte $08	; <く>
- - - - - 0x029BF4 20:9BE4: F1        .byte $F1
- - - - - 0x029BF5 20:9BE5: 67        .byte $67	; <ラ>
- - - - - 0x029BF6 20:9BE6: 96        .byte $96
- - - - - 0x029BF7 20:9BE7: F0        .byte $F0
- - - - - 0x029BF8 20:9BE8: B3        .byte $B3	; <ぼ>
- - - - - 0x029BF9 20:9BE9: 0C        .byte $0C	; <し>
- - - - - 0x029BFA 20:9BEA: 16        .byte $16	; <に>
- - - - - 0x029BFB 20:9BEB: F4        .byte $F4
- - - - - 0x029BFC 20:9BEC: 0A        .byte $0A	; <こ>
- - - - - 0x029BFD 20:9BED: 0B        .byte $0B	; <さ>
- - - - - 0x029BFE 20:9BEE: 00        .byte $00
- - - - - 0x029BFF 20:9BEF: 00        .byte $00
- - - - - 0x029C00 20:9BF0: F6        .byte $F6
- - - - - 0x029C01 20:9BF1: 00        .byte $00
- - - - - 0x029C02 20:9BF2: F6        .byte $F6
- - - - - 0x029C03 20:9BF3: 2A        .byte $2A	; <れ>
- - - - - 0x029C04 20:9BF4: F6        .byte $F6
- - - - - 0x029C05 20:9BF5: 3F        .byte $3F	; <•>
- - - - - 0x029C06 20:9BF6: F1        .byte $F1
- - - - - 0x029C07 20:9BF7: 00        .byte $00
- - - - - 0x029C08 20:9BF8: DE        .byte $DE
- - - - - 0x029C09 20:9BF9: 20        .byte $20	; <み>
- - - - - 0x029C0A 20:9BFA: BB        .byte $BB	; <ズ>
- - - - - 0x029C0B 20:9BFB: 05        .byte $05	; <お>
- - - - - 0x029C0C 20:9BFC: 04        .byte $04	; <え>
- - - - - 0x029C0D 20:9BFD: F1        .byte $F1
- - - - - 0x029C0E 20:9BFE: 68        .byte $68	; <リ>
- - - - - 0x029C0F 20:9BFF: E4        .byte $E4
- - - - - 0x029C10 20:9C00: 20        .byte $20	; <み>
- - - - - 0x029C11 20:9C01: BB        .byte $BB	; <ズ>
- - - - - 0x029C12 20:9C02: 05        .byte $05	; <お>
- - - - - 0x029C13 20:9C03: F8        .byte $F8
- - - - - 0x029C14 20:9C04: 0C 99     .word off_990C
off_9C06_BF:
- D - I - 0x029C16 20:9C06: F5        .byte $F5
- D - I - 0x029C17 20:9C07: 80        .byte $80
- D - I - 0x029C18 20:9C08: F4        .byte $F4
- D - I - 0x029C19 20:9C09: 13        .byte $13	; <て>
- D - I - 0x029C1A 20:9C0A: 00        .byte $00
- D - I - 0x029C1B 20:9C0B: 00        .byte $00
- D - I - 0x029C1C 20:9C0C: 0B        .byte $0B	; <さ>
- D - I - 0x029C1D 20:9C0D: F7        .byte $F7
- D - I - 0x029C1E 20:9C0E: 03        .byte $03	; <う>
- D - I - 0x029C1F 20:9C0F: 7B        .byte $7B	; <。>
- D - I - 0x029C20 20:9C10: F1        .byte $F1
- D - I - 0x029C21 20:9C11: 00        .byte $00
- D - I - 0x029C22 20:9C12: 00        .byte $00
- D - I - 0x029C23 20:9C13: 80        .byte $80
- D - I - 0x029C24 20:9C14: FB        .byte $FB
- D - I - 0x029C25 20:9C15: 00        .byte $00
- D - I - 0x029C26 20:9C16: F1        .byte $F1
- D - I - 0x029C27 20:9C17: B7        .byte $B7	; <ゲ>
- D - I - 0x029C28 20:9C18: 29        .byte $29	; <る>
- D - I - 0x029C29 20:9C19: 10        .byte $10	; <た>
- D - I - 0x029C2A 20:9C1A: 2B        .byte $2B	; <ろ>
- D - I - 0x029C2B 20:9C1B: 07        .byte $07	; <き>
- D - I - 0x029C2C 20:9C1C: F1        .byte $F1
- D - I - 0x029C2D 20:9C1D: 31        .byte $31	; <ゅ>
- D - I - 0x029C2E 20:9C1E: 49        .byte $49	; <ケ>
- D - I - 0x029C2F 20:9C1F: AC        .byte $AC	; <づ>
- D - I - 0x029C30 20:9C20: FF        .byte $FF
- D - I - 0x029C31 20:9C21: 0A        .byte $0A	; <こ>
- D - I - 0x029C32 20:9C22: 28        .byte $28	; <り>
- D - I - 0x029C33 20:9C23: F4        .byte $F4
- D - I - 0x029C34 20:9C24: 27        .byte $27	; <ら>
- D - I - 0x029C35 20:9C25: 1F        .byte $1F	; <ま>
- D - I - 0x029C36 20:9C26: 00        .byte $00
- D - I - 0x029C37 20:9C27: 0B        .byte $0B	; <さ>
- D - I - 0x029C38 20:9C28: F1        .byte $F1
- D - I - 0x029C39 20:9C29: 00        .byte $00
- D - I - 0x029C3A 20:9C2A: 0B        .byte $0B	; <さ>
- D - I - 0x029C3B 20:9C2B: 00        .byte $00
- D - I - 0x029C3C 20:9C2C: BB        .byte $BB	; <ズ>
- D - I - 0x029C3D 20:9C2D: 05        .byte $05	; <お>
- D - I - 0x029C3E 20:9C2E: 04        .byte $04	; <え>
- D - I - 0x029C3F 20:9C2F: F1        .byte $F1
- D - I - 0x029C40 20:9C30: B5        .byte $B5	; <ギ>
- D - I - 0x029C41 20:9C31: C9        .byte $C9	; <ぴ>
- D - I - 0x029C42 20:9C32: FD        .byte $FD
- D - I - 0x029C43 20:9C33: 9F        .byte $9F
- D - I - 0x029C44 20:9C34: 08        .byte $08	; <く>
- D - I - 0x029C45 20:9C35: F8        .byte $F8
- D - I - 0x029C46 20:9C36: 4E 8E     .word off_8E4E
off_9C38_C0:
- D - I - 0x029C48 20:9C38: F5        .byte $F5
- D - I - 0x029C49 20:9C39: 0D        .byte $0D	; <す>
off_9C3A:
- D - I - 0x029C4A 20:9C3A: F4        .byte $F4
- D - I - 0x029C4B 20:9C3B: 14        .byte $14	; <と>
- D - I - 0x029C4C 20:9C3C: 15        .byte $15	; <な>
- D - I - 0x029C4D 20:9C3D: 16        .byte $16	; <に>
- D - I - 0x029C4E 20:9C3E: 00        .byte $00
- D - I - 0x029C4F 20:9C3F: F1        .byte $F1
- D - I - 0x029C50 20:9C40: 00        .byte $00
- D - I - 0x029C51 20:9C41: 3D        .byte $3D	; <+>
- D - I - 0x029C52 20:9C42: 00        .byte $00
- D - I - 0x029C53 20:9C43: C3        .byte $C3	; <バ>
- D - I - 0x029C54 20:9C44: 01        .byte $01	; <あ>
- D - I - 0x029C55 20:9C45: F0        .byte $F0
off_9C46_C1:
- D - I - 0x029C56 20:9C46: F5        .byte $F5
- D - I - 0x029C57 20:9C47: 81        .byte $81	; <A>
off_9C48:
- D - I - 0x029C58 20:9C48: F4        .byte $F4
- D - I - 0x029C59 20:9C49: 14        .byte $14	; <と>
- D - I - 0x029C5A 20:9C4A: 15        .byte $15	; <な>
- D - I - 0x029C5B 20:9C4B: 16        .byte $16	; <に>
- D - I - 0x029C5C 20:9C4C: 00        .byte $00
- D - I - 0x029C5D 20:9C4D: F1        .byte $F1
- D - I - 0x029C5E 20:9C4E: BC        .byte $BC	; <ゼ>
- D - I - 0x029C5F 20:9C4F: 41        .byte $41	; <ア>
- D - I - 0x029C60 20:9C50: B0        .byte $B0	; <び>
- D - I - 0x029C61 20:9C51: C3        .byte $C3	; <バ>
- D - I - 0x029C62 20:9C52: 00        .byte $00
- D - I - 0x029C63 20:9C53: F0        .byte $F0
off_9C54_C2:
- D - I - 0x029C64 20:9C54: F5        .byte $F5
- D - I - 0x029C65 20:9C55: 80        .byte $80
- D - I - 0x029C66 20:9C56: F4        .byte $F4
- D - I - 0x029C67 20:9C57: 14        .byte $14	; <と>
- D - I - 0x029C68 20:9C58: 15        .byte $15	; <な>
- D - I - 0x029C69 20:9C59: 16        .byte $16	; <に>
- D - I - 0x029C6A 20:9C5A: 00        .byte $00
- D - I - 0x029C6B 20:9C5B: F1        .byte $F1
- D - I - 0x029C6C 20:9C5C: 00        .byte $00
- D - I - 0x029C6D 20:9C5D: 42        .byte $42	; <イ>
- D - I - 0x029C6E 20:9C5E: 00        .byte $00
- D - I - 0x029C6F 20:9C5F: C3        .byte $C3	; <バ>
- D - I - 0x029C70 20:9C60: 01        .byte $01	; <あ>
- D - I - 0x029C71 20:9C61: F0        .byte $F0
off_9C62_C3:
- D - I - 0x029C72 20:9C62: F5        .byte $F5
- D - I - 0x029C73 20:9C63: 80        .byte $80
- D - I - 0x029C74 20:9C64: F4        .byte $F4
- D - I - 0x029C75 20:9C65: 14        .byte $14	; <と>
- D - I - 0x029C76 20:9C66: 15        .byte $15	; <な>
- D - I - 0x029C77 20:9C67: 16        .byte $16	; <に>
- D - I - 0x029C78 20:9C68: 00        .byte $00
- D - I - 0x029C79 20:9C69: F1        .byte $F1
- D - I - 0x029C7A 20:9C6A: BC        .byte $BC	; <ゼ>
- D - I - 0x029C7B 20:9C6B: 44        .byte $44	; <エ>
- D - I - 0x029C7C 20:9C6C: A0        .byte $A0	; <が>
- D - I - 0x029C7D 20:9C6D: C3        .byte $C3	; <バ>
- D - I - 0x029C7E 20:9C6E: 00        .byte $00
- D - I - 0x029C7F 20:9C6F: F0        .byte $F0
off_9C70_C4:
- D - I - 0x029C80 20:9C70: F5        .byte $F5
- D - I - 0x029C81 20:9C71: 80        .byte $80
- D - I - 0x029C82 20:9C72: F4        .byte $F4
- D - I - 0x029C83 20:9C73: 04        .byte $04	; <え>
- D - I - 0x029C84 20:9C74: 05        .byte $05	; <お>
- D - I - 0x029C85 20:9C75: 20        .byte $20	; <み>
- D - I - 0x029C86 20:9C76: 21        .byte $21	; <む>
- D - I - 0x029C87 20:9C77: F7        .byte $F7
- D - I - 0x029C88 20:9C78: 23        .byte $23	; <も>
- D - I - 0x029C89 20:9C79: 5B        .byte $5B	; <ヒ>
- D - I - 0x029C8A 20:9C7A: F1        .byte $F1
- D - I - 0x029C8B 20:9C7B: BD        .byte $BD	; <ゾ>
- D - I - 0x029C8C 20:9C7C: 32        .byte $32	; <ょ>
- D - I - 0x029C8D 20:9C7D: 08        .byte $08	; <く>
- D - I - 0x029C8E 20:9C7E: E3        .byte $E3
- D - I - 0x029C8F 20:9C7F: 0D        .byte $0D	; <す>
- D - I - 0x029C90 20:9C80: F1        .byte $F1
- D - I - 0x029C91 20:9C81: D4        .byte $D4
- D - I - 0x029C92 20:9C82: C0        .byte $C0	; <ヅ>
- D - I - 0x029C93 20:9C83: 98        .byte $98
- D - I - 0x029C94 20:9C84: D3        .byte $D3
- D - I - 0x029C95 20:9C85: 08        .byte $08	; <く>
- D - I - 0x029C96 20:9C86: F1        .byte $F1
- D - I - 0x029C97 20:9C87: 00        .byte $00
- D - I - 0x029C98 20:9C88: 00        .byte $00
- D - I - 0x029C99 20:9C89: 80        .byte $80
- D - I - 0x029C9A 20:9C8A: A3        .byte $A3	; <げ>
- D - I - 0x029C9B 20:9C8B: 04        .byte $04	; <え>
- D - I - 0x029C9C 20:9C8C: F1        .byte $F1
- D - I - 0x029C9D 20:9C8D: 00        .byte $00
- D - I - 0x029C9E 20:9C8E: 00        .byte $00
- D - I - 0x029C9F 20:9C8F: 80        .byte $80
- D - I - 0x029CA0 20:9C90: DB        .byte $DB
- D - I - 0x029CA1 20:9C91: 00        .byte $00
- D - I - 0x029CA2 20:9C92: F0        .byte $F0
off_9C93_C5:
- D - I - 0x029CA3 20:9C93: F5        .byte $F5
- D - I - 0x029CA4 20:9C94: 80        .byte $80
- D - I - 0x029CA5 20:9C95: F4        .byte $F4
- D - I - 0x029CA6 20:9C96: 04        .byte $04	; <え>
- D - I - 0x029CA7 20:9C97: 05        .byte $05	; <お>
- D - I - 0x029CA8 20:9C98: 20        .byte $20	; <み>
- D - I - 0x029CA9 20:9C99: 21        .byte $21	; <む>
- D - I - 0x029CAA 20:9C9A: F1        .byte $F1
- D - I - 0x029CAB 20:9C9B: 00        .byte $00
- D - I - 0x029CAC 20:9C9C: 00        .byte $00
- D - I - 0x029CAD 20:9C9D: 80        .byte $80
- D - I - 0x029CAE 20:9C9E: FB        .byte $FB
- D - I - 0x029CAF 20:9C9F: 00        .byte $00
- D - I - 0x029CB0 20:9CA0: F1        .byte $F1
- D - I - 0x029CB1 20:9CA1: BF        .byte $BF	; <ヂ>
- D - I - 0x029CB2 20:9CA2: CF        .byte $CF	; <プ>
- D - I - 0x029CB3 20:9CA3: F0        .byte $F0
- D - I - 0x029CB4 20:9CA4: CB        .byte $CB	; <ぺ>
- D - I - 0x029CB5 20:9CA5: 04        .byte $04	; <え>
- D - I - 0x029CB6 20:9CA6: F1        .byte $F1
- D - I - 0x029CB7 20:9CA7: BE        .byte $BE	; <ダ>
- D - I - 0x029CB8 20:9CA8: 33        .byte $33	; <0>
- D - I - 0x029CB9 20:9CA9: 04        .byte $04	; <え>
- D - I - 0x029CBA 20:9CAA: BB        .byte $BB	; <ズ>
- D - I - 0x029CBB 20:9CAB: 09        .byte $09	; <け>
- D - I - 0x029CBC 20:9CAC: F0        .byte $F0
off_9CAD_C6:
- D - I - 0x029CBD 20:9CAD: F5        .byte $F5
- D - I - 0x029CBE 20:9CAE: 80        .byte $80
- D - I - 0x029CBF 20:9CAF: F4        .byte $F4
- D - I - 0x029CC0 20:9CB0: 0C        .byte $0C	; <し>
- D - I - 0x029CC1 20:9CB1: 0D        .byte $0D	; <す>
- D - I - 0x029CC2 20:9CB2: 0E        .byte $0E	; <せ>
- D - I - 0x029CC3 20:9CB3: 0F        .byte $0F	; <そ>
- D - I - 0x029CC4 20:9CB4: F1        .byte $F1
- D - I - 0x029CC5 20:9CB5: 64        .byte $64	; <ヤ>
- D - I - 0x029CC6 20:9CB6: 1D        .byte $1D	; <へ>
- D - I - 0x029CC7 20:9CB7: 20        .byte $20	; <み>
- D - I - 0x029CC8 20:9CB8: BB        .byte $BB	; <ズ>
- D - I - 0x029CC9 20:9CB9: 05        .byte $05	; <お>
- D - I - 0x029CCA 20:9CBA: F1        .byte $F1
- D - I - 0x029CCB 20:9CBB: 65        .byte $65	; <ユ>
- D - I - 0x029CCC 20:9CBC: 1E        .byte $1E	; <ほ>
- D - I - 0x029CCD 20:9CBD: D0        .byte $D0	; <ペ>
- D - I - 0x029CCE 20:9CBE: 93        .byte $93	; <Y>
- D - I - 0x029CCF 20:9CBF: 00        .byte $00
- D - I - 0x029CD0 20:9CC0: 14        .byte $14	; <と>
- D - I - 0x029CD1 20:9CC1: F6        .byte $F6
- D - I - 0x029CD2 20:9CC2: 15        .byte $15	; <な>
- D - I - 0x029CD3 20:9CC3: F1        .byte $F1
- D - I - 0x029CD4 20:9CC4: C0        .byte $C0	; <ヅ>
- D - I - 0x029CD5 20:9CC5: 3F        .byte $3F	; <•>
- D - I - 0x029CD6 20:9CC6: 10        .byte $10	; <た>
- D - I - 0x029CD7 20:9CC7: B3        .byte $B3	; <ぼ>
- D - I - 0x029CD8 20:9CC8: 01        .byte $01	; <あ>
- D - I - 0x029CD9 20:9CC9: 04        .byte $04	; <え>
- D - I - 0x029CDA 20:9CCA: F1        .byte $F1
- D - I - 0x029CDB 20:9CCB: 66        .byte $66	; <ヨ>
- D - I - 0x029CDC 20:9CCC: 1D        .byte $1D	; <へ>
- D - I - 0x029CDD 20:9CCD: 10        .byte $10	; <た>
- D - I - 0x029CDE 20:9CCE: B3        .byte $B3	; <ぼ>
- D - I - 0x029CDF 20:9CCF: 05        .byte $05	; <お>
- D - I - 0x029CE0 20:9CD0: F1        .byte $F1
- D - I - 0x029CE1 20:9CD1: D6        .byte $D6
- D - I - 0x029CE2 20:9CD2: 1E        .byte $1E	; <ほ>
- D - I - 0x029CE3 20:9CD3: 08        .byte $08	; <く>
- D - I - 0x029CE4 20:9CD4: AF        .byte $AF	; <ば>
- D - I - 0x029CE5 20:9CD5: 01        .byte $01	; <あ>
- D - I - 0x029CE6 20:9CD6: F0        .byte $F0
off_9CD7_C7:
- D - I - 0x029CE7 20:9CD7: F5        .byte $F5
- D - I - 0x029CE8 20:9CD8: 80        .byte $80
- D - I - 0x029CE9 20:9CD9: F4        .byte $F4
- D - I - 0x029CEA 20:9CDA: 10        .byte $10	; <た>
- D - I - 0x029CEB 20:9CDB: 11        .byte $11	; <ち>
- D - I - 0x029CEC 20:9CDC: 12        .byte $12	; <つ>
- D - I - 0x029CED 20:9CDD: 13        .byte $13	; <て>
- D - I - 0x029CEE 20:9CDE: F7        .byte $F7
- D - I - 0x029CEF 20:9CDF: 03        .byte $03	; <う>
- D - I - 0x029CF0 20:9CE0: 7B        .byte $7B	; <。>
- D - I - 0x029CF1 20:9CE1: F1        .byte $F1
- D - I - 0x029CF2 20:9CE2: C2        .byte $C2	; <ド>
- D - I - 0x029CF3 20:9CE3: 53        .byte $53	; <テ>
- D - I - 0x029CF4 20:9CE4: E0        .byte $E0
- D - I - 0x029CF5 20:9CE5: 7B        .byte $7B	; <。>
- D - I - 0x029CF6 20:9CE6: 0C        .byte $0C	; <し>
- D - I - 0x029CF7 20:9CE7: F1        .byte $F1
- D - I - 0x029CF8 20:9CE8: 00        .byte $00
- D - I - 0x029CF9 20:9CE9: 00        .byte $00
- D - I - 0x029CFA 20:9CEA: 80        .byte $80
- D - I - 0x029CFB 20:9CEB: 83        .byte $83	; <C>
- D - I - 0x029CFC 20:9CEC: 00        .byte $00
- D - I - 0x029CFD 20:9CED: 28        .byte $28	; <り>
- D - I - 0x029CFE 20:9CEE: F1        .byte $F1
- D - I - 0x029CFF 20:9CEF: C3        .byte $C3	; <バ>
- D - I - 0x029D00 20:9CF0: 55        .byte $55	; <ナ>
- D - I - 0x029D01 20:9CF1: 10        .byte $10	; <た>
- D - I - 0x029D02 20:9CF2: 1B        .byte $1B	; <ひ>
- D - I - 0x029D03 20:9CF3: 07        .byte $07	; <き>
- D - I - 0x029D04 20:9CF4: F1        .byte $F1
- D - I - 0x029D05 20:9CF5: 00        .byte $00
- D - I - 0x029D06 20:9CF6: 00        .byte $00
- D - I - 0x029D07 20:9CF7: 80        .byte $80
- D - I - 0x029D08 20:9CF8: FB        .byte $FB
- D - I - 0x029D09 20:9CF9: 00        .byte $00
- D - I - 0x029D0A 20:9CFA: F0        .byte $F0
off_9CFB_C8:
- D - I - 0x029D0B 20:9CFB: F5        .byte $F5
- D - I - 0x029D0C 20:9CFC: 80        .byte $80
- D - I - 0x029D0D 20:9CFD: F4        .byte $F4
- D - I - 0x029D0E 20:9CFE: 04        .byte $04	; <え>
- D - I - 0x029D0F 20:9CFF: 05        .byte $05	; <お>
- D - I - 0x029D10 20:9D00: 20        .byte $20	; <み>
- D - I - 0x029D11 20:9D01: 21        .byte $21	; <む>
- D - I - 0x029D12 20:9D02: F1        .byte $F1
- D - I - 0x029D13 20:9D03: C4        .byte $C4	; <ビ>
- D - I - 0x029D14 20:9D04: 32        .byte $32	; <ょ>
- D - I - 0x029D15 20:9D05: B8        .byte $B8	; <ゴ>
- D - I - 0x029D16 20:9D06: BB        .byte $BB	; <ズ>
- D - I - 0x029D17 20:9D07: 05        .byte $05	; <お>
- D - I - 0x029D18 20:9D08: F1        .byte $F1
- D - I - 0x029D19 20:9D09: C5        .byte $C5	; <ブ>
- D - I - 0x029D1A 20:9D0A: C0        .byte $C0	; <ヅ>
- D - I - 0x029D1B 20:9D0B: E0        .byte $E0
- D - I - 0x029D1C 20:9D0C: C3        .byte $C3	; <バ>
- D - I - 0x029D1D 20:9D0D: 00        .byte $00
- D - I - 0x029D1E 20:9D0E: F0        .byte $F0
off_9D0F_C9:
- D - I - 0x029D1F 20:9D0F: F5        .byte $F5
- D - I - 0x029D20 20:9D10: 80        .byte $80
- D - I - 0x029D21 20:9D11: F4        .byte $F4
- D - I - 0x029D22 20:9D12: 13        .byte $13	; <て>
- D - I - 0x029D23 20:9D13: 00        .byte $00
- D - I - 0x029D24 20:9D14: 0F        .byte $0F	; <そ>
- D - I - 0x029D25 20:9D15: 00        .byte $00
- D - I - 0x029D26 20:9D16: F7        .byte $F7
- D - I - 0x029D27 20:9D17: 03        .byte $03	; <う>
- D - I - 0x029D28 20:9D18: 7B        .byte $7B	; <。>
- D - I - 0x029D29 20:9D19: F1        .byte $F1
- D - I - 0x029D2A 20:9D1A: C6        .byte $C6	; <ベ>
- D - I - 0x029D2B 20:9D1B: 2B        .byte $2B	; <ろ>
- D - I - 0x029D2C 20:9D1C: 40        .byte $40	; <「>
- D - I - 0x029D2D 20:9D1D: 0B        .byte $0B	; <さ>
- D - I - 0x029D2E 20:9D1E: 0F        .byte $0F	; <そ>
- D - I - 0x029D2F 20:9D1F: 14        .byte $14	; <と>
- D - I - 0x029D30 20:9D20: F1        .byte $F1
- D - I - 0x029D31 20:9D21: C7        .byte $C7	; <ボ>
- D - I - 0x029D32 20:9D22: 2A        .byte $2A	; <れ>
- D - I - 0x029D33 20:9D23: 00        .byte $00
- D - I - 0x029D34 20:9D24: 1B        .byte $1B	; <ひ>
- D - I - 0x029D35 20:9D25: 0B        .byte $0B	; <さ>
- D - I - 0x029D36 20:9D26: F1        .byte $F1
- D - I - 0x029D37 20:9D27: 00        .byte $00
- D - I - 0x029D38 20:9D28: 00        .byte $00
- D - I - 0x029D39 20:9D29: 80        .byte $80
- D - I - 0x029D3A 20:9D2A: FB        .byte $FB
- D - I - 0x029D3B 20:9D2B: 00        .byte $00
- D - I - 0x029D3C 20:9D2C: 32        .byte $32	; <ょ>
- D - I - 0x029D3D 20:9D2D: F1        .byte $F1
- D - I - 0x029D3E 20:9D2E: DF        .byte $DF
- D - I - 0x029D3F 20:9D2F: 2A        .byte $2A	; <れ>
- D - I - 0x029D40 20:9D30: F8        .byte $F8
- D - I - 0x029D41 20:9D31: 5B        .byte $5B	; <ヒ>
- D - I - 0x029D42 20:9D32: 0C        .byte $0C	; <し>
- D - I - 0x029D43 20:9D33: F0        .byte $F0
off_9D34_CA:
- D - I - 0x029D44 20:9D34: F5        .byte $F5
- D - I - 0x029D45 20:9D35: 80        .byte $80
- D - I - 0x029D46 20:9D36: F4        .byte $F4
- D - I - 0x029D47 20:9D37: 0C        .byte $0C	; <し>
- D - I - 0x029D48 20:9D38: 0D        .byte $0D	; <す>
- D - I - 0x029D49 20:9D39: 0E        .byte $0E	; <せ>
- D - I - 0x029D4A 20:9D3A: 0F        .byte $0F	; <そ>
- D - I - 0x029D4B 20:9D3B: F7        .byte $F7
- D - I - 0x029D4C 20:9D3C: 23        .byte $23	; <も>
- D - I - 0x029D4D 20:9D3D: 5B        .byte $5B	; <ヒ>
- D - I - 0x029D4E 20:9D3E: F1        .byte $F1
- D - I - 0x029D4F 20:9D3F: 51        .byte $51	; <チ>
- D - I - 0x029D50 20:9D40: 1C        .byte $1C	; <ふ>
- D - I - 0x029D51 20:9D41: 00        .byte $00
- D - I - 0x029D52 20:9D42: CB        .byte $CB	; <ぺ>
- D - I - 0x029D53 20:9D43: 0C        .byte $0C	; <し>
- D - I - 0x029D54 20:9D44: F1        .byte $F1
- D - I - 0x029D55 20:9D45: 9E        .byte $9E
- D - I - 0x029D56 20:9D46: 1E        .byte $1E	; <ほ>
- D - I - 0x029D57 20:9D47: 68        .byte $68	; <リ>
- D - I - 0x029D58 20:9D48: A3        .byte $A3	; <げ>
- D - I - 0x029D59 20:9D49: 09        .byte $09	; <け>
- D - I - 0x029D5A 20:9D4A: F1        .byte $F1
- D - I - 0x029D5B 20:9D4B: 00        .byte $00
- D - I - 0x029D5C 20:9D4C: 00        .byte $00
- D - I - 0x029D5D 20:9D4D: 80        .byte $80
- D - I - 0x029D5E 20:9D4E: A3        .byte $A3	; <げ>
- D - I - 0x029D5F 20:9D4F: 04        .byte $04	; <え>
- D - I - 0x029D60 20:9D50: F1        .byte $F1
- D - I - 0x029D61 20:9D51: 00        .byte $00
- D - I - 0x029D62 20:9D52: 00        .byte $00
- D - I - 0x029D63 20:9D53: 80        .byte $80
- D - I - 0x029D64 20:9D54: DB        .byte $DB
- D - I - 0x029D65 20:9D55: 00        .byte $00
- D - I - 0x029D66 20:9D56: 1E        .byte $1E	; <ほ>
- D - I - 0x029D67 20:9D57: F6        .byte $F6
- D - I - 0x029D68 20:9D58: 2A        .byte $2A	; <れ>
- D - I - 0x029D69 20:9D59: F1        .byte $F1
- D - I - 0x029D6A 20:9D5A: 29        .byte $29	; <る>
- D - I - 0x029D6B 20:9D5B: 47        .byte $47	; <キ>
- D - I - 0x029D6C 20:9D5C: E0        .byte $E0
- D - I - 0x029D6D 20:9D5D: CB        .byte $CB	; <ぺ>
- D - I - 0x029D6E 20:9D5E: 0C        .byte $0C	; <し>
- D - I - 0x029D6F 20:9D5F: 02        .byte $02	; <い>
- D - I - 0x029D70 20:9D60: F1        .byte $F1
- D - I - 0x029D71 20:9D61: 2A        .byte $2A	; <れ>
- D - I - 0x029D72 20:9D62: 20        .byte $20	; <み>
- D - I - 0x029D73 20:9D63: E8        .byte $E8
- D - I - 0x029D74 20:9D64: CB        .byte $CB	; <ぺ>
- D - I - 0x029D75 20:9D65: 0C        .byte $0C	; <し>
- D - I - 0x029D76 20:9D66: F1        .byte $F1
- D - I - 0x029D77 20:9D67: 41        .byte $41	; <ア>
- D - I - 0x029D78 20:9D68: 22        .byte $22	; <め>
- D - I - 0x029D79 20:9D69: FC        .byte $FC
- D - I - 0x029D7A 20:9D6A: BB        .byte $BB	; <ズ>
- D - I - 0x029D7B 20:9D6B: 08        .byte $08	; <く>
off_9D6C:
- D - I - 0x029D7C 20:9D6C: 01        .byte $01	; <あ>
- D - I - 0x029D7D 20:9D6D: FB        .byte $FB
- D - I - 0x029D7E 20:9D6E: 01        .byte $01	; <あ>
- D - I - 0x029D7F 20:9D6F: 23        .byte $23	; <も>
- D - I - 0x029D80 20:9D70: 45        .byte $45	; <オ>
- D - I - 0x029D81 20:9D71: 01        .byte $01	; <あ>
- D - I - 0x029D82 20:9D72: FB        .byte $FB
- D - I - 0x029D83 20:9D73: 01        .byte $01	; <あ>
- D - I - 0x029D84 20:9D74: 32        .byte $32	; <ょ>
- D - I - 0x029D85 20:9D75: 45        .byte $45	; <オ>
- D - I - 0x029D86 20:9D76: F8        .byte $F8
- D - I - 0x029D87 20:9D77: 6C 9D     .word off_9D6C
off_9D79_CB:
- D - I - 0x029D89 20:9D79: F5        .byte $F5
- D - I - 0x029D8A 20:9D7A: 80        .byte $80
- D - I - 0x029D8B 20:9D7B: F4        .byte $F4
- D - I - 0x029D8C 20:9D7C: 2B        .byte $2B	; <ろ>
- D - I - 0x029D8D 20:9D7D: 00        .byte $00
- D - I - 0x029D8E 20:9D7E: 00        .byte $00
- D - I - 0x029D8F 20:9D7F: 00        .byte $00
- D - I - 0x029D90 20:9D80: F1        .byte $F1
- D - I - 0x029D91 20:9D81: 00        .byte $00
- D - I - 0x029D92 20:9D82: 57        .byte $57	; <ヌ>
- D - I - 0x029D93 20:9D83: 10        .byte $10	; <た>
- D - I - 0x029D94 20:9D84: C3        .byte $C3	; <バ>
- D - I - 0x029D95 20:9D85: 01        .byte $01	; <あ>
- D - I - 0x029D96 20:9D86: F0        .byte $F0
off_9D87_CC:
- D - I - 0x029D97 20:9D87: F5        .byte $F5
- D - I - 0x029D98 20:9D88: 80        .byte $80
- D - I - 0x029D99 20:9D89: F4        .byte $F4
- D - I - 0x029D9A 20:9D8A: 14        .byte $14	; <と>
- D - I - 0x029D9B 20:9D8B: 15        .byte $15	; <な>
- D - I - 0x029D9C 20:9D8C: 16        .byte $16	; <に>
- D - I - 0x029D9D 20:9D8D: 00        .byte $00
- D - I - 0x029D9E 20:9D8E: F7        .byte $F7
- D - I - 0x029D9F 20:9D8F: 23        .byte $23	; <も>
- D - I - 0x029DA0 20:9D90: 5B        .byte $5B	; <ヒ>
- D - I - 0x029DA1 20:9D91: F1        .byte $F1
- D - I - 0x029DA2 20:9D92: 00        .byte $00
- D - I - 0x029DA3 20:9D93: 00        .byte $00
- D - I - 0x029DA4 20:9D94: 80        .byte $80
- D - I - 0x029DA5 20:9D95: DB        .byte $DB
- D - I - 0x029DA6 20:9D96: 00        .byte $00
- D - I - 0x029DA7 20:9D97: F1        .byte $F1
- D - I - 0x029DA8 20:9D98: 00        .byte $00
- D - I - 0x029DA9 20:9D99: 00        .byte $00
- D - I - 0x029DAA 20:9D9A: 80        .byte $80
- D - I - 0x029DAB 20:9D9B: A3        .byte $A3	; <げ>
- D - I - 0x029DAC 20:9D9C: 04        .byte $04	; <え>
- D - I - 0x029DAD 20:9D9D: F1        .byte $F1
- D - I - 0x029DAE 20:9D9E: B3        .byte $B3	; <ぼ>
- D - I - 0x029DAF 20:9D9F: 5F        .byte $5F	; <マ>
- D - I - 0x029DB0 20:9DA0: 70        .byte $70	; <ャ>
- D - I - 0x029DB1 20:9DA1: FF        .byte $FF
- D - I - 0x029DB2 20:9DA2: 08        .byte $08	; <く>
- D - I - 0x029DB3 20:9DA3: F0        .byte $F0
off_9DA4_CD:
- D - I - 0x029DB4 20:9DA4: F5        .byte $F5
- D - I - 0x029DB5 20:9DA5: 80        .byte $80
- D - I - 0x029DB6 20:9DA6: F4        .byte $F4
- D - I - 0x029DB7 20:9DA7: 27        .byte $27	; <ら>
- D - I - 0x029DB8 20:9DA8: 1E        .byte $1E	; <ほ>
- D - I - 0x029DB9 20:9DA9: 00        .byte $00
- D - I - 0x029DBA 20:9DAA: 0B        .byte $0B	; <さ>
- D - I - 0x029DBB 20:9DAB: F1        .byte $F1
- D - I - 0x029DBC 20:9DAC: B6        .byte $B6	; <グ>
- D - I - 0x029DBD 20:9DAD: 13        .byte $13	; <て>
- D - I - 0x029DBE 20:9DAE: 50        .byte $50	; <タ>
- D - I - 0x029DBF 20:9DAF: AB        .byte $AB	; <ぢ>
- D - I - 0x029DC0 20:9DB0: 04        .byte $04	; <え>
- D - I - 0x029DC1 20:9DB1: F1        .byte $F1
- D - I - 0x029DC2 20:9DB2: 92        .byte $92	; <W>
- D - I - 0x029DC3 20:9DB3: 49        .byte $49	; <ケ>
- D - I - 0x029DC4 20:9DB4: 20        .byte $20	; <み>
- D - I - 0x029DC5 20:9DB5: 77        .byte $77	; <:>
- D - I - 0x029DC6 20:9DB6: 01        .byte $01	; <あ>
- D - I - 0x029DC7 20:9DB7: F0        .byte $F0
off_9DB8_CE:
- D - I - 0x029DC8 20:9DB8: F5        .byte $F5
- D - I - 0x029DC9 20:9DB9: 09        .byte $09	; <け>
- D - I - 0x029DCA 20:9DBA: F4        .byte $F4
- D - I - 0x029DCB 20:9DBB: 22        .byte $22	; <め>
- D - I - 0x029DCC 20:9DBC: 23        .byte $23	; <も>
- D - I - 0x029DCD 20:9DBD: 00        .byte $00
- D - I - 0x029DCE 20:9DBE: 00        .byte $00
- D - I - 0x029DCF 20:9DBF: F1        .byte $F1
- D - I - 0x029DD0 20:9DC0: BB        .byte $BB	; <ズ>
- D - I - 0x029DD1 20:9DC1: 62        .byte $62	; <メ>
- D - I - 0x029DD2 20:9DC2: 18        .byte $18	; <ね>
- D - I - 0x029DD3 20:9DC3: 8B        .byte $8B	; <K>
- D - I - 0x029DD4 20:9DC4: 01        .byte $01	; <あ>
- D - I - 0x029DD5 20:9DC5: 01        .byte $01	; <あ>
- D - I - 0x029DD6 20:9DC6: F1        .byte $F1
- D - I - 0x029DD7 20:9DC7: BB        .byte $BB	; <ズ>
- D - I - 0x029DD8 20:9DC8: 62        .byte $62	; <メ>
- D - I - 0x029DD9 20:9DC9: 18        .byte $18	; <ね>
- D - I - 0x029DDA 20:9DCA: 8B        .byte $8B	; <K>
- D - I - 0x029DDB 20:9DCB: 05        .byte $05	; <お>
- D - I - 0x029DDC 20:9DCC: 01        .byte $01	; <あ>
- D - I - 0x029DDD 20:9DCD: F1        .byte $F1
- D - I - 0x029DDE 20:9DCE: BB        .byte $BB	; <ズ>
- D - I - 0x029DDF 20:9DCF: 61        .byte $61	; <ム>
- D - I - 0x029DE0 20:9DD0: 18        .byte $18	; <ね>
- D - I - 0x029DE1 20:9DD1: 8B        .byte $8B	; <K>
- D - I - 0x029DE2 20:9DD2: 09        .byte $09	; <け>
- D - I - 0x029DE3 20:9DD3: 01        .byte $01	; <あ>
- D - I - 0x029DE4 20:9DD4: F1        .byte $F1
- D - I - 0x029DE5 20:9DD5: BB        .byte $BB	; <ズ>
- D - I - 0x029DE6 20:9DD6: 61        .byte $61	; <ム>
- D - I - 0x029DE7 20:9DD7: 18        .byte $18	; <ね>
- D - I - 0x029DE8 20:9DD8: 8B        .byte $8B	; <K>
- D - I - 0x029DE9 20:9DD9: 0D        .byte $0D	; <す>
- D - I - 0x029DEA 20:9DDA: 01        .byte $01	; <あ>
- D - I - 0x029DEB 20:9DDB: F1        .byte $F1
- D - I - 0x029DEC 20:9DDC: BB        .byte $BB	; <ズ>
- D - I - 0x029DED 20:9DDD: 60        .byte $60	; <ミ>
- D - I - 0x029DEE 20:9DDE: 18        .byte $18	; <ね>
- D - I - 0x029DEF 20:9DDF: 8B        .byte $8B	; <K>
- D - I - 0x029DF0 20:9DE0: 11        .byte $11	; <ち>
- D - I - 0x029DF1 20:9DE1: 01        .byte $01	; <あ>
- D - I - 0x029DF2 20:9DE2: F1        .byte $F1
- D - I - 0x029DF3 20:9DE3: BB        .byte $BB	; <ズ>
- D - I - 0x029DF4 20:9DE4: 60        .byte $60	; <ミ>
- D - I - 0x029DF5 20:9DE5: 18        .byte $18	; <ね>
- D - I - 0x029DF6 20:9DE6: 8B        .byte $8B	; <K>
- D - I - 0x029DF7 20:9DE7: 15        .byte $15	; <な>
- D - I - 0x029DF8 20:9DE8: F0        .byte $F0
off_9DE9_CF:
- D - I - 0x029DF9 20:9DE9: F5        .byte $F5
- D - I - 0x029DFA 20:9DEA: 81        .byte $81	; <A>
- D - I - 0x029DFB 20:9DEB: F4        .byte $F4
- D - I - 0x029DFC 20:9DEC: 14        .byte $14	; <と>
- D - I - 0x029DFD 20:9DED: 15        .byte $15	; <な>
- D - I - 0x029DFE 20:9DEE: 16        .byte $16	; <に>
- D - I - 0x029DFF 20:9DEF: 00        .byte $00
- D - I - 0x029E00 20:9DF0: F1        .byte $F1
- D - I - 0x029E01 20:9DF1: B9        .byte $B9	; <ザ>
- D - I - 0x029E02 20:9DF2: 52        .byte $52	; <ツ>
- D - I - 0x029E03 20:9DF3: B0        .byte $B0	; <び>
- D - I - 0x029E04 20:9DF4: E3        .byte $E3
- D - I - 0x029E05 20:9DF5: 0C        .byte $0C	; <し>
- D - I - 0x029E06 20:9DF6: 28        .byte $28	; <り>
- D - I - 0x029E07 20:9DF7: F7        .byte $F7
- D - I - 0x029E08 20:9DF8: 23        .byte $23	; <も>
- D - I - 0x029E09 20:9DF9: 5B        .byte $5B	; <ヒ>
- D - I - 0x029E0A 20:9DFA: F1        .byte $F1
- D - I - 0x029E0B 20:9DFB: 00        .byte $00
- D - I - 0x029E0C 20:9DFC: 00        .byte $00
- D - I - 0x029E0D 20:9DFD: 80        .byte $80
- D - I - 0x029E0E 20:9DFE: A3        .byte $A3	; <げ>
- D - I - 0x029E0F 20:9DFF: 00        .byte $00
- D - I - 0x029E10 20:9E00: F1        .byte $F1
- D - I - 0x029E11 20:9E01: 00        .byte $00
- D - I - 0x029E12 20:9E02: 00        .byte $00
- D - I - 0x029E13 20:9E03: 80        .byte $80
- D - I - 0x029E14 20:9E04: DB        .byte $DB
- D - I - 0x029E15 20:9E05: 04        .byte $04	; <え>
- D - I - 0x029E16 20:9E06: F0        .byte $F0
off_9E07_D0:
- D - I - 0x029E17 20:9E07: F5        .byte $F5
- D - I - 0x029E18 20:9E08: 80        .byte $80
- D - I - 0x029E19 20:9E09: F4        .byte $F4
- D - I - 0x029E1A 20:9E0A: 08        .byte $08	; <く>
- D - I - 0x029E1B 20:9E0B: 09        .byte $09	; <け>
- D - I - 0x029E1C 20:9E0C: 0A        .byte $0A	; <こ>
- D - I - 0x029E1D 20:9E0D: 0B        .byte $0B	; <さ>
- D - I - 0x029E1E 20:9E0E: F1        .byte $F1
- D - I - 0x029E1F 20:9E0F: D3        .byte $D3
- D - I - 0x029E20 20:9E10: 6D        .byte $6D	; <ヲ>
- D - I - 0x029E21 20:9E11: 60        .byte $60	; <ミ>
- D - I - 0x029E22 20:9E12: BB        .byte $BB	; <ズ>
- D - I - 0x029E23 20:9E13: 05        .byte $05	; <お>
- D - I - 0x029E24 20:9E14: F1        .byte $F1
- D - I - 0x029E25 20:9E15: D3        .byte $D3
- D - I - 0x029E26 20:9E16: 6C        .byte $6C	; <ワ>
- D - I - 0x029E27 20:9E17: 60        .byte $60	; <ミ>
- D - I - 0x029E28 20:9E18: BB        .byte $BB	; <ズ>
- D - I - 0x029E29 20:9E19: 01        .byte $01	; <あ>
- D - I - 0x029E2A 20:9E1A: F1        .byte $F1
- D - I - 0x029E2B 20:9E1B: D3        .byte $D3
- D - I - 0x029E2C 20:9E1C: 6F        .byte $6F	; <ッ>
- D - I - 0x029E2D 20:9E1D: 60        .byte $60	; <ミ>
- D - I - 0x029E2E 20:9E1E: BB        .byte $BB	; <ズ>
- D - I - 0x029E2F 20:9E1F: 09        .byte $09	; <け>
- D - I - 0x029E30 20:9E20: F0        .byte $F0
off_9E21_D1:
- D - I - 0x029E31 20:9E21: F5        .byte $F5
- D - I - 0x029E32 20:9E22: 80        .byte $80
- D - I - 0x029E33 20:9E23: F4        .byte $F4
- D - I - 0x029E34 20:9E24: 08        .byte $08	; <く>
- D - I - 0x029E35 20:9E25: 09        .byte $09	; <け>
- D - I - 0x029E36 20:9E26: 0A        .byte $0A	; <こ>
- D - I - 0x029E37 20:9E27: 0B        .byte $0B	; <さ>
- D - I - 0x029E38 20:9E28: F1        .byte $F1
- D - I - 0x029E39 20:9E29: CA        .byte $CA	; <ぷ>
- D - I - 0x029E3A 20:9E2A: 6D        .byte $6D	; <ヲ>
- D - I - 0x029E3B 20:9E2B: 20        .byte $20	; <み>
- D - I - 0x029E3C 20:9E2C: C3        .byte $C3	; <バ>
- D - I - 0x029E3D 20:9E2D: 05        .byte $05	; <お>
- D - I - 0x029E3E 20:9E2E: F1        .byte $F1
- D - I - 0x029E3F 20:9E2F: CA        .byte $CA	; <ぷ>
- D - I - 0x029E40 20:9E30: 6C        .byte $6C	; <ワ>
- D - I - 0x029E41 20:9E31: 20        .byte $20	; <み>
- D - I - 0x029E42 20:9E32: C3        .byte $C3	; <バ>
- D - I - 0x029E43 20:9E33: 01        .byte $01	; <あ>
- D - I - 0x029E44 20:9E34: F1        .byte $F1
- D - I - 0x029E45 20:9E35: CA        .byte $CA	; <ぷ>
- D - I - 0x029E46 20:9E36: 6F        .byte $6F	; <ッ>
- D - I - 0x029E47 20:9E37: 20        .byte $20	; <み>
- D - I - 0x029E48 20:9E38: C3        .byte $C3	; <バ>
- D - I - 0x029E49 20:9E39: 09        .byte $09	; <け>
- D - I - 0x029E4A 20:9E3A: F0        .byte $F0
off_9E3B_D2:
- D - I - 0x029E4B 20:9E3B: F5        .byte $F5
- D - I - 0x029E4C 20:9E3C: 80        .byte $80
- D - I - 0x029E4D 20:9E3D: F4        .byte $F4
- D - I - 0x029E4E 20:9E3E: 08        .byte $08	; <く>
- D - I - 0x029E4F 20:9E3F: 09        .byte $09	; <け>
- D - I - 0x029E50 20:9E40: 0A        .byte $0A	; <こ>
- D - I - 0x029E51 20:9E41: 0B        .byte $0B	; <さ>
- D - I - 0x029E52 20:9E42: F1        .byte $F1
- D - I - 0x029E53 20:9E43: C9        .byte $C9	; <ぴ>
- D - I - 0x029E54 20:9E44: BE        .byte $BE	; <ダ>
- D - I - 0x029E55 20:9E45: E0        .byte $E0
- D - I - 0x029E56 20:9E46: C3        .byte $C3	; <バ>
- D - I - 0x029E57 20:9E47: 04        .byte $04	; <え>
- D - I - 0x029E58 20:9E48: F1        .byte $F1
- D - I - 0x029E59 20:9E49: C9        .byte $C9	; <ぴ>
- D - I - 0x029E5A 20:9E4A: BB        .byte $BB	; <ズ>
- D - I - 0x029E5B 20:9E4B: E0        .byte $E0
- D - I - 0x029E5C 20:9E4C: C3        .byte $C3	; <バ>
- D - I - 0x029E5D 20:9E4D: 00        .byte $00
- D - I - 0x029E5E 20:9E4E: F1        .byte $F1
- D - I - 0x029E5F 20:9E4F: C9        .byte $C9	; <ぴ>
- D - I - 0x029E60 20:9E50: C1        .byte $C1	; <デ>
- D - I - 0x029E61 20:9E51: E0        .byte $E0
- D - I - 0x029E62 20:9E52: C3        .byte $C3	; <バ>
- D - I - 0x029E63 20:9E53: 08        .byte $08	; <く>
- D - I - 0x029E64 20:9E54: F0        .byte $F0
off_9E55_D3:
- D - I - 0x029E65 20:9E55: F5        .byte $F5
- D - I - 0x029E66 20:9E56: 83        .byte $83	; <C>
- D - I - 0x029E67 20:9E57: F4        .byte $F4
- D - I - 0x029E68 20:9E58: 18        .byte $18	; <ね>
- D - I - 0x029E69 20:9E59: 19        .byte $19	; <の>
- D - I - 0x029E6A 20:9E5A: 1A        .byte $1A	; <は>
- D - I - 0x029E6B 20:9E5B: 1B        .byte $1B	; <ひ>
- D - I - 0x029E6C 20:9E5C: F1        .byte $F1
- D - I - 0x029E6D 20:9E5D: 13        .byte $13	; <て>
- D - I - 0x029E6E 20:9E5E: 17        .byte $17	; <ぬ>
- D - I - 0x029E6F 20:9E5F: F8        .byte $F8
- D - I - 0x029E70 20:9E60: C3        .byte $C3	; <バ>
- D - I - 0x029E71 20:9E61: 04        .byte $04	; <え>
- D - I - 0x029E72 20:9E62: F1        .byte $F1
- D - I - 0x029E73 20:9E63: CE        .byte $CE	; <ピ>
- D - I - 0x029E74 20:9E64: 15        .byte $15	; <な>
- D - I - 0x029E75 20:9E65: 80        .byte $80
- D - I - 0x029E76 20:9E66: EB        .byte $EB
- D - I - 0x029E77 20:9E67: 00        .byte $00
- D - I - 0x029E78 20:9E68: F8        .byte $F8
- D - I - 0x029E79 20:9E69: A7 8B     .word off_8BA7
off_9E6B_D4:
- D - I - 0x029E7B 20:9E6B: F5        .byte $F5
- D - I - 0x029E7C 20:9E6C: 84        .byte $84	; <D>
- D - I - 0x029E7D 20:9E6D: 34        .byte $34	; <1>
- D - I - 0x029E7E 20:9E6E: F4        .byte $F4
- D - I - 0x029E7F 20:9E6F: 30        .byte $30	; <ゃ>
- D - I - 0x029E80 20:9E70: 31        .byte $31	; <ゅ>
- D - I - 0x029E81 20:9E71: 32        .byte $32	; <ょ>
- D - I - 0x029E82 20:9E72: 00        .byte $00
- D - I - 0x029E83 20:9E73: F1        .byte $F1
- D - I - 0x029E84 20:9E74: CC        .byte $CC	; <ぽ>
- D - I - 0x029E85 20:9E75: A5        .byte $A5	; <ざ>
- D - I - 0x029E86 20:9E76: F8        .byte $F8
- D - I - 0x029E87 20:9E77: D3        .byte $D3
- D - I - 0x029E88 20:9E78: 01        .byte $01	; <あ>
- D - I - 0x029E89 20:9E79: F0        .byte $F0
off_9E7A_D5:
- D - I - 0x029E8A 20:9E7A: F5        .byte $F5
- D - I - 0x029E8B 20:9E7B: 84        .byte $84	; <D>
- D - I - 0x029E8C 20:9E7C: 33        .byte $33	; <0>
- D - I - 0x029E8D 20:9E7D: F4        .byte $F4
- D - I - 0x029E8E 20:9E7E: 30        .byte $30	; <ゃ>
- D - I - 0x029E8F 20:9E7F: 31        .byte $31	; <ゅ>
- D - I - 0x029E90 20:9E80: 32        .byte $32	; <ょ>
- D - I - 0x029E91 20:9E81: 00        .byte $00
- D - I - 0x029E92 20:9E82: F1        .byte $F1
- D - I - 0x029E93 20:9E83: CC        .byte $CC	; <ぽ>
- D - I - 0x029E94 20:9E84: A6        .byte $A6	; <じ>
- D - I - 0x029E95 20:9E85: F8        .byte $F8
- D - I - 0x029E96 20:9E86: D3        .byte $D3
- D - I - 0x029E97 20:9E87: 01        .byte $01	; <あ>
- D - I - 0x029E98 20:9E88: F0        .byte $F0
off_9E89_D6:
- D - I - 0x029E99 20:9E89: F5        .byte $F5
- D - I - 0x029E9A 20:9E8A: 0F        .byte $0F	; <そ>
- D - I - 0x029E9B 20:9E8B: F4        .byte $F4
- D - I - 0x029E9C 20:9E8C: 16        .byte $16	; <に>
- D - I - 0x029E9D 20:9E8D: 17        .byte $17	; <ぬ>
- D - I - 0x029E9E 20:9E8E: 2D        .byte $2D	; <を>
- D - I - 0x029E9F 20:9E8F: 00        .byte $00
- D - I - 0x029EA0 20:9E90: F1        .byte $F1
- D - I - 0x029EA1 20:9E91: 00        .byte $00
- D - I - 0x029EA2 20:9E92: 69        .byte $69	; <ル>
- D - I - 0x029EA3 20:9E93: 00        .byte $00
- D - I - 0x029EA4 20:9E94: C3        .byte $C3	; <バ>
- D - I - 0x029EA5 20:9E95: 01        .byte $01	; <あ>
- D - I - 0x029EA6 20:9E96: F0        .byte $F0
off_9E97_D7:
- D - I - 0x029EA7 20:9E97: F5        .byte $F5
- D - I - 0x029EA8 20:9E98: 80        .byte $80
- D - I - 0x029EA9 20:9E99: F4        .byte $F4
- D - I - 0x029EAA 20:9E9A: 16        .byte $16	; <に>
- D - I - 0x029EAB 20:9E9B: 17        .byte $17	; <ぬ>
- D - I - 0x029EAC 20:9E9C: 2D        .byte $2D	; <を>
- D - I - 0x029EAD 20:9E9D: 00        .byte $00
- D - I - 0x029EAE 20:9E9E: F1        .byte $F1
- D - I - 0x029EAF 20:9E9F: 00        .byte $00
- D - I - 0x029EB0 20:9EA0: 7B        .byte $7B	; <。>
- D - I - 0x029EB1 20:9EA1: 00        .byte $00
- D - I - 0x029EB2 20:9EA2: C3        .byte $C3	; <バ>
- D - I - 0x029EB3 20:9EA3: 01        .byte $01	; <あ>
- D - I - 0x029EB4 20:9EA4: F0        .byte $F0
off_9EA5_D8:
- D - I - 0x029EB5 20:9EA5: F5        .byte $F5
- D - I - 0x029EB6 20:9EA6: 80        .byte $80
- D - I - 0x029EB7 20:9EA7: F4        .byte $F4
- D - I - 0x029EB8 20:9EA8: 16        .byte $16	; <に>
- D - I - 0x029EB9 20:9EA9: 17        .byte $17	; <ぬ>
- D - I - 0x029EBA 20:9EAA: 2D        .byte $2D	; <を>
- D - I - 0x029EBB 20:9EAB: 00        .byte $00
- D - I - 0x029EBC 20:9EAC: F1        .byte $F1
- D - I - 0x029EBD 20:9EAD: 00        .byte $00
- D - I - 0x029EBE 20:9EAE: 7C        .byte $7C	; <~>
- D - I - 0x029EBF 20:9EAF: 00        .byte $00
- D - I - 0x029EC0 20:9EB0: C3        .byte $C3	; <バ>
- D - I - 0x029EC1 20:9EB1: 01        .byte $01	; <あ>
- D - I - 0x029EC2 20:9EB2: F0        .byte $F0
off_9EB3_D9:
- D - I - 0x029EC3 20:9EB3: F5        .byte $F5
- D - I - 0x029EC4 20:9EB4: 80        .byte $80
- D - I - 0x029EC5 20:9EB5: F4        .byte $F4
- D - I - 0x029EC6 20:9EB6: 16        .byte $16	; <に>
- D - I - 0x029EC7 20:9EB7: 17        .byte $17	; <ぬ>
- D - I - 0x029EC8 20:9EB8: 2D        .byte $2D	; <を>
- D - I - 0x029EC9 20:9EB9: 00        .byte $00
- D - I - 0x029ECA 20:9EBA: F1        .byte $F1
- D - I - 0x029ECB 20:9EBB: 00        .byte $00
- D - I - 0x029ECC 20:9EBC: 7D        .byte $7D	; <ー>
- D - I - 0x029ECD 20:9EBD: 00        .byte $00
- D - I - 0x029ECE 20:9EBE: C3        .byte $C3	; <バ>
- D - I - 0x029ECF 20:9EBF: 01        .byte $01	; <あ>
- D - I - 0x029ED0 20:9EC0: F0        .byte $F0
off_9EC1_DA:
- D - I - 0x029ED1 20:9EC1: F5        .byte $F5
- D - I - 0x029ED2 20:9EC2: 83        .byte $83	; <C>
- D - I - 0x029ED3 20:9EC3: F4        .byte $F4
- D - I - 0x029ED4 20:9EC4: 04        .byte $04	; <え>
- D - I - 0x029ED5 20:9EC5: 05        .byte $05	; <お>
- D - I - 0x029ED6 20:9EC6: 1E        .byte $1E	; <ほ>
- D - I - 0x029ED7 20:9EC7: 1F        .byte $1F	; <ま>
- D - I - 0x029ED8 20:9EC8: F1        .byte $F1
- D - I - 0x029ED9 20:9EC9: 00        .byte $00
- D - I - 0x029EDA 20:9ECA: 8C        .byte $8C	; <M>
- D - I - 0x029EDB 20:9ECB: 1C        .byte $1C	; <ふ>
- D - I - 0x029EDC 20:9ECC: D7        .byte $D7
- D - I - 0x029EDD 20:9ECD: 01        .byte $01	; <あ>
- D - I - 0x029EDE 20:9ECE: F0        .byte $F0
off_9ECF_DB:
- D - I - 0x029EDF 20:9ECF: F5        .byte $F5
- D - I - 0x029EE0 20:9ED0: 80        .byte $80
- D - I - 0x029EE1 20:9ED1: F4        .byte $F4
- D - I - 0x029EE2 20:9ED2: 10        .byte $10	; <た>
- D - I - 0x029EE3 20:9ED3: 11        .byte $11	; <ち>
- D - I - 0x029EE4 20:9ED4: 12        .byte $12	; <つ>
- D - I - 0x029EE5 20:9ED5: 13        .byte $13	; <て>
- D - I - 0x029EE6 20:9ED6: F7        .byte $F7
- D - I - 0x029EE7 20:9ED7: 23        .byte $23	; <も>
- D - I - 0x029EE8 20:9ED8: 5B        .byte $5B	; <ヒ>
- D - I - 0x029EE9 20:9ED9: F1        .byte $F1
- D - I - 0x029EEA 20:9EDA: E0        .byte $E0
- D - I - 0x029EEB 20:9EDB: 6B        .byte $6B	; <ロ>
- D - I - 0x029EEC 20:9EDC: 06        .byte $06	; <か>
- D - I - 0x029EED 20:9EDD: B3        .byte $B3	; <ぼ>
- D - I - 0x029EEE 20:9EDE: 0C        .byte $0C	; <し>
- D - I - 0x029EEF 20:9EDF: F1        .byte $F1
- D - I - 0x029EF0 20:9EE0: E0        .byte $E0
- D - I - 0x029EF1 20:9EE1: C5        .byte $C5	; <ブ>
- D - I - 0x029EF2 20:9EE2: 06        .byte $06	; <か>
- D - I - 0x029EF3 20:9EE3: B3        .byte $B3	; <ぼ>
- D - I - 0x029EF4 20:9EE4: 08        .byte $08	; <く>
- D - I - 0x029EF5 20:9EE5: F1        .byte $F1
- D - I - 0x029EF6 20:9EE6: 00        .byte $00
- D - I - 0x029EF7 20:9EE7: 00        .byte $00
- D - I - 0x029EF8 20:9EE8: 80        .byte $80
- D - I - 0x029EF9 20:9EE9: A3        .byte $A3	; <げ>
- D - I - 0x029EFA 20:9EEA: 04        .byte $04	; <え>
- D - I - 0x029EFB 20:9EEB: F1        .byte $F1
- D - I - 0x029EFC 20:9EEC: 00        .byte $00
- D - I - 0x029EFD 20:9EED: 00        .byte $00
- D - I - 0x029EFE 20:9EEE: 80        .byte $80
- D - I - 0x029EFF 20:9EEF: DB        .byte $DB
- D - I - 0x029F00 20:9EF0: 00        .byte $00
- D - I - 0x029F01 20:9EF1: 14        .byte $14	; <と>
- D - I - 0x029F02 20:9EF2: F1        .byte $F1
- D - I - 0x029F03 20:9EF3: E1        .byte $E1
- D - I - 0x029F04 20:9EF4: C3        .byte $C3	; <バ>
- D - I - 0x029F05 20:9EF5: FB        .byte $FB
- D - I - 0x029F06 20:9EF6: B3        .byte $B3	; <ぼ>
- D - I - 0x029F07 20:9EF7: 15        .byte $15	; <な>
- D - I - 0x029F08 20:9EF8: F1        .byte $F1
- D - I - 0x029F09 20:9EF9: E1        .byte $E1
- D - I - 0x029F0A 20:9EFA: C2        .byte $C2	; <ド>
- D - I - 0x029F0B 20:9EFB: FB        .byte $FB
- D - I - 0x029F0C 20:9EFC: B3        .byte $B3	; <ぼ>
- D - I - 0x029F0D 20:9EFD: 11        .byte $11	; <ち>
- D - I - 0x029F0E 20:9EFE: 28        .byte $28	; <り>
- D - I - 0x029F0F 20:9EFF: F7        .byte $F7
- D - I - 0x029F10 20:9F00: 03        .byte $03	; <う>
- D - I - 0x029F11 20:9F01: 7B        .byte $7B	; <。>
- D - I - 0x029F12 20:9F02: F6        .byte $F6
- D - I - 0x029F13 20:9F03: 54        .byte $54	; <ト>
- D - I - 0x029F14 20:9F04: F6        .byte $F6
- D - I - 0x029F15 20:9F05: 69        .byte $69	; <ル>
- D - I - 0x029F16 20:9F06: F1        .byte $F1
- D - I - 0x029F17 20:9F07: 00        .byte $00
- D - I - 0x029F18 20:9F08: C3        .byte $C3	; <バ>
- D - I - 0x029F19 20:9F09: 38        .byte $38	; <5>
- D - I - 0x029F1A 20:9F0A: B3        .byte $B3	; <ぼ>
- D - I - 0x029F1B 20:9F0B: 0D        .byte $0D	; <す>
- D - I - 0x029F1C 20:9F0C: F1        .byte $F1
- D - I - 0x029F1D 20:9F0D: 00        .byte $00
- D - I - 0x029F1E 20:9F0E: C2        .byte $C2	; <ド>
- D - I - 0x029F1F 20:9F0F: 38        .byte $38	; <5>
- D - I - 0x029F20 20:9F10: B3        .byte $B3	; <ぼ>
- D - I - 0x029F21 20:9F11: 09        .byte $09	; <け>
- D - I - 0x029F22 20:9F12: F1        .byte $F1
- D - I - 0x029F23 20:9F13: 00        .byte $00
- D - I - 0x029F24 20:9F14: 6B        .byte $6B	; <ロ>
- D - I - 0x029F25 20:9F15: C8        .byte $C8	; <ぱ>
- D - I - 0x029F26 20:9F16: B3        .byte $B3	; <ぼ>
- D - I - 0x029F27 20:9F17: 04        .byte $04	; <え>
- D - I - 0x029F28 20:9F18: F1        .byte $F1
- D - I - 0x029F29 20:9F19: 00        .byte $00
- D - I - 0x029F2A 20:9F1A: 6A        .byte $6A	; <レ>
- D - I - 0x029F2B 20:9F1B: C8        .byte $C8	; <ぱ>
- D - I - 0x029F2C 20:9F1C: B3        .byte $B3	; <ぼ>
- D - I - 0x029F2D 20:9F1D: 00        .byte $00
- D - I - 0x029F2E 20:9F1E: F0        .byte $F0
off_9F1F_DC:
- D - I - 0x029F2F 20:9F1F: F5        .byte $F5
- D - I - 0x029F30 20:9F20: 80        .byte $80
- D - I - 0x029F31 20:9F21: F4        .byte $F4
- D - I - 0x029F32 20:9F22: 04        .byte $04	; <え>
- D - I - 0x029F33 20:9F23: 05        .byte $05	; <お>
- D - I - 0x029F34 20:9F24: 20        .byte $20	; <み>
- D - I - 0x029F35 20:9F25: 21        .byte $21	; <む>
- D - I - 0x029F36 20:9F26: F7        .byte $F7
- D - I - 0x029F37 20:9F27: 03        .byte $03	; <う>
- D - I - 0x029F38 20:9F28: 7B        .byte $7B	; <。>
- D - I - 0x029F39 20:9F29: F1        .byte $F1
- D - I - 0x029F3A 20:9F2A: 00        .byte $00
- D - I - 0x029F3B 20:9F2B: 54        .byte $54	; <ト>
- D - I - 0x029F3C 20:9F2C: 10        .byte $10	; <た>
- D - I - 0x029F3D 20:9F2D: BB        .byte $BB	; <ズ>
- D - I - 0x029F3E 20:9F2E: 09        .byte $09	; <け>
- D - I - 0x029F3F 20:9F2F: F1        .byte $F1
- D - I - 0x029F40 20:9F30: 00        .byte $00
- D - I - 0x029F41 20:9F31: 71        .byte $71	; <ュ>
- D - I - 0x029F42 20:9F32: 00        .byte $00
- D - I - 0x029F43 20:9F33: CB        .byte $CB	; <ぺ>
- D - I - 0x029F44 20:9F34: 05        .byte $05	; <お>
- D - I - 0x029F45 20:9F35: F1        .byte $F1
- D - I - 0x029F46 20:9F36: 00        .byte $00
- D - I - 0x029F47 20:9F37: 00        .byte $00
- D - I - 0x029F48 20:9F38: 80        .byte $80
- D - I - 0x029F49 20:9F39: FB        .byte $FB
- D - I - 0x029F4A 20:9F3A: 00        .byte $00
- D - I - 0x029F4B 20:9F3B: F0        .byte $F0
off_9F3C_DD:
- D - I - 0x029F4C 20:9F3C: F5        .byte $F5
- D - I - 0x029F4D 20:9F3D: 80        .byte $80
- D - I - 0x029F4E 20:9F3E: F4        .byte $F4
- D - I - 0x029F4F 20:9F3F: 08        .byte $08	; <く>
- D - I - 0x029F50 20:9F40: 09        .byte $09	; <け>
- D - I - 0x029F51 20:9F41: 0A        .byte $0A	; <こ>
- D - I - 0x029F52 20:9F42: 0B        .byte $0B	; <さ>
- D - I - 0x029F53 20:9F43: F1        .byte $F1
- D - I - 0x029F54 20:9F44: CF        .byte $CF	; <プ>
- D - I - 0x029F55 20:9F45: 4D        .byte $4D	; <ス>
- D - I - 0x029F56 20:9F46: 00        .byte $00
- D - I - 0x029F57 20:9F47: C3        .byte $C3	; <バ>
- D - I - 0x029F58 20:9F48: 05        .byte $05	; <お>
- D - I - 0x029F59 20:9F49: F1        .byte $F1
- D - I - 0x029F5A 20:9F4A: CF        .byte $CF	; <プ>
- D - I - 0x029F5B 20:9F4B: 4B        .byte $4B	; <サ>
- D - I - 0x029F5C 20:9F4C: 00        .byte $00
- D - I - 0x029F5D 20:9F4D: C3        .byte $C3	; <バ>
- D - I - 0x029F5E 20:9F4E: 01        .byte $01	; <あ>
- D - I - 0x029F5F 20:9F4F: F1        .byte $F1
- D - I - 0x029F60 20:9F50: CF        .byte $CF	; <プ>
- D - I - 0x029F61 20:9F51: 58        .byte $58	; <ネ>
- D - I - 0x029F62 20:9F52: 00        .byte $00
- D - I - 0x029F63 20:9F53: C3        .byte $C3	; <バ>
- D - I - 0x029F64 20:9F54: 09        .byte $09	; <け>
- D - I - 0x029F65 20:9F55: F0        .byte $F0
off_9F56_DE:
- D - I - 0x029F66 20:9F56: F5        .byte $F5
- D - I - 0x029F67 20:9F57: 09        .byte $09	; <け>
- D - I - 0x029F68 20:9F58: F4        .byte $F4
- D - I - 0x029F69 20:9F59: 60        .byte $60	; <ミ>
- D - I - 0x029F6A 20:9F5A: 61        .byte $61	; <ム>
- D - I - 0x029F6B 20:9F5B: 62        .byte $62	; <メ>
- D - I - 0x029F6C 20:9F5C: 63        .byte $63	; <モ>
- D - I - 0x029F6D 20:9F5D: F1        .byte $F1
- D - I - 0x029F6E 20:9F5E: 0F        .byte $0F	; <そ>
- D - I - 0x029F6F 20:9F5F: 79        .byte $79	; <!>
- D - I - 0x029F70 20:9F60: F0        .byte $F0
- D - I - 0x029F71 20:9F61: BB        .byte $BB	; <ズ>
- D - I - 0x029F72 20:9F62: 01        .byte $01	; <あ>
- D - I - 0x029F73 20:9F63: EF        .byte $EF
- D - I - 0x029F74 20:9F64: EF        .byte $EF
- D - I - 0x029F75 20:9F65: 20        .byte $20	; <み>
- D - I - 0x029F76 20:9F66: F1        .byte $F1
- D - I - 0x029F77 20:9F67: 00        .byte $00
- D - I - 0x029F78 20:9F68: 82        .byte $82	; <B>
- D - I - 0x029F79 20:9F69: F0        .byte $F0
- D - I - 0x029F7A 20:9F6A: BB        .byte $BB	; <ズ>
- D - I - 0x029F7B 20:9F6B: 00        .byte $00
- D - I - 0x029F7C 20:9F6C: F0        .byte $F0
off_9F6D_DF:
- - - - - 0x029F7D 20:9F6D: F5        .byte $F5
- - - - - 0x029F7E 20:9F6E: 18        .byte $18	; <ね>
- - - - - 0x029F7F 20:9F6F: F4        .byte $F4
- - - - - 0x029F80 20:9F70: 08        .byte $08	; <く>
- - - - - 0x029F81 20:9F71: 09        .byte $09	; <け>
- - - - - 0x029F82 20:9F72: 0A        .byte $0A	; <こ>
- - - - - 0x029F83 20:9F73: 0B        .byte $0B	; <さ>
- - - - - 0x029F84 20:9F74: F1        .byte $F1
- - - - - 0x029F85 20:9F75: AC        .byte $AC	; <づ>
- - - - - 0x029F86 20:9F76: 49        .byte $49	; <ケ>
- - - - - 0x029F87 20:9F77: 9C        .byte $9C
- - - - - 0x029F88 20:9F78: 63        .byte $63	; <モ>
- - - - - 0x029F89 20:9F79: 00        .byte $00
- - - - - 0x029F8A 20:9F7A: F1        .byte $F1
- - - - - 0x029F8B 20:9F7B: 67        .byte $67	; <ラ>
- - - - - 0x029F8C 20:9F7C: D4        .byte $D4
- - - - - 0x029F8D 20:9F7D: F0        .byte $F0
- - - - - 0x029F8E 20:9F7E: B3        .byte $B3	; <ぼ>
- - - - - 0x029F8F 20:9F7F: 04        .byte $04	; <え>
- - - - - 0x029F90 20:9F80: F1        .byte $F1
- - - - - 0x029F91 20:9F81: 67        .byte $67	; <ラ>
- - - - - 0x029F92 20:9F82: 95        .byte $95
- - - - - 0x029F93 20:9F83: F0        .byte $F0
- - - - - 0x029F94 20:9F84: B3        .byte $B3	; <ぼ>
- - - - - 0x029F95 20:9F85: 08        .byte $08	; <く>
- - - - - 0x029F96 20:9F86: F1        .byte $F1
- - - - - 0x029F97 20:9F87: 67        .byte $67	; <ラ>
- - - - - 0x029F98 20:9F88: 96        .byte $96
- - - - - 0x029F99 20:9F89: F0        .byte $F0
- - - - - 0x029F9A 20:9F8A: B3        .byte $B3	; <ぼ>
- - - - - 0x029F9B 20:9F8B: 0C        .byte $0C	; <し>
- - - - - 0x029F9C 20:9F8C: 16        .byte $16	; <に>
- - - - - 0x029F9D 20:9F8D: F4        .byte $F4
- - - - - 0x029F9E 20:9F8E: 0A        .byte $0A	; <こ>
- - - - - 0x029F9F 20:9F8F: 0B        .byte $0B	; <さ>
- - - - - 0x029FA0 20:9F90: 00        .byte $00
- - - - - 0x029FA1 20:9F91: 00        .byte $00
- - - - - 0x029FA2 20:9F92: F6        .byte $F6
- - - - - 0x029FA3 20:9F93: 00        .byte $00
- - - - - 0x029FA4 20:9F94: F6        .byte $F6
- - - - - 0x029FA5 20:9F95: 2A        .byte $2A	; <れ>
- - - - - 0x029FA6 20:9F96: F6        .byte $F6
- - - - - 0x029FA7 20:9F97: 3F        .byte $3F	; <•>
- - - - - 0x029FA8 20:9F98: F1        .byte $F1
- - - - - 0x029FA9 20:9F99: 00        .byte $00
- - - - - 0x029FAA 20:9F9A: DB        .byte $DB
- - - - - 0x029FAB 20:9F9B: 20        .byte $20	; <み>
- - - - - 0x029FAC 20:9F9C: BB        .byte $BB	; <ズ>
- - - - - 0x029FAD 20:9F9D: 05        .byte $05	; <お>
- - - - - 0x029FAE 20:9F9E: 04        .byte $04	; <え>
- - - - - 0x029FAF 20:9F9F: F1        .byte $F1
- - - - - 0x029FB0 20:9FA0: 68        .byte $68	; <リ>
- - - - - 0x029FB1 20:9FA1: E1        .byte $E1
- - - - - 0x029FB2 20:9FA2: 20        .byte $20	; <み>
- - - - - 0x029FB3 20:9FA3: BB        .byte $BB	; <ズ>
- - - - - 0x029FB4 20:9FA4: 05        .byte $05	; <お>
- - - - - 0x029FB5 20:9FA5: F8        .byte $F8
- - - - - 0x029FB6 20:9FA6: 0C 99     .word off_990C
off_9FA8_E0:
- D - I - 0x029FB8 20:9FA8: F5        .byte $F5
- D - I - 0x029FB9 20:9FA9: 14        .byte $14	; <と>
- D - I - 0x029FBA 20:9FAA: F4        .byte $F4
- D - I - 0x029FBB 20:9FAB: 74        .byte $74	; <ィ>
- D - I - 0x029FBC 20:9FAC: 75        .byte $75	; <ェ>
- D - I - 0x029FBD 20:9FAD: 7B        .byte $7B	; <。>
- D - I - 0x029FBE 20:9FAE: 67        .byte $67	; <ラ>
- D - I - 0x029FBF 20:9FAF: F1        .byte $F1
- D - I - 0x029FC0 20:9FB0: 00        .byte $00
- D - I - 0x029FC1 20:9FB1: 81        .byte $81	; <A>
- D - I - 0x029FC2 20:9FB2: 00        .byte $00
- D - I - 0x029FC3 20:9FB3: D3        .byte $D3
- D - I - 0x029FC4 20:9FB4: 01        .byte $01	; <あ>
- D - I - 0x029FC5 20:9FB5: EF        .byte $EF
- D - I - 0x029FC6 20:9FB6: F5        .byte $F5
- D - I - 0x029FC7 20:9FB7: 0C        .byte $0C	; <し>
- D - I - 0x029FC8 20:9FB8: F4        .byte $F4
- D - I - 0x029FC9 20:9FB9: 6C        .byte $6C	; <ワ>
- D - I - 0x029FCA 20:9FBA: 6D        .byte $6D	; <ヲ>
- D - I - 0x029FCB 20:9FBB: 6E        .byte $6E	; <ン>
- D - I - 0x029FCC 20:9FBC: 6F        .byte $6F	; <ッ>
- D - I - 0x029FCD 20:9FBD: F1        .byte $F1
- D - I - 0x029FCE 20:9FBE: D5        .byte $D5
- D - I - 0x029FCF 20:9FBF: 78        .byte $78	; <?>
- D - I - 0x029FD0 20:9FC0: F8        .byte $F8
- D - I - 0x029FD1 20:9FC1: D3        .byte $D3
- D - I - 0x029FD2 20:9FC2: 00        .byte $00
- D - I - 0x029FD3 20:9FC3: F0        .byte $F0
off_9FC4_E1:
- D - I - 0x029FD4 20:9FC4: F5        .byte $F5
- D - I - 0x029FD5 20:9FC5: 0E        .byte $0E	; <せ>
- D - I - 0x029FD6 20:9FC6: F8        .byte $F8
- D - I - 0x029FD7 20:9FC7: 3A 9C     .word off_9C3A
off_9FC9_E2:
- D - I - 0x029FD9 20:9FC9: F5        .byte $F5
- D - I - 0x029FDA 20:9FCA: 80        .byte $80
- D - I - 0x029FDB 20:9FCB: F4        .byte $F4
- D - I - 0x029FDC 20:9FCC: 08        .byte $08	; <く>
- D - I - 0x029FDD 20:9FCD: 09        .byte $09	; <け>
- D - I - 0x029FDE 20:9FCE: 0A        .byte $0A	; <こ>
- D - I - 0x029FDF 20:9FCF: 0B        .byte $0B	; <さ>
- D - I - 0x029FE0 20:9FD0: F1        .byte $F1
- D - I - 0x029FE1 20:9FD1: DC        .byte $DC
- D - I - 0x029FE2 20:9FD2: 4D        .byte $4D	; <ス>
- D - I - 0x029FE3 20:9FD3: 60        .byte $60	; <ミ>
- D - I - 0x029FE4 20:9FD4: B3        .byte $B3	; <ぼ>
- D - I - 0x029FE5 20:9FD5: 05        .byte $05	; <お>
- D - I - 0x029FE6 20:9FD6: F1        .byte $F1
- D - I - 0x029FE7 20:9FD7: DC        .byte $DC
- D - I - 0x029FE8 20:9FD8: 4B        .byte $4B	; <サ>
- D - I - 0x029FE9 20:9FD9: 60        .byte $60	; <ミ>
- D - I - 0x029FEA 20:9FDA: B3        .byte $B3	; <ぼ>
- D - I - 0x029FEB 20:9FDB: 01        .byte $01	; <あ>
- D - I - 0x029FEC 20:9FDC: F1        .byte $F1
- D - I - 0x029FED 20:9FDD: DC        .byte $DC
- D - I - 0x029FEE 20:9FDE: 58        .byte $58	; <ネ>
- D - I - 0x029FEF 20:9FDF: 60        .byte $60	; <ミ>
- D - I - 0x029FF0 20:9FE0: B3        .byte $B3	; <ぼ>
- D - I - 0x029FF1 20:9FE1: 09        .byte $09	; <け>
- D - I - 0x029FF2 20:9FE2: 1E        .byte $1E	; <ほ>
- D - I - 0x029FF3 20:9FE3: F1        .byte $F1
- D - I - 0x029FF4 20:9FE4: DD        .byte $DD
- D - I - 0x029FF5 20:9FE5: 4F        .byte $4F	; <ソ>
- D - I - 0x029FF6 20:9FE6: 20        .byte $20	; <み>
- D - I - 0x029FF7 20:9FE7: C3        .byte $C3	; <バ>
- D - I - 0x029FF8 20:9FE8: 09        .byte $09	; <け>
- D - I - 0x029FF9 20:9FE9: F1        .byte $F1
- D - I - 0x029FFA 20:9FEA: DD        .byte $DD
- D - I - 0x029FFB 20:9FEB: 4D        .byte $4D	; <ス>
- D - I - 0x029FFC 20:9FEC: 20        .byte $20	; <み>
- D - I - 0x029FFD 20:9FED: C3        .byte $C3	; <バ>
- D - I - 0x029FFE 20:9FEE: 05        .byte $05	; <お>
- D - I - 0x029FFF 20:9FEF: F1        .byte $F1
- D - I - 0x02A000 20:9FF0: DD        .byte $DD
- D - I - 0x02A001 20:9FF1: 4B        .byte $4B	; <サ>
- D - I - 0x02A002 20:9FF2: 20        .byte $20	; <み>
- D - I - 0x02A003 20:9FF3: C3        .byte $C3	; <バ>
- D - I - 0x02A004 20:9FF4: 01        .byte $01	; <あ>
- D - I - 0x02A005 20:9FF5: F1        .byte $F1
- D - I - 0x02A006 20:9FF6: D7        .byte $D7
- D - I - 0x02A007 20:9FF7: 49        .byte $49	; <ケ>
- D - I - 0x02A008 20:9FF8: 08        .byte $08	; <く>
- D - I - 0x02A009 20:9FF9: EB        .byte $EB
- D - I - 0x02A00A 20:9FFA: 0D        .byte $0D	; <す>
- D - I - 0x02A00B 20:9FFB: F9        .byte $F9
- D - I - 0x02A00C 20:9FFC: 0F        .byte $0F	; <そ>
- D - I - 0x02A00D 20:9FFD: 01        .byte $01	; <あ>
- D - I - 0x02A00E 20:9FFE: FB        .byte $FB
- D - I - 0x02A00F 20:9FFF: 01        .byte $01	; <あ>
- D - I - 0x02A010 20:A000: 23        .byte $23	; <も>
- D - I - 0x02A011 20:A001: 45        .byte $45	; <オ>
- D - I - 0x02A012 20:A002: 01        .byte $01	; <あ>
- D - I - 0x02A013 20:A003: FB        .byte $FB
- D - I - 0x02A014 20:A004: 03        .byte $03	; <う>
- D - I - 0x02A015 20:A005: 12        .byte $12	; <つ>
- D - I - 0x02A016 20:A006: 45        .byte $45	; <オ>
- D - I - 0x02A017 20:A007: FA        .byte $FA
- D - I - 0x02A018 20:A008: F6        .byte $F6
- D - I - 0x02A019 20:A009: 2A        .byte $2A	; <れ>
- D - I - 0x02A01A 20:A00A: F6        .byte $F6
- D - I - 0x02A01B 20:A00B: 3F        .byte $3F	; <•>
- D - I - 0x02A01C 20:A00C: F6        .byte $F6
- D - I - 0x02A01D 20:A00D: 00        .byte $00
- D - I - 0x02A01E 20:A00E: F4        .byte $F4
- D - I - 0x02A01F 20:A00F: 06        .byte $06	; <か>
- D - I - 0x02A020 20:A010: 00        .byte $00
- D - I - 0x02A021 20:A011: 00        .byte $00
- D - I - 0x02A022 20:A012: 00        .byte $00
- D - I - 0x02A023 20:A013: F1        .byte $F1
- D - I - 0x02A024 20:A014: C8        .byte $C8	; <ぱ>
- D - I - 0x02A025 20:A015: 63        .byte $63	; <モ>
- D - I - 0x02A026 20:A016: 50        .byte $50	; <タ>
- D - I - 0x02A027 20:A017: E3        .byte $E3
- D - I - 0x02A028 20:A018: 05        .byte $05	; <お>
- D - I - 0x02A029 20:A019: 03        .byte $03	; <う>
- D - I - 0x02A02A 20:A01A: F1        .byte $F1
- D - I - 0x02A02B 20:A01B: C8        .byte $C8	; <ぱ>
- D - I - 0x02A02C 20:A01C: E8        .byte $E8
- D - I - 0x02A02D 20:A01D: 50        .byte $50	; <タ>
- D - I - 0x02A02E 20:A01E: E3        .byte $E3
- D - I - 0x02A02F 20:A01F: 09        .byte $09	; <け>
- D - I - 0x02A030 20:A020: 03        .byte $03	; <う>
- D - I - 0x02A031 20:A021: F1        .byte $F1
- D - I - 0x02A032 20:A022: C8        .byte $C8	; <ぱ>
- D - I - 0x02A033 20:A023: E8        .byte $E8
- D - I - 0x02A034 20:A024: 50        .byte $50	; <タ>
- D - I - 0x02A035 20:A025: E3        .byte $E3
- D - I - 0x02A036 20:A026: 0D        .byte $0D	; <す>
- D - I - 0x02A037 20:A027: 03        .byte $03	; <う>
- D - I - 0x02A038 20:A028: F1        .byte $F1
- D - I - 0x02A039 20:A029: C8        .byte $C8	; <ぱ>
- D - I - 0x02A03A 20:A02A: E9        .byte $E9
- D - I - 0x02A03B 20:A02B: 50        .byte $50	; <タ>
- D - I - 0x02A03C 20:A02C: E3        .byte $E3
- D - I - 0x02A03D 20:A02D: 11        .byte $11	; <ち>
- D - I - 0x02A03E 20:A02E: 03        .byte $03	; <う>
- D - I - 0x02A03F 20:A02F: F1        .byte $F1
- D - I - 0x02A040 20:A030: C8        .byte $C8	; <ぱ>
- D - I - 0x02A041 20:A031: EA        .byte $EA
- D - I - 0x02A042 20:A032: 50        .byte $50	; <タ>
- D - I - 0x02A043 20:A033: E3        .byte $E3
- D - I - 0x02A044 20:A034: 15        .byte $15	; <な>
off_A035:
- D - I - 0x02A045 20:A035: 01        .byte $01	; <あ>
- D - I - 0x02A046 20:A036: FB        .byte $FB
- D - I - 0x02A047 20:A037: 01        .byte $01	; <あ>
- D - I - 0x02A048 20:A038: 34        .byte $34	; <1>
- D - I - 0x02A049 20:A039: 52        .byte $52	; <ツ>
- D - I - 0x02A04A 20:A03A: 01        .byte $01	; <あ>
- D - I - 0x02A04B 20:A03B: FB        .byte $FB
- D - I - 0x02A04C 20:A03C: 01        .byte $01	; <あ>
- D - I - 0x02A04D 20:A03D: 45        .byte $45	; <オ>
- D - I - 0x02A04E 20:A03E: 23        .byte $23	; <も>
- D - I - 0x02A04F 20:A03F: 01        .byte $01	; <あ>
- D - I - 0x02A050 20:A040: FB        .byte $FB
- D - I - 0x02A051 20:A041: 01        .byte $01	; <あ>
- D - I - 0x02A052 20:A042: 52        .byte $52	; <ツ>
- D - I - 0x02A053 20:A043: 34        .byte $34	; <1>
- D - I - 0x02A054 20:A044: 01        .byte $01	; <あ>
- D - I - 0x02A055 20:A045: FB        .byte $FB
- D - I - 0x02A056 20:A046: 01        .byte $01	; <あ>
- D - I - 0x02A057 20:A047: 23        .byte $23	; <も>
- D - I - 0x02A058 20:A048: 45        .byte $45	; <オ>
- D - I - 0x02A059 20:A049: F8        .byte $F8
- D - I - 0x02A05A 20:A04A: 35 A0     .word off_A035
off_A04C_E3:
- D - I - 0x02A05C 20:A04C: F5        .byte $F5
- D - I - 0x02A05D 20:A04D: 81        .byte $81	; <A>
- D - I - 0x02A05E 20:A04E: F4        .byte $F4
- D - I - 0x02A05F 20:A04F: 08        .byte $08	; <く>
- D - I - 0x02A060 20:A050: 09        .byte $09	; <け>
- D - I - 0x02A061 20:A051: 0A        .byte $0A	; <こ>
- D - I - 0x02A062 20:A052: 0B        .byte $0B	; <さ>
- D - I - 0x02A063 20:A053: F1        .byte $F1
- D - I - 0x02A064 20:A054: 8B        .byte $8B	; <K>
- D - I - 0x02A065 20:A055: 6E        .byte $6E	; <ン>
- D - I - 0x02A066 20:A056: 80        .byte $80
- D - I - 0x02A067 20:A057: BB        .byte $BB	; <ズ>
- D - I - 0x02A068 20:A058: 09        .byte $09	; <け>
- D - I - 0x02A069 20:A059: F1        .byte $F1
- D - I - 0x02A06A 20:A05A: 8B        .byte $8B	; <K>
- D - I - 0x02A06B 20:A05B: 6D        .byte $6D	; <ヲ>
- D - I - 0x02A06C 20:A05C: 80        .byte $80
- D - I - 0x02A06D 20:A05D: BB        .byte $BB	; <ズ>
- D - I - 0x02A06E 20:A05E: 05        .byte $05	; <お>
- D - I - 0x02A06F 20:A05F: F1        .byte $F1
- D - I - 0x02A070 20:A060: 8B        .byte $8B	; <K>
- D - I - 0x02A071 20:A061: 6C        .byte $6C	; <ワ>
- D - I - 0x02A072 20:A062: 80        .byte $80
- D - I - 0x02A073 20:A063: BB        .byte $BB	; <ズ>
- D - I - 0x02A074 20:A064: 01        .byte $01	; <あ>
- D - I - 0x02A075 20:A065: F0        .byte $F0
off_A066_E4:
- D - I - 0x02A076 20:A066: F5        .byte $F5
- D - I - 0x02A077 20:A067: 80        .byte $80
- D - I - 0x02A078 20:A068: F4        .byte $F4
- D - I - 0x02A079 20:A069: 08        .byte $08	; <く>
- D - I - 0x02A07A 20:A06A: 09        .byte $09	; <け>
- D - I - 0x02A07B 20:A06B: 0A        .byte $0A	; <こ>
- D - I - 0x02A07C 20:A06C: 0B        .byte $0B	; <さ>
- D - I - 0x02A07D 20:A06D: F1        .byte $F1
- D - I - 0x02A07E 20:A06E: E4        .byte $E4
- D - I - 0x02A07F 20:A06F: 4F        .byte $4F	; <ソ>
- D - I - 0x02A080 20:A070: 21        .byte $21	; <む>
- D - I - 0x02A081 20:A071: BA        .byte $BA	; <ジ>
- D - I - 0x02A082 20:A072: 0D        .byte $0D	; <す>
- D - I - 0x02A083 20:A073: F1        .byte $F1
- D - I - 0x02A084 20:A074: E4        .byte $E4
- D - I - 0x02A085 20:A075: 4D        .byte $4D	; <ス>
- D - I - 0x02A086 20:A076: 21        .byte $21	; <む>
- D - I - 0x02A087 20:A077: BA        .byte $BA	; <ジ>
- D - I - 0x02A088 20:A078: 09        .byte $09	; <け>
- D - I - 0x02A089 20:A079: F1        .byte $F1
- D - I - 0x02A08A 20:A07A: E4        .byte $E4
- D - I - 0x02A08B 20:A07B: 4B        .byte $4B	; <サ>
- D - I - 0x02A08C 20:A07C: 21        .byte $21	; <む>
- D - I - 0x02A08D 20:A07D: BA        .byte $BA	; <ジ>
- D - I - 0x02A08E 20:A07E: 05        .byte $05	; <お>
- D - I - 0x02A08F 20:A07F: F1        .byte $F1
- D - I - 0x02A090 20:A080: D8        .byte $D8
- D - I - 0x02A091 20:A081: 49        .byte $49	; <ケ>
- D - I - 0x02A092 20:A082: 08        .byte $08	; <く>
- D - I - 0x02A093 20:A083: 3B        .byte $3B	; <8>
- D - I - 0x02A094 20:A084: 01        .byte $01	; <あ>
- D - I - 0x02A095 20:A085: 28        .byte $28	; <り>
- D - I - 0x02A096 20:A086: F6        .byte $F6
- D - I - 0x02A097 20:A087: 00        .byte $00
- D - I - 0x02A098 20:A088: F1        .byte $F1
- D - I - 0x02A099 20:A089: 00        .byte $00
- D - I - 0x02A09A 20:A08A: 58        .byte $58	; <ネ>
- D - I - 0x02A09B 20:A08B: 00        .byte $00
- D - I - 0x02A09C 20:A08C: C3        .byte $C3	; <バ>
- D - I - 0x02A09D 20:A08D: 0D        .byte $0D	; <す>
- D - I - 0x02A09E 20:A08E: F0        .byte $F0
off_A08F_E5:
- D - I - 0x02A09F 20:A08F: F5        .byte $F5
- D - I - 0x02A0A0 20:A090: 80        .byte $80
- D - I - 0x02A0A1 20:A091: F4        .byte $F4
- D - I - 0x02A0A2 20:A092: 06        .byte $06	; <か>
- D - I - 0x02A0A3 20:A093: 00        .byte $00
- D - I - 0x02A0A4 20:A094: 21        .byte $21	; <む>
- D - I - 0x02A0A5 20:A095: 26        .byte $26	; <よ>
- D - I - 0x02A0A6 20:A096: F1        .byte $F1
- D - I - 0x02A0A7 20:A097: C0        .byte $C0	; <ヅ>
- D - I - 0x02A0A8 20:A098: 51        .byte $51	; <チ>
- D - I - 0x02A0A9 20:A099: 06        .byte $06	; <か>
- D - I - 0x02A0AA 20:A09A: B3        .byte $B3	; <ぼ>
- D - I - 0x02A0AB 20:A09B: 05        .byte $05	; <お>
- D - I - 0x02A0AC 20:A09C: F1        .byte $F1
- D - I - 0x02A0AD 20:A09D: C1        .byte $C1	; <デ>
- D - I - 0x02A0AE 20:A09E: 16        .byte $16	; <に>
- D - I - 0x02A0AF 20:A09F: 00        .byte $00
- D - I - 0x02A0B0 20:A0A0: BF        .byte $BF	; <ヂ>
- D - I - 0x02A0B1 20:A0A1: 01        .byte $01	; <あ>
- D - I - 0x02A0B2 20:A0A2: F0        .byte $F0
off_A0A3_E6:
- D - I - 0x02A0B3 20:A0A3: F5        .byte $F5
- D - I - 0x02A0B4 20:A0A4: 87        .byte $87	; <G>
- D - I - 0x02A0B5 20:A0A5: F8        .byte $F8
- D - I - 0x02A0B6 20:A0A6: 1A 96     .word off_961A
off_A0A8_E7:
- D - I - 0x02A0B8 20:A0A8: F5        .byte $F5
- D - I - 0x02A0B9 20:A0A9: 80        .byte $80
- D - I - 0x02A0BA 20:A0AA: F4        .byte $F4
- D - I - 0x02A0BB 20:A0AB: 08        .byte $08	; <く>
- D - I - 0x02A0BC 20:A0AC: 09        .byte $09	; <け>
- D - I - 0x02A0BD 20:A0AD: 0A        .byte $0A	; <こ>
- D - I - 0x02A0BE 20:A0AE: 0B        .byte $0B	; <さ>
- D - I - 0x02A0BF 20:A0AF: F1        .byte $F1
- D - I - 0x02A0C0 20:A0B0: 42        .byte $42	; <イ>
- D - I - 0x02A0C1 20:A0B1: C8        .byte $C8	; <ぱ>
- D - I - 0x02A0C2 20:A0B2: 80        .byte $80
- D - I - 0x02A0C3 20:A0B3: BB        .byte $BB	; <ズ>
- D - I - 0x02A0C4 20:A0B4: 04        .byte $04	; <え>
- D - I - 0x02A0C5 20:A0B5: F1        .byte $F1
- D - I - 0x02A0C6 20:A0B6: 42        .byte $42	; <イ>
- D - I - 0x02A0C7 20:A0B7: 97        .byte $97
- D - I - 0x02A0C8 20:A0B8: 80        .byte $80
- D - I - 0x02A0C9 20:A0B9: BB        .byte $BB	; <ズ>
- D - I - 0x02A0CA 20:A0BA: 00        .byte $00
- D - I - 0x02A0CB 20:A0BB: F8        .byte $F8
- D - I - 0x02A0CC 20:A0BC: B5 94     .word off_94B5
off_A0BE_E8:
- D - I - 0x02A0CE 20:A0BE: F5        .byte $F5
- D - I - 0x02A0CF 20:A0BF: 80        .byte $80
- D - I - 0x02A0D0 20:A0C0: F4        .byte $F4
- D - I - 0x02A0D1 20:A0C1: 0C        .byte $0C	; <し>
- D - I - 0x02A0D2 20:A0C2: 0D        .byte $0D	; <す>
- D - I - 0x02A0D3 20:A0C3: 0E        .byte $0E	; <せ>
- D - I - 0x02A0D4 20:A0C4: 0F        .byte $0F	; <そ>
- D - I - 0x02A0D5 20:A0C5: F7        .byte $F7
- D - I - 0x02A0D6 20:A0C6: 03        .byte $03	; <う>
- D - I - 0x02A0D7 20:A0C7: 7B        .byte $7B	; <。>
- D - I - 0x02A0D8 20:A0C8: F1        .byte $F1
- D - I - 0x02A0D9 20:A0C9: 2F        .byte $2F	; <っ>
- D - I - 0x02A0DA 20:A0CA: D0        .byte $D0	; <ペ>
- D - I - 0x02A0DB 20:A0CB: D0        .byte $D0	; <ペ>
- D - I - 0x02A0DC 20:A0CC: BB        .byte $BB	; <ズ>
- D - I - 0x02A0DD 20:A0CD: 08        .byte $08	; <く>
- D - I - 0x02A0DE 20:A0CE: F1        .byte $F1
- D - I - 0x02A0DF 20:A0CF: 9E        .byte $9E
- D - I - 0x02A0E0 20:A0D0: 1E        .byte $1E	; <ほ>
- D - I - 0x02A0E1 20:A0D1: 68        .byte $68	; <リ>
- D - I - 0x02A0E2 20:A0D2: 93        .byte $93	; <Y>
- D - I - 0x02A0E3 20:A0D3: 05        .byte $05	; <お>
- D - I - 0x02A0E4 20:A0D4: 1E        .byte $1E	; <ほ>
- D - I - 0x02A0E5 20:A0D5: F6        .byte $F6
- D - I - 0x02A0E6 20:A0D6: 15        .byte $15	; <な>
- D - I - 0x02A0E7 20:A0D7: F1        .byte $F1
- D - I - 0x02A0E8 20:A0D8: 29        .byte $29	; <る>
- D - I - 0x02A0E9 20:A0D9: D1        .byte $D1	; <ポ>
- D - I - 0x02A0EA 20:A0DA: E0        .byte $E0
- D - I - 0x02A0EB 20:A0DB: BB        .byte $BB	; <ズ>
- D - I - 0x02A0EC 20:A0DC: 08        .byte $08	; <く>
- D - I - 0x02A0ED 20:A0DD: 02        .byte $02	; <い>
- D - I - 0x02A0EE 20:A0DE: F1        .byte $F1
- D - I - 0x02A0EF 20:A0DF: 2A        .byte $2A	; <れ>
- D - I - 0x02A0F0 20:A0E0: D2        .byte $D2
- D - I - 0x02A0F1 20:A0E1: E8        .byte $E8
- D - I - 0x02A0F2 20:A0E2: BB        .byte $BB	; <ズ>
- D - I - 0x02A0F3 20:A0E3: 08        .byte $08	; <く>
- D - I - 0x02A0F4 20:A0E4: F8        .byte $F8
- D - I - 0x02A0F5 20:A0E5: 32 91     .word off_9132
- - - - - 0x02A0F7 20:A0E7: F8        .byte $F8
- - - - - 0x02A0F8 20:A0E8: 4E 8E     .word off_8E4E
off_A0EA_E9:
- D - I - 0x02A0FA 20:A0EA: F5        .byte $F5
- D - I - 0x02A0FB 20:A0EB: 80        .byte $80
- D - I - 0x02A0FC 20:A0EC: F4        .byte $F4
- D - I - 0x02A0FD 20:A0ED: 16        .byte $16	; <に>
- D - I - 0x02A0FE 20:A0EE: 17        .byte $17	; <ぬ>
- D - I - 0x02A0FF 20:A0EF: 2D        .byte $2D	; <を>
- D - I - 0x02A100 20:A0F0: 53        .byte $53	; <テ>
- D - I - 0x02A101 20:A0F1: F1        .byte $F1
- D - I - 0x02A102 20:A0F2: 00        .byte $00
- D - I - 0x02A103 20:A0F3: 74        .byte $74	; <ィ>
- D - I - 0x02A104 20:A0F4: 00        .byte $00
- D - I - 0x02A105 20:A0F5: C3        .byte $C3	; <バ>
- D - I - 0x02A106 20:A0F6: 01        .byte $01	; <あ>
- D - I - 0x02A107 20:A0F7: F0        .byte $F0
off_A0F8_EA:
- D - I - 0x02A108 20:A0F8: F5        .byte $F5
- D - I - 0x02A109 20:A0F9: 11        .byte $11	; <ち>
- D - I - 0x02A10A 20:A0FA: F4        .byte $F4
- D - I - 0x02A10B 20:A0FB: 28        .byte $28	; <り>
- D - I - 0x02A10C 20:A0FC: 29        .byte $29	; <る>
- D - I - 0x02A10D 20:A0FD: 2A        .byte $2A	; <れ>
- D - I - 0x02A10E 20:A0FE: 0B        .byte $0B	; <さ>
- D - I - 0x02A10F 20:A0FF: F1        .byte $F1
- D - I - 0x02A110 20:A100: 39        .byte $39	; <6>
- D - I - 0x02A111 20:A101: 73        .byte $73	; <ヮ>
- D - I - 0x02A112 20:A102: E8        .byte $E8
- D - I - 0x02A113 20:A103: BB        .byte $BB	; <ズ>
- D - I - 0x02A114 20:A104: 00        .byte $00
- D - I - 0x02A115 20:A105: F0        .byte $F0
off_A106_EB:
- D - I - 0x02A116 20:A106: F5        .byte $F5
- D - I - 0x02A117 20:A107: 80        .byte $80
- D - I - 0x02A118 20:A108: F4        .byte $F4
- D - I - 0x02A119 20:A109: 13        .byte $13	; <て>
- D - I - 0x02A11A 20:A10A: 00        .byte $00
- D - I - 0x02A11B 20:A10B: 00        .byte $00
- D - I - 0x02A11C 20:A10C: 00        .byte $00
- D - I - 0x02A11D 20:A10D: F7        .byte $F7
- D - I - 0x02A11E 20:A10E: 03        .byte $03	; <う>
- D - I - 0x02A11F 20:A10F: 7B        .byte $7B	; <。>
- D - I - 0x02A120 20:A110: F1        .byte $F1
- D - I - 0x02A121 20:A111: B4        .byte $B4	; <ガ>
- D - I - 0x02A122 20:A112: 75        .byte $75	; <ェ>
- D - I - 0x02A123 20:A113: B0        .byte $B0	; <び>
- D - I - 0x02A124 20:A114: 1B        .byte $1B	; <ひ>
- D - I - 0x02A125 20:A115: 06        .byte $06	; <か>
off_A116:
- D - I - 0x02A126 20:A116: F1        .byte $F1
- D - I - 0x02A127 20:A117: 00        .byte $00
- D - I - 0x02A128 20:A118: 00        .byte $00
- D - I - 0x02A129 20:A119: 80        .byte $80
- D - I - 0x02A12A 20:A11A: FB        .byte $FB
- D - I - 0x02A12B 20:A11B: 00        .byte $00
- D - I - 0x02A12C 20:A11C: F0        .byte $F0
off_A11D_EC:
- D - I - 0x02A12D 20:A11D: F5        .byte $F5
- D - I - 0x02A12E 20:A11E: 80        .byte $80
- D - I - 0x02A12F 20:A11F: F4        .byte $F4
- D - I - 0x02A130 20:A120: 13        .byte $13	; <て>
- D - I - 0x02A131 20:A121: 00        .byte $00
- D - I - 0x02A132 20:A122: 00        .byte $00
- D - I - 0x02A133 20:A123: 00        .byte $00
- D - I - 0x02A134 20:A124: F7        .byte $F7
- D - I - 0x02A135 20:A125: 03        .byte $03	; <う>
- D - I - 0x02A136 20:A126: 7B        .byte $7B	; <。>
- D - I - 0x02A137 20:A127: F1        .byte $F1
- D - I - 0x02A138 20:A128: B4        .byte $B4	; <ガ>
- D - I - 0x02A139 20:A129: 76        .byte $76	; <ォ>
- D - I - 0x02A13A 20:A12A: B0        .byte $B0	; <び>
- D - I - 0x02A13B 20:A12B: 1B        .byte $1B	; <ひ>
- D - I - 0x02A13C 20:A12C: 06        .byte $06	; <か>
- D - I - 0x02A13D 20:A12D: F8        .byte $F8
- D - I - 0x02A13E 20:A12E: 16 A1     .word off_A116
off_A130_ED:
- D - I - 0x02A140 20:A130: F5        .byte $F5
- D - I - 0x02A141 20:A131: 80        .byte $80
- D - I - 0x02A142 20:A132: F4        .byte $F4
- D - I - 0x02A143 20:A133: 13        .byte $13	; <て>
- D - I - 0x02A144 20:A134: 00        .byte $00
- D - I - 0x02A145 20:A135: 00        .byte $00
- D - I - 0x02A146 20:A136: 00        .byte $00
- D - I - 0x02A147 20:A137: F1        .byte $F1
- D - I - 0x02A148 20:A138: 40        .byte $40	; <「>
- D - I - 0x02A149 20:A139: 77        .byte $77	; <:>
- D - I - 0x02A14A 20:A13A: D8        .byte $D8
- D - I - 0x02A14B 20:A13B: CB        .byte $CB	; <ぺ>
- D - I - 0x02A14C 20:A13C: 00        .byte $00
- D - I - 0x02A14D 20:A13D: F0        .byte $F0
off_A13E_EE:
- D - I - 0x02A14E 20:A13E: F5        .byte $F5
- D - I - 0x02A14F 20:A13F: 80        .byte $80
- D - I - 0x02A150 20:A140: F4        .byte $F4
- D - I - 0x02A151 20:A141: 08        .byte $08	; <く>
- D - I - 0x02A152 20:A142: 09        .byte $09	; <け>
- D - I - 0x02A153 20:A143: 0A        .byte $0A	; <こ>
- D - I - 0x02A154 20:A144: 0B        .byte $0B	; <さ>
- D - I - 0x02A155 20:A145: F1        .byte $F1
- D - I - 0x02A156 20:A146: AC        .byte $AC	; <づ>
- D - I - 0x02A157 20:A147: 49        .byte $49	; <ケ>
- D - I - 0x02A158 20:A148: 9C        .byte $9C
- D - I - 0x02A159 20:A149: 63        .byte $63	; <モ>
- D - I - 0x02A15A 20:A14A: 00        .byte $00
- D - I - 0x02A15B 20:A14B: F1        .byte $F1
- D - I - 0x02A15C 20:A14C: 67        .byte $67	; <ラ>
- D - I - 0x02A15D 20:A14D: D8        .byte $D8
- D - I - 0x02A15E 20:A14E: F0        .byte $F0
- D - I - 0x02A15F 20:A14F: B3        .byte $B3	; <ぼ>
- D - I - 0x02A160 20:A150: 04        .byte $04	; <え>
- D - I - 0x02A161 20:A151: F1        .byte $F1
- D - I - 0x02A162 20:A152: 67        .byte $67	; <ラ>
- D - I - 0x02A163 20:A153: 95        .byte $95
- D - I - 0x02A164 20:A154: F0        .byte $F0
- D - I - 0x02A165 20:A155: B3        .byte $B3	; <ぼ>
- D - I - 0x02A166 20:A156: 08        .byte $08	; <く>
- D - I - 0x02A167 20:A157: F1        .byte $F1
- D - I - 0x02A168 20:A158: 67        .byte $67	; <ラ>
- D - I - 0x02A169 20:A159: 96        .byte $96
- D - I - 0x02A16A 20:A15A: F0        .byte $F0
- D - I - 0x02A16B 20:A15B: B3        .byte $B3	; <ぼ>
- D - I - 0x02A16C 20:A15C: 0C        .byte $0C	; <し>
- D - I - 0x02A16D 20:A15D: 14        .byte $14	; <と>
- D - I - 0x02A16E 20:A15E: F4        .byte $F4
- D - I - 0x02A16F 20:A15F: 0A        .byte $0A	; <こ>
- D - I - 0x02A170 20:A160: 0B        .byte $0B	; <さ>
- D - I - 0x02A171 20:A161: 00        .byte $00
- D - I - 0x02A172 20:A162: 00        .byte $00
- D - I - 0x02A173 20:A163: F6        .byte $F6
- D - I - 0x02A174 20:A164: 00        .byte $00
- D - I - 0x02A175 20:A165: F6        .byte $F6
- D - I - 0x02A176 20:A166: 2A        .byte $2A	; <れ>
- D - I - 0x02A177 20:A167: F6        .byte $F6
- D - I - 0x02A178 20:A168: 3F        .byte $3F	; <•>
- D - I - 0x02A179 20:A169: F1        .byte $F1
- D - I - 0x02A17A 20:A16A: 00        .byte $00
- D - I - 0x02A17B 20:A16B: DF        .byte $DF
- D - I - 0x02A17C 20:A16C: 20        .byte $20	; <み>
- D - I - 0x02A17D 20:A16D: BB        .byte $BB	; <ズ>
- D - I - 0x02A17E 20:A16E: 05        .byte $05	; <お>
- D - I - 0x02A17F 20:A16F: 04        .byte $04	; <え>
- D - I - 0x02A180 20:A170: F1        .byte $F1
- D - I - 0x02A181 20:A171: 68        .byte $68	; <リ>
- D - I - 0x02A182 20:A172: E5        .byte $E5
- D - I - 0x02A183 20:A173: 20        .byte $20	; <み>
- D - I - 0x02A184 20:A174: BB        .byte $BB	; <ズ>
- D - I - 0x02A185 20:A175: 05        .byte $05	; <お>
- D - I - 0x02A186 20:A176: F8        .byte $F8
- D - I - 0x02A187 20:A177: 0C 99     .word off_990C
off_A179_EF:
- D - I - 0x02A189 20:A179: F5        .byte $F5
- D - I - 0x02A18A 20:A17A: 80        .byte $80
- D - I - 0x02A18B 20:A17B: F4        .byte $F4
- D - I - 0x02A18C 20:A17C: 08        .byte $08	; <く>
- D - I - 0x02A18D 20:A17D: 09        .byte $09	; <け>
- D - I - 0x02A18E 20:A17E: 0A        .byte $0A	; <こ>
- D - I - 0x02A18F 20:A17F: 0B        .byte $0B	; <さ>
- D - I - 0x02A190 20:A180: F1        .byte $F1
- D - I - 0x02A191 20:A181: AC        .byte $AC	; <づ>
- D - I - 0x02A192 20:A182: 49        .byte $49	; <ケ>
- D - I - 0x02A193 20:A183: 9C        .byte $9C
- D - I - 0x02A194 20:A184: 63        .byte $63	; <モ>
- D - I - 0x02A195 20:A185: 00        .byte $00
- D - I - 0x02A196 20:A186: F1        .byte $F1
- D - I - 0x02A197 20:A187: 67        .byte $67	; <ラ>
- D - I - 0x02A198 20:A188: B9        .byte $B9	; <ザ>
- D - I - 0x02A199 20:A189: F0        .byte $F0
- D - I - 0x02A19A 20:A18A: B3        .byte $B3	; <ぼ>
- D - I - 0x02A19B 20:A18B: 04        .byte $04	; <え>
- D - I - 0x02A19C 20:A18C: F1        .byte $F1
- D - I - 0x02A19D 20:A18D: 67        .byte $67	; <ラ>
- D - I - 0x02A19E 20:A18E: 95        .byte $95
- D - I - 0x02A19F 20:A18F: F0        .byte $F0
- D - I - 0x02A1A0 20:A190: B3        .byte $B3	; <ぼ>
- D - I - 0x02A1A1 20:A191: 08        .byte $08	; <く>
- D - I - 0x02A1A2 20:A192: F1        .byte $F1
- D - I - 0x02A1A3 20:A193: 67        .byte $67	; <ラ>
- D - I - 0x02A1A4 20:A194: 96        .byte $96
- D - I - 0x02A1A5 20:A195: F0        .byte $F0
- D - I - 0x02A1A6 20:A196: B3        .byte $B3	; <ぼ>
- D - I - 0x02A1A7 20:A197: 0C        .byte $0C	; <し>
- D - I - 0x02A1A8 20:A198: 14        .byte $14	; <と>
- D - I - 0x02A1A9 20:A199: F4        .byte $F4
- D - I - 0x02A1AA 20:A19A: 0A        .byte $0A	; <こ>
- D - I - 0x02A1AB 20:A19B: 0B        .byte $0B	; <さ>
- D - I - 0x02A1AC 20:A19C: 00        .byte $00
- D - I - 0x02A1AD 20:A19D: 00        .byte $00
- D - I - 0x02A1AE 20:A19E: F6        .byte $F6
- D - I - 0x02A1AF 20:A19F: 00        .byte $00
- D - I - 0x02A1B0 20:A1A0: F6        .byte $F6
- D - I - 0x02A1B1 20:A1A1: 2A        .byte $2A	; <れ>
- D - I - 0x02A1B2 20:A1A2: F6        .byte $F6
- D - I - 0x02A1B3 20:A1A3: 3F        .byte $3F	; <•>
- D - I - 0x02A1B4 20:A1A4: F1        .byte $F1
- D - I - 0x02A1B5 20:A1A5: 00        .byte $00
- D - I - 0x02A1B6 20:A1A6: C7        .byte $C7	; <ボ>
- D - I - 0x02A1B7 20:A1A7: 20        .byte $20	; <み>
- D - I - 0x02A1B8 20:A1A8: BB        .byte $BB	; <ズ>
- D - I - 0x02A1B9 20:A1A9: 05        .byte $05	; <お>
- D - I - 0x02A1BA 20:A1AA: 04        .byte $04	; <え>
- D - I - 0x02A1BB 20:A1AB: F1        .byte $F1
- D - I - 0x02A1BC 20:A1AC: 68        .byte $68	; <リ>
- D - I - 0x02A1BD 20:A1AD: E6        .byte $E6
- D - I - 0x02A1BE 20:A1AE: 20        .byte $20	; <み>
- D - I - 0x02A1BF 20:A1AF: BB        .byte $BB	; <ズ>
- D - I - 0x02A1C0 20:A1B0: 05        .byte $05	; <お>
- D - I - 0x02A1C1 20:A1B1: F8        .byte $F8
- D - I - 0x02A1C2 20:A1B2: 0C 99     .word off_990C

tbl_A1B4:
- D - I - 0x02A1C4 20:A1B4: 8A A3     .word off_A38A_00
- D - I - 0x02A1C6 20:A1B6: 91 A3     .word off_A391_01
- D - I - 0x02A1C8 20:A1B8: 98 A3     .word off_A398_02
- D - I - 0x02A1CA 20:A1BA: 9F A3     .word off_A39F_03
- D - I - 0x02A1CC 20:A1BC: A6 A3     .word off_A3A6_04
- D - I - 0x02A1CE 20:A1BE: AD A3     .word off_A3AD_05
- D - I - 0x02A1D0 20:A1C0: B4 A3     .word off_A3B4_06
- D - I - 0x02A1D2 20:A1C2: BB A3     .word off_A3BB_07
- D - I - 0x02A1D4 20:A1C4: C2 A3     .word off_A3C2_08
- D - I - 0x02A1D6 20:A1C6: C9 A3     .word off_A3C9_09
- D - I - 0x02A1D8 20:A1C8: D0 A3     .word off_A3D0_0A
- D - I - 0x02A1DA 20:A1CA: D7 A3     .word off_A3D7_0B
- D - I - 0x02A1DC 20:A1CC: DE A3     .word off_A3DE_0C
- - - - - 0x02A1DE 20:A1CE: E5 A3     .word off_A3E5_0D
- D - I - 0x02A1E0 20:A1D0: FA A3     .word off_A3FA_0E
- D - I - 0x02A1E2 20:A1D2: 01 A4     .word off_A401_0F
- D - I - 0x02A1E4 20:A1D4: 0B A4     .word off_A40B_10
- D - I - 0x02A1E6 20:A1D6: 12 A4     .word off_A412_11
- D - I - 0x02A1E8 20:A1D8: 19 A4     .word off_A419_12
- D - I - 0x02A1EA 20:A1DA: 20 A4     .word off_A420_13
- D - I - 0x02A1EC 20:A1DC: 2D A4     .word off_A42D_14
- D - I - 0x02A1EE 20:A1DE: 34 A4     .word off_A434_15
- D - I - 0x02A1F0 20:A1E0: 3B A4     .word off_A43B_16
- D - I - 0x02A1F2 20:A1E2: 42 A4     .word off_A442_17
- D - I - 0x02A1F4 20:A1E4: 49 A4     .word off_A449_18
- D - I - 0x02A1F6 20:A1E6: 50 A4     .word off_A450_19
- D - I - 0x02A1F8 20:A1E8: 57 A4     .word off_A457_1A
- D - I - 0x02A1FA 20:A1EA: 5E A4     .word off_A45E_1B
- D - I - 0x02A1FC 20:A1EC: 65 A4     .word off_A465_1C
- D - I - 0x02A1FE 20:A1EE: 6C A4     .word off_A46C_1D
- - - - - 0x02A200 20:A1F0: 73 A4     .word off_A473_1E
- D - I - 0x02A202 20:A1F2: 7A A4     .word off_A47A_1F
- D - I - 0x02A204 20:A1F4: 81 A4     .word off_A481_20
- D - I - 0x02A206 20:A1F6: 88 A4     .word off_A488_21
- D - I - 0x02A208 20:A1F8: 8F A4     .word off_A48F_22
- D - I - 0x02A20A 20:A1FA: 96 A4     .word off_A496_23
- D - I - 0x02A20C 20:A1FC: 9D A4     .word off_A49D_24
- D - I - 0x02A20E 20:A1FE: A4 A4     .word off_A4A4_25
- D - I - 0x02A210 20:A200: AB A4     .word off_A4AB_26
- D - I - 0x02A212 20:A202: B2 A4     .word off_A4B2_27
- D - I - 0x02A214 20:A204: B9 A4     .word off_A4B9_28
- D - I - 0x02A216 20:A206: C0 A4     .word off_A4C0_29
- D - I - 0x02A218 20:A208: C7 A4     .word off_A4C7_2A
- - - - - 0x02A21A 20:A20A: CE A4     .word off_A4CE_2B
- D - I - 0x02A21C 20:A20C: D5 A4     .word off_A4D5_2C
- D - I - 0x02A21E 20:A20E: EC A4     .word off_A4EC_2D
- D - I - 0x02A220 20:A210: F3 A4     .word off_A4F3_2E
- D - I - 0x02A222 20:A212: F6 A4     .word off_A4F6_2F
- D - I - 0x02A224 20:A214: FD A4     .word off_A4FD_30
- D - I - 0x02A226 20:A216: 0A A5     .word off_A50A_31
- D - I - 0x02A228 20:A218: 11 A5     .word off_A511_32
- D - I - 0x02A22A 20:A21A: 18 A5     .word off_A518_33
- D - I - 0x02A22C 20:A21C: 1F A5     .word off_A51F_34
- D - I - 0x02A22E 20:A21E: 26 A5     .word off_A526_35
- D - I - 0x02A230 20:A220: 37 A5     .word off_A537_36
- D - I - 0x02A232 20:A222: 3E A5     .word off_A53E_37
- D - I - 0x02A234 20:A224: 45 A5     .word off_A545_38
- D - I - 0x02A236 20:A226: 4C A5     .word off_A54C_39
- D - I - 0x02A238 20:A228: 53 A5     .word off_A553_3A
- D - I - 0x02A23A 20:A22A: 5A A5     .word off_A55A_3B
- D - I - 0x02A23C 20:A22C: 6B A5     .word off_A56B_3C
- D - I - 0x02A23E 20:A22E: 72 A5     .word off_A572_3D
- D - I - 0x02A240 20:A230: 79 A5     .word off_A579_3E
- D - I - 0x02A242 20:A232: 84 A5     .word off_A584_3F
- D - I - 0x02A244 20:A234: 8B A5     .word off_A58B_40
- D - I - 0x02A246 20:A236: 92 A5     .word off_A592_41
- D - I - 0x02A248 20:A238: 99 A5     .word off_A599_42
- D - I - 0x02A24A 20:A23A: A0 A5     .word off_A5A0_43
- - - - - 0x02A24C 20:A23C: AD A5     .word off_A5AD_44
- - - - - 0x02A24E 20:A23E: BC A5     .word off_A5BC_45
- D - I - 0x02A250 20:A240: CB A5     .word off_A5CB_46
- - - - - 0x02A252 20:A242: D2 A5     .word off_A5D2_47
- D - I - 0x02A254 20:A244: D3 A5     .word off_A5D3_48
- D - I - 0x02A256 20:A246: E8 A5     .word off_A5E8_49
- D - I - 0x02A258 20:A248: EF A5     .word off_A5EF_4A
- D - I - 0x02A25A 20:A24A: F6 A5     .word off_A5F6_4B
- D - I - 0x02A25C 20:A24C: FD A5     .word off_A5FD_4C
- D - I - 0x02A25E 20:A24E: 04 A6     .word off_A604_4D
- D - I - 0x02A260 20:A250: 11 A6     .word off_A611_4E
- - - - - 0x02A262 20:A252: 18 A6     .word off_A618_4F
- - - - - 0x02A264 20:A254: 43 A6     .word off_A643_50
- D - I - 0x02A266 20:A256: 4A A6     .word off_A64A_51
- D - I - 0x02A268 20:A258: 51 A6     .word off_A651_52
- D - I - 0x02A26A 20:A25A: 58 A6     .word off_A658_53
- D - I - 0x02A26C 20:A25C: 5F A6     .word off_A65F_54
- - - - - 0x02A26E 20:A25E: 66 A6     .word off_A666_55
- - - - - 0x02A270 20:A260: 67 A6     .word off_A667_56
- - - - - 0x02A272 20:A262: 68 A6     .word off_A668_57
- - - - - 0x02A274 20:A264: 69 A6     .word off_A669_58
- D - I - 0x02A276 20:A266: 6A A6     .word off_A66A_59
- D - I - 0x02A278 20:A268: 7D A6     .word off_A67D_5A
- - - - - 0x02A27A 20:A26A: 84 A6     .word off_A684_5B
- - - - - 0x02A27C 20:A26C: 8B A6     .word off_A68B_5C
- D - I - 0x02A27E 20:A26E: 92 A6     .word off_A692_5D
- D - I - 0x02A280 20:A270: 99 A6     .word off_A699_5E
- D - I - 0x02A282 20:A272: A0 A6     .word off_A6A0_5F
- D - I - 0x02A284 20:A274: AB A6     .word off_A6AB_60
- D - I - 0x02A286 20:A276: B6 A6     .word off_A6B6_61
- D - I - 0x02A288 20:A278: C7 A6     .word off_A6C7_62
- D - I - 0x02A28A 20:A27A: CE A6     .word off_A6CE_63
- D - I - 0x02A28C 20:A27C: D5 A6     .word off_A6D5_64
- D - I - 0x02A28E 20:A27E: DC A6     .word off_A6DC_65
- D - I - 0x02A290 20:A280: E3 A6     .word off_A6E3_66
- D - I - 0x02A292 20:A282: EA A6     .word off_A6EA_67
- D - I - 0x02A294 20:A284: F1 A6     .word off_A6F1_68
- D - I - 0x02A296 20:A286: F8 A6     .word off_A6F8_69
- D - I - 0x02A298 20:A288: FF A6     .word off_A6FF_6A
- D - I - 0x02A29A 20:A28A: 06 A7     .word off_A706_6B
- D - I - 0x02A29C 20:A28C: 0D A7     .word off_A70D_6C
- D - I - 0x02A29E 20:A28E: 14 A7     .word off_A714_6D
- D - I - 0x02A2A0 20:A290: 1B A7     .word off_A71B_6E
- - - - - 0x02A2A2 20:A292: 22 A7     .word off_A722_6F
- D - I - 0x02A2A4 20:A294: 23 A7     .word off_A723_70
- D - I - 0x02A2A6 20:A296: 2C A7     .word off_A72C_71
- D - I - 0x02A2A8 20:A298: 35 A7     .word off_A735_72
- D - I - 0x02A2AA 20:A29A: 42 A7     .word off_A742_73
- - - - - 0x02A2AC 20:A29C: 49 A7     .word off_A749_74
- D - I - 0x02A2AE 20:A29E: 50 A7     .word off_A750_75
- D - I - 0x02A2B0 20:A2A0: 5B A7     .word off_A75B_76
- D - I - 0x02A2B2 20:A2A2: 62 A7     .word off_A762_77
- - - - - 0x02A2B4 20:A2A4: 6D A7     .word off_A76D_78
- - - - - 0x02A2B6 20:A2A6: 6E A7     .word off_A76E_79
- D - I - 0x02A2B8 20:A2A8: 6F A7     .word off_A76F_7A
- - - - - 0x02A2BA 20:A2AA: 7A A7     .word off_A77A_7B
- D - I - 0x02A2BC 20:A2AC: 8F A7     .word off_A78F_7C
- - - - - 0x02A2BE 20:A2AE: 9A A7     .word off_A79A_7D
- D - I - 0x02A2C0 20:A2B0: 9B A7     .word off_A79B_7E
- - - - - 0x02A2C2 20:A2B2: A6 A7     .word off_A7A6_7F
- D - I - 0x02A2C4 20:A2B4: B1 A7     .word off_A7B1_80
- D - I - 0x02A2C6 20:A2B6: BC A7     .word off_A7BC_81
- - - - - 0x02A2C8 20:A2B8: C7 A7     .word off_A7C7_82
- D - I - 0x02A2CA 20:A2BA: D2 A7     .word off_A7D2_83
- D - I - 0x02A2CC 20:A2BC: DD A7     .word off_A7DD_84
- D - I - 0x02A2CE 20:A2BE: FC A7     .word off_A7FC_85
- D - I - 0x02A2D0 20:A2C0: 11 A8     .word off_A811_86
- D - I - 0x02A2D2 20:A2C2: 1C A8     .word off_A81C_87
- D - I - 0x02A2D4 20:A2C4: 2D A8     .word off_A82D_88
- D - I - 0x02A2D6 20:A2C6: 3E A8     .word off_A83E_89
- D - I - 0x02A2D8 20:A2C8: 49 A8     .word off_A849_8A
- D - I - 0x02A2DA 20:A2CA: 50 A8     .word off_A850_8B
- D - I - 0x02A2DC 20:A2CC: 57 A8     .word off_A857_8C
- D - I - 0x02A2DE 20:A2CE: 5E A8     .word off_A85E_8D
- D - I - 0x02A2E0 20:A2D0: 65 A8     .word off_A865_8E
- D - I - 0x02A2E2 20:A2D2: 6C A8     .word off_A86C_8F
- D - I - 0x02A2E4 20:A2D4: 73 A8     .word off_A873_90
- D - I - 0x02A2E6 20:A2D6: 7A A8     .word off_A87A_91
- D - I - 0x02A2E8 20:A2D8: 85 A8     .word off_A885_92
- D - I - 0x02A2EA 20:A2DA: 92 A8     .word off_A892_93
- D - I - 0x02A2EC 20:A2DC: A7 A8     .word off_A8A7_94
- D - I - 0x02A2EE 20:A2DE: B8 A8     .word off_A8B8_95
- - - - - 0x02A2F0 20:A2E0: BF A8     .word off_A8BF_96
- D - I - 0x02A2F2 20:A2E2: CA A8     .word off_A8CA_97
- D - I - 0x02A2F4 20:A2E4: D1 A8     .word off_A8D1_98
- D - I - 0x02A2F6 20:A2E6: D8 A8     .word off_A8D8_99
- D - I - 0x02A2F8 20:A2E8: DF A8     .word off_A8DF_9A
- D - I - 0x02A2FA 20:A2EA: F0 A8     .word off_A8F0_9B
- D - I - 0x02A2FC 20:A2EC: 01 A9     .word off_A901_9C
- D - I - 0x02A2FE 20:A2EE: 08 A9     .word off_A908_9D
- D - I - 0x02A300 20:A2F0: 13 A9     .word off_A913_9E
- D - I - 0x02A302 20:A2F2: 1E A9     .word off_A91E_9F
- D - I - 0x02A304 20:A2F4: 25 A9     .word off_A925_A0
- D - I - 0x02A306 20:A2F6: 2C A9     .word off_A92C_A1
- D - I - 0x02A308 20:A2F8: 37 A9     .word off_A937_A2
- D - I - 0x02A30A 20:A2FA: 3E A9     .word off_A93E_A3
- - - - - 0x02A30C 20:A2FC: 49 A9     .word off_A949_A4
- D - I - 0x02A30E 20:A2FE: 4A A9     .word off_A94A_A5
- D - I - 0x02A310 20:A300: 55 A9     .word off_A955_A6
- D - I - 0x02A312 20:A302: 5C A9     .word off_A95C_A7
- D - I - 0x02A314 20:A304: 67 A9     .word off_A967_A8
- D - I - 0x02A316 20:A306: 6E A9     .word off_A96E_A9
- D - I - 0x02A318 20:A308: 79 A9     .word off_A979_AA
- D - I - 0x02A31A 20:A30A: 84 A9     .word off_A984_AB
- D - I - 0x02A31C 20:A30C: 8F A9     .word off_A98F_AC
- D - I - 0x02A31E 20:A30E: 96 A9     .word off_A996_AD
- D - I - 0x02A320 20:A310: 9D A9     .word off_A99D_AE
- D - I - 0x02A322 20:A312: A8 A9     .word off_A9A8_AF
- D - I - 0x02A324 20:A314: B3 A9     .word off_A9B3_B0
- D - I - 0x02A326 20:A316: BE A9     .word off_A9BE_B1
- D - I - 0x02A328 20:A318: D3 A9     .word off_A9D3_B2
- D - I - 0x02A32A 20:A31A: DA A9     .word off_A9DA_B3
- D - I - 0x02A32C 20:A31C: E1 A9     .word off_A9E1_B4
- D - I - 0x02A32E 20:A31E: E8 A9     .word off_A9E8_B5
- D - I - 0x02A330 20:A320: EF A9     .word off_A9EF_B6
- D - I - 0x02A332 20:A322: FC A9     .word off_A9FC_B7
- - - - - 0x02A334 20:A324: 07 AA     .word off_AA07_B8
- D - I - 0x02A336 20:A326: 08 AA     .word off_AA08_B9
- - - - - 0x02A338 20:A328: 0F AA     .word off_AA0F_BA
- D - I - 0x02A33A 20:A32A: 10 AA     .word off_AA10_BB
- D - I - 0x02A33C 20:A32C: 17 AA     .word off_AA17_BC
- D - I - 0x02A33E 20:A32E: 1E AA     .word off_AA1E_BD
- D - I - 0x02A340 20:A330: 25 AA     .word off_AA25_BE
- D - I - 0x02A342 20:A332: 2C AA     .word off_AA2C_BF
- D - I - 0x02A344 20:A334: 37 AA     .word off_AA37_C0
- D - I - 0x02A346 20:A336: 3E AA     .word off_AA3E_C1
- D - I - 0x02A348 20:A338: 4F AA     .word off_AA4F_C2
- D - I - 0x02A34A 20:A33A: 56 AA     .word off_AA56_C3
- D - I - 0x02A34C 20:A33C: 5D AA     .word off_AA5D_C4
- D - I - 0x02A34E 20:A33E: 64 AA     .word off_AA64_C5
- D - I - 0x02A350 20:A340: 6B AA     .word off_AA6B_C6
- D - I - 0x02A352 20:A342: 72 AA     .word off_AA72_C7
- D - I - 0x02A354 20:A344: 79 AA     .word off_AA79_C8
- D - I - 0x02A356 20:A346: 84 AA     .word off_AA84_C9
- D - I - 0x02A358 20:A348: 8B AA     .word off_AA8B_CA
- D - I - 0x02A35A 20:A34A: 92 AA     .word off_AA92_CB
- D - I - 0x02A35C 20:A34C: 9D AA     .word off_AA9D_CC
- - - - - 0x02A35E 20:A34E: A4 AA     .word off_AAA4_CD
- D - I - 0x02A360 20:A350: AB AA     .word off_AAAB_CE
- D - I - 0x02A362 20:A352: B6 AA     .word off_AAB6_CF
- D - I - 0x02A364 20:A354: DD AA     .word off_AADD_D0
- D - I - 0x02A366 20:A356: E4 AA     .word off_AAE4_D1
- D - I - 0x02A368 20:A358: EB AA     .word off_AAEB_D2
- D - I - 0x02A36A 20:A35A: F2 AA     .word off_AAF2_D3
- D - I - 0x02A36C 20:A35C: F9 AA     .word off_AAF9_D4
- D - I - 0x02A36E 20:A35E: 00 AB     .word off_AB00_D5
- D - I - 0x02A370 20:A360: 09 AB     .word off_AB09_D6
- D - I - 0x02A372 20:A362: 10 AB     .word off_AB10_D7
- D - I - 0x02A374 20:A364: 1D AB     .word off_AB1D_D8
- D - I - 0x02A376 20:A366: 24 AB     .word off_AB24_D9
- D - I - 0x02A378 20:A368: 2F AB     .word off_AB2F_DA
- D - I - 0x02A37A 20:A36A: 36 AB     .word off_AB36_DB
- D - I - 0x02A37C 20:A36C: 3D AB     .word off_AB3D_DC
- D - I - 0x02A37E 20:A36E: 44 AB     .word off_AB44_DD
- D - I - 0x02A380 20:A370: 4B AB     .word off_AB4B_DE
- D - I - 0x02A382 20:A372: 52 AB     .word off_AB52_DF
- D - I - 0x02A384 20:A374: 59 AB     .word off_AB59_E0
- D - I - 0x02A386 20:A376: 60 AB     .word off_AB60_E1
- - - - - 0x02A388 20:A378: 67 AB     .word off_AB67_E2
- - - - - 0x02A38A 20:A37A: 68 AB     .word off_AB68_E3
- D - I - 0x02A38C 20:A37C: 6F AB     .word off_AB6F_E4
- D - I - 0x02A38E 20:A37E: 76 AB     .word off_AB76_E5
- D - I - 0x02A390 20:A380: 7D AB     .word off_AB7D_E6
- D - I - 0x02A392 20:A382: 84 AB     .word off_AB84_E7
- D - I - 0x02A394 20:A384: 8B AB     .word off_AB8B_E8
- D - I - 0x02A396 20:A386: 31 AC     .word off_AC31_E9
- D - I - 0x02A398 20:A388: 3C AC     .word off_AC3C_EA

off_A38A_00:
- D - I - 0x02A39A 20:A38A: 01        .byte $01	; <あ>
- D - I - 0x02A39B 20:A38B: 01        .byte $01	; <あ>
- D - I - 0x02A39C 20:A38C: 00        .byte $00
- D - I - 0x02A39D 20:A38D: 00        .byte $00
- D - I - 0x02A39E 20:A38E: 00        .byte $00
- D - I - 0x02A39F 20:A38F: 00        .byte $00
- D - I - 0x02A3A0 20:A390: 00        .byte $00
off_A391_01:
- D - I - 0x02A3A1 20:A391: 01        .byte $01	; <あ>
- D - I - 0x02A3A2 20:A392: 32        .byte $32	; <ょ>
- D - I - 0x02A3A3 20:A393: CE        .byte $CE	; <ピ>
- D - I - 0x02A3A4 20:A394: FF        .byte $FF
- D - I - 0x02A3A5 20:A395: 00        .byte $00
- D - I - 0x02A3A6 20:A396: 00        .byte $00
- D - I - 0x02A3A7 20:A397: 00        .byte $00
off_A398_02:
- D - I - 0x02A3A8 20:A398: 01        .byte $01	; <あ>
- D - I - 0x02A3A9 20:A399: 32        .byte $32	; <ょ>
- D - I - 0x02A3AA 20:A39A: 00        .byte $00
- D - I - 0x02A3AB 20:A39B: 05        .byte $05	; <お>
- D - I - 0x02A3AC 20:A39C: C3        .byte $C3	; <バ>
- D - I - 0x02A3AD 20:A39D: FF        .byte $FF
- D - I - 0x02A3AE 20:A39E: 00        .byte $00
off_A39F_03:
- D - I - 0x02A3AF 20:A39F: 01        .byte $01	; <あ>
- D - I - 0x02A3B0 20:A3A0: 3C        .byte $3C	; <9>
- D - I - 0x02A3B1 20:A3A1: 9A        .byte $9A
- D - I - 0x02A3B2 20:A3A2: FF        .byte $FF
- D - I - 0x02A3B3 20:A3A3: 1D        .byte $1D	; <へ>
- D - I - 0x02A3B4 20:A3A4: 00        .byte $00
- D - I - 0x02A3B5 20:A3A5: 00        .byte $00
off_A3A6_04:
- D - I - 0x02A3B6 20:A3A6: 01        .byte $01	; <あ>
- D - I - 0x02A3B7 20:A3A7: 3C        .byte $3C	; <9>
- D - I - 0x02A3B8 20:A3A8: 00        .byte $00
- D - I - 0x02A3B9 20:A3A9: 05        .byte $05	; <お>
- D - I - 0x02A3BA 20:A3AA: 00        .byte $00
- D - I - 0x02A3BB 20:A3AB: FD        .byte $FD
- D - I - 0x02A3BC 20:A3AC: 00        .byte $00
off_A3AD_05:
- D - I - 0x02A3BD 20:A3AD: 01        .byte $01	; <あ>
- D - I - 0x02A3BE 20:A3AE: 3C        .byte $3C	; <9>
- D - I - 0x02A3BF 20:A3AF: 9A        .byte $9A
- D - I - 0x02A3C0 20:A3B0: FF        .byte $FF
- D - I - 0x02A3C1 20:A3B1: 1D        .byte $1D	; <へ>
- D - I - 0x02A3C2 20:A3B2: 00        .byte $00
- D - I - 0x02A3C3 20:A3B3: 00        .byte $00
off_A3B4_06:
- D - I - 0x02A3C4 20:A3B4: 01        .byte $01	; <あ>
- D - I - 0x02A3C5 20:A3B5: 3C        .byte $3C	; <9>
- D - I - 0x02A3C6 20:A3B6: 00        .byte $00
- D - I - 0x02A3C7 20:A3B7: 06        .byte $06	; <か>
- D - I - 0x02A3C8 20:A3B8: 78        .byte $78	; <?>
- D - I - 0x02A3C9 20:A3B9: FF        .byte $FF
- D - I - 0x02A3CA 20:A3BA: 00        .byte $00
off_A3BB_07:
- D - I - 0x02A3CB 20:A3BB: 01        .byte $01	; <あ>
- D - I - 0x02A3CC 20:A3BC: 28        .byte $28	; <り>
- D - I - 0x02A3CD 20:A3BD: 00        .byte $00
- D - I - 0x02A3CE 20:A3BE: 00        .byte $00
- D - I - 0x02A3CF 20:A3BF: E0        .byte $E0
- D - I - 0x02A3D0 20:A3C0: FE        .byte $FE
- - - - - 0x02A3D1 20:A3C1: 00        .byte $00
off_A3C2_08:
- D - I - 0x02A3D2 20:A3C2: 01        .byte $01	; <あ>
- D - I - 0x02A3D3 20:A3C3: 1E        .byte $1E	; <ほ>
- D - I - 0x02A3D4 20:A3C4: 80        .byte $80
- D - I - 0x02A3D5 20:A3C5: 00        .byte $00
- D - I - 0x02A3D6 20:A3C6: 26        .byte $26	; <よ>
- D - I - 0x02A3D7 20:A3C7: 00        .byte $00
- - - - - 0x02A3D8 20:A3C8: 00        .byte $00
off_A3C9_09:
- D - I - 0x02A3D9 20:A3C9: 01        .byte $01	; <あ>
- D - I - 0x02A3DA 20:A3CA: 1E        .byte $1E	; <ほ>
- D - I - 0x02A3DB 20:A3CB: C4        .byte $C4	; <ビ>
- D - I - 0x02A3DC 20:A3CC: 05        .byte $05	; <お>
- D - I - 0x02A3DD 20:A3CD: 80        .byte $80
- D - I - 0x02A3DE 20:A3CE: FE        .byte $FE
- - - - - 0x02A3DF 20:A3CF: 00        .byte $00
off_A3D0_0A:
- D - I - 0x02A3E0 20:A3D0: 01        .byte $01	; <あ>
- D - I - 0x02A3E1 20:A3D1: 32        .byte $32	; <ょ>
- D - I - 0x02A3E2 20:A3D2: 00        .byte $00
- D - I - 0x02A3E3 20:A3D3: 04        .byte $04	; <え>
- D - I - 0x02A3E4 20:A3D4: A4        .byte $A4	; <ご>
- D - I - 0x02A3E5 20:A3D5: FF        .byte $FF
- D - I - 0x02A3E6 20:A3D6: 00        .byte $00
off_A3D7_0B:
- D - I - 0x02A3E7 20:A3D7: 02        .byte $02	; <い>
- D - I - 0x02A3E8 20:A3D8: 40        .byte $40	; <「>
- D - I - 0x02A3E9 20:A3D9: 0E        .byte $0E	; <せ>
- D - I - 0x02A3EA 20:A3DA: 00        .byte $00
- D - I - 0x02A3EB 20:A3DB: E6        .byte $E6
- D - I - 0x02A3EC 20:A3DC: FF        .byte $FF
- - - - - 0x02A3ED 20:A3DD: 00        .byte $00
off_A3DE_0C:
- D - I - 0x02A3EE 20:A3DE: 01        .byte $01	; <あ>
- D - I - 0x02A3EF 20:A3DF: 1E        .byte $1E	; <ほ>
- D - I - 0x02A3F0 20:A3E0: 99        .byte $99
- D - I - 0x02A3F1 20:A3E1: 05        .byte $05	; <お>
- D - I - 0x02A3F2 20:A3E2: DE        .byte $DE
- D - I - 0x02A3F3 20:A3E3: FD        .byte $FD
- - - - - 0x02A3F4 20:A3E4: 00        .byte $00
off_A3E5_0D:
- - - - - 0x02A3F5 20:A3E5: 03        .byte $03	; <う>
- - - - - 0x02A3F6 20:A3E6: 28        .byte $28	; <り>
- - - - - 0x02A3F7 20:A3E7: 00        .byte $00
- - - - - 0x02A3F8 20:A3E8: 02        .byte $02	; <い>
- - - - - 0x02A3F9 20:A3E9: 2D        .byte $2D	; <を>
- - - - - 0x02A3FA 20:A3EA: FD        .byte $FD
- - - - - 0x02A3FB 20:A3EB: FD        .byte $FD
- - - - - 0x02A3FC 20:A3EC: FF        .byte $FF
- - - - - 0x02A3FD 20:A3ED: 0C        .byte $0C	; <し>
- - - - - 0x02A3FE 20:A3EE: 00        .byte $00
- - - - - 0x02A3FF 20:A3EF: 03        .byte $03	; <う>
- - - - - 0x02A400 20:A3F0: 14        .byte $14	; <と>
- - - - - 0x02A401 20:A3F1: CC        .byte $CC	; <ぽ>
- - - - - 0x02A402 20:A3F2: 02        .byte $02	; <い>
- - - - - 0x02A403 20:A3F3: 67        .byte $67	; <ラ>
- - - - - 0x02A404 20:A3F4: FE        .byte $FE
- - - - - 0x02A405 20:A3F5: 38        .byte $38	; <5>
- - - - - 0x02A406 20:A3F6: 00        .byte $00
- - - - - 0x02A407 20:A3F7: 58        .byte $58	; <ネ>
- - - - - 0x02A408 20:A3F8: 00        .byte $00
- - - - - 0x02A409 20:A3F9: 00        .byte $00
off_A3FA_0E:
- D - I - 0x02A40A 20:A3FA: 01        .byte $01	; <あ>
- D - I - 0x02A40B 20:A3FB: 5A        .byte $5A	; <ハ>
- D - I - 0x02A40C 20:A3FC: E0        .byte $E0
- D - I - 0x02A40D 20:A3FD: FF        .byte $FF
- D - I - 0x02A40E 20:A3FE: 08        .byte $08	; <く>
- D - I - 0x02A40F 20:A3FF: 00        .byte $00
- - - - - 0x02A410 20:A400: 00        .byte $00
off_A401_0F:
off_A401:
- D - I - 0x02A411 20:A401: 01        .byte $01	; <あ>
- D - I - 0x02A412 20:A402: EF        .byte $EF
- D - I - 0x02A413 20:A403: 80        .byte $80
- D - I - 0x02A414 20:A404: FF        .byte $FF
- D - I - 0x02A415 20:A405: 00        .byte $00
- D - I - 0x02A416 20:A406: 00        .byte $00
- D - I - 0x02A417 20:A407: 04        .byte $04	; <え>
- D - I - 0x02A418 20:A408: 01 A4     .word off_A401
- - - - - 0x02A41A 20:A40A: 00        .byte $00
off_A40B_10:
- D - I - 0x02A41B 20:A40B: 01        .byte $01	; <あ>
- D - I - 0x02A41C 20:A40C: 32        .byte $32	; <ょ>
- D - I - 0x02A41D 20:A40D: 16        .byte $16	; <に>
- D - I - 0x02A41E 20:A40E: 00        .byte $00
- D - I - 0x02A41F 20:A40F: 32        .byte $32	; <ょ>
- D - I - 0x02A420 20:A410: 00        .byte $00
- - - - - 0x02A421 20:A411: 00        .byte $00
off_A412_11:
- D - I - 0x02A422 20:A412: 01        .byte $01	; <あ>
- D - I - 0x02A423 20:A413: 1E        .byte $1E	; <ほ>
- D - I - 0x02A424 20:A414: 53        .byte $53	; <テ>
- D - I - 0x02A425 20:A415: 04        .byte $04	; <え>
- D - I - 0x02A426 20:A416: FA        .byte $FA
- D - I - 0x02A427 20:A417: FE        .byte $FE
- - - - - 0x02A428 20:A418: 00        .byte $00
off_A419_12:
- D - I - 0x02A429 20:A419: 01        .byte $01	; <あ>
- D - I - 0x02A42A 20:A41A: 3C        .byte $3C	; <9>
- D - I - 0x02A42B 20:A41B: C0        .byte $C0	; <ヅ>
- D - I - 0x02A42C 20:A41C: 06        .byte $06	; <か>
- D - I - 0x02A42D 20:A41D: 08        .byte $08	; <く>
- D - I - 0x02A42E 20:A41E: 00        .byte $00
- - - - - 0x02A42F 20:A41F: 00        .byte $00
off_A420_13:
- D - I - 0x02A430 20:A420: 01        .byte $01	; <あ>
- D - I - 0x02A431 20:A421: 1E        .byte $1E	; <ほ>
- D - I - 0x02A432 20:A422: 80        .byte $80
- D - I - 0x02A433 20:A423: FF        .byte $FF
- D - I - 0x02A434 20:A424: 26        .byte $26	; <よ>
- D - I - 0x02A435 20:A425: 00        .byte $00
- D - I - 0x02A436 20:A426: 01        .byte $01	; <あ>
- D - I - 0x02A437 20:A427: 0A        .byte $0A	; <こ>
- D - I - 0x02A438 20:A428: 80        .byte $80
- D - I - 0x02A439 20:A429: FF        .byte $FF
- D - I - 0x02A43A 20:A42A: 80        .byte $80
- D - I - 0x02A43B 20:A42B: 00        .byte $00
- - - - - 0x02A43C 20:A42C: 00        .byte $00
off_A42D_14:
- D - I - 0x02A43D 20:A42D: 01        .byte $01	; <あ>
- D - I - 0x02A43E 20:A42E: 28        .byte $28	; <り>
- D - I - 0x02A43F 20:A42F: 99        .byte $99
- D - I - 0x02A440 20:A430: 05        .byte $05	; <お>
- D - I - 0x02A441 20:A431: 00        .byte $00
- D - I - 0x02A442 20:A432: 03        .byte $03	; <う>
- - - - - 0x02A443 20:A433: 00        .byte $00
off_A434_15:
- D - I - 0x02A444 20:A434: 01        .byte $01	; <あ>
- D - I - 0x02A445 20:A435: 28        .byte $28	; <り>
- D - I - 0x02A446 20:A436: 40        .byte $40	; <「>
- D - I - 0x02A447 20:A437: 00        .byte $00
- D - I - 0x02A448 20:A438: C0        .byte $C0	; <ヅ>
- D - I - 0x02A449 20:A439: FF        .byte $FF
- D - I - 0x02A44A 20:A43A: 00        .byte $00
off_A43B_16:
- D - I - 0x02A44B 20:A43B: 01        .byte $01	; <あ>
- D - I - 0x02A44C 20:A43C: 3C        .byte $3C	; <9>
- D - I - 0x02A44D 20:A43D: 80        .byte $80
- D - I - 0x02A44E 20:A43E: 04        .byte $04	; <え>
- D - I - 0x02A44F 20:A43F: 80        .byte $80
- D - I - 0x02A450 20:A440: 00        .byte $00
- - - - - 0x02A451 20:A441: 00        .byte $00
off_A442_17:
- D - I - 0x02A452 20:A442: 01        .byte $01	; <あ>
- D - I - 0x02A453 20:A443: 1E        .byte $1E	; <ほ>
- D - I - 0x02A454 20:A444: 99        .byte $99
- D - I - 0x02A455 20:A445: 05        .byte $05	; <お>
- D - I - 0x02A456 20:A446: 00        .byte $00
- D - I - 0x02A457 20:A447: 03        .byte $03	; <う>
- - - - - 0x02A458 20:A448: 00        .byte $00
off_A449_18:
- D - I - 0x02A459 20:A449: 01        .byte $01	; <あ>
- D - I - 0x02A45A 20:A44A: 1E        .byte $1E	; <ほ>
- D - I - 0x02A45B 20:A44B: 26        .byte $26	; <よ>
- D - I - 0x02A45C 20:A44C: 00        .byte $00
- D - I - 0x02A45D 20:A44D: DA        .byte $DA
- D - I - 0x02A45E 20:A44E: FF        .byte $FF
- - - - - 0x02A45F 20:A44F: 00        .byte $00
off_A450_19:
- D - I - 0x02A460 20:A450: 01        .byte $01	; <あ>
- D - I - 0x02A461 20:A451: 1E        .byte $1E	; <ほ>
- D - I - 0x02A462 20:A452: 80        .byte $80
- D - I - 0x02A463 20:A453: 04        .byte $04	; <え>
- D - I - 0x02A464 20:A454: 80        .byte $80
- D - I - 0x02A465 20:A455: 00        .byte $00
- - - - - 0x02A466 20:A456: 00        .byte $00
off_A457_1A:
- D - I - 0x02A467 20:A457: 01        .byte $01	; <あ>
- D - I - 0x02A468 20:A458: 1E        .byte $1E	; <ほ>
- D - I - 0x02A469 20:A459: E6        .byte $E6
- D - I - 0x02A46A 20:A45A: 04        .byte $04	; <え>
- D - I - 0x02A46B 20:A45B: D5        .byte $D5
- D - I - 0x02A46C 20:A45C: 02        .byte $02	; <い>
- - - - - 0x02A46D 20:A45D: 00        .byte $00
off_A45E_1B:
- D - I - 0x02A46E 20:A45E: 01        .byte $01	; <あ>
- D - I - 0x02A46F 20:A45F: 1E        .byte $1E	; <ほ>
- D - I - 0x02A470 20:A460: 1A        .byte $1A	; <は>
- D - I - 0x02A471 20:A461: FE        .byte $FE
- D - I - 0x02A472 20:A462: B4        .byte $B4	; <ガ>
- D - I - 0x02A473 20:A463: FB        .byte $FB
- D - I - 0x02A474 20:A464: 00        .byte $00
off_A465_1C:
- D - I - 0x02A475 20:A465: 01        .byte $01	; <あ>
- D - I - 0x02A476 20:A466: 1E        .byte $1E	; <ほ>
- D - I - 0x02A477 20:A467: 26        .byte $26	; <よ>
- D - I - 0x02A478 20:A468: 00        .byte $00
- D - I - 0x02A479 20:A469: 26        .byte $26	; <よ>
- D - I - 0x02A47A 20:A46A: 00        .byte $00
- D - I - 0x02A47B 20:A46B: 00        .byte $00
off_A46C_1D:
- D - I - 0x02A47C 20:A46C: 01        .byte $01	; <あ>
- D - I - 0x02A47D 20:A46D: 1E        .byte $1E	; <ほ>
- D - I - 0x02A47E 20:A46E: 00        .byte $00
- D - I - 0x02A47F 20:A46F: FF        .byte $FF
- D - I - 0x02A480 20:A470: E0        .byte $E0
- D - I - 0x02A481 20:A471: FD        .byte $FD
- - - - - 0x02A482 20:A472: 00        .byte $00
off_A473_1E:
- - - - - 0x02A483 20:A473: 01        .byte $01	; <あ>
- - - - - 0x02A484 20:A474: 3C        .byte $3C	; <9>
- - - - - 0x02A485 20:A475: 40        .byte $40	; <「>
- - - - - 0x02A486 20:A476: 02        .byte $02	; <い>
- - - - - 0x02A487 20:A477: C0        .byte $C0	; <ヅ>
- - - - - 0x02A488 20:A478: FE        .byte $FE
- - - - - 0x02A489 20:A479: 00        .byte $00
off_A47A_1F:
- D - I - 0x02A48A 20:A47A: 01        .byte $01	; <あ>
- D - I - 0x02A48B 20:A47B: 5A        .byte $5A	; <ハ>
- D - I - 0x02A48C 20:A47C: DA        .byte $DA
- D - I - 0x02A48D 20:A47D: FF        .byte $FF
- D - I - 0x02A48E 20:A47E: 00        .byte $00
- D - I - 0x02A48F 20:A47F: 00        .byte $00
- D - I - 0x02A490 20:A480: 00        .byte $00
off_A481_20:
- D - I - 0x02A491 20:A481: 01        .byte $01	; <あ>
- D - I - 0x02A492 20:A482: 28        .byte $28	; <り>
- D - I - 0x02A493 20:A483: 80        .byte $80
- D - I - 0x02A494 20:A484: 02        .byte $02	; <い>
- D - I - 0x02A495 20:A485: 20        .byte $20	; <み>
- D - I - 0x02A496 20:A486: 00        .byte $00
- D - I - 0x02A497 20:A487: 00        .byte $00
off_A488_21:
- D - I - 0x02A498 20:A488: 01        .byte $01	; <あ>
- D - I - 0x02A499 20:A489: 2C        .byte $2C	; <わ>
- D - I - 0x02A49A 20:A48A: 00        .byte $00
- D - I - 0x02A49B 20:A48B: 05        .byte $05	; <お>
- D - I - 0x02A49C 20:A48C: 20        .byte $20	; <み>
- D - I - 0x02A49D 20:A48D: 02        .byte $02	; <い>
- - - - - 0x02A49E 20:A48E: 00        .byte $00
off_A48F_22:
- D - I - 0x02A49F 20:A48F: 01        .byte $01	; <あ>
- D - I - 0x02A4A0 20:A490: 28        .byte $28	; <り>
- D - I - 0x02A4A1 20:A491: 80        .byte $80
- D - I - 0x02A4A2 20:A492: 00        .byte $00
- D - I - 0x02A4A3 20:A493: 20        .byte $20	; <み>
- D - I - 0x02A4A4 20:A494: 00        .byte $00
- - - - - 0x02A4A5 20:A495: 00        .byte $00
off_A496_23:
- D - I - 0x02A4A6 20:A496: 01        .byte $01	; <あ>
- D - I - 0x02A4A7 20:A497: 28        .byte $28	; <り>
- D - I - 0x02A4A8 20:A498: B0        .byte $B0	; <び>
- D - I - 0x02A4A9 20:A499: FC        .byte $FC
- D - I - 0x02A4AA 20:A49A: B0        .byte $B0	; <び>
- D - I - 0x02A4AB 20:A49B: FD        .byte $FD
- - - - - 0x02A4AC 20:A49C: 00        .byte $00
off_A49D_24:
- D - I - 0x02A4AD 20:A49D: 01        .byte $01	; <あ>
- D - I - 0x02A4AE 20:A49E: 1E        .byte $1E	; <ほ>
- D - I - 0x02A4AF 20:A49F: AD        .byte $AD	; <で>
- D - I - 0x02A4B0 20:A4A0: FF        .byte $FF
- D - I - 0x02A4B1 20:A4A1: DA        .byte $DA
- D - I - 0x02A4B2 20:A4A2: FF        .byte $FF
- - - - - 0x02A4B3 20:A4A3: 00        .byte $00
off_A4A4_25:
- D - I - 0x02A4B4 20:A4A4: 01        .byte $01	; <あ>
- D - I - 0x02A4B5 20:A4A5: 10        .byte $10	; <た>
- D - I - 0x02A4B6 20:A4A6: B0        .byte $B0	; <び>
- D - I - 0x02A4B7 20:A4A7: FF        .byte $FF
- D - I - 0x02A4B8 20:A4A8: 00        .byte $00
- D - I - 0x02A4B9 20:A4A9: 00        .byte $00
- - - - - 0x02A4BA 20:A4AA: 00        .byte $00
off_A4AB_26:
- D - I - 0x02A4BB 20:A4AB: 01        .byte $01	; <あ>
- D - I - 0x02A4BC 20:A4AC: 28        .byte $28	; <り>
- D - I - 0x02A4BD 20:A4AD: E0        .byte $E0
- D - I - 0x02A4BE 20:A4AE: FF        .byte $FF
- D - I - 0x02A4BF 20:A4AF: 20        .byte $20	; <み>
- D - I - 0x02A4C0 20:A4B0: 00        .byte $00
- D - I - 0x02A4C1 20:A4B1: 00        .byte $00
off_A4B2_27:
- D - I - 0x02A4C2 20:A4B2: 01        .byte $01	; <あ>
- D - I - 0x02A4C3 20:A4B3: 28        .byte $28	; <り>
- D - I - 0x02A4C4 20:A4B4: 00        .byte $00
- D - I - 0x02A4C5 20:A4B5: FD        .byte $FD
- D - I - 0x02A4C6 20:A4B6: 00        .byte $00
- D - I - 0x02A4C7 20:A4B7: FD        .byte $FD
- D - I - 0x02A4C8 20:A4B8: 00        .byte $00
off_A4B9_28:
- D - I - 0x02A4C9 20:A4B9: 01        .byte $01	; <あ>
- D - I - 0x02A4CA 20:A4BA: 1E        .byte $1E	; <ほ>
- D - I - 0x02A4CB 20:A4BB: 80        .byte $80
- D - I - 0x02A4CC 20:A4BC: 00        .byte $00
- D - I - 0x02A4CD 20:A4BD: DA        .byte $DA
- D - I - 0x02A4CE 20:A4BE: FF        .byte $FF
- - - - - 0x02A4CF 20:A4BF: 00        .byte $00
off_A4C0_29:
- D - I - 0x02A4D0 20:A4C0: 01        .byte $01	; <あ>
- D - I - 0x02A4D1 20:A4C1: 10        .byte $10	; <た>
- D - I - 0x02A4D2 20:A4C2: 50        .byte $50	; <タ>
- D - I - 0x02A4D3 20:A4C3: 00        .byte $00
- D - I - 0x02A4D4 20:A4C4: 00        .byte $00
- D - I - 0x02A4D5 20:A4C5: 00        .byte $00
- D - I - 0x02A4D6 20:A4C6: 00        .byte $00
off_A4C7_2A:
- D - I - 0x02A4D7 20:A4C7: 01        .byte $01	; <あ>
- D - I - 0x02A4D8 20:A4C8: 28        .byte $28	; <り>
- D - I - 0x02A4D9 20:A4C9: 20        .byte $20	; <み>
- D - I - 0x02A4DA 20:A4CA: 00        .byte $00
- D - I - 0x02A4DB 20:A4CB: 20        .byte $20	; <み>
- D - I - 0x02A4DC 20:A4CC: 00        .byte $00
- D - I - 0x02A4DD 20:A4CD: 00        .byte $00
off_A4CE_2B:
- - - - - 0x02A4DE 20:A4CE: 01        .byte $01	; <あ>
- - - - - 0x02A4DF 20:A4CF: 1E        .byte $1E	; <ほ>
- - - - - 0x02A4E0 20:A4D0: C0        .byte $C0	; <ヅ>
- - - - - 0x02A4E1 20:A4D1: F7        .byte $F7
- - - - - 0x02A4E2 20:A4D2: 00        .byte $00
- - - - - 0x02A4E3 20:A4D3: 00        .byte $00
- - - - - 0x02A4E4 20:A4D4: 00        .byte $00
off_A4D5_2C:
- D - I - 0x02A4E5 20:A4D5: 01        .byte $01	; <あ>
- D - I - 0x02A4E6 20:A4D6: 3C        .byte $3C	; <9>
- D - I - 0x02A4E7 20:A4D7: 00        .byte $00
- D - I - 0x02A4E8 20:A4D8: FE        .byte $FE
- D - I - 0x02A4E9 20:A4D9: 00        .byte $00
- D - I - 0x02A4EA 20:A4DA: 00        .byte $00
- D - I - 0x02A4EB 20:A4DB: 03        .byte $03	; <う>
- D - I - 0x02A4EC 20:A4DC: 3C        .byte $3C	; <9>
- D - I - 0x02A4ED 20:A4DD: 00        .byte $00
- D - I - 0x02A4EE 20:A4DE: FE        .byte $FE
- D - I - 0x02A4EF 20:A4DF: 00        .byte $00
- D - I - 0x02A4F0 20:A4E0: 00        .byte $00
- D - I - 0x02A4F1 20:A4E1: 1A        .byte $1A	; <は>
- D - I - 0x02A4F2 20:A4E2: 00        .byte $00
- D - I - 0x02A4F3 20:A4E3: 00        .byte $00
- D - I - 0x02A4F4 20:A4E4: 00        .byte $00
- D - I - 0x02A4F5 20:A4E5: 01        .byte $01	; <あ>
- D - I - 0x02A4F6 20:A4E6: 50        .byte $50	; <タ>
- D - I - 0x02A4F7 20:A4E7: 00        .byte $00
- D - I - 0x02A4F8 20:A4E8: 00        .byte $00
- D - I - 0x02A4F9 20:A4E9: 00        .byte $00
- D - I - 0x02A4FA 20:A4EA: 00        .byte $00
- D - I - 0x02A4FB 20:A4EB: 00        .byte $00
off_A4EC_2D:
- D - I - 0x02A4FC 20:A4EC: 01        .byte $01	; <あ>
- D - I - 0x02A4FD 20:A4ED: 28        .byte $28	; <り>
- D - I - 0x02A4FE 20:A4EE: 80        .byte $80
- D - I - 0x02A4FF 20:A4EF: FF        .byte $FF
- D - I - 0x02A500 20:A4F0: 20        .byte $20	; <み>
- D - I - 0x02A501 20:A4F1: 00        .byte $00
- D - I - 0x02A502 20:A4F2: 00        .byte $00
off_A4F3_2E:
- D - I - 0x02A503 20:A4F3: 04        .byte $04	; <え>
- D - I - 0x02A504 20:A4F4: BC AA     .word off_AABC
off_A4F6_2F:
- D - I - 0x02A506 20:A4F6: 01        .byte $01	; <あ>
- D - I - 0x02A507 20:A4F7: 1E        .byte $1E	; <ほ>
- D - I - 0x02A508 20:A4F8: 53        .byte $53	; <テ>
- D - I - 0x02A509 20:A4F9: 00        .byte $00
- D - I - 0x02A50A 20:A4FA: DA        .byte $DA
- D - I - 0x02A50B 20:A4FB: FF        .byte $FF
- - - - - 0x02A50C 20:A4FC: 00        .byte $00
off_A4FD_30:
- D - I - 0x02A50D 20:A4FD: 01        .byte $01	; <あ>
- D - I - 0x02A50E 20:A4FE: C0        .byte $C0	; <ヅ>
- D - I - 0x02A50F 20:A4FF: 00        .byte $00
- D - I - 0x02A510 20:A500: 00        .byte $00
- D - I - 0x02A511 20:A501: 00        .byte $00
- D - I - 0x02A512 20:A502: 00        .byte $00
- D - I - 0x02A513 20:A503: 01        .byte $01	; <あ>
- D - I - 0x02A514 20:A504: 40        .byte $40	; <「>
- D - I - 0x02A515 20:A505: 00        .byte $00
- D - I - 0x02A516 20:A506: 00        .byte $00
- D - I - 0x02A517 20:A507: 80        .byte $80
- D - I - 0x02A518 20:A508: 00        .byte $00
- D - I - 0x02A519 20:A509: 00        .byte $00
off_A50A_31:
- D - I - 0x02A51A 20:A50A: 01        .byte $01	; <あ>
- D - I - 0x02A51B 20:A50B: 28        .byte $28	; <り>
- D - I - 0x02A51C 20:A50C: 06        .byte $06	; <か>
- D - I - 0x02A51D 20:A50D: 02        .byte $02	; <い>
- D - I - 0x02A51E 20:A50E: F9        .byte $F9
- D - I - 0x02A51F 20:A50F: 03        .byte $03	; <う>
- D - I - 0x02A520 20:A510: 00        .byte $00
off_A511_32:
- D - I - 0x02A521 20:A511: 01        .byte $01	; <あ>
- D - I - 0x02A522 20:A512: 28        .byte $28	; <り>
- D - I - 0x02A523 20:A513: 20        .byte $20	; <み>
- D - I - 0x02A524 20:A514: 04        .byte $04	; <え>
- D - I - 0x02A525 20:A515: E0        .byte $E0
- D - I - 0x02A526 20:A516: FE        .byte $FE
- - - - - 0x02A527 20:A517: 00        .byte $00
off_A518_33:
- D - I - 0x02A528 20:A518: 01        .byte $01	; <あ>
- D - I - 0x02A529 20:A519: 50        .byte $50	; <タ>
- D - I - 0x02A52A 20:A51A: 7C        .byte $7C	; <~>
- D - I - 0x02A52B 20:A51B: 04        .byte $04	; <え>
- D - I - 0x02A52C 20:A51C: 30        .byte $30	; <ゃ>
- D - I - 0x02A52D 20:A51D: 00        .byte $00
- D - I - 0x02A52E 20:A51E: 00        .byte $00
off_A51F_34:
- D - I - 0x02A52F 20:A51F: 01        .byte $01	; <あ>
- D - I - 0x02A530 20:A520: 32        .byte $32	; <ょ>
- D - I - 0x02A531 20:A521: EA        .byte $EA
- D - I - 0x02A532 20:A522: FF        .byte $FF
- D - I - 0x02A533 20:A523: 16        .byte $16	; <に>
- D - I - 0x02A534 20:A524: 00        .byte $00
- D - I - 0x02A535 20:A525: 00        .byte $00
off_A526_35:
- D - I - 0x02A536 20:A526: 02        .byte $02	; <い>
- D - I - 0x02A537 20:A527: 1E        .byte $1E	; <ほ>
- D - I - 0x02A538 20:A528: 00        .byte $00
- D - I - 0x02A539 20:A529: 00        .byte $00
- D - I - 0x02A53A 20:A52A: 15        .byte $15	; <な>
- D - I - 0x02A53B 20:A52B: 00        .byte $00
- D - I - 0x02A53C 20:A52C: 03        .byte $03	; <う>
- D - I - 0x02A53D 20:A52D: 1E        .byte $1E	; <ほ>
- D - I - 0x02A53E 20:A52E: 00        .byte $00
- D - I - 0x02A53F 20:A52F: 00        .byte $00
- D - I - 0x02A540 20:A530: 34        .byte $34	; <1>
- D - I - 0x02A541 20:A531: FF        .byte $FF
- D - I - 0x02A542 20:A532: 00        .byte $00
- D - I - 0x02A543 20:A533: 00        .byte $00
- D - I - 0x02A544 20:A534: 0C        .byte $0C	; <し>
- D - I - 0x02A545 20:A535: 00        .byte $00
- D - I - 0x02A546 20:A536: 00        .byte $00
off_A537_36:
- D - I - 0x02A547 20:A537: 01        .byte $01	; <あ>
- D - I - 0x02A548 20:A538: 3C        .byte $3C	; <9>
- D - I - 0x02A549 20:A539: C0        .byte $C0	; <ヅ>
- D - I - 0x02A54A 20:A53A: FF        .byte $FF
- D - I - 0x02A54B 20:A53B: C0        .byte $C0	; <ヅ>
- D - I - 0x02A54C 20:A53C: FF        .byte $FF
- - - - - 0x02A54D 20:A53D: 00        .byte $00
off_A53E_37:
- D - I - 0x02A54E 20:A53E: 01        .byte $01	; <あ>
- D - I - 0x02A54F 20:A53F: 32        .byte $32	; <ょ>
- D - I - 0x02A550 20:A540: E0        .byte $E0
- D - I - 0x02A551 20:A541: FF        .byte $FF
- D - I - 0x02A552 20:A542: 30        .byte $30	; <ゃ>
- D - I - 0x02A553 20:A543: 00        .byte $00
- D - I - 0x02A554 20:A544: 00        .byte $00
off_A545_38:
- D - I - 0x02A555 20:A545: 01        .byte $01	; <あ>
- D - I - 0x02A556 20:A546: 28        .byte $28	; <り>
- D - I - 0x02A557 20:A547: 00        .byte $00
- D - I - 0x02A558 20:A548: 00        .byte $00
- D - I - 0x02A559 20:A549: 40        .byte $40	; <「>
- D - I - 0x02A55A 20:A54A: FD        .byte $FD
- D - I - 0x02A55B 20:A54B: 00        .byte $00
off_A54C_39:
- D - I - 0x02A55C 20:A54C: 01        .byte $01	; <あ>
- D - I - 0x02A55D 20:A54D: 50        .byte $50	; <タ>
- D - I - 0x02A55E 20:A54E: EB        .byte $EB
- D - I - 0x02A55F 20:A54F: FF        .byte $FF
- D - I - 0x02A560 20:A550: 05        .byte $05	; <お>
- D - I - 0x02A561 20:A551: 00        .byte $00
- - - - - 0x02A562 20:A552: 00        .byte $00
off_A553_3A:
- D - I - 0x02A563 20:A553: 01        .byte $01	; <あ>
- D - I - 0x02A564 20:A554: 14        .byte $14	; <と>
- D - I - 0x02A565 20:A555: 40        .byte $40	; <「>
- D - I - 0x02A566 20:A556: 02        .byte $02	; <い>
- D - I - 0x02A567 20:A557: 40        .byte $40	; <「>
- D - I - 0x02A568 20:A558: 00        .byte $00
- - - - - 0x02A569 20:A559: 00        .byte $00
off_A55A_3B:
- D - I - 0x02A56A 20:A55A: 03        .byte $03	; <う>
- D - I - 0x02A56B 20:A55B: 1E        .byte $1E	; <ほ>
- D - I - 0x02A56C 20:A55C: 6D        .byte $6D	; <ヲ>
- D - I - 0x02A56D 20:A55D: FD        .byte $FD
- D - I - 0x02A56E 20:A55E: A0        .byte $A0	; <が>
- D - I - 0x02A56F 20:A55F: FD        .byte $FD
- D - I - 0x02A570 20:A560: 18        .byte $18	; <ね>
- D - I - 0x02A571 20:A561: 00        .byte $00
- D - I - 0x02A572 20:A562: 10        .byte $10	; <た>
- D - I - 0x02A573 20:A563: 00        .byte $00
- D - I - 0x02A574 20:A564: 02        .byte $02	; <い>
- D - I - 0x02A575 20:A565: 28        .byte $28	; <り>
- D - I - 0x02A576 20:A566: A0        .byte $A0	; <が>
- D - I - 0x02A577 20:A567: 00        .byte $00
- D - I - 0x02A578 20:A568: 70        .byte $70	; <ャ>
- D - I - 0x02A579 20:A569: 00        .byte $00
- - - - - 0x02A57A 20:A56A: 00        .byte $00
off_A56B_3C:
- D - I - 0x02A57B 20:A56B: 02        .byte $02	; <い>
- D - I - 0x02A57C 20:A56C: 40        .byte $40	; <「>
- D - I - 0x02A57D 20:A56D: 30        .byte $30	; <ゃ>
- D - I - 0x02A57E 20:A56E: 00        .byte $00
- D - I - 0x02A57F 20:A56F: 38        .byte $38	; <5>
- D - I - 0x02A580 20:A570: 00        .byte $00
- D - I - 0x02A581 20:A571: 00        .byte $00
off_A572_3D:
- D - I - 0x02A582 20:A572: 01        .byte $01	; <あ>
- D - I - 0x02A583 20:A573: 14        .byte $14	; <と>
- D - I - 0x02A584 20:A574: 00        .byte $00
- D - I - 0x02A585 20:A575: 04        .byte $04	; <え>
- D - I - 0x02A586 20:A576: 00        .byte $00
- D - I - 0x02A587 20:A577: 00        .byte $00
- D - I - 0x02A588 20:A578: 00        .byte $00
off_A579_3E:
- D - I - 0x02A589 20:A579: 03        .byte $03	; <う>
- D - I - 0x02A58A 20:A57A: 1E        .byte $1E	; <ほ>
- D - I - 0x02A58B 20:A57B: 8C        .byte $8C	; <M>
- D - I - 0x02A58C 20:A57C: 05        .byte $05	; <お>
- D - I - 0x02A58D 20:A57D: 00        .byte $00
- D - I - 0x02A58E 20:A57E: 00        .byte $00
- D - I - 0x02A58F 20:A57F: 1E        .byte $1E	; <ほ>
- D - I - 0x02A590 20:A580: FF        .byte $FF
- D - I - 0x02A591 20:A581: 00        .byte $00
- D - I - 0x02A592 20:A582: 00        .byte $00
- - - - - 0x02A593 20:A583: 00        .byte $00
off_A584_3F:
- D - I - 0x02A594 20:A584: 01        .byte $01	; <あ>
- D - I - 0x02A595 20:A585: 1E        .byte $1E	; <ほ>
- D - I - 0x02A596 20:A586: CD        .byte $CD	; <パ>
- D - I - 0x02A597 20:A587: FC        .byte $FC
- D - I - 0x02A598 20:A588: 00        .byte $00
- D - I - 0x02A599 20:A589: 00        .byte $00
- - - - - 0x02A59A 20:A58A: 00        .byte $00
off_A58B_40:
- D - I - 0x02A59B 20:A58B: 01        .byte $01	; <あ>
- D - I - 0x02A59C 20:A58C: 32        .byte $32	; <ょ>
- D - I - 0x02A59D 20:A58D: 20        .byte $20	; <み>
- D - I - 0x02A59E 20:A58E: 01        .byte $01	; <あ>
- D - I - 0x02A59F 20:A58F: 80        .byte $80
- D - I - 0x02A5A0 20:A590: FB        .byte $FB
- D - I - 0x02A5A1 20:A591: 00        .byte $00
off_A592_41:
- D - I - 0x02A5A2 20:A592: 01        .byte $01	; <あ>
- D - I - 0x02A5A3 20:A593: 28        .byte $28	; <り>
- D - I - 0x02A5A4 20:A594: 00        .byte $00
- D - I - 0x02A5A5 20:A595: 09        .byte $09	; <け>
- D - I - 0x02A5A6 20:A596: C0        .byte $C0	; <ヅ>
- D - I - 0x02A5A7 20:A597: 00        .byte $00
- D - I - 0x02A5A8 20:A598: 00        .byte $00
off_A599_42:
- D - I - 0x02A5A9 20:A599: 01        .byte $01	; <あ>
- D - I - 0x02A5AA 20:A59A: 32        .byte $32	; <ょ>
- D - I - 0x02A5AB 20:A59B: 88        .byte $88	; <H>
- D - I - 0x02A5AC 20:A59C: 02        .byte $02	; <い>
- D - I - 0x02A5AD 20:A59D: 16        .byte $16	; <に>
- D - I - 0x02A5AE 20:A59E: 00        .byte $00
- D - I - 0x02A5AF 20:A59F: 00        .byte $00
off_A5A0_43:
- D - I - 0x02A5B0 20:A5A0: 01        .byte $01	; <あ>
- D - I - 0x02A5B1 20:A5A1: C0        .byte $C0	; <ヅ>
- D - I - 0x02A5B2 20:A5A2: 00        .byte $00
- D - I - 0x02A5B3 20:A5A3: 00        .byte $00
- D - I - 0x02A5B4 20:A5A4: 00        .byte $00
- D - I - 0x02A5B5 20:A5A5: 00        .byte $00
- D - I - 0x02A5B6 20:A5A6: 01        .byte $01	; <あ>
- D - I - 0x02A5B7 20:A5A7: 40        .byte $40	; <「>
- D - I - 0x02A5B8 20:A5A8: 00        .byte $00
- D - I - 0x02A5B9 20:A5A9: 00        .byte $00
- D - I - 0x02A5BA 20:A5AA: 80        .byte $80
- D - I - 0x02A5BB 20:A5AB: FF        .byte $FF
- D - I - 0x02A5BC 20:A5AC: 00        .byte $00
off_A5AD_44:
off_A5AD:
- - - - - 0x02A5BD 20:A5AD: 01        .byte $01	; <あ>
- - - - - 0x02A5BE 20:A5AE: 10        .byte $10	; <た>
- - - - - 0x02A5BF 20:A5AF: 00        .byte $00
- - - - - 0x02A5C0 20:A5B0: 00        .byte $00
- - - - - 0x02A5C1 20:A5B1: 00        .byte $00
- - - - - 0x02A5C2 20:A5B2: 00        .byte $00
- - - - - 0x02A5C3 20:A5B3: 01        .byte $01	; <あ>
- - - - - 0x02A5C4 20:A5B4: 01        .byte $01	; <あ>
- - - - - 0x02A5C5 20:A5B5: 00        .byte $00
- - - - - 0x02A5C6 20:A5B6: 00        .byte $00
- - - - - 0x02A5C7 20:A5B7: 00        .byte $00
- - - - - 0x02A5C8 20:A5B8: 08        .byte $08	; <く>
- - - - - 0x02A5C9 20:A5B9: 04        .byte $04	; <え>
- - - - - 0x02A5CA 20:A5BA: AD A5     .word off_A5AD
off_A5BC_45:
off_A5BC:
- - - - - 0x02A5CC 20:A5BC: 01        .byte $01	; <あ>
- - - - - 0x02A5CD 20:A5BD: 10        .byte $10	; <た>
- - - - - 0x02A5CE 20:A5BE: 00        .byte $00
- - - - - 0x02A5CF 20:A5BF: 00        .byte $00
- - - - - 0x02A5D0 20:A5C0: 00        .byte $00
- - - - - 0x02A5D1 20:A5C1: 00        .byte $00
- - - - - 0x02A5D2 20:A5C2: 01        .byte $01	; <あ>
- - - - - 0x02A5D3 20:A5C3: 01        .byte $01	; <あ>
- - - - - 0x02A5D4 20:A5C4: 00        .byte $00
- - - - - 0x02A5D5 20:A5C5: 00        .byte $00
- - - - - 0x02A5D6 20:A5C6: 00        .byte $00
- - - - - 0x02A5D7 20:A5C7: F8        .byte $F8
- - - - - 0x02A5D8 20:A5C8: 04        .byte $04	; <え>
- - - - - 0x02A5D9 20:A5C9: BC A5     .word off_A5BC
off_A5CB_46:
- D - I - 0x02A5DB 20:A5CB: 01        .byte $01	; <あ>
- D - I - 0x02A5DC 20:A5CC: 5A        .byte $5A	; <ハ>
- D - I - 0x02A5DD 20:A5CD: 44        .byte $44	; <エ>
- D - I - 0x02A5DE 20:A5CE: 00        .byte $00
- D - I - 0x02A5DF 20:A5CF: 17        .byte $17	; <ぬ>
- D - I - 0x02A5E0 20:A5D0: 00        .byte $00
- D - I - 0x02A5E1 20:A5D1: 00        .byte $00
off_A5D2_47:
- - - - - 0x02A5E2 20:A5D2: 00        .byte $00
off_A5D3_48:
- D - I - 0x02A5E3 20:A5D3: 03        .byte $03	; <う>
- D - I - 0x02A5E4 20:A5D4: 28        .byte $28	; <り>
- D - I - 0x02A5E5 20:A5D5: 6C        .byte $6C	; <ワ>
- D - I - 0x02A5E6 20:A5D6: 00        .byte $00
- D - I - 0x02A5E7 20:A5D7: 66        .byte $66	; <ヨ>
- D - I - 0x02A5E8 20:A5D8: 01        .byte $01	; <あ>
- D - I - 0x02A5E9 20:A5D9: 0A        .byte $0A	; <こ>
- D - I - 0x02A5EA 20:A5DA: 00        .byte $00
- D - I - 0x02A5EB 20:A5DB: 00        .byte $00
- D - I - 0x02A5EC 20:A5DC: 00        .byte $00
- D - I - 0x02A5ED 20:A5DD: 03        .byte $03	; <う>
- D - I - 0x02A5EE 20:A5DE: 14        .byte $14	; <と>
- D - I - 0x02A5EF 20:A5DF: 59        .byte $59	; <ノ>
- D - I - 0x02A5F0 20:A5E0: 02        .byte $02	; <い>
- D - I - 0x02A5F1 20:A5E1: C0        .byte $C0	; <ヅ>
- D - I - 0x02A5F2 20:A5E2: 00        .byte $00
- D - I - 0x02A5F3 20:A5E3: C0        .byte $C0	; <ヅ>
- D - I - 0x02A5F4 20:A5E4: 00        .byte $00
- D - I - 0x02A5F5 20:A5E5: 80        .byte $80
- D - I - 0x02A5F6 20:A5E6: FF        .byte $FF
- - - - - 0x02A5F7 20:A5E7: 00        .byte $00
off_A5E8_49:
- D - I - 0x02A5F8 20:A5E8: 01        .byte $01	; <あ>
- D - I - 0x02A5F9 20:A5E9: 1F        .byte $1F	; <ま>
- D - I - 0x02A5FA 20:A5EA: C0        .byte $C0	; <ヅ>
- D - I - 0x02A5FB 20:A5EB: 06        .byte $06	; <か>
- D - I - 0x02A5FC 20:A5EC: 13        .byte $13	; <て>
- D - I - 0x02A5FD 20:A5ED: 00        .byte $00
- - - - - 0x02A5FE 20:A5EE: 00        .byte $00
off_A5EF_4A:
- D - I - 0x02A5FF 20:A5EF: 01        .byte $01	; <あ>
- D - I - 0x02A600 20:A5F0: 1E        .byte $1E	; <ほ>
- D - I - 0x02A601 20:A5F1: 40        .byte $40	; <「>
- D - I - 0x02A602 20:A5F2: 00        .byte $00
- D - I - 0x02A603 20:A5F3: 40        .byte $40	; <「>
- D - I - 0x02A604 20:A5F4: 00        .byte $00
- D - I - 0x02A605 20:A5F5: 00        .byte $00
off_A5F6_4B:
- D - I - 0x02A606 20:A5F6: 01        .byte $01	; <あ>
- D - I - 0x02A607 20:A5F7: 28        .byte $28	; <り>
- D - I - 0x02A608 20:A5F8: C0        .byte $C0	; <ヅ>
- D - I - 0x02A609 20:A5F9: FF        .byte $FF
- D - I - 0x02A60A 20:A5FA: E0        .byte $E0
- D - I - 0x02A60B 20:A5FB: FF        .byte $FF
- D - I - 0x02A60C 20:A5FC: 00        .byte $00
off_A5FD_4C:
- D - I - 0x02A60D 20:A5FD: 01        .byte $01	; <あ>
- D - I - 0x02A60E 20:A5FE: 28        .byte $28	; <り>
- D - I - 0x02A60F 20:A5FF: C6        .byte $C6	; <ベ>
- D - I - 0x02A610 20:A600: 06        .byte $06	; <か>
- D - I - 0x02A611 20:A601: 00        .byte $00
- D - I - 0x02A612 20:A602: 00        .byte $00
- - - - - 0x02A613 20:A603: 00        .byte $00
off_A604_4D:
- D - I - 0x02A614 20:A604: 01        .byte $01	; <あ>
- D - I - 0x02A615 20:A605: 1E        .byte $1E	; <ほ>
- D - I - 0x02A616 20:A606: AD        .byte $AD	; <で>
- D - I - 0x02A617 20:A607: FF        .byte $FF
- D - I - 0x02A618 20:A608: DA        .byte $DA
- D - I - 0x02A619 20:A609: FF        .byte $FF
- D - I - 0x02A61A 20:A60A: 01        .byte $01	; <あ>
- D - I - 0x02A61B 20:A60B: 14        .byte $14	; <と>
- D - I - 0x02A61C 20:A60C: C0        .byte $C0	; <ヅ>
- D - I - 0x02A61D 20:A60D: FF        .byte $FF
- D - I - 0x02A61E 20:A60E: 00        .byte $00
- D - I - 0x02A61F 20:A60F: 00        .byte $00
- - - - - 0x02A620 20:A610: 00        .byte $00
off_A611_4E:
- D - I - 0x02A621 20:A611: 01        .byte $01	; <あ>
- D - I - 0x02A622 20:A612: 32        .byte $32	; <ょ>
- D - I - 0x02A623 20:A613: C6        .byte $C6	; <ベ>
- D - I - 0x02A624 20:A614: 06        .byte $06	; <か>
- D - I - 0x02A625 20:A615: 00        .byte $00
- D - I - 0x02A626 20:A616: 00        .byte $00
- - - - - 0x02A627 20:A617: 00        .byte $00
off_A618_4F:
off_A618:
- - - - - 0x02A628 20:A618: 03        .byte $03	; <う>
- - - - - 0x02A629 20:A619: 05        .byte $05	; <お>
- - - - - 0x02A62A 20:A61A: 00        .byte $00
- - - - - 0x02A62B 20:A61B: 00        .byte $00
- - - - - 0x02A62C 20:A61C: 00        .byte $00
- - - - - 0x02A62D 20:A61D: 05        .byte $05	; <お>
- - - - - 0x02A62E 20:A61E: F8        .byte $F8
- - - - - 0x02A62F 20:A61F: 00        .byte $00
- - - - - 0x02A630 20:A620: 6D        .byte $6D	; <ヲ>
- - - - - 0x02A631 20:A621: FF        .byte $FF
- - - - - 0x02A632 20:A622: 03        .byte $03	; <う>
- - - - - 0x02A633 20:A623: 05        .byte $05	; <お>
- - - - - 0x02A634 20:A624: 00        .byte $00
- - - - - 0x02A635 20:A625: 05        .byte $05	; <お>
- - - - - 0x02A636 20:A626: 00        .byte $00
- - - - - 0x02A637 20:A627: 00        .byte $00
- - - - - 0x02A638 20:A628: 6D        .byte $6D	; <ヲ>
- - - - - 0x02A639 20:A629: FF        .byte $FF
- - - - - 0x02A63A 20:A62A: 08        .byte $08	; <く>
- - - - - 0x02A63B 20:A62B: FF        .byte $FF
- - - - - 0x02A63C 20:A62C: 03        .byte $03	; <う>
- - - - - 0x02A63D 20:A62D: 05        .byte $05	; <お>
- - - - - 0x02A63E 20:A62E: 00        .byte $00
- - - - - 0x02A63F 20:A62F: 00        .byte $00
- - - - - 0x02A640 20:A630: 00        .byte $00
- - - - - 0x02A641 20:A631: FB        .byte $FB
- - - - - 0x02A642 20:A632: 08        .byte $08	; <く>
- - - - - 0x02A643 20:A633: FF        .byte $FF
- - - - - 0x02A644 20:A634: 93        .byte $93	; <Y>
- - - - - 0x02A645 20:A635: 00        .byte $00
- - - - - 0x02A646 20:A636: 03        .byte $03	; <う>
- - - - - 0x02A647 20:A637: 05        .byte $05	; <お>
- - - - - 0x02A648 20:A638: 00        .byte $00
- - - - - 0x02A649 20:A639: FB        .byte $FB
- - - - - 0x02A64A 20:A63A: 00        .byte $00
- - - - - 0x02A64B 20:A63B: 00        .byte $00
- - - - - 0x02A64C 20:A63C: 60        .byte $60	; <ミ>
- - - - - 0x02A64D 20:A63D: 00        .byte $00
- - - - - 0x02A64E 20:A63E: F8        .byte $F8
- - - - - 0x02A64F 20:A63F: 00        .byte $00
- - - - - 0x02A650 20:A640: 04        .byte $04	; <え>
- - - - - 0x02A651 20:A641: 18 A6     .word off_A618
off_A643_50:
- - - - - 0x02A653 20:A643: 01        .byte $01	; <あ>
- - - - - 0x02A654 20:A644: 14        .byte $14	; <と>
- - - - - 0x02A655 20:A645: C0        .byte $C0	; <ヅ>
- - - - - 0x02A656 20:A646: FF        .byte $FF
- - - - - 0x02A657 20:A647: 40        .byte $40	; <「>
- - - - - 0x02A658 20:A648: 00        .byte $00
- - - - - 0x02A659 20:A649: 00        .byte $00
off_A64A_51:
- D - I - 0x02A65A 20:A64A: 01        .byte $01	; <あ>
- D - I - 0x02A65B 20:A64B: 1E        .byte $1E	; <ほ>
- D - I - 0x02A65C 20:A64C: 80        .byte $80
- D - I - 0x02A65D 20:A64D: 07        .byte $07	; <き>
- D - I - 0x02A65E 20:A64E: 00        .byte $00
- D - I - 0x02A65F 20:A64F: 00        .byte $00
- - - - - 0x02A660 20:A650: 00        .byte $00
off_A651_52:
- D - I - 0x02A661 20:A651: 01        .byte $01	; <あ>
- D - I - 0x02A662 20:A652: 1E        .byte $1E	; <ほ>
- D - I - 0x02A663 20:A653: 80        .byte $80
- D - I - 0x02A664 20:A654: FF        .byte $FF
- D - I - 0x02A665 20:A655: 26        .byte $26	; <よ>
- D - I - 0x02A666 20:A656: 00        .byte $00
- - - - - 0x02A667 20:A657: 00        .byte $00
off_A658_53:
- D - I - 0x02A668 20:A658: 01        .byte $01	; <あ>
- D - I - 0x02A669 20:A659: 1E        .byte $1E	; <ほ>
- D - I - 0x02A66A 20:A65A: DA        .byte $DA
- D - I - 0x02A66B 20:A65B: FF        .byte $FF
- D - I - 0x02A66C 20:A65C: 26        .byte $26	; <よ>
- D - I - 0x02A66D 20:A65D: 00        .byte $00
- D - I - 0x02A66E 20:A65E: 00        .byte $00
off_A65F_54:
- D - I - 0x02A66F 20:A65F: 01        .byte $01	; <あ>
- D - I - 0x02A670 20:A660: 32        .byte $32	; <ょ>
- D - I - 0x02A671 20:A661: 00        .byte $00
- D - I - 0x02A672 20:A662: FD        .byte $FD
- D - I - 0x02A673 20:A663: 00        .byte $00
- D - I - 0x02A674 20:A664: 00        .byte $00
- - - - - 0x02A675 20:A665: 00        .byte $00
off_A666_55:
- - - - - 0x02A676 20:A666: 00        .byte $00
off_A667_56:
- - - - - 0x02A677 20:A667: 00        .byte $00
off_A668_57:
- - - - - 0x02A678 20:A668: 00        .byte $00
off_A669_58:
- - - - - 0x02A679 20:A669: 00        .byte $00
off_A66A_59:
- D - I - 0x02A67A 20:A66A: 01        .byte $01	; <あ>
- D - I - 0x02A67B 20:A66B: 1E        .byte $1E	; <ほ>
- D - I - 0x02A67C 20:A66C: AD        .byte $AD	; <で>
- D - I - 0x02A67D 20:A66D: FF        .byte $FF
- D - I - 0x02A67E 20:A66E: 26        .byte $26	; <よ>
- D - I - 0x02A67F 20:A66F: 00        .byte $00
- D - I - 0x02A680 20:A670: 01        .byte $01	; <あ>
- D - I - 0x02A681 20:A671: 3C        .byte $3C	; <9>
- D - I - 0x02A682 20:A672: 00        .byte $00
- D - I - 0x02A683 20:A673: 00        .byte $00
- D - I - 0x02A684 20:A674: 00        .byte $00
- D - I - 0x02A685 20:A675: 00        .byte $00
- D - I - 0x02A686 20:A676: 01        .byte $01	; <あ>
- D - I - 0x02A687 20:A677: 0A        .byte $0A	; <こ>
- D - I - 0x02A688 20:A678: 00        .byte $00
- D - I - 0x02A689 20:A679: FC        .byte $FC
- D - I - 0x02A68A 20:A67A: 00        .byte $00
- D - I - 0x02A68B 20:A67B: 04        .byte $04	; <え>
- - - - - 0x02A68C 20:A67C: 00        .byte $00
off_A67D_5A:
- D - I - 0x02A68D 20:A67D: 01        .byte $01	; <あ>
- D - I - 0x02A68E 20:A67E: 3C        .byte $3C	; <9>
- D - I - 0x02A68F 20:A67F: 55        .byte $55	; <ナ>
- D - I - 0x02A690 20:A680: 01        .byte $01	; <あ>
- D - I - 0x02A691 20:A681: DA        .byte $DA
- D - I - 0x02A692 20:A682: FF        .byte $FF
- D - I - 0x02A693 20:A683: 00        .byte $00
off_A684_5B:
- - - - - 0x02A694 20:A684: 01        .byte $01	; <あ>
- - - - - 0x02A695 20:A685: 0C        .byte $0C	; <し>
- - - - - 0x02A696 20:A686: 66        .byte $66	; <ヨ>
- - - - - 0x02A697 20:A687: 03        .byte $03	; <う>
- - - - - 0x02A698 20:A688: 33        .byte $33	; <0>
- - - - - 0x02A699 20:A689: 00        .byte $00
- - - - - 0x02A69A 20:A68A: 00        .byte $00
off_A68B_5C:
- - - - - 0x02A69B 20:A68B: 02        .byte $02	; <い>
- - - - - 0x02A69C 20:A68C: 28        .byte $28	; <り>
- - - - - 0x02A69D 20:A68D: 00        .byte $00
- - - - - 0x02A69E 20:A68E: 00        .byte $00
- - - - - 0x02A69F 20:A68F: 18        .byte $18	; <ね>
- - - - - 0x02A6A0 20:A690: 00        .byte $00
- - - - - 0x02A6A1 20:A691: 00        .byte $00
off_A692_5D:
- D - I - 0x02A6A2 20:A692: 01        .byte $01	; <あ>
- D - I - 0x02A6A3 20:A693: 3C        .byte $3C	; <9>
- D - I - 0x02A6A4 20:A694: DA        .byte $DA
- D - I - 0x02A6A5 20:A695: FF        .byte $FF
- D - I - 0x02A6A6 20:A696: ED        .byte $ED
- D - I - 0x02A6A7 20:A697: FF        .byte $FF
- D - I - 0x02A6A8 20:A698: 00        .byte $00
off_A699_5E:
- D - I - 0x02A6A9 20:A699: 01        .byte $01	; <あ>
- D - I - 0x02A6AA 20:A69A: 1E        .byte $1E	; <ほ>
- D - I - 0x02A6AB 20:A69B: DA        .byte $DA
- D - I - 0x02A6AC 20:A69C: FB        .byte $FB
- D - I - 0x02A6AD 20:A69D: 60        .byte $60	; <ミ>
- D - I - 0x02A6AE 20:A69E: 01        .byte $01	; <あ>
- D - I - 0x02A6AF 20:A69F: 00        .byte $00
off_A6A0_5F:
- D - I - 0x02A6B0 20:A6A0: 03        .byte $03	; <う>
- D - I - 0x02A6B1 20:A6A1: 28        .byte $28	; <り>
- D - I - 0x02A6B2 20:A6A2: C4        .byte $C4	; <ビ>
- D - I - 0x02A6B3 20:A6A3: 00        .byte $00
- D - I - 0x02A6B4 20:A6A4: 3C        .byte $3C	; <9>
- D - I - 0x02A6B5 20:A6A5: 00        .byte $00
- D - I - 0x02A6B6 20:A6A6: 48        .byte $48	; <ク>
- D - I - 0x02A6B7 20:A6A7: 00        .byte $00
- D - I - 0x02A6B8 20:A6A8: 0E        .byte $0E	; <せ>
- D - I - 0x02A6B9 20:A6A9: 00        .byte $00
- D - I - 0x02A6BA 20:A6AA: 00        .byte $00
off_A6AB_60:
- D - I - 0x02A6BB 20:A6AB: 03        .byte $03	; <う>
- D - I - 0x02A6BC 20:A6AC: 28        .byte $28	; <り>
- D - I - 0x02A6BD 20:A6AD: C4        .byte $C4	; <ビ>
- D - I - 0x02A6BE 20:A6AE: 00        .byte $00
- D - I - 0x02A6BF 20:A6AF: C4        .byte $C4	; <ビ>
- D - I - 0x02A6C0 20:A6B0: FF        .byte $FF
- D - I - 0x02A6C1 20:A6B1: 48        .byte $48	; <ク>
- D - I - 0x02A6C2 20:A6B2: 00        .byte $00
- D - I - 0x02A6C3 20:A6B3: F2        .byte $F2
- D - I - 0x02A6C4 20:A6B4: FF        .byte $FF
- D - I - 0x02A6C5 20:A6B5: 00        .byte $00
off_A6B6_61:
- D - I - 0x02A6C6 20:A6B6: 02        .byte $02	; <い>
- D - I - 0x02A6C7 20:A6B7: 1E        .byte $1E	; <ほ>
- D - I - 0x02A6C8 20:A6B8: 14        .byte $14	; <と>
- D - I - 0x02A6C9 20:A6B9: 00        .byte $00
- D - I - 0x02A6CA 20:A6BA: F4        .byte $F4
- D - I - 0x02A6CB 20:A6BB: FF        .byte $FF
- D - I - 0x02A6CC 20:A6BC: 03        .byte $03	; <う>
- D - I - 0x02A6CD 20:A6BD: 1E        .byte $1E	; <ほ>
- D - I - 0x02A6CE 20:A6BE: EF        .byte $EF
- D - I - 0x02A6CF 20:A6BF: FF        .byte $FF
- D - I - 0x02A6D0 20:A6C0: 80        .byte $80
- D - I - 0x02A6D1 20:A6C1: FC        .byte $FC
- D - I - 0x02A6D2 20:A6C2: 80        .byte $80
- D - I - 0x02A6D3 20:A6C3: FF        .byte $FF
- D - I - 0x02A6D4 20:A6C4: 17        .byte $17	; <ぬ>
- D - I - 0x02A6D5 20:A6C5: 00        .byte $00
- - - - - 0x02A6D6 20:A6C6: 00        .byte $00
off_A6C7_62:
- D - I - 0x02A6D7 20:A6C7: 01        .byte $01	; <あ>
- D - I - 0x02A6D8 20:A6C8: 14        .byte $14	; <と>
- D - I - 0x02A6D9 20:A6C9: C0        .byte $C0	; <ヅ>
- D - I - 0x02A6DA 20:A6CA: FD        .byte $FD
- D - I - 0x02A6DB 20:A6CB: 00        .byte $00
- D - I - 0x02A6DC 20:A6CC: 00        .byte $00
- - - - - 0x02A6DD 20:A6CD: 00        .byte $00
off_A6CE_63:
- D - I - 0x02A6DE 20:A6CE: 01        .byte $01	; <あ>
- D - I - 0x02A6DF 20:A6CF: 16        .byte $16	; <に>
- D - I - 0x02A6E0 20:A6D0: 80        .byte $80
- D - I - 0x02A6E1 20:A6D1: 03        .byte $03	; <う>
- D - I - 0x02A6E2 20:A6D2: 80        .byte $80
- D - I - 0x02A6E3 20:A6D3: 03        .byte $03	; <う>
- - - - - 0x02A6E4 20:A6D4: 00        .byte $00
off_A6D5_64:
- D - I - 0x02A6E5 20:A6D5: 01        .byte $01	; <あ>
- D - I - 0x02A6E6 20:A6D6: 14        .byte $14	; <と>
- D - I - 0x02A6E7 20:A6D7: 80        .byte $80
- D - I - 0x02A6E8 20:A6D8: FF        .byte $FF
- D - I - 0x02A6E9 20:A6D9: C0        .byte $C0	; <ヅ>
- D - I - 0x02A6EA 20:A6DA: FF        .byte $FF
- - - - - 0x02A6EB 20:A6DB: 00        .byte $00
off_A6DC_65:
- D - I - 0x02A6EC 20:A6DC: 01        .byte $01	; <あ>
- D - I - 0x02A6ED 20:A6DD: 14        .byte $14	; <と>
- D - I - 0x02A6EE 20:A6DE: 80        .byte $80
- D - I - 0x02A6EF 20:A6DF: 02        .byte $02	; <い>
- D - I - 0x02A6F0 20:A6E0: 40        .byte $40	; <「>
- D - I - 0x02A6F1 20:A6E1: 01        .byte $01	; <あ>
- - - - - 0x02A6F2 20:A6E2: 00        .byte $00
off_A6E3_66:
- D - I - 0x02A6F3 20:A6E3: 01        .byte $01	; <あ>
- D - I - 0x02A6F4 20:A6E4: 28        .byte $28	; <り>
- D - I - 0x02A6F5 20:A6E5: E0        .byte $E0
- D - I - 0x02A6F6 20:A6E6: FF        .byte $FF
- D - I - 0x02A6F7 20:A6E7: 20        .byte $20	; <み>
- D - I - 0x02A6F8 20:A6E8: 00        .byte $00
- - - - - 0x02A6F9 20:A6E9: 00        .byte $00
off_A6EA_67:
- D - I - 0x02A6FA 20:A6EA: 01        .byte $01	; <あ>
- D - I - 0x02A6FB 20:A6EB: 14        .byte $14	; <と>
- D - I - 0x02A6FC 20:A6EC: 40        .byte $40	; <「>
- D - I - 0x02A6FD 20:A6ED: 02        .byte $02	; <い>
- D - I - 0x02A6FE 20:A6EE: 00        .byte $00
- D - I - 0x02A6FF 20:A6EF: 00        .byte $00
- D - I - 0x02A700 20:A6F0: 00        .byte $00
off_A6F1_68:
- D - I - 0x02A701 20:A6F1: 01        .byte $01	; <あ>
- D - I - 0x02A702 20:A6F2: 14        .byte $14	; <と>
- D - I - 0x02A703 20:A6F3: DA        .byte $DA
- D - I - 0x02A704 20:A6F4: FF        .byte $FF
- D - I - 0x02A705 20:A6F5: 00        .byte $00
- D - I - 0x02A706 20:A6F6: 00        .byte $00
- D - I - 0x02A707 20:A6F7: 00        .byte $00
off_A6F8_69:
- D - I - 0x02A708 20:A6F8: 01        .byte $01	; <あ>
- D - I - 0x02A709 20:A6F9: 32        .byte $32	; <ょ>
- D - I - 0x02A70A 20:A6FA: 78        .byte $78	; <?>
- D - I - 0x02A70B 20:A6FB: FF        .byte $FF
- D - I - 0x02A70C 20:A6FC: 3C        .byte $3C	; <9>
- D - I - 0x02A70D 20:A6FD: FF        .byte $FF
- - - - - 0x02A70E 20:A6FE: 00        .byte $00
off_A6FF_6A:
- D - I - 0x02A70F 20:A6FF: 01        .byte $01	; <あ>
- D - I - 0x02A710 20:A700: 32        .byte $32	; <ょ>
- D - I - 0x02A711 20:A701: 80        .byte $80
- D - I - 0x02A712 20:A702: FF        .byte $FF
- D - I - 0x02A713 20:A703: 00        .byte $00
- D - I - 0x02A714 20:A704: 00        .byte $00
- - - - - 0x02A715 20:A705: 00        .byte $00
off_A706_6B:
- D - I - 0x02A716 20:A706: 01        .byte $01	; <あ>
- D - I - 0x02A717 20:A707: 32        .byte $32	; <ょ>
- D - I - 0x02A718 20:A708: 32        .byte $32	; <ょ>
- D - I - 0x02A719 20:A709: 00        .byte $00
- D - I - 0x02A71A 20:A70A: F8        .byte $F8
- D - I - 0x02A71B 20:A70B: FF        .byte $FF
- - - - - 0x02A71C 20:A70C: 00        .byte $00
off_A70D_6C:
- D - I - 0x02A71D 20:A70D: 01        .byte $01	; <あ>
- D - I - 0x02A71E 20:A70E: 32        .byte $32	; <ょ>
- D - I - 0x02A71F 20:A70F: F5        .byte $F5
- D - I - 0x02A720 20:A710: 00        .byte $00
- D - I - 0x02A721 20:A711: 2F        .byte $2F	; <っ>
- D - I - 0x02A722 20:A712: FF        .byte $FF
- - - - - 0x02A723 20:A713: 00        .byte $00
off_A714_6D:
- D - I - 0x02A724 20:A714: 01        .byte $01	; <あ>
- D - I - 0x02A725 20:A715: 32        .byte $32	; <ょ>
- D - I - 0x02A726 20:A716: 0B        .byte $0B	; <さ>
- D - I - 0x02A727 20:A717: FF        .byte $FF
- D - I - 0x02A728 20:A718: 39        .byte $39	; <6>
- D - I - 0x02A729 20:A719: FF        .byte $FF
- - - - - 0x02A72A 20:A71A: 00        .byte $00
off_A71B_6E:
- D - I - 0x02A72B 20:A71B: 01        .byte $01	; <あ>
- D - I - 0x02A72C 20:A71C: 32        .byte $32	; <ょ>
- D - I - 0x02A72D 20:A71D: 00        .byte $00
- D - I - 0x02A72E 20:A71E: 00        .byte $00
- D - I - 0x02A72F 20:A71F: 2F        .byte $2F	; <っ>
- D - I - 0x02A730 20:A720: FF        .byte $FF
- - - - - 0x02A731 20:A721: 00        .byte $00
off_A722_6F:
- - - - - 0x02A732 20:A722: 00        .byte $00
off_A723_70:
off_A723:
- D - I - 0x02A733 20:A723: 01        .byte $01	; <あ>
- D - I - 0x02A734 20:A724: EF        .byte $EF
- D - I - 0x02A735 20:A725: 26        .byte $26	; <よ>
- D - I - 0x02A736 20:A726: 00        .byte $00
- D - I - 0x02A737 20:A727: 00        .byte $00
- D - I - 0x02A738 20:A728: 00        .byte $00
- D - I - 0x02A739 20:A729: 04        .byte $04	; <え>
- D - I - 0x02A73A 20:A72A: 23 A7     .word off_A723
off_A72C_71:
off_A72C:
- D - I - 0x02A73C 20:A72C: 01        .byte $01	; <あ>
- D - I - 0x02A73D 20:A72D: A0        .byte $A0	; <が>
- D - I - 0x02A73E 20:A72E: 40        .byte $40	; <「>
- D - I - 0x02A73F 20:A72F: 00        .byte $00
- D - I - 0x02A740 20:A730: 00        .byte $00
- D - I - 0x02A741 20:A731: 00        .byte $00
- D - I - 0x02A742 20:A732: 04        .byte $04	; <え>
- D - I - 0x02A743 20:A733: 2C A7     .word off_A72C
off_A735_72:
- D - I - 0x02A745 20:A735: 01        .byte $01	; <あ>
- D - I - 0x02A746 20:A736: 04        .byte $04	; <え>
- D - I - 0x02A747 20:A737: 00        .byte $00
- D - I - 0x02A748 20:A738: F8        .byte $F8
- D - I - 0x02A749 20:A739: 00        .byte $00
- D - I - 0x02A74A 20:A73A: 00        .byte $00
- D - I - 0x02A74B 20:A73B: 01        .byte $01	; <あ>
- D - I - 0x02A74C 20:A73C: 04        .byte $04	; <え>
- D - I - 0x02A74D 20:A73D: 00        .byte $00
- D - I - 0x02A74E 20:A73E: 08        .byte $08	; <く>
- D - I - 0x02A74F 20:A73F: 00        .byte $00
- D - I - 0x02A750 20:A740: 00        .byte $00
- D - I - 0x02A751 20:A741: 00        .byte $00
off_A742_73:
- D - I - 0x02A752 20:A742: 02        .byte $02	; <い>
- D - I - 0x02A753 20:A743: 28        .byte $28	; <り>
- D - I - 0x02A754 20:A744: 30        .byte $30	; <ゃ>
- D - I - 0x02A755 20:A745: 00        .byte $00
- D - I - 0x02A756 20:A746: 00        .byte $00
- D - I - 0x02A757 20:A747: 00        .byte $00
- D - I - 0x02A758 20:A748: 00        .byte $00
off_A749_74:
- - - - - 0x02A759 20:A749: 01        .byte $01	; <あ>
- - - - - 0x02A75A 20:A74A: 14        .byte $14	; <と>
- - - - - 0x02A75B 20:A74B: 40        .byte $40	; <「>
- - - - - 0x02A75C 20:A74C: 06        .byte $06	; <か>
- - - - - 0x02A75D 20:A74D: 80        .byte $80
- - - - - 0x02A75E 20:A74E: FB        .byte $FB
- - - - - 0x02A75F 20:A74F: 00        .byte $00
off_A750_75:
- D - I - 0x02A760 20:A750: 03        .byte $03	; <う>
- D - I - 0x02A761 20:A751: 3C        .byte $3C	; <9>
- D - I - 0x02A762 20:A752: DE        .byte $DE
- D - I - 0x02A763 20:A753: FD        .byte $FD
- D - I - 0x02A764 20:A754: 74        .byte $74	; <ィ>
- D - I - 0x02A765 20:A755: FF        .byte $FF
- D - I - 0x02A766 20:A756: 20        .byte $20	; <み>
- D - I - 0x02A767 20:A757: 00        .byte $00
- D - I - 0x02A768 20:A758: 00        .byte $00
- D - I - 0x02A769 20:A759: 00        .byte $00
- D - I - 0x02A76A 20:A75A: 00        .byte $00
off_A75B_76:
- D - I - 0x02A76B 20:A75B: 01        .byte $01	; <あ>
- D - I - 0x02A76C 20:A75C: 14        .byte $14	; <と>
- D - I - 0x02A76D 20:A75D: 40        .byte $40	; <「>
- D - I - 0x02A76E 20:A75E: 06        .byte $06	; <か>
- D - I - 0x02A76F 20:A75F: 80        .byte $80
- D - I - 0x02A770 20:A760: FB        .byte $FB
- D - I - 0x02A771 20:A761: 00        .byte $00
off_A762_77:
- D - I - 0x02A772 20:A762: 03        .byte $03	; <う>
- D - I - 0x02A773 20:A763: 3C        .byte $3C	; <9>
- D - I - 0x02A774 20:A764: 00        .byte $00
- D - I - 0x02A775 20:A765: FF        .byte $FF
- D - I - 0x02A776 20:A766: 60        .byte $60	; <ミ>
- D - I - 0x02A777 20:A767: FC        .byte $FC
- D - I - 0x02A778 20:A768: F6        .byte $F6
- D - I - 0x02A779 20:A769: FF        .byte $FF
- D - I - 0x02A77A 20:A76A: 14        .byte $14	; <と>
- D - I - 0x02A77B 20:A76B: 00        .byte $00
- D - I - 0x02A77C 20:A76C: 00        .byte $00
off_A76D_78:
- - - - - 0x02A77D 20:A76D: 00        .byte $00
off_A76E_79:
- - - - - 0x02A77E 20:A76E: 00        .byte $00
off_A76F_7A:
- D - I - 0x02A77F 20:A76F: 03        .byte $03	; <う>
- D - I - 0x02A780 20:A770: 62        .byte $62	; <メ>
- D - I - 0x02A781 20:A771: 49        .byte $49	; <ケ>
- D - I - 0x02A782 20:A772: 02        .byte $02	; <い>
- D - I - 0x02A783 20:A773: 03        .byte $03	; <う>
- D - I - 0x02A784 20:A774: FF        .byte $FF
- D - I - 0x02A785 20:A775: FD        .byte $FD
- D - I - 0x02A786 20:A776: FF        .byte $FF
- D - I - 0x02A787 20:A777: 03        .byte $03	; <う>
- D - I - 0x02A788 20:A778: 00        .byte $00
- D - I - 0x02A789 20:A779: 00        .byte $00
off_A77A_7B:
- - - - - 0x02A78A 20:A77A: 03        .byte $03	; <う>
- - - - - 0x02A78B 20:A77B: 1E        .byte $1E	; <ほ>
- - - - - 0x02A78C 20:A77C: F7        .byte $F7
- - - - - 0x02A78D 20:A77D: 02        .byte $02	; <い>
- - - - - 0x02A78E 20:A77E: 12        .byte $12	; <つ>
- - - - - 0x02A78F 20:A77F: F9        .byte $F9
- - - - - 0x02A790 20:A780: 00        .byte $00
- - - - - 0x02A791 20:A781: 00        .byte $00
- - - - - 0x02A792 20:A782: 48        .byte $48	; <ク>
- - - - - 0x02A793 20:A783: 00        .byte $00
- - - - - 0x02A794 20:A784: 03        .byte $03	; <う>
- - - - - 0x02A795 20:A785: 1E        .byte $1E	; <ほ>
- - - - - 0x02A796 20:A786: 19        .byte $19	; <の>
- - - - - 0x02A797 20:A787: 02        .byte $02	; <い>
- - - - - 0x02A798 20:A788: 19        .byte $19	; <の>
- - - - - 0x02A799 20:A789: 01        .byte $01	; <あ>
- - - - - 0x02A79A 20:A78A: FC        .byte $FC
- - - - - 0x02A79B 20:A78B: FF        .byte $FF
- - - - - 0x02A79C 20:A78C: 04        .byte $04	; <え>
- - - - - 0x02A79D 20:A78D: 00        .byte $00
- - - - - 0x02A79E 20:A78E: 00        .byte $00
off_A78F_7C:
- D - I - 0x02A79F 20:A78F: 03        .byte $03	; <う>
- D - I - 0x02A7A0 20:A790: 30        .byte $30	; <ゃ>
- D - I - 0x02A7A1 20:A791: C6        .byte $C6	; <ベ>
- D - I - 0x02A7A2 20:A792: 01        .byte $01	; <あ>
- D - I - 0x02A7A3 20:A793: 00        .byte $00
- D - I - 0x02A7A4 20:A794: 00        .byte $00
- D - I - 0x02A7A5 20:A795: 18        .byte $18	; <ね>
- D - I - 0x02A7A6 20:A796: 00        .byte $00
- D - I - 0x02A7A7 20:A797: 0A        .byte $0A	; <こ>
- D - I - 0x02A7A8 20:A798: 00        .byte $00
- - - - - 0x02A7A9 20:A799: 00        .byte $00
off_A79A_7D:
- - - - - 0x02A7AA 20:A79A: 00        .byte $00
off_A79B_7E:
- D - I - 0x02A7AB 20:A79B: 03        .byte $03	; <う>
- D - I - 0x02A7AC 20:A79C: 32        .byte $32	; <ょ>
- D - I - 0x02A7AD 20:A79D: D1        .byte $D1	; <ポ>
- D - I - 0x02A7AE 20:A79E: 00        .byte $00
- D - I - 0x02A7AF 20:A79F: CD        .byte $CD	; <パ>
- D - I - 0x02A7B0 20:A7A0: FC        .byte $FC
- D - I - 0x02A7B1 20:A7A1: 04        .byte $04	; <え>
- D - I - 0x02A7B2 20:A7A2: 00        .byte $00
- D - I - 0x02A7B3 20:A7A3: 28        .byte $28	; <り>
- D - I - 0x02A7B4 20:A7A4: 00        .byte $00
- D - I - 0x02A7B5 20:A7A5: 00        .byte $00
off_A7A6_7F:
- - - - - 0x02A7B6 20:A7A6: 03        .byte $03	; <う>
- - - - - 0x02A7B7 20:A7A7: 32        .byte $32	; <ょ>
- - - - - 0x02A7B8 20:A7A8: 9A        .byte $9A
- - - - - 0x02A7B9 20:A7A9: F9        .byte $F9
- - - - - 0x02A7BA 20:A7AA: FA        .byte $FA
- - - - - 0x02A7BB 20:A7AB: 00        .byte $00
- - - - - 0x02A7BC 20:A7AC: 1A        .byte $1A	; <は>
- - - - - 0x02A7BD 20:A7AD: 00        .byte $00
- - - - - 0x02A7BE 20:A7AE: 00        .byte $00
- - - - - 0x02A7BF 20:A7AF: 00        .byte $00
- - - - - 0x02A7C0 20:A7B0: 00        .byte $00
off_A7B1_80:
- D - I - 0x02A7C1 20:A7B1: 03        .byte $03	; <う>
- D - I - 0x02A7C2 20:A7B2: 32        .byte $32	; <ょ>
- D - I - 0x02A7C3 20:A7B3: 00        .byte $00
- D - I - 0x02A7C4 20:A7B4: 00        .byte $00
- D - I - 0x02A7C5 20:A7B5: 05        .byte $05	; <お>
- D - I - 0x02A7C6 20:A7B6: 03        .byte $03	; <う>
- D - I - 0x02A7C7 20:A7B7: 08        .byte $08	; <く>
- D - I - 0x02A7C8 20:A7B8: 00        .byte $00
- D - I - 0x02A7C9 20:A7B9: F0        .byte $F0
- D - I - 0x02A7CA 20:A7BA: FF        .byte $FF
- D - I - 0x02A7CB 20:A7BB: 00        .byte $00
off_A7BC_81:
- D - I - 0x02A7CC 20:A7BC: 03        .byte $03	; <う>
- D - I - 0x02A7CD 20:A7BD: 32        .byte $32	; <ょ>
- D - I - 0x02A7CE 20:A7BE: C7        .byte $C7	; <ボ>
- D - I - 0x02A7CF 20:A7BF: 00        .byte $00
- D - I - 0x02A7D0 20:A7C0: AF        .byte $AF	; <ば>
- D - I - 0x02A7D1 20:A7C1: FB        .byte $FB
- D - I - 0x02A7D2 20:A7C2: 06        .byte $06	; <か>
- D - I - 0x02A7D3 20:A7C3: 00        .byte $00
- D - I - 0x02A7D4 20:A7C4: 1E        .byte $1E	; <ほ>
- D - I - 0x02A7D5 20:A7C5: 00        .byte $00
- D - I - 0x02A7D6 20:A7C6: 00        .byte $00
off_A7C7_82:
- - - - - 0x02A7D7 20:A7C7: 03        .byte $03	; <う>
- - - - - 0x02A7D8 20:A7C8: 32        .byte $32	; <ょ>
- - - - - 0x02A7D9 20:A7C9: 14        .byte $14	; <と>
- - - - - 0x02A7DA 20:A7CA: 02        .byte $02	; <い>
- - - - - 0x02A7DB 20:A7CB: DD        .byte $DD
- - - - - 0x02A7DC 20:A7CC: FE        .byte $FE
- - - - - 0x02A7DD 20:A7CD: 10        .byte $10	; <た>
- - - - - 0x02A7DE 20:A7CE: 00        .byte $00
- - - - - 0x02A7DF 20:A7CF: 10        .byte $10	; <た>
- - - - - 0x02A7E0 20:A7D0: 00        .byte $00
- - - - - 0x02A7E1 20:A7D1: 00        .byte $00
off_A7D2_83:
- D - I - 0x02A7E2 20:A7D2: 03        .byte $03	; <う>
- D - I - 0x02A7E3 20:A7D3: 32        .byte $32	; <ょ>
- D - I - 0x02A7E4 20:A7D4: FA        .byte $FA
- D - I - 0x02A7E5 20:A7D5: 00        .byte $00
- D - I - 0x02A7E6 20:A7D6: A4        .byte $A4	; <ご>
- D - I - 0x02A7E7 20:A7D7: FC        .byte $FC
- D - I - 0x02A7E8 20:A7D8: 08        .byte $08	; <く>
- D - I - 0x02A7E9 20:A7D9: 00        .byte $00
- D - I - 0x02A7EA 20:A7DA: 28        .byte $28	; <り>
- D - I - 0x02A7EB 20:A7DB: 00        .byte $00
- - - - - 0x02A7EC 20:A7DC: 00        .byte $00
off_A7DD_84:
- D - I - 0x02A7ED 20:A7DD: 03        .byte $03	; <う>
- D - I - 0x02A7EE 20:A7DE: 14        .byte $14	; <と>
- D - I - 0x02A7EF 20:A7DF: CC        .byte $CC	; <ぽ>
- D - I - 0x02A7F0 20:A7E0: 00        .byte $00
- D - I - 0x02A7F1 20:A7E1: 59        .byte $59	; <ノ>
- D - I - 0x02A7F2 20:A7E2: 04        .byte $04	; <え>
- D - I - 0x02A7F3 20:A7E3: 00        .byte $00
- D - I - 0x02A7F4 20:A7E4: 00        .byte $00
- D - I - 0x02A7F5 20:A7E5: 40        .byte $40	; <「>
- D - I - 0x02A7F6 20:A7E6: 00        .byte $00
- D - I - 0x02A7F7 20:A7E7: 03        .byte $03	; <う>
- D - I - 0x02A7F8 20:A7E8: 1E        .byte $1E	; <ほ>
- D - I - 0x02A7F9 20:A7E9: 3B        .byte $3B	; <8>
- D - I - 0x02A7FA 20:A7EA: 00        .byte $00
- D - I - 0x02A7FB 20:A7EB: 2B        .byte $2B	; <ろ>
- D - I - 0x02A7FC 20:A7EC: FA        .byte $FA
- D - I - 0x02A7FD 20:A7ED: 00        .byte $00
- D - I - 0x02A7FE 20:A7EE: 00        .byte $00
- D - I - 0x02A7FF 20:A7EF: 58        .byte $58	; <ネ>
- D - I - 0x02A800 20:A7F0: 00        .byte $00
- D - I - 0x02A801 20:A7F1: 03        .byte $03	; <う>
- D - I - 0x02A802 20:A7F2: 1E        .byte $1E	; <ほ>
- D - I - 0x02A803 20:A7F3: 19        .byte $19	; <の>
- D - I - 0x02A804 20:A7F4: 00        .byte $00
- D - I - 0x02A805 20:A7F5: 30        .byte $30	; <ゃ>
- D - I - 0x02A806 20:A7F6: FD        .byte $FD
- D - I - 0x02A807 20:A7F7: 00        .byte $00
- D - I - 0x02A808 20:A7F8: 00        .byte $00
- D - I - 0x02A809 20:A7F9: 2A        .byte $2A	; <れ>
- D - I - 0x02A80A 20:A7FA: 00        .byte $00
- D - I - 0x02A80B 20:A7FB: 00        .byte $00
off_A7FC_85:
- D - I - 0x02A80C 20:A7FC: 03        .byte $03	; <う>
- D - I - 0x02A80D 20:A7FD: 14        .byte $14	; <と>
- D - I - 0x02A80E 20:A7FE: 0C        .byte $0C	; <し>
- D - I - 0x02A80F 20:A7FF: 08        .byte $08	; <く>
- D - I - 0x02A810 20:A800: 26        .byte $26	; <よ>
- D - I - 0x02A811 20:A801: 01        .byte $01	; <あ>
- D - I - 0x02A812 20:A802: 00        .byte $00
- D - I - 0x02A813 20:A803: 00        .byte $00
- D - I - 0x02A814 20:A804: 50        .byte $50	; <タ>
- D - I - 0x02A815 20:A805: 00        .byte $00
- D - I - 0x02A816 20:A806: 03        .byte $03	; <う>
- D - I - 0x02A817 20:A807: 1E        .byte $1E	; <ほ>
- D - I - 0x02A818 20:A808: D5        .byte $D5
- D - I - 0x02A819 20:A809: 05        .byte $05	; <お>
- D - I - 0x02A81A 20:A80A: 6F        .byte $6F	; <ッ>
- D - I - 0x02A81B 20:A80B: FA        .byte $FA
- D - I - 0x02A81C 20:A80C: 00        .byte $00
- D - I - 0x02A81D 20:A80D: 00        .byte $00
- D - I - 0x02A81E 20:A80E: 40        .byte $40	; <「>
- D - I - 0x02A81F 20:A80F: 00        .byte $00
- D - I - 0x02A820 20:A810: 00        .byte $00
off_A811_86:
- D - I - 0x02A821 20:A811: 03        .byte $03	; <う>
- D - I - 0x02A822 20:A812: 3C        .byte $3C	; <9>
- D - I - 0x02A823 20:A813: F3        .byte $F3
- D - I - 0x02A824 20:A814: 00        .byte $00
- D - I - 0x02A825 20:A815: 00        .byte $00
- D - I - 0x02A826 20:A816: 00        .byte $00
- D - I - 0x02A827 20:A817: 10        .byte $10	; <た>
- D - I - 0x02A828 20:A818: 00        .byte $00
- D - I - 0x02A829 20:A819: 06        .byte $06	; <か>
- D - I - 0x02A82A 20:A81A: 00        .byte $00
- - - - - 0x02A82B 20:A81B: 00        .byte $00
off_A81C_87:
- D - I - 0x02A82C 20:A81C: 02        .byte $02	; <い>
- D - I - 0x02A82D 20:A81D: 1E        .byte $1E	; <ほ>
- D - I - 0x02A82E 20:A81E: 14        .byte $14	; <と>
- D - I - 0x02A82F 20:A81F: 00        .byte $00
- D - I - 0x02A830 20:A820: F4        .byte $F4
- D - I - 0x02A831 20:A821: FF        .byte $FF
- D - I - 0x02A832 20:A822: 03        .byte $03	; <う>
- D - I - 0x02A833 20:A823: 1E        .byte $1E	; <ほ>
- D - I - 0x02A834 20:A824: 00        .byte $00
- D - I - 0x02A835 20:A825: 00        .byte $00
- D - I - 0x02A836 20:A826: 9A        .byte $9A
- D - I - 0x02A837 20:A827: FE        .byte $FE
- D - I - 0x02A838 20:A828: C8        .byte $C8	; <ぱ>
- D - I - 0x02A839 20:A829: FF        .byte $FF
- D - I - 0x02A83A 20:A82A: FC        .byte $FC
- D - I - 0x02A83B 20:A82B: FF        .byte $FF
- D - I - 0x02A83C 20:A82C: 00        .byte $00
off_A82D_88:
- D - I - 0x02A83D 20:A82D: 03        .byte $03	; <う>
- D - I - 0x02A83E 20:A82E: 28        .byte $28	; <り>
- D - I - 0x02A83F 20:A82F: 6D        .byte $6D	; <ヲ>
- D - I - 0x02A840 20:A830: FD        .byte $FD
- D - I - 0x02A841 20:A831: A0        .byte $A0	; <が>
- D - I - 0x02A842 20:A832: FD        .byte $FD
- D - I - 0x02A843 20:A833: 18        .byte $18	; <ね>
- D - I - 0x02A844 20:A834: 00        .byte $00
- D - I - 0x02A845 20:A835: 10        .byte $10	; <た>
- D - I - 0x02A846 20:A836: 00        .byte $00
- D - I - 0x02A847 20:A837: 02        .byte $02	; <い>
- D - I - 0x02A848 20:A838: 14        .byte $14	; <と>
- D - I - 0x02A849 20:A839: A0        .byte $A0	; <が>
- D - I - 0x02A84A 20:A83A: 00        .byte $00
- D - I - 0x02A84B 20:A83B: 50        .byte $50	; <タ>
- D - I - 0x02A84C 20:A83C: 00        .byte $00
- - - - - 0x02A84D 20:A83D: 00        .byte $00
off_A83E_89:
- D - I - 0x02A84E 20:A83E: 03        .byte $03	; <う>
- D - I - 0x02A84F 20:A83F: 1E        .byte $1E	; <ほ>
- D - I - 0x02A850 20:A840: 80        .byte $80
- D - I - 0x02A851 20:A841: 02        .byte $02	; <い>
- D - I - 0x02A852 20:A842: 80        .byte $80
- D - I - 0x02A853 20:A843: 06        .byte $06	; <か>
- D - I - 0x02A854 20:A844: 00        .byte $00
- D - I - 0x02A855 20:A845: 00        .byte $00
- D - I - 0x02A856 20:A846: D0        .byte $D0	; <ペ>
- D - I - 0x02A857 20:A847: FF        .byte $FF
- - - - - 0x02A858 20:A848: 00        .byte $00
off_A849_8A:
- D - I - 0x02A859 20:A849: 02        .byte $02	; <い>
- D - I - 0x02A85A 20:A84A: 32        .byte $32	; <ょ>
- D - I - 0x02A85B 20:A84B: 00        .byte $00
- D - I - 0x02A85C 20:A84C: 00        .byte $00
- D - I - 0x02A85D 20:A84D: E8        .byte $E8
- D - I - 0x02A85E 20:A84E: FF        .byte $FF
- - - - - 0x02A85F 20:A84F: 00        .byte $00
off_A850_8B:
- D - I - 0x02A860 20:A850: 01        .byte $01	; <あ>
- D - I - 0x02A861 20:A851: 28        .byte $28	; <り>
- D - I - 0x02A862 20:A852: A0        .byte $A0	; <が>
- D - I - 0x02A863 20:A853: FC        .byte $FC
- D - I - 0x02A864 20:A854: 20        .byte $20	; <み>
- D - I - 0x02A865 20:A855: 00        .byte $00
- D - I - 0x02A866 20:A856: 00        .byte $00
off_A857_8C:
- D - I - 0x02A867 20:A857: 01        .byte $01	; <あ>
- D - I - 0x02A868 20:A858: 3C        .byte $3C	; <9>
- D - I - 0x02A869 20:A859: C0        .byte $C0	; <ヅ>
- D - I - 0x02A86A 20:A85A: FD        .byte $FD
- D - I - 0x02A86B 20:A85B: 13        .byte $13	; <て>
- D - I - 0x02A86C 20:A85C: 00        .byte $00
- D - I - 0x02A86D 20:A85D: 00        .byte $00
off_A85E_8D:
- D - I - 0x02A86E 20:A85E: 02        .byte $02	; <い>
- D - I - 0x02A86F 20:A85F: 32        .byte $32	; <ょ>
- D - I - 0x02A870 20:A860: 44        .byte $44	; <エ>
- D - I - 0x02A871 20:A861: 00        .byte $00
- D - I - 0x02A872 20:A862: 00        .byte $00
- D - I - 0x02A873 20:A863: 00        .byte $00
- D - I - 0x02A874 20:A864: 00        .byte $00
off_A865_8E:
- D - I - 0x02A875 20:A865: 01        .byte $01	; <あ>
- D - I - 0x02A876 20:A866: 0A        .byte $0A	; <こ>
- D - I - 0x02A877 20:A867: 30        .byte $30	; <ゃ>
- D - I - 0x02A878 20:A868: 00        .byte $00
- D - I - 0x02A879 20:A869: 00        .byte $00
- D - I - 0x02A87A 20:A86A: 00        .byte $00
- D - I - 0x02A87B 20:A86B: 00        .byte $00
off_A86C_8F:
- D - I - 0x02A87C 20:A86C: 01        .byte $01	; <あ>
- D - I - 0x02A87D 20:A86D: 3C        .byte $3C	; <9>
- D - I - 0x02A87E 20:A86E: 48        .byte $48	; <ク>
- D - I - 0x02A87F 20:A86F: 02        .byte $02	; <い>
- D - I - 0x02A880 20:A870: 77        .byte $77	; <:>
- D - I - 0x02A881 20:A871: 00        .byte $00
- - - - - 0x02A882 20:A872: 00        .byte $00
off_A873_90:
- D - I - 0x02A883 20:A873: 01        .byte $01	; <あ>
- D - I - 0x02A884 20:A874: 14        .byte $14	; <と>
- D - I - 0x02A885 20:A875: E0        .byte $E0
- D - I - 0x02A886 20:A876: FE        .byte $FE
- D - I - 0x02A887 20:A877: 80        .byte $80
- D - I - 0x02A888 20:A878: FA        .byte $FA
- D - I - 0x02A889 20:A879: 00        .byte $00
off_A87A_91:
- D - I - 0x02A88A 20:A87A: 03        .byte $03	; <う>
- D - I - 0x02A88B 20:A87B: 3C        .byte $3C	; <9>
- D - I - 0x02A88C 20:A87C: D2        .byte $D2
- D - I - 0x02A88D 20:A87D: FC        .byte $FC
- D - I - 0x02A88E 20:A87E: 45        .byte $45	; <オ>
- D - I - 0x02A88F 20:A87F: FC        .byte $FC
- D - I - 0x02A890 20:A880: 2A        .byte $2A	; <れ>
- D - I - 0x02A891 20:A881: 00        .byte $00
- D - I - 0x02A892 20:A882: 1A        .byte $1A	; <は>
- D - I - 0x02A893 20:A883: 00        .byte $00
- - - - - 0x02A894 20:A884: 00        .byte $00
off_A885_92:
- D - I - 0x02A895 20:A885: 01        .byte $01	; <あ>
- D - I - 0x02A896 20:A886: 14        .byte $14	; <と>
- D - I - 0x02A897 20:A887: 67        .byte $67	; <ラ>
- D - I - 0x02A898 20:A888: FE        .byte $FE
- D - I - 0x02A899 20:A889: C0        .byte $C0	; <ヅ>
- D - I - 0x02A89A 20:A88A: 02        .byte $02	; <い>
- D - I - 0x02A89B 20:A88B: 01        .byte $01	; <あ>
- D - I - 0x02A89C 20:A88C: 14        .byte $14	; <と>
- D - I - 0x02A89D 20:A88D: C0        .byte $C0	; <ヅ>
- D - I - 0x02A89E 20:A88E: 0C        .byte $0C	; <し>
- D - I - 0x02A89F 20:A88F: B3        .byte $B3	; <ぼ>
- D - I - 0x02A8A0 20:A890: 03        .byte $03	; <う>
- D - I - 0x02A8A1 20:A891: 00        .byte $00
off_A892_93:
- D - I - 0x02A8A2 20:A892: 03        .byte $03	; <う>
- D - I - 0x02A8A3 20:A893: 1E        .byte $1E	; <ほ>
- D - I - 0x02A8A4 20:A894: 00        .byte $00
- D - I - 0x02A8A5 20:A895: 08        .byte $08	; <く>
- D - I - 0x02A8A6 20:A896: 1A        .byte $1A	; <は>
- D - I - 0x02A8A7 20:A897: FE        .byte $FE
- D - I - 0x02A8A8 20:A898: 80        .byte $80
- D - I - 0x02A8A9 20:A899: FF        .byte $FF
- D - I - 0x02A8AA 20:A89A: 30        .byte $30	; <ゃ>
- D - I - 0x02A8AB 20:A89B: 00        .byte $00
- D - I - 0x02A8AC 20:A89C: 03        .byte $03	; <う>
- D - I - 0x02A8AD 20:A89D: 1E        .byte $1E	; <ほ>
- D - I - 0x02A8AE 20:A89E: 78        .byte $78	; <?>
- D - I - 0x02A8AF 20:A89F: FB        .byte $FB
- D - I - 0x02A8B0 20:A8A0: 33        .byte $33	; <0>
- D - I - 0x02A8B1 20:A8A1: 03        .byte $03	; <う>
- D - I - 0x02A8B2 20:A8A2: A8        .byte $A8	; <ぜ>
- D - I - 0x02A8B3 20:A8A3: 00        .byte $00
- D - I - 0x02A8B4 20:A8A4: D0        .byte $D0	; <ペ>
- D - I - 0x02A8B5 20:A8A5: FF        .byte $FF
- - - - - 0x02A8B6 20:A8A6: 00        .byte $00
off_A8A7_94:
- D - I - 0x02A8B7 20:A8A7: 02        .byte $02	; <い>
- D - I - 0x02A8B8 20:A8A8: 14        .byte $14	; <と>
- D - I - 0x02A8B9 20:A8A9: A0        .byte $A0	; <が>
- D - I - 0x02A8BA 20:A8AA: 00        .byte $00
- D - I - 0x02A8BB 20:A8AB: C0        .byte $C0	; <ヅ>
- D - I - 0x02A8BC 20:A8AC: FF        .byte $FF
- D - I - 0x02A8BD 20:A8AD: 03        .byte $03	; <う>
- D - I - 0x02A8BE 20:A8AE: 16        .byte $16	; <に>
- D - I - 0x02A8BF 20:A8AF: 80        .byte $80
- D - I - 0x02A8C0 20:A8B0: 03        .byte $03	; <う>
- D - I - 0x02A8C1 20:A8B1: 0C        .byte $0C	; <し>
- D - I - 0x02A8C2 20:A8B2: 00        .byte $00
- D - I - 0x02A8C3 20:A8B3: 40        .byte $40	; <「>
- D - I - 0x02A8C4 20:A8B4: 00        .byte $00
- D - I - 0x02A8C5 20:A8B5: 40        .byte $40	; <「>
- D - I - 0x02A8C6 20:A8B6: 00        .byte $00
- D - I - 0x02A8C7 20:A8B7: 00        .byte $00
off_A8B8_95:
- D - I - 0x02A8C8 20:A8B8: 01        .byte $01	; <あ>
- D - I - 0x02A8C9 20:A8B9: 14        .byte $14	; <と>
- D - I - 0x02A8CA 20:A8BA: C0        .byte $C0	; <ヅ>
- D - I - 0x02A8CB 20:A8BB: F9        .byte $F9
- D - I - 0x02A8CC 20:A8BC: 80        .byte $80
- D - I - 0x02A8CD 20:A8BD: FB        .byte $FB
- D - I - 0x02A8CE 20:A8BE: 00        .byte $00
off_A8BF_96:
- - - - - 0x02A8CF 20:A8BF: 03        .byte $03	; <う>
- - - - - 0x02A8D0 20:A8C0: 28        .byte $28	; <り>
- - - - - 0x02A8D1 20:A8C1: F9        .byte $F9
- - - - - 0x02A8D2 20:A8C2: 01        .byte $01	; <あ>
- - - - - 0x02A8D3 20:A8C3: CC        .byte $CC	; <ぽ>
- - - - - 0x02A8D4 20:A8C4: 02        .byte $02	; <い>
- - - - - 0x02A8D5 20:A8C5: FA        .byte $FA
- - - - - 0x02A8D6 20:A8C6: FF        .byte $FF
- - - - - 0x02A8D7 20:A8C7: F8        .byte $F8
- - - - - 0x02A8D8 20:A8C8: FF        .byte $FF
- - - - - 0x02A8D9 20:A8C9: 00        .byte $00
off_A8CA_97:
- D - I - 0x02A8DA 20:A8CA: 02        .byte $02	; <い>
- D - I - 0x02A8DB 20:A8CB: 28        .byte $28	; <り>
- D - I - 0x02A8DC 20:A8CC: 00        .byte $00
- D - I - 0x02A8DD 20:A8CD: 00        .byte $00
- D - I - 0x02A8DE 20:A8CE: E8        .byte $E8
- D - I - 0x02A8DF 20:A8CF: FF        .byte $FF
- - - - - 0x02A8E0 20:A8D0: 00        .byte $00
off_A8D1_98:
- D - I - 0x02A8E1 20:A8D1: 01        .byte $01	; <あ>
- D - I - 0x02A8E2 20:A8D2: 1E        .byte $1E	; <ほ>
- D - I - 0x02A8E3 20:A8D3: 67        .byte $67	; <ラ>
- D - I - 0x02A8E4 20:A8D4: FA        .byte $FA
- D - I - 0x02A8E5 20:A8D5: 80        .byte $80
- D - I - 0x02A8E6 20:A8D6: 00        .byte $00
- D - I - 0x02A8E7 20:A8D7: 00        .byte $00
off_A8D8_99:
- D - I - 0x02A8E8 20:A8D8: 01        .byte $01	; <あ>
- D - I - 0x02A8E9 20:A8D9: 50        .byte $50	; <タ>
- D - I - 0x02A8EA 20:A8DA: 96        .byte $96
- D - I - 0x02A8EB 20:A8DB: 00        .byte $00
- D - I - 0x02A8EC 20:A8DC: 64        .byte $64	; <ヤ>
- D - I - 0x02A8ED 20:A8DD: 00        .byte $00
- - - - - 0x02A8EE 20:A8DE: 00        .byte $00
off_A8DF_9A:
- D - I - 0x02A8EF 20:A8DF: 03        .byte $03	; <う>
- D - I - 0x02A8F0 20:A8E0: 1E        .byte $1E	; <ほ>
- D - I - 0x02A8F1 20:A8E1: D5        .byte $D5
- D - I - 0x02A8F2 20:A8E2: 00        .byte $00
- D - I - 0x02A8F3 20:A8E3: DE        .byte $DE
- D - I - 0x02A8F4 20:A8E4: FF        .byte $FF
- D - I - 0x02A8F5 20:A8E5: FF        .byte $FF
- D - I - 0x02A8F6 20:A8E6: FF        .byte $FF
- D - I - 0x02A8F7 20:A8E7: 05        .byte $05	; <お>
- D - I - 0x02A8F8 20:A8E8: 00        .byte $00
- - - - - 0x02A8F9 20:A8E9: 01        .byte $01	; <あ>
- - - - - 0x02A8FA 20:A8EA: 32        .byte $32	; <ょ>
- - - - - 0x02A8FB 20:A8EB: 16        .byte $16	; <に>
- - - - - 0x02A8FC 20:A8EC: 00        .byte $00
- - - - - 0x02A8FD 20:A8ED: 32        .byte $32	; <ょ>
- - - - - 0x02A8FE 20:A8EE: 00        .byte $00
- - - - - 0x02A8FF 20:A8EF: 00        .byte $00
off_A8F0_9B:
- D - I - 0x02A900 20:A8F0: 03        .byte $03	; <う>
- D - I - 0x02A901 20:A8F1: 1E        .byte $1E	; <ほ>
- D - I - 0x02A902 20:A8F2: 55        .byte $55	; <ナ>
- D - I - 0x02A903 20:A8F3: 01        .byte $01	; <あ>
- D - I - 0x02A904 20:A8F4: 1A        .byte $1A	; <は>
- D - I - 0x02A905 20:A8F5: FE        .byte $FE
- D - I - 0x02A906 20:A8F6: 00        .byte $00
- D - I - 0x02A907 20:A8F7: 00        .byte $00
- D - I - 0x02A908 20:A8F8: 1A        .byte $1A	; <は>
- D - I - 0x02A909 20:A8F9: 00        .byte $00
- D - I - 0x02A90A 20:A8FA: 01        .byte $01	; <あ>
- D - I - 0x02A90B 20:A8FB: 1E        .byte $1E	; <ほ>
- D - I - 0x02A90C 20:A8FC: 40        .byte $40	; <「>
- D - I - 0x02A90D 20:A8FD: 00        .byte $00
- D - I - 0x02A90E 20:A8FE: 40        .byte $40	; <「>
- D - I - 0x02A90F 20:A8FF: 00        .byte $00
- - - - - 0x02A910 20:A900: 00        .byte $00
off_A901_9C:
- D - I - 0x02A911 20:A901: 01        .byte $01	; <あ>
- D - I - 0x02A912 20:A902: 5A        .byte $5A	; <ハ>
- D - I - 0x02A913 20:A903: DA        .byte $DA
- D - I - 0x02A914 20:A904: FF        .byte $FF
- D - I - 0x02A915 20:A905: 00        .byte $00
- D - I - 0x02A916 20:A906: 00        .byte $00
- D - I - 0x02A917 20:A907: 00        .byte $00
off_A908_9D:
- D - I - 0x02A918 20:A908: 03        .byte $03	; <う>
- D - I - 0x02A919 20:A909: 1E        .byte $1E	; <ほ>
- D - I - 0x02A91A 20:A90A: DD        .byte $DD
- D - I - 0x02A91B 20:A90B: 03        .byte $03	; <う>
- D - I - 0x02A91C 20:A90C: F8        .byte $F8
- D - I - 0x02A91D 20:A90D: FF        .byte $FF
- D - I - 0x02A91E 20:A90E: 00        .byte $00
- D - I - 0x02A91F 20:A90F: 00        .byte $00
- D - I - 0x02A920 20:A910: 0D        .byte $0D	; <す>
- D - I - 0x02A921 20:A911: 00        .byte $00
- - - - - 0x02A922 20:A912: 00        .byte $00
off_A913_9E:
- D - I - 0x02A923 20:A913: 03        .byte $03	; <う>
- D - I - 0x02A924 20:A914: 1E        .byte $1E	; <ほ>
- D - I - 0x02A925 20:A915: 23        .byte $23	; <も>
- D - I - 0x02A926 20:A916: FC        .byte $FC
- D - I - 0x02A927 20:A917: F8        .byte $F8
- D - I - 0x02A928 20:A918: FF        .byte $FF
- D - I - 0x02A929 20:A919: 00        .byte $00
- D - I - 0x02A92A 20:A91A: 00        .byte $00
- D - I - 0x02A92B 20:A91B: 0D        .byte $0D	; <す>
- D - I - 0x02A92C 20:A91C: 00        .byte $00
- - - - - 0x02A92D 20:A91D: 00        .byte $00
off_A91E_9F:
- D - I - 0x02A92E 20:A91E: 01        .byte $01	; <あ>
- D - I - 0x02A92F 20:A91F: 14        .byte $14	; <と>
- D - I - 0x02A930 20:A920: CC        .byte $CC	; <ぽ>
- D - I - 0x02A931 20:A921: 05        .byte $05	; <お>
- D - I - 0x02A932 20:A922: 40        .byte $40	; <「>
- D - I - 0x02A933 20:A923: 05        .byte $05	; <お>
- D - I - 0x02A934 20:A924: 00        .byte $00
off_A925_A0:
- D - I - 0x02A935 20:A925: 01        .byte $01	; <あ>
- D - I - 0x02A936 20:A926: 1E        .byte $1E	; <ほ>
- D - I - 0x02A937 20:A927: 3C        .byte $3C	; <9>
- D - I - 0x02A938 20:A928: FF        .byte $FF
- D - I - 0x02A939 20:A929: 44        .byte $44	; <エ>
- D - I - 0x02A93A 20:A92A: 00        .byte $00
- - - - - 0x02A93B 20:A92B: 00        .byte $00
off_A92C_A1:
- D - I - 0x02A93C 20:A92C: 03        .byte $03	; <う>
- D - I - 0x02A93D 20:A92D: 28        .byte $28	; <り>
- D - I - 0x02A93E 20:A92E: 20        .byte $20	; <み>
- D - I - 0x02A93F 20:A92F: FF        .byte $FF
- D - I - 0x02A940 20:A930: 00        .byte $00
- D - I - 0x02A941 20:A931: 00        .byte $00
- D - I - 0x02A942 20:A932: 00        .byte $00
- D - I - 0x02A943 20:A933: 00        .byte $00
- D - I - 0x02A944 20:A934: 08        .byte $08	; <く>
- D - I - 0x02A945 20:A935: 00        .byte $00
- - - - - 0x02A946 20:A936: 00        .byte $00
off_A937_A2:
- D - I - 0x02A947 20:A937: 01        .byte $01	; <あ>
- D - I - 0x02A948 20:A938: 1E        .byte $1E	; <ほ>
- D - I - 0x02A949 20:A939: CC        .byte $CC	; <ぽ>
- D - I - 0x02A94A 20:A93A: 04        .byte $04	; <え>
- D - I - 0x02A94B 20:A93B: 22        .byte $22	; <め>
- D - I - 0x02A94C 20:A93C: 02        .byte $02	; <い>
- - - - - 0x02A94D 20:A93D: 00        .byte $00
off_A93E_A3:
- D - I - 0x02A94E 20:A93E: 03        .byte $03	; <う>
- D - I - 0x02A94F 20:A93F: 28        .byte $28	; <り>
- D - I - 0x02A950 20:A940: 07        .byte $07	; <き>
- D - I - 0x02A951 20:A941: FF        .byte $FF
- D - I - 0x02A952 20:A942: 06        .byte $06	; <か>
- D - I - 0x02A953 20:A943: 00        .byte $00
- D - I - 0x02A954 20:A944: 00        .byte $00
- D - I - 0x02A955 20:A945: 00        .byte $00
- D - I - 0x02A956 20:A946: 0D        .byte $0D	; <す>
- D - I - 0x02A957 20:A947: 00        .byte $00
- - - - - 0x02A958 20:A948: 00        .byte $00
off_A949_A4:
- - - - - 0x02A959 20:A949: 00        .byte $00
off_A94A_A5:
- D - I - 0x02A95A 20:A94A: 03        .byte $03	; <う>
- D - I - 0x02A95B 20:A94B: 1E        .byte $1E	; <ほ>
- D - I - 0x02A95C 20:A94C: 55        .byte $55	; <ナ>
- D - I - 0x02A95D 20:A94D: 01        .byte $01	; <あ>
- D - I - 0x02A95E 20:A94E: 1A        .byte $1A	; <は>
- D - I - 0x02A95F 20:A94F: FE        .byte $FE
- D - I - 0x02A960 20:A950: 00        .byte $00
- D - I - 0x02A961 20:A951: 00        .byte $00
- D - I - 0x02A962 20:A952: 1A        .byte $1A	; <は>
- D - I - 0x02A963 20:A953: 00        .byte $00
- - - - - 0x02A964 20:A954: 00        .byte $00
off_A955_A6:
- D - I - 0x02A965 20:A955: 01        .byte $01	; <あ>
- D - I - 0x02A966 20:A956: 1E        .byte $1E	; <ほ>
- D - I - 0x02A967 20:A957: 40        .byte $40	; <「>
- D - I - 0x02A968 20:A958: FE        .byte $FE
- D - I - 0x02A969 20:A959: 12        .byte $12	; <つ>
- D - I - 0x02A96A 20:A95A: FD        .byte $FD
- - - - - 0x02A96B 20:A95B: 00        .byte $00
off_A95C_A7:
- D - I - 0x02A96C 20:A95C: 03        .byte $03	; <う>
- D - I - 0x02A96D 20:A95D: 32        .byte $32	; <ょ>
- D - I - 0x02A96E 20:A95E: D0        .byte $D0	; <ペ>
- D - I - 0x02A96F 20:A95F: FF        .byte $FF
- D - I - 0x02A970 20:A960: 95        .byte $95
- D - I - 0x02A971 20:A961: FF        .byte $FF
- D - I - 0x02A972 20:A962: 00        .byte $00
- D - I - 0x02A973 20:A963: 00        .byte $00
- D - I - 0x02A974 20:A964: 04        .byte $04	; <え>
- D - I - 0x02A975 20:A965: 00        .byte $00
- - - - - 0x02A976 20:A966: 00        .byte $00
off_A967_A8:
- D - I - 0x02A977 20:A967: 01        .byte $01	; <あ>
- D - I - 0x02A978 20:A968: 3C        .byte $3C	; <9>
- D - I - 0x02A979 20:A969: 00        .byte $00
- D - I - 0x02A97A 20:A96A: FD        .byte $FD
- D - I - 0x02A97B 20:A96B: 80        .byte $80
- D - I - 0x02A97C 20:A96C: FE        .byte $FE
- D - I - 0x02A97D 20:A96D: 00        .byte $00
off_A96E_A9:
- D - I - 0x02A97E 20:A96E: 03        .byte $03	; <う>
- D - I - 0x02A97F 20:A96F: 3C        .byte $3C	; <9>
- D - I - 0x02A980 20:A970: 84        .byte $84	; <D>
- D - I - 0x02A981 20:A971: 00        .byte $00
- D - I - 0x02A982 20:A972: 34        .byte $34	; <1>
- D - I - 0x02A983 20:A973: FF        .byte $FF
- D - I - 0x02A984 20:A974: 13        .byte $13	; <て>
- D - I - 0x02A985 20:A975: 00        .byte $00
- D - I - 0x02A986 20:A976: 00        .byte $00
- D - I - 0x02A987 20:A977: 00        .byte $00
- D - I - 0x02A988 20:A978: 00        .byte $00
off_A979_AA:
- D - I - 0x02A989 20:A979: 03        .byte $03	; <う>
- D - I - 0x02A98A 20:A97A: 1E        .byte $1E	; <ほ>
- D - I - 0x02A98B 20:A97B: E6        .byte $E6
- D - I - 0x02A98C 20:A97C: 02        .byte $02	; <い>
- D - I - 0x02A98D 20:A97D: 00        .byte $00
- D - I - 0x02A98E 20:A97E: 00        .byte $00
- D - I - 0x02A98F 20:A97F: 00        .byte $00
- D - I - 0x02A990 20:A980: 00        .byte $00
- D - I - 0x02A991 20:A981: 08        .byte $08	; <く>
- D - I - 0x02A992 20:A982: 00        .byte $00
- D - I - 0x02A993 20:A983: 00        .byte $00
off_A984_AB:
- D - I - 0x02A994 20:A984: 03        .byte $03	; <う>
- D - I - 0x02A995 20:A985: 28        .byte $28	; <り>
- D - I - 0x02A996 20:A986: 99        .byte $99
- D - I - 0x02A997 20:A987: 01        .byte $01	; <あ>
- D - I - 0x02A998 20:A988: 60        .byte $60	; <ミ>
- D - I - 0x02A999 20:A989: 00        .byte $00
- D - I - 0x02A99A 20:A98A: 30        .byte $30	; <ゃ>
- D - I - 0x02A99B 20:A98B: 00        .byte $00
- D - I - 0x02A99C 20:A98C: EC        .byte $EC
- D - I - 0x02A99D 20:A98D: FF        .byte $FF
- D - I - 0x02A99E 20:A98E: 00        .byte $00
off_A98F_AC:
- D - I - 0x02A99F 20:A98F: 01        .byte $01	; <あ>
- D - I - 0x02A9A0 20:A990: 14        .byte $14	; <と>
- D - I - 0x02A9A1 20:A991: D9        .byte $D9
- D - I - 0x02A9A2 20:A992: 04        .byte $04	; <え>
- D - I - 0x02A9A3 20:A993: F3        .byte $F3
- D - I - 0x02A9A4 20:A994: 05        .byte $05	; <お>
- D - I - 0x02A9A5 20:A995: 00        .byte $00
off_A996_AD:
- D - I - 0x02A9A6 20:A996: 01        .byte $01	; <あ>
- D - I - 0x02A9A7 20:A997: 1E        .byte $1E	; <ほ>
- D - I - 0x02A9A8 20:A998: 56        .byte $56	; <ニ>
- D - I - 0x02A9A9 20:A999: F9        .byte $F9
- D - I - 0x02A9AA 20:A99A: E0        .byte $E0
- D - I - 0x02A9AB 20:A99B: FD        .byte $FD
- D - I - 0x02A9AC 20:A99C: 00        .byte $00
off_A99D_AE:
- D - I - 0x02A9AD 20:A99D: 03        .byte $03	; <う>
- D - I - 0x02A9AE 20:A99E: 32        .byte $32	; <ょ>
- D - I - 0x02A9AF 20:A99F: D1        .byte $D1	; <ポ>
- D - I - 0x02A9B0 20:A9A0: 00        .byte $00
- D - I - 0x02A9B1 20:A9A1: 0B        .byte $0B	; <さ>
- D - I - 0x02A9B2 20:A9A2: FF        .byte $FF
- D - I - 0x02A9B3 20:A9A3: 11        .byte $11	; <ち>
- D - I - 0x02A9B4 20:A9A4: 00        .byte $00
- D - I - 0x02A9B5 20:A9A5: 10        .byte $10	; <た>
- D - I - 0x02A9B6 20:A9A6: 00        .byte $00
- - - - - 0x02A9B7 20:A9A7: 00        .byte $00
off_A9A8_AF:
- D - I - 0x02A9B8 20:A9A8: 03        .byte $03	; <う>
- D - I - 0x02A9B9 20:A9A9: 32        .byte $32	; <ょ>
- D - I - 0x02A9BA 20:A9AA: 5C        .byte $5C	; <フ>
- D - I - 0x02A9BB 20:A9AB: 03        .byte $03	; <う>
- D - I - 0x02A9BC 20:A9AC: B4        .byte $B4	; <ガ>
- D - I - 0x02A9BD 20:A9AD: FE        .byte $FE
- D - I - 0x02A9BE 20:A9AE: E8        .byte $E8
- D - I - 0x02A9BF 20:A9AF: FF        .byte $FF
- D - I - 0x02A9C0 20:A9B0: 00        .byte $00
- D - I - 0x02A9C1 20:A9B1: 00        .byte $00
- D - I - 0x02A9C2 20:A9B2: 00        .byte $00
off_A9B3_B0:
- D - I - 0x02A9C3 20:A9B3: 03        .byte $03	; <う>
- D - I - 0x02A9C4 20:A9B4: 32        .byte $32	; <ょ>
- D - I - 0x02A9C5 20:A9B5: FB        .byte $FB
- D - I - 0x02A9C6 20:A9B6: FF        .byte $FF
- D - I - 0x02A9C7 20:A9B7: 5D        .byte $5D	; <ヘ>
- D - I - 0x02A9C8 20:A9B8: FF        .byte $FF
- D - I - 0x02A9C9 20:A9B9: 10        .byte $10	; <た>
- D - I - 0x02A9CA 20:A9BA: 00        .byte $00
- D - I - 0x02A9CB 20:A9BB: 00        .byte $00
- D - I - 0x02A9CC 20:A9BC: 00        .byte $00
- - - - - 0x02A9CD 20:A9BD: 00        .byte $00
off_A9BE_B1:
- D - I - 0x02A9CE 20:A9BE: 03        .byte $03	; <う>
- D - I - 0x02A9CF 20:A9BF: 28        .byte $28	; <り>
- D - I - 0x02A9D0 20:A9C0: 66        .byte $66	; <ヨ>
- D - I - 0x02A9D1 20:A9C1: 01        .byte $01	; <あ>
- D - I - 0x02A9D2 20:A9C2: 93        .byte $93	; <Y>
- D - I - 0x02A9D3 20:A9C3: 02        .byte $02	; <い>
- D - I - 0x02A9D4 20:A9C4: 10        .byte $10	; <た>
- D - I - 0x02A9D5 20:A9C5: 00        .byte $00
- D - I - 0x02A9D6 20:A9C6: F8        .byte $F8
- D - I - 0x02A9D7 20:A9C7: FF        .byte $FF
- D - I - 0x02A9D8 20:A9C8: 03        .byte $03	; <う>
- D - I - 0x02A9D9 20:A9C9: 14        .byte $14	; <と>
- D - I - 0x02A9DA 20:A9CA: CC        .byte $CC	; <ぽ>
- D - I - 0x02A9DB 20:A9CB: 02        .byte $02	; <い>
- D - I - 0x02A9DC 20:A9CC: 00        .byte $00
- D - I - 0x02A9DD 20:A9CD: 00        .byte $00
- D - I - 0x02A9DE 20:A9CE: 20        .byte $20	; <み>
- D - I - 0x02A9DF 20:A9CF: 00        .byte $00
- D - I - 0x02A9E0 20:A9D0: A0        .byte $A0	; <が>
- D - I - 0x02A9E1 20:A9D1: FF        .byte $FF
- D - I - 0x02A9E2 20:A9D2: 00        .byte $00
off_A9D3_B2:
- D - I - 0x02A9E3 20:A9D3: 01        .byte $01	; <あ>
- D - I - 0x02A9E4 20:A9D4: 28        .byte $28	; <り>
- D - I - 0x02A9E5 20:A9D5: 00        .byte $00
- D - I - 0x02A9E6 20:A9D6: 00        .byte $00
- D - I - 0x02A9E7 20:A9D7: 94        .byte $94
- D - I - 0x02A9E8 20:A9D8: FF        .byte $FF
- D - I - 0x02A9E9 20:A9D9: 00        .byte $00
off_A9DA_B3:
- D - I - 0x02A9EA 20:A9DA: 01        .byte $01	; <あ>
- D - I - 0x02A9EB 20:A9DB: 28        .byte $28	; <り>
- D - I - 0x02A9EC 20:A9DC: 20        .byte $20	; <み>
- D - I - 0x02A9ED 20:A9DD: 05        .byte $05	; <お>
- D - I - 0x02A9EE 20:A9DE: 60        .byte $60	; <ミ>
- D - I - 0x02A9EF 20:A9DF: FD        .byte $FD
- D - I - 0x02A9F0 20:A9E0: 00        .byte $00
off_A9E1_B4:
- D - I - 0x02A9F1 20:A9E1: 01        .byte $01	; <あ>
- D - I - 0x02A9F2 20:A9E2: 28        .byte $28	; <り>
- D - I - 0x02A9F3 20:A9E3: 00        .byte $00
- D - I - 0x02A9F4 20:A9E4: 01        .byte $01	; <あ>
- D - I - 0x02A9F5 20:A9E5: 00        .byte $00
- D - I - 0x02A9F6 20:A9E6: FA        .byte $FA
- D - I - 0x02A9F7 20:A9E7: 00        .byte $00
off_A9E8_B5:
- D - I - 0x02A9F8 20:A9E8: 01        .byte $01	; <あ>
- D - I - 0x02A9F9 20:A9E9: 14        .byte $14	; <と>
- D - I - 0x02A9FA 20:A9EA: 80        .byte $80
- D - I - 0x02A9FB 20:A9EB: FB        .byte $FB
- D - I - 0x02A9FC 20:A9EC: 10        .byte $10	; <た>
- D - I - 0x02A9FD 20:A9ED: 06        .byte $06	; <か>
- D - I - 0x02A9FE 20:A9EE: 00        .byte $00
off_A9EF_B6:
- D - I - 0x02A9FF 20:A9EF: 01        .byte $01	; <あ>
- D - I - 0x02AA00 20:A9F0: 14        .byte $14	; <と>
- D - I - 0x02AA01 20:A9F1: 00        .byte $00
- D - I - 0x02AA02 20:A9F2: 08        .byte $08	; <く>
- D - I - 0x02AA03 20:A9F3: 26        .byte $26	; <よ>
- D - I - 0x02AA04 20:A9F4: 01        .byte $01	; <あ>
- D - I - 0x02AA05 20:A9F5: 01        .byte $01	; <あ>
- D - I - 0x02AA06 20:A9F6: 14        .byte $14	; <と>
- D - I - 0x02AA07 20:A9F7: CC        .byte $CC	; <ぽ>
- D - I - 0x02AA08 20:A9F8: 00        .byte $00
- D - I - 0x02AA09 20:A9F9: CC        .byte $CC	; <ぽ>
- D - I - 0x02AA0A 20:A9FA: 00        .byte $00
- D - I - 0x02AA0B 20:A9FB: 00        .byte $00
off_A9FC_B7:
- D - I - 0x02AA0C 20:A9FC: 03        .byte $03	; <う>
- D - I - 0x02AA0D 20:A9FD: 14        .byte $14	; <と>
- D - I - 0x02AA0E 20:A9FE: 00        .byte $00
- D - I - 0x02AA0F 20:A9FF: 00        .byte $00
- D - I - 0x02AA10 20:AA00: 00        .byte $00
- D - I - 0x02AA11 20:AA01: F7        .byte $F7
- D - I - 0x02AA12 20:AA02: 00        .byte $00
- D - I - 0x02AA13 20:AA03: 00        .byte $00
- D - I - 0x02AA14 20:AA04: 60        .byte $60	; <ミ>
- D - I - 0x02AA15 20:AA05: 00        .byte $00
- D - I - 0x02AA16 20:AA06: 00        .byte $00
off_AA07_B8:
- - - - - 0x02AA17 20:AA07: 00        .byte $00
off_AA08_B9:
- D - I - 0x02AA18 20:AA08: 01        .byte $01	; <あ>
- D - I - 0x02AA19 20:AA09: 3C        .byte $3C	; <9>
- D - I - 0x02AA1A 20:AA0A: 13        .byte $13	; <て>
- D - I - 0x02AA1B 20:AA0B: 02        .byte $02	; <い>
- D - I - 0x02AA1C 20:AA0C: AD        .byte $AD	; <で>
- D - I - 0x02AA1D 20:AA0D: FF        .byte $FF
- D - I - 0x02AA1E 20:AA0E: 00        .byte $00
off_AA0F_BA:
- - - - - 0x02AA1F 20:AA0F: 00        .byte $00
off_AA10_BB:
- D - I - 0x02AA20 20:AA10: 01        .byte $01	; <あ>
- D - I - 0x02AA21 20:AA11: 10        .byte $10	; <た>
- D - I - 0x02AA22 20:AA12: 00        .byte $00
- D - I - 0x02AA23 20:AA13: FD        .byte $FD
- D - I - 0x02AA24 20:AA14: 10        .byte $10	; <た>
- D - I - 0x02AA25 20:AA15: 06        .byte $06	; <か>
- D - I - 0x02AA26 20:AA16: 00        .byte $00
off_AA17_BC:
- D - I - 0x02AA27 20:AA17: 01        .byte $01	; <あ>
- D - I - 0x02AA28 20:AA18: 3C        .byte $3C	; <9>
- D - I - 0x02AA29 20:AA19: 9D        .byte $9D
- D - I - 0x02AA2A 20:AA1A: 01        .byte $01	; <あ>
- D - I - 0x02AA2B 20:AA1B: 00        .byte $00
- D - I - 0x02AA2C 20:AA1C: 00        .byte $00
- D - I - 0x02AA2D 20:AA1D: 00        .byte $00
off_AA1E_BD:
- D - I - 0x02AA2E 20:AA1E: 01        .byte $01	; <あ>
- D - I - 0x02AA2F 20:AA1F: 28        .byte $28	; <り>
- D - I - 0x02AA30 20:AA20: 00        .byte $00
- D - I - 0x02AA31 20:AA21: 00        .byte $00
- D - I - 0x02AA32 20:AA22: FA        .byte $FA
- D - I - 0x02AA33 20:AA23: FE        .byte $FE
- - - - - 0x02AA34 20:AA24: 00        .byte $00
off_AA25_BE:
- D - I - 0x02AA35 20:AA25: 01        .byte $01	; <あ>
- D - I - 0x02AA36 20:AA26: 28        .byte $28	; <り>
- D - I - 0x02AA37 20:AA27: 9A        .byte $9A
- D - I - 0x02AA38 20:AA28: FF        .byte $FF
- D - I - 0x02AA39 20:AA29: 39        .byte $39	; <6>
- D - I - 0x02AA3A 20:AA2A: 00        .byte $00
- D - I - 0x02AA3B 20:AA2B: 00        .byte $00
off_AA2C_BF:
- D - I - 0x02AA3C 20:AA2C: 03        .byte $03	; <う>
- D - I - 0x02AA3D 20:AA2D: 28        .byte $28	; <り>
- D - I - 0x02AA3E 20:AA2E: 99        .byte $99
- D - I - 0x02AA3F 20:AA2F: 01        .byte $01	; <あ>
- D - I - 0x02AA40 20:AA30: 00        .byte $00
- D - I - 0x02AA41 20:AA31: 01        .byte $01	; <あ>
- D - I - 0x02AA42 20:AA32: 20        .byte $20	; <み>
- D - I - 0x02AA43 20:AA33: 00        .byte $00
- D - I - 0x02AA44 20:AA34: FE        .byte $FE
- D - I - 0x02AA45 20:AA35: FF        .byte $FF
- D - I - 0x02AA46 20:AA36: 00        .byte $00
off_AA37_C0:
- D - I - 0x02AA47 20:AA37: 01        .byte $01	; <あ>
- D - I - 0x02AA48 20:AA38: 32        .byte $32	; <ょ>
- D - I - 0x02AA49 20:AA39: CE        .byte $CE	; <ピ>
- D - I - 0x02AA4A 20:AA3A: FF        .byte $FF
- D - I - 0x02AA4B 20:AA3B: 32        .byte $32	; <ょ>
- D - I - 0x02AA4C 20:AA3C: 00        .byte $00
- D - I - 0x02AA4D 20:AA3D: 00        .byte $00
off_AA3E_C1:
- D - I - 0x02AA4E 20:AA3E: 03        .byte $03	; <う>
- D - I - 0x02AA4F 20:AA3F: 1E        .byte $1E	; <ほ>
- D - I - 0x02AA50 20:AA40: 00        .byte $00
- D - I - 0x02AA51 20:AA41: FE        .byte $FE
- D - I - 0x02AA52 20:AA42: 00        .byte $00
- D - I - 0x02AA53 20:AA43: 02        .byte $02	; <い>
- D - I - 0x02AA54 20:AA44: 18        .byte $18	; <ね>
- D - I - 0x02AA55 20:AA45: 00        .byte $00
- D - I - 0x02AA56 20:AA46: E8        .byte $E8
- D - I - 0x02AA57 20:AA47: FF        .byte $FF
- D - I - 0x02AA58 20:AA48: 01        .byte $01	; <あ>
- D - I - 0x02AA59 20:AA49: 32        .byte $32	; <ょ>
- D - I - 0x02AA5A 20:AA4A: 30        .byte $30	; <ゃ>
- D - I - 0x02AA5B 20:AA4B: 00        .byte $00
- D - I - 0x02AA5C 20:AA4C: D0        .byte $D0	; <ペ>
- D - I - 0x02AA5D 20:AA4D: FF        .byte $FF
- D - I - 0x02AA5E 20:AA4E: 00        .byte $00
off_AA4F_C2:
- D - I - 0x02AA5F 20:AA4F: 01        .byte $01	; <あ>
- D - I - 0x02AA60 20:AA50: 64        .byte $64	; <ヤ>
- D - I - 0x02AA61 20:AA51: 00        .byte $00
- D - I - 0x02AA62 20:AA52: 00        .byte $00
- D - I - 0x02AA63 20:AA53: F3        .byte $F3
- D - I - 0x02AA64 20:AA54: 00        .byte $00
- - - - - 0x02AA65 20:AA55: 00        .byte $00
off_AA56_C3:
- D - I - 0x02AA66 20:AA56: 01        .byte $01	; <あ>
- D - I - 0x02AA67 20:AA57: 3C        .byte $3C	; <9>
- D - I - 0x02AA68 20:AA58: 00        .byte $00
- D - I - 0x02AA69 20:AA59: 00        .byte $00
- D - I - 0x02AA6A 20:AA5A: 6B        .byte $6B	; <ロ>
- D - I - 0x02AA6B 20:AA5B: FE        .byte $FE
- - - - - 0x02AA6C 20:AA5C: 00        .byte $00
off_AA5D_C4:
- D - I - 0x02AA6D 20:AA5D: 01        .byte $01	; <あ>
- D - I - 0x02AA6E 20:AA5E: 28        .byte $28	; <り>
- D - I - 0x02AA6F 20:AA5F: C0        .byte $C0	; <ヅ>
- D - I - 0x02AA70 20:AA60: FB        .byte $FB
- D - I - 0x02AA71 20:AA61: 00        .byte $00
- D - I - 0x02AA72 20:AA62: 00        .byte $00
- - - - - 0x02AA73 20:AA63: 00        .byte $00
off_AA64_C5:
- D - I - 0x02AA74 20:AA64: 01        .byte $01	; <あ>
- D - I - 0x02AA75 20:AA65: 28        .byte $28	; <り>
- D - I - 0x02AA76 20:AA66: 60        .byte $60	; <ミ>
- D - I - 0x02AA77 20:AA67: 00        .byte $00
- D - I - 0x02AA78 20:AA68: 33        .byte $33	; <0>
- D - I - 0x02AA79 20:AA69: 00        .byte $00
- - - - - 0x02AA7A 20:AA6A: 00        .byte $00
off_AA6B_C6:
- D - I - 0x02AA7B 20:AA6B: 01        .byte $01	; <あ>
- D - I - 0x02AA7C 20:AA6C: 14        .byte $14	; <と>
- D - I - 0x02AA7D 20:AA6D: E0        .byte $E0
- D - I - 0x02AA7E 20:AA6E: FE        .byte $FE
- D - I - 0x02AA7F 20:AA6F: A0        .byte $A0	; <が>
- D - I - 0x02AA80 20:AA70: F8        .byte $F8
- D - I - 0x02AA81 20:AA71: 00        .byte $00
off_AA72_C7:
- D - I - 0x02AA82 20:AA72: 01        .byte $01	; <あ>
- D - I - 0x02AA83 20:AA73: 32        .byte $32	; <ょ>
- D - I - 0x02AA84 20:AA74: 00        .byte $00
- D - I - 0x02AA85 20:AA75: 00        .byte $00
- D - I - 0x02AA86 20:AA76: D8        .byte $D8
- D - I - 0x02AA87 20:AA77: FE        .byte $FE
- D - I - 0x02AA88 20:AA78: 00        .byte $00
off_AA79_C8:
- D - I - 0x02AA89 20:AA79: 03        .byte $03	; <う>
- D - I - 0x02AA8A 20:AA7A: 3C        .byte $3C	; <9>
- D - I - 0x02AA8B 20:AA7B: 52        .byte $52	; <ツ>
- D - I - 0x02AA8C 20:AA7C: FD        .byte $FD
- D - I - 0x02AA8D 20:AA7D: 67        .byte $67	; <ラ>
- D - I - 0x02AA8E 20:AA7E: FC        .byte $FC
- D - I - 0x02AA8F 20:AA7F: 00        .byte $00
- D - I - 0x02AA90 20:AA80: 00        .byte $00
- D - I - 0x02AA91 20:AA81: 1E        .byte $1E	; <ほ>
- D - I - 0x02AA92 20:AA82: 00        .byte $00
- D - I - 0x02AA93 20:AA83: 00        .byte $00
off_AA84_C9:
- D - I - 0x02AA94 20:AA84: 01        .byte $01	; <あ>
- D - I - 0x02AA95 20:AA85: 18        .byte $18	; <ね>
- D - I - 0x02AA96 20:AA86: B5        .byte $B5	; <ギ>
- D - I - 0x02AA97 20:AA87: 02        .byte $02	; <い>
- D - I - 0x02AA98 20:AA88: 00        .byte $00
- D - I - 0x02AA99 20:AA89: 00        .byte $00
- D - I - 0x02AA9A 20:AA8A: 00        .byte $00
off_AA8B_CA:
- D - I - 0x02AA9B 20:AA8B: 01        .byte $01	; <あ>
- D - I - 0x02AA9C 20:AA8C: 18        .byte $18	; <ね>
- D - I - 0x02AA9D 20:AA8D: 4B        .byte $4B	; <サ>
- D - I - 0x02AA9E 20:AA8E: FD        .byte $FD
- D - I - 0x02AA9F 20:AA8F: 00        .byte $00
- D - I - 0x02AAA0 20:AA90: 00        .byte $00
- D - I - 0x02AAA1 20:AA91: 00        .byte $00
off_AA92_CB:
- D - I - 0x02AAA2 20:AA92: 03        .byte $03	; <う>
- D - I - 0x02AAA3 20:AA93: 3C        .byte $3C	; <9>
- D - I - 0x02AAA4 20:AA94: CC        .byte $CC	; <ぽ>
- D - I - 0x02AAA5 20:AA95: 02        .byte $02	; <い>
- D - I - 0x02AAA6 20:AA96: 00        .byte $00
- D - I - 0x02AAA7 20:AA97: 00        .byte $00
- D - I - 0x02AAA8 20:AA98: F3        .byte $F3
- D - I - 0x02AAA9 20:AA99: FF        .byte $FF
- D - I - 0x02AAAA 20:AA9A: 00        .byte $00
- D - I - 0x02AAAB 20:AA9B: 00        .byte $00
- D - I - 0x02AAAC 20:AA9C: 00        .byte $00
off_AA9D_CC:
- D - I - 0x02AAAD 20:AA9D: 01        .byte $01	; <あ>
- D - I - 0x02AAAE 20:AA9E: 1E        .byte $1E	; <ほ>
- D - I - 0x02AAAF 20:AA9F: 00        .byte $00
- D - I - 0x02AAB0 20:AAA0: F8        .byte $F8
- D - I - 0x02AAB1 20:AAA1: 00        .byte $00
- D - I - 0x02AAB2 20:AAA2: 00        .byte $00
- D - I - 0x02AAB3 20:AAA3: 00        .byte $00
off_AAA4_CD:
- - - - - 0x02AAB4 20:AAA4: 01        .byte $01	; <あ>
- - - - - 0x02AAB5 20:AAA5: 1E        .byte $1E	; <ほ>
- - - - - 0x02AAB6 20:AAA6: 80        .byte $80
- - - - - 0x02AAB7 20:AAA7: 08        .byte $08	; <く>
- - - - - 0x02AAB8 20:AAA8: 00        .byte $00
- - - - - 0x02AAB9 20:AAA9: 00        .byte $00
- - - - - 0x02AABA 20:AAAA: 00        .byte $00
off_AAAB_CE:
- D - I - 0x02AABB 20:AAAB: 03        .byte $03	; <う>
- D - I - 0x02AABC 20:AAAC: 28        .byte $28	; <り>
- D - I - 0x02AABD 20:AAAD: 00        .byte $00
- D - I - 0x02AABE 20:AAAE: 08        .byte $08	; <く>
- D - I - 0x02AABF 20:AAAF: 00        .byte $00
- D - I - 0x02AAC0 20:AAB0: 00        .byte $00
- D - I - 0x02AAC1 20:AAB1: 00        .byte $00
- D - I - 0x02AAC2 20:AAB2: 00        .byte $00
- D - I - 0x02AAC3 20:AAB3: E8        .byte $E8
- D - I - 0x02AAC4 20:AAB4: FF        .byte $FF
- - - - - 0x02AAC5 20:AAB5: 00        .byte $00
off_AAB6_CF:
- D - I - 0x02AAC6 20:AAB6: 01        .byte $01	; <あ>
- D - I - 0x02AAC7 20:AAB7: 14        .byte $14	; <と>
- D - I - 0x02AAC8 20:AAB8: 00        .byte $00
- D - I - 0x02AAC9 20:AAB9: 00        .byte $00
- D - I - 0x02AACA 20:AABA: 00        .byte $00
- D - I - 0x02AACB 20:AABB: 00        .byte $00
off_AABC:
- D - I - 0x02AACC 20:AABC: 01        .byte $01	; <あ>
- D - I - 0x02AACD 20:AABD: 01        .byte $01	; <あ>
- D - I - 0x02AACE 20:AABE: 00        .byte $00
- D - I - 0x02AACF 20:AABF: 16        .byte $16	; <に>
- D - I - 0x02AAD0 20:AAC0: 00        .byte $00
- D - I - 0x02AAD1 20:AAC1: 00        .byte $00
- D - I - 0x02AAD2 20:AAC2: 01        .byte $01	; <あ>
- D - I - 0x02AAD3 20:AAC3: 01        .byte $01	; <あ>
- D - I - 0x02AAD4 20:AAC4: 00        .byte $00
- D - I - 0x02AAD5 20:AAC5: CE        .byte $CE	; <ピ>
- D - I - 0x02AAD6 20:AAC6: 00        .byte $00
- D - I - 0x02AAD7 20:AAC7: 00        .byte $00
- D - I - 0x02AAD8 20:AAC8: 01        .byte $01	; <あ>
- D - I - 0x02AAD9 20:AAC9: 01        .byte $01	; <あ>
- D - I - 0x02AADA 20:AACA: 00        .byte $00
- D - I - 0x02AADB 20:AACB: 48        .byte $48	; <ク>
- D - I - 0x02AADC 20:AACC: 00        .byte $00
- D - I - 0x02AADD 20:AACD: 00        .byte $00
- D - I - 0x02AADE 20:AACE: 01        .byte $01	; <あ>
- D - I - 0x02AADF 20:AACF: 01        .byte $01	; <あ>
- D - I - 0x02AAE0 20:AAD0: 00        .byte $00
- D - I - 0x02AAE1 20:AAD1: 9C        .byte $9C
- D - I - 0x02AAE2 20:AAD2: 00        .byte $00
- D - I - 0x02AAE3 20:AAD3: 00        .byte $00
off_AAD4:
- D - I - 0x02AAE4 20:AAD4: 01        .byte $01	; <あ>
- D - I - 0x02AAE5 20:AAD5: 01        .byte $01	; <あ>
- D - I - 0x02AAE6 20:AAD6: 00        .byte $00
- D - I - 0x02AAE7 20:AAD7: 55        .byte $55	; <ナ>
- D - I - 0x02AAE8 20:AAD8: 00        .byte $00
- D - I - 0x02AAE9 20:AAD9: 00        .byte $00
- D - I - 0x02AAEA 20:AADA: 04        .byte $04	; <え>
- D - I - 0x02AAEB 20:AADB: D4 AA     .word off_AAD4
off_AADD_D0:
- D - I - 0x02AAED 20:AADD: 01        .byte $01	; <あ>
- D - I - 0x02AAEE 20:AADE: 28        .byte $28	; <り>
- D - I - 0x02AAEF 20:AADF: CD        .byte $CD	; <パ>
- D - I - 0x02AAF0 20:AAE0: FF        .byte $FF
- D - I - 0x02AAF1 20:AAE1: C7        .byte $C7	; <ボ>
- D - I - 0x02AAF2 20:AAE2: FF        .byte $FF
- D - I - 0x02AAF3 20:AAE3: 00        .byte $00
off_AAE4_D1:
- D - I - 0x02AAF4 20:AAE4: 01        .byte $01	; <あ>
- D - I - 0x02AAF5 20:AAE5: 28        .byte $28	; <り>
- D - I - 0x02AAF6 20:AAE6: 00        .byte $00
- D - I - 0x02AAF7 20:AAE7: 00        .byte $00
- D - I - 0x02AAF8 20:AAE8: D4        .byte $D4
- D - I - 0x02AAF9 20:AAE9: FE        .byte $FE
- D - I - 0x02AAFA 20:AAEA: 00        .byte $00
off_AAEB_D2:
- D - I - 0x02AAFB 20:AAEB: 01        .byte $01	; <あ>
- D - I - 0x02AAFC 20:AAEC: 28        .byte $28	; <り>
- D - I - 0x02AAFD 20:AAED: CD        .byte $CD	; <パ>
- D - I - 0x02AAFE 20:AAEE: FF        .byte $FF
- D - I - 0x02AAFF 20:AAEF: FA        .byte $FA
- D - I - 0x02AB00 20:AAF0: FE        .byte $FE
- D - I - 0x02AB01 20:AAF1: 00        .byte $00
off_AAF2_D3:
- D - I - 0x02AB02 20:AAF2: 01        .byte $01	; <あ>
- D - I - 0x02AB03 20:AAF3: 28        .byte $28	; <り>
- D - I - 0x02AB04 20:AAF4: 94        .byte $94
- D - I - 0x02AB05 20:AAF5: FD        .byte $FD
- D - I - 0x02AB06 20:AAF6: 20        .byte $20	; <み>
- D - I - 0x02AB07 20:AAF7: 00        .byte $00
- D - I - 0x02AB08 20:AAF8: 00        .byte $00
off_AAF9_D4:
- D - I - 0x02AB09 20:AAF9: 01        .byte $01	; <あ>
- D - I - 0x02AB0A 20:AAFA: 28        .byte $28	; <り>
- D - I - 0x02AB0B 20:AAFB: 33        .byte $33	; <0>
- D - I - 0x02AB0C 20:AAFC: 02        .byte $02	; <い>
- D - I - 0x02AB0D 20:AAFD: C7        .byte $C7	; <ボ>
- D - I - 0x02AB0E 20:AAFE: FF        .byte $FF
- - - - - 0x02AB0F 20:AAFF: 00        .byte $00
off_AB00_D5:
off_AB00:
- D - I - 0x02AB10 20:AB00: 01        .byte $01	; <あ>
- D - I - 0x02AB11 20:AB01: EF        .byte $EF
- D - I - 0x02AB12 20:AB02: 1D        .byte $1D	; <へ>
- D - I - 0x02AB13 20:AB03: 00        .byte $00
- D - I - 0x02AB14 20:AB04: 00        .byte $00
- D - I - 0x02AB15 20:AB05: 00        .byte $00
- D - I - 0x02AB16 20:AB06: 04        .byte $04	; <え>
- D - I - 0x02AB17 20:AB07: 00 AB     .word off_AB00
off_AB09_D6:
- D - I - 0x02AB19 20:AB09: 01        .byte $01	; <あ>
- D - I - 0x02AB1A 20:AB0A: 28        .byte $28	; <り>
- D - I - 0x02AB1B 20:AB0B: 00        .byte $00
- D - I - 0x02AB1C 20:AB0C: 00        .byte $00
- D - I - 0x02AB1D 20:AB0D: 80        .byte $80
- D - I - 0x02AB1E 20:AB0E: FD        .byte $FD
- - - - - 0x02AB1F 20:AB0F: 00        .byte $00
off_AB10_D7:
- D - I - 0x02AB20 20:AB10: 01        .byte $01	; <あ>
- D - I - 0x02AB21 20:AB11: 08        .byte $08	; <く>
- D - I - 0x02AB22 20:AB12: 00        .byte $00
- D - I - 0x02AB23 20:AB13: 00        .byte $00
- D - I - 0x02AB24 20:AB14: 00        .byte $00
- D - I - 0x02AB25 20:AB15: 00        .byte $00
- D - I - 0x02AB26 20:AB16: 01        .byte $01	; <あ>
- D - I - 0x02AB27 20:AB17: 28        .byte $28	; <り>
- D - I - 0x02AB28 20:AB18: 9A        .byte $9A
- D - I - 0x02AB29 20:AB19: FF        .byte $FF
- D - I - 0x02AB2A 20:AB1A: CD        .byte $CD	; <パ>
- D - I - 0x02AB2B 20:AB1B: FA        .byte $FA
- - - - - 0x02AB2C 20:AB1C: 00        .byte $00
off_AB1D_D8:
- D - I - 0x02AB2D 20:AB1D: 01        .byte $01	; <あ>
- D - I - 0x02AB2E 20:AB1E: 28        .byte $28	; <り>
- D - I - 0x02AB2F 20:AB1F: 47        .byte $47	; <キ>
- D - I - 0x02AB30 20:AB20: FF        .byte $FF
- D - I - 0x02AB31 20:AB21: 66        .byte $66	; <ヨ>
- D - I - 0x02AB32 20:AB22: 04        .byte $04	; <え>
- - - - - 0x02AB33 20:AB23: 00        .byte $00
off_AB24_D9:
- D - I - 0x02AB34 20:AB24: 03        .byte $03	; <う>
- D - I - 0x02AB35 20:AB25: 3C        .byte $3C	; <9>
- D - I - 0x02AB36 20:AB26: 22        .byte $22	; <め>
- D - I - 0x02AB37 20:AB27: 02        .byte $02	; <い>
- D - I - 0x02AB38 20:AB28: 84        .byte $84	; <D>
- D - I - 0x02AB39 20:AB29: 00        .byte $00
- D - I - 0x02AB3A 20:AB2A: E0        .byte $E0
- D - I - 0x02AB3B 20:AB2B: FF        .byte $FF
- D - I - 0x02AB3C 20:AB2C: 00        .byte $00
- D - I - 0x02AB3D 20:AB2D: 00        .byte $00
- - - - - 0x02AB3E 20:AB2E: 00        .byte $00
off_AB2F_DA:
- D - I - 0x02AB3F 20:AB2F: 01        .byte $01	; <あ>
- D - I - 0x02AB40 20:AB30: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB41 20:AB31: 34        .byte $34	; <1>
- D - I - 0x02AB42 20:AB32: FF        .byte $FF
- D - I - 0x02AB43 20:AB33: 4C        .byte $4C	; <シ>
- D - I - 0x02AB44 20:AB34: 00        .byte $00
- - - - - 0x02AB45 20:AB35: 00        .byte $00
off_AB36_DB:
- D - I - 0x02AB46 20:AB36: 01        .byte $01	; <あ>
- D - I - 0x02AB47 20:AB37: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB48 20:AB38: DA        .byte $DA
- D - I - 0x02AB49 20:AB39: FF        .byte $FF
- D - I - 0x02AB4A 20:AB3A: 00        .byte $00
- D - I - 0x02AB4B 20:AB3B: 00        .byte $00
- D - I - 0x02AB4C 20:AB3C: 00        .byte $00
off_AB3D_DC:
- D - I - 0x02AB4D 20:AB3D: 01        .byte $01	; <あ>
- D - I - 0x02AB4E 20:AB3E: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB4F 20:AB3F: D6        .byte $D6
- D - I - 0x02AB50 20:AB40: FD        .byte $FD
- D - I - 0x02AB51 20:AB41: 88        .byte $88	; <H>
- D - I - 0x02AB52 20:AB42: 00        .byte $00
- - - - - 0x02AB53 20:AB43: 00        .byte $00
off_AB44_DD:
- D - I - 0x02AB54 20:AB44: 01        .byte $01	; <あ>
- D - I - 0x02AB55 20:AB45: 16        .byte $16	; <に>
- D - I - 0x02AB56 20:AB46: F5        .byte $F5
- D - I - 0x02AB57 20:AB47: FB        .byte $FB
- D - I - 0x02AB58 20:AB48: 00        .byte $00
- D - I - 0x02AB59 20:AB49: 00        .byte $00
- D - I - 0x02AB5A 20:AB4A: 00        .byte $00
off_AB4B_DE:
- D - I - 0x02AB5B 20:AB4B: 01        .byte $01	; <あ>
- D - I - 0x02AB5C 20:AB4C: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB5D 20:AB4D: 20        .byte $20	; <み>
- D - I - 0x02AB5E 20:AB4E: FD        .byte $FD
- D - I - 0x02AB5F 20:AB4F: 24        .byte $24	; <や>
- D - I - 0x02AB60 20:AB50: FB        .byte $FB
- D - I - 0x02AB61 20:AB51: 00        .byte $00
off_AB52_DF:
- D - I - 0x02AB62 20:AB52: 01        .byte $01	; <あ>
- D - I - 0x02AB63 20:AB53: 0A        .byte $0A	; <こ>
- D - I - 0x02AB64 20:AB54: 00        .byte $00
- D - I - 0x02AB65 20:AB55: 00        .byte $00
- D - I - 0x02AB66 20:AB56: 40        .byte $40	; <「>
- D - I - 0x02AB67 20:AB57: 06        .byte $06	; <か>
- - - - - 0x02AB68 20:AB58: 00        .byte $00
off_AB59_E0:
- D - I - 0x02AB69 20:AB59: 01        .byte $01	; <あ>
- D - I - 0x02AB6A 20:AB5A: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB6B 20:AB5B: C0        .byte $C0	; <ヅ>
- D - I - 0x02AB6C 20:AB5C: F5        .byte $F5
- D - I - 0x02AB6D 20:AB5D: 00        .byte $00
- D - I - 0x02AB6E 20:AB5E: 00        .byte $00
- D - I - 0x02AB6F 20:AB5F: 00        .byte $00
off_AB60_E1:
- D - I - 0x02AB70 20:AB60: 01        .byte $01	; <あ>
- D - I - 0x02AB71 20:AB61: 1E        .byte $1E	; <ほ>
- D - I - 0x02AB72 20:AB62: 40        .byte $40	; <「>
- D - I - 0x02AB73 20:AB63: 0A        .byte $0A	; <こ>
- D - I - 0x02AB74 20:AB64: 00        .byte $00
- D - I - 0x02AB75 20:AB65: 00        .byte $00
- D - I - 0x02AB76 20:AB66: 00        .byte $00
off_AB67_E2:
- - - - - 0x02AB77 20:AB67: 00        .byte $00
off_AB68_E3:
- - - - - 0x02AB78 20:AB68: 01        .byte $01	; <あ>
- - - - - 0x02AB79 20:AB69: 3C        .byte $3C	; <9>
- - - - - 0x02AB7A 20:AB6A: 53        .byte $53	; <テ>
- - - - - 0x02AB7B 20:AB6B: 04        .byte $04	; <え>
- - - - - 0x02AB7C 20:AB6C: FA        .byte $FA
- - - - - 0x02AB7D 20:AB6D: FE        .byte $FE
- - - - - 0x02AB7E 20:AB6E: 00        .byte $00
off_AB6F_E4:
- D - I - 0x02AB7F 20:AB6F: 01        .byte $01	; <あ>
- D - I - 0x02AB80 20:AB70: 27        .byte $27	; <ら>
- D - I - 0x02AB81 20:AB71: 2E        .byte $2E	; <ん>
- D - I - 0x02AB82 20:AB72: FF        .byte $FF
- D - I - 0x02AB83 20:AB73: 3B        .byte $3B	; <8>
- D - I - 0x02AB84 20:AB74: 00        .byte $00
- D - I - 0x02AB85 20:AB75: 00        .byte $00
off_AB76_E5:
- D - I - 0x02AB86 20:AB76: 02        .byte $02	; <い>
- D - I - 0x02AB87 20:AB77: 96        .byte $96
- D - I - 0x02AB88 20:AB78: FE        .byte $FE
- D - I - 0x02AB89 20:AB79: FF        .byte $FF
- D - I - 0x02AB8A 20:AB7A: 00        .byte $00
- D - I - 0x02AB8B 20:AB7B: 00        .byte $00
- - - - - 0x02AB8C 20:AB7C: 00        .byte $00
off_AB7D_E6:
- D - I - 0x02AB8D 20:AB7D: 02        .byte $02	; <い>
- D - I - 0x02AB8E 20:AB7E: 96        .byte $96
- D - I - 0x02AB8F 20:AB7F: 02        .byte $02	; <い>
- D - I - 0x02AB90 20:AB80: 00        .byte $00
- D - I - 0x02AB91 20:AB81: 00        .byte $00
- D - I - 0x02AB92 20:AB82: 00        .byte $00
- - - - - 0x02AB93 20:AB83: 00        .byte $00
off_AB84_E7:
- D - I - 0x02AB94 20:AB84: 01        .byte $01	; <あ>
- D - I - 0x02AB95 20:AB85: 28        .byte $28	; <り>
- D - I - 0x02AB96 20:AB86: 00        .byte $00
- D - I - 0x02AB97 20:AB87: 06        .byte $06	; <か>
- D - I - 0x02AB98 20:AB88: 00        .byte $00
- D - I - 0x02AB99 20:AB89: FE        .byte $FE
- - - - - 0x02AB9A 20:AB8A: 00        .byte $00
off_AB8B_E8:
- D - I - 0x02AB9B 20:AB8B: 03        .byte $03	; <う>
- D - I - 0x02AB9C 20:AB8C: 03        .byte $03	; <う>
- D - I - 0x02AB9D 20:AB8D: 00        .byte $00
- D - I - 0x02AB9E 20:AB8E: 00        .byte $00
- D - I - 0x02AB9F 20:AB8F: 00        .byte $00
- D - I - 0x02ABA0 20:AB90: FD        .byte $FD
- D - I - 0x02ABA1 20:AB91: 40        .byte $40	; <「>
- D - I - 0x02ABA2 20:AB92: 00        .byte $00
- D - I - 0x02ABA3 20:AB93: 00        .byte $00
- D - I - 0x02ABA4 20:AB94: 01        .byte $01	; <あ>
- D - I - 0x02ABA5 20:AB95: 03        .byte $03	; <う>
- D - I - 0x02ABA6 20:AB96: 03        .byte $03	; <う>
- D - I - 0x02ABA7 20:AB97: 00        .byte $00
- D - I - 0x02ABA8 20:AB98: 03        .byte $03	; <う>
- D - I - 0x02ABA9 20:AB99: 00        .byte $00
- D - I - 0x02ABAA 20:AB9A: 00        .byte $00
- D - I - 0x02ABAB 20:AB9B: C0        .byte $C0	; <ヅ>
- D - I - 0x02ABAC 20:AB9C: FE        .byte $FE
- D - I - 0x02ABAD 20:AB9D: 80        .byte $80
- D - I - 0x02ABAE 20:AB9E: 00        .byte $00
- D - I - 0x02ABAF 20:AB9F: 03        .byte $03	; <う>
- D - I - 0x02ABB0 20:ABA0: 03        .byte $03	; <う>
- D - I - 0x02ABB1 20:ABA1: 00        .byte $00
- D - I - 0x02ABB2 20:ABA2: 00        .byte $00
- D - I - 0x02ABB3 20:ABA3: 00        .byte $00
- D - I - 0x02ABB4 20:ABA4: 03        .byte $03	; <う>
- D - I - 0x02ABB5 20:ABA5: 40        .byte $40	; <「>
- D - I - 0x02ABB6 20:ABA6: FF        .byte $FF
- D - I - 0x02ABB7 20:ABA7: 00        .byte $00
- D - I - 0x02ABB8 20:ABA8: FF        .byte $FF
- D - I - 0x02ABB9 20:ABA9: 03        .byte $03	; <う>
- D - I - 0x02ABBA 20:ABAA: 03        .byte $03	; <う>
- D - I - 0x02ABBB 20:ABAB: 00        .byte $00
- D - I - 0x02ABBC 20:ABAC: FD        .byte $FD
- D - I - 0x02ABBD 20:ABAD: 00        .byte $00
- D - I - 0x02ABBE 20:ABAE: 00        .byte $00
- D - I - 0x02ABBF 20:ABAF: C0        .byte $C0	; <ヅ>
- D - I - 0x02ABC0 20:ABB0: 00        .byte $00
- D - I - 0x02ABC1 20:ABB1: 80        .byte $80
- D - I - 0x02ABC2 20:ABB2: FF        .byte $FF
- D - I - 0x02ABC3 20:ABB3: 03        .byte $03	; <う>
- D - I - 0x02ABC4 20:ABB4: 03        .byte $03	; <う>
- D - I - 0x02ABC5 20:ABB5: 00        .byte $00
- D - I - 0x02ABC6 20:ABB6: 00        .byte $00
- D - I - 0x02ABC7 20:ABB7: 00        .byte $00
- D - I - 0x02ABC8 20:ABB8: FB        .byte $FB
- D - I - 0x02ABC9 20:ABB9: F4        .byte $F4
- D - I - 0x02ABCA 20:ABBA: 00        .byte $00
- D - I - 0x02ABCB 20:ABBB: F0        .byte $F0
- D - I - 0x02ABCC 20:ABBC: 00        .byte $00
- D - I - 0x02ABCD 20:ABBD: 03        .byte $03	; <う>
- D - I - 0x02ABCE 20:ABBE: 03        .byte $03	; <う>
- D - I - 0x02ABCF 20:ABBF: 00        .byte $00
- D - I - 0x02ABD0 20:ABC0: 05        .byte $05	; <お>
- D - I - 0x02ABD1 20:ABC1: 00        .byte $00
- D - I - 0x02ABD2 20:ABC2: 00        .byte $00
- D - I - 0x02ABD3 20:ABC3: D4        .byte $D4
- D - I - 0x02ABD4 20:ABC4: FE        .byte $FE
- D - I - 0x02ABD5 20:ABC5: 30        .byte $30	; <ゃ>
- D - I - 0x02ABD6 20:ABC6: 01        .byte $01	; <あ>
- D - I - 0x02ABD7 20:ABC7: 03        .byte $03	; <う>
- D - I - 0x02ABD8 20:ABC8: 03        .byte $03	; <う>
- D - I - 0x02ABD9 20:ABC9: 00        .byte $00
- D - I - 0x02ABDA 20:ABCA: 00        .byte $00
- D - I - 0x02ABDB 20:ABCB: 00        .byte $00
- D - I - 0x02ABDC 20:ABCC: 05        .byte $05	; <お>
- D - I - 0x02ABDD 20:ABCD: 94        .byte $94
- D - I - 0x02ABDE 20:ABCE: FE        .byte $FE
- D - I - 0x02ABDF 20:ABCF: 10        .byte $10	; <た>
- D - I - 0x02ABE0 20:ABD0: FF        .byte $FF
- D - I - 0x02ABE1 20:ABD1: 03        .byte $03	; <う>
- D - I - 0x02ABE2 20:ABD2: 03        .byte $03	; <う>
- D - I - 0x02ABE3 20:ABD3: 00        .byte $00
- D - I - 0x02ABE4 20:ABD4: FB        .byte $FB
- D - I - 0x02ABE5 20:ABD5: 00        .byte $00
- D - I - 0x02ABE6 20:ABD6: 00        .byte $00
- D - I - 0x02ABE7 20:ABD7: 64        .byte $64	; <ヤ>
- D - I - 0x02ABE8 20:ABD8: 00        .byte $00
- D - I - 0x02ABE9 20:ABD9: D0        .byte $D0	; <ペ>
- D - I - 0x02ABEA 20:ABDA: FE        .byte $FE
- D - I - 0x02ABEB 20:ABDB: 03        .byte $03	; <う>
- D - I - 0x02ABEC 20:ABDC: 03        .byte $03	; <う>
- D - I - 0x02ABED 20:ABDD: 00        .byte $00
- D - I - 0x02ABEE 20:ABDE: 00        .byte $00
- D - I - 0x02ABEF 20:ABDF: 00        .byte $00
- D - I - 0x02ABF0 20:ABE0: F5        .byte $F5
- D - I - 0x02ABF1 20:ABE1: C0        .byte $C0	; <ヅ>
- D - I - 0x02ABF2 20:ABE2: 01        .byte $01	; <あ>
- D - I - 0x02ABF3 20:ABE3: 00        .byte $00
- D - I - 0x02ABF4 20:ABE4: 03        .byte $03	; <う>
- D - I - 0x02ABF5 20:ABE5: 03        .byte $03	; <う>
- D - I - 0x02ABF6 20:ABE6: 03        .byte $03	; <う>
- D - I - 0x02ABF7 20:ABE7: 00        .byte $00
- D - I - 0x02ABF8 20:ABE8: 0B        .byte $0B	; <さ>
- D - I - 0x02ABF9 20:ABE9: 00        .byte $00
- D - I - 0x02ABFA 20:ABEA: 00        .byte $00
- D - I - 0x02ABFB 20:ABEB: 40        .byte $40	; <「>
- D - I - 0x02ABFC 20:ABEC: FC        .byte $FC
- D - I - 0x02ABFD 20:ABED: 80        .byte $80
- D - I - 0x02ABFE 20:ABEE: 02        .byte $02	; <い>
- D - I - 0x02ABFF 20:ABEF: 03        .byte $03	; <う>
- D - I - 0x02AC00 20:ABF0: 03        .byte $03	; <う>
- D - I - 0x02AC01 20:ABF1: 00        .byte $00
- D - I - 0x02AC02 20:ABF2: 00        .byte $00
- D - I - 0x02AC03 20:ABF3: 00        .byte $00
- D - I - 0x02AC04 20:ABF4: 0B        .byte $0B	; <さ>
- D - I - 0x02AC05 20:ABF5: C0        .byte $C0	; <ヅ>
- D - I - 0x02AC06 20:ABF6: FC        .byte $FC
- D - I - 0x02AC07 20:ABF7: 00        .byte $00
- D - I - 0x02AC08 20:ABF8: FD        .byte $FD
- D - I - 0x02AC09 20:ABF9: 03        .byte $03	; <う>
- D - I - 0x02AC0A 20:ABFA: 03        .byte $03	; <う>
- D - I - 0x02AC0B 20:ABFB: 00        .byte $00
- D - I - 0x02AC0C 20:ABFC: F5        .byte $F5
- D - I - 0x02AC0D 20:ABFD: 00        .byte $00
- D - I - 0x02AC0E 20:ABFE: 00        .byte $00
- D - I - 0x02AC0F 20:ABFF: 40        .byte $40	; <「>
- D - I - 0x02AC10 20:AC00: 02        .byte $02	; <い>
- D - I - 0x02AC11 20:AC01: 80        .byte $80
- D - I - 0x02AC12 20:AC02: FD        .byte $FD
off_AC03:
- D - I - 0x02AC13 20:AC03: 03        .byte $03	; <う>
- D - I - 0x02AC14 20:AC04: 03        .byte $03	; <う>
- D - I - 0x02AC15 20:AC05: 00        .byte $00
- D - I - 0x02AC16 20:AC06: 00        .byte $00
- D - I - 0x02AC17 20:AC07: 46        .byte $46	; <カ>
- D - I - 0x02AC18 20:AC08: EA        .byte $EA
- D - I - 0x02AC19 20:AC09: 80        .byte $80
- D - I - 0x02AC1A 20:AC0A: 05        .byte $05	; <お>
- D - I - 0x02AC1B 20:AC0B: 80        .byte $80
- D - I - 0x02AC1C 20:AC0C: 05        .byte $05	; <お>
- D - I - 0x02AC1D 20:AC0D: 03        .byte $03	; <う>
- D - I - 0x02AC1E 20:AC0E: 03        .byte $03	; <う>
- D - I - 0x02AC1F 20:AC0F: BA        .byte $BA	; <ジ>
- D - I - 0x02AC20 20:AC10: 15        .byte $15	; <な>
- D - I - 0x02AC21 20:AC11: 00        .byte $00
- D - I - 0x02AC22 20:AC12: 00        .byte $00
- D - I - 0x02AC23 20:AC13: 80        .byte $80
- D - I - 0x02AC24 20:AC14: FA        .byte $FA
- D - I - 0x02AC25 20:AC15: 80        .byte $80
- D - I - 0x02AC26 20:AC16: 05        .byte $05	; <お>
- D - I - 0x02AC27 20:AC17: 03        .byte $03	; <う>
- D - I - 0x02AC28 20:AC18: 03        .byte $03	; <う>
- D - I - 0x02AC29 20:AC19: 00        .byte $00
- D - I - 0x02AC2A 20:AC1A: 00        .byte $00
- D - I - 0x02AC2B 20:AC1B: BA        .byte $BA	; <ジ>
- D - I - 0x02AC2C 20:AC1C: 15        .byte $15	; <な>
- D - I - 0x02AC2D 20:AC1D: 80        .byte $80
- D - I - 0x02AC2E 20:AC1E: FA        .byte $FA
- D - I - 0x02AC2F 20:AC1F: 80        .byte $80
- D - I - 0x02AC30 20:AC20: FA        .byte $FA
- D - I - 0x02AC31 20:AC21: 03        .byte $03	; <う>
- D - I - 0x02AC32 20:AC22: 03        .byte $03	; <う>
- D - I - 0x02AC33 20:AC23: 46        .byte $46	; <カ>
- D - I - 0x02AC34 20:AC24: EA        .byte $EA
- D - I - 0x02AC35 20:AC25: 00        .byte $00
- D - I - 0x02AC36 20:AC26: 00        .byte $00
- D - I - 0x02AC37 20:AC27: 80        .byte $80
- D - I - 0x02AC38 20:AC28: 05        .byte $05	; <お>
- D - I - 0x02AC39 20:AC29: 80        .byte $80
- D - I - 0x02AC3A 20:AC2A: FA        .byte $FA
- D - I - 0x02AC3B 20:AC2B: 04        .byte $04	; <え>
- D - I - 0x02AC3C 20:AC2C: 03 AC     .word off_AC03
- - - - - 0x02AC3E 20:AC2E: 04        .byte $04	; <え>
- - - - - 0x02AC3F 20:AC2F: 03 AC     .word off_AC03
off_AC31_E9:
- D - I - 0x02AC41 20:AC31: 03        .byte $03	; <う>
- D - I - 0x02AC42 20:AC32: 1E        .byte $1E	; <ほ>
- D - I - 0x02AC43 20:AC33: 00        .byte $00
- D - I - 0x02AC44 20:AC34: 00        .byte $00
- D - I - 0x02AC45 20:AC35: 80        .byte $80
- D - I - 0x02AC46 20:AC36: 05        .byte $05	; <お>
- D - I - 0x02AC47 20:AC37: 00        .byte $00
- D - I - 0x02AC48 20:AC38: 00        .byte $00
- D - I - 0x02AC49 20:AC39: D8        .byte $D8
- D - I - 0x02AC4A 20:AC3A: FF        .byte $FF
- D - I - 0x02AC4B 20:AC3B: 00        .byte $00
off_AC3C_EA:
- D - I - 0x02AC4C 20:AC3C: 03        .byte $03	; <う>
- D - I - 0x02AC4D 20:AC3D: 1E        .byte $1E	; <ほ>
- D - I - 0x02AC4E 20:AC3E: 00        .byte $00
- D - I - 0x02AC4F 20:AC3F: F6        .byte $F6
- D - I - 0x02AC50 20:AC40: 00        .byte $00
- D - I - 0x02AC51 20:AC41: 01        .byte $01	; <あ>
- D - I - 0x02AC52 20:AC42: 40        .byte $40	; <「>
- D - I - 0x02AC53 20:AC43: 00        .byte $00
- D - I - 0x02AC54 20:AC44: F8        .byte $F8
- D - I - 0x02AC55 20:AC45: FF        .byte $FF
- - - - - 0x02AC56 20:AC46: 00        .byte $00



tbl_AC47:
- D - I - 0x02AC57 20:AC47: 25 AE     .word off_AE25_00
- D - I - 0x02AC59 20:AC49: 27 AE     .word off_AE27_01
- D - I - 0x02AC5B 20:AC4B: 31 AE     .word off_AE31_02
- D - I - 0x02AC5D 20:AC4D: 34 AE     .word off_AE34_03
- D - I - 0x02AC5F 20:AC4F: 36 AE     .word off_AE36_04
- D - I - 0x02AC61 20:AC51: 38 AE     .word off_AE38_05
- D - I - 0x02AC63 20:AC53: 3A AE     .word off_AE3A_06
- D - I - 0x02AC65 20:AC55: 3C AE     .word off_AE3C_07
- D - I - 0x02AC67 20:AC57: 3E AE     .word off_AE3E_08
- D - I - 0x02AC69 20:AC59: 41 AE     .word off_AE41_09
- D - I - 0x02AC6B 20:AC5B: 43 AE     .word off_AE43_0A
- D - I - 0x02AC6D 20:AC5D: 45 AE     .word off_AE45_0B
- D - I - 0x02AC6F 20:AC5F: 49 AE     .word off_AE49_0C
- D - I - 0x02AC71 20:AC61: 55 AE     .word off_AE55_0D
- D - I - 0x02AC73 20:AC63: 5F AE     .word off_AE5F_0E
- D - I - 0x02AC75 20:AC65: 6B AE     .word off_AE6B_0F
- D - I - 0x02AC77 20:AC67: 75 AE     .word off_AE75_10
- D - I - 0x02AC79 20:AC69: 78 AE     .word off_AE78_11
- D - I - 0x02AC7B 20:AC6B: 82 AE     .word off_AE82_12
- D - I - 0x02AC7D 20:AC6D: 8A AE     .word off_AE8A_13
- D - I - 0x02AC7F 20:AC6F: 8E AE     .word off_AE8E_14
- D - I - 0x02AC81 20:AC71: 91 AE     .word off_AE91_15
- D - I - 0x02AC83 20:AC73: 99 AE     .word off_AE99_16
- D - I - 0x02AC85 20:AC75: E9 AE     .word off_AEE9_17
- D - I - 0x02AC87 20:AC77: EB AE     .word off_AEEB_18
- - - - - 0x02AC89 20:AC79: EE AE     .word off_AEEE_19
- D - I - 0x02AC8B 20:AC7B: F0 AE     .word off_AEF0_1A
- D - I - 0x02AC8D 20:AC7D: FB AE     .word off_AEFB_1B
- D - I - 0x02AC8F 20:AC7F: 0E AF     .word off_AF0E_1C
- D - I - 0x02AC91 20:AC81: 11 AF     .word off_AF11_1D
- D - I - 0x02AC93 20:AC83: 13 AF     .word off_AF13_1E
- D - I - 0x02AC95 20:AC85: 1B AF     .word off_AF1B_1F
- D - I - 0x02AC97 20:AC87: 1E AF     .word off_AF1E_20
- D - I - 0x02AC99 20:AC89: 21 AF     .word off_AF21_21
- D - I - 0x02AC9B 20:AC8B: 23 AF     .word off_AF23_22
- D - I - 0x02AC9D 20:AC8D: 26 AF     .word off_AF26_23
- D - I - 0x02AC9F 20:AC8F: 59 AF     .word off_AF59_24
- D - I - 0x02ACA1 20:AC91: 5B AF     .word off_AF5B_25
- D - I - 0x02ACA3 20:AC93: 5D AF     .word off_AF5D_26
- D - I - 0x02ACA5 20:AC95: 5F AF     .word off_AF5F_27
- D - I - 0x02ACA7 20:AC97: 61 AF     .word off_AF61_28
- D - I - 0x02ACA9 20:AC99: 63 AF     .word off_AF63_29
- D - I - 0x02ACAB 20:AC9B: 66 AF     .word off_AF66_2A
- D - I - 0x02ACAD 20:AC9D: 68 AF     .word off_AF68_2B
- D - I - 0x02ACAF 20:AC9F: 6A AF     .word off_AF6A_2C
- D - I - 0x02ACB1 20:ACA1: 70 AF     .word off_AF70_2D
- D - I - 0x02ACB3 20:ACA3: 72 AF     .word off_AF72_2E
- D - I - 0x02ACB5 20:ACA5: 7C AF     .word off_AF7C_2F
- D - I - 0x02ACB7 20:ACA7: 7E AF     .word off_AF7E_30
- D - I - 0x02ACB9 20:ACA9: 81 AF     .word off_AF81_31
- D - I - 0x02ACBB 20:ACAB: 87 AF     .word off_AF87_32
- D - I - 0x02ACBD 20:ACAD: 89 AF     .word off_AF89_33
- D - I - 0x02ACBF 20:ACAF: 8B AF     .word off_AF8B_34
- D - I - 0x02ACC1 20:ACB1: 8D AF     .word off_AF8D_35
- D - I - 0x02ACC3 20:ACB3: 94 AF     .word off_AF94_36
- D - I - 0x02ACC5 20:ACB5: 9D AF     .word off_AF9D_37
- D - I - 0x02ACC7 20:ACB7: AC AF     .word off_AFAC_38
- D - I - 0x02ACC9 20:ACB9: AE AF     .word off_AFAE_39
- D - I - 0x02ACCB 20:ACBB: B8 AF     .word off_AFB8_3A
- D - I - 0x02ACCD 20:ACBD: BA AF     .word off_AFBA_3B
- D - I - 0x02ACCF 20:ACBF: C4 AF     .word off_AFC4_3C
- D - I - 0x02ACD1 20:ACC1: D0 AF     .word off_AFD0_3D
- D - I - 0x02ACD3 20:ACC3: D2 AF     .word off_AFD2_3E
- D - I - 0x02ACD5 20:ACC5: DB AF     .word off_AFDB_3F
- D - I - 0x02ACD7 20:ACC7: E3 AF     .word off_AFE3_40
- D - I - 0x02ACD9 20:ACC9: F5 AF     .word off_AFF5_41
- D - I - 0x02ACDB 20:ACCB: F7 AF     .word off_AFF7_42
- - - - - 0x02ACDD 20:ACCD: F9 AF     .word off_AFF9_43
- D - I - 0x02ACDF 20:ACCF: FC AF     .word off_AFFC_44
- D - I - 0x02ACE1 20:ACD1: FE AF     .word off_AFFE_45
- D - I - 0x02ACE3 20:ACD3: 07 B0     .word off_B007_46
- D - I - 0x02ACE5 20:ACD5: 0E B0     .word off_B00E_47
- D - I - 0x02ACE7 20:ACD7: 17 B0     .word off_B017_48
- D - I - 0x02ACE9 20:ACD9: 1E B0     .word off_B01E_49
- - - - - 0x02ACEB 20:ACDB: 26 B0     .word off_B026_4A_4B
- D - I - 0x02ACED 20:ACDD: 26 B0     .word off_B026_4A_4B
- D - I - 0x02ACEF 20:ACDF: 31 B0     .word off_B031_4C
- D - I - 0x02ACF1 20:ACE1: 40 B0     .word off_B040_4D
- D - I - 0x02ACF3 20:ACE3: 4D B0     .word off_B04D_4E
- D - I - 0x02ACF5 20:ACE5: 5A B0     .word off_B05A_4F
- D - I - 0x02ACF7 20:ACE7: 65 B0     .word off_B065_50
- D - I - 0x02ACF9 20:ACE9: 74 B0     .word off_B074_51
- D - I - 0x02ACFB 20:ACEB: 76 B0     .word off_B076_52
- D - I - 0x02ACFD 20:ACED: 78 B0     .word off_B078_53
- D - I - 0x02ACFF 20:ACEF: 7F B0     .word off_B07F_54
- D - I - 0x02AD01 20:ACF1: 8A B0     .word off_B08A_55
- D - I - 0x02AD03 20:ACF3: 8C B0     .word off_B08C_56
- D - I - 0x02AD05 20:ACF5: 9B B0     .word off_B09B_57
- D - I - 0x02AD07 20:ACF7: 9D B0     .word off_B09D_58
- D - I - 0x02AD09 20:ACF9: A8 B0     .word off_B0A8_59
- D - I - 0x02AD0B 20:ACFB: AB B0     .word off_B0AB_5A
- D - I - 0x02AD0D 20:ACFD: AE B0     .word off_B0AE_5B
- D - I - 0x02AD0F 20:ACFF: B1 B0     .word off_B0B1_5C
- D - I - 0x02AD11 20:AD01: B4 B0     .word off_B0B4_5D
- D - I - 0x02AD13 20:AD03: B7 B0     .word off_B0B7_5E
- D - I - 0x02AD15 20:AD05: BA B0     .word off_B0BA_5F
- D - I - 0x02AD17 20:AD07: BC B0     .word off_B0BC_60
- D - I - 0x02AD19 20:AD09: BE B0     .word off_B0BE_61
- D - I - 0x02AD1B 20:AD0B: C0 B0     .word off_B0C0_62
- D - I - 0x02AD1D 20:AD0D: C2 B0     .word off_B0C2_63
- D - I - 0x02AD1F 20:AD0F: C4 B0     .word off_B0C4_64
- D - I - 0x02AD21 20:AD11: C6 B0     .word off_B0C6_65
- D - I - 0x02AD23 20:AD13: C8 B0     .word off_B0C8_66
- D - I - 0x02AD25 20:AD15: CB B0     .word off_B0CB_67
- D - I - 0x02AD27 20:AD17: CE B0     .word off_B0CE_68
- D - I - 0x02AD29 20:AD19: D2 B0     .word off_B0D2_69
- D - I - 0x02AD2B 20:AD1B: DE B0     .word off_B0DE_6A
- D - I - 0x02AD2D 20:AD1D: EB B0     .word off_B0EB_6B
- D - I - 0x02AD2F 20:AD1F: F3 B0     .word off_B0F3_6C
- D - I - 0x02AD31 20:AD21: FE B0     .word off_B0FE_6D
- D - I - 0x02AD33 20:AD23: 0B B1     .word off_B10B_6E
- D - I - 0x02AD35 20:AD25: 16 B1     .word off_B116_6F
- D - I - 0x02AD37 20:AD27: 21 B1     .word off_B121_70
- D - I - 0x02AD39 20:AD29: 5D B1     .word off_B15D_71
- D - I - 0x02AD3B 20:AD2B: 0E B2     .word off_B20E_72
- D - I - 0x02AD3D 20:AD2D: 77 B2     .word off_B277_73
- D - I - 0x02AD3F 20:AD2F: 7C B2     .word off_B27C_74
- D - I - 0x02AD41 20:AD31: 81 B2     .word off_B281_75
- D - I - 0x02AD43 20:AD33: 86 B2     .word off_B286_76
- D - I - 0x02AD45 20:AD35: 8B B2     .word off_B28B_77
- D - I - 0x02AD47 20:AD37: 90 B2     .word off_B290_78
- D - I - 0x02AD49 20:AD39: 92 B2     .word off_B292_79
- - - - - 0x02AD4B 20:AD3B: 94 B2     .word off_B294_7A
- D - I - 0x02AD4D 20:AD3D: 97 B2     .word off_B297_7B
- D - I - 0x02AD4F 20:AD3F: A3 B2     .word off_B2A3_7C
- D - I - 0x02AD51 20:AD41: AF B2     .word off_B2AF_7D
- D - I - 0x02AD53 20:AD43: BB B2     .word off_B2BB_7E
- D - I - 0x02AD55 20:AD45: C0 B2     .word off_B2C0_7F
- D - I - 0x02AD57 20:AD47: CF B2     .word off_B2CF_80
- D - I - 0x02AD59 20:AD49: D2 B2     .word off_B2D2_81
- D - I - 0x02AD5B 20:AD4B: D4 B2     .word off_B2D4_82
- D - I - 0x02AD5D 20:AD4D: DA B2     .word off_B2DA_83
- D - I - 0x02AD5F 20:AD4F: E0 B2     .word off_B2E0_84
- D - I - 0x02AD61 20:AD51: EF B2     .word off_B2EF_85
- D - I - 0x02AD63 20:AD53: F2 B2     .word off_B2F2_86
- - - - - 0x02AD65 20:AD55: F5 B2     .word off_B2F5_87
- - - - - 0x02AD67 20:AD57: F8 B2     .word off_B2F8_88
- - - - - 0x02AD69 20:AD59: FA B2     .word off_B2FA_89
- D - I - 0x02AD6B 20:AD5B: FD B2     .word off_B2FD_8A
- D - I - 0x02AD6D 20:AD5D: 01 B3     .word off_B301_8B
- D - I - 0x02AD6F 20:AD5F: 04 B3     .word off_B304_8C
- D - I - 0x02AD71 20:AD61: 06 B3     .word off_B306_8D
- D - I - 0x02AD73 20:AD63: 08 B3     .word off_B308_8E
- D - I - 0x02AD75 20:AD65: 0A B3     .word off_B30A_8F
- D - I - 0x02AD77 20:AD67: 0C B3     .word off_B30C_90
- D - I - 0x02AD79 20:AD69: 0E B3     .word off_B30E_91
- D - I - 0x02AD7B 20:AD6B: 10 B3     .word off_B310_92
- D - I - 0x02AD7D 20:AD6D: 12 B3     .word off_B312_93
- D - I - 0x02AD7F 20:AD6F: 14 B3     .word off_B314_94
- D - I - 0x02AD81 20:AD71: 28 B3     .word off_B328_95
- D - I - 0x02AD83 20:AD73: 2B B3     .word off_B32B_96
- D - I - 0x02AD85 20:AD75: 2E B3     .word off_B32E_97
- D - I - 0x02AD87 20:AD77: 33 B3     .word off_B333_98
- D - I - 0x02AD89 20:AD79: 35 B3     .word off_B335_99
- D - I - 0x02AD8B 20:AD7B: 37 B3     .word off_B337_9A
- D - I - 0x02AD8D 20:AD7D: 39 B3     .word off_B339_9B
- D - I - 0x02AD8F 20:AD7F: 3B B3     .word off_B33B_9C
- D - I - 0x02AD91 20:AD81: 3D B3     .word off_B33D_9D
- D - I - 0x02AD93 20:AD83: 3F B3     .word off_B33F_9E
- D - I - 0x02AD95 20:AD85: 41 B3     .word off_B341_9F
- D - I - 0x02AD97 20:AD87: 43 B3     .word off_B343_A0
- D - I - 0x02AD99 20:AD89: 45 B3     .word off_B345_A1
- D - I - 0x02AD9B 20:AD8B: 47 B3     .word off_B347_A2
- D - I - 0x02AD9D 20:AD8D: 49 B3     .word off_B349_A3
- D - I - 0x02AD9F 20:AD8F: 4B B3     .word off_B34B_A4
- D - I - 0x02ADA1 20:AD91: 4D B3     .word off_B34D_A5
- D - I - 0x02ADA3 20:AD93: 4F B3     .word off_B34F_A6
- D - I - 0x02ADA5 20:AD95: 51 B3     .word off_B351_A7
- D - I - 0x02ADA7 20:AD97: 53 B3     .word off_B353_A8
- D - I - 0x02ADA9 20:AD99: 55 B3     .word off_B355_A9
- D - I - 0x02ADAB 20:AD9B: 57 B3     .word off_B357_AA
- D - I - 0x02ADAD 20:AD9D: 59 B3     .word off_B359_AB
- D - I - 0x02ADAF 20:AD9F: 5B B3     .word off_B35B_AC
- D - I - 0x02ADB1 20:ADA1: 5D B3     .word off_B35D_AD
- D - I - 0x02ADB3 20:ADA3: 5F B3     .word off_B35F_AE
- D - I - 0x02ADB5 20:ADA5: 61 B3     .word off_B361_AF
- D - I - 0x02ADB7 20:ADA7: 63 B3     .word off_B363_B0
- D - I - 0x02ADB9 20:ADA9: 65 B3     .word off_B365_B1
- D - I - 0x02ADBB 20:ADAB: 67 B3     .word off_B367_B2
- D - I - 0x02ADBD 20:ADAD: 71 B3     .word off_B371_B3
- D - I - 0x02ADBF 20:ADAF: 73 B3     .word off_B373_B4
- - - - - 0x02ADC1 20:ADB1: A0 B3     .word off_B3A0_B5
- D - I - 0x02ADC3 20:ADB3: C1 B3     .word off_B3C1_B6
- D - I - 0x02ADC5 20:ADB5: E8 B3     .word off_B3E8_B7
- D - I - 0x02ADC7 20:ADB7: 12 B4     .word off_B412_B8
- D - I - 0x02ADC9 20:ADB9: 39 B4     .word off_B439_B9
- D - I - 0x02ADCB 20:ADBB: 3E B4     .word off_B43E_BA
- D - I - 0x02ADCD 20:ADBD: 71 B4     .word off_B471_BB
- D - I - 0x02ADCF 20:ADBF: 80 B4     .word off_B480_BC
- D - I - 0x02ADD1 20:ADC1: AC B4     .word off_B4AC_BD
- D - I - 0x02ADD3 20:ADC3: D4 B4     .word off_B4D4_BE
- - - - - 0x02ADD5 20:ADC5: E1 B4     .word off_B4E1_BF
- D - I - 0x02ADD7 20:ADC7: F0 B4     .word off_B4F0_C0
- D - I - 0x02ADD9 20:ADC9: 18 B5     .word off_B518_C1
- D - I - 0x02ADDB 20:ADCB: 27 B5     .word off_B527_C2
- D - I - 0x02ADDD 20:ADCD: 30 B5     .word off_B530_C3
- D - I - 0x02ADDF 20:ADCF: 37 B5     .word off_B537_C4
- D - I - 0x02ADE1 20:ADD1: 6A B5     .word off_B56A_C5
- D - I - 0x02ADE3 20:ADD3: 77 B5     .word off_B577_C6
- D - I - 0x02ADE5 20:ADD5: 9F B5     .word off_B59F_C7
- D - I - 0x02ADE7 20:ADD7: A5 B5     .word off_B5A5_C8
- D - I - 0x02ADE9 20:ADD9: AA B5     .word off_B5AA_C9
- D - I - 0x02ADEB 20:ADDB: AC B5     .word off_B5AC_CA
- D - I - 0x02ADED 20:ADDD: AE B5     .word off_B5AE_CB
- - - - - 0x02ADEF 20:ADDF: B0 B5     .word off_B5B0_CC
- D - I - 0x02ADF1 20:ADE1: B2 B5     .word off_B5B2_CD
- D - I - 0x02ADF3 20:ADE3: B4 B5     .word off_B5B4_CE
- D - I - 0x02ADF5 20:ADE5: BF B5     .word off_B5BF_CF
- D - I - 0x02ADF7 20:ADE7: F2 B5     .word off_B5F2_D0
- D - I - 0x02ADF9 20:ADE9: F7 B5     .word off_B5F7_D1
- D - I - 0x02ADFB 20:ADEB: FC B5     .word off_B5FC_D2
- D - I - 0x02ADFD 20:ADED: 01 B6     .word off_B601_D3
- D - I - 0x02ADFF 20:ADEF: 06 B6     .word off_B606_D4
- D - I - 0x02AE01 20:ADF1: 0B B6     .word off_B60B_D5
- D - I - 0x02AE03 20:ADF3: 10 B6     .word off_B610_D6
- - - - - 0x02AE05 20:ADF5: 15 B6     .word off_B615_D7
- D - I - 0x02AE07 20:ADF7: 1A B6     .word off_B61A_D8
- D - I - 0x02AE09 20:ADF9: 1F B6     .word off_B61F_D9
- D - I - 0x02AE0B 20:ADFB: 24 B6     .word off_B624_DA
- D - I - 0x02AE0D 20:ADFD: 29 B6     .word off_B629_DB
- D - I - 0x02AE0F 20:ADFF: 2E B6     .word off_B62E_DC
- D - I - 0x02AE11 20:AE01: 33 B6     .word off_B633_DD
- - - - - 0x02AE13 20:AE03: 38 B6     .word off_B638_DE
- D - I - 0x02AE15 20:AE05: 3D B6     .word off_B63D_DF
- D - I - 0x02AE17 20:AE07: 42 B6     .word off_B642_E0
- D - I - 0x02AE19 20:AE09: 47 B6     .word off_B647_E1
- D - I - 0x02AE1B 20:AE0B: 4C B6     .word off_B64C_E2
- D - I - 0x02AE1D 20:AE0D: 51 B6     .word off_B651_E3
- - - - - 0x02AE1F 20:AE0F: 56 B6     .word off_B656_E4
- D - I - 0x02AE21 20:AE11: 5B B6     .word off_B65B_E5
- D - I - 0x02AE23 20:AE13: 60 B6     .word off_B660_E6
- D - I - 0x02AE25 20:AE15: 66 B6     .word off_B666_E7
- D - I - 0x02AE27 20:AE17: 68 B6     .word off_B668_E8
- D - I - 0x02AE29 20:AE19: 6A B6     .word off_B66A_E9
- D - I - 0x02AE2B 20:AE1B: 6C B6     .word off_B66C_EA
- - - - - 0x02AE2D 20:AE1D: 6E B6     .word off_B66E_EB
- D - I - 0x02AE2F 20:AE1F: 7D B6     .word off_B67D_EC
- D - I - 0x02AE31 20:AE21: A1 B6     .word off_B6A1_ED
- - - - - 0x02AE33 20:AE23: C6 B6     .word off_B6C6_EE

off_AE25_00:
- D - I - 0x02AE35 20:AE25: F7        .byte $F7
- D - I - 0x02AE36 20:AE26: BB        .byte $BB	; <ズ>
off_AE27_01:
off_AE27:
- D - I - 0x02AE37 20:AE27: 01        .byte $01	; <あ>
- D - I - 0x02AE38 20:AE28: 24        .byte $24	; <や>
- D - I - 0x02AE39 20:AE29: F6        .byte $F6
- D - I - 0x02AE3A 20:AE2A: 01        .byte $01	; <あ>
- D - I - 0x02AE3B 20:AE2B: 00        .byte $00
- D - I - 0x02AE3C 20:AE2C: 01        .byte $01	; <あ>
- D - I - 0x02AE3D 20:AE2D: 24        .byte $24	; <や>
- D - I - 0x02AE3E 20:AE2E: F3        .byte $F3
- D - I - 0x02AE3F 20:AE2F: 27 AE     .word off_AE27
off_AE31_02:
- D - I - 0x02AE41 20:AE31: F1        .byte $F1
- D - I - 0x02AE42 20:AE32: F7        .byte $F7
- D - I - 0x02AE43 20:AE33: 99        .byte $99
off_AE34_03:
- D - I - 0x02AE44 20:AE34: F7        .byte $F7
- D - I - 0x02AE45 20:AE35: 99        .byte $99
off_AE36_04:
- D - I - 0x02AE46 20:AE36: F7        .byte $F7
- D - I - 0x02AE47 20:AE37: 9D        .byte $9D
off_AE38_05:
- D - I - 0x02AE48 20:AE38: F7        .byte $F7
- D - I - 0x02AE49 20:AE39: 51        .byte $51	; <チ>
off_AE3A_06:
- D - I - 0x02AE4A 20:AE3A: F7        .byte $F7
- D - I - 0x02AE4B 20:AE3B: A2        .byte $A2	; <ぐ>
off_AE3C_07:
- D - I - 0x02AE4C 20:AE3C: F7        .byte $F7
- D - I - 0x02AE4D 20:AE3D: A8        .byte $A8	; <ぜ>
off_AE3E_08:
- D - I - 0x02AE4E 20:AE3E: F3        .byte $F3
- D - I - 0x02AE4F 20:AE3F: AE AF     .word off_AFAE
off_AE41_09:
- D - I - 0x02AE51 20:AE41: F7        .byte $F7
- D - I - 0x02AE52 20:AE42: A9        .byte $A9	; <ぞ>
off_AE43_0A:
- D - I - 0x02AE53 20:AE43: F7        .byte $F7
- D - I - 0x02AE54 20:AE44: AE        .byte $AE	; <ど>
off_AE45_0B:
- D - I - 0x02AE55 20:AE45: 02        .byte $02	; <い>
- D - I - 0x02AE56 20:AE46: B0        .byte $B0	; <び>
- D - I - 0x02AE57 20:AE47: F7        .byte $F7
- D - I - 0x02AE58 20:AE48: AF        .byte $AF	; <ば>
off_AE49_0C:
off_AE49:
- D - I - 0x02AE59 20:AE49: F1        .byte $F1
- D - I - 0x02AE5A 20:AE4A: 01        .byte $01	; <あ>
- D - I - 0x02AE5B 20:AE4B: 4F        .byte $4F	; <ソ>
- D - I - 0x02AE5C 20:AE4C: F1        .byte $F1
- D - I - 0x02AE5D 20:AE4D: F6        .byte $F6
- D - I - 0x02AE5E 20:AE4E: 02        .byte $02	; <い>
- D - I - 0x02AE5F 20:AE4F: 00        .byte $00
- D - I - 0x02AE60 20:AE50: 01        .byte $01	; <あ>
- D - I - 0x02AE61 20:AE51: 4F        .byte $4F	; <ソ>
- D - I - 0x02AE62 20:AE52: F3        .byte $F3
- D - I - 0x02AE63 20:AE53: 49 AE     .word off_AE49
off_AE55_0D:
off_AE55:
- D - I - 0x02AE65 20:AE55: 01        .byte $01	; <あ>
- D - I - 0x02AE66 20:AE56: 4F        .byte $4F	; <ソ>
- D - I - 0x02AE67 20:AE57: F6        .byte $F6
- D - I - 0x02AE68 20:AE58: 02        .byte $02	; <い>
- D - I - 0x02AE69 20:AE59: 00        .byte $00
- D - I - 0x02AE6A 20:AE5A: 01        .byte $01	; <あ>
- D - I - 0x02AE6B 20:AE5B: 4F        .byte $4F	; <ソ>
- D - I - 0x02AE6C 20:AE5C: F3        .byte $F3
- D - I - 0x02AE6D 20:AE5D: 55 AE     .word off_AE55
off_AE5F_0E:
off_AE5F:
- D - I - 0x02AE6F 20:AE5F: F1        .byte $F1
- D - I - 0x02AE70 20:AE60: 01        .byte $01	; <あ>
- D - I - 0x02AE71 20:AE61: 50        .byte $50	; <タ>
- D - I - 0x02AE72 20:AE62: F1        .byte $F1
- D - I - 0x02AE73 20:AE63: F6        .byte $F6
- D - I - 0x02AE74 20:AE64: 02        .byte $02	; <い>
- D - I - 0x02AE75 20:AE65: 00        .byte $00
- D - I - 0x02AE76 20:AE66: 01        .byte $01	; <あ>
- D - I - 0x02AE77 20:AE67: 50        .byte $50	; <タ>
- D - I - 0x02AE78 20:AE68: F3        .byte $F3
- D - I - 0x02AE79 20:AE69: 5F AE     .word off_AE5F
off_AE6B_0F:
off_AE6B:
- D - I - 0x02AE7B 20:AE6B: 01        .byte $01	; <あ>
- D - I - 0x02AE7C 20:AE6C: 50        .byte $50	; <タ>
- D - I - 0x02AE7D 20:AE6D: F6        .byte $F6
- D - I - 0x02AE7E 20:AE6E: 02        .byte $02	; <い>
- D - I - 0x02AE7F 20:AE6F: 00        .byte $00
- D - I - 0x02AE80 20:AE70: 01        .byte $01	; <あ>
- D - I - 0x02AE81 20:AE71: 50        .byte $50	; <タ>
- D - I - 0x02AE82 20:AE72: F3        .byte $F3
- D - I - 0x02AE83 20:AE73: 6B AE     .word off_AE6B
off_AE75_10:
- D - I - 0x02AE85 20:AE75: F1        .byte $F1
- D - I - 0x02AE86 20:AE76: F7        .byte $F7
- D - I - 0x02AE87 20:AE77: 89        .byte $89	; <I>
off_AE78_11:
off_AE78:
- D - I - 0x02AE88 20:AE78: 01        .byte $01	; <あ>
- D - I - 0x02AE89 20:AE79: 89        .byte $89	; <I>
- D - I - 0x02AE8A 20:AE7A: F6        .byte $F6
- D - I - 0x02AE8B 20:AE7B: 00        .byte $00
- D - I - 0x02AE8C 20:AE7C: 02        .byte $02	; <い>
- D - I - 0x02AE8D 20:AE7D: 01        .byte $01	; <あ>
- D - I - 0x02AE8E 20:AE7E: 89        .byte $89	; <I>
- D - I - 0x02AE8F 20:AE7F: F3        .byte $F3
- D - I - 0x02AE90 20:AE80: 78 AE     .word off_AE78
off_AE82_12:
off_AE82:
- D - I - 0x02AE92 20:AE82: 02        .byte $02	; <い>
- D - I - 0x02AE93 20:AE83: 8F        .byte $8F	; <S>
- D - I - 0x02AE94 20:AE84: F2        .byte $F2
- D - I - 0x02AE95 20:AE85: 02        .byte $02	; <い>
- D - I - 0x02AE96 20:AE86: 8F        .byte $8F	; <S>
- D - I - 0x02AE97 20:AE87: F3        .byte $F3
- D - I - 0x02AE98 20:AE88: 82 AE     .word off_AE82
off_AE8A_13:
- D - I - 0x02AE9A 20:AE8A: 14        .byte $14	; <と>
- D - I - 0x02AE9B 20:AE8B: AF        .byte $AF	; <ば>
- D - I - 0x02AE9C 20:AE8C: F7        .byte $F7
- D - I - 0x02AE9D 20:AE8D: B0        .byte $B0	; <び>
off_AE8E_14:
- D - I - 0x02AE9E 20:AE8E: F1        .byte $F1
- D - I - 0x02AE9F 20:AE8F: F7        .byte $F7
- D - I - 0x02AEA0 20:AE90: 48        .byte $48	; <ク>
off_AE91_15:
off_AE91:
- D - I - 0x02AEA1 20:AE91: 01        .byte $01	; <あ>
- D - I - 0x02AEA2 20:AE92: 47        .byte $47	; <キ>
- D - I - 0x02AEA3 20:AE93: F2        .byte $F2
- D - I - 0x02AEA4 20:AE94: 01        .byte $01	; <あ>
- D - I - 0x02AEA5 20:AE95: 47        .byte $47	; <キ>
- D - I - 0x02AEA6 20:AE96: F3        .byte $F3
- D - I - 0x02AEA7 20:AE97: 91 AE     .word off_AE91
off_AE99_16:
- D - I - 0x02AEA9 20:AE99: 03        .byte $03	; <う>
- D - I - 0x02AEAA 20:AE9A: 87        .byte $87	; <G>
- D - I - 0x02AEAB 20:AE9B: 03        .byte $03	; <う>
- D - I - 0x02AEAC 20:AE9C: 86        .byte $86	; <F>
- D - I - 0x02AEAD 20:AE9D: 03        .byte $03	; <う>
- D - I - 0x02AEAE 20:AE9E: 85        .byte $85	; <E>
- D - I - 0x02AEAF 20:AE9F: 03        .byte $03	; <う>
- D - I - 0x02AEB0 20:AEA0: 84        .byte $84	; <D>
- D - I - 0x02AEB1 20:AEA1: 03        .byte $03	; <う>
- D - I - 0x02AEB2 20:AEA2: 83        .byte $83	; <C>
- D - I - 0x02AEB3 20:AEA3: F6        .byte $F6
- D - I - 0x02AEB4 20:AEA4: 00        .byte $00
- D - I - 0x02AEB5 20:AEA5: FF        .byte $FF
- D - I - 0x02AEB6 20:AEA6: 01        .byte $01	; <あ>
- D - I - 0x02AEB7 20:AEA7: 82        .byte $82	; <B>
- D - I - 0x02AEB8 20:AEA8: F6        .byte $F6
- D - I - 0x02AEB9 20:AEA9: 00        .byte $00
- D - I - 0x02AEBA 20:AEAA: 01        .byte $01	; <あ>
- D - I - 0x02AEBB 20:AEAB: 01        .byte $01	; <あ>
- D - I - 0x02AEBC 20:AEAC: 81        .byte $81	; <A>
- D - I - 0x02AEBD 20:AEAD: F6        .byte $F6
- D - I - 0x02AEBE 20:AEAE: 00        .byte $00
- D - I - 0x02AEBF 20:AEAF: FF        .byte $FF
- D - I - 0x02AEC0 20:AEB0: 01        .byte $01	; <あ>
- D - I - 0x02AEC1 20:AEB1: 80        .byte $80
- D - I - 0x02AEC2 20:AEB2: F6        .byte $F6
- D - I - 0x02AEC3 20:AEB3: 00        .byte $00
- D - I - 0x02AEC4 20:AEB4: 04        .byte $04	; <え>
- D - I - 0x02AEC5 20:AEB5: 01        .byte $01	; <あ>
- D - I - 0x02AEC6 20:AEB6: 7F        .byte $7F	; <,>
- D - I - 0x02AEC7 20:AEB7: F4        .byte $F4
- D - I - 0x02AEC8 20:AEB8: 0E        .byte $0E	; <せ>
- D - I - 0x02AEC9 20:AEB9: F6        .byte $F6
- D - I - 0x02AECA 20:AEBA: 00        .byte $00
- D - I - 0x02AECB 20:AEBB: 01        .byte $01	; <あ>
- D - I - 0x02AECC 20:AEBC: 01        .byte $01	; <あ>
- D - I - 0x02AECD 20:AEBD: 7E        .byte $7E	; <.>
- D - I - 0x02AECE 20:AEBE: F1        .byte $F1
- D - I - 0x02AECF 20:AEBF: F2        .byte $F2
- D - I - 0x02AED0 20:AEC0: F6        .byte $F6
- D - I - 0x02AED1 20:AEC1: 00        .byte $00
- D - I - 0x02AED2 20:AEC2: 01        .byte $01	; <あ>
- D - I - 0x02AED3 20:AEC3: 01        .byte $01	; <あ>
- D - I - 0x02AED4 20:AEC4: 7E        .byte $7E	; <.>
- D - I - 0x02AED5 20:AEC5: F5        .byte $F5
- D - I - 0x02AED6 20:AEC6: F6        .byte $F6
- D - I - 0x02AED7 20:AEC7: 00        .byte $00
- D - I - 0x02AED8 20:AEC8: 01        .byte $01	; <あ>
- D - I - 0x02AED9 20:AEC9: 01        .byte $01	; <あ>
- D - I - 0x02AEDA 20:AECA: 7E        .byte $7E	; <.>
- D - I - 0x02AEDB 20:AECB: F6        .byte $F6
- D - I - 0x02AEDC 20:AECC: 00        .byte $00
- D - I - 0x02AEDD 20:AECD: 04        .byte $04	; <え>
- D - I - 0x02AEDE 20:AECE: 01        .byte $01	; <あ>
- D - I - 0x02AEDF 20:AECF: 7F        .byte $7F	; <,>
- D - I - 0x02AEE0 20:AED0: F6        .byte $F6
- D - I - 0x02AEE1 20:AED1: 00        .byte $00
- D - I - 0x02AEE2 20:AED2: FF        .byte $FF
- D - I - 0x02AEE3 20:AED3: 01        .byte $01	; <あ>
- D - I - 0x02AEE4 20:AED4: 80        .byte $80
- D - I - 0x02AEE5 20:AED5: F6        .byte $F6
- D - I - 0x02AEE6 20:AED6: 00        .byte $00
- D - I - 0x02AEE7 20:AED7: 01        .byte $01	; <あ>
- D - I - 0x02AEE8 20:AED8: 01        .byte $01	; <あ>
- D - I - 0x02AEE9 20:AED9: 81        .byte $81	; <A>
- D - I - 0x02AEEA 20:AEDA: F6        .byte $F6
- D - I - 0x02AEEB 20:AEDB: 00        .byte $00
- D - I - 0x02AEEC 20:AEDC: FF        .byte $FF
- D - I - 0x02AEED 20:AEDD: 01        .byte $01	; <あ>
- D - I - 0x02AEEE 20:AEDE: 82        .byte $82	; <B>
- D - I - 0x02AEEF 20:AEDF: 03        .byte $03	; <う>
- D - I - 0x02AEF0 20:AEE0: 83        .byte $83	; <C>
- D - I - 0x02AEF1 20:AEE1: 03        .byte $03	; <う>
- D - I - 0x02AEF2 20:AEE2: 84        .byte $84	; <D>
- - - - - 0x02AEF3 20:AEE3: 03        .byte $03	; <う>
- - - - - 0x02AEF4 20:AEE4: 85        .byte $85	; <E>
- - - - - 0x02AEF5 20:AEE5: 03        .byte $03	; <う>
- - - - - 0x02AEF6 20:AEE6: 86        .byte $86	; <F>
- - - - - 0x02AEF7 20:AEE7: F7        .byte $F7
- - - - - 0x02AEF8 20:AEE8: 87        .byte $87	; <G>
off_AEE9_17:
- D - I - 0x02AEF9 20:AEE9: F7        .byte $F7
- D - I - 0x02AEFA 20:AEEA: 41        .byte $41	; <ア>
off_AEEB_18:
- D - I - 0x02AEFB 20:AEEB: F1        .byte $F1
- D - I - 0x02AEFC 20:AEEC: F7        .byte $F7
- D - I - 0x02AEFD 20:AEED: C3        .byte $C3	; <バ>
off_AEEE_19:
- - - - - 0x02AEFE 20:AEEE: F7        .byte $F7
- - - - - 0x02AEFF 20:AEEF: C3        .byte $C3	; <バ>
off_AEF0_1A:
off_AEF0:
- D - I - 0x02AF00 20:AEF0: 02        .byte $02	; <い>
- D - I - 0x02AF01 20:AEF1: C4        .byte $C4	; <ビ>
- D - I - 0x02AF02 20:AEF2: F2        .byte $F2
- D - I - 0x02AF03 20:AEF3: F6        .byte $F6
- D - I - 0x02AF04 20:AEF4: 00        .byte $00
- D - I - 0x02AF05 20:AEF5: 02        .byte $02	; <い>
- D - I - 0x02AF06 20:AEF6: 02        .byte $02	; <い>
- D - I - 0x02AF07 20:AEF7: C4        .byte $C4	; <ビ>
- D - I - 0x02AF08 20:AEF8: F3        .byte $F3
- D - I - 0x02AF09 20:AEF9: F0 AE     .word off_AEF0
off_AEFB_1B:
- D - I - 0x02AF0B 20:AEFB: 01        .byte $01	; <あ>
- D - I - 0x02AF0C 20:AEFC: C8        .byte $C8	; <ぱ>
- D - I - 0x02AF0D 20:AEFD: 01        .byte $01	; <あ>
- D - I - 0x02AF0E 20:AEFE: C8        .byte $C8	; <ぱ>
off_AEFF:
- D - I - 0x02AF0F 20:AEFF: 01        .byte $01	; <あ>
- D - I - 0x02AF10 20:AF00: 41        .byte $41	; <ア>
- D - I - 0x02AF11 20:AF01: 01        .byte $01	; <あ>
- D - I - 0x02AF12 20:AF02: 41        .byte $41	; <ア>
off_AF03:
- D - I - 0x02AF13 20:AF03: 01        .byte $01	; <あ>
- D - I - 0x02AF14 20:AF04: C8        .byte $C8	; <ぱ>
- D - I - 0x02AF15 20:AF05: 01        .byte $01	; <あ>
- D - I - 0x02AF16 20:AF06: C8        .byte $C8	; <ぱ>
- D - I - 0x02AF17 20:AF07: 01        .byte $01	; <あ>
- D - I - 0x02AF18 20:AF08: C8        .byte $C8	; <ぱ>
- D - I - 0x02AF19 20:AF09: 01        .byte $01	; <あ>
- D - I - 0x02AF1A 20:AF0A: C8        .byte $C8	; <ぱ>
- D - I - 0x02AF1B 20:AF0B: F3        .byte $F3
- D - I - 0x02AF1C 20:AF0C: FF AE     .word off_AEFF
off_AF0E_1C:
off_AF0E:
- D - I - 0x02AF1E 20:AF0E: F1        .byte $F1
- D - I - 0x02AF1F 20:AF0F: F7        .byte $F7
- D - I - 0x02AF20 20:AF10: 14        .byte $14	; <と>
off_AF11_1D:
- D - I - 0x02AF21 20:AF11: F7        .byte $F7
- D - I - 0x02AF22 20:AF12: 14        .byte $14	; <と>
off_AF13_1E:
off_AF13:
- D - I - 0x02AF23 20:AF13: 02        .byte $02	; <い>
- D - I - 0x02AF24 20:AF14: 18        .byte $18	; <ね>
- D - I - 0x02AF25 20:AF15: F2        .byte $F2
- D - I - 0x02AF26 20:AF16: 02        .byte $02	; <い>
- D - I - 0x02AF27 20:AF17: 18        .byte $18	; <ね>
- D - I - 0x02AF28 20:AF18: F3        .byte $F3
- D - I - 0x02AF29 20:AF19: 13 AF     .word off_AF13
off_AF1B_1F:
- D - I - 0x02AF2B 20:AF1B: F3        .byte $F3
- D - I - 0x02AF2C 20:AF1C: 03 AF     .word off_AF03
off_AF1E_20:
off_AF1E:
- D - I - 0x02AF2E 20:AF1E: F1        .byte $F1
- D - I - 0x02AF2F 20:AF1F: F7        .byte $F7
- D - I - 0x02AF30 20:AF20: 19        .byte $19	; <の>
off_AF21_21:
- D - I - 0x02AF31 20:AF21: F7        .byte $F7
- D - I - 0x02AF32 20:AF22: 19        .byte $19	; <の>
off_AF23_22:
- D - I - 0x02AF33 20:AF23: 02        .byte $02	; <い>
- D - I - 0x02AF34 20:AF24: 1D        .byte $1D	; <へ>
- D - I - 0x02AF35 20:AF25: F0        .byte $F0
off_AF26_23:
- D - I - 0x02AF36 20:AF26: 01        .byte $01	; <あ>
- D - I - 0x02AF37 20:AF27: 7D        .byte $7D	; <ー>
- D - I - 0x02AF38 20:AF28: 01        .byte $01	; <あ>
- D - I - 0x02AF39 20:AF29: 7C        .byte $7C	; <~>
- D - I - 0x02AF3A 20:AF2A: 01        .byte $01	; <あ>
- D - I - 0x02AF3B 20:AF2B: 7B        .byte $7B	; <。>
- D - I - 0x02AF3C 20:AF2C: 01        .byte $01	; <あ>
- D - I - 0x02AF3D 20:AF2D: 7A        .byte $7A	; <、>
- D - I - 0x02AF3E 20:AF2E: 01        .byte $01	; <あ>
- D - I - 0x02AF3F 20:AF2F: 79        .byte $79	; <!>
- D - I - 0x02AF40 20:AF30: 01        .byte $01	; <あ>
- D - I - 0x02AF41 20:AF31: 78        .byte $78	; <?>
- D - I - 0x02AF42 20:AF32: 01        .byte $01	; <あ>
- D - I - 0x02AF43 20:AF33: 77        .byte $77	; <:>
- D - I - 0x02AF44 20:AF34: F6        .byte $F6
- D - I - 0x02AF45 20:AF35: FE        .byte $FE
- D - I - 0x02AF46 20:AF36: 01        .byte $01	; <あ>
- D - I - 0x02AF47 20:AF37: 01        .byte $01	; <あ>
- D - I - 0x02AF48 20:AF38: 76        .byte $76	; <ォ>
- D - I - 0x02AF49 20:AF39: F6        .byte $F6
- D - I - 0x02AF4A 20:AF3A: FE        .byte $FE
- D - I - 0x02AF4B 20:AF3B: 01        .byte $01	; <あ>
- D - I - 0x02AF4C 20:AF3C: 01        .byte $01	; <あ>
- D - I - 0x02AF4D 20:AF3D: 75        .byte $75	; <ェ>
- D - I - 0x02AF4E 20:AF3E: 01        .byte $01	; <あ>
- D - I - 0x02AF4F 20:AF3F: 74        .byte $74	; <ィ>
- D - I - 0x02AF50 20:AF40: F6        .byte $F6
- D - I - 0x02AF51 20:AF41: 00        .byte $00
- D - I - 0x02AF52 20:AF42: 01        .byte $01	; <あ>
- D - I - 0x02AF53 20:AF43: 01        .byte $01	; <あ>
- D - I - 0x02AF54 20:AF44: 73        .byte $73	; <ヮ>
- D - I - 0x02AF55 20:AF45: F6        .byte $F6
- D - I - 0x02AF56 20:AF46: 01        .byte $01	; <あ>
- D - I - 0x02AF57 20:AF47: 00        .byte $00
- D - I - 0x02AF58 20:AF48: 01        .byte $01	; <あ>
- D - I - 0x02AF59 20:AF49: 72        .byte $72	; <ョ>
off_AF4A:
- D - I - 0x02AF5A 20:AF4A: F6        .byte $F6
- D - I - 0x02AF5B 20:AF4B: 00        .byte $00
- D - I - 0x02AF5C 20:AF4C: 01        .byte $01	; <あ>
- D - I - 0x02AF5D 20:AF4D: 01        .byte $01	; <あ>
- D - I - 0x02AF5E 20:AF4E: 71        .byte $71	; <ュ>
- D - I - 0x02AF5F 20:AF4F: F1        .byte $F1
- D - I - 0x02AF60 20:AF50: F2        .byte $F2
- D - I - 0x02AF61 20:AF51: F6        .byte $F6
- D - I - 0x02AF62 20:AF52: 00        .byte $00
- D - I - 0x02AF63 20:AF53: 01        .byte $01	; <あ>
- D - I - 0x02AF64 20:AF54: 01        .byte $01	; <あ>
- D - I - 0x02AF65 20:AF55: 71        .byte $71	; <ュ>
- D - I - 0x02AF66 20:AF56: F3        .byte $F3
- D - I - 0x02AF67 20:AF57: 4A AF     .word off_AF4A
off_AF59_24:
- D - I - 0x02AF69 20:AF59: F7        .byte $F7
- D - I - 0x02AF6A 20:AF5A: BC        .byte $BC	; <ゼ>
off_AF5B_25:
- D - I - 0x02AF6B 20:AF5B: F7        .byte $F7
- D - I - 0x02AF6C 20:AF5C: BD        .byte $BD	; <ゾ>
off_AF5D_26:
- D - I - 0x02AF6D 20:AF5D: F7        .byte $F7
- D - I - 0x02AF6E 20:AF5E: BE        .byte $BE	; <ダ>
off_AF5F_27:
- D - I - 0x02AF6F 20:AF5F: F7        .byte $F7
- D - I - 0x02AF70 20:AF60: B7        .byte $B7	; <ゲ>
off_AF61_28:
- D - I - 0x02AF71 20:AF61: F7        .byte $F7
- D - I - 0x02AF72 20:AF62: 88        .byte $88	; <H>
off_AF63_29:
off_AF63:
- D - I - 0x02AF73 20:AF63: F1        .byte $F1
- D - I - 0x02AF74 20:AF64: F7        .byte $F7
- D - I - 0x02AF75 20:AF65: 25        .byte $25	; <ゆ>
off_AF66_2A:
- D - I - 0x02AF76 20:AF66: F7        .byte $F7
- D - I - 0x02AF77 20:AF67: 25        .byte $25	; <ゆ>
off_AF68_2B:
- D - I - 0x02AF78 20:AF68: F7        .byte $F7
- D - I - 0x02AF79 20:AF69: 1E        .byte $1E	; <ほ>
off_AF6A_2C:
- D - I - 0x02AF7A 20:AF6A: 1E        .byte $1E	; <ほ>
- D - I - 0x02AF7B 20:AF6B: 4E        .byte $4E	; <セ>
- D - I - 0x02AF7C 20:AF6C: 02        .byte $02	; <い>
- D - I - 0x02AF7D 20:AF6D: CE        .byte $CE	; <ピ>
- D - I - 0x02AF7E 20:AF6E: F7        .byte $F7
- D - I - 0x02AF7F 20:AF6F: C8        .byte $C8	; <ぱ>
off_AF70_2D:
- D - I - 0x02AF80 20:AF70: F7        .byte $F7
- D - I - 0x02AF81 20:AF71: 1F        .byte $1F	; <ま>
off_AF72_2E:
off_AF72:
- D - I - 0x02AF82 20:AF72: 01        .byte $01	; <あ>
- D - I - 0x02AF83 20:AF73: 20        .byte $20	; <み>
- D - I - 0x02AF84 20:AF74: F6        .byte $F6
- D - I - 0x02AF85 20:AF75: 02        .byte $02	; <い>
- D - I - 0x02AF86 20:AF76: FE        .byte $FE
- D - I - 0x02AF87 20:AF77: 01        .byte $01	; <あ>
- D - I - 0x02AF88 20:AF78: 20        .byte $20	; <み>
- D - I - 0x02AF89 20:AF79: F3        .byte $F3
- D - I - 0x02AF8A 20:AF7A: 72 AF     .word off_AF72
off_AF7C_2F:
- D - I - 0x02AF8C 20:AF7C: F7        .byte $F7
- D - I - 0x02AF8D 20:AF7D: 6A        .byte $6A	; <レ>
off_AF7E_30:
- D - I - 0x02AF8E 20:AF7E: F1        .byte $F1
- D - I - 0x02AF8F 20:AF7F: F7        .byte $F7
- D - I - 0x02AF90 20:AF80: 70        .byte $70	; <ャ>
off_AF81_31:
- D - I - 0x02AF91 20:AF81: F1        .byte $F1
- D - I - 0x02AF92 20:AF82: 06        .byte $06	; <か>
- D - I - 0x02AF93 20:AF83: 9E        .byte $9E
- D - I - 0x02AF94 20:AF84: F1        .byte $F1
- D - I - 0x02AF95 20:AF85: F7        .byte $F7
- D - I - 0x02AF96 20:AF86: 9F        .byte $9F
off_AF87_32:
- D - I - 0x02AF97 20:AF87: F7        .byte $F7
- D - I - 0x02AF98 20:AF88: 93        .byte $93	; <Y>
off_AF89_33:
- D - I - 0x02AF99 20:AF89: F7        .byte $F7
- D - I - 0x02AF9A 20:AF8A: 94        .byte $94
off_AF8B_34:
- D - I - 0x02AF9B 20:AF8B: F7        .byte $F7
- D - I - 0x02AF9C 20:AF8C: 71        .byte $71	; <ュ>
off_AF8D_35:
off_AF8D:
- D - I - 0x02AF9D 20:AF8D: 01        .byte $01	; <あ>
- D - I - 0x02AF9E 20:AF8E: 90        .byte $90	; <U>
- D - I - 0x02AF9F 20:AF8F: 01        .byte $01	; <あ>
- D - I - 0x02AFA0 20:AF90: 91        .byte $91	; <V>
- D - I - 0x02AFA1 20:AF91: F3        .byte $F3
- D - I - 0x02AFA2 20:AF92: 8D AF     .word off_AF8D
off_AF94_36:
- D - I - 0x02AFA4 20:AF94: F4        .byte $F4
- D - I - 0x02AFA5 20:AF95: 01        .byte $01	; <あ>
- D - I - 0x02AFA6 20:AF96: 01        .byte $01	; <あ>
- D - I - 0x02AFA7 20:AF97: 90        .byte $90	; <U>
- D - I - 0x02AFA8 20:AF98: 01        .byte $01	; <あ>
- D - I - 0x02AFA9 20:AF99: 91        .byte $91	; <V>
- D - I - 0x02AFAA 20:AF9A: F5        .byte $F5
- D - I - 0x02AFAB 20:AF9B: F7        .byte $F7
- D - I - 0x02AFAC 20:AF9C: 92        .byte $92	; <W>
off_AF9D_37:
- D - I - 0x02AFAD 20:AF9D: F1        .byte $F1
- D - I - 0x02AFAE 20:AF9E: 01        .byte $01	; <あ>
- D - I - 0x02AFAF 20:AF9F: C5        .byte $C5	; <ブ>
- - - - - 0x02AFB0 20:AFA0: F4        .byte $F4
- - - - - 0x02AFB1 20:AFA1: 01        .byte $01	; <あ>
- - - - - 0x02AFB2 20:AFA2: F1        .byte $F1
- - - - - 0x02AFB3 20:AFA3: 01        .byte $01	; <あ>
- - - - - 0x02AFB4 20:AFA4: C6        .byte $C6	; <ベ>
- - - - - 0x02AFB5 20:AFA5: F1        .byte $F1
- - - - - 0x02AFB6 20:AFA6: 01        .byte $01	; <あ>
- - - - - 0x02AFB7 20:AFA7: C7        .byte $C7	; <ボ>
- - - - - 0x02AFB8 20:AFA8: F5        .byte $F5
- - - - - 0x02AFB9 20:AFA9: F1        .byte $F1
- - - - - 0x02AFBA 20:AFAA: F7        .byte $F7
- - - - - 0x02AFBB 20:AFAB: C5        .byte $C5	; <ブ>
off_AFAC_38:
- D - I - 0x02AFBC 20:AFAC: 01        .byte $01	; <あ>
- D - I - 0x02AFBD 20:AFAD: A3        .byte $A3	; <げ>
off_AFAE_39:
off_AFAE:
- D - I - 0x02AFBE 20:AFAE: 01        .byte $01	; <あ>
- D - I - 0x02AFBF 20:AFAF: A5        .byte $A5	; <ざ>
- D - I - 0x02AFC0 20:AFB0: 01        .byte $01	; <あ>
- D - I - 0x02AFC1 20:AFB1: A7        .byte $A7	; <ず>
- D - I - 0x02AFC2 20:AFB2: 01        .byte $01	; <あ>
- D - I - 0x02AFC3 20:AFB3: A4        .byte $A4	; <ご>
- D - I - 0x02AFC4 20:AFB4: 01        .byte $01	; <あ>
- D - I - 0x02AFC5 20:AFB5: A6        .byte $A6	; <じ>
- D - I - 0x02AFC6 20:AFB6: F7        .byte $F7
- D - I - 0x02AFC7 20:AFB7: A3        .byte $A3	; <げ>
off_AFB8_3A:
- D - I - 0x02AFC8 20:AFB8: 01        .byte $01	; <あ>
- D - I - 0x02AFC9 20:AFB9: C9        .byte $C9	; <ぴ>
off_AFBA_3B:
- D - I - 0x02AFCA 20:AFBA: 01        .byte $01	; <あ>
- D - I - 0x02AFCB 20:AFBB: AB        .byte $AB	; <ぢ>
- D - I - 0x02AFCC 20:AFBC: 01        .byte $01	; <あ>
- D - I - 0x02AFCD 20:AFBD: AD        .byte $AD	; <で>
- D - I - 0x02AFCE 20:AFBE: 01        .byte $01	; <あ>
- D - I - 0x02AFCF 20:AFBF: AA        .byte $AA	; <だ>
- D - I - 0x02AFD0 20:AFC0: 01        .byte $01	; <あ>
- D - I - 0x02AFD1 20:AFC1: AC        .byte $AC	; <づ>
- D - I - 0x02AFD2 20:AFC2: F7        .byte $F7
- D - I - 0x02AFD3 20:AFC3: C9        .byte $C9	; <ぴ>
off_AFC4_3C:
- D - I - 0x02AFD4 20:AFC4: 01        .byte $01	; <あ>
- D - I - 0x02AFD5 20:AFC5: 8A        .byte $8A	; <N>
- D - I - 0x02AFD6 20:AFC6: 01        .byte $01	; <あ>
- D - I - 0x02AFD7 20:AFC7: 8C        .byte $8C	; <M>
- D - I - 0x02AFD8 20:AFC8: 01        .byte $01	; <あ>
- D - I - 0x02AFD9 20:AFC9: 8E        .byte $8E	; <L>
- D - I - 0x02AFDA 20:AFCA: 01        .byte $01	; <あ>
- D - I - 0x02AFDB 20:AFCB: 8B        .byte $8B	; <K>
- D - I - 0x02AFDC 20:AFCC: 01        .byte $01	; <あ>
- D - I - 0x02AFDD 20:AFCD: 8D        .byte $8D	; <P>
- D - I - 0x02AFDE 20:AFCE: F7        .byte $F7
- D - I - 0x02AFDF 20:AFCF: 8A        .byte $8A	; <N>
off_AFD0_3D:
- D - I - 0x02AFE0 20:AFD0: F7        .byte $F7
- D - I - 0x02AFE1 20:AFD1: 26        .byte $26	; <よ>
off_AFD2_3E:
- D - I - 0x02AFE2 20:AFD2: 01        .byte $01	; <あ>
- D - I - 0x02AFE3 20:AFD3: 9A        .byte $9A
- D - I - 0x02AFE4 20:AFD4: 01        .byte $01	; <あ>
- D - I - 0x02AFE5 20:AFD5: 9B        .byte $9B
- D - I - 0x02AFE6 20:AFD6: 01        .byte $01	; <あ>
- D - I - 0x02AFE7 20:AFD7: 9C        .byte $9C
- D - I - 0x02AFE8 20:AFD8: 01        .byte $01	; <あ>
- D - I - 0x02AFE9 20:AFD9: 9A        .byte $9A
- D - I - 0x02AFEA 20:AFDA: F0        .byte $F0
off_AFDB_3F:
- D - I - 0x02AFEB 20:AFDB: 01        .byte $01	; <あ>
- D - I - 0x02AFEC 20:AFDC: 15        .byte $15	; <な>
- D - I - 0x02AFED 20:AFDD: 01        .byte $01	; <あ>
- D - I - 0x02AFEE 20:AFDE: 16        .byte $16	; <に>
- D - I - 0x02AFEF 20:AFDF: 01        .byte $01	; <あ>
- D - I - 0x02AFF0 20:AFE0: 17        .byte $17	; <ぬ>
- D - I - 0x02AFF1 20:AFE1: F7        .byte $F7
- D - I - 0x02AFF2 20:AFE2: 15        .byte $15	; <な>
off_AFE3_40:
- D - I - 0x02AFF3 20:AFE3: F1        .byte $F1
- D - I - 0x02AFF4 20:AFE4: 01        .byte $01	; <あ>
- D - I - 0x02AFF5 20:AFE5: 49        .byte $49	; <ケ>
off_AFE6:
- D - I - 0x02AFF6 20:AFE6: F1        .byte $F1
- D - I - 0x02AFF7 20:AFE7: 01        .byte $01	; <あ>
- D - I - 0x02AFF8 20:AFE8: 4B        .byte $4B	; <サ>
- D - I - 0x02AFF9 20:AFE9: F1        .byte $F1
- D - I - 0x02AFFA 20:AFEA: 01        .byte $01	; <あ>
- D - I - 0x02AFFB 20:AFEB: 4D        .byte $4D	; <ス>
- D - I - 0x02AFFC 20:AFEC: F1        .byte $F1
- D - I - 0x02AFFD 20:AFED: 01        .byte $01	; <あ>
- D - I - 0x02AFFE 20:AFEE: 4A        .byte $4A	; <コ>
- D - I - 0x02AFFF 20:AFEF: F1        .byte $F1
- D - I - 0x02B000 20:AFF0: 01        .byte $01	; <あ>
- D - I - 0x02B001 20:AFF1: 4C        .byte $4C	; <シ>
- D - I - 0x02B002 20:AFF2: F1        .byte $F1
- D - I - 0x02B003 20:AFF3: F7        .byte $F7
- D - I - 0x02B004 20:AFF4: 49        .byte $49	; <ケ>
off_AFF5_41:
- D - I - 0x02B005 20:AFF5: F7        .byte $F7
- D - I - 0x02B006 20:AFF6: 27        .byte $27	; <ら>
off_AFF7_42:
- D - I - 0x02B007 20:AFF7: F7        .byte $F7
- D - I - 0x02B008 20:AFF8: 28        .byte $28	; <り>
off_AFF9_43:
- - - - - 0x02B009 20:AFF9: F3        .byte $F3
- - - - - 0x02B00A 20:AFFA: E6 AF     .word off_AFE6
off_AFFC_44:
- D - I - 0x02B00C 20:AFFC: F7        .byte $F7
- D - I - 0x02B00D 20:AFFD: 29        .byte $29	; <る>
off_AFFE_45:
off_AFFE:
- D - I - 0x02B00E 20:AFFE: F1        .byte $F1
- D - I - 0x02B00F 20:AFFF: 01        .byte $01	; <あ>
- D - I - 0x02B010 20:B000: 3F        .byte $3F	; <•>
- D - I - 0x02B011 20:B001: F1        .byte $F1
- D - I - 0x02B012 20:B002: 01        .byte $01	; <あ>
- D - I - 0x02B013 20:B003: 40        .byte $40	; <「>
- - - - - 0x02B014 20:B004: F3        .byte $F3
- - - - - 0x02B015 20:B005: FE AF     .word off_AFFE
off_B007_46:
off_B007:
- D - I - 0x02B017 20:B007: 01        .byte $01	; <あ>
- D - I - 0x02B018 20:B008: 3F        .byte $3F	; <•>
- D - I - 0x02B019 20:B009: 01        .byte $01	; <あ>
- D - I - 0x02B01A 20:B00A: 40        .byte $40	; <「>
- D - I - 0x02B01B 20:B00B: F3        .byte $F3
- D - I - 0x02B01C 20:B00C: 07 B0     .word off_B007
off_B00E_47:
off_B00E:
- D - I - 0x02B01E 20:B00E: F1        .byte $F1
- D - I - 0x02B01F 20:B00F: 01        .byte $01	; <あ>
- D - I - 0x02B020 20:B010: 1B        .byte $1B	; <ひ>
- - - - - 0x02B021 20:B011: F1        .byte $F1
- - - - - 0x02B022 20:B012: 01        .byte $01	; <あ>
- - - - - 0x02B023 20:B013: 1C        .byte $1C	; <ふ>
- - - - - 0x02B024 20:B014: F3        .byte $F3
- - - - - 0x02B025 20:B015: 0E B0     .word off_B00E
off_B017_48:
off_B017:
- D - I - 0x02B027 20:B017: 01        .byte $01	; <あ>
- D - I - 0x02B028 20:B018: 1B        .byte $1B	; <ひ>
- - - - - 0x02B029 20:B019: 01        .byte $01	; <あ>
- - - - - 0x02B02A 20:B01A: 1C        .byte $1C	; <ふ>
- - - - - 0x02B02B 20:B01B: F3        .byte $F3
- - - - - 0x02B02C 20:B01C: 17 B0     .word off_B017
off_B01E_49:
off_B01E:
- D - I - 0x02B02E 20:B01E: 01        .byte $01	; <あ>
- D - I - 0x02B02F 20:B01F: CA        .byte $CA	; <ぷ>
- D - I - 0x02B030 20:B020: F2        .byte $F2
- D - I - 0x02B031 20:B021: 01        .byte $01	; <あ>
- D - I - 0x02B032 20:B022: CA        .byte $CA	; <ぷ>
- D - I - 0x02B033 20:B023: F3        .byte $F3
- D - I - 0x02B034 20:B024: 1E B0     .word off_B01E
off_B026_4A_4B:
off_B026:
- D - I - 0x02B036 20:B026: 04        .byte $04	; <え>
- D - I - 0x02B037 20:B027: 00        .byte $00
off_B028:
- D - I - 0x02B038 20:B028: 04        .byte $04	; <え>
- D - I - 0x02B039 20:B029: 01        .byte $01	; <あ>
- D - I - 0x02B03A 20:B02A: 04        .byte $04	; <え>
- D - I - 0x02B03B 20:B02B: 02        .byte $02	; <い>
- D - I - 0x02B03C 20:B02C: 04        .byte $04	; <え>
- D - I - 0x02B03D 20:B02D: 03        .byte $03	; <う>
- D - I - 0x02B03E 20:B02E: F3        .byte $F3
- D - I - 0x02B03F 20:B02F: 26 B0     .word off_B026
off_B031_4C:
off_B031:
- D - I - 0x02B041 20:B031: F1        .byte $F1
- D - I - 0x02B042 20:B032: 04        .byte $04	; <え>
- D - I - 0x02B043 20:B033: 00        .byte $00
- D - I - 0x02B044 20:B034: F1        .byte $F1
- D - I - 0x02B045 20:B035: 04        .byte $04	; <え>
- D - I - 0x02B046 20:B036: 01        .byte $01	; <あ>
- D - I - 0x02B047 20:B037: F1        .byte $F1
- D - I - 0x02B048 20:B038: 04        .byte $04	; <え>
- D - I - 0x02B049 20:B039: 02        .byte $02	; <い>
off_B03A:
- D - I - 0x02B04A 20:B03A: F1        .byte $F1
- D - I - 0x02B04B 20:B03B: 04        .byte $04	; <え>
- D - I - 0x02B04C 20:B03C: 03        .byte $03	; <う>
- D - I - 0x02B04D 20:B03D: F3        .byte $F3
- D - I - 0x02B04E 20:B03E: 31 B0     .word off_B031
off_B040_4D:
off_B040:
- D - I - 0x02B050 20:B040: 04        .byte $04	; <え>
- D - I - 0x02B051 20:B041: 04        .byte $04	; <え>
off_B042:
- D - I - 0x02B052 20:B042: F1        .byte $F1
- D - I - 0x02B053 20:B043: 04        .byte $04	; <え>
- D - I - 0x02B054 20:B044: 05        .byte $05	; <お>
- D - I - 0x02B055 20:B045: F1        .byte $F1
- D - I - 0x02B056 20:B046: 04        .byte $04	; <え>
- D - I - 0x02B057 20:B047: 04        .byte $04	; <え>
- D - I - 0x02B058 20:B048: 04        .byte $04	; <え>
- D - I - 0x02B059 20:B049: 05        .byte $05	; <お>
- D - I - 0x02B05A 20:B04A: F3        .byte $F3
- D - I - 0x02B05B 20:B04B: 40 B0     .word off_B040
off_B04D_4E:
off_B04D:
- D - I - 0x02B05D 20:B04D: F1        .byte $F1
- D - I - 0x02B05E 20:B04E: 04        .byte $04	; <え>
- D - I - 0x02B05F 20:B04F: 04        .byte $04	; <え>
- D - I - 0x02B060 20:B050: 04        .byte $04	; <え>
- D - I - 0x02B061 20:B051: 05        .byte $05	; <お>
off_B052:
- D - I - 0x02B062 20:B052: 04        .byte $04	; <え>
- D - I - 0x02B063 20:B053: 04        .byte $04	; <え>
off_B054:
- D - I - 0x02B064 20:B054: F1        .byte $F1
- D - I - 0x02B065 20:B055: 04        .byte $04	; <え>
- D - I - 0x02B066 20:B056: 05        .byte $05	; <お>
- D - I - 0x02B067 20:B057: F3        .byte $F3
- D - I - 0x02B068 20:B058: 4D B0     .word off_B04D
off_B05A_4F:
off_B05A:
- D - I - 0x02B06A 20:B05A: 04        .byte $04	; <え>
- D - I - 0x02B06B 20:B05B: 06        .byte $06	; <か>
off_B05C:
- D - I - 0x02B06C 20:B05C: 04        .byte $04	; <え>
- D - I - 0x02B06D 20:B05D: 07        .byte $07	; <き>
- D - I - 0x02B06E 20:B05E: 04        .byte $04	; <え>
- D - I - 0x02B06F 20:B05F: 08        .byte $08	; <く>
- D - I - 0x02B070 20:B060: 04        .byte $04	; <え>
- D - I - 0x02B071 20:B061: 09        .byte $09	; <け>
- D - I - 0x02B072 20:B062: F3        .byte $F3
- D - I - 0x02B073 20:B063: 5A B0     .word off_B05A
off_B065_50:
off_B065:
- D - I - 0x02B075 20:B065: F1        .byte $F1
- D - I - 0x02B076 20:B066: 04        .byte $04	; <え>
- D - I - 0x02B077 20:B067: 06        .byte $06	; <か>
- D - I - 0x02B078 20:B068: F1        .byte $F1
- D - I - 0x02B079 20:B069: 04        .byte $04	; <え>
- D - I - 0x02B07A 20:B06A: 07        .byte $07	; <き>
off_B06B:
- D - I - 0x02B07B 20:B06B: F1        .byte $F1
- D - I - 0x02B07C 20:B06C: 04        .byte $04	; <え>
- D - I - 0x02B07D 20:B06D: 08        .byte $08	; <く>
off_B06E:
- D - I - 0x02B07E 20:B06E: F1        .byte $F1
- D - I - 0x02B07F 20:B06F: 04        .byte $04	; <え>
- D - I - 0x02B080 20:B070: 09        .byte $09	; <け>
- D - I - 0x02B081 20:B071: F3        .byte $F3
- D - I - 0x02B082 20:B072: 65 B0     .word off_B065
off_B074_51:
- D - I - 0x02B084 20:B074: F7        .byte $F7
- D - I - 0x02B085 20:B075: 23        .byte $23	; <も>
off_B076_52:
- D - I - 0x02B086 20:B076: F7        .byte $F7
- D - I - 0x02B087 20:B077: 2B        .byte $2B	; <ろ>
off_B078_53:
off_B078:
- D - I - 0x02B088 20:B078: 01        .byte $01	; <あ>
- D - I - 0x02B089 20:B079: 21        .byte $21	; <む>
- D - I - 0x02B08A 20:B07A: 01        .byte $01	; <あ>
- D - I - 0x02B08B 20:B07B: 22        .byte $22	; <め>
- D - I - 0x02B08C 20:B07C: F3        .byte $F3
- D - I - 0x02B08D 20:B07D: 78 B0     .word off_B078
off_B07F_54:
off_B07F:
- D - I - 0x02B08F 20:B07F: 01        .byte $01	; <あ>
- D - I - 0x02B090 20:B080: 94        .byte $94
- D - I - 0x02B091 20:B081: F1        .byte $F1
- D - I - 0x02B092 20:B082: F6        .byte $F6
- D - I - 0x02B093 20:B083: E0        .byte $E0
- D - I - 0x02B094 20:B084: 00        .byte $00
- D - I - 0x02B095 20:B085: 01        .byte $01	; <あ>
- D - I - 0x02B096 20:B086: 94        .byte $94
- D - I - 0x02B097 20:B087: F3        .byte $F3
- D - I - 0x02B098 20:B088: 7F B0     .word off_B07F
off_B08A_55:
- D - I - 0x02B09A 20:B08A: F7        .byte $F7
- D - I - 0x02B09B 20:B08B: D2        .byte $D2
off_B08C_56:
off_B08C:
- D - I - 0x02B09C 20:B08C: F1        .byte $F1
- D - I - 0x02B09D 20:B08D: 04        .byte $04	; <え>
- D - I - 0x02B09E 20:B08E: 0A        .byte $0A	; <こ>
- D - I - 0x02B09F 20:B08F: F1        .byte $F1
- D - I - 0x02B0A0 20:B090: 04        .byte $04	; <え>
- D - I - 0x02B0A1 20:B091: 0B        .byte $0B	; <さ>
- D - I - 0x02B0A2 20:B092: F1        .byte $F1
- D - I - 0x02B0A3 20:B093: 04        .byte $04	; <え>
- D - I - 0x02B0A4 20:B094: 0C        .byte $0C	; <し>
- D - I - 0x02B0A5 20:B095: F1        .byte $F1
- D - I - 0x02B0A6 20:B096: 04        .byte $04	; <え>
- D - I - 0x02B0A7 20:B097: 0D        .byte $0D	; <す>
- D - I - 0x02B0A8 20:B098: F3        .byte $F3
- D - I - 0x02B0A9 20:B099: 8C B0     .word off_B08C
off_B09B_57:
- D - I - 0x02B0AB 20:B09B: F7        .byte $F7
- D - I - 0x02B0AC 20:B09C: B1        .byte $B1	; <ぶ>
off_B09D_58:
off_B09D:
- D - I - 0x02B0AD 20:B09D: 04        .byte $04	; <え>
- D - I - 0x02B0AE 20:B09E: 0A        .byte $0A	; <こ>
- D - I - 0x02B0AF 20:B09F: 04        .byte $04	; <え>
- D - I - 0x02B0B0 20:B0A0: 0B        .byte $0B	; <さ>
- D - I - 0x02B0B1 20:B0A1: 04        .byte $04	; <え>
- D - I - 0x02B0B2 20:B0A2: 0C        .byte $0C	; <し>
- D - I - 0x02B0B3 20:B0A3: 04        .byte $04	; <え>
- D - I - 0x02B0B4 20:B0A4: 0D        .byte $0D	; <す>
- D - I - 0x02B0B5 20:B0A5: F3        .byte $F3
- D - I - 0x02B0B6 20:B0A6: 9D B0     .word off_B09D
off_B0A8_59:
- D - I - 0x02B0B8 20:B0A8: F3        .byte $F3
- D - I - 0x02B0B9 20:B0A9: 3A B0     .word off_B03A
off_B0AB_5A:
- D - I - 0x02B0BB 20:B0AB: F3        .byte $F3
- D - I - 0x02B0BC 20:B0AC: 54 B0     .word off_B054
off_B0AE_5B:
- D - I - 0x02B0BE 20:B0AE: F3        .byte $F3
- D - I - 0x02B0BF 20:B0AF: 6E B0     .word off_B06E
off_B0B1_5C:
- D - I - 0x02B0C1 20:B0B1: F3        .byte $F3
- D - I - 0x02B0C2 20:B0B2: 28 B0     .word off_B028
off_B0B4_5D:
- D - I - 0x02B0C4 20:B0B4: F3        .byte $F3
- D - I - 0x02B0C5 20:B0B5: 42 B0     .word off_B042
off_B0B7_5E:
- D - I - 0x02B0C7 20:B0B7: F3        .byte $F3
- D - I - 0x02B0C8 20:B0B8: 5C B0     .word off_B05C
off_B0BA_5F:
- D - I - 0x02B0CA 20:B0BA: F7        .byte $F7
- D - I - 0x02B0CB 20:B0BB: 2A        .byte $2A	; <れ>
off_B0BC_60:
- D - I - 0x02B0CC 20:B0BC: F7        .byte $F7
- D - I - 0x02B0CD 20:B0BD: 95        .byte $95
off_B0BE_61:
- D - I - 0x02B0CE 20:B0BE: F7        .byte $F7
- D - I - 0x02B0CF 20:B0BF: 96        .byte $96
off_B0C0_62:
- D - I - 0x02B0D0 20:B0C0: F7        .byte $F7
- D - I - 0x02B0D1 20:B0C1: 97        .byte $97
off_B0C2_63:
- D - I - 0x02B0D2 20:B0C2: F7        .byte $F7
- D - I - 0x02B0D3 20:B0C3: 7E        .byte $7E	; <.>
off_B0C4_64:
- D - I - 0x02B0D4 20:B0C4: F7        .byte $F7
- D - I - 0x02B0D5 20:B0C5: 6B        .byte $6B	; <ロ>
off_B0C6_65:
- D - I - 0x02B0D6 20:B0C6: F7        .byte $F7
- D - I - 0x02B0D7 20:B0C7: 6C        .byte $6C	; <ワ>
off_B0C8_66:
- D - I - 0x02B0D8 20:B0C8: 02        .byte $02	; <い>
- D - I - 0x02B0D9 20:B0C9: 6D        .byte $6D	; <ヲ>
- D - I - 0x02B0DA 20:B0CA: F0        .byte $F0
off_B0CB_67:
- D - I - 0x02B0DB 20:B0CB: 02        .byte $02	; <い>
- D - I - 0x02B0DC 20:B0CC: 6E        .byte $6E	; <ン>
- D - I - 0x02B0DD 20:B0CD: F0        .byte $F0
off_B0CE_68:
- D - I - 0x02B0DE 20:B0CE: 03        .byte $03	; <う>
- D - I - 0x02B0DF 20:B0CF: 6F        .byte $6F	; <ッ>
- - - - - 0x02B0E0 20:B0D0: F7        .byte $F7
- - - - - 0x02B0E1 20:B0D1: C8        .byte $C8	; <ぱ>
off_B0D2_69:
off_B0D2:
- D - I - 0x02B0E2 20:B0D2: F8        .byte $F8
- D - I - 0x02B0E3 20:B0D3: 00        .byte $00
- D - I - 0x02B0E4 20:B0D4: 01        .byte $01	; <あ>
- D - I - 0x02B0E5 20:B0D5: 2C        .byte $2C	; <わ>
- D - I - 0x02B0E6 20:B0D6: F8        .byte $F8
- D - I - 0x02B0E7 20:B0D7: 02        .byte $02	; <い>
- D - I - 0x02B0E8 20:B0D8: F1        .byte $F1
- D - I - 0x02B0E9 20:B0D9: 01        .byte $01	; <あ>
- D - I - 0x02B0EA 20:B0DA: 2C        .byte $2C	; <わ>
- D - I - 0x02B0EB 20:B0DB: F3        .byte $F3
- D - I - 0x02B0EC 20:B0DC: D2 B0     .word off_B0D2
off_B0DE_6A:
off_B0DE:
- D - I - 0x02B0EE 20:B0DE: F8        .byte $F8
- D - I - 0x02B0EF 20:B0DF: 01        .byte $01	; <あ>
- D - I - 0x02B0F0 20:B0E0: F1        .byte $F1
- D - I - 0x02B0F1 20:B0E1: 01        .byte $01	; <あ>
- D - I - 0x02B0F2 20:B0E2: 1F        .byte $1F	; <ま>
- D - I - 0x02B0F3 20:B0E3: F6        .byte $F6
- D - I - 0x02B0F4 20:B0E4: 00        .byte $00
- D - I - 0x02B0F5 20:B0E5: 50        .byte $50	; <タ>
- D - I - 0x02B0F6 20:B0E6: 01        .byte $01	; <あ>
- D - I - 0x02B0F7 20:B0E7: C8        .byte $C8	; <ぱ>
- D - I - 0x02B0F8 20:B0E8: F3        .byte $F3
- D - I - 0x02B0F9 20:B0E9: DE B0     .word off_B0DE
off_B0EB_6B:
off_B0EB:
- D - I - 0x02B0FB 20:B0EB: F1        .byte $F1
- D - I - 0x02B0FC 20:B0EC: 01        .byte $01	; <あ>
- D - I - 0x02B0FD 20:B0ED: 20        .byte $20	; <み>
- D - I - 0x02B0FE 20:B0EE: 01        .byte $01	; <あ>
- D - I - 0x02B0FF 20:B0EF: C8        .byte $C8	; <ぱ>
- D - I - 0x02B100 20:B0F0: F3        .byte $F3
- D - I - 0x02B101 20:B0F1: EB B0     .word off_B0EB
off_B0F3_6C:
off_B0F3:
- D - I - 0x02B103 20:B0F3: 02        .byte $02	; <い>
- D - I - 0x02B104 20:B0F4: 00        .byte $00
- D - I - 0x02B105 20:B0F5: 02        .byte $02	; <い>
- D - I - 0x02B106 20:B0F6: 01        .byte $01	; <あ>
- D - I - 0x02B107 20:B0F7: 02        .byte $02	; <い>
- D - I - 0x02B108 20:B0F8: 02        .byte $02	; <い>
- D - I - 0x02B109 20:B0F9: 02        .byte $02	; <い>
- D - I - 0x02B10A 20:B0FA: 03        .byte $03	; <う>
- D - I - 0x02B10B 20:B0FB: F3        .byte $F3
- D - I - 0x02B10C 20:B0FC: F3 B0     .word off_B0F3
off_B0FE_6D:
off_B0FE:
- D - I - 0x02B10E 20:B0FE: 02        .byte $02	; <い>
- D - I - 0x02B10F 20:B0FF: 04        .byte $04	; <え>
- D - I - 0x02B110 20:B100: F1        .byte $F1
- D - I - 0x02B111 20:B101: 02        .byte $02	; <い>
- D - I - 0x02B112 20:B102: 05        .byte $05	; <お>
- D - I - 0x02B113 20:B103: F1        .byte $F1
- D - I - 0x02B114 20:B104: 02        .byte $02	; <い>
- D - I - 0x02B115 20:B105: 04        .byte $04	; <え>
- D - I - 0x02B116 20:B106: 02        .byte $02	; <い>
- D - I - 0x02B117 20:B107: 05        .byte $05	; <お>
- D - I - 0x02B118 20:B108: F3        .byte $F3
- D - I - 0x02B119 20:B109: FE B0     .word off_B0FE
off_B10B_6E:
off_B10B:
- D - I - 0x02B11B 20:B10B: 02        .byte $02	; <い>
- D - I - 0x02B11C 20:B10C: 06        .byte $06	; <か>
- D - I - 0x02B11D 20:B10D: 02        .byte $02	; <い>
- D - I - 0x02B11E 20:B10E: 07        .byte $07	; <き>
- D - I - 0x02B11F 20:B10F: 02        .byte $02	; <い>
- D - I - 0x02B120 20:B110: 08        .byte $08	; <く>
- D - I - 0x02B121 20:B111: 02        .byte $02	; <い>
- D - I - 0x02B122 20:B112: 09        .byte $09	; <け>
- D - I - 0x02B123 20:B113: F3        .byte $F3
- D - I - 0x02B124 20:B114: 0B B1     .word off_B10B
off_B116_6F:
off_B116:
- D - I - 0x02B126 20:B116: 02        .byte $02	; <い>
- D - I - 0x02B127 20:B117: 0A        .byte $0A	; <こ>
- D - I - 0x02B128 20:B118: 02        .byte $02	; <い>
- D - I - 0x02B129 20:B119: 0B        .byte $0B	; <さ>
- D - I - 0x02B12A 20:B11A: 02        .byte $02	; <い>
- D - I - 0x02B12B 20:B11B: 0C        .byte $0C	; <し>
- D - I - 0x02B12C 20:B11C: 02        .byte $02	; <い>
- D - I - 0x02B12D 20:B11D: 0D        .byte $0D	; <す>
- D - I - 0x02B12E 20:B11E: F3        .byte $F3
- D - I - 0x02B12F 20:B11F: 16 B1     .word off_B116
off_B121_70:
- D - I - 0x02B131 20:B121: F4        .byte $F4
- D - I - 0x02B132 20:B122: 0D        .byte $0D	; <す>
- D - I - 0x02B133 20:B123: 01        .byte $01	; <あ>
- D - I - 0x02B134 20:B124: 41        .byte $41	; <ア>
- D - I - 0x02B135 20:B125: 01        .byte $01	; <あ>
- D - I - 0x02B136 20:B126: 41        .byte $41	; <ア>
- D - I - 0x02B137 20:B127: 01        .byte $01	; <あ>
- D - I - 0x02B138 20:B128: C8        .byte $C8	; <ぱ>
- D - I - 0x02B139 20:B129: 01        .byte $01	; <あ>
- D - I - 0x02B13A 20:B12A: C8        .byte $C8	; <ぱ>
- D - I - 0x02B13B 20:B12B: 01        .byte $01	; <あ>
- D - I - 0x02B13C 20:B12C: C8        .byte $C8	; <ぱ>
- D - I - 0x02B13D 20:B12D: 01        .byte $01	; <あ>
- D - I - 0x02B13E 20:B12E: C8        .byte $C8	; <ぱ>
- D - I - 0x02B13F 20:B12F: F5        .byte $F5
off_B130:
- D - I - 0x02B140 20:B130: 02        .byte $02	; <い>
- D - I - 0x02B141 20:B131: 41        .byte $41	; <ア>
- D - I - 0x02B142 20:B132: F6        .byte $F6
- D - I - 0x02B143 20:B133: F0        .byte $F0
- D - I - 0x02B144 20:B134: 00        .byte $00
- D - I - 0x02B145 20:B135: 01        .byte $01	; <あ>
- D - I - 0x02B146 20:B136: 41        .byte $41	; <ア>
- D - I - 0x02B147 20:B137: F6        .byte $F6
- D - I - 0x02B148 20:B138: 10        .byte $10	; <た>
- D - I - 0x02B149 20:B139: 00        .byte $00
- D - I - 0x02B14A 20:B13A: 01        .byte $01	; <あ>
- D - I - 0x02B14B 20:B13B: 41        .byte $41	; <ア>
- D - I - 0x02B14C 20:B13C: F6        .byte $F6
- D - I - 0x02B14D 20:B13D: 50        .byte $50	; <タ>
- D - I - 0x02B14E 20:B13E: 00        .byte $00
- D - I - 0x02B14F 20:B13F: 01        .byte $01	; <あ>
- D - I - 0x02B150 20:B140: 41        .byte $41	; <ア>
- D - I - 0x02B151 20:B141: F6        .byte $F6
- D - I - 0x02B152 20:B142: 28        .byte $28	; <り>
- D - I - 0x02B153 20:B143: 20        .byte $20	; <み>
- D - I - 0x02B154 20:B144: 01        .byte $01	; <あ>
- D - I - 0x02B155 20:B145: 41        .byte $41	; <ア>
- D - I - 0x02B156 20:B146: F6        .byte $F6
- D - I - 0x02B157 20:B147: E0        .byte $E0
- D - I - 0x02B158 20:B148: E0        .byte $E0
- D - I - 0x02B159 20:B149: 01        .byte $01	; <あ>
- D - I - 0x02B15A 20:B14A: 41        .byte $41	; <ア>
- D - I - 0x02B15B 20:B14B: F6        .byte $F6
- D - I - 0x02B15C 20:B14C: B0        .byte $B0	; <び>
- D - I - 0x02B15D 20:B14D: 00        .byte $00
- D - I - 0x02B15E 20:B14E: 01        .byte $01	; <あ>
- D - I - 0x02B15F 20:B14F: 41        .byte $41	; <ア>
off_B150:
- D - I - 0x02B160 20:B150: F6        .byte $F6
- D - I - 0x02B161 20:B151: D0        .byte $D0	; <ペ>
- D - I - 0x02B162 20:B152: 20        .byte $20	; <み>
- D - I - 0x02B163 20:B153: 01        .byte $01	; <あ>
- D - I - 0x02B164 20:B154: 41        .byte $41	; <ア>
- D - I - 0x02B165 20:B155: F6        .byte $F6
- D - I - 0x02B166 20:B156: 20        .byte $20	; <み>
- D - I - 0x02B167 20:B157: E0        .byte $E0
- D - I - 0x02B168 20:B158: 01        .byte $01	; <あ>
- D - I - 0x02B169 20:B159: 41        .byte $41	; <ア>
- D - I - 0x02B16A 20:B15A: F3        .byte $F3
- D - I - 0x02B16B 20:B15B: 30 B1     .word off_B130
off_B15D_71:
- D - I - 0x02B16D 20:B15D: 03        .byte $03	; <う>
- D - I - 0x02B16E 20:B15E: 7D        .byte $7D	; <ー>
- D - I - 0x02B16F 20:B15F: F6        .byte $F6
- D - I - 0x02B170 20:B160: 01        .byte $01	; <あ>
- D - I - 0x02B171 20:B161: FF        .byte $FF
- D - I - 0x02B172 20:B162: 01        .byte $01	; <あ>
- D - I - 0x02B173 20:B163: 7C        .byte $7C	; <~>
- D - I - 0x02B174 20:B164: F6        .byte $F6
- D - I - 0x02B175 20:B165: FF        .byte $FF
- D - I - 0x02B176 20:B166: 01        .byte $01	; <あ>
- D - I - 0x02B177 20:B167: 01        .byte $01	; <あ>
- D - I - 0x02B178 20:B168: 7B        .byte $7B	; <。>
- D - I - 0x02B179 20:B169: F6        .byte $F6
- D - I - 0x02B17A 20:B16A: FF        .byte $FF
- D - I - 0x02B17B 20:B16B: FF        .byte $FF
- D - I - 0x02B17C 20:B16C: 01        .byte $01	; <あ>
- D - I - 0x02B17D 20:B16D: 7A        .byte $7A	; <、>
- D - I - 0x02B17E 20:B16E: F6        .byte $F6
- D - I - 0x02B17F 20:B16F: 01        .byte $01	; <あ>
- D - I - 0x02B180 20:B170: 01        .byte $01	; <あ>
- D - I - 0x02B181 20:B171: 01        .byte $01	; <あ>
- D - I - 0x02B182 20:B172: 79        .byte $79	; <!>
- D - I - 0x02B183 20:B173: F6        .byte $F6
- D - I - 0x02B184 20:B174: FE        .byte $FE
- D - I - 0x02B185 20:B175: 02        .byte $02	; <い>
- D - I - 0x02B186 20:B176: 01        .byte $01	; <あ>
- D - I - 0x02B187 20:B177: 79        .byte $79	; <!>
- D - I - 0x02B188 20:B178: F6        .byte $F6
- D - I - 0x02B189 20:B179: 03        .byte $03	; <う>
- D - I - 0x02B18A 20:B17A: FE        .byte $FE
- D - I - 0x02B18B 20:B17B: 01        .byte $01	; <あ>
- D - I - 0x02B18C 20:B17C: 78        .byte $78	; <?>
- D - I - 0x02B18D 20:B17D: F6        .byte $F6
- D - I - 0x02B18E 20:B17E: 02        .byte $02	; <い>
- D - I - 0x02B18F 20:B17F: 02        .byte $02	; <い>
- D - I - 0x02B190 20:B180: 01        .byte $01	; <あ>
- D - I - 0x02B191 20:B181: 78        .byte $78	; <?>
- D - I - 0x02B192 20:B182: F6        .byte $F6
- D - I - 0x02B193 20:B183: FE        .byte $FE
- D - I - 0x02B194 20:B184: FE        .byte $FE
- D - I - 0x02B195 20:B185: 01        .byte $01	; <あ>
- D - I - 0x02B196 20:B186: 78        .byte $78	; <?>
- D - I - 0x02B197 20:B187: F6        .byte $F6
- D - I - 0x02B198 20:B188: 04        .byte $04	; <え>
- D - I - 0x02B199 20:B189: FC        .byte $FC
- D - I - 0x02B19A 20:B18A: 01        .byte $01	; <あ>
- D - I - 0x02B19B 20:B18B: 77        .byte $77	; <:>
- D - I - 0x02B19C 20:B18C: F6        .byte $F6
- D - I - 0x02B19D 20:B18D: FC        .byte $FC
- D - I - 0x02B19E 20:B18E: 05        .byte $05	; <お>
- D - I - 0x02B19F 20:B18F: 01        .byte $01	; <あ>
- D - I - 0x02B1A0 20:B190: 77        .byte $77	; <:>
- D - I - 0x02B1A1 20:B191: F6        .byte $F6
- D - I - 0x02B1A2 20:B192: FC        .byte $FC
- D - I - 0x02B1A3 20:B193: FC        .byte $FC
- D - I - 0x02B1A4 20:B194: 01        .byte $01	; <あ>
- D - I - 0x02B1A5 20:B195: 77        .byte $77	; <:>
- D - I - 0x02B1A6 20:B196: F6        .byte $F6
- D - I - 0x02B1A7 20:B197: 06        .byte $06	; <か>
- D - I - 0x02B1A8 20:B198: 08        .byte $08	; <く>
- D - I - 0x02B1A9 20:B199: 01        .byte $01	; <あ>
- D - I - 0x02B1AA 20:B19A: 76        .byte $76	; <ォ>
- D - I - 0x02B1AB 20:B19B: F6        .byte $F6
- D - I - 0x02B1AC 20:B19C: FA        .byte $FA
- D - I - 0x02B1AD 20:B19D: 06        .byte $06	; <か>
- D - I - 0x02B1AE 20:B19E: 01        .byte $01	; <あ>
- D - I - 0x02B1AF 20:B19F: 76        .byte $76	; <ォ>
- D - I - 0x02B1B0 20:B1A0: F6        .byte $F6
- D - I - 0x02B1B1 20:B1A1: 07        .byte $07	; <き>
- D - I - 0x02B1B2 20:B1A2: FA        .byte $FA
- D - I - 0x02B1B3 20:B1A3: 01        .byte $01	; <あ>
- D - I - 0x02B1B4 20:B1A4: 76        .byte $76	; <ォ>
- D - I - 0x02B1B5 20:B1A5: F6        .byte $F6
- D - I - 0x02B1B6 20:B1A6: 08        .byte $08	; <く>
- D - I - 0x02B1B7 20:B1A7: 08        .byte $08	; <く>
- D - I - 0x02B1B8 20:B1A8: 01        .byte $01	; <あ>
- D - I - 0x02B1B9 20:B1A9: 75        .byte $75	; <ェ>
- D - I - 0x02B1BA 20:B1AA: F6        .byte $F6
- D - I - 0x02B1BB 20:B1AB: F8        .byte $F8
- D - I - 0x02B1BC 20:B1AC: F8        .byte $F8
- D - I - 0x02B1BD 20:B1AD: 01        .byte $01	; <あ>
- D - I - 0x02B1BE 20:B1AE: 75        .byte $75	; <ェ>
- D - I - 0x02B1BF 20:B1AF: F6        .byte $F6
- D - I - 0x02B1C0 20:B1B0: 00        .byte $00
- D - I - 0x02B1C1 20:B1B1: F8        .byte $F8
- D - I - 0x02B1C2 20:B1B2: 01        .byte $01	; <あ>
- D - I - 0x02B1C3 20:B1B3: 75        .byte $75	; <ェ>
- D - I - 0x02B1C4 20:B1B4: F6        .byte $F6
- D - I - 0x02B1C5 20:B1B5: 10        .byte $10	; <た>
- D - I - 0x02B1C6 20:B1B6: FE        .byte $FE
- D - I - 0x02B1C7 20:B1B7: 01        .byte $01	; <あ>
- D - I - 0x02B1C8 20:B1B8: 74        .byte $74	; <ィ>
- D - I - 0x02B1C9 20:B1B9: F6        .byte $F6
- D - I - 0x02B1CA 20:B1BA: EC        .byte $EC
- D - I - 0x02B1CB 20:B1BB: 00        .byte $00
- D - I - 0x02B1CC 20:B1BC: 01        .byte $01	; <あ>
- D - I - 0x02B1CD 20:B1BD: 74        .byte $74	; <ィ>
- D - I - 0x02B1CE 20:B1BE: F6        .byte $F6
- D - I - 0x02B1CF 20:B1BF: 00        .byte $00
- D - I - 0x02B1D0 20:B1C0: 18        .byte $18	; <ね>
- D - I - 0x02B1D1 20:B1C1: 01        .byte $01	; <あ>
- D - I - 0x02B1D2 20:B1C2: 74        .byte $74	; <ィ>
- D - I - 0x02B1D3 20:B1C3: F6        .byte $F6
- D - I - 0x02B1D4 20:B1C4: E8        .byte $E8
- D - I - 0x02B1D5 20:B1C5: 1C        .byte $1C	; <ふ>
- D - I - 0x02B1D6 20:B1C6: 01        .byte $01	; <あ>
- D - I - 0x02B1D7 20:B1C7: 73        .byte $73	; <ヮ>
- D - I - 0x02B1D8 20:B1C8: F6        .byte $F6
- D - I - 0x02B1D9 20:B1C9: 18        .byte $18	; <ね>
- D - I - 0x02B1DA 20:B1CA: E8        .byte $E8
- D - I - 0x02B1DB 20:B1CB: 01        .byte $01	; <あ>
- D - I - 0x02B1DC 20:B1CC: 73        .byte $73	; <ヮ>
- D - I - 0x02B1DD 20:B1CD: F6        .byte $F6
- D - I - 0x02B1DE 20:B1CE: 1B        .byte $1B	; <ひ>
- D - I - 0x02B1DF 20:B1CF: 18        .byte $18	; <ね>
- D - I - 0x02B1E0 20:B1D0: 01        .byte $01	; <あ>
- D - I - 0x02B1E1 20:B1D1: 73        .byte $73	; <ヮ>
- D - I - 0x02B1E2 20:B1D2: 01        .byte $01	; <あ>
- D - I - 0x02B1E3 20:B1D3: 73        .byte $73	; <ヮ>
off_B1D4:
- D - I - 0x02B1E4 20:B1D4: F6        .byte $F6
- D - I - 0x02B1E5 20:B1D5: 00        .byte $00
- D - I - 0x02B1E6 20:B1D6: E0        .byte $E0
- D - I - 0x02B1E7 20:B1D7: 01        .byte $01	; <あ>
- D - I - 0x02B1E8 20:B1D8: 72        .byte $72	; <ョ>
- D - I - 0x02B1E9 20:B1D9: F6        .byte $F6
- D - I - 0x02B1EA 20:B1DA: D8        .byte $D8
- D - I - 0x02B1EB 20:B1DB: 14        .byte $14	; <と>
- D - I - 0x02B1EC 20:B1DC: 01        .byte $01	; <あ>
- D - I - 0x02B1ED 20:B1DD: 71        .byte $71	; <ュ>
- D - I - 0x02B1EE 20:B1DE: F6        .byte $F6
- D - I - 0x02B1EF 20:B1DF: E8        .byte $E8
- D - I - 0x02B1F0 20:B1E0: E0        .byte $E0
- D - I - 0x02B1F1 20:B1E1: 01        .byte $01	; <あ>
- D - I - 0x02B1F2 20:B1E2: 72        .byte $72	; <ョ>
- D - I - 0x02B1F3 20:B1E3: F6        .byte $F6
- D - I - 0x02B1F4 20:B1E4: 02        .byte $02	; <い>
- D - I - 0x02B1F5 20:B1E5: D8        .byte $D8
- D - I - 0x02B1F6 20:B1E6: 01        .byte $01	; <あ>
- D - I - 0x02B1F7 20:B1E7: 71        .byte $71	; <ュ>
- D - I - 0x02B1F8 20:B1E8: F6        .byte $F6
- D - I - 0x02B1F9 20:B1E9: 00        .byte $00
- D - I - 0x02B1FA 20:B1EA: 20        .byte $20	; <み>
- D - I - 0x02B1FB 20:B1EB: 01        .byte $01	; <あ>
- D - I - 0x02B1FC 20:B1EC: 72        .byte $72	; <ョ>
- D - I - 0x02B1FD 20:B1ED: F6        .byte $F6
- D - I - 0x02B1FE 20:B1EE: 28        .byte $28	; <り>
- D - I - 0x02B1FF 20:B1EF: 10        .byte $10	; <た>
- D - I - 0x02B200 20:B1F0: 01        .byte $01	; <あ>
- D - I - 0x02B201 20:B1F1: 71        .byte $71	; <ュ>
- D - I - 0x02B202 20:B1F2: F6        .byte $F6
- D - I - 0x02B203 20:B1F3: 20        .byte $20	; <み>
- D - I - 0x02B204 20:B1F4: F0        .byte $F0
- D - I - 0x02B205 20:B1F5: 01        .byte $01	; <あ>
- D - I - 0x02B206 20:B1F6: 72        .byte $72	; <ョ>
- D - I - 0x02B207 20:B1F7: F6        .byte $F6
- D - I - 0x02B208 20:B1F8: D8        .byte $D8
- D - I - 0x02B209 20:B1F9: E0        .byte $E0
- D - I - 0x02B20A 20:B1FA: 01        .byte $01	; <あ>
- D - I - 0x02B20B 20:B1FB: 71        .byte $71	; <ュ>
- D - I - 0x02B20C 20:B1FC: F6        .byte $F6
- D - I - 0x02B20D 20:B1FD: E0        .byte $E0
- D - I - 0x02B20E 20:B1FE: FD        .byte $FD
- D - I - 0x02B20F 20:B1FF: 01        .byte $01	; <あ>
- D - I - 0x02B210 20:B200: 72        .byte $72	; <ョ>
- D - I - 0x02B211 20:B201: F6        .byte $F6
- D - I - 0x02B212 20:B202: 10        .byte $10	; <た>
- D - I - 0x02B213 20:B203: 28        .byte $28	; <り>
- D - I - 0x02B214 20:B204: 01        .byte $01	; <あ>
- D - I - 0x02B215 20:B205: 71        .byte $71	; <ュ>
- D - I - 0x02B216 20:B206: F6        .byte $F6
- D - I - 0x02B217 20:B207: 40        .byte $40	; <「>
- D - I - 0x02B218 20:B208: 03        .byte $03	; <う>
- D - I - 0x02B219 20:B209: 01        .byte $01	; <あ>
- D - I - 0x02B21A 20:B20A: 71        .byte $71	; <ュ>
- D - I - 0x02B21B 20:B20B: F3        .byte $F3
- D - I - 0x02B21C 20:B20C: D4 B1     .word off_B1D4
off_B20E_72:
- D - I - 0x02B21E 20:B20E: 03        .byte $03	; <う>
- D - I - 0x02B21F 20:B20F: 7D        .byte $7D	; <ー>
- D - I - 0x02B220 20:B210: F6        .byte $F6
- D - I - 0x02B221 20:B211: 01        .byte $01	; <あ>
- D - I - 0x02B222 20:B212: FF        .byte $FF
- D - I - 0x02B223 20:B213: 01        .byte $01	; <あ>
- D - I - 0x02B224 20:B214: 7C        .byte $7C	; <~>
- D - I - 0x02B225 20:B215: F6        .byte $F6
- D - I - 0x02B226 20:B216: FE        .byte $FE
- D - I - 0x02B227 20:B217: 02        .byte $02	; <い>
- D - I - 0x02B228 20:B218: 01        .byte $01	; <あ>
- D - I - 0x02B229 20:B219: 7B        .byte $7B	; <。>
- D - I - 0x02B22A 20:B21A: F6        .byte $F6
- D - I - 0x02B22B 20:B21B: FE        .byte $FE
- D - I - 0x02B22C 20:B21C: FE        .byte $FE
- D - I - 0x02B22D 20:B21D: 01        .byte $01	; <あ>
- D - I - 0x02B22E 20:B21E: 7A        .byte $7A	; <、>
- D - I - 0x02B22F 20:B21F: F6        .byte $F6
- D - I - 0x02B230 20:B220: 04        .byte $04	; <え>
- D - I - 0x02B231 20:B221: 04        .byte $04	; <え>
- D - I - 0x02B232 20:B222: 01        .byte $01	; <あ>
- D - I - 0x02B233 20:B223: 79        .byte $79	; <!>
- D - I - 0x02B234 20:B224: F6        .byte $F6
- D - I - 0x02B235 20:B225: FC        .byte $FC
- D - I - 0x02B236 20:B226: 04        .byte $04	; <え>
- D - I - 0x02B237 20:B227: 01        .byte $01	; <あ>
- D - I - 0x02B238 20:B228: 78        .byte $78	; <?>
- D - I - 0x02B239 20:B229: F6        .byte $F6
- D - I - 0x02B23A 20:B22A: 06        .byte $06	; <か>
- D - I - 0x02B23B 20:B22B: FA        .byte $FA
- D - I - 0x02B23C 20:B22C: 01        .byte $01	; <あ>
- D - I - 0x02B23D 20:B22D: 77        .byte $77	; <:>
- D - I - 0x02B23E 20:B22E: F6        .byte $F6
- D - I - 0x02B23F 20:B22F: 06        .byte $06	; <か>
- D - I - 0x02B240 20:B230: 06        .byte $06	; <か>
- D - I - 0x02B241 20:B231: 01        .byte $01	; <あ>
- D - I - 0x02B242 20:B232: 76        .byte $76	; <ォ>
- D - I - 0x02B243 20:B233: F6        .byte $F6
- D - I - 0x02B244 20:B234: F8        .byte $F8
- D - I - 0x02B245 20:B235: F8        .byte $F8
- D - I - 0x02B246 20:B236: 01        .byte $01	; <あ>
- D - I - 0x02B247 20:B237: 76        .byte $76	; <ォ>
- D - I - 0x02B248 20:B238: F6        .byte $F6
- D - I - 0x02B249 20:B239: 08        .byte $08	; <く>
- D - I - 0x02B24A 20:B23A: F8        .byte $F8
- D - I - 0x02B24B 20:B23B: 01        .byte $01	; <あ>
- D - I - 0x02B24C 20:B23C: 75        .byte $75	; <ェ>
- D - I - 0x02B24D 20:B23D: F6        .byte $F6
- D - I - 0x02B24E 20:B23E: F4        .byte $F4
- D - I - 0x02B24F 20:B23F: 0C        .byte $0C	; <し>
- D - I - 0x02B250 20:B240: 01        .byte $01	; <あ>
- D - I - 0x02B251 20:B241: 75        .byte $75	; <ェ>
- D - I - 0x02B252 20:B242: F6        .byte $F6
- D - I - 0x02B253 20:B243: F4        .byte $F4
- D - I - 0x02B254 20:B244: F4        .byte $F4
- D - I - 0x02B255 20:B245: 01        .byte $01	; <あ>
- D - I - 0x02B256 20:B246: 74        .byte $74	; <ィ>
- D - I - 0x02B257 20:B247: F6        .byte $F6
- D - I - 0x02B258 20:B248: 10        .byte $10	; <た>
- D - I - 0x02B259 20:B249: 10        .byte $10	; <た>
- D - I - 0x02B25A 20:B24A: 01        .byte $01	; <あ>
- D - I - 0x02B25B 20:B24B: 74        .byte $74	; <ィ>
- D - I - 0x02B25C 20:B24C: F6        .byte $F6
- D - I - 0x02B25D 20:B24D: F0        .byte $F0
- D - I - 0x02B25E 20:B24E: 10        .byte $10	; <た>
- D - I - 0x02B25F 20:B24F: 01        .byte $01	; <あ>
- D - I - 0x02B260 20:B250: 73        .byte $73	; <ヮ>
- D - I - 0x02B261 20:B251: F6        .byte $F6
- D - I - 0x02B262 20:B252: 18        .byte $18	; <ね>
- D - I - 0x02B263 20:B253: E8        .byte $E8
- D - I - 0x02B264 20:B254: 01        .byte $01	; <あ>
- D - I - 0x02B265 20:B255: 73        .byte $73	; <ヮ>
- D - I - 0x02B266 20:B256: F6        .byte $F6
- D - I - 0x02B267 20:B257: 18        .byte $18	; <ね>
- D - I - 0x02B268 20:B258: 18        .byte $18	; <ね>
- D - I - 0x02B269 20:B259: 01        .byte $01	; <あ>
- D - I - 0x02B26A 20:B25A: 72        .byte $72	; <ョ>
- D - I - 0x02B26B 20:B25B: F6        .byte $F6
- D - I - 0x02B26C 20:B25C: E0        .byte $E0
- D - I - 0x02B26D 20:B25D: E0        .byte $E0
- D - I - 0x02B26E 20:B25E: 01        .byte $01	; <あ>
- D - I - 0x02B26F 20:B25F: 72        .byte $72	; <ョ>
- D - I - 0x02B270 20:B260: F6        .byte $F6
- D - I - 0x02B271 20:B261: 20        .byte $20	; <み>
- D - I - 0x02B272 20:B262: E0        .byte $E0
- D - I - 0x02B273 20:B263: 01        .byte $01	; <あ>
- D - I - 0x02B274 20:B264: 72        .byte $72	; <ョ>
- D - I - 0x02B275 20:B265: F6        .byte $F6
- D - I - 0x02B276 20:B266: 28        .byte $28	; <り>
- D - I - 0x02B277 20:B267: 28        .byte $28	; <り>
- D - I - 0x02B278 20:B268: 01        .byte $01	; <あ>
- D - I - 0x02B279 20:B269: 71        .byte $71	; <ュ>
- D - I - 0x02B27A 20:B26A: F6        .byte $F6
- D - I - 0x02B27B 20:B26B: 00        .byte $00
- D - I - 0x02B27C 20:B26C: D8        .byte $D8
- D - I - 0x02B27D 20:B26D: 01        .byte $01	; <あ>
- D - I - 0x02B27E 20:B26E: 71        .byte $71	; <ュ>
- D - I - 0x02B27F 20:B26F: F6        .byte $F6
- D - I - 0x02B280 20:B270: D8        .byte $D8
- D - I - 0x02B281 20:B271: 28        .byte $28	; <り>
- D - I - 0x02B282 20:B272: 01        .byte $01	; <あ>
- D - I - 0x02B283 20:B273: 71        .byte $71	; <ュ>
- D - I - 0x02B284 20:B274: F3        .byte $F3
- D - I - 0x02B285 20:B275: D4 B1     .word off_B1D4
off_B277_73:
- D - I - 0x02B287 20:B277: F8        .byte $F8
- D - I - 0x02B288 20:B278: 04        .byte $04	; <え>
- D - I - 0x02B289 20:B279: F3        .byte $F3
- D - I - 0x02B28A 20:B27A: 78 AE     .word off_AE78
off_B27C_74:
- D - I - 0x02B28C 20:B27C: F8        .byte $F8
- D - I - 0x02B28D 20:B27D: 06        .byte $06	; <か>
- D - I - 0x02B28E 20:B27E: F3        .byte $F3
- D - I - 0x02B28F 20:B27F: 07 B0     .word off_B007
off_B281_75:
- D - I - 0x02B291 20:B281: F8        .byte $F8
- D - I - 0x02B292 20:B282: 01        .byte $01	; <あ>
- D - I - 0x02B293 20:B283: F3        .byte $F3
- D - I - 0x02B294 20:B284: 63 AF     .word off_AF63
off_B286_76:
- D - I - 0x02B296 20:B286: F8        .byte $F8
- D - I - 0x02B297 20:B287: 04        .byte $04	; <え>
- D - I - 0x02B298 20:B288: F3        .byte $F3
- D - I - 0x02B299 20:B289: 63 AF     .word off_AF63
off_B28B_77:
- D - I - 0x02B29B 20:B28B: F8        .byte $F8
- D - I - 0x02B29C 20:B28C: 00        .byte $00
- D - I - 0x02B29D 20:B28D: F3        .byte $F3
- D - I - 0x02B29E 20:B28E: 63 AF     .word off_AF63
off_B290_78:
- D - I - 0x02B2A0 20:B290: F7        .byte $F7
- D - I - 0x02B2A1 20:B291: C0        .byte $C0	; <ヅ>
off_B292_79:
- D - I - 0x02B2A2 20:B292: F7        .byte $F7
- D - I - 0x02B2A3 20:B293: C2        .byte $C2	; <ド>
off_B294_7A:
- - - - - 0x02B2A4 20:B294: F3        .byte $F3
- - - - - 0x02B2A5 20:B295: 50 B1     .word off_B150
off_B297_7B:
off_B297:
- D - I - 0x02B2A7 20:B297: F8        .byte $F8
- D - I - 0x02B2A8 20:B298: 00        .byte $00
- D - I - 0x02B2A9 20:B299: 01        .byte $01	; <あ>
- D - I - 0x02B2AA 20:B29A: 2C        .byte $2C	; <わ>
- D - I - 0x02B2AB 20:B29B: F8        .byte $F8
- D - I - 0x02B2AC 20:B29C: 07        .byte $07	; <き>
- D - I - 0x02B2AD 20:B29D: F1        .byte $F1
- D - I - 0x02B2AE 20:B29E: 01        .byte $01	; <あ>
- D - I - 0x02B2AF 20:B29F: 2C        .byte $2C	; <わ>
- D - I - 0x02B2B0 20:B2A0: F3        .byte $F3
- D - I - 0x02B2B1 20:B2A1: 97 B2     .word off_B297
off_B2A3_7C:
off_B2A3:
- D - I - 0x02B2B3 20:B2A3: F8        .byte $F8
- D - I - 0x02B2B4 20:B2A4: 03        .byte $03	; <う>
- D - I - 0x02B2B5 20:B2A5: 01        .byte $01	; <あ>
- D - I - 0x02B2B6 20:B2A6: 2C        .byte $2C	; <わ>
- D - I - 0x02B2B7 20:B2A7: F8        .byte $F8
- D - I - 0x02B2B8 20:B2A8: 03        .byte $03	; <う>
- D - I - 0x02B2B9 20:B2A9: F1        .byte $F1
- D - I - 0x02B2BA 20:B2AA: 01        .byte $01	; <あ>
- D - I - 0x02B2BB 20:B2AB: 2C        .byte $2C	; <わ>
- D - I - 0x02B2BC 20:B2AC: F3        .byte $F3
- D - I - 0x02B2BD 20:B2AD: A3 B2     .word off_B2A3
off_B2AF_7D:
off_B2AF:
- D - I - 0x02B2BF 20:B2AF: F8        .byte $F8
- D - I - 0x02B2C0 20:B2B0: 07        .byte $07	; <き>
- D - I - 0x02B2C1 20:B2B1: 01        .byte $01	; <あ>
- D - I - 0x02B2C2 20:B2B2: 2C        .byte $2C	; <わ>
- D - I - 0x02B2C3 20:B2B3: F8        .byte $F8
- D - I - 0x02B2C4 20:B2B4: 0A        .byte $0A	; <こ>
- D - I - 0x02B2C5 20:B2B5: F1        .byte $F1
- D - I - 0x02B2C6 20:B2B6: 01        .byte $01	; <あ>
- D - I - 0x02B2C7 20:B2B7: 2C        .byte $2C	; <わ>
- D - I - 0x02B2C8 20:B2B8: F3        .byte $F3
- D - I - 0x02B2C9 20:B2B9: AF B2     .word off_B2AF
off_B2BB_7E:
- D - I - 0x02B2CB 20:B2BB: F8        .byte $F8
- D - I - 0x02B2CC 20:B2BC: 01        .byte $01	; <あ>
- D - I - 0x02B2CD 20:B2BD: F3        .byte $F3
- D - I - 0x02B2CE 20:B2BE: 63 AF     .word off_AF63
off_B2C0_7F:
off_B2C0:
- D - I - 0x02B2D0 20:B2C0: F1        .byte $F1
- D - I - 0x02B2D1 20:B2C1: 02        .byte $02	; <い>
- D - I - 0x02B2D2 20:B2C2: 43        .byte $43	; <ウ>
- D - I - 0x02B2D3 20:B2C3: F1        .byte $F1
- D - I - 0x02B2D4 20:B2C4: 02        .byte $02	; <い>
- D - I - 0x02B2D5 20:B2C5: 44        .byte $44	; <エ>
- D - I - 0x02B2D6 20:B2C6: F1        .byte $F1
- D - I - 0x02B2D7 20:B2C7: 02        .byte $02	; <い>
- D - I - 0x02B2D8 20:B2C8: 45        .byte $45	; <オ>
- D - I - 0x02B2D9 20:B2C9: F1        .byte $F1
- D - I - 0x02B2DA 20:B2CA: 02        .byte $02	; <い>
- D - I - 0x02B2DB 20:B2CB: 46        .byte $46	; <カ>
- - - - - 0x02B2DC 20:B2CC: F3        .byte $F3
- - - - - 0x02B2DD 20:B2CD: C0 B2     .word off_B2C0
off_B2CF_80:
- D - I - 0x02B2DF 20:B2CF: F1        .byte $F1
- D - I - 0x02B2E0 20:B2D0: F7        .byte $F7
- D - I - 0x02B2E1 20:B2D1: 41        .byte $41	; <ア>
off_B2D2_81:
- D - I - 0x02B2E2 20:B2D2: F7        .byte $F7
- D - I - 0x02B2E3 20:B2D3: 30        .byte $30	; <ゃ>
off_B2D4_82:
- D - I - 0x02B2E4 20:B2D4: E1        .byte $E1
- D - I - 0x02B2E5 20:B2D5: C2        .byte $C2	; <ド>
- D - I - 0x02B2E6 20:B2D6: 30        .byte $30	; <ゃ>
- D - I - 0x02B2E7 20:B2D7: C2        .byte $C2	; <ド>
- D - I - 0x02B2E8 20:B2D8: F7        .byte $F7
- D - I - 0x02B2E9 20:B2D9: C1        .byte $C1	; <デ>
off_B2DA_83:
- D - I - 0x02B2EA 20:B2DA: F1        .byte $F1
- D - I - 0x02B2EB 20:B2DB: 06        .byte $06	; <か>
- D - I - 0x02B2EC 20:B2DC: A0        .byte $A0	; <が>
- D - I - 0x02B2ED 20:B2DD: F1        .byte $F1
- D - I - 0x02B2EE 20:B2DE: F7        .byte $F7
- D - I - 0x02B2EF 20:B2DF: A1        .byte $A1	; <ぎ>
off_B2E0_84:
off_B2E0:
- D - I - 0x02B2F0 20:B2E0: F1        .byte $F1
- D - I - 0x02B2F1 20:B2E1: 01        .byte $01	; <あ>
- D - I - 0x02B2F2 20:B2E2: 10        .byte $10	; <た>
- D - I - 0x02B2F3 20:B2E3: F4        .byte $F4
- D - I - 0x02B2F4 20:B2E4: 01        .byte $01	; <あ>
- D - I - 0x02B2F5 20:B2E5: F1        .byte $F1
- D - I - 0x02B2F6 20:B2E6: 01        .byte $01	; <あ>
- D - I - 0x02B2F7 20:B2E7: 11        .byte $11	; <ち>
- D - I - 0x02B2F8 20:B2E8: F1        .byte $F1
- D - I - 0x02B2F9 20:B2E9: 01        .byte $01	; <あ>
- D - I - 0x02B2FA 20:B2EA: 12        .byte $12	; <つ>
- D - I - 0x02B2FB 20:B2EB: F5        .byte $F5
- D - I - 0x02B2FC 20:B2EC: F1        .byte $F1
- D - I - 0x02B2FD 20:B2ED: F7        .byte $F7
- D - I - 0x02B2FE 20:B2EE: 10        .byte $10	; <た>
off_B2EF_85:
off_B2EF:
- D - I - 0x02B2FF 20:B2EF: F1        .byte $F1
- D - I - 0x02B300 20:B2F0: F7        .byte $F7
- D - I - 0x02B301 20:B2F1: 0F        .byte $0F	; <そ>
off_B2F2_86:
- D - I - 0x02B302 20:B2F2: F1        .byte $F1
- D - I - 0x02B303 20:B2F3: F7        .byte $F7
- D - I - 0x02B304 20:B2F4: 13        .byte $13	; <て>
off_B2F5_87:
- - - - - 0x02B305 20:B2F5: F1        .byte $F1
- - - - - 0x02B306 20:B2F6: F7        .byte $F7
- - - - - 0x02B307 20:B2F7: 9E        .byte $9E
off_B2F8_88:
- - - - - 0x02B308 20:B2F8: F7        .byte $F7
- - - - - 0x02B309 20:B2F9: 7D        .byte $7D	; <ー>
off_B2FA_89:
- - - - - 0x02B30A 20:B2FA: F1        .byte $F1
- - - - - 0x02B30B 20:B2FB: F7        .byte $F7
- - - - - 0x02B30C 20:B2FC: A9        .byte $A9	; <ぞ>
off_B2FD_8A:
- D - I - 0x02B30D 20:B2FD: 06        .byte $06	; <か>
- D - I - 0x02B30E 20:B2FE: A0        .byte $A0	; <が>
- D - I - 0x02B30F 20:B2FF: F7        .byte $F7
- D - I - 0x02B310 20:B300: A1        .byte $A1	; <ぎ>
off_B301_8B:
- D - I - 0x02B311 20:B301: F1        .byte $F1
- D - I - 0x02B312 20:B302: F7        .byte $F7
- D - I - 0x02B313 20:B303: 98        .byte $98
off_B304_8C:
- D - I - 0x02B314 20:B304: F7        .byte $F7
- D - I - 0x02B315 20:B305: 52        .byte $52	; <ツ>
off_B306_8D:
- D - I - 0x02B316 20:B306: F7        .byte $F7
- D - I - 0x02B317 20:B307: 53        .byte $53	; <テ>
off_B308_8E:
- D - I - 0x02B318 20:B308: F7        .byte $F7
- D - I - 0x02B319 20:B309: 54        .byte $54	; <ト>
off_B30A_8F:
- D - I - 0x02B31A 20:B30A: F7        .byte $F7
- D - I - 0x02B31B 20:B30B: CF        .byte $CF	; <プ>
off_B30C_90:
- D - I - 0x02B31C 20:B30C: F7        .byte $F7
- D - I - 0x02B31D 20:B30D: D0        .byte $D0	; <ペ>
off_B30E_91:
- D - I - 0x02B31E 20:B30E: F7        .byte $F7
- D - I - 0x02B31F 20:B30F: B8        .byte $B8	; <ゴ>
off_B310_92:
- D - I - 0x02B320 20:B310: F7        .byte $F7
- D - I - 0x02B321 20:B311: BA        .byte $BA	; <ジ>
off_B312_93:
- D - I - 0x02B322 20:B312: F7        .byte $F7
- D - I - 0x02B323 20:B313: B9        .byte $B9	; <ザ>
off_B314_94:
off_B314:
- D - I - 0x02B324 20:B314: F6        .byte $F6
- D - I - 0x02B325 20:B315: 04        .byte $04	; <え>
- D - I - 0x02B326 20:B316: 00        .byte $00
- D - I - 0x02B327 20:B317: 04        .byte $04	; <え>
- D - I - 0x02B328 20:B318: 02        .byte $02	; <い>
- D - I - 0x02B329 20:B319: F6        .byte $F6
- D - I - 0x02B32A 20:B31A: FF        .byte $FF
- D - I - 0x02B32B 20:B31B: 00        .byte $00
- D - I - 0x02B32C 20:B31C: 04        .byte $04	; <え>
- D - I - 0x02B32D 20:B31D: 03        .byte $03	; <う>
- D - I - 0x02B32E 20:B31E: 04        .byte $04	; <え>
- D - I - 0x02B32F 20:B31F: 00        .byte $00
- D - I - 0x02B330 20:B320: F6        .byte $F6
- D - I - 0x02B331 20:B321: 04        .byte $04	; <え>
- D - I - 0x02B332 20:B322: 00        .byte $00
- D - I - 0x02B333 20:B323: 04        .byte $04	; <え>
- D - I - 0x02B334 20:B324: 01        .byte $01	; <あ>
- D - I - 0x02B335 20:B325: F3        .byte $F3
- D - I - 0x02B336 20:B326: 14 B3     .word off_B314
off_B328_95:
off_B328:
- D - I - 0x02B338 20:B328: F3        .byte $F3
- D - I - 0x02B339 20:B329: 52 B0     .word off_B052
off_B32B_96:
- D - I - 0x02B33B 20:B32B: F3        .byte $F3
- D - I - 0x02B33C 20:B32C: 6B B0     .word off_B06B
off_B32E_97:
- D - I - 0x02B33E 20:B32E: F8        .byte $F8
- D - I - 0x02B33F 20:B32F: 07        .byte $07	; <き>
- D - I - 0x02B340 20:B330: F3        .byte $F3
- D - I - 0x02B341 20:B331: 31 B0     .word off_B031
off_B333_98:
- D - I - 0x02B343 20:B333: F7        .byte $F7
- D - I - 0x02B344 20:B334: 55        .byte $55	; <ナ>
off_B335_99:
- D - I - 0x02B345 20:B335: F7        .byte $F7
- D - I - 0x02B346 20:B336: 56        .byte $56	; <ニ>
off_B337_9A:
- D - I - 0x02B347 20:B337: F7        .byte $F7
- D - I - 0x02B348 20:B338: 57        .byte $57	; <ヌ>
off_B339_9B:
- D - I - 0x02B349 20:B339: F7        .byte $F7
- D - I - 0x02B34A 20:B33A: 58        .byte $58	; <ネ>
off_B33B_9C:
- D - I - 0x02B34B 20:B33B: F7        .byte $F7
- D - I - 0x02B34C 20:B33C: 59        .byte $59	; <ノ>
off_B33D_9D:
- D - I - 0x02B34D 20:B33D: F7        .byte $F7
- D - I - 0x02B34E 20:B33E: 5A        .byte $5A	; <ハ>
off_B33F_9E:
- D - I - 0x02B34F 20:B33F: F7        .byte $F7
- D - I - 0x02B350 20:B340: 5B        .byte $5B	; <ヒ>
off_B341_9F:
- D - I - 0x02B351 20:B341: F7        .byte $F7
- D - I - 0x02B352 20:B342: 5C        .byte $5C	; <フ>
off_B343_A0:
- D - I - 0x02B353 20:B343: F7        .byte $F7
- D - I - 0x02B354 20:B344: 5D        .byte $5D	; <ヘ>
off_B345_A1:
- D - I - 0x02B355 20:B345: F7        .byte $F7
- D - I - 0x02B356 20:B346: 5E        .byte $5E	; <ホ>
off_B347_A2:
- D - I - 0x02B357 20:B347: F7        .byte $F7
- D - I - 0x02B358 20:B348: 5F        .byte $5F	; <マ>
off_B349_A3:
- D - I - 0x02B359 20:B349: F7        .byte $F7
- D - I - 0x02B35A 20:B34A: 60        .byte $60	; <ミ>
off_B34B_A4:
- D - I - 0x02B35B 20:B34B: F7        .byte $F7
- D - I - 0x02B35C 20:B34C: 61        .byte $61	; <ム>
off_B34D_A5:
- D - I - 0x02B35D 20:B34D: F7        .byte $F7
- D - I - 0x02B35E 20:B34E: 62        .byte $62	; <メ>
off_B34F_A6:
- D - I - 0x02B35F 20:B34F: F7        .byte $F7
- D - I - 0x02B360 20:B350: 63        .byte $63	; <モ>
off_B351_A7:
- D - I - 0x02B361 20:B351: F7        .byte $F7
- D - I - 0x02B362 20:B352: 64        .byte $64	; <ヤ>
off_B353_A8:
- D - I - 0x02B363 20:B353: F7        .byte $F7
- D - I - 0x02B364 20:B354: 65        .byte $65	; <ユ>
off_B355_A9:
- D - I - 0x02B365 20:B355: F7        .byte $F7
- D - I - 0x02B366 20:B356: 66        .byte $66	; <ヨ>
off_B357_AA:
- D - I - 0x02B367 20:B357: F7        .byte $F7
- D - I - 0x02B368 20:B358: 67        .byte $67	; <ラ>
off_B359_AB:
- D - I - 0x02B369 20:B359: F7        .byte $F7
- D - I - 0x02B36A 20:B35A: 68        .byte $68	; <リ>
off_B35B_AC:
- D - I - 0x02B36B 20:B35B: F7        .byte $F7
- D - I - 0x02B36C 20:B35C: 69        .byte $69	; <ル>
off_B35D_AD:
- D - I - 0x02B36D 20:B35D: F7        .byte $F7
- D - I - 0x02B36E 20:B35E: B3        .byte $B3	; <ぼ>
off_B35F_AE:
- D - I - 0x02B36F 20:B35F: F7        .byte $F7
- D - I - 0x02B370 20:B360: B4        .byte $B4	; <ガ>
off_B361_AF:
- D - I - 0x02B371 20:B361: F7        .byte $F7
- D - I - 0x02B372 20:B362: B5        .byte $B5	; <ギ>
off_B363_B0:
- D - I - 0x02B373 20:B363: F7        .byte $F7
- D - I - 0x02B374 20:B364: B6        .byte $B6	; <グ>
off_B365_B1:
- D - I - 0x02B375 20:B365: F7        .byte $F7
- D - I - 0x02B376 20:B366: D1        .byte $D1	; <ポ>
off_B367_B2:
off_B367:
- D - I - 0x02B377 20:B367: 01        .byte $01	; <あ>
- D - I - 0x02B378 20:B368: BF        .byte $BF	; <ヂ>
- D - I - 0x02B379 20:B369: F6        .byte $F6
- D - I - 0x02B37A 20:B36A: 01        .byte $01	; <あ>
- D - I - 0x02B37B 20:B36B: 00        .byte $00
- D - I - 0x02B37C 20:B36C: 01        .byte $01	; <あ>
- D - I - 0x02B37D 20:B36D: BF        .byte $BF	; <ヂ>
- D - I - 0x02B37E 20:B36E: F3        .byte $F3
- D - I - 0x02B37F 20:B36F: 67 B3     .word off_B367
off_B371_B3:
- D - I - 0x02B381 20:B371: F7        .byte $F7
- D - I - 0x02B382 20:B372: B2        .byte $B2	; <べ>
off_B373_B4:
- D - I - 0x02B383 20:B373: 06        .byte $06	; <か>
- D - I - 0x02B384 20:B374: 87        .byte $87	; <G>
- D - I - 0x02B385 20:B375: 06        .byte $06	; <か>
- D - I - 0x02B386 20:B376: 86        .byte $86	; <F>
- D - I - 0x02B387 20:B377: 06        .byte $06	; <か>
- D - I - 0x02B388 20:B378: 85        .byte $85	; <E>
- D - I - 0x02B389 20:B379: 06        .byte $06	; <か>
- D - I - 0x02B38A 20:B37A: 84        .byte $84	; <D>
- D - I - 0x02B38B 20:B37B: 06        .byte $06	; <か>
- D - I - 0x02B38C 20:B37C: 83        .byte $83	; <C>
- D - I - 0x02B38D 20:B37D: F6        .byte $F6
- D - I - 0x02B38E 20:B37E: 00        .byte $00
- D - I - 0x02B38F 20:B37F: FF        .byte $FF
- D - I - 0x02B390 20:B380: 06        .byte $06	; <か>
- D - I - 0x02B391 20:B381: 82        .byte $82	; <B>
- D - I - 0x02B392 20:B382: F6        .byte $F6
- D - I - 0x02B393 20:B383: 00        .byte $00
- D - I - 0x02B394 20:B384: 01        .byte $01	; <あ>
- D - I - 0x02B395 20:B385: 06        .byte $06	; <か>
- D - I - 0x02B396 20:B386: 81        .byte $81	; <A>
- D - I - 0x02B397 20:B387: F6        .byte $F6
- D - I - 0x02B398 20:B388: 00        .byte $00
- D - I - 0x02B399 20:B389: FF        .byte $FF
- D - I - 0x02B39A 20:B38A: 06        .byte $06	; <か>
- D - I - 0x02B39B 20:B38B: 80        .byte $80
- D - I - 0x02B39C 20:B38C: F6        .byte $F6
- D - I - 0x02B39D 20:B38D: 00        .byte $00
- D - I - 0x02B39E 20:B38E: 04        .byte $04	; <え>
- D - I - 0x02B39F 20:B38F: 06        .byte $06	; <か>
- D - I - 0x02B3A0 20:B390: 7F        .byte $7F	; <,>
off_B391:
- D - I - 0x02B3A1 20:B391: F6        .byte $F6
- D - I - 0x02B3A2 20:B392: 00        .byte $00
- D - I - 0x02B3A3 20:B393: 01        .byte $01	; <あ>
- D - I - 0x02B3A4 20:B394: 01        .byte $01	; <あ>
- D - I - 0x02B3A5 20:B395: 7E        .byte $7E	; <.>
- D - I - 0x02B3A6 20:B396: F2        .byte $F2
- D - I - 0x02B3A7 20:B397: F1        .byte $F1
- D - I - 0x02B3A8 20:B398: F6        .byte $F6
- D - I - 0x02B3A9 20:B399: 00        .byte $00
- D - I - 0x02B3AA 20:B39A: 01        .byte $01	; <あ>
- D - I - 0x02B3AB 20:B39B: 01        .byte $01	; <あ>
- D - I - 0x02B3AC 20:B39C: 7E        .byte $7E	; <.>
- D - I - 0x02B3AD 20:B39D: F3        .byte $F3
- D - I - 0x02B3AE 20:B39E: 91 B3     .word off_B391
off_B3A0_B5:
- - - - - 0x02B3B0 20:B3A0: 01        .byte $01	; <あ>
- - - - - 0x02B3B1 20:B3A1: 87        .byte $87	; <G>
- - - - - 0x02B3B2 20:B3A2: 01        .byte $01	; <あ>
- - - - - 0x02B3B3 20:B3A3: 86        .byte $86	; <F>
- - - - - 0x02B3B4 20:B3A4: 01        .byte $01	; <あ>
- - - - - 0x02B3B5 20:B3A5: 85        .byte $85	; <E>
- - - - - 0x02B3B6 20:B3A6: 02        .byte $02	; <い>
- - - - - 0x02B3B7 20:B3A7: 84        .byte $84	; <D>
- - - - - 0x02B3B8 20:B3A8: 02        .byte $02	; <い>
- - - - - 0x02B3B9 20:B3A9: 83        .byte $83	; <C>
- - - - - 0x02B3BA 20:B3AA: F6        .byte $F6
- - - - - 0x02B3BB 20:B3AB: 00        .byte $00
- - - - - 0x02B3BC 20:B3AC: FF        .byte $FF
- - - - - 0x02B3BD 20:B3AD: 02        .byte $02	; <い>
- - - - - 0x02B3BE 20:B3AE: 82        .byte $82	; <B>
- - - - - 0x02B3BF 20:B3AF: F6        .byte $F6
- - - - - 0x02B3C0 20:B3B0: 00        .byte $00
- - - - - 0x02B3C1 20:B3B1: 01        .byte $01	; <あ>
- - - - - 0x02B3C2 20:B3B2: 03        .byte $03	; <う>
- - - - - 0x02B3C3 20:B3B3: 81        .byte $81	; <A>
- - - - - 0x02B3C4 20:B3B4: F6        .byte $F6
- - - - - 0x02B3C5 20:B3B5: 00        .byte $00
- - - - - 0x02B3C6 20:B3B6: FF        .byte $FF
- - - - - 0x02B3C7 20:B3B7: 03        .byte $03	; <う>
- - - - - 0x02B3C8 20:B3B8: 80        .byte $80
- - - - - 0x02B3C9 20:B3B9: F6        .byte $F6
- - - - - 0x02B3CA 20:B3BA: 00        .byte $00
- - - - - 0x02B3CB 20:B3BB: 04        .byte $04	; <え>
- - - - - 0x02B3CC 20:B3BC: 03        .byte $03	; <う>
- - - - - 0x02B3CD 20:B3BD: 7F        .byte $7F	; <,>
- - - - - 0x02B3CE 20:B3BE: F3        .byte $F3
- - - - - 0x02B3CF 20:B3BF: 91 B3     .word off_B391
off_B3C1_B6:
- D - I - 0x02B3D1 20:B3C1: F6        .byte $F6
- D - I - 0x02B3D2 20:B3C2: 00        .byte $00
- D - I - 0x02B3D3 20:B3C3: 01        .byte $01	; <あ>
- D - I - 0x02B3D4 20:B3C4: 03        .byte $03	; <う>
- D - I - 0x02B3D5 20:B3C5: 7E        .byte $7E	; <.>
- D - I - 0x02B3D6 20:B3C6: F6        .byte $F6
- D - I - 0x02B3D7 20:B3C7: 00        .byte $00
- D - I - 0x02B3D8 20:B3C8: 04        .byte $04	; <え>
- D - I - 0x02B3D9 20:B3C9: 03        .byte $03	; <う>
- D - I - 0x02B3DA 20:B3CA: 7F        .byte $7F	; <,>
- D - I - 0x02B3DB 20:B3CB: F6        .byte $F6
- D - I - 0x02B3DC 20:B3CC: 00        .byte $00
- D - I - 0x02B3DD 20:B3CD: FF        .byte $FF
- D - I - 0x02B3DE 20:B3CE: 03        .byte $03	; <う>
- D - I - 0x02B3DF 20:B3CF: 80        .byte $80
- D - I - 0x02B3E0 20:B3D0: F6        .byte $F6
- D - I - 0x02B3E1 20:B3D1: 00        .byte $00
- D - I - 0x02B3E2 20:B3D2: 01        .byte $01	; <あ>
- D - I - 0x02B3E3 20:B3D3: 03        .byte $03	; <う>
- D - I - 0x02B3E4 20:B3D4: 81        .byte $81	; <A>
- D - I - 0x02B3E5 20:B3D5: F6        .byte $F6
- D - I - 0x02B3E6 20:B3D6: 00        .byte $00
- D - I - 0x02B3E7 20:B3D7: FF        .byte $FF
- D - I - 0x02B3E8 20:B3D8: 03        .byte $03	; <う>
- D - I - 0x02B3E9 20:B3D9: 82        .byte $82	; <B>
- D - I - 0x02B3EA 20:B3DA: 03        .byte $03	; <う>
- D - I - 0x02B3EB 20:B3DB: 83        .byte $83	; <C>
- D - I - 0x02B3EC 20:B3DC: 03        .byte $03	; <う>
- D - I - 0x02B3ED 20:B3DD: 84        .byte $84	; <D>
- D - I - 0x02B3EE 20:B3DE: 03        .byte $03	; <う>
- D - I - 0x02B3EF 20:B3DF: 85        .byte $85	; <E>
- D - I - 0x02B3F0 20:B3E0: F4        .byte $F4
- D - I - 0x02B3F1 20:B3E1: 0A        .byte $0A	; <こ>
- D - I - 0x02B3F2 20:B3E2: 03        .byte $03	; <う>
- D - I - 0x02B3F3 20:B3E3: 86        .byte $86	; <F>
- D - I - 0x02B3F4 20:B3E4: 01        .byte $01	; <あ>
- D - I - 0x02B3F5 20:B3E5: 87        .byte $87	; <G>
- D - I - 0x02B3F6 20:B3E6: F5        .byte $F5
- D - I - 0x02B3F7 20:B3E7: F0        .byte $F0
off_B3E8_B7:
- D - I - 0x02B3F8 20:B3E8: F6        .byte $F6
- D - I - 0x02B3F9 20:B3E9: 00        .byte $00
- D - I - 0x02B3FA 20:B3EA: 01        .byte $01	; <あ>
- D - I - 0x02B3FB 20:B3EB: 05        .byte $05	; <お>
- D - I - 0x02B3FC 20:B3EC: 7E        .byte $7E	; <.>
- D - I - 0x02B3FD 20:B3ED: F6        .byte $F6
- D - I - 0x02B3FE 20:B3EE: 00        .byte $00
- D - I - 0x02B3FF 20:B3EF: 04        .byte $04	; <え>
- D - I - 0x02B400 20:B3F0: 05        .byte $05	; <お>
- D - I - 0x02B401 20:B3F1: 7F        .byte $7F	; <,>
- D - I - 0x02B402 20:B3F2: F6        .byte $F6
- D - I - 0x02B403 20:B3F3: 00        .byte $00
- D - I - 0x02B404 20:B3F4: FF        .byte $FF
- D - I - 0x02B405 20:B3F5: 05        .byte $05	; <お>
- D - I - 0x02B406 20:B3F6: 80        .byte $80
- D - I - 0x02B407 20:B3F7: F6        .byte $F6
- D - I - 0x02B408 20:B3F8: 00        .byte $00
- D - I - 0x02B409 20:B3F9: 01        .byte $01	; <あ>
- D - I - 0x02B40A 20:B3FA: 05        .byte $05	; <お>
- D - I - 0x02B40B 20:B3FB: 81        .byte $81	; <A>
- D - I - 0x02B40C 20:B3FC: F6        .byte $F6
- D - I - 0x02B40D 20:B3FD: 00        .byte $00
- D - I - 0x02B40E 20:B3FE: FF        .byte $FF
- D - I - 0x02B40F 20:B3FF: 05        .byte $05	; <お>
- D - I - 0x02B410 20:B400: 82        .byte $82	; <B>
- D - I - 0x02B411 20:B401: 05        .byte $05	; <お>
- D - I - 0x02B412 20:B402: 83        .byte $83	; <C>
- D - I - 0x02B413 20:B403: 05        .byte $05	; <お>
- D - I - 0x02B414 20:B404: 84        .byte $84	; <D>
- D - I - 0x02B415 20:B405: 05        .byte $05	; <お>
- D - I - 0x02B416 20:B406: 85        .byte $85	; <E>
- D - I - 0x02B417 20:B407: 05        .byte $05	; <お>
- D - I - 0x02B418 20:B408: 86        .byte $86	; <F>
off_B409:
- D - I - 0x02B419 20:B409: 01        .byte $01	; <あ>
- D - I - 0x02B41A 20:B40A: 87        .byte $87	; <G>
- D - I - 0x02B41B 20:B40B: F1        .byte $F1
- D - I - 0x02B41C 20:B40C: F2        .byte $F2
- D - I - 0x02B41D 20:B40D: 01        .byte $01	; <あ>
- D - I - 0x02B41E 20:B40E: 87        .byte $87	; <G>
- D - I - 0x02B41F 20:B40F: F3        .byte $F3
- D - I - 0x02B420 20:B410: 09 B4     .word off_B409
off_B412_B8:
- D - I - 0x02B422 20:B412: F6        .byte $F6
- D - I - 0x02B423 20:B413: 01        .byte $01	; <あ>
- D - I - 0x02B424 20:B414: 00        .byte $00
- D - I - 0x02B425 20:B415: 04        .byte $04	; <え>
- D - I - 0x02B426 20:B416: 72        .byte $72	; <ョ>
- D - I - 0x02B427 20:B417: F6        .byte $F6
- D - I - 0x02B428 20:B418: 00        .byte $00
- D - I - 0x02B429 20:B419: 01        .byte $01	; <あ>
- D - I - 0x02B42A 20:B41A: 04        .byte $04	; <え>
- D - I - 0x02B42B 20:B41B: 73        .byte $73	; <ヮ>
- D - I - 0x02B42C 20:B41C: 04        .byte $04	; <え>
- D - I - 0x02B42D 20:B41D: 74        .byte $74	; <ィ>
- D - I - 0x02B42E 20:B41E: F6        .byte $F6
- D - I - 0x02B42F 20:B41F: FE        .byte $FE
- D - I - 0x02B430 20:B420: 01        .byte $01	; <あ>
- D - I - 0x02B431 20:B421: 04        .byte $04	; <え>
- D - I - 0x02B432 20:B422: 75        .byte $75	; <ェ>
- D - I - 0x02B433 20:B423: F6        .byte $F6
- D - I - 0x02B434 20:B424: FE        .byte $FE
- D - I - 0x02B435 20:B425: 01        .byte $01	; <あ>
- D - I - 0x02B436 20:B426: 04        .byte $04	; <え>
- D - I - 0x02B437 20:B427: 76        .byte $76	; <ォ>
- D - I - 0x02B438 20:B428: 04        .byte $04	; <え>
- D - I - 0x02B439 20:B429: 77        .byte $77	; <:>
- D - I - 0x02B43A 20:B42A: 04        .byte $04	; <え>
- D - I - 0x02B43B 20:B42B: 78        .byte $78	; <?>
- D - I - 0x02B43C 20:B42C: 04        .byte $04	; <え>
- D - I - 0x02B43D 20:B42D: 79        .byte $79	; <!>
- D - I - 0x02B43E 20:B42E: 04        .byte $04	; <え>
- D - I - 0x02B43F 20:B42F: 7A        .byte $7A	; <、>
- D - I - 0x02B440 20:B430: 04        .byte $04	; <え>
- D - I - 0x02B441 20:B431: 7B        .byte $7B	; <。>
off_B432:
- D - I - 0x02B442 20:B432: 04        .byte $04	; <え>
- D - I - 0x02B443 20:B433: 7C        .byte $7C	; <~>
- - - - - 0x02B444 20:B434: 04        .byte $04	; <え>
- - - - - 0x02B445 20:B435: 7D        .byte $7D	; <ー>
- - - - - 0x02B446 20:B436: F3        .byte $F3
- - - - - 0x02B447 20:B437: 32 B4     .word off_B432
off_B439_B9:
- D - I - 0x02B449 20:B439: F8        .byte $F8
- D - I - 0x02B44A 20:B43A: 03        .byte $03	; <う>
- D - I - 0x02B44B 20:B43B: F3        .byte $F3
- D - I - 0x02B44C 20:B43C: 14 B3     .word off_B314
off_B43E_BA:
- D - I - 0x02B44E 20:B43E: 03        .byte $03	; <う>
- D - I - 0x02B44F 20:B43F: 7D        .byte $7D	; <ー>
- D - I - 0x02B450 20:B440: 03        .byte $03	; <う>
- D - I - 0x02B451 20:B441: 7C        .byte $7C	; <~>
- D - I - 0x02B452 20:B442: 03        .byte $03	; <う>
- D - I - 0x02B453 20:B443: 7B        .byte $7B	; <。>
- D - I - 0x02B454 20:B444: 03        .byte $03	; <う>
- D - I - 0x02B455 20:B445: 7A        .byte $7A	; <、>
- D - I - 0x02B456 20:B446: 03        .byte $03	; <う>
- D - I - 0x02B457 20:B447: 79        .byte $79	; <!>
- D - I - 0x02B458 20:B448: 03        .byte $03	; <う>
- D - I - 0x02B459 20:B449: 78        .byte $78	; <?>
- D - I - 0x02B45A 20:B44A: 03        .byte $03	; <う>
- D - I - 0x02B45B 20:B44B: 77        .byte $77	; <:>
- D - I - 0x02B45C 20:B44C: F6        .byte $F6
- D - I - 0x02B45D 20:B44D: FE        .byte $FE
- D - I - 0x02B45E 20:B44E: 01        .byte $01	; <あ>
- D - I - 0x02B45F 20:B44F: 03        .byte $03	; <う>
- D - I - 0x02B460 20:B450: 76        .byte $76	; <ォ>
- D - I - 0x02B461 20:B451: F6        .byte $F6
- D - I - 0x02B462 20:B452: FE        .byte $FE
- D - I - 0x02B463 20:B453: 01        .byte $01	; <あ>
- D - I - 0x02B464 20:B454: 03        .byte $03	; <う>
- D - I - 0x02B465 20:B455: 75        .byte $75	; <ェ>
- D - I - 0x02B466 20:B456: 03        .byte $03	; <う>
- D - I - 0x02B467 20:B457: 74        .byte $74	; <ィ>
- D - I - 0x02B468 20:B458: F6        .byte $F6
- D - I - 0x02B469 20:B459: 00        .byte $00
- D - I - 0x02B46A 20:B45A: 01        .byte $01	; <あ>
- D - I - 0x02B46B 20:B45B: 03        .byte $03	; <う>
- D - I - 0x02B46C 20:B45C: 73        .byte $73	; <ヮ>
- D - I - 0x02B46D 20:B45D: F6        .byte $F6
- D - I - 0x02B46E 20:B45E: 01        .byte $01	; <あ>
- D - I - 0x02B46F 20:B45F: 00        .byte $00
- D - I - 0x02B470 20:B460: 03        .byte $03	; <う>
- D - I - 0x02B471 20:B461: 72        .byte $72	; <ョ>
off_B462:
- D - I - 0x02B472 20:B462: F6        .byte $F6
- D - I - 0x02B473 20:B463: 00        .byte $00
- D - I - 0x02B474 20:B464: 01        .byte $01	; <あ>
- D - I - 0x02B475 20:B465: 03        .byte $03	; <う>
- D - I - 0x02B476 20:B466: 71        .byte $71	; <ュ>
- D - I - 0x02B477 20:B467: F1        .byte $F1
- D - I - 0x02B478 20:B468: F2        .byte $F2
- D - I - 0x02B479 20:B469: F6        .byte $F6
- D - I - 0x02B47A 20:B46A: 00        .byte $00
- D - I - 0x02B47B 20:B46B: 01        .byte $01	; <あ>
- D - I - 0x02B47C 20:B46C: 03        .byte $03	; <う>
- D - I - 0x02B47D 20:B46D: 71        .byte $71	; <ュ>
- D - I - 0x02B47E 20:B46E: F3        .byte $F3
- D - I - 0x02B47F 20:B46F: 62 B4     .word off_B462
off_B471_BB:
off_B471:
- D - I - 0x02B481 20:B471: F1        .byte $F1
- D - I - 0x02B482 20:B472: 02        .byte $02	; <い>
- D - I - 0x02B483 20:B473: 00        .byte $00
- D - I - 0x02B484 20:B474: F1        .byte $F1
- D - I - 0x02B485 20:B475: 02        .byte $02	; <い>
- D - I - 0x02B486 20:B476: 01        .byte $01	; <あ>
- D - I - 0x02B487 20:B477: F1        .byte $F1
- D - I - 0x02B488 20:B478: 02        .byte $02	; <い>
- D - I - 0x02B489 20:B479: 02        .byte $02	; <い>
- D - I - 0x02B48A 20:B47A: F1        .byte $F1
- D - I - 0x02B48B 20:B47B: 02        .byte $02	; <い>
- D - I - 0x02B48C 20:B47C: 03        .byte $03	; <う>
- D - I - 0x02B48D 20:B47D: F3        .byte $F3
- D - I - 0x02B48E 20:B47E: 71 B4     .word off_B471
off_B480_BC:
- D - I - 0x02B490 20:B480: F6        .byte $F6
- D - I - 0x02B491 20:B481: 00        .byte $00
- D - I - 0x02B492 20:B482: 01        .byte $01	; <あ>
- D - I - 0x02B493 20:B483: 04        .byte $04	; <え>
- D - I - 0x02B494 20:B484: 71        .byte $71	; <ュ>
- D - I - 0x02B495 20:B485: F6        .byte $F6
- D - I - 0x02B496 20:B486: 01        .byte $01	; <あ>
- D - I - 0x02B497 20:B487: 00        .byte $00
- D - I - 0x02B498 20:B488: 04        .byte $04	; <え>
- D - I - 0x02B499 20:B489: 72        .byte $72	; <ョ>
- D - I - 0x02B49A 20:B48A: F6        .byte $F6
- D - I - 0x02B49B 20:B48B: 00        .byte $00
- D - I - 0x02B49C 20:B48C: 01        .byte $01	; <あ>
- D - I - 0x02B49D 20:B48D: 04        .byte $04	; <え>
- D - I - 0x02B49E 20:B48E: 73        .byte $73	; <ヮ>
- D - I - 0x02B49F 20:B48F: 04        .byte $04	; <え>
- D - I - 0x02B4A0 20:B490: 74        .byte $74	; <ィ>
- D - I - 0x02B4A1 20:B491: F6        .byte $F6
- D - I - 0x02B4A2 20:B492: FE        .byte $FE
- D - I - 0x02B4A3 20:B493: 01        .byte $01	; <あ>
- D - I - 0x02B4A4 20:B494: 04        .byte $04	; <え>
- D - I - 0x02B4A5 20:B495: 75        .byte $75	; <ェ>
- D - I - 0x02B4A6 20:B496: F6        .byte $F6
- D - I - 0x02B4A7 20:B497: FE        .byte $FE
- D - I - 0x02B4A8 20:B498: 01        .byte $01	; <あ>
- D - I - 0x02B4A9 20:B499: 04        .byte $04	; <え>
- D - I - 0x02B4AA 20:B49A: 76        .byte $76	; <ォ>
- D - I - 0x02B4AB 20:B49B: 04        .byte $04	; <え>
- D - I - 0x02B4AC 20:B49C: 77        .byte $77	; <:>
- D - I - 0x02B4AD 20:B49D: 04        .byte $04	; <え>
- D - I - 0x02B4AE 20:B49E: 78        .byte $78	; <?>
- D - I - 0x02B4AF 20:B49F: 04        .byte $04	; <え>
- D - I - 0x02B4B0 20:B4A0: 79        .byte $79	; <!>
- D - I - 0x02B4B1 20:B4A1: 04        .byte $04	; <え>
- D - I - 0x02B4B2 20:B4A2: 7A        .byte $7A	; <、>
- D - I - 0x02B4B3 20:B4A3: 04        .byte $04	; <え>
- D - I - 0x02B4B4 20:B4A4: 7B        .byte $7B	; <。>
off_B4A5:
- D - I - 0x02B4B5 20:B4A5: 03        .byte $03	; <う>
- D - I - 0x02B4B6 20:B4A6: 7C        .byte $7C	; <~>
- D - I - 0x02B4B7 20:B4A7: 03        .byte $03	; <う>
- D - I - 0x02B4B8 20:B4A8: 7D        .byte $7D	; <ー>
- D - I - 0x02B4B9 20:B4A9: F3        .byte $F3
- D - I - 0x02B4BA 20:B4AA: A5 B4     .word off_B4A5
off_B4AC_BD:
- D - I - 0x02B4BC 20:B4AC: F6        .byte $F6
- D - I - 0x02B4BD 20:B4AD: 00        .byte $00
- D - I - 0x02B4BE 20:B4AE: 01        .byte $01	; <あ>
- D - I - 0x02B4BF 20:B4AF: 07        .byte $07	; <き>
- D - I - 0x02B4C0 20:B4B0: 71        .byte $71	; <ュ>
- D - I - 0x02B4C1 20:B4B1: F6        .byte $F6
- D - I - 0x02B4C2 20:B4B2: 01        .byte $01	; <あ>
- D - I - 0x02B4C3 20:B4B3: 00        .byte $00
- D - I - 0x02B4C4 20:B4B4: 07        .byte $07	; <き>
- D - I - 0x02B4C5 20:B4B5: 72        .byte $72	; <ョ>
- D - I - 0x02B4C6 20:B4B6: F6        .byte $F6
- D - I - 0x02B4C7 20:B4B7: 00        .byte $00
- D - I - 0x02B4C8 20:B4B8: 01        .byte $01	; <あ>
- D - I - 0x02B4C9 20:B4B9: 07        .byte $07	; <き>
- D - I - 0x02B4CA 20:B4BA: 73        .byte $73	; <ヮ>
- D - I - 0x02B4CB 20:B4BB: 07        .byte $07	; <き>
- D - I - 0x02B4CC 20:B4BC: 74        .byte $74	; <ィ>
- D - I - 0x02B4CD 20:B4BD: F6        .byte $F6
- D - I - 0x02B4CE 20:B4BE: FE        .byte $FE
- D - I - 0x02B4CF 20:B4BF: 01        .byte $01	; <あ>
- D - I - 0x02B4D0 20:B4C0: 07        .byte $07	; <き>
- D - I - 0x02B4D1 20:B4C1: 75        .byte $75	; <ェ>
- D - I - 0x02B4D2 20:B4C2: F6        .byte $F6
- D - I - 0x02B4D3 20:B4C3: FE        .byte $FE
- D - I - 0x02B4D4 20:B4C4: 01        .byte $01	; <あ>
- D - I - 0x02B4D5 20:B4C5: 07        .byte $07	; <き>
- D - I - 0x02B4D6 20:B4C6: 76        .byte $76	; <ォ>
- D - I - 0x02B4D7 20:B4C7: 07        .byte $07	; <き>
- D - I - 0x02B4D8 20:B4C8: 77        .byte $77	; <:>
- D - I - 0x02B4D9 20:B4C9: 07        .byte $07	; <き>
- D - I - 0x02B4DA 20:B4CA: 78        .byte $78	; <?>
- D - I - 0x02B4DB 20:B4CB: 07        .byte $07	; <き>
- D - I - 0x02B4DC 20:B4CC: 79        .byte $79	; <!>
- D - I - 0x02B4DD 20:B4CD: 07        .byte $07	; <き>
- D - I - 0x02B4DE 20:B4CE: 7A        .byte $7A	; <、>
- D - I - 0x02B4DF 20:B4CF: 07        .byte $07	; <き>
- D - I - 0x02B4E0 20:B4D0: 7B        .byte $7B	; <。>
- D - I - 0x02B4E1 20:B4D1: F3        .byte $F3
- D - I - 0x02B4E2 20:B4D2: A5 B4     .word off_B4A5
off_B4D4_BE:
off_B4D4:
- D - I - 0x02B4E4 20:B4D4: F1        .byte $F1
- D - I - 0x02B4E5 20:B4D5: 02        .byte $02	; <い>
- D - I - 0x02B4E6 20:B4D6: 04        .byte $04	; <え>
- D - I - 0x02B4E7 20:B4D7: 02        .byte $02	; <い>
- D - I - 0x02B4E8 20:B4D8: 05        .byte $05	; <お>
- D - I - 0x02B4E9 20:B4D9: 02        .byte $02	; <い>
- D - I - 0x02B4EA 20:B4DA: 04        .byte $04	; <え>
- D - I - 0x02B4EB 20:B4DB: F1        .byte $F1
- D - I - 0x02B4EC 20:B4DC: 02        .byte $02	; <い>
- D - I - 0x02B4ED 20:B4DD: 05        .byte $05	; <お>
- D - I - 0x02B4EE 20:B4DE: F3        .byte $F3
- D - I - 0x02B4EF 20:B4DF: D4 B4     .word off_B4D4
off_B4E1_BF:
off_B4E1:
- - - - - 0x02B4F1 20:B4E1: F1        .byte $F1
- - - - - 0x02B4F2 20:B4E2: 02        .byte $02	; <い>
- - - - - 0x02B4F3 20:B4E3: 06        .byte $06	; <か>
- - - - - 0x02B4F4 20:B4E4: F1        .byte $F1
- - - - - 0x02B4F5 20:B4E5: 02        .byte $02	; <い>
- - - - - 0x02B4F6 20:B4E6: 07        .byte $07	; <き>
- - - - - 0x02B4F7 20:B4E7: F1        .byte $F1
- - - - - 0x02B4F8 20:B4E8: 02        .byte $02	; <い>
- - - - - 0x02B4F9 20:B4E9: 08        .byte $08	; <く>
- - - - - 0x02B4FA 20:B4EA: F1        .byte $F1
- - - - - 0x02B4FB 20:B4EB: 02        .byte $02	; <い>
- - - - - 0x02B4FC 20:B4EC: 09        .byte $09	; <け>
- - - - - 0x02B4FD 20:B4ED: F3        .byte $F3
- - - - - 0x02B4FE 20:B4EE: E1 B4     .word off_B4E1
off_B4F0_C0:
- D - I - 0x02B500 20:B4F0: F6        .byte $F6
- D - I - 0x02B501 20:B4F1: 00        .byte $00
- D - I - 0x02B502 20:B4F2: 01        .byte $01	; <あ>
- D - I - 0x02B503 20:B4F3: 03        .byte $03	; <う>
- D - I - 0x02B504 20:B4F4: 71        .byte $71	; <ュ>
- D - I - 0x02B505 20:B4F5: F6        .byte $F6
- D - I - 0x02B506 20:B4F6: 01        .byte $01	; <あ>
- D - I - 0x02B507 20:B4F7: 00        .byte $00
- D - I - 0x02B508 20:B4F8: 03        .byte $03	; <う>
- D - I - 0x02B509 20:B4F9: 72        .byte $72	; <ョ>
- D - I - 0x02B50A 20:B4FA: F6        .byte $F6
- D - I - 0x02B50B 20:B4FB: 00        .byte $00
- D - I - 0x02B50C 20:B4FC: 01        .byte $01	; <あ>
- D - I - 0x02B50D 20:B4FD: 03        .byte $03	; <う>
- D - I - 0x02B50E 20:B4FE: 73        .byte $73	; <ヮ>
- D - I - 0x02B50F 20:B4FF: 03        .byte $03	; <う>
- D - I - 0x02B510 20:B500: 74        .byte $74	; <ィ>
- D - I - 0x02B511 20:B501: F6        .byte $F6
- D - I - 0x02B512 20:B502: FE        .byte $FE
- D - I - 0x02B513 20:B503: 01        .byte $01	; <あ>
- D - I - 0x02B514 20:B504: 03        .byte $03	; <う>
- D - I - 0x02B515 20:B505: 75        .byte $75	; <ェ>
- D - I - 0x02B516 20:B506: F6        .byte $F6
- D - I - 0x02B517 20:B507: FE        .byte $FE
- D - I - 0x02B518 20:B508: 01        .byte $01	; <あ>
- D - I - 0x02B519 20:B509: 03        .byte $03	; <う>
- D - I - 0x02B51A 20:B50A: 76        .byte $76	; <ォ>
- D - I - 0x02B51B 20:B50B: 03        .byte $03	; <う>
- D - I - 0x02B51C 20:B50C: 77        .byte $77	; <:>
- D - I - 0x02B51D 20:B50D: 03        .byte $03	; <う>
- D - I - 0x02B51E 20:B50E: 78        .byte $78	; <?>
- D - I - 0x02B51F 20:B50F: 03        .byte $03	; <う>
- D - I - 0x02B520 20:B510: 79        .byte $79	; <!>
- D - I - 0x02B521 20:B511: 03        .byte $03	; <う>
- D - I - 0x02B522 20:B512: 7A        .byte $7A	; <、>
- D - I - 0x02B523 20:B513: 03        .byte $03	; <う>
- D - I - 0x02B524 20:B514: 7B        .byte $7B	; <。>
- D - I - 0x02B525 20:B515: F3        .byte $F3
- D - I - 0x02B526 20:B516: A5 B4     .word off_B4A5
off_B518_C1:
off_B518:
- D - I - 0x02B528 20:B518: F1        .byte $F1
- D - I - 0x02B529 20:B519: 02        .byte $02	; <い>
- D - I - 0x02B52A 20:B51A: 0A        .byte $0A	; <こ>
- D - I - 0x02B52B 20:B51B: F1        .byte $F1
- D - I - 0x02B52C 20:B51C: 02        .byte $02	; <い>
- D - I - 0x02B52D 20:B51D: 0B        .byte $0B	; <さ>
- D - I - 0x02B52E 20:B51E: F1        .byte $F1
- D - I - 0x02B52F 20:B51F: 02        .byte $02	; <い>
- D - I - 0x02B530 20:B520: 0C        .byte $0C	; <し>
- D - I - 0x02B531 20:B521: F1        .byte $F1
- D - I - 0x02B532 20:B522: 02        .byte $02	; <い>
- D - I - 0x02B533 20:B523: 0D        .byte $0D	; <す>
- D - I - 0x02B534 20:B524: F3        .byte $F3
- D - I - 0x02B535 20:B525: 18 B5     .word off_B518
off_B527_C2:
off_B527:
- D - I - 0x02B537 20:B527: 01        .byte $01	; <あ>
- D - I - 0x02B538 20:B528: C8        .byte $C8	; <ぱ>
- D - I - 0x02B539 20:B529: F8        .byte $F8
- D - I - 0x02B53A 20:B52A: 04        .byte $04	; <え>
- D - I - 0x02B53B 20:B52B: 01        .byte $01	; <あ>
- D - I - 0x02B53C 20:B52C: 1F        .byte $1F	; <ま>
- D - I - 0x02B53D 20:B52D: F3        .byte $F3
- D - I - 0x02B53E 20:B52E: 27 B5     .word off_B527
off_B530_C3:
off_B530:
- D - I - 0x02B540 20:B530: 01        .byte $01	; <あ>
- D - I - 0x02B541 20:B531: C8        .byte $C8	; <ぱ>
- D - I - 0x02B542 20:B532: 01        .byte $01	; <あ>
- D - I - 0x02B543 20:B533: 20        .byte $20	; <み>
- D - I - 0x02B544 20:B534: F3        .byte $F3
- D - I - 0x02B545 20:B535: 30 B5     .word off_B530
off_B537_C4:
- D - I - 0x02B547 20:B537: 04        .byte $04	; <え>
- D - I - 0x02B548 20:B538: 7D        .byte $7D	; <ー>
- D - I - 0x02B549 20:B539: 04        .byte $04	; <え>
- D - I - 0x02B54A 20:B53A: 7C        .byte $7C	; <~>
- D - I - 0x02B54B 20:B53B: 04        .byte $04	; <え>
- D - I - 0x02B54C 20:B53C: 7B        .byte $7B	; <。>
- D - I - 0x02B54D 20:B53D: 04        .byte $04	; <え>
- D - I - 0x02B54E 20:B53E: 7A        .byte $7A	; <、>
- D - I - 0x02B54F 20:B53F: 04        .byte $04	; <え>
- D - I - 0x02B550 20:B540: 79        .byte $79	; <!>
- D - I - 0x02B551 20:B541: 04        .byte $04	; <え>
- D - I - 0x02B552 20:B542: 78        .byte $78	; <?>
- D - I - 0x02B553 20:B543: 04        .byte $04	; <え>
- D - I - 0x02B554 20:B544: 77        .byte $77	; <:>
- D - I - 0x02B555 20:B545: F6        .byte $F6
- D - I - 0x02B556 20:B546: FE        .byte $FE
- D - I - 0x02B557 20:B547: 01        .byte $01	; <あ>
- D - I - 0x02B558 20:B548: 04        .byte $04	; <え>
- D - I - 0x02B559 20:B549: 76        .byte $76	; <ォ>
- D - I - 0x02B55A 20:B54A: F6        .byte $F6
- D - I - 0x02B55B 20:B54B: FE        .byte $FE
- D - I - 0x02B55C 20:B54C: 01        .byte $01	; <あ>
- D - I - 0x02B55D 20:B54D: 04        .byte $04	; <え>
- D - I - 0x02B55E 20:B54E: 75        .byte $75	; <ェ>
- D - I - 0x02B55F 20:B54F: 04        .byte $04	; <え>
- D - I - 0x02B560 20:B550: 74        .byte $74	; <ィ>
- D - I - 0x02B561 20:B551: F6        .byte $F6
- D - I - 0x02B562 20:B552: 00        .byte $00
- D - I - 0x02B563 20:B553: 01        .byte $01	; <あ>
- D - I - 0x02B564 20:B554: 04        .byte $04	; <え>
- D - I - 0x02B565 20:B555: 73        .byte $73	; <ヮ>
- D - I - 0x02B566 20:B556: F6        .byte $F6
- D - I - 0x02B567 20:B557: 01        .byte $01	; <あ>
- D - I - 0x02B568 20:B558: 00        .byte $00
- D - I - 0x02B569 20:B559: 04        .byte $04	; <え>
- D - I - 0x02B56A 20:B55A: 72        .byte $72	; <ョ>
off_B55B:
- D - I - 0x02B56B 20:B55B: F6        .byte $F6
- D - I - 0x02B56C 20:B55C: 00        .byte $00
- D - I - 0x02B56D 20:B55D: 01        .byte $01	; <あ>
- D - I - 0x02B56E 20:B55E: 04        .byte $04	; <え>
- D - I - 0x02B56F 20:B55F: 71        .byte $71	; <ュ>
- D - I - 0x02B570 20:B560: F1        .byte $F1
- D - I - 0x02B571 20:B561: F2        .byte $F2
- D - I - 0x02B572 20:B562: F6        .byte $F6
- D - I - 0x02B573 20:B563: 00        .byte $00
- D - I - 0x02B574 20:B564: 01        .byte $01	; <あ>
- D - I - 0x02B575 20:B565: 04        .byte $04	; <え>
- D - I - 0x02B576 20:B566: 71        .byte $71	; <ュ>
- D - I - 0x02B577 20:B567: F3        .byte $F3
- D - I - 0x02B578 20:B568: 5B B5     .word off_B55B
off_B56A_C5:
off_B56A:
- D - I - 0x02B57A 20:B56A: F8        .byte $F8
- D - I - 0x02B57B 20:B56B: 01        .byte $01	; <あ>
- D - I - 0x02B57C 20:B56C: F1        .byte $F1
- D - I - 0x02B57D 20:B56D: 01        .byte $01	; <あ>
- D - I - 0x02B57E 20:B56E: D2        .byte $D2
- D - I - 0x02B57F 20:B56F: F6        .byte $F6
- D - I - 0x02B580 20:B570: 00        .byte $00
- D - I - 0x02B581 20:B571: B0        .byte $B0	; <び>
- D - I - 0x02B582 20:B572: 01        .byte $01	; <あ>
- D - I - 0x02B583 20:B573: C8        .byte $C8	; <ぱ>
- D - I - 0x02B584 20:B574: F3        .byte $F3
- D - I - 0x02B585 20:B575: 6A B5     .word off_B56A
off_B577_C6:
- D - I - 0x02B587 20:B577: F6        .byte $F6
- D - I - 0x02B588 20:B578: 00        .byte $00
- D - I - 0x02B589 20:B579: 01        .byte $01	; <あ>
- D - I - 0x02B58A 20:B57A: 02        .byte $02	; <い>
- D - I - 0x02B58B 20:B57B: 71        .byte $71	; <ュ>
- D - I - 0x02B58C 20:B57C: F6        .byte $F6
- D - I - 0x02B58D 20:B57D: 01        .byte $01	; <あ>
- D - I - 0x02B58E 20:B57E: 00        .byte $00
- D - I - 0x02B58F 20:B57F: 02        .byte $02	; <い>
- D - I - 0x02B590 20:B580: 72        .byte $72	; <ョ>
- D - I - 0x02B591 20:B581: F6        .byte $F6
- D - I - 0x02B592 20:B582: 00        .byte $00
- D - I - 0x02B593 20:B583: 01        .byte $01	; <あ>
- D - I - 0x02B594 20:B584: 02        .byte $02	; <い>
- D - I - 0x02B595 20:B585: 73        .byte $73	; <ヮ>
- D - I - 0x02B596 20:B586: 02        .byte $02	; <い>
- D - I - 0x02B597 20:B587: 74        .byte $74	; <ィ>
- D - I - 0x02B598 20:B588: F6        .byte $F6
- D - I - 0x02B599 20:B589: FE        .byte $FE
- D - I - 0x02B59A 20:B58A: 01        .byte $01	; <あ>
- D - I - 0x02B59B 20:B58B: 02        .byte $02	; <い>
- D - I - 0x02B59C 20:B58C: 75        .byte $75	; <ェ>
- D - I - 0x02B59D 20:B58D: F6        .byte $F6
- D - I - 0x02B59E 20:B58E: FE        .byte $FE
- D - I - 0x02B59F 20:B58F: 01        .byte $01	; <あ>
- D - I - 0x02B5A0 20:B590: 02        .byte $02	; <い>
- D - I - 0x02B5A1 20:B591: 76        .byte $76	; <ォ>
- D - I - 0x02B5A2 20:B592: 02        .byte $02	; <い>
- D - I - 0x02B5A3 20:B593: 77        .byte $77	; <:>
- D - I - 0x02B5A4 20:B594: 02        .byte $02	; <い>
- D - I - 0x02B5A5 20:B595: 78        .byte $78	; <?>
- D - I - 0x02B5A6 20:B596: 02        .byte $02	; <い>
- D - I - 0x02B5A7 20:B597: 79        .byte $79	; <!>
- D - I - 0x02B5A8 20:B598: 02        .byte $02	; <い>
- D - I - 0x02B5A9 20:B599: 7A        .byte $7A	; <、>
- D - I - 0x02B5AA 20:B59A: 02        .byte $02	; <い>
- D - I - 0x02B5AB 20:B59B: 7B        .byte $7B	; <。>
- - - - - 0x02B5AC 20:B59C: F3        .byte $F3
- - - - - 0x02B5AD 20:B59D: A5 B4     .word off_B4A5
off_B59F_C7:
- D - I - 0x02B5AF 20:B59F: F8        .byte $F8
- D - I - 0x02B5B0 20:B5A0: 03        .byte $03	; <う>
- D - I - 0x02B5B1 20:B5A1: F3        .byte $F3
- D - I - 0x02B5B2 20:B5A2: E0 B2     .word off_B2E0
- - - - - 0x02B5B4 20:B5A4: F0        .byte $F0
off_B5A5_C8:
- D - I - 0x02B5B5 20:B5A5: F8        .byte $F8
- D - I - 0x02B5B6 20:B5A6: 07        .byte $07	; <き>
- D - I - 0x02B5B7 20:B5A7: F3        .byte $F3
- D - I - 0x02B5B8 20:B5A8: 4D B0     .word off_B04D
off_B5AA_C9:
- D - I - 0x02B5BA 20:B5AA: F7        .byte $F7
- D - I - 0x02B5BB 20:B5AB: 2F        .byte $2F	; <っ>
off_B5AC_CA:
- D - I - 0x02B5BC 20:B5AC: F7        .byte $F7
- D - I - 0x02B5BD 20:B5AD: 00        .byte $00
off_B5AE_CB:
- D - I - 0x02B5BE 20:B5AE: F7        .byte $F7
- D - I - 0x02B5BF 20:B5AF: 04        .byte $04	; <え>
off_B5B0_CC:
- - - - - 0x02B5C0 20:B5B0: F7        .byte $F7
- - - - - 0x02B5C1 20:B5B1: 06        .byte $06	; <か>
off_B5B2_CD:
- D - I - 0x02B5C2 20:B5B2: F7        .byte $F7
- D - I - 0x02B5C3 20:B5B3: 0A        .byte $0A	; <こ>
off_B5B4_CE:
off_B5B4:
- D - I - 0x02B5C4 20:B5B4: 02        .byte $02	; <い>
- D - I - 0x02B5C5 20:B5B5: 43        .byte $43	; <ウ>
- D - I - 0x02B5C6 20:B5B6: 02        .byte $02	; <い>
- D - I - 0x02B5C7 20:B5B7: 44        .byte $44	; <エ>
- - - - - 0x02B5C8 20:B5B8: 02        .byte $02	; <い>
- - - - - 0x02B5C9 20:B5B9: 45        .byte $45	; <オ>
- - - - - 0x02B5CA 20:B5BA: 02        .byte $02	; <い>
- - - - - 0x02B5CB 20:B5BB: 46        .byte $46	; <カ>
- - - - - 0x02B5CC 20:B5BC: F3        .byte $F3
- - - - - 0x02B5CD 20:B5BD: B4 B5     .word off_B5B4
off_B5BF_CF:
- D - I - 0x02B5CF 20:B5BF: 02        .byte $02	; <い>
- D - I - 0x02B5D0 20:B5C0: 7D        .byte $7D	; <ー>
- D - I - 0x02B5D1 20:B5C1: 02        .byte $02	; <い>
- D - I - 0x02B5D2 20:B5C2: 7C        .byte $7C	; <~>
- D - I - 0x02B5D3 20:B5C3: 02        .byte $02	; <い>
- D - I - 0x02B5D4 20:B5C4: 7B        .byte $7B	; <。>
- D - I - 0x02B5D5 20:B5C5: 02        .byte $02	; <い>
- D - I - 0x02B5D6 20:B5C6: 7A        .byte $7A	; <、>
- D - I - 0x02B5D7 20:B5C7: 02        .byte $02	; <い>
- D - I - 0x02B5D8 20:B5C8: 79        .byte $79	; <!>
- D - I - 0x02B5D9 20:B5C9: 02        .byte $02	; <い>
- D - I - 0x02B5DA 20:B5CA: 78        .byte $78	; <?>
- D - I - 0x02B5DB 20:B5CB: 02        .byte $02	; <い>
- D - I - 0x02B5DC 20:B5CC: 77        .byte $77	; <:>
- D - I - 0x02B5DD 20:B5CD: F6        .byte $F6
- D - I - 0x02B5DE 20:B5CE: FE        .byte $FE
- D - I - 0x02B5DF 20:B5CF: 01        .byte $01	; <あ>
- D - I - 0x02B5E0 20:B5D0: 02        .byte $02	; <い>
- D - I - 0x02B5E1 20:B5D1: 76        .byte $76	; <ォ>
- D - I - 0x02B5E2 20:B5D2: F6        .byte $F6
- D - I - 0x02B5E3 20:B5D3: FE        .byte $FE
- D - I - 0x02B5E4 20:B5D4: 01        .byte $01	; <あ>
- D - I - 0x02B5E5 20:B5D5: 02        .byte $02	; <い>
- D - I - 0x02B5E6 20:B5D6: 75        .byte $75	; <ェ>
- D - I - 0x02B5E7 20:B5D7: 02        .byte $02	; <い>
- D - I - 0x02B5E8 20:B5D8: 74        .byte $74	; <ィ>
- D - I - 0x02B5E9 20:B5D9: F6        .byte $F6
- D - I - 0x02B5EA 20:B5DA: 00        .byte $00
- D - I - 0x02B5EB 20:B5DB: 01        .byte $01	; <あ>
- D - I - 0x02B5EC 20:B5DC: 02        .byte $02	; <い>
- D - I - 0x02B5ED 20:B5DD: 73        .byte $73	; <ヮ>
- D - I - 0x02B5EE 20:B5DE: F6        .byte $F6
- D - I - 0x02B5EF 20:B5DF: 01        .byte $01	; <あ>
- D - I - 0x02B5F0 20:B5E0: 00        .byte $00
- D - I - 0x02B5F1 20:B5E1: 02        .byte $02	; <い>
- D - I - 0x02B5F2 20:B5E2: 72        .byte $72	; <ョ>
off_B5E3:
- D - I - 0x02B5F3 20:B5E3: F6        .byte $F6
- D - I - 0x02B5F4 20:B5E4: 00        .byte $00
- D - I - 0x02B5F5 20:B5E5: 01        .byte $01	; <あ>
- D - I - 0x02B5F6 20:B5E6: 02        .byte $02	; <い>
- D - I - 0x02B5F7 20:B5E7: 71        .byte $71	; <ュ>
- D - I - 0x02B5F8 20:B5E8: F1        .byte $F1
- D - I - 0x02B5F9 20:B5E9: F2        .byte $F2
- D - I - 0x02B5FA 20:B5EA: F6        .byte $F6
- D - I - 0x02B5FB 20:B5EB: 00        .byte $00
- D - I - 0x02B5FC 20:B5EC: 01        .byte $01	; <あ>
- D - I - 0x02B5FD 20:B5ED: 02        .byte $02	; <い>
- D - I - 0x02B5FE 20:B5EE: 71        .byte $71	; <ュ>
- D - I - 0x02B5FF 20:B5EF: F3        .byte $F3
- D - I - 0x02B600 20:B5F0: E3 B5     .word off_B5E3
off_B5F2_D0:
- D - I - 0x02B602 20:B5F2: F8        .byte $F8
- D - I - 0x02B603 20:B5F3: 01        .byte $01	; <あ>
- D - I - 0x02B604 20:B5F4: F3        .byte $F3
- D - I - 0x02B605 20:B5F5: 0E AF     .word off_AF0E
off_B5F7_D1:
- D - I - 0x02B607 20:B5F7: F8        .byte $F8
- D - I - 0x02B608 20:B5F8: 01        .byte $01	; <あ>
- D - I - 0x02B609 20:B5F9: F3        .byte $F3
- D - I - 0x02B60A 20:B5FA: 0E B0     .word off_B00E
off_B5FC_D2:
- D - I - 0x02B60C 20:B5FC: F8        .byte $F8
- D - I - 0x02B60D 20:B5FD: 01        .byte $01	; <あ>
- D - I - 0x02B60E 20:B5FE: F3        .byte $F3
- D - I - 0x02B60F 20:B5FF: 1E AF     .word off_AF1E
off_B601_D3:
- D - I - 0x02B611 20:B601: F8        .byte $F8
- D - I - 0x02B612 20:B602: 00        .byte $00
- D - I - 0x02B613 20:B603: F3        .byte $F3
- D - I - 0x02B614 20:B604: 14 B3     .word off_B314
off_B606_D4:
- D - I - 0x02B616 20:B606: F8        .byte $F8
- D - I - 0x02B617 20:B607: 02        .byte $02	; <い>
- D - I - 0x02B618 20:B608: F3        .byte $F3
- D - I - 0x02B619 20:B609: 14 B3     .word off_B314
off_B60B_D5:
- D - I - 0x02B61B 20:B60B: F8        .byte $F8
- D - I - 0x02B61C 20:B60C: 07        .byte $07	; <き>
- D - I - 0x02B61D 20:B60D: F3        .byte $F3
- D - I - 0x02B61E 20:B60E: 14 B3     .word off_B314
off_B610_D6:
- D - I - 0x02B620 20:B610: F8        .byte $F8
- D - I - 0x02B621 20:B611: 04        .byte $04	; <え>
- D - I - 0x02B622 20:B612: F3        .byte $F3
- D - I - 0x02B623 20:B613: 14 B3     .word off_B314
off_B615_D7:
- - - - - 0x02B625 20:B615: F8        .byte $F8
- - - - - 0x02B626 20:B616: 05        .byte $05	; <お>
- - - - - 0x02B627 20:B617: F3        .byte $F3
- - - - - 0x02B628 20:B618: 14 B3     .word off_B314
off_B61A_D8:
- D - I - 0x02B62A 20:B61A: F8        .byte $F8
- D - I - 0x02B62B 20:B61B: 01        .byte $01	; <あ>
- D - I - 0x02B62C 20:B61C: F3        .byte $F3
- D - I - 0x02B62D 20:B61D: 14 B3     .word off_B314
off_B61F_D9:
- D - I - 0x02B62F 20:B61F: F8        .byte $F8
- D - I - 0x02B630 20:B620: 07        .byte $07	; <き>
- D - I - 0x02B631 20:B621: F3        .byte $F3
- D - I - 0x02B632 20:B622: 28 B3     .word off_B328
off_B624_DA:
- D - I - 0x02B634 20:B624: F8        .byte $F8
- D - I - 0x02B635 20:B625: 00        .byte $00
- D - I - 0x02B636 20:B626: F3        .byte $F3
- D - I - 0x02B637 20:B627: E0 B2     .word off_B2E0
off_B629_DB:
- D - I - 0x02B639 20:B629: F8        .byte $F8
- D - I - 0x02B63A 20:B62A: 02        .byte $02	; <い>
- D - I - 0x02B63B 20:B62B: F3        .byte $F3
- D - I - 0x02B63C 20:B62C: E0 B2     .word off_B2E0
off_B62E_DC:
- D - I - 0x02B63E 20:B62E: F8        .byte $F8
- D - I - 0x02B63F 20:B62F: 07        .byte $07	; <き>
- D - I - 0x02B640 20:B630: F3        .byte $F3
- D - I - 0x02B641 20:B631: E0 B2     .word off_B2E0
off_B633_DD:
- D - I - 0x02B643 20:B633: F8        .byte $F8
- D - I - 0x02B644 20:B634: 04        .byte $04	; <え>
- D - I - 0x02B645 20:B635: F3        .byte $F3
- D - I - 0x02B646 20:B636: E0 B2     .word off_B2E0
off_B638_DE:
- - - - - 0x02B648 20:B638: F8        .byte $F8
- - - - - 0x02B649 20:B639: 05        .byte $05	; <お>
- - - - - 0x02B64A 20:B63A: F3        .byte $F3
- - - - - 0x02B64B 20:B63B: E0 B2     .word off_B2E0
off_B63D_DF:
- D - I - 0x02B64D 20:B63D: F8        .byte $F8
- D - I - 0x02B64E 20:B63E: 01        .byte $01	; <あ>
- D - I - 0x02B64F 20:B63F: F3        .byte $F3
- D - I - 0x02B650 20:B640: E0 B2     .word off_B2E0
off_B642_E0:
- D - I - 0x02B652 20:B642: F8        .byte $F8
- D - I - 0x02B653 20:B643: 00        .byte $00
- D - I - 0x02B654 20:B644: F3        .byte $F3
- D - I - 0x02B655 20:B645: EF B2     .word off_B2EF
off_B647_E1:
- D - I - 0x02B657 20:B647: F8        .byte $F8
- D - I - 0x02B658 20:B648: 02        .byte $02	; <い>
- D - I - 0x02B659 20:B649: F3        .byte $F3
- D - I - 0x02B65A 20:B64A: EF B2     .word off_B2EF
off_B64C_E2:
- D - I - 0x02B65C 20:B64C: F8        .byte $F8
- D - I - 0x02B65D 20:B64D: 07        .byte $07	; <き>
- D - I - 0x02B65E 20:B64E: F3        .byte $F3
- D - I - 0x02B65F 20:B64F: EF B2     .word off_B2EF
off_B651_E3:
- D - I - 0x02B661 20:B651: F8        .byte $F8
- D - I - 0x02B662 20:B652: 04        .byte $04	; <え>
- D - I - 0x02B663 20:B653: F3        .byte $F3
- D - I - 0x02B664 20:B654: EF B2     .word off_B2EF
off_B656_E4:
- - - - - 0x02B666 20:B656: F8        .byte $F8
- - - - - 0x02B667 20:B657: 05        .byte $05	; <お>
- - - - - 0x02B668 20:B658: F3        .byte $F3
- - - - - 0x02B669 20:B659: EF B2     .word off_B2EF
off_B65B_E5:
- D - I - 0x02B66B 20:B65B: F8        .byte $F8
- D - I - 0x02B66C 20:B65C: 01        .byte $01	; <あ>
- D - I - 0x02B66D 20:B65D: F3        .byte $F3
- D - I - 0x02B66E 20:B65E: EF B2     .word off_B2EF
off_B660_E6:
- D - I - 0x02B670 20:B660: F8        .byte $F8
- D - I - 0x02B671 20:B661: 03        .byte $03	; <う>
- D - I - 0x02B672 20:B662: F3        .byte $F3
- D - I - 0x02B673 20:B663: EF B2     .word off_B2EF
- - - - - 0x02B675 20:B665: F0        .byte $F0
off_B666_E7:
- D - I - 0x02B676 20:B666: F7        .byte $F7
- D - I - 0x02B677 20:B667: 70        .byte $70	; <ャ>
off_B668_E8:
- D - I - 0x02B678 20:B668: F7        .byte $F7
- D - I - 0x02B679 20:B669: D3        .byte $D3
off_B66A_E9:
- D - I - 0x02B67A 20:B66A: F7        .byte $F7
- D - I - 0x02B67B 20:B66B: D4        .byte $D4
off_B66C_EA:
- D - I - 0x02B67C 20:B66C: F7        .byte $F7
- D - I - 0x02B67D 20:B66D: D5        .byte $D5
off_B66E_EB:
off_B66E:
- - - - - 0x02B67E 20:B66E: 01        .byte $01	; <あ>
- - - - - 0x02B67F 20:B66F: 71        .byte $71	; <ュ>
- - - - - 0x02B680 20:B670: F1        .byte $F1
- - - - - 0x02B681 20:B671: 01        .byte $01	; <あ>
- - - - - 0x02B682 20:B672: 71        .byte $71	; <ュ>
- - - - - 0x02B683 20:B673: F2        .byte $F2
- - - - - 0x02B684 20:B674: F1        .byte $F1
- - - - - 0x02B685 20:B675: 01        .byte $01	; <あ>
- - - - - 0x02B686 20:B676: 71        .byte $71	; <ュ>
- - - - - 0x02B687 20:B677: F2        .byte $F2
- - - - - 0x02B688 20:B678: 01        .byte $01	; <あ>
- - - - - 0x02B689 20:B679: 71        .byte $71	; <ュ>
- - - - - 0x02B68A 20:B67A: F3        .byte $F3
- - - - - 0x02B68B 20:B67B: 6E B6     .word off_B66E
off_B67D_EC:
off_B67D:
- D - I - 0x02B68D 20:B67D: F6        .byte $F6
- D - I - 0x02B68E 20:B67E: F0        .byte $F0
- D - I - 0x02B68F 20:B67F: 10        .byte $10	; <た>
- D - I - 0x02B690 20:B680: 01        .byte $01	; <あ>
- D - I - 0x02B691 20:B681: 71        .byte $71	; <ュ>
- D - I - 0x02B692 20:B682: F6        .byte $F6
- D - I - 0x02B693 20:B683: E0        .byte $E0
- D - I - 0x02B694 20:B684: 00        .byte $00
- D - I - 0x02B695 20:B685: 01        .byte $01	; <あ>
- D - I - 0x02B696 20:B686: 71        .byte $71	; <ュ>
- D - I - 0x02B697 20:B687: F6        .byte $F6
- D - I - 0x02B698 20:B688: F0        .byte $F0
- D - I - 0x02B699 20:B689: 10        .byte $10	; <た>
- D - I - 0x02B69A 20:B68A: 01        .byte $01	; <あ>
- D - I - 0x02B69B 20:B68B: 71        .byte $71	; <ュ>
- D - I - 0x02B69C 20:B68C: F1        .byte $F1
- D - I - 0x02B69D 20:B68D: F6        .byte $F6
- D - I - 0x02B69E 20:B68E: 10        .byte $10	; <た>
- D - I - 0x02B69F 20:B68F: 10        .byte $10	; <た>
- D - I - 0x02B6A0 20:B690: 01        .byte $01	; <あ>
- D - I - 0x02B6A1 20:B691: 71        .byte $71	; <ュ>
- D - I - 0x02B6A2 20:B692: F1        .byte $F1
- D - I - 0x02B6A3 20:B693: F6        .byte $F6
- D - I - 0x02B6A4 20:B694: 20        .byte $20	; <み>
- D - I - 0x02B6A5 20:B695: 00        .byte $00
- D - I - 0x02B6A6 20:B696: 01        .byte $01	; <あ>
- D - I - 0x02B6A7 20:B697: 71        .byte $71	; <ュ>
- D - I - 0x02B6A8 20:B698: F1        .byte $F1
- D - I - 0x02B6A9 20:B699: F6        .byte $F6
- D - I - 0x02B6AA 20:B69A: 10        .byte $10	; <た>
- D - I - 0x02B6AB 20:B69B: 10        .byte $10	; <た>
- D - I - 0x02B6AC 20:B69C: 01        .byte $01	; <あ>
- D - I - 0x02B6AD 20:B69D: 71        .byte $71	; <ュ>
- D - I - 0x02B6AE 20:B69E: F3        .byte $F3
- D - I - 0x02B6AF 20:B69F: 7D B6     .word off_B67D
off_B6A1_ED:
- D - I - 0x02B6B1 20:B6A1: F8        .byte $F8
- D - I - 0x02B6B2 20:B6A2: 0E        .byte $0E	; <せ>
- D - I - 0x02B6B3 20:B6A3: 78        .byte $78	; <?>
- D - I - 0x02B6B4 20:B6A4: 51        .byte $51	; <チ>
off_B6A5:
- D - I - 0x02B6B5 20:B6A5: F6        .byte $F6
- D - I - 0x02B6B6 20:B6A6: FF        .byte $FF
- D - I - 0x02B6B7 20:B6A7: 00        .byte $00
- D - I - 0x02B6B8 20:B6A8: 01        .byte $01	; <あ>
- D - I - 0x02B6B9 20:B6A9: 51        .byte $51	; <チ>
- D - I - 0x02B6BA 20:B6AA: F6        .byte $F6
- D - I - 0x02B6BB 20:B6AB: FE        .byte $FE
- D - I - 0x02B6BC 20:B6AC: 00        .byte $00
- D - I - 0x02B6BD 20:B6AD: 02        .byte $02	; <い>
- D - I - 0x02B6BE 20:B6AE: 51        .byte $51	; <チ>
- D - I - 0x02B6BF 20:B6AF: F6        .byte $F6
- D - I - 0x02B6C0 20:B6B0: FD        .byte $FD
- D - I - 0x02B6C1 20:B6B1: 00        .byte $00
- D - I - 0x02B6C2 20:B6B2: 03        .byte $03	; <う>
- D - I - 0x02B6C3 20:B6B3: 51        .byte $51	; <チ>
- D - I - 0x02B6C4 20:B6B4: F6        .byte $F6
- D - I - 0x02B6C5 20:B6B5: FE        .byte $FE
- D - I - 0x02B6C6 20:B6B6: 00        .byte $00
- D - I - 0x02B6C7 20:B6B7: 02        .byte $02	; <い>
- D - I - 0x02B6C8 20:B6B8: 51        .byte $51	; <チ>
- D - I - 0x02B6C9 20:B6B9: F6        .byte $F6
- D - I - 0x02B6CA 20:B6BA: FF        .byte $FF
- D - I - 0x02B6CB 20:B6BB: 00        .byte $00
- D - I - 0x02B6CC 20:B6BC: 01        .byte $01	; <あ>
- D - I - 0x02B6CD 20:B6BD: 51        .byte $51	; <チ>
- D - I - 0x02B6CE 20:B6BE: F6        .byte $F6
- D - I - 0x02B6CF 20:B6BF: 00        .byte $00
- D - I - 0x02B6D0 20:B6C0: 00        .byte $00
- D - I - 0x02B6D1 20:B6C1: 01        .byte $01	; <あ>
- D - I - 0x02B6D2 20:B6C2: 51        .byte $51	; <チ>
- D - I - 0x02B6D3 20:B6C3: F3        .byte $F3
- D - I - 0x02B6D4 20:B6C4: A5 B6     .word off_B6A5
off_B6C6_EE:
- - - - - 0x02B6D6 20:B6C6: F0        .byte $F0



off_B6C7:
- D - I - 0x02B6D7 20:B6C7: 15        .byte $15	; <な>
- D - I - 0x02B6D8 20:B6C8: 0F        .byte $0F	; <そ>
- D - I - 0x02B6D9 20:B6C9: 32        .byte $32	; <ょ>
- D - I - 0x02B6DA 20:B6CA: 30        .byte $30	; <ゃ>
- D - I - 0x02B6DB 20:B6CB: 30        .byte $30	; <ゃ>
- D - I - 0x02B6DC 20:B6CC: 36        .byte $36	; <3>
- D - I - 0x02B6DD 20:B6CD: 0F        .byte $0F	; <そ>
- D - I - 0x02B6DE 20:B6CE: 14        .byte $14	; <と>
- D - I - 0x02B6DF 20:B6CF: 30        .byte $30	; <ゃ>
- D - I - 0x02B6E0 20:B6D0: 30        .byte $30	; <ゃ>
- D - I - 0x02B6E1 20:B6D1: 26        .byte $26	; <よ>
- D - I - 0x02B6E2 20:B6D2: 00        .byte $00
- D - I - 0x02B6E3 20:B6D3: 2C        .byte $2C	; <わ>
- D - I - 0x02B6E4 20:B6D4: 16        .byte $16	; <に>
- D - I - 0x02B6E5 20:B6D5: 30        .byte $30	; <ゃ>
- D - I - 0x02B6E6 20:B6D6: 15        .byte $15	; <な>
- D - I - 0x02B6E7 20:B6D7: 0F        .byte $0F	; <そ>
- D - I - 0x02B6E8 20:B6D8: 29        .byte $29	; <る>
- D - I - 0x02B6E9 20:B6D9: 30        .byte $30	; <ゃ>
- D - I - 0x02B6EA 20:B6DA: 30        .byte $30	; <ゃ>
- D - I - 0x02B6EB 20:B6DB: 26        .byte $26	; <よ>
- D - I - 0x02B6EC 20:B6DC: 0F        .byte $0F	; <そ>
- D - I - 0x02B6ED 20:B6DD: 00        .byte $00
- D - I - 0x02B6EE 20:B6DE: 30        .byte $30	; <ゃ>
- D - I - 0x02B6EF 20:B6DF: 30        .byte $30	; <ゃ>
- D - I - 0x02B6F0 20:B6E0: 15        .byte $15	; <な>
- D - I - 0x02B6F1 20:B6E1: 0F        .byte $0F	; <そ>
- D - I - 0x02B6F2 20:B6E2: 16        .byte $16	; <に>
- D - I - 0x02B6F3 20:B6E3: 00        .byte $00
- D - I - 0x02B6F4 20:B6E4: 30        .byte $30	; <ゃ>
- D - I - 0x02B6F5 20:B6E5: 36        .byte $36	; <3>
- D - I - 0x02B6F6 20:B6E6: 0F        .byte $0F	; <そ>
- D - I - 0x02B6F7 20:B6E7: 11        .byte $11	; <ち>
- D - I - 0x02B6F8 20:B6E8: 37        .byte $37	; <4>
- D - I - 0x02B6F9 20:B6E9: 30        .byte $30	; <ゃ>
- D - I - 0x02B6FA 20:B6EA: 36        .byte $36	; <3>
- D - I - 0x02B6FB 20:B6EB: 0F        .byte $0F	; <そ>
- D - I - 0x02B6FC 20:B6EC: 19        .byte $19	; <の>
- D - I - 0x02B6FD 20:B6ED: 30        .byte $30	; <ゃ>
- D - I - 0x02B6FE 20:B6EE: 30        .byte $30	; <ゃ>
- D - I - 0x02B6FF 20:B6EF: 36        .byte $36	; <3>
- D - I - 0x02B700 20:B6F0: 0F        .byte $0F	; <そ>
- D - I - 0x02B701 20:B6F1: 12        .byte $12	; <つ>
- D - I - 0x02B702 20:B6F2: 31        .byte $31	; <ゅ>
- D - I - 0x02B703 20:B6F3: 30        .byte $30	; <ゃ>
- D - I - 0x02B704 20:B6F4: 36        .byte $36	; <3>
- D - I - 0x02B705 20:B6F5: 0F        .byte $0F	; <そ>
- D - I - 0x02B706 20:B6F6: 30        .byte $30	; <ゃ>
- D - I - 0x02B707 20:B6F7: 24        .byte $24	; <や>
- D - I - 0x02B708 20:B6F8: 30        .byte $30	; <ゃ>
- D - I - 0x02B709 20:B6F9: 36        .byte $36	; <3>
- D - I - 0x02B70A 20:B6FA: 0F        .byte $0F	; <そ>
- D - I - 0x02B70B 20:B6FB: 37        .byte $37	; <4>
- D - I - 0x02B70C 20:B6FC: 30        .byte $30	; <ゃ>
- D - I - 0x02B70D 20:B6FD: 30        .byte $30	; <ゃ>
- D - I - 0x02B70E 20:B6FE: 36        .byte $36	; <3>
- D - I - 0x02B70F 20:B6FF: 0F        .byte $0F	; <そ>
- D - I - 0x02B710 20:B700: 00        .byte $00
- D - I - 0x02B711 20:B701: 0F        .byte $0F	; <そ>
- D - I - 0x02B712 20:B702: 30        .byte $30	; <ゃ>
- D - I - 0x02B713 20:B703: 35        .byte $35	; <2>
- D - I - 0x02B714 20:B704: 27        .byte $27	; <ら>
- D - I - 0x02B715 20:B705: 16        .byte $16	; <に>
- D - I - 0x02B716 20:B706: 16        .byte $16	; <に>
- D - I - 0x02B717 20:B707: 30        .byte $30	; <ゃ>
- D - I - 0x02B718 20:B708: 36        .byte $36	; <3>
- D - I - 0x02B719 20:B709: 0F        .byte $0F	; <そ>
- D - I - 0x02B71A 20:B70A: 31        .byte $31	; <ゅ>
- D - I - 0x02B71B 20:B70B: 30        .byte $30	; <ゃ>
- D - I - 0x02B71C 20:B70C: 30        .byte $30	; <ゃ>
- D - I - 0x02B71D 20:B70D: 35        .byte $35	; <2>
- D - I - 0x02B71E 20:B70E: 27        .byte $27	; <ら>
- D - I - 0x02B71F 20:B70F: 30        .byte $30	; <ゃ>
- D - I - 0x02B720 20:B710: 29        .byte $29	; <る>
- D - I - 0x02B721 20:B711: 30        .byte $30	; <ゃ>
- - - - - 0x02B722 20:B712: 00        .byte $00
- - - - - 0x02B723 20:B713: 00        .byte $00
- - - - - 0x02B724 20:B714: 00        .byte $00
- - - - - 0x02B725 20:B715: 00        .byte $00
- - - - - 0x02B726 20:B716: 00        .byte $00
- D - I - 0x02B727 20:B717: 27        .byte $27	; <ら>
- D - I - 0x02B728 20:B718: 00        .byte $00
- D - I - 0x02B729 20:B719: 23        .byte $23	; <も>
- D - I - 0x02B72A 20:B71A: 30        .byte $30	; <ゃ>
- D - I - 0x02B72B 20:B71B: 30        .byte $30	; <ゃ>
- D - I - 0x02B72C 20:B71C: 36        .byte $36	; <3>
- D - I - 0x02B72D 20:B71D: 00        .byte $00
- D - I - 0x02B72E 20:B71E: 37        .byte $37	; <4>
- D - I - 0x02B72F 20:B71F: 16        .byte $16	; <に>
- D - I - 0x02B730 20:B720: 30        .byte $30	; <ゃ>
- D - I - 0x02B731 20:B721: 27        .byte $27	; <ら>
- D - I - 0x02B732 20:B722: 0F        .byte $0F	; <そ>
- D - I - 0x02B733 20:B723: 29        .byte $29	; <る>
- D - I - 0x02B734 20:B724: 19        .byte $19	; <の>
- D - I - 0x02B735 20:B725: 30        .byte $30	; <ゃ>
- D - I - 0x02B736 20:B726: 36        .byte $36	; <3>
- D - I - 0x02B737 20:B727: 0F        .byte $0F	; <そ>
- D - I - 0x02B738 20:B728: 27        .byte $27	; <ら>
- D - I - 0x02B739 20:B729: 16        .byte $16	; <に>
- D - I - 0x02B73A 20:B72A: 30        .byte $30	; <ゃ>
- D - I - 0x02B73B 20:B72B: 27        .byte $27	; <ら>
- D - I - 0x02B73C 20:B72C: 0F        .byte $0F	; <そ>
- D - I - 0x02B73D 20:B72D: 11        .byte $11	; <ち>
- D - I - 0x02B73E 20:B72E: 11        .byte $11	; <ち>
- D - I - 0x02B73F 20:B72F: 30        .byte $30	; <ゃ>
- D - I - 0x02B740 20:B730: 36        .byte $36	; <3>
- D - I - 0x02B741 20:B731: 0F        .byte $0F	; <そ>
- D - I - 0x02B742 20:B732: 11        .byte $11	; <ち>
- D - I - 0x02B743 20:B733: 16        .byte $16	; <に>
- D - I - 0x02B744 20:B734: 30        .byte $30	; <ゃ>
- D - I - 0x02B745 20:B735: 15        .byte $15	; <な>
- D - I - 0x02B746 20:B736: 0F        .byte $0F	; <そ>
- D - I - 0x02B747 20:B737: 30        .byte $30	; <ゃ>
- D - I - 0x02B748 20:B738: 29        .byte $29	; <る>
- D - I - 0x02B749 20:B739: 30        .byte $30	; <ゃ>
- D - I - 0x02B74A 20:B73A: 35        .byte $35	; <2>
- D - I - 0x02B74B 20:B73B: 37        .byte $37	; <4>
- D - I - 0x02B74C 20:B73C: 30        .byte $30	; <ゃ>
- D - I - 0x02B74D 20:B73D: 16        .byte $16	; <に>
- D - I - 0x02B74E 20:B73E: 30        .byte $30	; <ゃ>
- D - I - 0x02B74F 20:B73F: 35        .byte $35	; <2>
- D - I - 0x02B750 20:B740: 27        .byte $27	; <ら>
- D - I - 0x02B751 20:B741: 37        .byte $37	; <4>
- D - I - 0x02B752 20:B742: 37        .byte $37	; <4>
- D - I - 0x02B753 20:B743: 30        .byte $30	; <ゃ>
- D - I - 0x02B754 20:B744: 35        .byte $35	; <2>
- D - I - 0x02B755 20:B745: 0F        .byte $0F	; <そ>
- D - I - 0x02B756 20:B746: 30        .byte $30	; <ゃ>
- D - I - 0x02B757 20:B747: 26        .byte $26	; <よ>
- D - I - 0x02B758 20:B748: 30        .byte $30	; <ゃ>
- D - I - 0x02B759 20:B749: 35        .byte $35	; <2>
- D - I - 0x02B75A 20:B74A: 37        .byte $37	; <4>
- D - I - 0x02B75B 20:B74B: 11        .byte $11	; <ち>
- D - I - 0x02B75C 20:B74C: 30        .byte $30	; <ゃ>
- D - I - 0x02B75D 20:B74D: 30        .byte $30	; <ゃ>
- D - I - 0x02B75E 20:B74E: 36        .byte $36	; <3>
- D - I - 0x02B75F 20:B74F: 0F        .byte $0F	; <そ>
- D - I - 0x02B760 20:B750: 29        .byte $29	; <る>
- D - I - 0x02B761 20:B751: 16        .byte $16	; <に>
- D - I - 0x02B762 20:B752: 30        .byte $30	; <ゃ>
- D - I - 0x02B763 20:B753: 36        .byte $36	; <3>
- D - I - 0x02B764 20:B754: 37        .byte $37	; <4>
- D - I - 0x02B765 20:B755: 30        .byte $30	; <ゃ>
- D - I - 0x02B766 20:B756: 11        .byte $11	; <ち>
- D - I - 0x02B767 20:B757: 30        .byte $30	; <ゃ>
- D - I - 0x02B768 20:B758: 35        .byte $35	; <2>
- D - I - 0x02B769 20:B759: 37        .byte $37	; <4>
- D - I - 0x02B76A 20:B75A: 26        .byte $26	; <よ>
- D - I - 0x02B76B 20:B75B: 30        .byte $30	; <ゃ>
- D - I - 0x02B76C 20:B75C: 30        .byte $30	; <ゃ>
- D - I - 0x02B76D 20:B75D: 35        .byte $35	; <2>
- D - I - 0x02B76E 20:B75E: 0F        .byte $0F	; <そ>
- D - I - 0x02B76F 20:B75F: 31        .byte $31	; <ゅ>
- D - I - 0x02B770 20:B760: 0F        .byte $0F	; <そ>
- D - I - 0x02B771 20:B761: 30        .byte $30	; <ゃ>
- D - I - 0x02B772 20:B762: 35        .byte $35	; <2>
- D - I - 0x02B773 20:B763: 27        .byte $27	; <ら>
- D - I - 0x02B774 20:B764: 30        .byte $30	; <ゃ>
- D - I - 0x02B775 20:B765: 0F        .byte $0F	; <そ>
- D - I - 0x02B776 20:B766: 30        .byte $30	; <ゃ>
off_B767:
- D - I - 0x02B777 20:B767: 15        .byte $15	; <な>
- D - I - 0x02B778 20:B768: 31        .byte $31	; <ゅ>
- D - I - 0x02B779 20:B769: 28        .byte $28	; <り>
- D - I - 0x02B77A 20:B76A: 1B        .byte $1B	; <ひ>
- D - I - 0x02B77B 20:B76B: 30        .byte $30	; <ゃ>
- D - I - 0x02B77C 20:B76C: 36        .byte $36	; <3>
- D - I - 0x02B77D 20:B76D: 0F        .byte $0F	; <そ>
- D - I - 0x02B77E 20:B76E: 22        .byte $22	; <め>
- D - I - 0x02B77F 20:B76F: 25        .byte $25	; <ゆ>
- D - I - 0x02B780 20:B770: 30        .byte $30	; <ゃ>
- - - - - 0x02B781 20:B771: 00        .byte $00
- - - - - 0x02B782 20:B772: 00        .byte $00
- - - - - 0x02B783 20:B773: 00        .byte $00
- - - - - 0x02B784 20:B774: 00        .byte $00
- - - - - 0x02B785 20:B775: 00        .byte $00
- D - I - 0x02B786 20:B776: 36        .byte $36	; <3>
- D - I - 0x02B787 20:B777: 09        .byte $09	; <け>
- D - I - 0x02B788 20:B778: 26        .byte $26	; <よ>
- D - I - 0x02B789 20:B779: 33        .byte $33	; <0>
- D - I - 0x02B78A 20:B77A: 30        .byte $30	; <ゃ>
- D - I - 0x02B78B 20:B77B: 36        .byte $36	; <3>
- D - I - 0x02B78C 20:B77C: 25        .byte $25	; <ゆ>
- D - I - 0x02B78D 20:B77D: 31        .byte $31	; <ゅ>
- D - I - 0x02B78E 20:B77E: 27        .byte $27	; <ら>
- D - I - 0x02B78F 20:B77F: 30        .byte $30	; <ゃ>
- D - I - 0x02B790 20:B780: 15        .byte $15	; <な>
- D - I - 0x02B791 20:B781: 0F        .byte $0F	; <そ>
- D - I - 0x02B792 20:B782: 37        .byte $37	; <4>
- D - I - 0x02B793 20:B783: 22        .byte $22	; <め>
- D - I - 0x02B794 20:B784: 30        .byte $30	; <ゃ>
- D - I - 0x02B795 20:B785: 36        .byte $36	; <3>
- D - I - 0x02B796 20:B786: 11        .byte $11	; <ち>
- D - I - 0x02B797 20:B787: 19        .byte $19	; <の>
- D - I - 0x02B798 20:B788: 29        .byte $29	; <る>
- D - I - 0x02B799 20:B789: 30        .byte $30	; <ゃ>
- D - I - 0x02B79A 20:B78A: 36        .byte $36	; <3>
- D - I - 0x02B79B 20:B78B: 05        .byte $05	; <お>
- D - I - 0x02B79C 20:B78C: 19        .byte $19	; <の>
- D - I - 0x02B79D 20:B78D: 27        .byte $27	; <ら>
- D - I - 0x02B79E 20:B78E: 30        .byte $30	; <ゃ>
- - - - - 0x02B79F 20:B78F: 00        .byte $00
- - - - - 0x02B7A0 20:B790: 00        .byte $00
- - - - - 0x02B7A1 20:B791: 00        .byte $00
- - - - - 0x02B7A2 20:B792: 00        .byte $00
- - - - - 0x02B7A3 20:B793: 00        .byte $00
- D - I - 0x02B7A4 20:B794: 36        .byte $36	; <3>
- D - I - 0x02B7A5 20:B795: 00        .byte $00
- D - I - 0x02B7A6 20:B796: 16        .byte $16	; <に>
- D - I - 0x02B7A7 20:B797: 2C        .byte $2C	; <わ>
- D - I - 0x02B7A8 20:B798: 30        .byte $30	; <ゃ>
- D - I - 0x02B7A9 20:B799: 36        .byte $36	; <3>
- D - I - 0x02B7AA 20:B79A: 01        .byte $01	; <あ>
- D - I - 0x02B7AB 20:B79B: 16        .byte $16	; <に>
- D - I - 0x02B7AC 20:B79C: 16        .byte $16	; <に>
- D - I - 0x02B7AD 20:B79D: 30        .byte $30	; <ゃ>
- - - - - 0x02B7AE 20:B79E: 00        .byte $00
- - - - - 0x02B7AF 20:B79F: 00        .byte $00
- - - - - 0x02B7B0 20:B7A0: 00        .byte $00
- - - - - 0x02B7B1 20:B7A1: 00        .byte $00
- - - - - 0x02B7B2 20:B7A2: 00        .byte $00
- D - I - 0x02B7B3 20:B7A3: 36        .byte $36	; <3>
- D - I - 0x02B7B4 20:B7A4: 26        .byte $26	; <よ>
- D - I - 0x02B7B5 20:B7A5: 10        .byte $10	; <た>
- D - I - 0x02B7B6 20:B7A6: 27        .byte $27	; <ら>
- D - I - 0x02B7B7 20:B7A7: 30        .byte $30	; <ゃ>
- D - I - 0x02B7B8 20:B7A8: 26        .byte $26	; <よ>
- D - I - 0x02B7B9 20:B7A9: 0F        .byte $0F	; <そ>
- D - I - 0x02B7BA 20:B7AA: 0F        .byte $0F	; <そ>
- D - I - 0x02B7BB 20:B7AB: 00        .byte $00
- D - I - 0x02B7BC 20:B7AC: 30        .byte $30	; <ゃ>
- - - - - 0x02B7BD 20:B7AD: 00        .byte $00
- - - - - 0x02B7BE 20:B7AE: 00        .byte $00
- - - - - 0x02B7BF 20:B7AF: 00        .byte $00
- - - - - 0x02B7C0 20:B7B0: 00        .byte $00
- - - - - 0x02B7C1 20:B7B1: 00        .byte $00
- - - - - 0x02B7C2 20:B7B2: 00        .byte $00
- - - - - 0x02B7C3 20:B7B3: 00        .byte $00
- - - - - 0x02B7C4 20:B7B4: 00        .byte $00
- - - - - 0x02B7C5 20:B7B5: 00        .byte $00
- - - - - 0x02B7C6 20:B7B6: 00        .byte $00
- D - I - 0x02B7C7 20:B7B7: 35        .byte $35	; <2>
- D - I - 0x02B7C8 20:B7B8: 27        .byte $27	; <ら>
- D - I - 0x02B7C9 20:B7B9: 2B        .byte $2B	; <ろ>
- D - I - 0x02B7CA 20:B7BA: 28        .byte $28	; <り>
- D - I - 0x02B7CB 20:B7BB: 30        .byte $30	; <ゃ>
- D - I - 0x02B7CC 20:B7BC: 36        .byte $36	; <3>
- D - I - 0x02B7CD 20:B7BD: 0F        .byte $0F	; <そ>
- D - I - 0x02B7CE 20:B7BE: 25        .byte $25	; <ゆ>
- D - I - 0x02B7CF 20:B7BF: 0B        .byte $0B	; <さ>
- D - I - 0x02B7D0 20:B7C0: 30        .byte $30	; <ゃ>
- D - I - 0x02B7D1 20:B7C1: 27        .byte $27	; <ら>
- D - I - 0x02B7D2 20:B7C2: 0F        .byte $0F	; <そ>
- D - I - 0x02B7D3 20:B7C3: 23        .byte $23	; <も>
- D - I - 0x02B7D4 20:B7C4: 26        .byte $26	; <よ>
- D - I - 0x02B7D5 20:B7C5: 30        .byte $30	; <ゃ>
- D - I - 0x02B7D6 20:B7C6: 36        .byte $36	; <3>
- D - I - 0x02B7D7 20:B7C7: 0C        .byte $0C	; <し>
- D - I - 0x02B7D8 20:B7C8: 3C        .byte $3C	; <9>
- D - I - 0x02B7D9 20:B7C9: 15        .byte $15	; <な>
- D - I - 0x02B7DA 20:B7CA: 30        .byte $30	; <ゃ>
- D - I - 0x02B7DB 20:B7CB: 27        .byte $27	; <ら>
- D - I - 0x02B7DC 20:B7CC: 01        .byte $01	; <あ>
- D - I - 0x02B7DD 20:B7CD: 30        .byte $30	; <ゃ>
- D - I - 0x02B7DE 20:B7CE: 10        .byte $10	; <た>
- D - I - 0x02B7DF 20:B7CF: 30        .byte $30	; <ゃ>
- D - I - 0x02B7E0 20:B7D0: 36        .byte $36	; <3>
- D - I - 0x02B7E1 20:B7D1: 11        .byte $11	; <ち>
- D - I - 0x02B7E2 20:B7D2: 30        .byte $30	; <ゃ>
- D - I - 0x02B7E3 20:B7D3: 2B        .byte $2B	; <ろ>
- D - I - 0x02B7E4 20:B7D4: 30        .byte $30	; <ゃ>
- D - I - 0x02B7E5 20:B7D5: 15        .byte $15	; <な>
- D - I - 0x02B7E6 20:B7D6: 0F        .byte $0F	; <そ>
- D - I - 0x02B7E7 20:B7D7: 30        .byte $30	; <ゃ>
- D - I - 0x02B7E8 20:B7D8: 25        .byte $25	; <ゆ>
- D - I - 0x02B7E9 20:B7D9: 30        .byte $30	; <ゃ>
- - - - - 0x02B7EA 20:B7DA: 00        .byte $00
- - - - - 0x02B7EB 20:B7DB: 00        .byte $00
- - - - - 0x02B7EC 20:B7DC: 00        .byte $00
- - - - - 0x02B7ED 20:B7DD: 00        .byte $00
- - - - - 0x02B7EE 20:B7DE: 00        .byte $00
- D - I - 0x02B7EF 20:B7DF: 36        .byte $36	; <3>
- D - I - 0x02B7F0 20:B7E0: 26        .byte $26	; <よ>
- D - I - 0x02B7F1 20:B7E1: 37        .byte $37	; <4>
- D - I - 0x02B7F2 20:B7E2: 00        .byte $00
- D - I - 0x02B7F3 20:B7E3: 30        .byte $30	; <ゃ>
- - - - - 0x02B7F4 20:B7E4: 00        .byte $00
- - - - - 0x02B7F5 20:B7E5: 00        .byte $00
- - - - - 0x02B7F6 20:B7E6: 00        .byte $00
- - - - - 0x02B7F7 20:B7E7: 00        .byte $00
- - - - - 0x02B7F8 20:B7E8: 00        .byte $00
- D - I - 0x02B7F9 20:B7E9: 35        .byte $35	; <2>
- D - I - 0x02B7FA 20:B7EA: 37        .byte $37	; <4>
- D - I - 0x02B7FB 20:B7EB: 16        .byte $16	; <に>
- D - I - 0x02B7FC 20:B7EC: 29        .byte $29	; <る>
- D - I - 0x02B7FD 20:B7ED: 30        .byte $30	; <ゃ>
- D - I - 0x02B7FE 20:B7EE: 36        .byte $36	; <3>
- D - I - 0x02B7FF 20:B7EF: 24        .byte $24	; <や>
- D - I - 0x02B800 20:B7F0: 30        .byte $30	; <ゃ>
- D - I - 0x02B801 20:B7F1: 15        .byte $15	; <な>
- D - I - 0x02B802 20:B7F2: 30        .byte $30	; <ゃ>
- - - - - 0x02B803 20:B7F3: 00        .byte $00
- - - - - 0x02B804 20:B7F4: 00        .byte $00
- - - - - 0x02B805 20:B7F5: 00        .byte $00
- - - - - 0x02B806 20:B7F6: 00        .byte $00
- - - - - 0x02B807 20:B7F7: 00        .byte $00
- D - I - 0x02B808 20:B7F8: 36        .byte $36	; <3>
- D - I - 0x02B809 20:B7F9: 25        .byte $25	; <ゆ>
- D - I - 0x02B80A 20:B7FA: 30        .byte $30	; <ゃ>
- D - I - 0x02B80B 20:B7FB: 38        .byte $38	; <5>
- D - I - 0x02B80C 20:B7FC: 30        .byte $30	; <ゃ>
- D - I - 0x02B80D 20:B7FD: 36        .byte $36	; <3>
- D - I - 0x02B80E 20:B7FE: 16        .byte $16	; <に>
- D - I - 0x02B80F 20:B7FF: 00        .byte $00
- D - I - 0x02B810 20:B800: 10        .byte $10	; <た>
- D - I - 0x02B811 20:B801: 30        .byte $30	; <ゃ>
- - - - - 0x02B812 20:B802: 00        .byte $00
- - - - - 0x02B813 20:B803: 00        .byte $00
- - - - - 0x02B814 20:B804: 00        .byte $00
- - - - - 0x02B815 20:B805: 00        .byte $00
- - - - - 0x02B816 20:B806: 00        .byte $00
- - - - - 0x02B817 20:B807: 00        .byte $00
- - - - - 0x02B818 20:B808: 00        .byte $00
- - - - - 0x02B819 20:B809: 00        .byte $00
- - - - - 0x02B81A 20:B80A: 00        .byte $00
- - - - - 0x02B81B 20:B80B: 00        .byte $00
off_B80C:
- - - - - 0x02B81C 20:B80C: 00        .byte $00
- - - - - 0x02B81D 20:B80D: 00        .byte $00
- - - - - 0x02B81E 20:B80E: 00        .byte $00
- - - - - 0x02B81F 20:B80F: 00        .byte $00
- - - - - 0x02B820 20:B810: 00        .byte $00
- D - I - 0x02B821 20:B811: 36        .byte $36	; <3>
- D - I - 0x02B822 20:B812: 0F        .byte $0F	; <そ>
- D - I - 0x02B823 20:B813: 30        .byte $30	; <ゃ>
- D - I - 0x02B824 20:B814: 30        .byte $30	; <ゃ>
- D - I - 0x02B825 20:B815: 30        .byte $30	; <ゃ>
- D - I - 0x02B826 20:B816: 26        .byte $26	; <よ>
- D - I - 0x02B827 20:B817: 00        .byte $00
- D - I - 0x02B828 20:B818: 30        .byte $30	; <ゃ>
- D - I - 0x02B829 20:B819: 37        .byte $37	; <4>
- D - I - 0x02B82A 20:B81A: 30        .byte $30	; <ゃ>
- D - I - 0x02B82B 20:B81B: 15        .byte $15	; <な>
- D - I - 0x02B82C 20:B81C: 00        .byte $00
- D - I - 0x02B82D 20:B81D: 30        .byte $30	; <ゃ>
- D - I - 0x02B82E 20:B81E: 30        .byte $30	; <ゃ>
- D - I - 0x02B82F 20:B81F: 30        .byte $30	; <ゃ>
- D - I - 0x02B830 20:B820: 15        .byte $15	; <な>
- D - I - 0x02B831 20:B821: 0F        .byte $0F	; <そ>
- D - I - 0x02B832 20:B822: 30        .byte $30	; <ゃ>
- D - I - 0x02B833 20:B823: 30        .byte $30	; <ゃ>
- D - I - 0x02B834 20:B824: 30        .byte $30	; <ゃ>
- D - I - 0x02B835 20:B825: 15        .byte $15	; <な>
- D - I - 0x02B836 20:B826: 0F        .byte $0F	; <そ>
- D - I - 0x02B837 20:B827: 30        .byte $30	; <ゃ>
- D - I - 0x02B838 20:B828: 30        .byte $30	; <ゃ>
- D - I - 0x02B839 20:B829: 30        .byte $30	; <ゃ>
- D - I - 0x02B83A 20:B82A: 15        .byte $15	; <な>
- D - I - 0x02B83B 20:B82B: 37        .byte $37	; <4>
- D - I - 0x02B83C 20:B82C: 30        .byte $30	; <ゃ>
- D - I - 0x02B83D 20:B82D: 30        .byte $30	; <ゃ>
- D - I - 0x02B83E 20:B82E: 30        .byte $30	; <ゃ>
- D - I - 0x02B83F 20:B82F: 36        .byte $36	; <3>
- D - I - 0x02B840 20:B830: 37        .byte $37	; <4>
- D - I - 0x02B841 20:B831: 30        .byte $30	; <ゃ>
- D - I - 0x02B842 20:B832: 30        .byte $30	; <ゃ>
- D - I - 0x02B843 20:B833: 30        .byte $30	; <ゃ>
- D - I - 0x02B844 20:B834: 15        .byte $15	; <な>
- D - I - 0x02B845 20:B835: 0F        .byte $0F	; <そ>
- D - I - 0x02B846 20:B836: 30        .byte $30	; <ゃ>
- D - I - 0x02B847 20:B837: 30        .byte $30	; <ゃ>
- D - I - 0x02B848 20:B838: 30        .byte $30	; <ゃ>
- D - I - 0x02B849 20:B839: 35        .byte $35	; <2>
- D - I - 0x02B84A 20:B83A: 16        .byte $16	; <に>
- D - I - 0x02B84B 20:B83B: 30        .byte $30	; <ゃ>
- D - I - 0x02B84C 20:B83C: 30        .byte $30	; <ゃ>
- D - I - 0x02B84D 20:B83D: 30        .byte $30	; <ゃ>
- D - I - 0x02B84E 20:B83E: 15        .byte $15	; <な>
- D - I - 0x02B84F 20:B83F: 26        .byte $26	; <よ>
- D - I - 0x02B850 20:B840: 30        .byte $30	; <ゃ>
- D - I - 0x02B851 20:B841: 30        .byte $30	; <ゃ>
- D - I - 0x02B852 20:B842: 30        .byte $30	; <ゃ>
- D - I - 0x02B853 20:B843: 15        .byte $15	; <な>
- D - I - 0x02B854 20:B844: 10        .byte $10	; <た>
- D - I - 0x02B855 20:B845: 30        .byte $30	; <ゃ>
- D - I - 0x02B856 20:B846: 30        .byte $30	; <ゃ>
- D - I - 0x02B857 20:B847: 30        .byte $30	; <ゃ>
- D - I - 0x02B858 20:B848: 36        .byte $36	; <3>
- D - I - 0x02B859 20:B849: 0F        .byte $0F	; <そ>
- D - I - 0x02B85A 20:B84A: 30        .byte $30	; <ゃ>
- D - I - 0x02B85B 20:B84B: 11        .byte $11	; <ち>
- D - I - 0x02B85C 20:B84C: 30        .byte $30	; <ゃ>
- D - I - 0x02B85D 20:B84D: 36        .byte $36	; <3>
- D - I - 0x02B85E 20:B84E: 0F        .byte $0F	; <そ>
- D - I - 0x02B85F 20:B84F: 30        .byte $30	; <ゃ>
- D - I - 0x02B860 20:B850: 11        .byte $11	; <ち>
- D - I - 0x02B861 20:B851: 30        .byte $30	; <ゃ>
- D - I - 0x02B862 20:B852: 36        .byte $36	; <3>
- D - I - 0x02B863 20:B853: 0F        .byte $0F	; <そ>
- D - I - 0x02B864 20:B854: 30        .byte $30	; <ゃ>
- D - I - 0x02B865 20:B855: 11        .byte $11	; <ち>
- D - I - 0x02B866 20:B856: 30        .byte $30	; <ゃ>
- D - I - 0x02B867 20:B857: 36        .byte $36	; <3>
- D - I - 0x02B868 20:B858: 0F        .byte $0F	; <そ>
- D - I - 0x02B869 20:B859: 30        .byte $30	; <ゃ>
- D - I - 0x02B86A 20:B85A: 00        .byte $00
- D - I - 0x02B86B 20:B85B: 30        .byte $30	; <ゃ>
- D - I - 0x02B86C 20:B85C: 36        .byte $36	; <3>
- D - I - 0x02B86D 20:B85D: 0F        .byte $0F	; <そ>
- D - I - 0x02B86E 20:B85E: 30        .byte $30	; <ゃ>
- D - I - 0x02B86F 20:B85F: 11        .byte $11	; <ち>
- D - I - 0x02B870 20:B860: 30        .byte $30	; <ゃ>
- D - I - 0x02B871 20:B861: 36        .byte $36	; <3>
- D - I - 0x02B872 20:B862: 17        .byte $17	; <ぬ>
- D - I - 0x02B873 20:B863: 30        .byte $30	; <ゃ>
- D - I - 0x02B874 20:B864: 11        .byte $11	; <ち>
- D - I - 0x02B875 20:B865: 30        .byte $30	; <ゃ>
- D - I - 0x02B876 20:B866: 36        .byte $36	; <3>
- D - I - 0x02B877 20:B867: 0F        .byte $0F	; <そ>
- D - I - 0x02B878 20:B868: 30        .byte $30	; <ゃ>
- D - I - 0x02B879 20:B869: 11        .byte $11	; <ち>
- D - I - 0x02B87A 20:B86A: 30        .byte $30	; <ゃ>
- D - I - 0x02B87B 20:B86B: 36        .byte $36	; <3>
- D - I - 0x02B87C 20:B86C: 07        .byte $07	; <き>
- D - I - 0x02B87D 20:B86D: 30        .byte $30	; <ゃ>
- D - I - 0x02B87E 20:B86E: 11        .byte $11	; <ち>
- D - I - 0x02B87F 20:B86F: 30        .byte $30	; <ゃ>
- D - I - 0x02B880 20:B870: 36        .byte $36	; <3>
- D - I - 0x02B881 20:B871: 0F        .byte $0F	; <そ>
- D - I - 0x02B882 20:B872: 30        .byte $30	; <ゃ>
- D - I - 0x02B883 20:B873: 11        .byte $11	; <ち>
- D - I - 0x02B884 20:B874: 30        .byte $30	; <ゃ>
- D - I - 0x02B885 20:B875: 36        .byte $36	; <3>
- D - I - 0x02B886 20:B876: 0F        .byte $0F	; <そ>
- D - I - 0x02B887 20:B877: 30        .byte $30	; <ゃ>
- D - I - 0x02B888 20:B878: 11        .byte $11	; <ち>
- D - I - 0x02B889 20:B879: 30        .byte $30	; <ゃ>
- D - I - 0x02B88A 20:B87A: 36        .byte $36	; <3>
- D - I - 0x02B88B 20:B87B: 00        .byte $00
- D - I - 0x02B88C 20:B87C: 30        .byte $30	; <ゃ>
- D - I - 0x02B88D 20:B87D: 11        .byte $11	; <ち>
- D - I - 0x02B88E 20:B87E: 30        .byte $30	; <ゃ>
- D - I - 0x02B88F 20:B87F: 36        .byte $36	; <3>
- D - I - 0x02B890 20:B880: 0F        .byte $0F	; <そ>
- D - I - 0x02B891 20:B881: 16        .byte $16	; <に>
- D - I - 0x02B892 20:B882: 30        .byte $30	; <ゃ>
- D - I - 0x02B893 20:B883: 30        .byte $30	; <ゃ>
- D - I - 0x02B894 20:B884: 36        .byte $36	; <3>
- D - I - 0x02B895 20:B885: 0F        .byte $0F	; <そ>
- D - I - 0x02B896 20:B886: 16        .byte $16	; <に>
- D - I - 0x02B897 20:B887: 30        .byte $30	; <ゃ>
- D - I - 0x02B898 20:B888: 30        .byte $30	; <ゃ>
- D - I - 0x02B899 20:B889: 36        .byte $36	; <3>
- D - I - 0x02B89A 20:B88A: 07        .byte $07	; <き>
- D - I - 0x02B89B 20:B88B: 16        .byte $16	; <に>
- D - I - 0x02B89C 20:B88C: 30        .byte $30	; <ゃ>
- D - I - 0x02B89D 20:B88D: 30        .byte $30	; <ゃ>
- D - I - 0x02B89E 20:B88E: 36        .byte $36	; <3>
- D - I - 0x02B89F 20:B88F: 0F        .byte $0F	; <そ>
- D - I - 0x02B8A0 20:B890: 16        .byte $16	; <に>
- D - I - 0x02B8A1 20:B891: 30        .byte $30	; <ゃ>
- D - I - 0x02B8A2 20:B892: 30        .byte $30	; <ゃ>
- D - I - 0x02B8A3 20:B893: 36        .byte $36	; <3>
- D - I - 0x02B8A4 20:B894: 07        .byte $07	; <き>
- D - I - 0x02B8A5 20:B895: 16        .byte $16	; <に>
- D - I - 0x02B8A6 20:B896: 30        .byte $30	; <ゃ>
- D - I - 0x02B8A7 20:B897: 30        .byte $30	; <ゃ>
- D - I - 0x02B8A8 20:B898: 36        .byte $36	; <3>
- D - I - 0x02B8A9 20:B899: 00        .byte $00
- D - I - 0x02B8AA 20:B89A: 16        .byte $16	; <に>
- D - I - 0x02B8AB 20:B89B: 30        .byte $30	; <ゃ>
- D - I - 0x02B8AC 20:B89C: 30        .byte $30	; <ゃ>
- D - I - 0x02B8AD 20:B89D: 36        .byte $36	; <3>
- D - I - 0x02B8AE 20:B89E: 00        .byte $00
- D - I - 0x02B8AF 20:B89F: 16        .byte $16	; <に>
- D - I - 0x02B8B0 20:B8A0: 30        .byte $30	; <ゃ>
- D - I - 0x02B8B1 20:B8A1: 30        .byte $30	; <ゃ>
- - - - - 0x02B8B2 20:B8A2: 36        .byte $36	; <3>
- - - - - 0x02B8B3 20:B8A3: 0F        .byte $0F	; <そ>
- - - - - 0x02B8B4 20:B8A4: 16        .byte $16	; <に>
- - - - - 0x02B8B5 20:B8A5: 30        .byte $30	; <ゃ>
- - - - - 0x02B8B6 20:B8A6: 30        .byte $30	; <ゃ>
- - - - - 0x02B8B7 20:B8A7: 36        .byte $36	; <3>
- - - - - 0x02B8B8 20:B8A8: 0F        .byte $0F	; <そ>
- - - - - 0x02B8B9 20:B8A9: 16        .byte $16	; <に>
- - - - - 0x02B8BA 20:B8AA: 30        .byte $30	; <ゃ>
- - - - - 0x02B8BB 20:B8AB: 30        .byte $30	; <ゃ>
- D - I - 0x02B8BC 20:B8AC: 36        .byte $36	; <3>
- D - I - 0x02B8BD 20:B8AD: 15        .byte $15	; <な>
- D - I - 0x02B8BE 20:B8AE: 16        .byte $16	; <に>
- D - I - 0x02B8BF 20:B8AF: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C0 20:B8B0: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C1 20:B8B1: 36        .byte $36	; <3>
- D - I - 0x02B8C2 20:B8B2: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C3 20:B8B3: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C4 20:B8B4: 11        .byte $11	; <ち>
- D - I - 0x02B8C5 20:B8B5: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C6 20:B8B6: 36        .byte $36	; <3>
- D - I - 0x02B8C7 20:B8B7: 0F        .byte $0F	; <そ>
- D - I - 0x02B8C8 20:B8B8: 30        .byte $30	; <ゃ>
- D - I - 0x02B8C9 20:B8B9: 11        .byte $11	; <ち>
- D - I - 0x02B8CA 20:B8BA: 30        .byte $30	; <ゃ>
- D - I - 0x02B8CB 20:B8BB: 35        .byte $35	; <2>
- D - I - 0x02B8CC 20:B8BC: 00        .byte $00
- D - I - 0x02B8CD 20:B8BD: 14        .byte $14	; <と>
- D - I - 0x02B8CE 20:B8BE: 30        .byte $30	; <ゃ>
- D - I - 0x02B8CF 20:B8BF: 30        .byte $30	; <ゃ>
- D - I - 0x02B8D0 20:B8C0: 15        .byte $15	; <な>
- D - I - 0x02B8D1 20:B8C1: 00        .byte $00
- D - I - 0x02B8D2 20:B8C2: 14        .byte $14	; <と>
- D - I - 0x02B8D3 20:B8C3: 30        .byte $30	; <ゃ>
- D - I - 0x02B8D4 20:B8C4: 30        .byte $30	; <ゃ>
- D - I - 0x02B8D5 20:B8C5: 36        .byte $36	; <3>
- D - I - 0x02B8D6 20:B8C6: 16        .byte $16	; <に>
- D - I - 0x02B8D7 20:B8C7: 2C        .byte $2C	; <わ>
- D - I - 0x02B8D8 20:B8C8: 16        .byte $16	; <に>
- D - I - 0x02B8D9 20:B8C9: 30        .byte $30	; <ゃ>
- D - I - 0x02B8DA 20:B8CA: 35        .byte $35	; <2>
- D - I - 0x02B8DB 20:B8CB: 11        .byte $11	; <ち>
- D - I - 0x02B8DC 20:B8CC: 30        .byte $30	; <ゃ>
- D - I - 0x02B8DD 20:B8CD: 22        .byte $22	; <め>
- D - I - 0x02B8DE 20:B8CE: 30        .byte $30	; <ゃ>
- D - I - 0x02B8DF 20:B8CF: 35        .byte $35	; <2>
- D - I - 0x02B8E0 20:B8D0: 00        .byte $00
- D - I - 0x02B8E1 20:B8D1: 29        .byte $29	; <る>
- D - I - 0x02B8E2 20:B8D2: 30        .byte $30	; <ゃ>
- D - I - 0x02B8E3 20:B8D3: 30        .byte $30	; <ゃ>
- D - I - 0x02B8E4 20:B8D4: 26        .byte $26	; <よ>
- D - I - 0x02B8E5 20:B8D5: 00        .byte $00
- D - I - 0x02B8E6 20:B8D6: 29        .byte $29	; <る>
- D - I - 0x02B8E7 20:B8D7: 30        .byte $30	; <ゃ>
- D - I - 0x02B8E8 20:B8D8: 30        .byte $30	; <ゃ>
- D - I - 0x02B8E9 20:B8D9: 15        .byte $15	; <な>
- D - I - 0x02B8EA 20:B8DA: 37        .byte $37	; <4>
- D - I - 0x02B8EB 20:B8DB: 00        .byte $00
- D - I - 0x02B8EC 20:B8DC: 30        .byte $30	; <ゃ>
- D - I - 0x02B8ED 20:B8DD: 30        .byte $30	; <ゃ>
- D - I - 0x02B8EE 20:B8DE: 36        .byte $36	; <3>
- D - I - 0x02B8EF 20:B8DF: 25        .byte $25	; <ゆ>
- D - I - 0x02B8F0 20:B8E0: 00        .byte $00
- D - I - 0x02B8F1 20:B8E1: 30        .byte $30	; <ゃ>
- D - I - 0x02B8F2 20:B8E2: 30        .byte $30	; <ゃ>
- D - I - 0x02B8F3 20:B8E3: 26        .byte $26	; <よ>
- D - I - 0x02B8F4 20:B8E4: 27        .byte $27	; <ら>
- D - I - 0x02B8F5 20:B8E5: 16        .byte $16	; <に>
- D - I - 0x02B8F6 20:B8E6: 00        .byte $00
- D - I - 0x02B8F7 20:B8E7: 30        .byte $30	; <ゃ>
- D - I - 0x02B8F8 20:B8E8: 35        .byte $35	; <2>
- D - I - 0x02B8F9 20:B8E9: 37        .byte $37	; <4>
- D - I - 0x02B8FA 20:B8EA: 16        .byte $16	; <に>
- D - I - 0x02B8FB 20:B8EB: 00        .byte $00
- D - I - 0x02B8FC 20:B8EC: 30        .byte $30	; <ゃ>
- D - I - 0x02B8FD 20:B8ED: 15        .byte $15	; <な>
- D - I - 0x02B8FE 20:B8EE: 00        .byte $00
- D - I - 0x02B8FF 20:B8EF: 16        .byte $16	; <に>
- D - I - 0x02B900 20:B8F0: 00        .byte $00
- D - I - 0x02B901 20:B8F1: 30        .byte $30	; <ゃ>
- D - I - 0x02B902 20:B8F2: 36        .byte $36	; <3>
- D - I - 0x02B903 20:B8F3: 00        .byte $00
- D - I - 0x02B904 20:B8F4: 11        .byte $11	; <ち>
- D - I - 0x02B905 20:B8F5: 37        .byte $37	; <4>
- D - I - 0x02B906 20:B8F6: 30        .byte $30	; <ゃ>
- D - I - 0x02B907 20:B8F7: 36        .byte $36	; <3>
- D - I - 0x02B908 20:B8F8: 07        .byte $07	; <き>
- D - I - 0x02B909 20:B8F9: 11        .byte $11	; <ち>
- D - I - 0x02B90A 20:B8FA: 37        .byte $37	; <4>
- D - I - 0x02B90B 20:B8FB: 30        .byte $30	; <ゃ>
- D - I - 0x02B90C 20:B8FC: 36        .byte $36	; <3>
- D - I - 0x02B90D 20:B8FD: 0F        .byte $0F	; <そ>
- D - I - 0x02B90E 20:B8FE: 19        .byte $19	; <の>
- D - I - 0x02B90F 20:B8FF: 30        .byte $30	; <ゃ>
- D - I - 0x02B910 20:B900: 30        .byte $30	; <ゃ>
- D - I - 0x02B911 20:B901: 36        .byte $36	; <3>
- D - I - 0x02B912 20:B902: 0F        .byte $0F	; <そ>
- D - I - 0x02B913 20:B903: 19        .byte $19	; <の>
- D - I - 0x02B914 20:B904: 30        .byte $30	; <ゃ>
- D - I - 0x02B915 20:B905: 30        .byte $30	; <ゃ>
- D - I - 0x02B916 20:B906: 36        .byte $36	; <3>
- D - I - 0x02B917 20:B907: 07        .byte $07	; <き>
- D - I - 0x02B918 20:B908: 12        .byte $12	; <つ>
- D - I - 0x02B919 20:B909: 31        .byte $31	; <ゅ>
- D - I - 0x02B91A 20:B90A: 30        .byte $30	; <ゃ>
- D - I - 0x02B91B 20:B90B: 36        .byte $36	; <3>
- D - I - 0x02B91C 20:B90C: 0F        .byte $0F	; <そ>
- D - I - 0x02B91D 20:B90D: 00        .byte $00
- D - I - 0x02B91E 20:B90E: 19        .byte $19	; <の>
- D - I - 0x02B91F 20:B90F: 30        .byte $30	; <ゃ>
- D - I - 0x02B920 20:B910: 36        .byte $36	; <3>
- D - I - 0x02B921 20:B911: 15        .byte $15	; <な>
- D - I - 0x02B922 20:B912: 30        .byte $30	; <ゃ>
- D - I - 0x02B923 20:B913: 24        .byte $24	; <や>
- D - I - 0x02B924 20:B914: 30        .byte $30	; <ゃ>
- D - I - 0x02B925 20:B915: 36        .byte $36	; <3>
- D - I - 0x02B926 20:B916: 00        .byte $00
- D - I - 0x02B927 20:B917: 37        .byte $37	; <4>
- D - I - 0x02B928 20:B918: 30        .byte $30	; <ゃ>
- D - I - 0x02B929 20:B919: 30        .byte $30	; <ゃ>
- D - I - 0x02B92A 20:B91A: 36        .byte $36	; <3>
- D - I - 0x02B92B 20:B91B: 0F        .byte $0F	; <そ>
- D - I - 0x02B92C 20:B91C: 00        .byte $00
- D - I - 0x02B92D 20:B91D: 0F        .byte $0F	; <そ>
- D - I - 0x02B92E 20:B91E: 30        .byte $30	; <ゃ>
- D - I - 0x02B92F 20:B91F: 36        .byte $36	; <3>
- D - I - 0x02B930 20:B920: 0F        .byte $0F	; <そ>
- D - I - 0x02B931 20:B921: 00        .byte $00
- D - I - 0x02B932 20:B922: 0F        .byte $0F	; <そ>
- D - I - 0x02B933 20:B923: 30        .byte $30	; <ゃ>
- D - I - 0x02B934 20:B924: 36        .byte $36	; <3>
- D - I - 0x02B935 20:B925: 0F        .byte $0F	; <そ>
- D - I - 0x02B936 20:B926: 00        .byte $00
- D - I - 0x02B937 20:B927: 0F        .byte $0F	; <そ>
- D - I - 0x02B938 20:B928: 30        .byte $30	; <ゃ>
- D - I - 0x02B939 20:B929: 36        .byte $36	; <3>
- D - I - 0x02B93A 20:B92A: 0F        .byte $0F	; <そ>
- D - I - 0x02B93B 20:B92B: 30        .byte $30	; <ゃ>
- D - I - 0x02B93C 20:B92C: 16        .byte $16	; <に>
- D - I - 0x02B93D 20:B92D: 30        .byte $30	; <ゃ>
- D - I - 0x02B93E 20:B92E: 36        .byte $36	; <3>
- D - I - 0x02B93F 20:B92F: 11        .byte $11	; <ち>
- D - I - 0x02B940 20:B930: 16        .byte $16	; <に>
- D - I - 0x02B941 20:B931: 16        .byte $16	; <に>
- D - I - 0x02B942 20:B932: 30        .byte $30	; <ゃ>
- D - I - 0x02B943 20:B933: 26        .byte $26	; <よ>
- D - I - 0x02B944 20:B934: 0F        .byte $0F	; <そ>
- D - I - 0x02B945 20:B935: 31        .byte $31	; <ゅ>
- D - I - 0x02B946 20:B936: 30        .byte $30	; <ゃ>
- D - I - 0x02B947 20:B937: 30        .byte $30	; <ゃ>
- D - I - 0x02B948 20:B938: 36        .byte $36	; <3>
- D - I - 0x02B949 20:B939: 16        .byte $16	; <に>
- D - I - 0x02B94A 20:B93A: 31        .byte $31	; <ゅ>
- D - I - 0x02B94B 20:B93B: 30        .byte $30	; <ゃ>
- D - I - 0x02B94C 20:B93C: 30        .byte $30	; <ゃ>
- D - I - 0x02B94D 20:B93D: 35        .byte $35	; <2>
- D - I - 0x02B94E 20:B93E: 37        .byte $37	; <4>
- D - I - 0x02B94F 20:B93F: 30        .byte $30	; <ゃ>
- D - I - 0x02B950 20:B940: 29        .byte $29	; <る>
- D - I - 0x02B951 20:B941: 30        .byte $30	; <ゃ>
- D - I - 0x02B952 20:B942: 35        .byte $35	; <2>
- D - I - 0x02B953 20:B943: 37        .byte $37	; <4>
- D - I - 0x02B954 20:B944: 30        .byte $30	; <ゃ>
- D - I - 0x02B955 20:B945: 29        .byte $29	; <る>
- D - I - 0x02B956 20:B946: 30        .byte $30	; <ゃ>
- D - I - 0x02B957 20:B947: 35        .byte $35	; <2>
- D - I - 0x02B958 20:B948: 37        .byte $37	; <4>
- D - I - 0x02B959 20:B949: 30        .byte $30	; <ゃ>
- D - I - 0x02B95A 20:B94A: 29        .byte $29	; <る>
- D - I - 0x02B95B 20:B94B: 30        .byte $30	; <ゃ>
- D - I - 0x02B95C 20:B94C: 36        .byte $36	; <3>
- D - I - 0x02B95D 20:B94D: 30        .byte $30	; <ゃ>
- D - I - 0x02B95E 20:B94E: 32        .byte $32	; <ょ>
- D - I - 0x02B95F 20:B94F: 22        .byte $22	; <め>
- D - I - 0x02B960 20:B950: 30        .byte $30	; <ゃ>
- D - I - 0x02B961 20:B951: 36        .byte $36	; <3>
- D - I - 0x02B962 20:B952: 0F        .byte $0F	; <そ>
- D - I - 0x02B963 20:B953: 16        .byte $16	; <に>
- D - I - 0x02B964 20:B954: 30        .byte $30	; <ゃ>
- D - I - 0x02B965 20:B955: 30        .byte $30	; <ゃ>
- D - I - 0x02B966 20:B956: 36        .byte $36	; <3>
- D - I - 0x02B967 20:B957: 0F        .byte $0F	; <そ>
- D - I - 0x02B968 20:B958: 16        .byte $16	; <に>
- D - I - 0x02B969 20:B959: 30        .byte $30	; <ゃ>
- D - I - 0x02B96A 20:B95A: 30        .byte $30	; <ゃ>
- D - I - 0x02B96B 20:B95B: 36        .byte $36	; <3>
- D - I - 0x02B96C 20:B95C: 07        .byte $07	; <き>
- D - I - 0x02B96D 20:B95D: 16        .byte $16	; <に>
- D - I - 0x02B96E 20:B95E: 30        .byte $30	; <ゃ>
- D - I - 0x02B96F 20:B95F: 30        .byte $30	; <ゃ>
- D - I - 0x02B970 20:B960: 36        .byte $36	; <3>
- D - I - 0x02B971 20:B961: 17        .byte $17	; <ぬ>
- D - I - 0x02B972 20:B962: 16        .byte $16	; <に>
- D - I - 0x02B973 20:B963: 30        .byte $30	; <ゃ>
- D - I - 0x02B974 20:B964: 30        .byte $30	; <ゃ>
- D - I - 0x02B975 20:B965: 36        .byte $36	; <3>
- D - I - 0x02B976 20:B966: 15        .byte $15	; <な>
- D - I - 0x02B977 20:B967: 16        .byte $16	; <に>
- D - I - 0x02B978 20:B968: 30        .byte $30	; <ゃ>
- D - I - 0x02B979 20:B969: 30        .byte $30	; <ゃ>
- D - I - 0x02B97A 20:B96A: 36        .byte $36	; <3>
- D - I - 0x02B97B 20:B96B: 0F        .byte $0F	; <そ>
- D - I - 0x02B97C 20:B96C: 16        .byte $16	; <に>
- D - I - 0x02B97D 20:B96D: 30        .byte $30	; <ゃ>
- D - I - 0x02B97E 20:B96E: 30        .byte $30	; <ゃ>
- D - I - 0x02B97F 20:B96F: 36        .byte $36	; <3>
- D - I - 0x02B980 20:B970: 0F        .byte $0F	; <そ>
- D - I - 0x02B981 20:B971: 16        .byte $16	; <に>
- D - I - 0x02B982 20:B972: 30        .byte $30	; <ゃ>
- D - I - 0x02B983 20:B973: 30        .byte $30	; <ゃ>
- D - I - 0x02B984 20:B974: 36        .byte $36	; <3>
- D - I - 0x02B985 20:B975: 00        .byte $00
- D - I - 0x02B986 20:B976: 16        .byte $16	; <に>
- D - I - 0x02B987 20:B977: 30        .byte $30	; <ゃ>
- D - I - 0x02B988 20:B978: 30        .byte $30	; <ゃ>
- D - I - 0x02B989 20:B979: 36        .byte $36	; <3>
- D - I - 0x02B98A 20:B97A: 0F        .byte $0F	; <そ>
- D - I - 0x02B98B 20:B97B: 16        .byte $16	; <に>
- D - I - 0x02B98C 20:B97C: 30        .byte $30	; <ゃ>
- D - I - 0x02B98D 20:B97D: 30        .byte $30	; <ゃ>
- D - I - 0x02B98E 20:B97E: 36        .byte $36	; <3>
- D - I - 0x02B98F 20:B97F: 07        .byte $07	; <き>
- D - I - 0x02B990 20:B980: 16        .byte $16	; <に>
- D - I - 0x02B991 20:B981: 30        .byte $30	; <ゃ>
- D - I - 0x02B992 20:B982: 30        .byte $30	; <ゃ>
- D - I - 0x02B993 20:B983: 36        .byte $36	; <3>
- D - I - 0x02B994 20:B984: 00        .byte $00
- D - I - 0x02B995 20:B985: 16        .byte $16	; <に>
- D - I - 0x02B996 20:B986: 30        .byte $30	; <ゃ>
- D - I - 0x02B997 20:B987: 30        .byte $30	; <ゃ>
- D - I - 0x02B998 20:B988: 36        .byte $36	; <3>
- D - I - 0x02B999 20:B989: 0F        .byte $0F	; <そ>
- D - I - 0x02B99A 20:B98A: 30        .byte $30	; <ゃ>
- D - I - 0x02B99B 20:B98B: 11        .byte $11	; <ち>
- D - I - 0x02B99C 20:B98C: 30        .byte $30	; <ゃ>
- D - I - 0x02B99D 20:B98D: 36        .byte $36	; <3>
- D - I - 0x02B99E 20:B98E: 10        .byte $10	; <た>
- D - I - 0x02B99F 20:B98F: 37        .byte $37	; <4>
- D - I - 0x02B9A0 20:B990: 16        .byte $16	; <に>
- D - I - 0x02B9A1 20:B991: 30        .byte $30	; <ゃ>
- D - I - 0x02B9A2 20:B992: 36        .byte $36	; <3>
- D - I - 0x02B9A3 20:B993: 10        .byte $10	; <た>
- D - I - 0x02B9A4 20:B994: 37        .byte $37	; <4>
- D - I - 0x02B9A5 20:B995: 16        .byte $16	; <に>
- D - I - 0x02B9A6 20:B996: 30        .byte $30	; <ゃ>
- D - I - 0x02B9A7 20:B997: 36        .byte $36	; <3>
- D - I - 0x02B9A8 20:B998: 10        .byte $10	; <た>
- D - I - 0x02B9A9 20:B999: 11        .byte $11	; <ち>
- D - I - 0x02B9AA 20:B99A: 16        .byte $16	; <に>
- D - I - 0x02B9AB 20:B99B: 30        .byte $30	; <ゃ>
- D - I - 0x02B9AC 20:B99C: 36        .byte $36	; <3>
- D - I - 0x02B9AD 20:B99D: 10        .byte $10	; <た>
- D - I - 0x02B9AE 20:B99E: 11        .byte $11	; <ち>
- D - I - 0x02B9AF 20:B99F: 16        .byte $16	; <に>
- D - I - 0x02B9B0 20:B9A0: 30        .byte $30	; <ゃ>
- D - I - 0x02B9B1 20:B9A1: 35        .byte $35	; <2>
- D - I - 0x02B9B2 20:B9A2: 37        .byte $37	; <4>
- D - I - 0x02B9B3 20:B9A3: 30        .byte $30	; <ゃ>
- D - I - 0x02B9B4 20:B9A4: 16        .byte $16	; <に>
- D - I - 0x02B9B5 20:B9A5: 30        .byte $30	; <ゃ>
- D - I - 0x02B9B6 20:B9A6: 35        .byte $35	; <2>
- D - I - 0x02B9B7 20:B9A7: 0F        .byte $0F	; <そ>
- D - I - 0x02B9B8 20:B9A8: 29        .byte $29	; <る>
- D - I - 0x02B9B9 20:B9A9: 16        .byte $16	; <に>
- D - I - 0x02B9BA 20:B9AA: 30        .byte $30	; <ゃ>
- D - I - 0x02B9BB 20:B9AB: 36        .byte $36	; <3>
- D - I - 0x02B9BC 20:B9AC: 26        .byte $26	; <よ>
- D - I - 0x02B9BD 20:B9AD: 37        .byte $37	; <4>
- D - I - 0x02B9BE 20:B9AE: 37        .byte $37	; <4>
- D - I - 0x02B9BF 20:B9AF: 30        .byte $30	; <ゃ>
- D - I - 0x02B9C0 20:B9B0: 36        .byte $36	; <3>
- D - I - 0x02B9C1 20:B9B1: 26        .byte $26	; <よ>
- D - I - 0x02B9C2 20:B9B2: 37        .byte $37	; <4>
- D - I - 0x02B9C3 20:B9B3: 37        .byte $37	; <4>
- D - I - 0x02B9C4 20:B9B4: 30        .byte $30	; <ゃ>
- D - I - 0x02B9C5 20:B9B5: 35        .byte $35	; <2>
- D - I - 0x02B9C6 20:B9B6: 16        .byte $16	; <に>
- D - I - 0x02B9C7 20:B9B7: 30        .byte $30	; <ゃ>
- D - I - 0x02B9C8 20:B9B8: 26        .byte $26	; <よ>
- D - I - 0x02B9C9 20:B9B9: 30        .byte $30	; <ゃ>
- D - I - 0x02B9CA 20:B9BA: 36        .byte $36	; <3>
- D - I - 0x02B9CB 20:B9BB: 25        .byte $25	; <ゆ>
- D - I - 0x02B9CC 20:B9BC: 10        .byte $10	; <た>
- D - I - 0x02B9CD 20:B9BD: 00        .byte $00
- D - I - 0x02B9CE 20:B9BE: 30        .byte $30	; <ゃ>
- D - I - 0x02B9CF 20:B9BF: 35        .byte $35	; <2>
- D - I - 0x02B9D0 20:B9C0: 37        .byte $37	; <4>
- D - I - 0x02B9D1 20:B9C1: 11        .byte $11	; <ち>
- D - I - 0x02B9D2 20:B9C2: 30        .byte $30	; <ゃ>
- D - I - 0x02B9D3 20:B9C3: 30        .byte $30	; <ゃ>
- D - I - 0x02B9D4 20:B9C4: 35        .byte $35	; <2>
- D - I - 0x02B9D5 20:B9C5: 37        .byte $37	; <4>
- D - I - 0x02B9D6 20:B9C6: 11        .byte $11	; <ち>
- D - I - 0x02B9D7 20:B9C7: 30        .byte $30	; <ゃ>
- D - I - 0x02B9D8 20:B9C8: 30        .byte $30	; <ゃ>
- D - I - 0x02B9D9 20:B9C9: 36        .byte $36	; <3>
- D - I - 0x02B9DA 20:B9CA: 26        .byte $26	; <よ>
- D - I - 0x02B9DB 20:B9CB: 29        .byte $29	; <る>
- D - I - 0x02B9DC 20:B9CC: 16        .byte $16	; <に>
- D - I - 0x02B9DD 20:B9CD: 30        .byte $30	; <ゃ>
- D - I - 0x02B9DE 20:B9CE: 36        .byte $36	; <3>
- D - I - 0x02B9DF 20:B9CF: 11        .byte $11	; <ち>
- D - I - 0x02B9E0 20:B9D0: 30        .byte $30	; <ゃ>
- D - I - 0x02B9E1 20:B9D1: 11        .byte $11	; <ち>
- D - I - 0x02B9E2 20:B9D2: 30        .byte $30	; <ゃ>
- D - I - 0x02B9E3 20:B9D3: 35        .byte $35	; <2>
- D - I - 0x02B9E4 20:B9D4: 37        .byte $37	; <4>
- D - I - 0x02B9E5 20:B9D5: 00        .byte $00
- D - I - 0x02B9E6 20:B9D6: 10        .byte $10	; <た>
- D - I - 0x02B9E7 20:B9D7: 30        .byte $30	; <ゃ>
- D - I - 0x02B9E8 20:B9D8: 36        .byte $36	; <3>
- D - I - 0x02B9E9 20:B9D9: 0F        .byte $0F	; <そ>
- D - I - 0x02B9EA 20:B9DA: 26        .byte $26	; <よ>
- D - I - 0x02B9EB 20:B9DB: 30        .byte $30	; <ゃ>
- D - I - 0x02B9EC 20:B9DC: 30        .byte $30	; <ゃ>
- D - I - 0x02B9ED 20:B9DD: 15        .byte $15	; <な>
- D - I - 0x02B9EE 20:B9DE: 10        .byte $10	; <た>
- D - I - 0x02B9EF 20:B9DF: 26        .byte $26	; <よ>
- D - I - 0x02B9F0 20:B9E0: 30        .byte $30	; <ゃ>
- D - I - 0x02B9F1 20:B9E1: 30        .byte $30	; <ゃ>
- D - I - 0x02B9F2 20:B9E2: 35        .byte $35	; <2>
- D - I - 0x02B9F3 20:B9E3: 17        .byte $17	; <ぬ>
- D - I - 0x02B9F4 20:B9E4: 31        .byte $31	; <ゅ>
- D - I - 0x02B9F5 20:B9E5: 0F        .byte $0F	; <そ>
- D - I - 0x02B9F6 20:B9E6: 30        .byte $30	; <ゃ>
- D - I - 0x02B9F7 20:B9E7: 35        .byte $35	; <2>
- D - I - 0x02B9F8 20:B9E8: 00        .byte $00
- D - I - 0x02B9F9 20:B9E9: 31        .byte $31	; <ゅ>
- D - I - 0x02B9FA 20:B9EA: 0F        .byte $0F	; <そ>
- D - I - 0x02B9FB 20:B9EB: 30        .byte $30	; <ゃ>
- D - I - 0x02B9FC 20:B9EC: 35        .byte $35	; <2>
- D - I - 0x02B9FD 20:B9ED: 0F        .byte $0F	; <そ>
- D - I - 0x02B9FE 20:B9EE: 31        .byte $31	; <ゅ>
- D - I - 0x02B9FF 20:B9EF: 0F        .byte $0F	; <そ>
- D - I - 0x02BA00 20:B9F0: 30        .byte $30	; <ゃ>
- D - I - 0x02BA01 20:B9F1: 35        .byte $35	; <2>
- D - I - 0x02BA02 20:B9F2: 16        .byte $16	; <に>
- D - I - 0x02BA03 20:B9F3: 31        .byte $31	; <ゅ>
- D - I - 0x02BA04 20:B9F4: 0F        .byte $0F	; <そ>
- D - I - 0x02BA05 20:B9F5: 30        .byte $30	; <ゃ>
- D - I - 0x02BA06 20:B9F6: 35        .byte $35	; <2>
- D - I - 0x02BA07 20:B9F7: 00        .byte $00
- D - I - 0x02BA08 20:B9F8: 31        .byte $31	; <ゅ>
- D - I - 0x02BA09 20:B9F9: 0F        .byte $0F	; <そ>
- D - I - 0x02BA0A 20:B9FA: 30        .byte $30	; <ゃ>
- D - I - 0x02BA0B 20:B9FB: 35        .byte $35	; <2>
- D - I - 0x02BA0C 20:B9FC: 37        .byte $37	; <4>
- D - I - 0x02BA0D 20:B9FD: 30        .byte $30	; <ゃ>
- D - I - 0x02BA0E 20:B9FE: 0F        .byte $0F	; <そ>
- D - I - 0x02BA0F 20:B9FF: 30        .byte $30	; <ゃ>
- D - I - 0x02BA10 20:BA00: 35        .byte $35	; <2>
- D - I - 0x02BA11 20:BA01: 37        .byte $37	; <4>
- D - I - 0x02BA12 20:BA02: 30        .byte $30	; <ゃ>
- D - I - 0x02BA13 20:BA03: 0F        .byte $0F	; <そ>
- D - I - 0x02BA14 20:BA04: 30        .byte $30	; <ゃ>
- D - I - 0x02BA15 20:BA05: 35        .byte $35	; <2>
- D - I - 0x02BA16 20:BA06: 37        .byte $37	; <4>
- D - I - 0x02BA17 20:BA07: 30        .byte $30	; <ゃ>
- D - I - 0x02BA18 20:BA08: 0F        .byte $0F	; <そ>
- D - I - 0x02BA19 20:BA09: 30        .byte $30	; <ゃ>
- D - I - 0x02BA1A 20:BA0A: 35        .byte $35	; <2>
- D - I - 0x02BA1B 20:BA0B: 37        .byte $37	; <4>
- D - I - 0x02BA1C 20:BA0C: 30        .byte $30	; <ゃ>
- D - I - 0x02BA1D 20:BA0D: 0F        .byte $0F	; <そ>
- D - I - 0x02BA1E 20:BA0E: 30        .byte $30	; <ゃ>
- D - I - 0x02BA1F 20:BA0F: 35        .byte $35	; <2>
- D - I - 0x02BA20 20:BA10: 37        .byte $37	; <4>
- D - I - 0x02BA21 20:BA11: 30        .byte $30	; <ゃ>
- D - I - 0x02BA22 20:BA12: 0F        .byte $0F	; <そ>
- D - I - 0x02BA23 20:BA13: 30        .byte $30	; <ゃ>
- D - I - 0x02BA24 20:BA14: 35        .byte $35	; <2>
- D - I - 0x02BA25 20:BA15: 37        .byte $37	; <4>
- D - I - 0x02BA26 20:BA16: 30        .byte $30	; <ゃ>
- D - I - 0x02BA27 20:BA17: 0F        .byte $0F	; <そ>
- D - I - 0x02BA28 20:BA18: 30        .byte $30	; <ゃ>
- D - I - 0x02BA29 20:BA19: 35        .byte $35	; <2>
- D - I - 0x02BA2A 20:BA1A: 37        .byte $37	; <4>
- D - I - 0x02BA2B 20:BA1B: 00        .byte $00
- D - I - 0x02BA2C 20:BA1C: 16        .byte $16	; <に>
- D - I - 0x02BA2D 20:BA1D: 30        .byte $30	; <ゃ>
- D - I - 0x02BA2E 20:BA1E: 26        .byte $26	; <よ>
- D - I - 0x02BA2F 20:BA1F: 27        .byte $27	; <ら>
- D - I - 0x02BA30 20:BA20: 37        .byte $37	; <4>
- D - I - 0x02BA31 20:BA21: 11        .byte $11	; <ち>
- D - I - 0x02BA32 20:BA22: 30        .byte $30	; <ゃ>
- D - I - 0x02BA33 20:BA23: 15        .byte $15	; <な>
- D - I - 0x02BA34 20:BA24: 37        .byte $37	; <4>
- D - I - 0x02BA35 20:BA25: 37        .byte $37	; <4>
- D - I - 0x02BA36 20:BA26: 11        .byte $11	; <ち>
- D - I - 0x02BA37 20:BA27: 30        .byte $30	; <ゃ>
- D - I - 0x02BA38 20:BA28: 15        .byte $15	; <な>
- D - I - 0x02BA39 20:BA29: 00        .byte $00
- D - I - 0x02BA3A 20:BA2A: 37        .byte $37	; <4>
- D - I - 0x02BA3B 20:BA2B: 11        .byte $11	; <ち>
- D - I - 0x02BA3C 20:BA2C: 30        .byte $30	; <ゃ>
- D - I - 0x02BA3D 20:BA2D: 26        .byte $26	; <よ>
- D - I - 0x02BA3E 20:BA2E: 00        .byte $00
- D - I - 0x02BA3F 20:BA2F: 37        .byte $37	; <4>
- D - I - 0x02BA40 20:BA30: 11        .byte $11	; <ち>
- D - I - 0x02BA41 20:BA31: 30        .byte $30	; <ゃ>
- D - I - 0x02BA42 20:BA32: 35        .byte $35	; <2>
- D - I - 0x02BA43 20:BA33: 37        .byte $37	; <4>
- D - I - 0x02BA44 20:BA34: 37        .byte $37	; <4>
- D - I - 0x02BA45 20:BA35: 11        .byte $11	; <ち>
- D - I - 0x02BA46 20:BA36: 30        .byte $30	; <ゃ>
- D - I - 0x02BA47 20:BA37: 35        .byte $35	; <2>
- D - I - 0x02BA48 20:BA38: 00        .byte $00
- D - I - 0x02BA49 20:BA39: 37        .byte $37	; <4>
- D - I - 0x02BA4A 20:BA3A: 11        .byte $11	; <ち>
- D - I - 0x02BA4B 20:BA3B: 30        .byte $30	; <ゃ>
- D - I - 0x02BA4C 20:BA3C: 15        .byte $15	; <な>
- D - I - 0x02BA4D 20:BA3D: 37        .byte $37	; <4>
- D - I - 0x02BA4E 20:BA3E: 37        .byte $37	; <4>
- D - I - 0x02BA4F 20:BA3F: 11        .byte $11	; <ち>
- D - I - 0x02BA50 20:BA40: 30        .byte $30	; <ゃ>
- D - I - 0x02BA51 20:BA41: 15        .byte $15	; <な>
- D - I - 0x02BA52 20:BA42: 0F        .byte $0F	; <そ>
- D - I - 0x02BA53 20:BA43: 37        .byte $37	; <4>
- D - I - 0x02BA54 20:BA44: 11        .byte $11	; <ち>
- D - I - 0x02BA55 20:BA45: 30        .byte $30	; <ゃ>
- D - I - 0x02BA56 20:BA46: 36        .byte $36	; <3>
- D - I - 0x02BA57 20:BA47: 25        .byte $25	; <ゆ>
- D - I - 0x02BA58 20:BA48: 37        .byte $37	; <4>
- D - I - 0x02BA59 20:BA49: 11        .byte $11	; <ち>
- D - I - 0x02BA5A 20:BA4A: 30        .byte $30	; <ゃ>
- D - I - 0x02BA5B 20:BA4B: 15        .byte $15	; <な>
- D - I - 0x02BA5C 20:BA4C: 00        .byte $00
- D - I - 0x02BA5D 20:BA4D: 37        .byte $37	; <4>
- D - I - 0x02BA5E 20:BA4E: 11        .byte $11	; <ち>
- D - I - 0x02BA5F 20:BA4F: 30        .byte $30	; <ゃ>
- D - I - 0x02BA60 20:BA50: 15        .byte $15	; <な>
- D - I - 0x02BA61 20:BA51: 0F        .byte $0F	; <そ>
- D - I - 0x02BA62 20:BA52: 30        .byte $30	; <ゃ>
- D - I - 0x02BA63 20:BA53: 37        .byte $37	; <4>
- D - I - 0x02BA64 20:BA54: 30        .byte $30	; <ゃ>
- D - I - 0x02BA65 20:BA55: 26        .byte $26	; <よ>
- D - I - 0x02BA66 20:BA56: 16        .byte $16	; <に>
- D - I - 0x02BA67 20:BA57: 37        .byte $37	; <4>
- D - I - 0x02BA68 20:BA58: 11        .byte $11	; <ち>
- D - I - 0x02BA69 20:BA59: 30        .byte $30	; <ゃ>
- D - I - 0x02BA6A 20:BA5A: 36        .byte $36	; <3>
- D - I - 0x02BA6B 20:BA5B: 0F        .byte $0F	; <そ>
- D - I - 0x02BA6C 20:BA5C: 16        .byte $16	; <に>
- D - I - 0x02BA6D 20:BA5D: 30        .byte $30	; <ゃ>
- D - I - 0x02BA6E 20:BA5E: 30        .byte $30	; <ゃ>
- D - I - 0x02BA6F 20:BA5F: 36        .byte $36	; <3>
- D - I - 0x02BA70 20:BA60: 0F        .byte $0F	; <そ>
- D - I - 0x02BA71 20:BA61: 30        .byte $30	; <ゃ>
- D - I - 0x02BA72 20:BA62: 11        .byte $11	; <ち>
- D - I - 0x02BA73 20:BA63: 30        .byte $30	; <ゃ>
- - - - - 0x02BA74 20:BA64: 36        .byte $36	; <3>
- - - - - 0x02BA75 20:BA65: 0F        .byte $0F	; <そ>
- - - - - 0x02BA76 20:BA66: 16        .byte $16	; <に>
- - - - - 0x02BA77 20:BA67: 30        .byte $30	; <ゃ>
- - - - - 0x02BA78 20:BA68: 30        .byte $30	; <ゃ>
- D - I - 0x02BA79 20:BA69: 36        .byte $36	; <3>
- D - I - 0x02BA7A 20:BA6A: 17        .byte $17	; <ぬ>
- D - I - 0x02BA7B 20:BA6B: 16        .byte $16	; <に>
- D - I - 0x02BA7C 20:BA6C: 30        .byte $30	; <ゃ>
- D - I - 0x02BA7D 20:BA6D: 30        .byte $30	; <ゃ>
- - - - - 0x02BA7E 20:BA6E: 36        .byte $36	; <3>
- - - - - 0x02BA7F 20:BA6F: 0F        .byte $0F	; <そ>
- - - - - 0x02BA80 20:BA70: 16        .byte $16	; <に>
- - - - - 0x02BA81 20:BA71: 30        .byte $30	; <ゃ>
- - - - - 0x02BA82 20:BA72: 30        .byte $30	; <ゃ>
- - - - - 0x02BA83 20:BA73: 36        .byte $36	; <3>
- - - - - 0x02BA84 20:BA74: 07        .byte $07	; <き>
- - - - - 0x02BA85 20:BA75: 16        .byte $16	; <に>
- - - - - 0x02BA86 20:BA76: 30        .byte $30	; <ゃ>
- - - - - 0x02BA87 20:BA77: 30        .byte $30	; <ゃ>
- D - I - 0x02BA88 20:BA78: 36        .byte $36	; <3>
- D - I - 0x02BA89 20:BA79: 0F        .byte $0F	; <そ>
- D - I - 0x02BA8A 20:BA7A: 16        .byte $16	; <に>
- D - I - 0x02BA8B 20:BA7B: 30        .byte $30	; <ゃ>
- D - I - 0x02BA8C 20:BA7C: 30        .byte $30	; <ゃ>
- D - I - 0x02BA8D 20:BA7D: 36        .byte $36	; <3>
- D - I - 0x02BA8E 20:BA7E: 0F        .byte $0F	; <そ>
- D - I - 0x02BA8F 20:BA7F: 16        .byte $16	; <に>
- D - I - 0x02BA90 20:BA80: 30        .byte $30	; <ゃ>
- D - I - 0x02BA91 20:BA81: 30        .byte $30	; <ゃ>
- D - I - 0x02BA92 20:BA82: 36        .byte $36	; <3>
- D - I - 0x02BA93 20:BA83: 00        .byte $00
- D - I - 0x02BA94 20:BA84: 16        .byte $16	; <に>
- D - I - 0x02BA95 20:BA85: 30        .byte $30	; <ゃ>
- D - I - 0x02BA96 20:BA86: 30        .byte $30	; <ゃ>



tbl_BA87:
- D - - - 0x02BA97 20:BA87: 31        .byte $31	; <ゅ>
- D - - - 0x02BA98 20:BA88: 30        .byte $30	; <ゃ>

- D - - - 0x02BA99 20:BA89: 31        .byte $31	; <ゅ>
- D - - - 0x02BA9A 20:BA8A: 30        .byte $30	; <ゃ>

- D - - - 0x02BA9B 20:BA8B: 06        .byte $06	; <か>
- D - - - 0x02BA9C 20:BA8C: 15        .byte $15	; <な>

- D - - - 0x02BA9D 20:BA8D: 22        .byte $22	; <め>
- D - - - 0x02BA9E 20:BA8E: 32        .byte $32	; <ょ>

- D - - - 0x02BA9F 20:BA8F: 14        .byte $14	; <と>
- D - - - 0x02BAA0 20:BA90: 24        .byte $24	; <や>

- D - - - 0x02BAA1 20:BA91: 1C        .byte $1C	; <ふ>
- D - - - 0x02BAA2 20:BA92: 2C        .byte $2C	; <わ>

- D - - - 0x02BAA3 20:BA93: 19        .byte $19	; <の>
- D - - - 0x02BAA4 20:BA94: 3A        .byte $3A	; <7>

- D - - - 0x02BAA5 20:BA95: 00        .byte $00
- D - - - 0x02BAA6 20:BA96: 10        .byte $10	; <た>

- D - - - 0x02BAA7 20:BA97: 06        .byte $06	; <か>
- D - - - 0x02BAA8 20:BA98: 15        .byte $15	; <な>

- D - - - 0x02BAA9 20:BA99: 11        .byte $11	; <ち>
- D - - - 0x02BAAA 20:BA9A: 21        .byte $21	; <む>

- D - - - 0x02BAAB 20:BA9B: 09        .byte $09	; <け>
- D - - - 0x02BAAC 20:BA9C: 19        .byte $19	; <の>

- D - - - 0x02BAAD 20:BA9D: 12        .byte $12	; <つ>
- D - - - 0x02BAAE 20:BA9E: 22        .byte $22	; <め>

- D - - - 0x02BAAF 20:BA9F: 31        .byte $31	; <ゅ>
- D - - - 0x02BAB0 20:BAA0: 30        .byte $30	; <ゃ>

- D - - - 0x02BAB1 20:BAA1: 27        .byte $27	; <ら>
- D - - - 0x02BAB2 20:BAA2: 37        .byte $37	; <4>

- D - - - 0x02BAB3 20:BAA3: 00        .byte $00
- D - - - 0x02BAB4 20:BAA4: 10        .byte $10	; <た>

- D - - - 0x02BAB5 20:BAA5: 06        .byte $06	; <か>
- D - - - 0x02BAB6 20:BAA6: 15        .byte $15	; <な>

- D - - - 0x02BAB7 20:BAA7: 32        .byte $32	; <ょ>
- D - - - 0x02BAB8 20:BAA8: 31        .byte $31	; <ゅ>

- D - - - 0x02BAB9 20:BAA9: 31        .byte $31	; <ゅ>
- D - - - 0x02BABA 20:BAAA: 30        .byte $30	; <ゃ>

- D - - - 0x02BABB 20:BAAB: 06        .byte $06	; <か>
- D - - - 0x02BABC 20:BAAC: 15        .byte $15	; <な>

- D - - - 0x02BABD 20:BAAD: 23        .byte $23	; <も>
- D - - - 0x02BABE 20:BAAE: 33        .byte $33	; <0>

- D - - - 0x02BABF 20:BAAF: 27        .byte $27	; <ら>
- D - - - 0x02BAC0 20:BAB0: 37        .byte $37	; <4>

- D - - - 0x02BAC1 20:BAB1: 19        .byte $19	; <の>
- D - - - 0x02BAC2 20:BAB2: 3A        .byte $3A	; <7>

- D - - - 0x02BAC3 20:BAB3: 26        .byte $26	; <よ>
- D - - - 0x02BAC4 20:BAB4: 27        .byte $27	; <ら>

- D - - - 0x02BAC5 20:BAB5: 11        .byte $11	; <ち>
- D - - - 0x02BAC6 20:BAB6: 21        .byte $21	; <む>

- D - - - 0x02BAC7 20:BAB7: 11        .byte $11	; <ち>
- D - - - 0x02BAC8 20:BAB8: 21        .byte $21	; <む>

- D - - - 0x02BAC9 20:BAB9: 31        .byte $31	; <ゅ>
- D - - - 0x02BACA 20:BABA: 30        .byte $30	; <ゃ>

- D - - - 0x02BACB 20:BABB: 31        .byte $31	; <ゅ>
- D - - - 0x02BACC 20:BABC: 30        .byte $30	; <ゃ>

- D - - - 0x02BACD 20:BABD: 27        .byte $27	; <ら>
- D - - - 0x02BACE 20:BABE: 37        .byte $37	; <4>

- D - - - 0x02BACF 20:BABF: 31        .byte $31	; <ゅ>
- D - - - 0x02BAD0 20:BAC0: 30        .byte $30	; <ゃ>

- D - - - 0x02BAD1 20:BAC1: 11        .byte $11	; <ち>
- D - - - 0x02BAD2 20:BAC2: 21        .byte $21	; <む>

- D - - - 0x02BAD3 20:BAC3: 19        .byte $19	; <の>
- D - - - 0x02BAD4 20:BAC4: 3A        .byte $3A	; <7>

- D - - - 0x02BAD5 20:BAC5: 31        .byte $31	; <ゅ>
- D - - - 0x02BAD6 20:BAC6: 30        .byte $30	; <ゃ>

- D - - - 0x02BAD7 20:BAC7: 16        .byte $16	; <に>
- D - - - 0x02BAD8 20:BAC8: 26        .byte $26	; <よ>

- D - - - 0x02BAD9 20:BAC9: 32        .byte $32	; <ょ>
- D - - - 0x02BADA 20:BACA: 31        .byte $31	; <ゅ>

- D - - - 0x02BADB 20:BACB: 31        .byte $31	; <ゅ>
- D - - - 0x02BADC 20:BACC: 30        .byte $30	; <ゃ>

- D - - - 0x02BADD 20:BACD: 27        .byte $27	; <ら>
- D - - - 0x02BADE 20:BACE: 37        .byte $37	; <4>



tbl_BACF:
- D - I - 0x02BADF 20:BACF: 36        .byte $36	; <3>
- D - I - 0x02BAE0 20:BAD0: 27        .byte $27	; <ら>
- D - I - 0x02BAE1 20:BAD1: 36        .byte $36	; <3>
- D - I - 0x02BAE2 20:BAD2: 30        .byte $30	; <ゃ>
- D - I - 0x02BAE3 20:BAD3: 30        .byte $30	; <ゃ>
- D - I - 0x02BAE4 20:BAD4: 27        .byte $27	; <ら>
- D - I - 0x02BAE5 20:BAD5: 0F        .byte $0F	; <そ>
- D - I - 0x02BAE6 20:BAD6: 17        .byte $17	; <ぬ>
- D - I - 0x02BAE7 20:BAD7: 00        .byte $00
- D - I - 0x02BAE8 20:BAD8: 30        .byte $30	; <ゃ>
- D - I - 0x02BAE9 20:BAD9: 31        .byte $31	; <ゅ>
- D - I - 0x02BAEA 20:BADA: 30        .byte $30	; <ゃ>
- D - I - 0x02BAEB 20:BADB: 37        .byte $37	; <4>
- D - I - 0x02BAEC 20:BADC: 30        .byte $30	; <ゃ>
- D - I - 0x02BAED 20:BADD: 37        .byte $37	; <4>
- - - - - 0x02BAEE 20:BADE: 00        .byte $00
- D - I - 0x02BAEF 20:BADF: 36        .byte $36	; <3>
- D - I - 0x02BAF0 20:BAE0: 27        .byte $27	; <ら>
- D - I - 0x02BAF1 20:BAE1: 36        .byte $36	; <3>
- D - I - 0x02BAF2 20:BAE2: 30        .byte $30	; <ゃ>
- D - I - 0x02BAF3 20:BAE3: 30        .byte $30	; <ゃ>
- D - I - 0x02BAF4 20:BAE4: 27        .byte $27	; <ら>
- D - I - 0x02BAF5 20:BAE5: 0F        .byte $0F	; <そ>
- D - I - 0x02BAF6 20:BAE6: 17        .byte $17	; <ぬ>
- D - I - 0x02BAF7 20:BAE7: 00        .byte $00
- D - I - 0x02BAF8 20:BAE8: 15        .byte $15	; <な>
- D - I - 0x02BAF9 20:BAE9: 06        .byte $06	; <か>
- D - I - 0x02BAFA 20:BAEA: 15        .byte $15	; <な>
- D - I - 0x02BAFB 20:BAEB: 37        .byte $37	; <4>
- D - I - 0x02BAFC 20:BAEC: 30        .byte $30	; <ゃ>
- D - I - 0x02BAFD 20:BAED: 37        .byte $37	; <4>
- - - - - 0x02BAFE 20:BAEE: 00        .byte $00
- D - I - 0x02BAFF 20:BAEF: 26        .byte $26	; <よ>
- D - I - 0x02BB00 20:BAF0: 17        .byte $17	; <ぬ>
- D - I - 0x02BB01 20:BAF1: 00        .byte $00
- D - I - 0x02BB02 20:BAF2: 17        .byte $17	; <ぬ>
- D - I - 0x02BB03 20:BAF3: 30        .byte $30	; <ゃ>
- D - I - 0x02BB04 20:BAF4: 11        .byte $11	; <ち>
- D - I - 0x02BB05 20:BAF5: 0F        .byte $0F	; <そ>
- D - I - 0x02BB06 20:BAF6: 26        .byte $26	; <よ>
- D - I - 0x02BB07 20:BAF7: 30        .byte $30	; <ゃ>
- D - I - 0x02BB08 20:BAF8: 26        .byte $26	; <よ>
- D - I - 0x02BB09 20:BAF9: 17        .byte $17	; <ぬ>
- D - I - 0x02BB0A 20:BAFA: 37        .byte $37	; <4>
- D - I - 0x02BB0B 20:BAFB: 16        .byte $16	; <に>
- D - I - 0x02BB0C 20:BAFC: 37        .byte $37	; <4>
- D - I - 0x02BB0D 20:BAFD: 30        .byte $30	; <ゃ>
- - - - - 0x02BB0E 20:BAFE: 00        .byte $00
- D - I - 0x02BB0F 20:BAFF: 36        .byte $36	; <3>
- D - I - 0x02BB10 20:BB00: 27        .byte $27	; <ら>
- D - I - 0x02BB11 20:BB01: 30        .byte $30	; <ゃ>
- D - I - 0x02BB12 20:BB02: 27        .byte $27	; <ら>
- D - I - 0x02BB13 20:BB03: 30        .byte $30	; <ゃ>
- D - I - 0x02BB14 20:BB04: 31        .byte $31	; <ゅ>
- D - I - 0x02BB15 20:BB05: 0F        .byte $0F	; <そ>
- D - I - 0x02BB16 20:BB06: 30        .byte $30	; <ゃ>
- D - I - 0x02BB17 20:BB07: 36        .byte $36	; <3>
- D - I - 0x02BB18 20:BB08: 36        .byte $36	; <3>
- D - I - 0x02BB19 20:BB09: 27        .byte $27	; <ら>
- D - I - 0x02BB1A 20:BB0A: 00        .byte $00
- D - I - 0x02BB1B 20:BB0B: 16        .byte $16	; <に>
- D - I - 0x02BB1C 20:BB0C: 00        .byte $00
- D - I - 0x02BB1D 20:BB0D: 30        .byte $30	; <ゃ>
- - - - - 0x02BB1E 20:BB0E: 00        .byte $00
- D - I - 0x02BB1F 20:BB0F: 36        .byte $36	; <3>
- D - I - 0x02BB20 20:BB10: 27        .byte $27	; <ら>
- D - I - 0x02BB21 20:BB11: 30        .byte $30	; <ゃ>
- D - I - 0x02BB22 20:BB12: 27        .byte $27	; <ら>
- D - I - 0x02BB23 20:BB13: 30        .byte $30	; <ゃ>
- D - I - 0x02BB24 20:BB14: 31        .byte $31	; <ゅ>
- D - I - 0x02BB25 20:BB15: 0F        .byte $0F	; <そ>
- D - I - 0x02BB26 20:BB16: 30        .byte $30	; <ゃ>
- D - I - 0x02BB27 20:BB17: 36        .byte $36	; <3>
- D - I - 0x02BB28 20:BB18: 36        .byte $36	; <3>
- D - I - 0x02BB29 20:BB19: 27        .byte $27	; <ら>
- D - I - 0x02BB2A 20:BB1A: 11        .byte $11	; <ち>
- D - I - 0x02BB2B 20:BB1B: 16        .byte $16	; <に>
- D - I - 0x02BB2C 20:BB1C: 11        .byte $11	; <ち>
- D - I - 0x02BB2D 20:BB1D: 30        .byte $30	; <ゃ>
- - - - - 0x02BB2E 20:BB1E: 00        .byte $00
- D - I - 0x02BB2F 20:BB1F: 36        .byte $36	; <3>
- D - I - 0x02BB30 20:BB20: 27        .byte $27	; <ら>
- D - I - 0x02BB31 20:BB21: 17        .byte $17	; <ぬ>
- D - I - 0x02BB32 20:BB22: 27        .byte $27	; <ら>
- D - I - 0x02BB33 20:BB23: 36        .byte $36	; <3>
- D - I - 0x02BB34 20:BB24: 30        .byte $30	; <ゃ>
- D - I - 0x02BB35 20:BB25: 0F        .byte $0F	; <そ>
- D - I - 0x02BB36 20:BB26: 17        .byte $17	; <ぬ>
- D - I - 0x02BB37 20:BB27: 36        .byte $36	; <3>
- D - I - 0x02BB38 20:BB28: 30        .byte $30	; <ゃ>
- D - I - 0x02BB39 20:BB29: 31        .byte $31	; <ゅ>
- D - I - 0x02BB3A 20:BB2A: 30        .byte $30	; <ゃ>
- D - I - 0x02BB3B 20:BB2B: 37        .byte $37	; <4>
- D - I - 0x02BB3C 20:BB2C: 30        .byte $30	; <ゃ>
- D - I - 0x02BB3D 20:BB2D: 37        .byte $37	; <4>
- - - - - 0x02BB3E 20:BB2E: 00        .byte $00
- D - I - 0x02BB3F 20:BB2F: 36        .byte $36	; <3>
- D - I - 0x02BB40 20:BB30: 27        .byte $27	; <ら>
- D - I - 0x02BB41 20:BB31: 17        .byte $17	; <ぬ>
- D - I - 0x02BB42 20:BB32: 27        .byte $27	; <ら>
- D - I - 0x02BB43 20:BB33: 36        .byte $36	; <3>
- D - I - 0x02BB44 20:BB34: 30        .byte $30	; <ゃ>
- D - I - 0x02BB45 20:BB35: 0F        .byte $0F	; <そ>
- D - I - 0x02BB46 20:BB36: 17        .byte $17	; <ぬ>
- D - I - 0x02BB47 20:BB37: 36        .byte $36	; <3>
- D - I - 0x02BB48 20:BB38: 15        .byte $15	; <な>
- D - I - 0x02BB49 20:BB39: 06        .byte $06	; <か>
- D - I - 0x02BB4A 20:BB3A: 15        .byte $15	; <な>
- D - I - 0x02BB4B 20:BB3B: 37        .byte $37	; <4>
- D - I - 0x02BB4C 20:BB3C: 30        .byte $30	; <ゃ>
- D - I - 0x02BB4D 20:BB3D: 37        .byte $37	; <4>
- - - - - 0x02BB4E 20:BB3E: 00        .byte $00
- D - I - 0x02BB4F 20:BB3F: 36        .byte $36	; <3>
- D - I - 0x02BB50 20:BB40: 27        .byte $27	; <ら>
- D - I - 0x02BB51 20:BB41: 36        .byte $36	; <3>
- D - I - 0x02BB52 20:BB42: 30        .byte $30	; <ゃ>
- D - I - 0x02BB53 20:BB43: 30        .byte $30	; <ゃ>
- D - I - 0x02BB54 20:BB44: 27        .byte $27	; <ら>
- D - I - 0x02BB55 20:BB45: 0F        .byte $0F	; <そ>
- D - I - 0x02BB56 20:BB46: 17        .byte $17	; <ぬ>
- D - I - 0x02BB57 20:BB47: 00        .byte $00
- D - I - 0x02BB58 20:BB48: 30        .byte $30	; <ゃ>
- D - I - 0x02BB59 20:BB49: 31        .byte $31	; <ゅ>
- D - I - 0x02BB5A 20:BB4A: 30        .byte $30	; <ゃ>
- D - I - 0x02BB5B 20:BB4B: 37        .byte $37	; <4>
- D - I - 0x02BB5C 20:BB4C: 30        .byte $30	; <ゃ>
- D - I - 0x02BB5D 20:BB4D: 37        .byte $37	; <4>
- - - - - 0x02BB5E 20:BB4E: 00        .byte $00
- D - I - 0x02BB5F 20:BB4F: 31        .byte $31	; <ゅ>
- D - I - 0x02BB60 20:BB50: 30        .byte $30	; <ゃ>
- D - I - 0x02BB61 20:BB51: 36        .byte $36	; <3>
- D - I - 0x02BB62 20:BB52: 26        .byte $26	; <よ>
- D - I - 0x02BB63 20:BB53: 30        .byte $30	; <ゃ>
- D - I - 0x02BB64 20:BB54: 31        .byte $31	; <ゅ>
- D - I - 0x02BB65 20:BB55: 00        .byte $00
- D - I - 0x02BB66 20:BB56: 00        .byte $00
- D - I - 0x02BB67 20:BB57: 00        .byte $00
- D - I - 0x02BB68 20:BB58: 25        .byte $25	; <ゆ>
- D - I - 0x02BB69 20:BB59: 30        .byte $30	; <ゃ>
- D - I - 0x02BB6A 20:BB5A: 31        .byte $31	; <ゅ>
- D - I - 0x02BB6B 20:BB5B: 30        .byte $30	; <ゃ>
- D - I - 0x02BB6C 20:BB5C: 10        .byte $10	; <た>
- D - I - 0x02BB6D 20:BB5D: 30        .byte $30	; <ゃ>
- - - - - 0x02BB6E 20:BB5E: 30        .byte $30	; <ゃ>
- D - I - 0x02BB6F 20:BB5F: 36        .byte $36	; <3>
- D - I - 0x02BB70 20:BB60: 27        .byte $27	; <ら>
- D - I - 0x02BB71 20:BB61: 36        .byte $36	; <3>
- D - I - 0x02BB72 20:BB62: 30        .byte $30	; <ゃ>
- D - I - 0x02BB73 20:BB63: 30        .byte $30	; <ゃ>
- D - I - 0x02BB74 20:BB64: 27        .byte $27	; <ら>
- D - I - 0x02BB75 20:BB65: 0F        .byte $0F	; <そ>
- D - I - 0x02BB76 20:BB66: 17        .byte $17	; <ぬ>
- D - I - 0x02BB77 20:BB67: 00        .byte $00
- D - I - 0x02BB78 20:BB68: 15        .byte $15	; <な>
- D - I - 0x02BB79 20:BB69: 06        .byte $06	; <か>
- D - I - 0x02BB7A 20:BB6A: 15        .byte $15	; <な>
- D - I - 0x02BB7B 20:BB6B: 37        .byte $37	; <4>
- D - I - 0x02BB7C 20:BB6C: 30        .byte $30	; <ゃ>
- D - I - 0x02BB7D 20:BB6D: 37        .byte $37	; <4>
- - - - - 0x02BB7E 20:BB6E: 00        .byte $00
- D - I - 0x02BB7F 20:BB6F: 06        .byte $06	; <か>
- D - I - 0x02BB80 20:BB70: 15        .byte $15	; <な>
- D - I - 0x02BB81 20:BB71: 36        .byte $36	; <3>
- D - I - 0x02BB82 20:BB72: 26        .byte $26	; <よ>
- D - I - 0x02BB83 20:BB73: 30        .byte $30	; <ゃ>
- D - I - 0x02BB84 20:BB74: 31        .byte $31	; <ゅ>
- D - I - 0x02BB85 20:BB75: 00        .byte $00
- D - I - 0x02BB86 20:BB76: 00        .byte $00
- D - I - 0x02BB87 20:BB77: 00        .byte $00
- D - I - 0x02BB88 20:BB78: 25        .byte $25	; <ゆ>
- D - I - 0x02BB89 20:BB79: 30        .byte $30	; <ゃ>
- D - I - 0x02BB8A 20:BB7A: 31        .byte $31	; <ゅ>
- D - I - 0x02BB8B 20:BB7B: 30        .byte $30	; <ゃ>
- D - I - 0x02BB8C 20:BB7C: 10        .byte $10	; <た>
- D - I - 0x02BB8D 20:BB7D: 30        .byte $30	; <ゃ>
- - - - - 0x02BB8E 20:BB7E: 30        .byte $30	; <ゃ>
- D - I - 0x02BB8F 20:BB7F: 36        .byte $36	; <3>
- D - I - 0x02BB90 20:BB80: 27        .byte $27	; <ら>
- D - I - 0x02BB91 20:BB81: 0F        .byte $0F	; <そ>
- D - I - 0x02BB92 20:BB82: 27        .byte $27	; <ら>
- D - I - 0x02BB93 20:BB83: 36        .byte $36	; <3>
- D - I - 0x02BB94 20:BB84: 30        .byte $30	; <ゃ>
- D - I - 0x02BB95 20:BB85: 0F        .byte $0F	; <そ>
- D - I - 0x02BB96 20:BB86: 0F        .byte $0F	; <そ>
- D - I - 0x02BB97 20:BB87: 36        .byte $36	; <3>
- D - I - 0x02BB98 20:BB88: 30        .byte $30	; <ゃ>
- D - I - 0x02BB99 20:BB89: 31        .byte $31	; <ゅ>
- D - I - 0x02BB9A 20:BB8A: 30        .byte $30	; <ゃ>
- D - I - 0x02BB9B 20:BB8B: 37        .byte $37	; <4>
- D - I - 0x02BB9C 20:BB8C: 30        .byte $30	; <ゃ>
- D - I - 0x02BB9D 20:BB8D: 37        .byte $37	; <4>
- - - - - 0x02BB9E 20:BB8E: 00        .byte $00
- D - I - 0x02BB9F 20:BB8F: 36        .byte $36	; <3>
- D - I - 0x02BBA0 20:BB90: 27        .byte $27	; <ら>
- D - I - 0x02BBA1 20:BB91: 0F        .byte $0F	; <そ>
- D - I - 0x02BBA2 20:BB92: 27        .byte $27	; <ら>
- D - I - 0x02BBA3 20:BB93: 36        .byte $36	; <3>
- D - I - 0x02BBA4 20:BB94: 30        .byte $30	; <ゃ>
- D - I - 0x02BBA5 20:BB95: 0F        .byte $0F	; <そ>
- D - I - 0x02BBA6 20:BB96: 0F        .byte $0F	; <そ>
- D - I - 0x02BBA7 20:BB97: 36        .byte $36	; <3>
- D - I - 0x02BBA8 20:BB98: 15        .byte $15	; <な>
- D - I - 0x02BBA9 20:BB99: 06        .byte $06	; <か>
- D - I - 0x02BBAA 20:BB9A: 15        .byte $15	; <な>
- D - I - 0x02BBAB 20:BB9B: 37        .byte $37	; <4>
- D - I - 0x02BBAC 20:BB9C: 30        .byte $30	; <ゃ>
- D - I - 0x02BBAD 20:BB9D: 37        .byte $37	; <4>
- - - - - 0x02BBAE 20:BB9E: 00        .byte $00
- D - I - 0x02BBAF 20:BB9F: 36        .byte $36	; <3>
- D - I - 0x02BBB0 20:BBA0: 27        .byte $27	; <ら>
- D - I - 0x02BBB1 20:BBA1: 36        .byte $36	; <3>
- D - I - 0x02BBB2 20:BBA2: 30        .byte $30	; <ゃ>
- D - I - 0x02BBB3 20:BBA3: 30        .byte $30	; <ゃ>
- D - I - 0x02BBB4 20:BBA4: 27        .byte $27	; <ら>
- D - I - 0x02BBB5 20:BBA5: 0F        .byte $0F	; <そ>
- D - I - 0x02BBB6 20:BBA6: 17        .byte $17	; <ぬ>
- D - I - 0x02BBB7 20:BBA7: 00        .byte $00
- D - I - 0x02BBB8 20:BBA8: 15        .byte $15	; <な>
- D - I - 0x02BBB9 20:BBA9: 06        .byte $06	; <か>
- D - I - 0x02BBBA 20:BBAA: 15        .byte $15	; <な>
- D - I - 0x02BBBB 20:BBAB: 37        .byte $37	; <4>
- D - I - 0x02BBBC 20:BBAC: 30        .byte $30	; <ゃ>
- D - I - 0x02BBBD 20:BBAD: 37        .byte $37	; <4>
- - - - - 0x02BBBE 20:BBAE: 00        .byte $00
- - - - - 0x02BBBF 20:BBAF: 36        .byte $36	; <3>
- - - - - 0x02BBC0 20:BBB0: 27        .byte $27	; <ら>
- - - - - 0x02BBC1 20:BBB1: 36        .byte $36	; <3>
- - - - - 0x02BBC2 20:BBB2: 30        .byte $30	; <ゃ>
- - - - - 0x02BBC3 20:BBB3: 30        .byte $30	; <ゃ>
- - - - - 0x02BBC4 20:BBB4: 27        .byte $27	; <ら>
- - - - - 0x02BBC5 20:BBB5: 0F        .byte $0F	; <そ>
- - - - - 0x02BBC6 20:BBB6: 17        .byte $17	; <ぬ>
- - - - - 0x02BBC7 20:BBB7: 00        .byte $00
- - - - - 0x02BBC8 20:BBB8: 15        .byte $15	; <な>
- - - - - 0x02BBC9 20:BBB9: 06        .byte $06	; <か>
- - - - - 0x02BBCA 20:BBBA: 15        .byte $15	; <な>
- - - - - 0x02BBCB 20:BBBB: 37        .byte $37	; <4>
- - - - - 0x02BBCC 20:BBBC: 30        .byte $30	; <ゃ>
- D - I - 0x02BBCD 20:BBBD: 37        .byte $37	; <4>
- D - I - 0x02BBCE 20:BBBE: 00        .byte $00
- D - I - 0x02BBCF 20:BBBF: 36        .byte $36	; <3>
- D - I - 0x02BBD0 20:BBC0: 27        .byte $27	; <ら>
- D - I - 0x02BBD1 20:BBC1: 36        .byte $36	; <3>
- D - I - 0x02BBD2 20:BBC2: 30        .byte $30	; <ゃ>
- D - I - 0x02BBD3 20:BBC3: 30        .byte $30	; <ゃ>
- D - I - 0x02BBD4 20:BBC4: 27        .byte $27	; <ら>
- D - I - 0x02BBD5 20:BBC5: 0F        .byte $0F	; <そ>
- D - I - 0x02BBD6 20:BBC6: 17        .byte $17	; <ぬ>
- D - I - 0x02BBD7 20:BBC7: 00        .byte $00
- D - I - 0x02BBD8 20:BBC8: 15        .byte $15	; <な>
- D - I - 0x02BBD9 20:BBC9: 06        .byte $06	; <か>
- D - I - 0x02BBDA 20:BBCA: 15        .byte $15	; <な>
- D - I - 0x02BBDB 20:BBCB: 37        .byte $37	; <4>
- D - I - 0x02BBDC 20:BBCC: 30        .byte $30	; <ゃ>
- D - I - 0x02BBDD 20:BBCD: 37        .byte $37	; <4>
- - - - - 0x02BBDE 20:BBCE: 00        .byte $00
- D - I - 0x02BBDF 20:BBCF: 36        .byte $36	; <3>
- D - I - 0x02BBE0 20:BBD0: 27        .byte $27	; <ら>
- D - I - 0x02BBE1 20:BBD1: 36        .byte $36	; <3>
- D - I - 0x02BBE2 20:BBD2: 30        .byte $30	; <ゃ>
- D - I - 0x02BBE3 20:BBD3: 30        .byte $30	; <ゃ>
- D - I - 0x02BBE4 20:BBD4: 27        .byte $27	; <ら>
- D - I - 0x02BBE5 20:BBD5: 0F        .byte $0F	; <そ>
- D - I - 0x02BBE6 20:BBD6: 07        .byte $07	; <き>
- D - I - 0x02BBE7 20:BBD7: 27        .byte $27	; <ら>
- D - I - 0x02BBE8 20:BBD8: 15        .byte $15	; <な>
- D - I - 0x02BBE9 20:BBD9: 06        .byte $06	; <か>
- D - I - 0x02BBEA 20:BBDA: 15        .byte $15	; <な>
- D - I - 0x02BBEB 20:BBDB: 37        .byte $37	; <4>
- D - I - 0x02BBEC 20:BBDC: 30        .byte $30	; <ゃ>
- D - I - 0x02BBED 20:BBDD: 37        .byte $37	; <4>
- - - - - 0x02BBEE 20:BBDE: 00        .byte $00
- D - I - 0x02BBEF 20:BBDF: 36        .byte $36	; <3>
- D - I - 0x02BBF0 20:BBE0: 27        .byte $27	; <ら>
- D - I - 0x02BBF1 20:BBE1: 24        .byte $24	; <や>
- D - I - 0x02BBF2 20:BBE2: 27        .byte $27	; <ら>
- D - I - 0x02BBF3 20:BBE3: 36        .byte $36	; <3>
- D - I - 0x02BBF4 20:BBE4: 30        .byte $30	; <ゃ>
- D - I - 0x02BBF5 20:BBE5: 0F        .byte $0F	; <そ>
- D - I - 0x02BBF6 20:BBE6: 00        .byte $00
- D - I - 0x02BBF7 20:BBE7: 27        .byte $27	; <ら>
- D - I - 0x02BBF8 20:BBE8: 15        .byte $15	; <な>
- D - I - 0x02BBF9 20:BBE9: 06        .byte $06	; <か>
- D - I - 0x02BBFA 20:BBEA: 15        .byte $15	; <な>
- D - I - 0x02BBFB 20:BBEB: 37        .byte $37	; <4>
- D - I - 0x02BBFC 20:BBEC: 30        .byte $30	; <ゃ>
- D - I - 0x02BBFD 20:BBED: 37        .byte $37	; <4>
- - - - - 0x02BBFE 20:BBEE: 00        .byte $00
- D - I - 0x02BBFF 20:BBEF: 36        .byte $36	; <3>
- D - I - 0x02BC00 20:BBF0: 27        .byte $27	; <ら>
- D - I - 0x02BC01 20:BBF1: 24        .byte $24	; <や>
- D - I - 0x02BC02 20:BBF2: 27        .byte $27	; <ら>
- D - I - 0x02BC03 20:BBF3: 36        .byte $36	; <3>
- D - I - 0x02BC04 20:BBF4: 30        .byte $30	; <ゃ>
- D - I - 0x02BC05 20:BBF5: 0F        .byte $0F	; <そ>
- D - I - 0x02BC06 20:BBF6: 00        .byte $00
- D - I - 0x02BC07 20:BBF7: 27        .byte $27	; <ら>
- D - I - 0x02BC08 20:BBF8: 15        .byte $15	; <な>
- D - I - 0x02BC09 20:BBF9: 06        .byte $06	; <か>
- D - I - 0x02BC0A 20:BBFA: 15        .byte $15	; <な>
- D - I - 0x02BC0B 20:BBFB: 37        .byte $37	; <4>
- D - I - 0x02BC0C 20:BBFC: 30        .byte $30	; <ゃ>
- D - I - 0x02BC0D 20:BBFD: 37        .byte $37	; <4>
- - - - - 0x02BC0E 20:BBFE: 00        .byte $00
- - - - - 0x02BC0F 20:BBFF: 36        .byte $36	; <3>
- - - - - 0x02BC10 20:BC00: 27        .byte $27	; <ら>
- - - - - 0x02BC11 20:BC01: 36        .byte $36	; <3>
- - - - - 0x02BC12 20:BC02: 30        .byte $30	; <ゃ>
- - - - - 0x02BC13 20:BC03: 30        .byte $30	; <ゃ>
- - - - - 0x02BC14 20:BC04: 27        .byte $27	; <ら>
- - - - - 0x02BC15 20:BC05: 0F        .byte $0F	; <そ>
- - - - - 0x02BC16 20:BC06: 17        .byte $17	; <ぬ>
- - - - - 0x02BC17 20:BC07: 00        .byte $00
- - - - - 0x02BC18 20:BC08: 15        .byte $15	; <な>
- - - - - 0x02BC19 20:BC09: 06        .byte $06	; <か>
- - - - - 0x02BC1A 20:BC0A: 15        .byte $15	; <な>
- - - - - 0x02BC1B 20:BC0B: 37        .byte $37	; <4>
- - - - - 0x02BC1C 20:BC0C: 30        .byte $30	; <ゃ>
- - - - - 0x02BC1D 20:BC0D: 37        .byte $37	; <4>
- - - - - 0x02BC1E 20:BC0E: 00        .byte $00
- D - I - 0x02BC1F 20:BC0F: 36        .byte $36	; <3>
- D - I - 0x02BC20 20:BC10: 27        .byte $27	; <ら>
- D - I - 0x02BC21 20:BC11: 15        .byte $15	; <な>
- D - I - 0x02BC22 20:BC12: 27        .byte $27	; <ら>
- D - I - 0x02BC23 20:BC13: 36        .byte $36	; <3>
- D - I - 0x02BC24 20:BC14: 30        .byte $30	; <ゃ>
- D - I - 0x02BC25 20:BC15: 0F        .byte $0F	; <そ>
- D - I - 0x02BC26 20:BC16: 00        .byte $00
- D - I - 0x02BC27 20:BC17: 27        .byte $27	; <ら>
- D - I - 0x02BC28 20:BC18: 15        .byte $15	; <な>
- D - I - 0x02BC29 20:BC19: 06        .byte $06	; <か>
- D - I - 0x02BC2A 20:BC1A: 15        .byte $15	; <な>
- D - I - 0x02BC2B 20:BC1B: 37        .byte $37	; <4>
- D - I - 0x02BC2C 20:BC1C: 30        .byte $30	; <ゃ>
- D - I - 0x02BC2D 20:BC1D: 37        .byte $37	; <4>
- - - - - 0x02BC2E 20:BC1E: 00        .byte $00
- D - I - 0x02BC2F 20:BC1F: 36        .byte $36	; <3>
- D - I - 0x02BC30 20:BC20: 27        .byte $27	; <ら>
- D - I - 0x02BC31 20:BC21: 30        .byte $30	; <ゃ>
- D - I - 0x02BC32 20:BC22: 27        .byte $27	; <ら>
- D - I - 0x02BC33 20:BC23: 30        .byte $30	; <ゃ>
- D - I - 0x02BC34 20:BC24: 31        .byte $31	; <ゅ>
- D - I - 0x02BC35 20:BC25: 0F        .byte $0F	; <そ>
- D - I - 0x02BC36 20:BC26: 30        .byte $30	; <ゃ>
- D - I - 0x02BC37 20:BC27: 36        .byte $36	; <3>
- D - I - 0x02BC38 20:BC28: 36        .byte $36	; <3>
- D - I - 0x02BC39 20:BC29: 27        .byte $27	; <ら>
- D - I - 0x02BC3A 20:BC2A: 11        .byte $11	; <ち>
- D - I - 0x02BC3B 20:BC2B: 16        .byte $16	; <に>
- D - I - 0x02BC3C 20:BC2C: 11        .byte $11	; <ち>
- D - I - 0x02BC3D 20:BC2D: 30        .byte $30	; <ゃ>
- - - - - 0x02BC3E 20:BC2E: 00        .byte $00
- D - I - 0x02BC3F 20:BC2F: 36        .byte $36	; <3>
- D - I - 0x02BC40 20:BC30: 27        .byte $27	; <ら>
- D - I - 0x02BC41 20:BC31: 30        .byte $30	; <ゃ>
- D - I - 0x02BC42 20:BC32: 27        .byte $27	; <ら>
- D - I - 0x02BC43 20:BC33: 11        .byte $11	; <ち>
- D - I - 0x02BC44 20:BC34: 27        .byte $27	; <ら>
- D - I - 0x02BC45 20:BC35: 0F        .byte $0F	; <そ>
- D - I - 0x02BC46 20:BC36: 11        .byte $11	; <ち>
- D - I - 0x02BC47 20:BC37: 30        .byte $30	; <ゃ>
- D - I - 0x02BC48 20:BC38: 25        .byte $25	; <ゆ>
- D - I - 0x02BC49 20:BC39: 30        .byte $30	; <ゃ>
- D - I - 0x02BC4A 20:BC3A: 31        .byte $31	; <ゅ>
- D - I - 0x02BC4B 20:BC3B: 30        .byte $30	; <ゃ>
- D - I - 0x02BC4C 20:BC3C: 10        .byte $10	; <た>
- D - I - 0x02BC4D 20:BC3D: 30        .byte $30	; <ゃ>
- - - - - 0x02BC4E 20:BC3E: 30        .byte $30	; <ゃ>
- - - - - 0x02BC4F 20:BC3F: 36        .byte $36	; <3>
- - - - - 0x02BC50 20:BC40: 27        .byte $27	; <ら>
- - - - - 0x02BC51 20:BC41: 0F        .byte $0F	; <そ>
- - - - - 0x02BC52 20:BC42: 27        .byte $27	; <ら>
- - - - - 0x02BC53 20:BC43: 30        .byte $30	; <ゃ>
- - - - - 0x02BC54 20:BC44: 0F        .byte $0F	; <そ>
- - - - - 0x02BC55 20:BC45: 0F        .byte $0F	; <そ>
- - - - - 0x02BC56 20:BC46: 36        .byte $36	; <3>
- - - - - 0x02BC57 20:BC47: 30        .byte $30	; <ゃ>
- - - - - 0x02BC58 20:BC48: 36        .byte $36	; <3>
- - - - - 0x02BC59 20:BC49: 27        .byte $27	; <ら>
- - - - - 0x02BC5A 20:BC4A: 11        .byte $11	; <ち>
- - - - - 0x02BC5B 20:BC4B: 16        .byte $16	; <に>
- - - - - 0x02BC5C 20:BC4C: 11        .byte $11	; <ち>
- - - - - 0x02BC5D 20:BC4D: 30        .byte $30	; <ゃ>
- - - - - 0x02BC5E 20:BC4E: 00        .byte $00
- D - I - 0x02BC5F 20:BC4F: 35        .byte $35	; <2>
- D - I - 0x02BC60 20:BC50: 27        .byte $27	; <ら>
- D - I - 0x02BC61 20:BC51: 11        .byte $11	; <ち>
- D - I - 0x02BC62 20:BC52: 27        .byte $27	; <ら>
- D - I - 0x02BC63 20:BC53: 30        .byte $30	; <ゃ>
- D - I - 0x02BC64 20:BC54: 1A        .byte $1A	; <は>
- D - I - 0x02BC65 20:BC55: 0F        .byte $0F	; <そ>
- D - I - 0x02BC66 20:BC56: 35        .byte $35	; <2>
- D - I - 0x02BC67 20:BC57: 30        .byte $30	; <ゃ>
- D - I - 0x02BC68 20:BC58: 35        .byte $35	; <2>
- D - I - 0x02BC69 20:BC59: 26        .byte $26	; <よ>
- D - I - 0x02BC6A 20:BC5A: 22        .byte $22	; <め>
- D - I - 0x02BC6B 20:BC5B: 16        .byte $16	; <に>
- D - I - 0x02BC6C 20:BC5C: 22        .byte $22	; <め>
- D - I - 0x02BC6D 20:BC5D: 30        .byte $30	; <ゃ>
- - - - - 0x02BC6E 20:BC5E: 00        .byte $00
- D - I - 0x02BC6F 20:BC5F: 26        .byte $26	; <よ>
- D - I - 0x02BC70 20:BC60: 17        .byte $17	; <ぬ>
- D - I - 0x02BC71 20:BC61: 27        .byte $27	; <ら>
- D - I - 0x02BC72 20:BC62: 17        .byte $17	; <ぬ>
- D - I - 0x02BC73 20:BC63: 26        .byte $26	; <よ>
- D - I - 0x02BC74 20:BC64: 30        .byte $30	; <ゃ>
- D - I - 0x02BC75 20:BC65: 0F        .byte $0F	; <そ>
- D - I - 0x02BC76 20:BC66: 1A        .byte $1A	; <は>
- D - I - 0x02BC77 20:BC67: 30        .byte $30	; <ゃ>
- D - I - 0x02BC78 20:BC68: 15        .byte $15	; <な>
- D - I - 0x02BC79 20:BC69: 06        .byte $06	; <か>
- D - I - 0x02BC7A 20:BC6A: 15        .byte $15	; <な>
- D - I - 0x02BC7B 20:BC6B: 37        .byte $37	; <4>
- D - I - 0x02BC7C 20:BC6C: 30        .byte $30	; <ゃ>
- D - I - 0x02BC7D 20:BC6D: 37        .byte $37	; <4>
- - - - - 0x02BC7E 20:BC6E: 00        .byte $00
- D - I - 0x02BC7F 20:BC6F: 36        .byte $36	; <3>
- D - I - 0x02BC80 20:BC70: 27        .byte $27	; <ら>
- D - I - 0x02BC81 20:BC71: 24        .byte $24	; <や>
- D - I - 0x02BC82 20:BC72: 27        .byte $27	; <ら>
- D - I - 0x02BC83 20:BC73: 36        .byte $36	; <3>
- D - I - 0x02BC84 20:BC74: 30        .byte $30	; <ゃ>
- D - I - 0x02BC85 20:BC75: 0F        .byte $0F	; <そ>
- D - I - 0x02BC86 20:BC76: 00        .byte $00
- D - I - 0x02BC87 20:BC77: 27        .byte $27	; <ら>
- D - I - 0x02BC88 20:BC78: 22        .byte $22	; <め>
- D - I - 0x02BC89 20:BC79: 11        .byte $11	; <ち>
- D - I - 0x02BC8A 20:BC7A: 22        .byte $22	; <め>
- D - I - 0x02BC8B 20:BC7B: 37        .byte $37	; <4>
- D - I - 0x02BC8C 20:BC7C: 30        .byte $30	; <ゃ>
- D - I - 0x02BC8D 20:BC7D: 37        .byte $37	; <4>
- - - - - 0x02BC8E 20:BC7E: 00        .byte $00
- D - I - 0x02BC8F 20:BC7F: 36        .byte $36	; <3>
- D - I - 0x02BC90 20:BC80: 27        .byte $27	; <ら>
- D - I - 0x02BC91 20:BC81: 36        .byte $36	; <3>
- D - I - 0x02BC92 20:BC82: 30        .byte $30	; <ゃ>
- D - I - 0x02BC93 20:BC83: 30        .byte $30	; <ゃ>
- D - I - 0x02BC94 20:BC84: 27        .byte $27	; <ら>
- D - I - 0x02BC95 20:BC85: 0F        .byte $0F	; <そ>
- D - I - 0x02BC96 20:BC86: 17        .byte $17	; <ぬ>
- D - I - 0x02BC97 20:BC87: 00        .byte $00
- D - I - 0x02BC98 20:BC88: 29        .byte $29	; <る>
- D - I - 0x02BC99 20:BC89: 19        .byte $19	; <の>
- D - I - 0x02BC9A 20:BC8A: 29        .byte $29	; <る>
- D - I - 0x02BC9B 20:BC8B: 37        .byte $37	; <4>
- D - I - 0x02BC9C 20:BC8C: 30        .byte $30	; <ゃ>
- D - I - 0x02BC9D 20:BC8D: 37        .byte $37	; <4>
- - - - - 0x02BC9E 20:BC8E: 00        .byte $00
- - - - - 0x02BC9F 20:BC8F: 36        .byte $36	; <3>
- - - - - 0x02BCA0 20:BC90: 27        .byte $27	; <ら>
- - - - - 0x02BCA1 20:BC91: 36        .byte $36	; <3>
- - - - - 0x02BCA2 20:BC92: 30        .byte $30	; <ゃ>
- - - - - 0x02BCA3 20:BC93: 30        .byte $30	; <ゃ>
- - - - - 0x02BCA4 20:BC94: 27        .byte $27	; <ら>
- - - - - 0x02BCA5 20:BC95: 0F        .byte $0F	; <そ>
- - - - - 0x02BCA6 20:BC96: 17        .byte $17	; <ぬ>
- - - - - 0x02BCA7 20:BC97: 00        .byte $00
- - - - - 0x02BCA8 20:BC98: 29        .byte $29	; <る>
- - - - - 0x02BCA9 20:BC99: 19        .byte $19	; <の>
- - - - - 0x02BCAA 20:BC9A: 29        .byte $29	; <る>
- - - - - 0x02BCAB 20:BC9B: 37        .byte $37	; <4>
- - - - - 0x02BCAC 20:BC9C: 30        .byte $30	; <ゃ>
- - - - - 0x02BCAD 20:BC9D: 37        .byte $37	; <4>
- - - - - 0x02BCAE 20:BC9E: 00        .byte $00
- D - I - 0x02BCAF 20:BC9F: 36        .byte $36	; <3>
- D - I - 0x02BCB0 20:BCA0: 27        .byte $27	; <ら>
- D - I - 0x02BCB1 20:BCA1: 36        .byte $36	; <3>
- D - I - 0x02BCB2 20:BCA2: 30        .byte $30	; <ゃ>
- D - I - 0x02BCB3 20:BCA3: 30        .byte $30	; <ゃ>
- D - I - 0x02BCB4 20:BCA4: 27        .byte $27	; <ら>
- D - I - 0x02BCB5 20:BCA5: 0F        .byte $0F	; <そ>
- D - I - 0x02BCB6 20:BCA6: 07        .byte $07	; <き>
- D - I - 0x02BCB7 20:BCA7: 27        .byte $27	; <ら>
- D - I - 0x02BCB8 20:BCA8: 22        .byte $22	; <め>
- D - I - 0x02BCB9 20:BCA9: 12        .byte $12	; <つ>
- D - I - 0x02BCBA 20:BCAA: 22        .byte $22	; <め>
- D - I - 0x02BCBB 20:BCAB: 37        .byte $37	; <4>
- D - I - 0x02BCBC 20:BCAC: 30        .byte $30	; <ゃ>
- D - I - 0x02BCBD 20:BCAD: 37        .byte $37	; <4>
- - - - - 0x02BCBE 20:BCAE: 00        .byte $00
- D - I - 0x02BCBF 20:BCAF: 36        .byte $36	; <3>
- D - I - 0x02BCC0 20:BCB0: 27        .byte $27	; <ら>
- D - I - 0x02BCC1 20:BCB1: 15        .byte $15	; <な>
- D - I - 0x02BCC2 20:BCB2: 27        .byte $27	; <ら>
- D - I - 0x02BCC3 20:BCB3: 36        .byte $36	; <3>
- D - I - 0x02BCC4 20:BCB4: 30        .byte $30	; <ゃ>
- D - I - 0x02BCC5 20:BCB5: 0F        .byte $0F	; <そ>
- D - I - 0x02BCC6 20:BCB6: 00        .byte $00
- D - I - 0x02BCC7 20:BCB7: 27        .byte $27	; <ら>
- D - I - 0x02BCC8 20:BCB8: 30        .byte $30	; <ゃ>
- D - I - 0x02BCC9 20:BCB9: 31        .byte $31	; <ゅ>
- D - I - 0x02BCCA 20:BCBA: 30        .byte $30	; <ゃ>
- D - I - 0x02BCCB 20:BCBB: 37        .byte $37	; <4>
- D - I - 0x02BCCC 20:BCBC: 30        .byte $30	; <ゃ>
- D - I - 0x02BCCD 20:BCBD: 37        .byte $37	; <4>
- - - - - 0x02BCCE 20:BCBE: 00        .byte $00
- D - I - 0x02BCCF 20:BCBF: 36        .byte $36	; <3>
- D - I - 0x02BCD0 20:BCC0: 27        .byte $27	; <ら>
- D - I - 0x02BCD1 20:BCC1: 24        .byte $24	; <や>
- D - I - 0x02BCD2 20:BCC2: 27        .byte $27	; <ら>
- D - I - 0x02BCD3 20:BCC3: 36        .byte $36	; <3>
- D - I - 0x02BCD4 20:BCC4: 30        .byte $30	; <ゃ>
- D - I - 0x02BCD5 20:BCC5: 0F        .byte $0F	; <そ>
- D - I - 0x02BCD6 20:BCC6: 00        .byte $00
- D - I - 0x02BCD7 20:BCC7: 27        .byte $27	; <ら>
- D - I - 0x02BCD8 20:BCC8: 37        .byte $37	; <4>
- D - I - 0x02BCD9 20:BCC9: 27        .byte $27	; <ら>
- D - I - 0x02BCDA 20:BCCA: 37        .byte $37	; <4>
- D - I - 0x02BCDB 20:BCCB: 37        .byte $37	; <4>
- D - I - 0x02BCDC 20:BCCC: 30        .byte $30	; <ゃ>
- D - I - 0x02BCDD 20:BCCD: 37        .byte $37	; <4>
- - - - - 0x02BCDE 20:BCCE: 00        .byte $00
- D - I - 0x02BCDF 20:BCCF: 36        .byte $36	; <3>
- D - I - 0x02BCE0 20:BCD0: 27        .byte $27	; <ら>
- D - I - 0x02BCE1 20:BCD1: 36        .byte $36	; <3>
- D - I - 0x02BCE2 20:BCD2: 30        .byte $30	; <ゃ>
- D - I - 0x02BCE3 20:BCD3: 30        .byte $30	; <ゃ>
- D - I - 0x02BCE4 20:BCD4: 27        .byte $27	; <ら>
- D - I - 0x02BCE5 20:BCD5: 0F        .byte $0F	; <そ>
- D - I - 0x02BCE6 20:BCD6: 17        .byte $17	; <ぬ>
- D - I - 0x02BCE7 20:BCD7: 00        .byte $00
- D - I - 0x02BCE8 20:BCD8: 10        .byte $10	; <た>
- D - I - 0x02BCE9 20:BCD9: 00        .byte $00
- D - I - 0x02BCEA 20:BCDA: 10        .byte $10	; <た>
- D - I - 0x02BCEB 20:BCDB: 37        .byte $37	; <4>
- D - I - 0x02BCEC 20:BCDC: 30        .byte $30	; <ゃ>
- D - I - 0x02BCED 20:BCDD: 37        .byte $37	; <4>
- - - - - 0x02BCEE 20:BCDE: 00        .byte $00
- D - I - 0x02BCEF 20:BCDF: 36        .byte $36	; <3>
- D - I - 0x02BCF0 20:BCE0: 27        .byte $27	; <ら>
- D - I - 0x02BCF1 20:BCE1: 36        .byte $36	; <3>
- D - I - 0x02BCF2 20:BCE2: 30        .byte $30	; <ゃ>
- D - I - 0x02BCF3 20:BCE3: 30        .byte $30	; <ゃ>
- D - I - 0x02BCF4 20:BCE4: 27        .byte $27	; <ら>
- D - I - 0x02BCF5 20:BCE5: 0F        .byte $0F	; <そ>
- D - I - 0x02BCF6 20:BCE6: 17        .byte $17	; <ぬ>
- D - I - 0x02BCF7 20:BCE7: 00        .byte $00
- D - I - 0x02BCF8 20:BCE8: 10        .byte $10	; <た>
- D - I - 0x02BCF9 20:BCE9: 00        .byte $00
- D - I - 0x02BCFA 20:BCEA: 10        .byte $10	; <た>
- D - I - 0x02BCFB 20:BCEB: 37        .byte $37	; <4>
- D - I - 0x02BCFC 20:BCEC: 30        .byte $30	; <ゃ>
- D - I - 0x02BCFD 20:BCED: 37        .byte $37	; <4>
- - - - - 0x02BCFE 20:BCEE: 00        .byte $00
- - - - - 0x02BCFF 20:BCEF: 36        .byte $36	; <3>
- - - - - 0x02BD00 20:BCF0: 27        .byte $27	; <ら>
- - - - - 0x02BD01 20:BCF1: 0F        .byte $0F	; <そ>
- - - - - 0x02BD02 20:BCF2: 27        .byte $27	; <ら>
- - - - - 0x02BD03 20:BCF3: 30        .byte $30	; <ゃ>
- - - - - 0x02BD04 20:BCF4: 0F        .byte $0F	; <そ>
- - - - - 0x02BD05 20:BCF5: 0F        .byte $0F	; <そ>
- - - - - 0x02BD06 20:BCF6: 36        .byte $36	; <3>
- - - - - 0x02BD07 20:BCF7: 30        .byte $30	; <ゃ>
- - - - - 0x02BD08 20:BCF8: 36        .byte $36	; <3>
- - - - - 0x02BD09 20:BCF9: 27        .byte $27	; <ら>
- - - - - 0x02BD0A 20:BCFA: 11        .byte $11	; <ち>
- - - - - 0x02BD0B 20:BCFB: 16        .byte $16	; <に>
- - - - - 0x02BD0C 20:BCFC: 11        .byte $11	; <ち>
- - - - - 0x02BD0D 20:BCFD: 30        .byte $30	; <ゃ>
- - - - - 0x02BD0E 20:BCFE: 00        .byte $00
- D - I - 0x02BD0F 20:BCFF: 27        .byte $27	; <ら>
- D - I - 0x02BD10 20:BD00: 26        .byte $26	; <よ>
- D - I - 0x02BD11 20:BD01: 0F        .byte $0F	; <そ>
- D - I - 0x02BD12 20:BD02: 26        .byte $26	; <よ>
- D - I - 0x02BD13 20:BD03: 27        .byte $27	; <ら>
- D - I - 0x02BD14 20:BD04: 30        .byte $30	; <ゃ>
- D - I - 0x02BD15 20:BD05: 0F        .byte $0F	; <そ>
- D - I - 0x02BD16 20:BD06: 1C        .byte $1C	; <ふ>
- D - I - 0x02BD17 20:BD07: 30        .byte $30	; <ゃ>
- D - I - 0x02BD18 20:BD08: 31        .byte $31	; <ゅ>
- D - I - 0x02BD19 20:BD09: 32        .byte $32	; <ょ>
- D - I - 0x02BD1A 20:BD0A: 31        .byte $31	; <ゅ>
- D - I - 0x02BD1B 20:BD0B: 37        .byte $37	; <4>
- D - I - 0x02BD1C 20:BD0C: 30        .byte $30	; <ゃ>
- D - I - 0x02BD1D 20:BD0D: 37        .byte $37	; <4>
- - - - - 0x02BD1E 20:BD0E: 00        .byte $00
- D - I - 0x02BD1F 20:BD0F: 35        .byte $35	; <2>
- D - I - 0x02BD20 20:BD10: 27        .byte $27	; <ら>
- D - I - 0x02BD21 20:BD11: 37        .byte $37	; <4>
- D - I - 0x02BD22 20:BD12: 27        .byte $27	; <ら>
- D - I - 0x02BD23 20:BD13: 35        .byte $35	; <2>
- D - I - 0x02BD24 20:BD14: 30        .byte $30	; <ゃ>
- D - I - 0x02BD25 20:BD15: 0F        .byte $0F	; <そ>
- D - I - 0x02BD26 20:BD16: 1A        .byte $1A	; <は>
- D - I - 0x02BD27 20:BD17: 30        .byte $30	; <ゃ>
- D - I - 0x02BD28 20:BD18: 30        .byte $30	; <ゃ>
- D - I - 0x02BD29 20:BD19: 31        .byte $31	; <ゅ>
- D - I - 0x02BD2A 20:BD1A: 30        .byte $30	; <ゃ>
- D - I - 0x02BD2B 20:BD1B: 27        .byte $27	; <ら>
- D - I - 0x02BD2C 20:BD1C: 30        .byte $30	; <ゃ>
- D - I - 0x02BD2D 20:BD1D: 27        .byte $27	; <ら>
- - - - - 0x02BD2E 20:BD1E: 00        .byte $00
- - - - - 0x02BD2F 20:BD1F: 36        .byte $36	; <3>
- - - - - 0x02BD30 20:BD20: 27        .byte $27	; <ら>
- - - - - 0x02BD31 20:BD21: 30        .byte $30	; <ゃ>
- - - - - 0x02BD32 20:BD22: 27        .byte $27	; <ら>
- - - - - 0x02BD33 20:BD23: 30        .byte $30	; <ゃ>
- - - - - 0x02BD34 20:BD24: 31        .byte $31	; <ゅ>
- - - - - 0x02BD35 20:BD25: 0F        .byte $0F	; <そ>
- - - - - 0x02BD36 20:BD26: 30        .byte $30	; <ゃ>
- - - - - 0x02BD37 20:BD27: 36        .byte $36	; <3>
- - - - - 0x02BD38 20:BD28: 36        .byte $36	; <3>
- - - - - 0x02BD39 20:BD29: 27        .byte $27	; <ら>
- - - - - 0x02BD3A 20:BD2A: 22        .byte $22	; <め>
- - - - - 0x02BD3B 20:BD2B: 16        .byte $16	; <に>
- - - - - 0x02BD3C 20:BD2C: 22        .byte $22	; <め>
- - - - - 0x02BD3D 20:BD2D: 32        .byte $32	; <ょ>
- - - - - 0x02BD3E 20:BD2E: 00        .byte $00
- - - - - 0x02BD3F 20:BD2F: 36        .byte $36	; <3>
- - - - - 0x02BD40 20:BD30: 27        .byte $27	; <ら>
- - - - - 0x02BD41 20:BD31: 30        .byte $30	; <ゃ>
- - - - - 0x02BD42 20:BD32: 27        .byte $27	; <ら>
- - - - - 0x02BD43 20:BD33: 22        .byte $22	; <め>
- - - - - 0x02BD44 20:BD34: 27        .byte $27	; <ら>
- - - - - 0x02BD45 20:BD35: 0F        .byte $0F	; <そ>
- - - - - 0x02BD46 20:BD36: 22        .byte $22	; <め>
- - - - - 0x02BD47 20:BD37: 32        .byte $32	; <ょ>
- - - - - 0x02BD48 20:BD38: 25        .byte $25	; <ゆ>
- - - - - 0x02BD49 20:BD39: 30        .byte $30	; <ゃ>
- - - - - 0x02BD4A 20:BD3A: 31        .byte $31	; <ゅ>
- - - - - 0x02BD4B 20:BD3B: 30        .byte $30	; <ゃ>
- - - - - 0x02BD4C 20:BD3C: 10        .byte $10	; <た>
- - - - - 0x02BD4D 20:BD3D: 30        .byte $30	; <ゃ>
- - - - - 0x02BD4E 20:BD3E: 30        .byte $30	; <ゃ>
- - - - - 0x02BD4F 20:BD3F: 36        .byte $36	; <3>
- - - - - 0x02BD50 20:BD40: 27        .byte $27	; <ら>
- - - - - 0x02BD51 20:BD41: 36        .byte $36	; <3>
- - - - - 0x02BD52 20:BD42: 30        .byte $30	; <ゃ>
- - - - - 0x02BD53 20:BD43: 30        .byte $30	; <ゃ>
- - - - - 0x02BD54 20:BD44: 27        .byte $27	; <ら>
- - - - - 0x02BD55 20:BD45: 0F        .byte $0F	; <そ>
- - - - - 0x02BD56 20:BD46: 17        .byte $17	; <ぬ>
- - - - - 0x02BD57 20:BD47: 00        .byte $00
- - - - - 0x02BD58 20:BD48: 15        .byte $15	; <な>
- - - - - 0x02BD59 20:BD49: 06        .byte $06	; <か>
- - - - - 0x02BD5A 20:BD4A: 15        .byte $15	; <な>
- - - - - 0x02BD5B 20:BD4B: 37        .byte $37	; <4>
- - - - - 0x02BD5C 20:BD4C: 30        .byte $30	; <ゃ>
- - - - - 0x02BD5D 20:BD4D: 37        .byte $37	; <4>
- - - - - 0x02BD5E 20:BD4E: 00        .byte $00
- - - - - 0x02BD5F 20:BD4F: 36        .byte $36	; <3>
- - - - - 0x02BD60 20:BD50: 27        .byte $27	; <ら>
- - - - - 0x02BD61 20:BD51: 0F        .byte $0F	; <そ>
- - - - - 0x02BD62 20:BD52: 27        .byte $27	; <ら>
- - - - - 0x02BD63 20:BD53: 36        .byte $36	; <3>
- - - - - 0x02BD64 20:BD54: 20        .byte $20	; <み>
- - - - - 0x02BD65 20:BD55: 0F        .byte $0F	; <そ>
- - - - - 0x02BD66 20:BD56: 0F        .byte $0F	; <そ>
- - - - - 0x02BD67 20:BD57: 36        .byte $36	; <3>
- - - - - 0x02BD68 20:BD58: 15        .byte $15	; <な>
- - - - - 0x02BD69 20:BD59: 06        .byte $06	; <か>
- - - - - 0x02BD6A 20:BD5A: 15        .byte $15	; <な>
- - - - - 0x02BD6B 20:BD5B: 37        .byte $37	; <4>
- - - - - 0x02BD6C 20:BD5C: 30        .byte $30	; <ゃ>
- - - - - 0x02BD6D 20:BD5D: 37        .byte $37	; <4>
- - - - - 0x02BD6E 20:BD5E: 00        .byte $00
- - - - - 0x02BD6F 20:BD5F: 36        .byte $36	; <3>
- - - - - 0x02BD70 20:BD60: 27        .byte $27	; <ら>
- - - - - 0x02BD71 20:BD61: 17        .byte $17	; <ぬ>
- - - - - 0x02BD72 20:BD62: 27        .byte $27	; <ら>
- - - - - 0x02BD73 20:BD63: 36        .byte $36	; <3>
- - - - - 0x02BD74 20:BD64: 30        .byte $30	; <ゃ>
- - - - - 0x02BD75 20:BD65: 0F        .byte $0F	; <そ>
- - - - - 0x02BD76 20:BD66: 17        .byte $17	; <ぬ>
- - - - - 0x02BD77 20:BD67: 36        .byte $36	; <3>
- - - - - 0x02BD78 20:BD68: 15        .byte $15	; <な>
- - - - - 0x02BD79 20:BD69: 16        .byte $16	; <に>
- - - - - 0x02BD7A 20:BD6A: 15        .byte $15	; <な>
- - - - - 0x02BD7B 20:BD6B: 37        .byte $37	; <4>
- - - - - 0x02BD7C 20:BD6C: 30        .byte $30	; <ゃ>
- - - - - 0x02BD7D 20:BD6D: 37        .byte $37	; <4>
- - - - - 0x02BD7E 20:BD6E: 00        .byte $00
- - - - - 0x02BD7F 20:BD6F: 36        .byte $36	; <3>
- - - - - 0x02BD80 20:BD70: 27        .byte $27	; <ら>
- - - - - 0x02BD81 20:BD71: 25        .byte $25	; <ゆ>
- - - - - 0x02BD82 20:BD72: 27        .byte $27	; <ら>
- - - - - 0x02BD83 20:BD73: 36        .byte $36	; <3>
- - - - - 0x02BD84 20:BD74: 30        .byte $30	; <ゃ>
- - - - - 0x02BD85 20:BD75: 0F        .byte $0F	; <そ>
- - - - - 0x02BD86 20:BD76: 00        .byte $00
- - - - - 0x02BD87 20:BD77: 27        .byte $27	; <ら>
- - - - - 0x02BD88 20:BD78: 15        .byte $15	; <な>
- - - - - 0x02BD89 20:BD79: 16        .byte $16	; <に>
- - - - - 0x02BD8A 20:BD7A: 15        .byte $15	; <な>
- - - - - 0x02BD8B 20:BD7B: 37        .byte $37	; <4>
- - - - - 0x02BD8C 20:BD7C: 30        .byte $30	; <ゃ>
- - - - - 0x02BD8D 20:BD7D: 37        .byte $37	; <4>
- - - - - 0x02BD8E 20:BD7E: 00        .byte $00
- - - - - 0x02BD8F 20:BD7F: 36        .byte $36	; <3>
- - - - - 0x02BD90 20:BD80: 27        .byte $27	; <ら>
- - - - - 0x02BD91 20:BD81: 36        .byte $36	; <3>
- - - - - 0x02BD92 20:BD82: 30        .byte $30	; <ゃ>
- - - - - 0x02BD93 20:BD83: 30        .byte $30	; <ゃ>
- - - - - 0x02BD94 20:BD84: 27        .byte $27	; <ら>
- - - - - 0x02BD95 20:BD85: 0F        .byte $0F	; <そ>
- - - - - 0x02BD96 20:BD86: 17        .byte $17	; <ぬ>
- - - - - 0x02BD97 20:BD87: 00        .byte $00
- - - - - 0x02BD98 20:BD88: 15        .byte $15	; <な>
- - - - - 0x02BD99 20:BD89: 16        .byte $16	; <に>
- - - - - 0x02BD9A 20:BD8A: 15        .byte $15	; <な>
- - - - - 0x02BD9B 20:BD8B: 37        .byte $37	; <4>
- - - - - 0x02BD9C 20:BD8C: 30        .byte $30	; <ゃ>
- - - - - 0x02BD9D 20:BD8D: 37        .byte $37	; <4>
- - - - - 0x02BD9E 20:BD8E: 00        .byte $00
- - - - - 0x02BD9F 20:BD8F: 36        .byte $36	; <3>
- - - - - 0x02BDA0 20:BD90: 27        .byte $27	; <ら>
- - - - - 0x02BDA1 20:BD91: 36        .byte $36	; <3>
- - - - - 0x02BDA2 20:BD92: 30        .byte $30	; <ゃ>
- - - - - 0x02BDA3 20:BD93: 30        .byte $30	; <ゃ>
- - - - - 0x02BDA4 20:BD94: 27        .byte $27	; <ら>
- - - - - 0x02BDA5 20:BD95: 0F        .byte $0F	; <そ>
- - - - - 0x02BDA6 20:BD96: 17        .byte $17	; <ぬ>
- - - - - 0x02BDA7 20:BD97: 00        .byte $00
- - - - - 0x02BDA8 20:BD98: 15        .byte $15	; <な>
- - - - - 0x02BDA9 20:BD99: 16        .byte $16	; <に>
- - - - - 0x02BDAA 20:BD9A: 15        .byte $15	; <な>
- - - - - 0x02BDAB 20:BD9B: 37        .byte $37	; <4>
- - - - - 0x02BDAC 20:BD9C: 30        .byte $30	; <ゃ>
- - - - - 0x02BDAD 20:BD9D: 37        .byte $37	; <4>
- - - - - 0x02BDAE 20:BD9E: 00        .byte $00
- - - - - 0x02BDAF 20:BD9F: 36        .byte $36	; <3>
- - - - - 0x02BDB0 20:BDA0: 27        .byte $27	; <ら>
- - - - - 0x02BDB1 20:BDA1: 25        .byte $25	; <ゆ>
- - - - - 0x02BDB2 20:BDA2: 27        .byte $27	; <ら>
- - - - - 0x02BDB3 20:BDA3: 36        .byte $36	; <3>
- - - - - 0x02BDB4 20:BDA4: 30        .byte $30	; <ゃ>
- - - - - 0x02BDB5 20:BDA5: 0F        .byte $0F	; <そ>
- - - - - 0x02BDB6 20:BDA6: 00        .byte $00
- - - - - 0x02BDB7 20:BDA7: 27        .byte $27	; <ら>
- - - - - 0x02BDB8 20:BDA8: 15        .byte $15	; <な>
- - - - - 0x02BDB9 20:BDA9: 16        .byte $16	; <に>
- - - - - 0x02BDBA 20:BDAA: 15        .byte $15	; <な>
- - - - - 0x02BDBB 20:BDAB: 37        .byte $37	; <4>
- - - - - 0x02BDBC 20:BDAC: 30        .byte $30	; <ゃ>
- - - - - 0x02BDBD 20:BDAD: 37        .byte $37	; <4>
- - - - - 0x02BDBE 20:BDAE: 00        .byte $00
- - - - - 0x02BDBF 20:BDAF: 36        .byte $36	; <3>
- - - - - 0x02BDC0 20:BDB0: 27        .byte $27	; <ら>
- - - - - 0x02BDC1 20:BDB1: 36        .byte $36	; <3>
- - - - - 0x02BDC2 20:BDB2: 30        .byte $30	; <ゃ>
- - - - - 0x02BDC3 20:BDB3: 30        .byte $30	; <ゃ>
- - - - - 0x02BDC4 20:BDB4: 27        .byte $27	; <ら>
- - - - - 0x02BDC5 20:BDB5: 0F        .byte $0F	; <そ>
- - - - - 0x02BDC6 20:BDB6: 17        .byte $17	; <ぬ>
- - - - - 0x02BDC7 20:BDB7: 00        .byte $00
- - - - - 0x02BDC8 20:BDB8: 15        .byte $15	; <な>
- - - - - 0x02BDC9 20:BDB9: 16        .byte $16	; <に>
- - - - - 0x02BDCA 20:BDBA: 15        .byte $15	; <な>
- - - - - 0x02BDCB 20:BDBB: 37        .byte $37	; <4>
- - - - - 0x02BDCC 20:BDBC: 30        .byte $30	; <ゃ>
- - - - - 0x02BDCD 20:BDBD: 37        .byte $37	; <4>
- - - - - 0x02BDCE 20:BDBE: 00        .byte $00
- - - - - 0x02BDCF 20:BDBF: 06        .byte $06	; <か>
- - - - - 0x02BDD0 20:BDC0: 15        .byte $15	; <な>
- - - - - 0x02BDD1 20:BDC1: 36        .byte $36	; <3>
- - - - - 0x02BDD2 20:BDC2: 26        .byte $26	; <よ>
- - - - - 0x02BDD3 20:BDC3: 30        .byte $30	; <ゃ>
- - - - - 0x02BDD4 20:BDC4: 31        .byte $31	; <ゅ>
- - - - - 0x02BDD5 20:BDC5: 00        .byte $00
- - - - - 0x02BDD6 20:BDC6: 00        .byte $00
- - - - - 0x02BDD7 20:BDC7: 00        .byte $00
- - - - - 0x02BDD8 20:BDC8: 25        .byte $25	; <ゆ>
- - - - - 0x02BDD9 20:BDC9: 30        .byte $30	; <ゃ>
- - - - - 0x02BDDA 20:BDCA: 31        .byte $31	; <ゅ>
- - - - - 0x02BDDB 20:BDCB: 30        .byte $30	; <ゃ>
- - - - - 0x02BDDC 20:BDCC: 10        .byte $10	; <た>
- - - - - 0x02BDDD 20:BDCD: 30        .byte $30	; <ゃ>
- - - - - 0x02BDDE 20:BDCE: 30        .byte $30	; <ゃ>
- - - - - 0x02BDDF 20:BDCF: 36        .byte $36	; <3>
- - - - - 0x02BDE0 20:BDD0: 27        .byte $27	; <ら>
- - - - - 0x02BDE1 20:BDD1: 36        .byte $36	; <3>
- - - - - 0x02BDE2 20:BDD2: 30        .byte $30	; <ゃ>
- - - - - 0x02BDE3 20:BDD3: 30        .byte $30	; <ゃ>
- - - - - 0x02BDE4 20:BDD4: 27        .byte $27	; <ら>
- - - - - 0x02BDE5 20:BDD5: 0F        .byte $0F	; <そ>
- - - - - 0x02BDE6 20:BDD6: 07        .byte $07	; <き>
- - - - - 0x02BDE7 20:BDD7: 27        .byte $27	; <ら>
- - - - - 0x02BDE8 20:BDD8: 15        .byte $15	; <な>
- - - - - 0x02BDE9 20:BDD9: 16        .byte $16	; <に>
- - - - - 0x02BDEA 20:BDDA: 15        .byte $15	; <な>
- - - - - 0x02BDEB 20:BDDB: 37        .byte $37	; <4>
- - - - - 0x02BDEC 20:BDDC: 30        .byte $30	; <ゃ>
- - - - - 0x02BDED 20:BDDD: 37        .byte $37	; <4>
- - - - - 0x02BDEE 20:BDDE: 00        .byte $00
- - - - - 0x02BDEF 20:BDDF: 36        .byte $36	; <3>
- - - - - 0x02BDF0 20:BDE0: 27        .byte $27	; <ら>
- - - - - 0x02BDF1 20:BDE1: 25        .byte $25	; <ゆ>
- - - - - 0x02BDF2 20:BDE2: 27        .byte $27	; <ら>
- - - - - 0x02BDF3 20:BDE3: 36        .byte $36	; <3>
- - - - - 0x02BDF4 20:BDE4: 30        .byte $30	; <ゃ>
- - - - - 0x02BDF5 20:BDE5: 0F        .byte $0F	; <そ>
- - - - - 0x02BDF6 20:BDE6: 00        .byte $00
- - - - - 0x02BDF7 20:BDE7: 27        .byte $27	; <ら>
- - - - - 0x02BDF8 20:BDE8: 15        .byte $15	; <な>
- - - - - 0x02BDF9 20:BDE9: 16        .byte $16	; <に>
- - - - - 0x02BDFA 20:BDEA: 15        .byte $15	; <な>
- - - - - 0x02BDFB 20:BDEB: 37        .byte $37	; <4>
- - - - - 0x02BDFC 20:BDEC: 30        .byte $30	; <ゃ>
- - - - - 0x02BDFD 20:BDED: 37        .byte $37	; <4>
- - - - - 0x02BDFE 20:BDEE: 00        .byte $00
- - - - - 0x02BDFF 20:BDEF: 36        .byte $36	; <3>
- - - - - 0x02BE00 20:BDF0: 27        .byte $27	; <ら>
- - - - - 0x02BE01 20:BDF1: 0F        .byte $0F	; <そ>
- - - - - 0x02BE02 20:BDF2: 27        .byte $27	; <ら>
- - - - - 0x02BE03 20:BDF3: 30        .byte $30	; <ゃ>
- - - - - 0x02BE04 20:BDF4: 0F        .byte $0F	; <そ>
- - - - - 0x02BE05 20:BDF5: 0F        .byte $0F	; <そ>
- - - - - 0x02BE06 20:BDF6: 36        .byte $36	; <3>
- - - - - 0x02BE07 20:BDF7: 30        .byte $30	; <ゃ>
- - - - - 0x02BE08 20:BDF8: 36        .byte $36	; <3>
- - - - - 0x02BE09 20:BDF9: 27        .byte $27	; <ら>
- - - - - 0x02BE0A 20:BDFA: 11        .byte $11	; <ち>
- - - - - 0x02BE0B 20:BDFB: 16        .byte $16	; <に>
- - - - - 0x02BE0C 20:BDFC: 11        .byte $11	; <ち>
- - - - - 0x02BE0D 20:BDFD: 30        .byte $30	; <ゃ>
- - - - - 0x02BE0E 20:BDFE: 00        .byte $00
- D - I - 0x02BE0F 20:BDFF: 35        .byte $35	; <2>
- D - I - 0x02BE10 20:BE00: 27        .byte $27	; <ら>
- D - I - 0x02BE11 20:BE01: 37        .byte $37	; <4>
- D - I - 0x02BE12 20:BE02: 27        .byte $27	; <ら>
- D - I - 0x02BE13 20:BE03: 35        .byte $35	; <2>
- D - I - 0x02BE14 20:BE04: 30        .byte $30	; <ゃ>
- D - I - 0x02BE15 20:BE05: 0F        .byte $0F	; <そ>
- D - I - 0x02BE16 20:BE06: 1A        .byte $1A	; <は>
- D - I - 0x02BE17 20:BE07: 30        .byte $30	; <ゃ>
- D - I - 0x02BE18 20:BE08: 22        .byte $22	; <め>
- D - I - 0x02BE19 20:BE09: 11        .byte $11	; <ち>
- D - I - 0x02BE1A 20:BE0A: 22        .byte $22	; <め>
- D - I - 0x02BE1B 20:BE0B: 37        .byte $37	; <4>
- D - I - 0x02BE1C 20:BE0C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE1D 20:BE0D: 37        .byte $37	; <4>
- - - - - 0x02BE1E 20:BE0E: 00        .byte $00
- D - I - 0x02BE1F 20:BE0F: 35        .byte $35	; <2>
- D - I - 0x02BE20 20:BE10: 27        .byte $27	; <ら>
- D - I - 0x02BE21 20:BE11: 37        .byte $37	; <4>
- D - I - 0x02BE22 20:BE12: 27        .byte $27	; <ら>
- D - I - 0x02BE23 20:BE13: 35        .byte $35	; <2>
- D - I - 0x02BE24 20:BE14: 30        .byte $30	; <ゃ>
- D - I - 0x02BE25 20:BE15: 0F        .byte $0F	; <そ>
- D - I - 0x02BE26 20:BE16: 1A        .byte $1A	; <は>
- D - I - 0x02BE27 20:BE17: 27        .byte $27	; <ら>
- D - I - 0x02BE28 20:BE18: 22        .byte $22	; <め>
- D - I - 0x02BE29 20:BE19: 11        .byte $11	; <ち>
- D - I - 0x02BE2A 20:BE1A: 22        .byte $22	; <め>
- D - I - 0x02BE2B 20:BE1B: 37        .byte $37	; <4>
- D - I - 0x02BE2C 20:BE1C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE2D 20:BE1D: 37        .byte $37	; <4>
- - - - - 0x02BE2E 20:BE1E: 00        .byte $00
- D - I - 0x02BE2F 20:BE1F: 36        .byte $36	; <3>
- D - I - 0x02BE30 20:BE20: 27        .byte $27	; <ら>
- D - I - 0x02BE31 20:BE21: 17        .byte $17	; <ぬ>
- D - I - 0x02BE32 20:BE22: 27        .byte $27	; <ら>
- D - I - 0x02BE33 20:BE23: 36        .byte $36	; <3>
- D - I - 0x02BE34 20:BE24: 30        .byte $30	; <ゃ>
- D - I - 0x02BE35 20:BE25: 0F        .byte $0F	; <そ>
- D - I - 0x02BE36 20:BE26: 1C        .byte $1C	; <ふ>
- D - I - 0x02BE37 20:BE27: 30        .byte $30	; <ゃ>
- D - I - 0x02BE38 20:BE28: 31        .byte $31	; <ゅ>
- D - I - 0x02BE39 20:BE29: 32        .byte $32	; <ょ>
- D - I - 0x02BE3A 20:BE2A: 31        .byte $31	; <ゅ>
- D - I - 0x02BE3B 20:BE2B: 37        .byte $37	; <4>
- D - I - 0x02BE3C 20:BE2C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE3D 20:BE2D: 37        .byte $37	; <4>
- - - - - 0x02BE3E 20:BE2E: 00        .byte $00
- D - I - 0x02BE3F 20:BE2F: 36        .byte $36	; <3>
- D - I - 0x02BE40 20:BE30: 27        .byte $27	; <ら>
- D - I - 0x02BE41 20:BE31: 0F        .byte $0F	; <そ>
- D - I - 0x02BE42 20:BE32: 27        .byte $27	; <ら>
- D - I - 0x02BE43 20:BE33: 36        .byte $36	; <3>
- D - I - 0x02BE44 20:BE34: 30        .byte $30	; <ゃ>
- D - I - 0x02BE45 20:BE35: 0F        .byte $0F	; <そ>
- D - I - 0x02BE46 20:BE36: 0F        .byte $0F	; <そ>
- D - I - 0x02BE47 20:BE37: 36        .byte $36	; <3>
- D - I - 0x02BE48 20:BE38: 31        .byte $31	; <ゅ>
- D - I - 0x02BE49 20:BE39: 32        .byte $32	; <ょ>
- D - I - 0x02BE4A 20:BE3A: 31        .byte $31	; <ゅ>
- D - I - 0x02BE4B 20:BE3B: 37        .byte $37	; <4>
- D - I - 0x02BE4C 20:BE3C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE4D 20:BE3D: 37        .byte $37	; <4>
- - - - - 0x02BE4E 20:BE3E: 00        .byte $00
- D - I - 0x02BE4F 20:BE3F: 35        .byte $35	; <2>
- D - I - 0x02BE50 20:BE40: 27        .byte $27	; <ら>
- D - I - 0x02BE51 20:BE41: 37        .byte $37	; <4>
- D - I - 0x02BE52 20:BE42: 27        .byte $27	; <ら>
- D - I - 0x02BE53 20:BE43: 35        .byte $35	; <2>
- D - I - 0x02BE54 20:BE44: 30        .byte $30	; <ゃ>
- D - I - 0x02BE55 20:BE45: 0F        .byte $0F	; <そ>
- D - I - 0x02BE56 20:BE46: 1C        .byte $1C	; <ふ>
- D - I - 0x02BE57 20:BE47: 30        .byte $30	; <ゃ>
- D - I - 0x02BE58 20:BE48: 30        .byte $30	; <ゃ>
- D - I - 0x02BE59 20:BE49: 31        .byte $31	; <ゅ>
- D - I - 0x02BE5A 20:BE4A: 30        .byte $30	; <ゃ>
- D - I - 0x02BE5B 20:BE4B: 37        .byte $37	; <4>
- D - I - 0x02BE5C 20:BE4C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE5D 20:BE4D: 37        .byte $37	; <4>
- - - - - 0x02BE5E 20:BE4E: 00        .byte $00
- D - I - 0x02BE5F 20:BE4F: 35        .byte $35	; <2>
- D - I - 0x02BE60 20:BE50: 27        .byte $27	; <ら>
- D - I - 0x02BE61 20:BE51: 37        .byte $37	; <4>
- D - I - 0x02BE62 20:BE52: 27        .byte $27	; <ら>
- D - I - 0x02BE63 20:BE53: 35        .byte $35	; <2>
- D - I - 0x02BE64 20:BE54: 30        .byte $30	; <ゃ>
- D - I - 0x02BE65 20:BE55: 0F        .byte $0F	; <そ>
- D - I - 0x02BE66 20:BE56: 1C        .byte $1C	; <ふ>
- D - I - 0x02BE67 20:BE57: 30        .byte $30	; <ゃ>
- D - I - 0x02BE68 20:BE58: 30        .byte $30	; <ゃ>
- D - I - 0x02BE69 20:BE59: 31        .byte $31	; <ゅ>
- D - I - 0x02BE6A 20:BE5A: 30        .byte $30	; <ゃ>
- D - I - 0x02BE6B 20:BE5B: 37        .byte $37	; <4>
- D - I - 0x02BE6C 20:BE5C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE6D 20:BE5D: 37        .byte $37	; <4>
- - - - - 0x02BE6E 20:BE5E: 00        .byte $00
- D - I - 0x02BE6F 20:BE5F: 35        .byte $35	; <2>
- D - I - 0x02BE70 20:BE60: 27        .byte $27	; <ら>
- D - I - 0x02BE71 20:BE61: 37        .byte $37	; <4>
- D - I - 0x02BE72 20:BE62: 27        .byte $27	; <ら>
- D - I - 0x02BE73 20:BE63: 35        .byte $35	; <2>
- D - I - 0x02BE74 20:BE64: 30        .byte $30	; <ゃ>
- D - I - 0x02BE75 20:BE65: 0F        .byte $0F	; <そ>
- D - I - 0x02BE76 20:BE66: 1C        .byte $1C	; <ふ>
- D - I - 0x02BE77 20:BE67: 30        .byte $30	; <ゃ>
- D - I - 0x02BE78 20:BE68: 30        .byte $30	; <ゃ>
- D - I - 0x02BE79 20:BE69: 31        .byte $31	; <ゅ>
- D - I - 0x02BE7A 20:BE6A: 30        .byte $30	; <ゃ>
- D - I - 0x02BE7B 20:BE6B: 37        .byte $37	; <4>
- D - I - 0x02BE7C 20:BE6C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE7D 20:BE6D: 37        .byte $37	; <4>
- - - - - 0x02BE7E 20:BE6E: 00        .byte $00
- D - I - 0x02BE7F 20:BE6F: 26        .byte $26	; <よ>
- D - I - 0x02BE80 20:BE70: 17        .byte $17	; <ぬ>
- D - I - 0x02BE81 20:BE71: 27        .byte $27	; <ら>
- D - I - 0x02BE82 20:BE72: 17        .byte $17	; <ぬ>
- D - I - 0x02BE83 20:BE73: 26        .byte $26	; <よ>
- D - I - 0x02BE84 20:BE74: 30        .byte $30	; <ゃ>
- D - I - 0x02BE85 20:BE75: 0F        .byte $0F	; <そ>
- D - I - 0x02BE86 20:BE76: 1A        .byte $1A	; <は>
- D - I - 0x02BE87 20:BE77: 30        .byte $30	; <ゃ>
- D - I - 0x02BE88 20:BE78: 37        .byte $37	; <4>
- D - I - 0x02BE89 20:BE79: 27        .byte $27	; <ら>
- D - I - 0x02BE8A 20:BE7A: 37        .byte $37	; <4>
- D - I - 0x02BE8B 20:BE7B: 37        .byte $37	; <4>
- D - I - 0x02BE8C 20:BE7C: 30        .byte $30	; <ゃ>
- D - I - 0x02BE8D 20:BE7D: 37        .byte $37	; <4>
- - - - - 0x02BE8E 20:BE7E: 00        .byte $00
- - - - - 0x02BE8F 20:BE7F: 26        .byte $26	; <よ>
- - - - - 0x02BE90 20:BE80: 15        .byte $15	; <な>
- - - - - 0x02BE91 20:BE81: 0F        .byte $0F	; <そ>
- - - - - 0x02BE92 20:BE82: 15        .byte $15	; <な>
- - - - - 0x02BE93 20:BE83: 30        .byte $30	; <ゃ>
- - - - - 0x02BE94 20:BE84: 0F        .byte $0F	; <そ>
- - - - - 0x02BE95 20:BE85: 0F        .byte $0F	; <そ>
- - - - - 0x02BE96 20:BE86: 26        .byte $26	; <よ>
- - - - - 0x02BE97 20:BE87: 30        .byte $30	; <ゃ>
- - - - - 0x02BE98 20:BE88: 26        .byte $26	; <よ>
- - - - - 0x02BE99 20:BE89: 15        .byte $15	; <な>
- - - - - 0x02BE9A 20:BE8A: 37        .byte $37	; <4>
- - - - - 0x02BE9B 20:BE8B: 16        .byte $16	; <に>
- - - - - 0x02BE9C 20:BE8C: 37        .byte $37	; <4>
- - - - - 0x02BE9D 20:BE8D: 30        .byte $30	; <ゃ>
- - - - - 0x02BE9E 20:BE8E: 00        .byte $00
- D - I - 0x02BE9F 20:BE8F: 26        .byte $26	; <よ>
- D - I - 0x02BEA0 20:BE90: 17        .byte $17	; <ぬ>
- D - I - 0x02BEA1 20:BE91: 16        .byte $16	; <に>
- D - I - 0x02BEA2 20:BE92: 17        .byte $17	; <ぬ>
- D - I - 0x02BEA3 20:BE93: 26        .byte $26	; <よ>
- D - I - 0x02BEA4 20:BE94: 30        .byte $30	; <ゃ>
- D - I - 0x02BEA5 20:BE95: 0F        .byte $0F	; <そ>
- D - I - 0x02BEA6 20:BE96: 16        .byte $16	; <に>
- D - I - 0x02BEA7 20:BE97: 26        .byte $26	; <よ>
- D - I - 0x02BEA8 20:BE98: 37        .byte $37	; <4>
- D - I - 0x02BEA9 20:BE99: 27        .byte $27	; <ら>
- D - I - 0x02BEAA 20:BE9A: 37        .byte $37	; <4>
- D - I - 0x02BEAB 20:BE9B: 37        .byte $37	; <4>
- D - I - 0x02BEAC 20:BE9C: 30        .byte $30	; <ゃ>
- D - I - 0x02BEAD 20:BE9D: 37        .byte $37	; <4>
- - - - - 0x02BEAE 20:BE9E: 00        .byte $00
