.segment "BANK_00"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000
; 0x000010-0x00200F



.export ofs_0x000010_действие_после_конца_тайма
.export ofs_0x00002F
.export loc_0x000063
.export sub_0x0002B9_ожидание_завершения_катсцены
.export ofs_0x0002FD
.export sub_0x000474_воспроизвести_катсцену
.export sub_0x0008A5
.export sub_0x0008DA_запись_символа_в_буфер
.export sub_0x00090B
.export sub_0x00091C_смещение_Y_спрайтов
.export sub_0x000930
.export sub_0x000986
.export sub_0x0009B3_ожидание_перехода_к_след_диалогу
.export sub_0x000B07
.export sub_0x0017BB
.export sub_0x0017BD
.export sub_0x0017C6_запись_в_буфер_без_смещения
.export sub_0x0017C8_запись_в_буфер_со_смещением
.export sub_0x0018A5
.export loc_0x0018A5
.export sub_0x0018B0_очистка_двух_nametable
.export sub_0x0018EF
.export sub_0x0018F8_затереть_часть_экрана
.export sub_0x0018FA_замостить_часть_экрана_тайлом
.export sub_0x00198A_запись_палитры_фона_и_спрайтов
.export sub_0x00198E_запись_палитры_фона_и_спрайтов
.export sub_0x001A00_выход_из_экрана
.export sub_0x001A1D
.export sub_0x001A45
.export sub_0x001A53
.export sub_0x001B38_подготовить_буфер
.export sub_0x001B6E_закрыть_буфер
.export sub_0x001B7F_запись_первых_двух_банков_спрайтов
.export sub_0x001B84_запись_вторых_двух_банков_спрайтов
.export sub_0x001B8F_очистить_обе_памяти_спрайтов
.export sub_0x001BA1_очистить_0568_0588_05A8_05C8
.export sub_0x001BB0
.export sub_0x001BF3
.export sub_0x001BF8
.export sub_0x001C1D_скрыть_курсор_после_выбора_опции
.export loc_0x001C38_непрямой_прыжок
.export sub_0x001C4A_отобразить_курсор
.export sub_0x001C4C_отобразить_курсор_со_смещением
.export sub_0x001C81_поиск_забаненых_игроков
.export sub_0x001CD9
.export sub_0x001CE3
.export sub_0x001D18
.export sub_0x001D37_запись_в_буфер
.export sub_0x001D60_запись_имени_в_буфер
.export sub_0x001D83
.export sub_0x001D9E_запись_в_буфер_уровня_игрока
.export sub_0x001DC5_запись_чисел_в_буфер
.export sub_0x001DFE_умножить_A_на_X
.export sub_0x001E1C
.export sub_0x001E5F
.export sub_0x001E8C_перевод_из_HEX_в_DEC
.export loc_0x001EFD
.export sub_0x001F79
.export sub_0x001F99
.export sub_0x001FA6
.export sub_0x001FB8_задержка_кадра



ofs_0x000010_действие_после_конца_тайма:
C D 0 - - - 0x000010 00:8000: A5 27     LDA ram_номер_тайма
C - - - - - 0x000012 00:8002: 0A        ASL
C - - - - - 0x000013 00:8003: AA        TAX
C - - - - - 0x000014 00:8004: BD 0E 80  LDA tbl_800D_подпрограмма + $01,X
C - - - - - 0x000017 00:8007: 48        PHA
C - - - - - 0x000018 00:8008: BD 0D 80  LDA tbl_800D_подпрограмма,X
C - - - - - 0x00001B 00:800B: 48        PHA
C - - - - - 0x00001C 00:800C: 60        RTS



tbl_800D_подпрограмма:
- D 0 - - - 0x00001D 00:800D: 65 81     .word ofs_000_8166_00_закончился_первый_тайм - $01
- D 0 - - - 0x00001F 00:800F: 8A 81     .word ofs_000_818B_01_закончился_второй_тайм - $01
- D 0 - - - 0x000021 00:8011: AD 81     .word ofs_000_81AE_02 - $01
- D 0 - - - 0x000023 00:8013: B4 81     .word ofs_000_81B5_03_закончился_овертайм - $01
- D 0 - - - 0x000025 00:8015: DA 81     .word ofs_000_81DB_04_закончились_пк_после_матча - $01



loc_8017:
C D 0 - - - 0x000027 00:8017: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x000029 00:8019: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
; сработало при переходе от радостных игроков перед игрой в саму игру
C - - - - - 0x00002C 00:801C: 4C 03 A2  JMP loc_0x0042BF



ofs_0x00002F:
C - - - - - 0x00002F 00:801F: 20 A0 9B  JSR sub_9BA0
C - - - - - 0x000032 00:8022: A9 00     LDA #con_cutscene + $00

                                        .if con_cheat_cutscene <> $FF
                                            .if con_cheat_cutscene = $22
                                                LDA #$20
                                                STA ram_матч
                                                LDA #$22
                                                JMP loc_8237_cheat_cutscene_22
                                            .else
                                                LDA #con_cheat_cutscene
                                            .endif
                                        .endif

C - - - - - 0x000034 00:8024: 20 64 84  JSR sub_8464_воспроизвести_катсцену
bra_8027_попытка_пропуска_демо:
C - - - - - 0x000037 00:8027: A9 01     LDA #$01
C - - - - - 0x000039 00:8029: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00003C 00:802C: A5 1E     LDA ram_btn_press
C - - - - - 0x00003E 00:802E: 29 10     AND #con_btn_Start
C - - - - - 0x000040 00:8030: F0 F5     BEQ bra_8027_попытка_пропуска_демо
C - - - - - 0x000042 00:8032: A9 00     LDA #$00
C - - - - - 0x000044 00:8034: 85 05     STA ram_0005
C - - - - - 0x000046 00:8036: 85 06     STA ram_0006
C - - - - - 0x000048 00:8038: 85 09     STA ram_0009
C - - - - - 0x00004A 00:803A: 85 0A     STA ram_000A
C - - - - - 0x00004C 00:803C: 85 11     STA ram_0011
C - - - - - 0x00004E 00:803E: 85 12     STA ram_0012
C - - - - - 0x000050 00:8040: 85 0D     STA ram_000D
C - - - - - 0x000052 00:8042: 85 0E     STA ram_000E
C - - - - - 0x000054 00:8044: 85 4C     STA ram_004C
C - - - - - 0x000056 00:8046: 85 5B     STA ram_005B
C - - - - - 0x000058 00:8048: A9 01     LDA #$01
C - - - - - 0x00005A 00:804A: 8D 00 07  STA ram_звук
C - - - - - 0x00005D 00:804D: A5 1B     LDA ram_флаг_nmi
C - - - - - 0x00005F 00:804F: 29 01     AND #$01
C - - - - - 0x000061 00:8051: D0 27     BNE bra_807A
loc_0x000063:
C D 0 - - - 0x000063 00:8053: 20 11 9B  JSR sub_9B11
C - - - - - 0x000066 00:8056: A9 02     LDA #$02
C - - - - - 0x000068 00:8058: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00006B 00:805B: 20 7F 9B  JSR sub_9B7F_очистить_обе_памяти_спрайтов
C - - - - - 0x00006E 00:805E: 20 A0 98  JSR sub_98A0_очистка_двух_nametable
C - - - - - 0x000071 00:8061: A9 0D     LDA #$0D
                                        STA ram_00E7
                                        LDA #$01
                                        STA ram_00E6
                                        LDA #$E5
                                        STA ram_004D
                                        LDA #$00
                                        STA ram_004E
                                        JSR sub_9085
C - - - - - 0x000076 00:8066: A9 00     LDA #$00
C - - - - - 0x000078 00:8068: 85 7B     STA ram_007B
C - - - - - 0x00007A 00:806A: A9 17     LDA #$17
C - - - - - 0x00007C 00:806C: 20 F7 8A  JSR sub_8AF7
C - - - - - 0x00007F 00:806F: A9 30     LDA #$30
C - - - - - 0x000081 00:8071: 20 0C 89  JSR sub_890C_смещение_Y_спрайтов
C - - - - - 0x000084 00:8074: 20 FB 88  JSR sub_88FB
C - - - - - 0x000087 00:8077: 20 35 9A  JSR sub_9A35
bra_807A:
C - - - - - 0x00008A 00:807A: A9 00     LDA #con_BF00_00
C - - - - - 0x00008C 00:807C: 20 20 89  JSR sub_8920
C - - - - - 0x00008F 00:807F: A9 00     LDA #con_chr_bank + $00
C - - - - - 0x000091 00:8081: 85 90     STA ram_0090
C - - - - - 0x000093 00:8083: A9 02     LDA #con_chr_bank + $02
C - - - - - 0x000095 00:8085: 85 91     STA ram_0091
C - - - - - 0x000097 00:8087: A5 1B     LDA ram_флаг_nmi
C - - - - - 0x000099 00:8089: 29 FE     AND #$FE
C - - - - - 0x00009B 00:808B: 85 1B     STA ram_флаг_nmi
C - - - - - 0x00009D 00:808D: A9 0A     LDA #$0A
C - - - - - 0x00009F 00:808F: 85 ED     STA ram_00ED
loc_8091:
C D 0 - - - 0x0000A1 00:8091: A5 ED     LDA ram_00ED
C - - - - - 0x0000A3 00:8093: 85 E6     STA ram_00E6
C - - - - - 0x0000A5 00:8095: A9 22     LDA #$22
C - - - - - 0x0000A7 00:8097: 85 E7     STA ram_00E7
C - - - - - 0x0000A9 00:8099: A0 01     LDY #$01
C - - - - - 0x0000AB 00:809B: A2 01     LDX #$01
C - - - - - 0x0000AD 00:809D: A9 7F     LDA #$7F
C - - - - - 0x0000AF 00:809F: 20 EA 98  JSR sub_98EA_замостить_часть_экрана_тайлом
bra_80A2_ожидание_нажатия:
C - - - - - 0x0000B2 00:80A2: A9 01     LDA #$01
C - - - - - 0x0000B4 00:80A4: 20 A8 9F  JSR sub_9FA8_задержка_кадра
; управление курсором на главном экране
C - - - - - 0x0000B7 00:80A7: A5 1E     LDA ram_btn_press
C - - - - - 0x0000B9 00:80A9: 29 3C     AND #con_btn_Start + con_btn_Select + con_btn_Down + con_btn_Up
C - - - - - 0x0000BB 00:80AB: F0 F5     BEQ bra_80A2_ожидание_нажатия
C - - - - - 0x0000BD 00:80AD: 0A        ASL
C - - - - - 0x0000BE 00:80AE: 0A        ASL
C - - - - - 0x0000BF 00:80AF: 30 0B     BMI bra_80BC
C - - - - - 0x0000C1 00:80B1: 0A        ASL
C - - - - - 0x0000C2 00:80B2: 30 20     BMI bra_80D4
C - - - - - 0x0000C4 00:80B4: 0A        ASL
C - - - - - 0x0000C5 00:80B5: 29 40     AND #$40
C - - - - - 0x0000C7 00:80B7: 09 0A     ORA #$0A
C - - - - - 0x0000C9 00:80B9: 4C C0 80  JMP loc_80C0  ; jmp
bra_80BC:
C - - - - - 0x0000CC 00:80BC: A5 ED     LDA ram_00ED
C - - - - - 0x0000CE 00:80BE: 49 40     EOR #$40
loc_80C0:
C D 0 - - - 0x0000D0 00:80C0: 85 ED     STA ram_00ED
C - - - - - 0x0000D2 00:80C2: A9 0A     LDA #$0A
C - - - - - 0x0000D4 00:80C4: 85 E6     STA ram_00E6
C - - - - - 0x0000D6 00:80C6: A9 22     LDA #$22
C - - - - - 0x0000D8 00:80C8: 85 E7     STA ram_00E7
C - - - - - 0x0000DA 00:80CA: A0 03     LDY #$03
C - - - - - 0x0000DC 00:80CC: A2 01     LDX #$01
C - - - - - 0x0000DE 00:80CE: 20 E8 98  JSR sub_98E8_затереть_часть_экрана
C - - - - - 0x0000E1 00:80D1: 4C 91 80  JMP loc_8091
bra_80D4:
C - - - - - 0x0000E4 00:80D4: A5 1C     LDA ram_btn_hold
C - - - - - 0x0000E6 00:80D6: 29 C0     AND #con_btn_B + con_btn_A
C - - - - - 0x0000E8 00:80D8: C9 C0     CMP #$C0
C - - - - - 0x0000EA 00:80DA: D0 03     BNE bra_80DF_скрытый_музыкальный_экран
C - - - - - 0x0000EC 00:80DC: 4C 09 A2  JMP loc_0x0043E8_управление_музыкальным_экраном
bra_80DF_скрытый_музыкальный_экран:
C - - - - - 0x0000EF 00:80DF: 24 ED     BIT ram_00ED
C - - - - - 0x0000F1 00:80E1: 50 03     BVC bra_80E6
C - - - - - 0x0000F3 00:80E3: 4C 6A 82  JMP loc_826A
bra_80E6:
C - - - - - 0x0000F6 00:80E6: 20 A0 9B  JSR sub_9BA0
C - - - - - 0x0000F9 00:80E9: A9 01     LDA #con_cutscene + $01
C - - - - - 0x0000FB 00:80EB: 20 64 84  JSR sub_8464_воспроизвести_катсцену
C - - - - - 0x0000FE 00:80EE: 20 B5 82  JSR sub_82B5_попытка_пропуска_катсцены
C - - - - - 0x000101 00:80F1: A9 C0     LDA #$C0
C - - - - - 0x000103 00:80F3: 85 E0     STA ram_00E0
C - - - - - 0x000105 00:80F5: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x000107 00:80F7: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00010A 00:80FA: 20 0F A2  JSR sub_0x00487E_номера_игроков_и_расстановка_твоей_команды
loc_80FD:
C D 0 - - - 0x00010D 00:80FD: A9 00     LDA #$00
C - - - - - 0x00010F 00:80FF: 85 28     STA ram_голы
C - - - - - 0x000111 00:8101: 85 29     STA ram_голы + $01
C - - - - - 0x000113 00:8103: 85 27     STA ram_номер_тайма
C - - - - - 0x000115 00:8105: A9 01     LDA #$01
C - - - - - 0x000117 00:8107: 8D 00 07  STA ram_звук
C - - - - - 0x00011A 00:810A: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x00011C 00:810C: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00011F 00:810F: 20 0C A2  JSR sub_0x004865_номера_игроков_и_расстановка_твоей_команды
C - - - - - 0x000122 00:8112: A9 00     LDA #con_BF00_00
C - - - - - 0x000124 00:8114: 20 20 89  JSR sub_8920
C - - - - - 0x000127 00:8117: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x000129 00:8119: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00012C 00:811C: 20 06 A0  JSR sub_0x0024FB_VS_экран_и_повышение_уровня
C - - - - - 0x00012F 00:811F: 20 72 C5  JSR sub_0x03DB72
C - - - - - 0x000132 00:8122: A2 55     LDX #$55
C - - - - - 0x000134 00:8124: A5 26     LDA ram_матч
C - - - - - 0x000136 00:8126: C9 20     CMP #$20      ; замена номера звука на экране с тренером у последней команды
C - - - - - 0x000138 00:8128: 90 02     BCC bra_812C_это_не_последний_матч
C - - - - - 0x00013A 00:812A: A2 4C     LDX #$4C
bra_812C_это_не_последний_матч:
C - - - - - 0x00013C 00:812C: 8E 00 07  STX ram_звук
C - - - - - 0x00013F 00:812F: A9 00     LDA #$00
C - - - - - 0x000141 00:8131: 8D 50 04  STA ram_счетчик_замен
C - - - - - 0x000144 00:8134: 8D 51 04  STA ram_забаненный_игрок
C - - - - - 0x000147 00:8137: 8D 52 04  STA ram_забаненный_игрок + $01
C - - - - - 0x00014A 00:813A: 8D 53 04  STA ram_забаненный_игрок + $02
C - - - - - 0x00014D 00:813D: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x00014F 00:813F: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000152 00:8142: 20 09 A0  JSR sub_0x00265C
C - - - - - 0x000155 00:8145: 24 E0     BIT ram_00E0
C - - - - - 0x000157 00:8147: 30 06     BMI bra_814F
C - - - - - 0x000159 00:8149: A5 E4     LDA ram_00E4
C - - - - - 0x00015B 00:814B: C5 26     CMP ram_матч
C - - - - - 0x00015D 00:814D: B0 14     BCS bra_8163
bra_814F:
C - - - - - 0x00015F 00:814F: AE 26 00  LDX ram_матч
C - - - - - 0x000162 00:8152: BD DC 83  LDA tbl_83DC_катсцена_перед_матчем,X
C - - - - - 0x000165 00:8155: F0 0C     BEQ bra_8163
C - - - - - 0x000167 00:8157: 20 64 84  JSR sub_8464_воспроизвести_катсцену
C - - - - - 0x00016A 00:815A: 20 B5 82  JSR sub_82B5_попытка_пропуска_катсцены
C - - - - - 0x00016D 00:815D: A5 E0     LDA ram_00E0
C - - - - - 0x00016F 00:815F: 29 7F     AND #$7F
C - - - - - 0x000171 00:8161: 85 E0     STA ram_00E0
bra_8163:
C - - - - - 0x000173 00:8163: 4C 17 80  JMP loc_8017



ofs_000_8166_00_закончился_первый_тайм:
C - - - - - 0x000176 00:8166: A9 01     LDA #$01
C - - - - - 0x000178 00:8168: 85 27     STA ram_номер_тайма
C - - - - - 0x00017A 00:816A: 20 6C C5  JSR sub_0x03D032_восстановить_энергию_в_перерыве
C - - - - - 0x00017D 00:816D: 20 85 82  JSR sub_8285_перерыв
C - - - - - 0x000180 00:8170: A5 26     LDA ram_матч
C - - - - - 0x000182 00:8172: C5 E4     CMP ram_00E4
C - - - - - 0x000184 00:8174: F0 12     BEQ bra_8188_не_воспроизводить_катсцену
C - - - - - 0x000186 00:8176: 90 10     BCC bra_8188_не_воспроизводить_катсцену
C - - - - - 0x000188 00:8178: 85 E4     STA ram_00E4
C - - - - - 0x00018A 00:817A: AE 26 00  LDX ram_матч
C - - - - - 0x00018D 00:817D: BD FE 83  LDA tbl_83FE_катсцена_после_первого_тайма,X
C - - - - - 0x000190 00:8180: F0 06     BEQ bra_8188_не_воспроизводить_катсцену
C - - - - - 0x000192 00:8182: 20 64 84  JSR sub_8464_воспроизвести_катсцену
C - - - - - 0x000195 00:8185: 20 B5 82  JSR sub_82B5_попытка_пропуска_катсцены
bra_8188_не_воспроизводить_катсцену:
C - - - - - 0x000198 00:8188: 4C 17 80  JMP loc_8017



ofs_000_818B_01_закончился_второй_тайм:
C - - - - - 0x00019B 00:818B: A5 28     LDA ram_голы
C - - - - - 0x00019D 00:818D: C5 29     CMP ram_голы + $01
C - - - - - 0x00019F 00:818F: F0 05     BEQ bra_8196_ничья
C - - - - - 0x0001A1 00:8191: B0 73     BCS bra_8206_наша_команда_победила
C - - - - - 0x0001A3 00:8193: 4C E6 81  JMP loc_81E6_поражение
bra_8196_ничья:
C - - - - - 0x0001A6 00:8196: A6 26     LDX ram_матч
C - - - - - 0x0001A8 00:8198: BD BA 83  LDA tbl_83BA_наличие_овертайма_и_пк,X
C - - - - - 0x0001AB 00:819B: F0 49     BEQ bra_81E6_ничья
C - - - - - 0x0001AD 00:819D: C9 01     CMP #$01
C - - - - - 0x0001AF 00:819F: F0 33     BEQ bra_81D4_начать_пенальти
C - - - - - 0x0001B1 00:81A1: A9 02     LDA #$02
C - - - - - 0x0001B3 00:81A3: 85 27     STA ram_номер_тайма
C - - - - - 0x0001B5 00:81A5: 20 6C C5  JSR sub_0x03D032_восстановить_энергию_в_перерыве
C - - - - - 0x0001B8 00:81A8: 20 85 82  JSR sub_8285_перерыв
C - - - - - 0x0001BB 00:81AB: 4C 17 80  JMP loc_8017



ofs_000_81AE_02:
C - - - - - 0x0001BE 00:81AE: A9 03     LDA #$03
C - - - - - 0x0001C0 00:81B0: 85 27     STA ram_номер_тайма
C - - - - - 0x0001C2 00:81B2: 4C 17 80  JMP loc_8017



ofs_000_81B5_03_закончился_овертайм:
C - - - - - 0x0001C5 00:81B5: A5 28     LDA ram_голы
C - - - - - 0x0001C7 00:81B7: C5 29     CMP ram_голы + $01
C - - - - - 0x0001C9 00:81B9: F0 05     BEQ bra_81C0_ничья
- - - - - - 0x0001CB 00:81BB: B0 49     BCS bra_8206_наша_команда_победила
- - - - - - 0x0001CD 00:81BD: 4C E6 81  JMP loc_81E6_поражение
bra_81C0_ничья:
C - - - - - 0x0001D0 00:81C0: A6 26     LDX ram_матч
C - - - - - 0x0001D2 00:81C2: BD BA 83  LDA tbl_83BA_наличие_овертайма_и_пк,X
C - - - - - 0x0001D5 00:81C5: C9 03     CMP #$03
C - - - - - 0x0001D7 00:81C7: F0 0B     BEQ bra_81D4_начать_пенальти
; bzk garbage? в новых логах не выполнялос
; судя по коду, если в овертайме нету пк, и это не финальная бразилия
; то при ничье перейти на следующую команду, бред какой-то
- - - - - - 0x0001D9 00:81C9: A5 26     LDA ram_матч
- - - - - - 0x0001DB 00:81CB: C9 20     CMP #$20
- - - - - - 0x0001DD 00:81CD: D0 02     BNE bra_81D1_это_не_последний_матч_с_бразилией
- - - - - - 0x0001DF 00:81CF: E6 26     INC ram_матч
bra_81D1_это_не_последний_матч_с_бразилией:
- - - - - - 0x0001E1 00:81D1: 4C FD 80  JMP loc_80FD
bra_81D4_начать_пенальти:
C - - - - - 0x0001E4 00:81D4: A9 04     LDA #$04
C - - - - - 0x0001E6 00:81D6: 85 27     STA ram_номер_тайма
C - - - - - 0x0001E8 00:81D8: 4C 17 80  JMP loc_8017



ofs_000_81DB_04_закончились_пк_после_матча:
C - - - - - 0x0001EB 00:81DB: A5 28     LDA ram_голы
C - - - - - 0x0001ED 00:81DD: C5 29     CMP ram_голы + $01
C - - - - - 0x0001EF 00:81DF: F0 05     BEQ bra_81E6_ничья
C - - - - - 0x0001F1 00:81E1: B0 23     BCS bra_8206_наша_команда_победила
C - - - - - 0x0001F3 00:81E3: 4C E6 81  JMP loc_81E6_поражение    ; bzk optimize, бесполезно
bra_81E6_ничья:
loc_81E6_поражение:
C D 0 - - - 0x0001F6 00:81E6: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x0001F8 00:81E8: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0001FB 00:81EB: 20 15 A0  JSR sub_0x002F9A_начислить_опыт_за_поражение
C - - - - - 0x0001FE 00:81EE: A9 60     LDA #con_cutscene + $47      ; катсцена с обезьянкой
C - - - - - 0x000200 00:81F0: 20 64 84  JSR sub_8464_воспроизвести_катсцену
C - - - - - 0x000203 00:81F3: 20 B5 82  JSR sub_82B5_попытка_пропуска_катсцены
C - - - - - 0x000206 00:81F6: 20 F0 99  JSR sub_99F0_выход_из_экрана
C - - - - - 0x000209 00:81F9: A6 26     LDX ram_матч
C - - - - - 0x00020B 00:81FB: BD 98 83  LDA tbl_8398_номер_матча_в_случае_проигрыша,X
C - - - - - 0x00020E 00:81FE: 85 26     STA ram_матч
C - - - - - 0x000210 00:8200: 20 78 C5  JSR sub_0x03D0E1_попытка_убить_мисуги
C - - - - - 0x000213 00:8203: 4C FD 80  JMP loc_80FD
; сюда 3 перехода
bra_8206_наша_команда_победила:
C - - - - - 0x000216 00:8206: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x000218 00:8208: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00021B 00:820B: 20 12 A0  JSR sub_0x002F89_начислить_опыт_за_победу_над_командой
C - - - - - 0x00021E 00:820E: 24 E0     BIT ram_00E0
C - - - - - 0x000220 00:8210: 70 0A     BVS bra_821C
C - - - - - 0x000222 00:8212: A5 26     LDA ram_матч
C - - - - - 0x000224 00:8214: C5 E5     CMP ram_00E5
C - - - - - 0x000226 00:8216: F0 17     BEQ bra_822F_не_воспроизводить_катсцену
C - - - - - 0x000228 00:8218: 90 15     BCC bra_822F_не_воспроизводить_катсцену
C - - - - - 0x00022A 00:821A: 85 E5     STA ram_00E5
bra_821C:
C - - - - - 0x00022C 00:821C: A6 26     LDX ram_матч
C - - - - - 0x00022E 00:821E: BD 20 84  LDA tbl_8420_катсцена_после_матча,X
C - - - - - 0x000231 00:8221: F0 0C     BEQ bra_822F_не_воспроизводить_катсцену
C - - - - - 0x000233 00:8223: 20 64 84  JSR sub_8464_воспроизвести_катсцену
C - - - - - 0x000236 00:8226: 20 B5 82  JSR sub_82B5_попытка_пропуска_катсцены
C - - - - - 0x000239 00:8229: A5 E0     LDA ram_00E0
C - - - - - 0x00023B 00:822B: 29 BF     AND #$40 ^ $FF
C - - - - - 0x00023D 00:822D: 85 E0     STA ram_00E0
bra_822F_не_воспроизводить_катсцену:
C - - - - - 0x00023F 00:822F: AE 26 00  LDX ram_матч
C - - - - - 0x000242 00:8232: BD 42 84  LDA tbl_8442_катсцена_после_завершения_турнира,X
C - - - - - 0x000245 00:8235: F0 0C     BEQ bra_8243_не_воспроизводить_катсцену
loc_8237_cheat_cutscene_22:
C - - - - - 0x000247 00:8237: 20 64 84  JSR sub_8464_воспроизвести_катсцену
                                        LDA ram_матч
                                        CMP #$20
                                        BCS bra_8263_это_последний_матч
                                        JSR sub_82B5_попытка_пропуска_катсцены
bra_8243_не_воспроизводить_катсцену:
C - - - - - 0x000253 00:8243: A9 01     LDA #$01
C - - - - - 0x000255 00:8245: 8D 00 07  STA ram_звук
C - - - - - 0x000258 00:8248: 20 78 C5  JSR sub_0x03D0E1_попытка_убить_мисуги
C - - - - - 0x00025B 00:824B: E6 26     INC ram_матч
C - - - - - 0x00025D 00:824D: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x00025F 00:824F: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000262 00:8252: 20 18 A0  JSR sub_0x003060_передать_опыт_игроков_другой_команде
C - - - - - 0x000265 00:8255: A5 26     LDA ram_матч
C - - - - - 0x000267 00:8257: C9 03     CMP #$03
C - - - - - 0x000269 00:8259: 90 05     BCC bra_8260_еще_не_матч_против_меона
; запись драйв оверхеда цубасе
C - - - - - 0x00026B 00:825B: A2 05     LDX #$05
C - - - - - 0x00026D 00:825D: 8E 46 04  STX ram_флаг_драйв_оверхеда
bra_8260_еще_не_матч_против_меона:
C - - - - - 0x000270 00:8260: 4C FD 80  JMP loc_80FD
bra_8263_это_последний_матч:
                                        JSR sub_82A9_ожидание_завершения_катсцены
C - - - - - 0x000273 00:8263: A9 05     LDA #$05
C - - - - - 0x000275 00:8265: 85 27     STA ram_номер_тайма
C - - - - - 0x000277 00:8267: 4C 7B C5  JMP loc_0x03C6CE



loc_826A:
C D 0 - - - 0x00027A 00:826A: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x00027C 00:826C: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
; сработал при выборе continue
C - - - - - 0x00027F 00:826F: 20 03 A0  JSR sub_0x00211D_экран_continue
; незалогированный код выполнится после ввода правильного пароля
C - - - - - 0x000282 00:8272: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x000284 00:8274: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000287 00:8277: 20 0F A2  JSR sub_0x00487E_номера_игроков_и_расстановка_твоей_команды
C - - - - - 0x00028A 00:827A: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x00028C 00:827C: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00028F 00:827F: 20 1B A0  JSR sub_0x0023AB
C - - - - - 0x000292 00:8282: 4C FD 80  JMP loc_80FD



sub_8285_перерыв:
C - - - - - 0x000295 00:8285: A9 01     LDA #$01
C - - - - - 0x000297 00:8287: 8D 00 07  STA ram_звук
C - - - - - 0x00029A 00:828A: A9 01     LDA #$01
C - - - - - 0x00029C 00:828C: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00029F 00:828F: A2 01     LDX #con_prg_bank + $01
C - - - - - 0x0002A1 00:8291: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0002A4 00:8294: 4C 0C A0  JMP loc_0x0026E2_перерыв



sub_82A9_ожидание_завершения_катсцены:
sub_0x0002B9_ожидание_завершения_катсцены:
bra_82A9_loop:
C - - - - - 0x0002B9 00:82A9: A9 01     LDA #$01
C - - - - - 0x0002BB 00:82AB: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0002BE 00:82AE: A5 4D     LDA ram_004D
C - - - - - 0x0002C0 00:82B0: 05 4E     ORA ram_004E
C - - - - - 0x0002C2 00:82B2: D0 F5     BNE bra_82A9_loop
C - - - - - 0x0002C4 00:82B4: 60        RTS



sub_82B5_попытка_пропуска_катсцены:
bra_82B5_loop:
C - - - - - 0x0002C5 00:82B5: A9 01     LDA #$01
C - - - - - 0x0002C7 00:82B7: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0002CA 00:82BA: A5 4D     LDA ram_004D
C - - - - - 0x0002CC 00:82BC: 05 4E     ORA ram_004E
C - - - - - 0x0002CE 00:82BE: F0 06     BEQ bra_82C6
C - - - - - 0x0002D0 00:82C0: A5 1E     LDA ram_btn_press
C - - - - - 0x0002D2 00:82C2: 29 20     AND #con_btn_Select
C - - - - - 0x0002D4 00:82C4: F0 EF     BEQ bra_82B5_loop
bra_82C6:
C - - - - - 0x0002D6 00:82C6: A9 00     LDA #$00
C - - - - - 0x0002D8 00:82C8: 85 05     STA ram_0005
C - - - - - 0x0002DA 00:82CA: 85 06     STA ram_0006
C - - - - - 0x0002DC 00:82CC: 85 09     STA ram_0009
C - - - - - 0x0002DE 00:82CE: 85 0A     STA ram_000A
C - - - - - 0x0002E0 00:82D0: 85 11     STA ram_0011
C - - - - - 0x0002E2 00:82D2: 85 12     STA ram_0012
C - - - - - 0x0002E4 00:82D4: 85 0D     STA ram_000D
C - - - - - 0x0002E6 00:82D6: 85 0E     STA ram_000E
C - - - - - 0x0002E8 00:82D8: 85 4C     STA ram_004C
C - - - - - 0x0002EA 00:82DA: A9 01     LDA #$01
C - - - - - 0x0002EC 00:82DC: 8D 00 07  STA ram_звук
C - - - - - 0x0002EF 00:82DF: 20 A0 9B  JSR sub_9BA0
C - - - - - 0x0002F2 00:82E2: A9 00     LDA #$00
C - - - - - 0x0002F4 00:82E4: 85 44     STA ram_0044
C - - - - - 0x0002F6 00:82E6: 85 45     STA ram_0045
C - - - - - 0x0002F8 00:82E8: 85 7A     STA ram_007A
C - - - - - 0x0002FA 00:82EA: 85 7B     STA ram_007B
C - - - - - 0x0002FC 00:82EC: 60        RTS



loc_82ED:
ofs_0x0002FD:
bra_82ED_loop:
C D 0 - - - 0x0002FD 00:82ED: 20 8A 83  JSR sub_838A
C - - - - - 0x000300 00:82F0: A5 4C     LDA ram_004C
C - - - - - 0x000302 00:82F2: 10 F9     BPL bra_82ED_loop
C - - - - - 0x000304 00:82F4: 0A        ASL
C - - - - - 0x000305 00:82F5: AA        TAX
C - - - - - 0x000306 00:82F6: BD 00 B8  LDA tbl_0x00D810,X
C - - - - - 0x000309 00:82F9: 85 EC     STA ram_00EC
C - - - - - 0x00030B 00:82FB: BD 01 B8  LDA tbl_0x00D810 + $01,X
C - - - - - 0x00030E 00:82FE: 85 ED     STA ram_00ED
C - - - - - 0x000310 00:8300: A0 00     LDY #$00
C - - - - - 0x000312 00:8302: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000314 00:8304: 30 4F     BMI bra_8355
C - - - - - 0x000316 00:8306: 85 E9     STA ram_00E9
bra_8308_loop:
C - - - - - 0x000318 00:8308: A9 01     LDA #$01
C - - - - - 0x00031A 00:830A: 85 EB     STA ram_00EB
loc_830C:
C D 0 - - - 0x00031C 00:830C: A4 EB     LDY ram_00EB
C - - - - - 0x00031E 00:830E: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000320 00:8310: C9 FE     CMP #$FE
C - - - - - 0x000322 00:8312: F0 F4     BEQ bra_8308_loop
C - - - - - 0x000324 00:8314: C9 FF     CMP #$FF
C - - - - - 0x000326 00:8316: F0 6B     BEQ bra_8383
C - - - - - 0x000328 00:8318: 85 EA     STA ram_00EA
C - - - - - 0x00032A 00:831A: A6 E9     LDX ram_00E9
C - - - - - 0x00032C 00:831C: A9 03     LDA #$03
C - - - - - 0x00032E 00:831E: 85 EB     STA ram_00EB
bra_8320_loop:
C - - - - - 0x000330 00:8320: C8        INY
C - - - - - 0x000331 00:8321: E8        INX
C - - - - - 0x000332 00:8322: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000334 00:8324: F0 03     BEQ bra_8329
C - - - - - 0x000336 00:8326: 9D 2A 06  STA ram_062A,X
bra_8329:
C - - - - - 0x000339 00:8329: C6 EB     DEC ram_00EB
C - - - - - 0x00033B 00:832B: D0 F3     BNE bra_8320_loop
C - - - - - 0x00033D 00:832D: C8        INY
C - - - - - 0x00033E 00:832E: 84 EB     STY ram_00EB
bra_8330_loop:
C - - - - - 0x000340 00:8330: A9 20     LDA #$20
C - - - - - 0x000342 00:8332: 18        CLC
C - - - - - 0x000343 00:8333: 6D 28 06  ADC ram_индекс_буфера
C - - - - - 0x000346 00:8336: C9 3D     CMP #$3D
C - - - - - 0x000348 00:8338: 90 0A     BCC bra_8344
C - - - - - 0x00034A 00:833A: 20 8A 83  JSR sub_838A
C - - - - - 0x00034D 00:833D: A5 4C     LDA ram_004C
C - - - - - 0x00034F 00:833F: 30 EF     BMI bra_8330_loop
C - - - - - 0x000351 00:8341: 4C 83 83  JMP loc_8383
bra_8344:
C - - - - - 0x000354 00:8344: 20 43 9A  JSR sub_9A43
bra_8347_loop:
C - - - - - 0x000357 00:8347: 20 8A 83  JSR sub_838A
C - - - - - 0x00035A 00:834A: A5 4C     LDA ram_004C
C - - - - - 0x00035C 00:834C: 10 35     BPL bra_8383
C - - - - - 0x00035E 00:834E: C6 EA     DEC ram_00EA
C - - - - - 0x000360 00:8350: D0 F5     BNE bra_8347_loop
C - - - - - 0x000362 00:8352: 4C 0C 83  JMP loc_830C
bra_8355:
C - - - - - 0x000365 00:8355: 29 01     AND #$01
C - - - - - 0x000367 00:8357: 85 E9     STA ram_00E9
bra_8359_loop:
C - - - - - 0x000369 00:8359: A9 01     LDA #$01
C - - - - - 0x00036B 00:835B: 85 EB     STA ram_00EB
loc_835D:
C D 0 - - - 0x00036D 00:835D: A4 EB     LDY ram_00EB
C - - - - - 0x00036F 00:835F: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000371 00:8361: C9 FE     CMP #$FE
C - - - - - 0x000373 00:8363: F0 F4     BEQ bra_8359_loop
C - - - - - 0x000375 00:8365: C9 FF     CMP #$FF
C - - - - - 0x000377 00:8367: F0 1A     BEQ bra_8383
C - - - - - 0x000379 00:8369: A6 E9     LDX ram_00E9
C - - - - - 0x00037B 00:836B: 95 8E     STA ram_008E,X
C - - - - - 0x00037D 00:836D: C8        INY
C - - - - - 0x00037E 00:836E: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000380 00:8370: 85 EA     STA ram_00EA
C - - - - - 0x000382 00:8372: C8        INY
C - - - - - 0x000383 00:8373: 84 EB     STY ram_00EB
bra_8375_loop:
C - - - - - 0x000385 00:8375: 20 8A 83  JSR sub_838A
C - - - - - 0x000388 00:8378: A5 4C     LDA ram_004C
C - - - - - 0x00038A 00:837A: 10 07     BPL bra_8383
C - - - - - 0x00038C 00:837C: C6 EA     DEC ram_00EA
C - - - - - 0x00038E 00:837E: D0 F5     BNE bra_8375_loop
C - - - - - 0x000390 00:8380: 4C 5D 83  JMP loc_835D
bra_8383:
loc_8383:
C D 0 - - - 0x000393 00:8383: A9 00     LDA #$00
C - - - - - 0x000395 00:8385: 85 4C     STA ram_004C
C - - - - - 0x000397 00:8387: 4C ED 82  JMP loc_82ED



sub_838A:
C - - - - - 0x00039A 00:838A: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x00039C 00:838C: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00039F 00:838F: 20 15 A2  JSR sub_0x0048DE
C - - - - - 0x0003A2 00:8392: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x0003A4 00:8394: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0003A7 00:8397: 60        RTS



tbl_8398_номер_матча_в_случае_проигрыша:
- D 0 - - - 0x0003A8 00:8398: 00        .byte $00    ; 00
- D 0 - - - 0x0003A9 00:8399: 00        .byte $00    ; 01
- D 0 - - - 0x0003AA 00:839A: 02        .byte $02    ; 02
- D 0 - - - 0x0003AB 00:839B: 02        .byte $02    ; 03
- D 0 - - - 0x0003AC 00:839C: 04        .byte $04    ; 04
- D 0 - - - 0x0003AD 00:839D: 04        .byte $04    ; 05
- D 0 - - - 0x0003AE 00:839E: 06        .byte $06    ; 06
- D 0 - - - 0x0003AF 00:839F: 06        .byte $06    ; 07
- D 0 - - - 0x0003B0 00:83A0: 08        .byte $08    ; 08
- D 0 - - - 0x0003B1 00:83A1: 08        .byte $08    ; 09
- D 0 - - - 0x0003B2 00:83A2: 0A        .byte $0A    ; 0A
- D 0 - - - 0x0003B3 00:83A3: 0A        .byte $0A    ; 0B
- D 0 - - - 0x0003B4 00:83A4: 0C        .byte $0C    ; 0C
- D 0 - - - 0x0003B5 00:83A5: 0C        .byte $0C    ; 0D
- D 0 - - - 0x0003B6 00:83A6: 0E        .byte $0E    ; 0E
- D 0 - - - 0x0003B7 00:83A7: 0E        .byte $0E    ; 0F
- D 0 - - - 0x0003B8 00:83A8: 10        .byte $10    ; 10
- D 0 - - - 0x0003B9 00:83A9: 10        .byte $10    ; 11
- D 0 - - - 0x0003BA 00:83AA: 12        .byte $12    ; 12
- D 0 - - - 0x0003BB 00:83AB: 12        .byte $12    ; 13
- D 0 - - - 0x0003BC 00:83AC: 14        .byte $14    ; 14
- D 0 - - - 0x0003BD 00:83AD: 14        .byte $14    ; 15
- D 0 - - - 0x0003BE 00:83AE: 16        .byte $16    ; 16
- D 0 - - - 0x0003BF 00:83AF: 17        .byte $17    ; 17
- D 0 - - - 0x0003C0 00:83B0: 17        .byte $17    ; 18
- D 0 - - - 0x0003C1 00:83B1: 19        .byte $19    ; 19
- D 0 - - - 0x0003C2 00:83B2: 19        .byte $19    ; 1A
- D 0 - - - 0x0003C3 00:83B3: 1B        .byte $1B    ; 1B
- D 0 - - - 0x0003C4 00:83B4: 1B        .byte $1B    ; 1C
- D 0 - - - 0x0003C5 00:83B5: 1D        .byte $1D    ; 1D
- D 0 - - - 0x0003C6 00:83B6: 1D        .byte $1D    ; 1E
- D 0 - - - 0x0003C7 00:83B7: 1F        .byte $1F    ; 1F
- D 0 - - - 0x0003C8 00:83B8: 1F        .byte $1F    ; 20



tbl_83BA_наличие_овертайма_и_пк:
; таблица, в которой указано будут ли пенальти и будет ли овертайм при ничье
; 00 = ??? предположительно отсутствие овертайма и пк (только для васко да гама)
; 01 = после перых двух матчей сразу пенальти
; 02 = никаких пенальти (только для бразилии)
; 03 = есть и овертайм и пенальти
- - - - - - 0x0003CA 00:83BA: 03        .byte $03    ; 00
- - - - - - 0x0003CB 00:83BB: 03        .byte $03    ; 01
- D 0 - - - 0x0003CC 00:83BC: 03        .byte $03    ; 02
- - - - - - 0x0003CD 00:83BD: 03        .byte $03    ; 03
- - - - - - 0x0003CE 00:83BE: 03        .byte $03    ; 04
- - - - - - 0x0003CF 00:83BF: 03        .byte $03    ; 05
- D 0 - - - 0x0003D0 00:83C0: 01        .byte $01    ; 06
- - - - - - 0x0003D1 00:83C1: 01        .byte $01    ; 07
- - - - - - 0x0003D2 00:83C2: 01        .byte $01    ; 08
- - - - - - 0x0003D3 00:83C3: 01        .byte $01    ; 09
- - - - - - 0x0003D4 00:83C4: 01        .byte $01    ; 0A
- - - - - - 0x0003D5 00:83C5: 03        .byte $03    ; 0B
- - - - - - 0x0003D6 00:83C6: 03        .byte $03    ; 0C
- - - - - - 0x0003D7 00:83C7: 03        .byte $03    ; 0D
- - - - - - 0x0003D8 00:83C8: 03        .byte $03    ; 0E
- - - - - - 0x0003D9 00:83C9: 03        .byte $03    ; 0F
- - - - - - 0x0003DA 00:83CA: 03        .byte $03    ; 10
- - - - - - 0x0003DB 00:83CB: 03        .byte $03    ; 11
- - - - - - 0x0003DC 00:83CC: 03        .byte $03    ; 12
- - - - - - 0x0003DD 00:83CD: 03        .byte $03    ; 13
- - - - - - 0x0003DE 00:83CE: 03        .byte $03    ; 14
- - - - - - 0x0003DF 00:83CF: 03        .byte $03    ; 15
- - - - - - 0x0003E0 00:83D0: 00        .byte $00    ; 16
- - - - - - 0x0003E1 00:83D1: 03        .byte $03    ; 17
- - - - - - 0x0003E2 00:83D2: 03        .byte $03    ; 18
- - - - - - 0x0003E3 00:83D3: 03        .byte $03    ; 19
- - - - - - 0x0003E4 00:83D4: 03        .byte $03    ; 1A
- - - - - - 0x0003E5 00:83D5: 03        .byte $03    ; 1B
- - - - - - 0x0003E6 00:83D6: 03        .byte $03    ; 1C
- - - - - - 0x0003E7 00:83D7: 03        .byte $03    ; 1D
- - - - - - 0x0003E8 00:83D8: 03        .byte $03    ; 1E
- - - - - - 0x0003E9 00:83D9: 03        .byte $03    ; 1F
- - - - - - 0x0003EA 00:83DA: 02        .byte $02    ; 20



tbl_83DC_катсцена_перед_матчем:
; 00 = пропуск, остальные это номера катсцен
- D 0 - - - 0x0003EC 00:83DC: 02        .byte con_cutscene + $02    ; 00
- D 0 - - - 0x0003ED 00:83DD: 00        .byte $00    ; 01
- D 0 - - - 0x0003EE 00:83DE: 00        .byte $00    ; 02
- D 0 - - - 0x0003EF 00:83DF: 00        .byte $00    ; 03
- D 0 - - - 0x0003F0 00:83E0: 00        .byte $00    ; 04
- D 0 - - - 0x0003F1 00:83E1: 07        .byte con_cutscene + $07    ; 05
- D 0 - - - 0x0003F2 00:83E2: 00        .byte $00    ; 06
- D 0 - - - 0x0003F3 00:83E3: 00        .byte $00    ; 07
- D 0 - - - 0x0003F4 00:83E4: 00        .byte $00    ; 08
- D 0 - - - 0x0003F5 00:83E5: 00        .byte $00    ; 09
- D 0 - - - 0x0003F6 00:83E6: 0C        .byte con_cutscene + $0C    ; 0A
- D 0 - - - 0x0003F7 00:83E7: 0E        .byte con_cutscene + $0E    ; 0B
- D 0 - - - 0x0003F8 00:83E8: 00        .byte $00    ; 0C
- D 0 - - - 0x0003F9 00:83E9: 00        .byte $00    ; 0D
- D 0 - - - 0x0003FA 00:83EA: 10        .byte con_cutscene + $10    ; 0E
- D 0 - - - 0x0003FB 00:83EB: 12        .byte con_cutscene + $12    ; 0F
- D 0 - - - 0x0003FC 00:83EC: 00        .byte $00    ; 10
- D 0 - - - 0x0003FD 00:83ED: 00        .byte $00    ; 11
- D 0 - - - 0x0003FE 00:83EE: 00        .byte $00    ; 12
- D 0 - - - 0x0003FF 00:83EF: 00        .byte $00    ; 13
- D 0 - - - 0x000400 00:83F0: 00        .byte $00    ; 14
- D 0 - - - 0x000401 00:83F1: 00        .byte $00    ; 15
- D 0 - - - 0x000402 00:83F2: 00        .byte $00    ; 16
- D 0 - - - 0x000403 00:83F3: 00        .byte $00    ; 17
- D 0 - - - 0x000404 00:83F4: 00        .byte $00    ; 18
- D 0 - - - 0x000405 00:83F5: 00        .byte $00    ; 19
- D 0 - - - 0x000406 00:83F6: 18        .byte con_cutscene + $18    ; 1A
- D 0 - - - 0x000407 00:83F7: 00        .byte $00    ; 1B
- D 0 - - - 0x000408 00:83F8: 00        .byte $00    ; 1C
- D 0 - - - 0x000409 00:83F9: 00        .byte $00    ; 1D
- D 0 - - - 0x00040A 00:83FA: 00        .byte $00    ; 1E
- D 0 - - - 0x00040B 00:83FB: 1E        .byte con_cutscene + $1E    ; 1F
- D 0 - - - 0x00040C 00:83FC: 20        .byte con_cutscene + $20    ; 20



tbl_83FE_катсцена_после_первого_тайма:
; bzk optimize, нужно только для двух матчей. удобно, но не экономично
- - - - - - 0x00040E 00:83FE: 00        .byte $00    ; 00
- D 0 - - - 0x00040F 00:83FF: 00        .byte $00    ; 01
- D 0 - - - 0x000410 00:8400: 00        .byte $00    ; 02
- D 0 - - - 0x000411 00:8401: 00        .byte $00    ; 03
- D 0 - - - 0x000412 00:8402: 00        .byte $00    ; 04
- D 0 - - - 0x000413 00:8403: 00        .byte $00    ; 05
- D 0 - - - 0x000414 00:8404: 00        .byte $00    ; 06
- D 0 - - - 0x000415 00:8405: 00        .byte $00    ; 07
- D 0 - - - 0x000416 00:8406: 00        .byte $00    ; 08
- D 0 - - - 0x000417 00:8407: 0A        .byte con_cutscene + $0A    ; 09 мисуги
- D 0 - - - 0x000418 00:8408: 00        .byte $00    ; 0A
- D 0 - - - 0x000419 00:8409: 00        .byte $00    ; 0B
- D 0 - - - 0x00041A 00:840A: 00        .byte $00    ; 0C
- D 0 - - - 0x00041B 00:840B: 00        .byte $00    ; 0D
- D 0 - - - 0x00041C 00:840C: 00        .byte $00    ; 0E
- D 0 - - - 0x00041D 00:840D: 00        .byte $00    ; 0F
- D 0 - - - 0x00041E 00:840E: 00        .byte $00    ; 10
- D 0 - - - 0x00041F 00:840F: 00        .byte $00    ; 11
- D 0 - - - 0x000420 00:8410: 00        .byte $00    ; 12
- D 0 - - - 0x000421 00:8411: 00        .byte $00    ; 13
- D 0 - - - 0x000422 00:8412: 00        .byte $00    ; 14
- D 0 - - - 0x000423 00:8413: 00        .byte $00    ; 15
- D 0 - - - 0x000424 00:8414: 00        .byte $00    ; 16
- D 0 - - - 0x000425 00:8415: 00        .byte $00    ; 17
- D 0 - - - 0x000426 00:8416: 00        .byte $00    ; 18
- D 0 - - - 0x000427 00:8417: 00        .byte $00    ; 19
- D 0 - - - 0x000428 00:8418: 00        .byte $00    ; 1A
- D 0 - - - 0x000429 00:8419: 00        .byte $00    ; 1B
- D 0 - - - 0x00042A 00:841A: 00        .byte $00    ; 1C
- D 0 - - - 0x00042B 00:841B: 00        .byte $00    ; 1D
- D 0 - - - 0x00042C 00:841C: 00        .byte $00    ; 1E
- D 0 - - - 0x00042D 00:841D: 00        .byte $00    ; 1F
- D 0 - - - 0x00042E 00:841E: 21        .byte con_cutscene + $21    ; 20 бразилия



tbl_8420_катсцена_после_матча:
- D 0 - - - 0x000430 00:8420: 03        .byte con_cutscene + $03    ; 00
- D 0 - - - 0x000431 00:8421: 04        .byte con_cutscene + $04    ; 01
- D 0 - - - 0x000432 00:8422: 05        .byte con_cutscene + $05    ; 02
- D 0 - - - 0x000433 00:8423: 00        .byte $00    ; 03
- D 0 - - - 0x000434 00:8424: 06        .byte con_cutscene + $06    ; 04
- D 0 - - - 0x000435 00:8425: 00        .byte $00    ; 05
- D 0 - - - 0x000436 00:8426: 00        .byte $00    ; 06
- D 0 - - - 0x000437 00:8427: 00        .byte $00    ; 07
- D 0 - - - 0x000438 00:8428: 00        .byte $00    ; 08
- D 0 - - - 0x000439 00:8429: 0B        .byte con_cutscene + $0B    ; 09
- D 0 - - - 0x00043A 00:842A: 0D        .byte $0D    ; 0A
- D 0 - - - 0x00043B 00:842B: 00        .byte $00    ; 0B
- D 0 - - - 0x00043C 00:842C: 00        .byte $00    ; 0C
- D 0 - - - 0x00043D 00:842D: 00        .byte $00    ; 0D
- D 0 - - - 0x00043E 00:842E: 11        .byte con_cutscene + $11    ; 0E
- D 0 - - - 0x00043F 00:842F: 00        .byte $00    ; 0F
- D 0 - - - 0x000440 00:8430: 00        .byte $00    ; 10
- D 0 - - - 0x000441 00:8431: 14        .byte con_cutscene + $14    ; 11
- D 0 - - - 0x000442 00:8432: 00        .byte $00    ; 12
- D 0 - - - 0x000443 00:8433: 00        .byte $00    ; 13
- D 0 - - - 0x000444 00:8434: 00        .byte $00    ; 14
- D 0 - - - 0x000445 00:8435: 00        .byte $00    ; 15
- D 0 - - - 0x000446 00:8436: 16        .byte con_cutscene + $16    ; 16
- D 0 - - - 0x000447 00:8437: 00        .byte $00    ; 17
- D 0 - - - 0x000448 00:8438: 17        .byte con_cutscene + $17    ; 18
- D 0 - - - 0x000449 00:8439: 00        .byte $00    ; 19
- D 0 - - - 0x00044A 00:843A: 00        .byte $00    ; 1A
- D 0 - - - 0x00044B 00:843B: 1A        .byte con_cutscene + $1A    ; 1B
- D 0 - - - 0x00044C 00:843C: 1B        .byte con_cutscene + $1B    ; 1C
- D 0 - - - 0x00044D 00:843D: 1C        .byte con_cutscene + $1C    ; 1D
- D 0 - - - 0x00044E 00:843E: 1D        .byte con_cutscene + $1D    ; 1E
- D 0 - - - 0x00044F 00:843F: 1F        .byte con_cutscene + $1F    ; 1F
- D 0 - - - 0x000450 00:8440: 00        .byte $00    ; 20



tbl_8442_катсцена_после_завершения_турнира:
- D 0 - - - 0x000452 00:8442: 00        .byte $00    ; 00
- D 0 - - - 0x000453 00:8443: 00        .byte $00    ; 01
- D 0 - - - 0x000454 00:8444: 00        .byte $00    ; 02
- D 0 - - - 0x000455 00:8445: 00        .byte $00    ; 03
- D 0 - - - 0x000456 00:8446: 00        .byte $00    ; 04
- D 0 - - - 0x000457 00:8447: 08        .byte $08    ; 05
- D 0 - - - 0x000458 00:8448: 00        .byte $00    ; 06
- D 0 - - - 0x000459 00:8449: 00        .byte $00    ; 07
- D 0 - - - 0x00045A 00:844A: 00        .byte $00    ; 08
- D 0 - - - 0x00045B 00:844B: 00        .byte $00    ; 09
- D 0 - - - 0x00045C 00:844C: 00        .byte $00    ; 0A
- D 0 - - - 0x00045D 00:844D: 0F        .byte con_cutscene + $0F    ; 0B
- D 0 - - - 0x00045E 00:844E: 00        .byte $00    ; 0C
- D 0 - - - 0x00045F 00:844F: 00        .byte $00    ; 0D
- D 0 - - - 0x000460 00:8450: 00        .byte $00    ; 0E
- D 0 - - - 0x000461 00:8451: 13        .byte con_cutscene + $13    ; 0F
- D 0 - - - 0x000462 00:8452: 00        .byte $00    ; 10
- D 0 - - - 0x000463 00:8453: 00        .byte $00    ; 11
- D 0 - - - 0x000464 00:8454: 00        .byte $00    ; 12
- D 0 - - - 0x000465 00:8455: 00        .byte $00    ; 13
- D 0 - - - 0x000466 00:8456: 00        .byte $00    ; 14
- D 0 - - - 0x000467 00:8457: 15        .byte con_cutscene + $15    ; 15
- D 0 - - - 0x000468 00:8458: 00        .byte $00    ; 16
- D 0 - - - 0x000469 00:8459: 00        .byte $00    ; 17
- D 0 - - - 0x00046A 00:845A: 00        .byte $00    ; 18
- D 0 - - - 0x00046B 00:845B: 00        .byte $00    ; 19
- D 0 - - - 0x00046C 00:845C: 19        .byte con_cutscene + $19    ; 1A
- D 0 - - - 0x00046D 00:845D: 00        .byte $00    ; 1B
- D 0 - - - 0x00046E 00:845E: 00        .byte $00    ; 1C
- D 0 - - - 0x00046F 00:845F: 00        .byte $00    ; 1D
- D 0 - - - 0x000470 00:8460: 00        .byte $00    ; 1E
- D 0 - - - 0x000471 00:8461: 00        .byte $00    ; 1F
- D 0 - - - 0x000472 00:8462: 22        .byte con_cutscene + $22    ; 20



sub_8464_воспроизвести_катсцену:
sub_0x000474_воспроизвести_катсцену:
; код сравнивает номер катсцены с максимальным байтом
; если катсцена превышает максимальный байт, код вычитает этот байт, чтобы считать поинтеры из начала банка
; и выбирает соответствующий номер банка при помощи уже настроенного Y
; bzk optimize, сделать нормальную таблицу с поинтерами и номером банка
C - - - - - 0x000474 00:8464: A0 00     LDY #$00
bra_8466_loop:
C - - - - - 0x000476 00:8466: C8        INY
C - - - - - 0x000477 00:8467: C8        INY
C - - - - - 0x000478 00:8468: D9 EE 8A  CMP tbl_8AEE,Y
C - - - - - 0x00047B 00:846B: B0 F9     BCS bra_8466_loop
C - - - - - 0x00047D 00:846D: 38        SEC
C - - - - - 0x00047E 00:846E: F9 EC 8A  SBC tbl_8AEE - $02,Y
C - - - - - 0x000481 00:8471: BE ED 8A  LDX tbl_8AEE - $01,Y
C - - - - - 0x000484 00:8474: 0A        ASL
; поинтеры в ADC всегда должны быть 00 и A0
C - - - - - 0x000485 00:8475: 69 00     ADC #$00
C - - - - - 0x000487 00:8477: 85 4D     STA ram_004D
C - - - - - 0x000489 00:8479: A9 00     LDA #$00
C - - - - - 0x00048B 00:847B: 69 A0     ADC #$A0
C - - - - - 0x00048D 00:847D: 85 4E     STA ram_004E
C - - - - - 0x00048F 00:847F: 86 56     STX ram_0056
C - - - - - 0x000491 00:8481: A5 25     LDA ram_for_5115
C - - - - - 0x000493 00:8483: 85 ED     STA ram_00ED
C - - - - - 0x000495 00:8485: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000498 00:8488: A0 00     LDY #$00
C - - - - - 0x00049A 00:848A: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00049C 00:848C: AA        TAX
C - - - - - 0x00049D 00:848D: C8        INY
C - - - - - 0x00049E 00:848E: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0004A0 00:8490: 85 4E     STA ram_004E
C - - - - - 0x0004A2 00:8492: 86 4D     STX ram_004D
C - - - - - 0x0004A4 00:8494: A2 05     LDX #$05
C - - - - - 0x0004A6 00:8496: A9 C5     LDA #< (ofs_84C6 - $01)
C - - - - - 0x0004A8 00:8498: 95 00     STA ram_0000,X
C - - - - - 0x0004AA 00:849A: A9 84     LDA #> (ofs_84C6 - $01)
C - - - - - 0x0004AC 00:849C: 95 01     STA ram_0001,X
C - - - - - 0x0004AE 00:849E: A0 50     LDY #$50 - $02
C - - - - - 0x0004B2 00:84A2: 20 69 9F  JSR sub_9F69
C - - - - - 0x0004B5 00:84A5: A9 00     LDA #$00
C - - - - - 0x0004B7 00:84A7: 85 0D     STA ram_000D
C - - - - - 0x0004B9 00:84A9: 85 0E     STA ram_000E
C - - - - - 0x0004BD 00:84AD: 8D 52 06  STA ram_рот_чарли_hi
C - - - - - 0x0004C0 00:84B0: A9 E0     LDA #$E0
C - - - - - 0x0004C2 00:84B2: 85 E6     STA ram_00E6
C - - - - - 0x0004C4 00:84B4: A9 23     LDA #$23
C - - - - - 0x0004C6 00:84B6: 85 E7     STA ram_00E7
C - - - - - 0x0004C8 00:84B8: A0 01     LDY #$01
C - - - - - 0x0004CA 00:84BA: A2 20     LDX #$20
C - - - - - 0x0004CC 00:84BC: A9 55     LDA #$55
C - - - - - 0x0004CE 00:84BE: 20 EA 98  JSR sub_98EA_замостить_часть_экрана_тайлом
C - - - - - 0x0004D1 00:84C1: A6 ED     LDX ram_00ED
C - - - - - 0x0004D3 00:84C3: 4C B9 C4  JMP loc_0x03C4C9_банксвич_PRG_5115



ofs_84C6:
C - - - - - 0x0004D6 00:84C6: A6 56     LDX ram_0056
C - - - - - 0x0004D8 00:84C8: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
; базовая скорость текста
C - - - - - 0x0004DB 00:84CB: A9 08     LDA #$04
C - - - - - 0x0004DD 00:84CD: 85 55     STA ram_скорость_текста
; базовая позиция текста
C - - - - - 0x0004DF 00:84CF: A9 49     LDA #$60
C - - - - - 0x0004E1 00:84D1: 85 4F     STA ram_004F
C - - - - - 0x0004E3 00:84D3: A9 22     LDA #$22
C - - - - - 0x0004E5 00:84D5: 85 50     STA ram_0050
loc_84D7:
C D 0 - - - 0x0004E7 00:84D7: A5 4F     LDA ram_004F
C - - - - - 0x0004E9 00:84D9: 85 51     STA ram_0051
C - - - - - 0x0004EB 00:84DB: 29 1F     AND #$1F
C - - - - - 0x0004ED 00:84DD: 85 54     STA ram_0054
C - - - - - 0x0004EF 00:84DF: A5 50     LDA ram_0050
C - - - - - 0x0004F1 00:84E1: 85 52     STA ram_0052
loc_84E3:
C D 0 - - - 0x0004F3 00:84E3: A5 51     LDA ram_0051
C - - - - - 0x0004F5 00:84E5: 85 53     STA ram_0053
loc_84E7_продолжить_чтение_байтов_катсцены:
C D 0 - - - 0x0004F7 00:84E7: A0 00     LDY #$00
C - - - - - 0x0004F9 00:84E9: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0004FB 00:84EB: C9 D8     CMP #$E5
C - - - - - 0x0004FD 00:84ED: B0 15     BCS bra_8537_E5_FF
; 00-E4
C - - - - - 0x0004FF 00:84EF: A6 52     LDX ram_0052
C - - - - - 0x000501 00:84F1: A4 53     LDY ram_0053
C - - - - - 0x000503 00:84F3: 20 CA 88  JSR sub_88CA_запись_символа_в_буфер
C - - - - - 0x000506 00:84F6: E6 53     INC ram_0053
C - - - - - 0x000508 00:84F8: A5 55     LDA ram_скорость_текста
C - - - - - 0x00050A 00:84FA: F0 03     BEQ bra_84FF_максимальная_скорость
C - - - - - 0x00050C 00:84FC: 20 5D 89  JSR sub_895D
bra_84FF_максимальная_скорость:
C - - - - - 0x00050F 00:84FF: A9 01     LDA #$01
C - - - - - 0x000511 00:8501: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены
bra_8537_E5_FF:
C - - - - - 0x000547 00:8537: 38        SEC
C - - - - - 0x000548 00:8538: E9 E8     SBC #$E5
C - - - - - 0x00054A 00:853A: 0A        ASL
C - - - - - 0x00054B 00:853B: AA        TAX
C - - - - - 0x00054C 00:853C: BD 46 85  LDA tbl_8545_управляющие_байты_катсцены + $01,X
C - - - - - 0x00054F 00:853F: 48        PHA
C - - - - - 0x000550 00:8540: BD 45 85  LDA tbl_8545_управляющие_байты_катсцены,X
C - - - - - 0x000553 00:8543: 48        PHA
C - - - - - 0x000554 00:8544: 60        RTS



tbl_8545_управляющие_байты_катсцены:
    .word ofs_001_8572_E5_тренер_затереть_текст - $01
    .word ofs_001_8573_E6_частично_затереть_текст - $01
    .word ofs_001_8574_E7_смещение_текста - $01
    .word ofs_001_8575_E8 - $01
    .word ofs_001_8580_E9_осветление_экрана - $01
    .word ofs_001_858D_EA_затемнение_экрана - $01
    .word ofs_001_85C4_EB_мячик - $01
    .word ofs_001_85D2_EC_комментатор_чарли - $01
    .word ofs_001_85EC_ED_номер_звука - $01
    .word ofs_001_8604_EE_затереть_все - $01
    .word ofs_001_8618_EF_toggle_рот - $01
    .word ofs_001_862C_F0_фиксированное_положение_текста - $01
    .word ofs_001_864A_F1_вид_окна_текста - $01
    .word ofs_001_8678_F2_скорость_текста - $01
    .word ofs_001_8682_F3_палитра - $01
    .word ofs_001_86B8_F4 - $01
    .word ofs_001_87B8_F5 - $01
    .word ofs_001_87CB_F6_задержка - $01
    .word ofs_001_87D9_F7_toggle_камеру - $01
    .word ofs_001_87F8_F8 - $01
    .word ofs_001_8814_F9_задний_фон_1 - $01
    .word ofs_001_881B_FA_задний_фон_2 - $01
    .word ofs_001_8831_FB_анимация - $01
    .word ofs_001_8837_FC_новая_строка - $01
    .word ofs_001_8855_FD_затереть_текст - $01
    .word ofs_001_8862_FE_прыжок - $01
    .word ofs_001_8870_FF_выход - $01



ofs_001_8572_E5_тренер_затереть_текст:
                                        JSR sub_88AF_затирание_текста_тренера
                                        JMP loc_8574



ofs_001_8573_E6_частично_затереть_текст:
                                        JSR sub_88B0_частичное_затирание_текста
loc_8574:
                                        LDA #$04
                                        JSR sub_9FA8_задержка_кадра
                                        LDA #$01
                                        JMP loc_8887



ofs_001_8574_E7_смещение_текста:
                                        INY
                                        LDA (ram_004D),Y
                                        STA ram_temp_2
                                        BPL @сместить_вправо
                                        AND #$7F    ; иначе сместить влево
                                        EOR #$FF
                                        CLC
                                        ADC #$01
@сместить_вправо:
                                        CLC
                                        ADC ram_0053
                                        STA ram_0053
                                        BCC @пропуск
                                        BIT ram_temp_2
                                        BMI @пропуск
                                        INC ram_0052
@пропуск:
                                        LDA #$02
                                        JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8575_E8:
C - - - - - 0x000585 00:8575: C8        INY
C - - - - - 0x000586 00:8576: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000588 00:8578: 20 20 89  JSR sub_8920
C - - - - - 0x00058B 00:857B: A9 02     LDA #$02
C - - - - - 0x00058D 00:857D: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8580_E9_осветление_экрана:
C - - - - - 0x000590 00:8580: A9 02     LDA #$02
C - - - - - 0x000592 00:8582: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000595 00:8585: 20 7E 99  JSR sub_997E_запись_палитры_фона_и_спрайтов
C - - - - - 0x000598 00:8588: A9 01     LDA #$01
C - - - - - 0x00059A 00:858A: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_858D_EA_затемнение_экрана:
C - - - - - 0x00059D 00:858D: 20 F0 99  JSR sub_99F0_выход_из_экрана
C - - - - - 0x0005A0 00:8590: 20 7F 9B  JSR sub_9B7F_очистить_обе_памяти_спрайтов
C - - - - - 0x0005A3 00:8593: A9 00     LDA #$00
C - - - - - 0x0005A5 00:8595: 85 E6     STA ram_00E6
C - - - - - 0x0005A7 00:8597: A9 20     LDA #$20
C - - - - - 0x0005A9 00:8599: 85 E7     STA ram_00E7
C - - - - - 0x0005AB 00:859B: A0 10     LDY #$10
C - - - - - 0x0005AD 00:859D: A2 20     LDX #$20
C - - - - - 0x0005AF 00:859F: 20 E8 98  JSR sub_98E8_затереть_часть_экрана
C - - - - - 0x0005B2 00:85A2: A9 00     LDA #$00
C - - - - - 0x0005B4 00:85A4: 85 E6     STA ram_00E6
C - - - - - 0x0005B6 00:85A6: A9 24     LDA #$24
C - - - - - 0x0005B8 00:85A8: 85 E7     STA ram_00E7
C - - - - - 0x0005BA 00:85AA: A0 20     LDY #$20
C - - - - - 0x0005BC 00:85AC: A2 20     LDX #$20
C - - - - - 0x0005BE 00:85AE: 20 E8 98  JSR sub_98E8_затереть_часть_экрана
C - - - - - 0x0005C1 00:85B1: A9 00     LDA #$00
C - - - - - 0x0005C3 00:85B3: 85 4C     STA ram_004C
C - - - - - 0x0005C5 00:85B5: 85 7B     STA ram_007B
C - - - - - 0x0005C7 00:85B7: 85 4C     STA ram_004C
C - - - - - 0x0005CB 00:85BB: 85 0D     STA ram_000D
C - - - - - 0x0005CD 00:85BD: 85 0E     STA ram_000E
C - - - - - 0x0005CF 00:85BF: A9 01     LDA #$01
C - - - - - 0x0005D1 00:85C1: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_85C4_EB_мячик:
C - - - - - 0x0005D4 00:85C4: 20 9A 89  JSR sub_899A___для_0099___бит7_0___бит6_1
C - - - - - 0x0005D7 00:85C7: 20 A3 89  JSR sub_89A3_ожидание_перехода_к_след_диалогу
C - - - - - 0x0005DD 00:85CD: A9 01     LDA #$01
C - - - - - 0x0005DF 00:85CF: 4C 87 88  JMP loc_8887



ofs_001_85D2_EC_комментатор_чарли:
C - - - - - 0x0005E2 00:85D2: A0 01     LDY #$01
C - - - - - 0x0005E4 00:85D4: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0005E6 00:85D6: C9 FF     CMP #$FF
C - - - - - 0x0005E8 00:85D8: F0 08     BEQ bra_85E2_выключить_чарли
C - - - - - 0x0005EA 00:85DA: 20 D2 89  JSR sub_89D2_подготовить_чарли
C - - - - - 0x0005ED 00:85DD: A9 02     LDA #$02
C - - - - - 0x0005EF 00:85DF: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены
bra_85E2_выключить_чарли:
C - - - - - 0x0005F2 00:85E2: A9 00     LDA #$00
C - - - - - 0x0005F4 00:85E4: 8D 52 06  STA ram_рот_чарли_hi
C - - - - - 0x0005F7 00:85E7: A9 02     LDA #$02
C - - - - - 0x0005F9 00:85E9: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_85EC_ED_номер_звука:
C - - - - - 0x0005FC 00:85EC: A2 00     LDX #$00
bra_85EE_loop:
C - - - - - 0x0005FE 00:85EE: BD 00 07  LDA ram_звук,X
C - - - - - 0x000601 00:85F1: F0 05     BEQ bra_85F8
C - - - - - 0x000603 00:85F3: E8        INX
C - - - - - 0x000604 00:85F4: E0 05     CPX #$05
C - - - - - 0x000606 00:85F6: D0 F6     BNE bra_85EE_loop
bra_85F8:
C - - - - - 0x000608 00:85F8: A0 01     LDY #$01
C - - - - - 0x00060A 00:85FA: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00060C 00:85FC: 9D 00 07  STA ram_звук,X
C - - - - - 0x00060F 00:85FF: A9 02     LDA #$02
C - - - - - 0x000611 00:8601: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8604_EE_затереть_все:
C - - - - - 0x000614 00:8604: A9 21     LDA #$21
C - - - - - 0x000616 00:8606: 85 E6     STA ram_00E6
C - - - - - 0x000618 00:8608: A9 22     LDA #$22
C - - - - - 0x00061A 00:860A: 85 E7     STA ram_00E7
C - - - - - 0x00061C 00:860C: A0 0B     LDY #$0B
C - - - - - 0x00061E 00:860E: A2 1E     LDX #$1E
C - - - - - 0x000620 00:8610: 20 E8 98  JSR sub_98E8_затереть_часть_экрана
C - - - - - 0x000623 00:8613: A9 01     LDA #$01
C - - - - - 0x000625 00:8615: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8618_EF_toggle_рот:
C - - - - - 0x000628 00:8618: A9 02     LDA #$02
C - - - - - 0x00062A 00:861A: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00062D 00:861D: A5 99     LDA ram_0099
C - - - - - 0x00062F 00:861F: 29 80     AND #$80
C - - - - - 0x000631 00:8621: 49 80     EOR #$80
C - - - - - 0x000633 00:8623: 09 40     ORA #$40
C - - - - - 0x000635 00:8625: 85 99     STA ram_0099
C - - - - - 0x000637 00:8627: A9 01     LDA #$01
C - - - - - 0x000639 00:8629: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_862C_F0_фиксированное_положение_текста:
; указывается младший и старший байт для 2006
C - - - - - 0x00063C 00:862C: C8        INY
C - - - - - 0x00063D 00:862D: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00063F 00:862F: 85 4F     STA ram_004F
C - - - - - 0x000641 00:8631: 85 51     STA ram_0051
C - - - - - 0x000643 00:8633: C8        INY
C - - - - - 0x000644 00:8634: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000646 00:8636: 85 50     STA ram_0050
C - - - - - 0x000648 00:8638: 85 52     STA ram_0052
C - - - - - 0x00064A 00:863A: A5 4D     LDA ram_004D
C - - - - - 0x00064C 00:863C: 18        CLC
C - - - - - 0x00064D 00:863D: 69 03     ADC #< $0003
C - - - - - 0x00064F 00:863F: 85 4D     STA ram_004D
C - - - - - 0x000651 00:8641: A5 4E     LDA ram_004E
C - - - - - 0x000653 00:8643: 69 00     ADC #> $0003
C - - - - - 0x000655 00:8645: 85 4E     STA ram_004E
C - - - - - 0x000657 00:8647: 4C E3 84  JMP loc_84E3



ofs_001_864A_F1_вид_окна_текста:
C - - - - - 0x00065A 00:864A: A9 21     LDA #$21
C - - - - - 0x00065C 00:864C: 85 E6     STA ram_00E6
C - - - - - 0x00065E 00:864E: A9 22     LDA #$22
C - - - - - 0x000660 00:8650: 85 E7     STA ram_00E7
C - - - - - 0x000662 00:8652: A0 0B     LDY #$0B
C - - - - - 0x000664 00:8654: A2 1E     LDX #$1E
C - - - - - 0x000666 00:8656: 20 E8 98  JSR sub_98E8_затереть_часть_экрана
C - - - - - 0x000669 00:8659: A0 01     LDY #$01
C - - - - - 0x00066B 00:865B: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00066D 00:865D: 0A        ASL
C - - - - - 0x00066E 00:865E: A8        TAY
C - - - - - 0x00066F 00:865F: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x000671 00:8661: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000674 00:8664: BE 41 BB  LDX tbl_0x00DB50_оформление_окна_диалога + $01,Y
C - - - - - 0x000677 00:8667: B9 40 BB  LDA tbl_0x00DB50_оформление_окна_диалога,Y
C - - - - - 0x00067A 00:866A: A8        TAY
C - - - - - 0x00067B 00:866B: 20 B6 97  JSR sub_97B6_запись_в_буфер_без_смещения
C - - - - - 0x00067E 00:866E: A6 56     LDX ram_0056
C - - - - - 0x000680 00:8670: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000683 00:8673: A9 02     LDA #$02
C - - - - - 0x000685 00:8675: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8678_F2_скорость_текста:
C - - - - - 0x000688 00:8678: C8        INY
C - - - - - 0x000689 00:8679: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00068B 00:867B: 85 55     STA ram_скорость_текста
C - - - - - 0x00068D 00:867D: A9 02     LDA #$02
C - - - - - 0x00068F 00:867F: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8682_F3_палитра:
C - - - - - 0x000692 00:8682: C8        INY
C - - - - - 0x000693 00:8683: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000695 00:8685: D0 08     BNE bra_868F
; 00
C - - - - - 0x000697 00:8687: 20 35 9A  JSR sub_9A35
C - - - - - 0x00069A 00:868A: A0 02     LDA #$02
C - - - - - 0x00069C 00:868C: 4C B4 86  JMP loc_8879_сместить_указатель_байтов_катсцены
bra_868F:
C - - - - - 0x00069F 00:868F: C9 FF     CMP #$FF
C - - - - - 0x0006A1 00:8691: F0 14     BEQ bra_86A7_FF
C - - - - - 0x0006A3 00:8693: 30 08     BMI bra_869D_01_7F
; 80-FE
C - - - - - 0x0006A5 00:8695: 20 4C 9A  JSR sub_9A4C
C - - - - - 0x0006A8 00:8698: A0 02     LDA #$02
C - - - - - 0x0006AA 00:869A: 4C B4 86  JMP loc_8879_сместить_указатель_байтов_катсцены
bra_869D_01_7F:
C - - - - - 0x0006AD 00:869D: 29 7F     AND #$7F
C - - - - - 0x0006AF 00:869F: 20 60 9A  JSR sub_9A60
C - - - - - 0x0006B2 00:86A2: A0 02     LDA #$02
C - - - - - 0x0006B4 00:86A4: 4C B4 86  JMP loc_8879_сместить_указатель_байтов_катсцены
bra_86A7_FF:
C - - - - - 0x0006B7 00:86A7: A0 03     LDY #$03
C - - - - - 0x0006B9 00:86A9: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0006BB 00:86AB: AA        TAX
C - - - - - 0x0006BC 00:86AC: 88        DEY
C - - - - - 0x0006BD 00:86AD: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0006BF 00:86AF: 20 31 9A  JSR sub_9A31
C - - - - - 0x0006C2 00:86B2: A0 04     LDA #$04
C - - - - - 0x0006C5 00:86B5: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_86B8_F4:
C - - - - - 0x0006C8 00:86B8: C8        INY
C - - - - - 0x0006C9 00:86B9: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0006CB 00:86BB: 0A        ASL
C - - - - - 0x0006CC 00:86BC: AA        TAX
C - - - - - 0x0006CD 00:86BD: BD C7 86  LDA tbl_86C6 + $01,X
C - - - - - 0x0006D0 00:86C0: 48        PHA
C - - - - - 0x0006D1 00:86C1: BD C6 86  LDA tbl_86C6,X
C - - - - - 0x0006D4 00:86C4: 48        PHA
C - - - - - 0x0006D5 00:86C5: 60        RTS



tbl_86C6:
- - - - - - 0x0006D6 00:86C6: D5 86     .word $0000
- D 0 - - - 0x0006D8 00:86C8: DD 86     .word ofs_002_86DE_01 - $01
- D 0 - - - 0x0006DA 00:86CA: E5 86     .word ofs_002_86E6_02 - $01
- D 0 - - - 0x0006DC 00:86CC: ED 86     .word ofs_002_86EE_03 - $01
- D 0 - - - 0x0006DE 00:86CE: F5 86     .word ofs_002_86F6_04_скрыть_текст - $01
- D 0 - - - 0x0006E0 00:86D0: 12 87     .word ofs_002_8713_05_показать_текст - $01
- D 0 - - - 0x0006E2 00:86D2: 33 87     .word ofs_002_8734_06_ожидание_перехода_к_скрытому_диалогу - $01
- D 0 - - - 0x0006E4 00:86D4: 9E 87     .word ofs_002_879F_07_возврат_из_скрытой_катсцены - $01



ofs_002_86DE_01:
C - - - - - 0x0006EE 00:86DE: 20 D1 99  JSR sub_99D1
C - - - - - 0x0006F1 00:86E1: A9 02     LDA #$02
C - - - - - 0x0006F3 00:86E3: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_002_86E6_02:
C - - - - - 0x0006F6 00:86E6: 20 0D 9A  JSR sub_9A0D
C - - - - - 0x0006F9 00:86E9: A9 02     LDA #$02
C - - - - - 0x0006FB 00:86EB: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_002_86EE_03:
C - - - - - 0x0006FE 00:86EE: 20 1F 9A  JSR sub_9A1F
C - - - - - 0x000701 00:86F1: A9 02     LDA #$02
C - - - - - 0x000703 00:86F3: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_002_86F6_04_скрыть_текст:
C - - - - - 0x000706 00:86F6: A9 04     LDA #$04
C - - - - - 0x000708 00:86F8: 85 ED     STA ram_00ED
bra_86FA_loop:
C - - - - - 0x00070A 00:86FA: A6 ED     LDX ram_00ED
C - - - - - 0x00070C 00:86FC: BD B3 87  LDA tbl_87B4 - $01,X
C - - - - - 0x00070F 00:86FF: 8D 31 06  STA ram_0631
C - - - - - 0x000712 00:8702: 20 71 9A  JSR sub_9A71
C - - - - - 0x000715 00:8705: A9 04     LDA #$04
C - - - - - 0x000717 00:8707: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00071A 00:870A: C6 ED     DEC ram_00ED
C - - - - - 0x00071C 00:870C: D0 EC     BNE bra_86FA_loop
C - - - - - 0x00071E 00:870E: A9 02     LDA #$02
C - - - - - 0x000720 00:8710: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_002_8713_05_показать_текст:
C - - - - - 0x000723 00:8713: A9 00     LDA #$00
C - - - - - 0x000725 00:8715: 85 ED     STA ram_00ED
bra_8717_loop:
C - - - - - 0x000727 00:8717: A6 ED     LDX ram_00ED
C - - - - - 0x000729 00:8719: BD B4 87  LDA tbl_87B4,X
C - - - - - 0x00072C 00:871C: 8D 31 06  STA ram_0631
C - - - - - 0x00072F 00:871F: 20 71 9A  JSR sub_9A71
C - - - - - 0x000732 00:8722: A9 04     LDA #$04
C - - - - - 0x000734 00:8724: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000737 00:8727: E6 ED     INC ram_00ED
C - - - - - 0x000739 00:8729: A5 ED     LDA ram_00ED
C - - - - - 0x00073B 00:872B: C9 04     CMP #$04
C - - - - - 0x00073D 00:872D: 90 E8     BCC bra_8717_loop
C - - - - - 0x00073F 00:872F: A9 02     LDA #$02
C - - - - - 0x000741 00:8731: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_002_8734_06_ожидание_перехода_к_скрытому_диалогу:
bra_8734_loop_repeat_моргание:
C - - - - - 0x000744 00:8734: A0 FC     LDY #$FC
bra_8736_loop_копирование:
C - - - - - 0x000746 00:8736: B9 D2 88  LDA tbl_89CE_spr_data_мячик_диалога - $FC,Y
C - - - - - 0x000749 00:8739: 99 68 04  STA ram_copy_spr_Y,Y
C - - - - - 0x00074C 00:873C: C8        INY
C - - - - - 0x00074D 00:873D: D0 F7     BNE bra_8736_loop_копирование
; X = скрыть спрайт, Y = задержка мерцания
C - - - - - 0x00074F 00:873F: A2 F8     LDX #$F8
C - - - - - 0x000751 00:8741: A0 00     LDY #$00
loc_8743_loop_ожидание_нажатия:
bra_8743_удерживать_код_от_скрытия_мячика:
C D 0 - - - 0x000753 00:8743: A9 01     LDA #$01
C - - - - - 0x000755 00:8745: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000758 00:8748: 24 1E     BIT ram_btn_press
; con_btn_A
C - - - - - 0x00075A 00:874A: 30 17     BMI bra_8763_нажата_A
C - - - - - 0x00075C 00:874C: A5 1C     LDA ram_btn_hold
; показать скрытую катсцену при нажатии правильных кнопок
C - - - - - 0x00075E 00:874E: 29 44     AND #con_btn_B + con_btn_Down
C - - - - - 0x000760 00:8750: C9 44     CMP #con_btn_B + con_btn_Down
C - - - - - 0x000762 00:8752: F0 1A     BEQ bra_876E_нажата_комбинация_для_скрытой_катсцены
C - - - - - 0x000764 00:8754: C8        INY
C - - - - - 0x000765 00:8755: C0 14     CPY #$14
C - - - - - 0x000767 00:8757: F0 DB     BEQ bra_8734_loop_repeat_моргание
; мячик затирается если эта единственная проверка не пройдена, и счетчик продолжает отсчет
; цикл отрисовки не начнется заново пока счетчик не закончится, поэтому мяч останется скрытым
C - - - - - 0x000769 00:8759: C0 0C     CPY #$0C
C - - - - - 0x00076B 00:875B: D0 E6     BNE bra_8743_удерживать_код_от_скрытия_мячика
C - - - - - 0x00076D 00:875D: 8E 64 05  STX ram_copy_spr_Y + $FC
C - - - - - 0x000770 00:8760: 4C 43 87  JMP loc_8743_loop_ожидание_нажатия
bra_8763_нажата_A:
C - - - - - 0x000773 00:8763: 8E 64 05  STX ram_copy_spr_Y + $FC
C - - - - - 0x000779 00:8769: A9 03     LDA #$03
C - - - - - 0x00077B 00:876B: 4C 87 88  JMP loc_8887
bra_876E_нажата_комбинация_для_скрытой_катсцены:
C - - - - - 0x00077E 00:876E: 8E 64 05  STX ram_copy_spr_Y + $FC
C - - - - - 0x000784 00:8774: A5 4D     LDA ram_004D
C - - - - - 0x000786 00:8776: 18        CLC
C - - - - - 0x000787 00:8777: 69 03     ADC #< $0003
C - - - - - 0x000789 00:8779: 85 58     STA ram_0058
C - - - - - 0x00078B 00:877B: A5 4E     LDA ram_004E
C - - - - - 0x00078D 00:877D: 69 00     ADC #> $0003
C - - - - - 0x00078F 00:877F: 85 59     STA ram_0059
C - - - - - 0x000791 00:8781: A5 56     LDA ram_0056
C - - - - - 0x000793 00:8783: 85 5A     STA ram_005A
C - - - - - 0x000795 00:8785: A0 02     LDY #$02
C - - - - - 0x000797 00:8787: B1 4D     LDA (ram_004D),Y
                                        STA ram_temp_1
C - - - - - 0x000799 00:8789: 0A        ASL
                                        CLC
                                        ADC ram_temp_1
C - - - - - 0x00079A 00:878A: A8        TAY
C - - - - - 0x00079B 00:878B: A2 06     LDX tbl_879D_банк_скрытой_катсцены,Y
C - - - - - 0x00079D 00:878D: 86 56     STX ram_0056
C - - - - - 0x00079F 00:878F: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0007A2 00:8792: B9 00 A0  LDA tbl_879D_поинтер_скрытой_катсцены + $01,Y
C - - - - - 0x0007A5 00:8795: 85 4D     STA ram_004D
C - - - - - 0x0007A7 00:8797: B9 01 A0  LDA tbl_879D_поинтер_скрытой_катсцены + $02,Y
C - - - - - 0x0007AA 00:879A: 85 4E     STA ram_004E
C - - - - - 0x0007AC 00:879C: 4C D7 84  JMP loc_84D7



tbl_879D_банк_скрытой_катсцены:
tbl_879D_поинтер_скрытой_катсцены:
    .byte con_prg_bank + $1F + $80
    .word off_0x040005_скрытая_катсцена_из_01
    
    .byte con_prg_bank + $20 + $80
    .word off_0x040005_скрытая_катсцена_из_08
    
    .byte con_prg_bank + $21 + $80
    .word off_0x040005_скрытая_катсцена_из_0F
    
    .byte con_prg_bank + $24 + $80
    .word off_0x040005_скрытая_катсцена_из_1F



ofs_002_879F_07_возврат_из_скрытой_катсцены:
C - - - - - 0x0007AF 00:879F: 20 B1 88  JSR sub_88B1_затирание_текста
C - - - - - 0x0007B2 00:87A2: A5 58     LDA ram_0058
C - - - - - 0x0007B4 00:87A4: 85 4D     STA ram_004D
C - - - - - 0x0007B6 00:87A6: A5 59     LDA ram_0059
C - - - - - 0x0007B8 00:87A8: 85 4E     STA ram_004E
C - - - - - 0x0007BA 00:87AA: A6 5A     LDX ram_005A
C - - - - - 0x0007BC 00:87AC: 86 56     STX ram_0056
C - - - - - 0x0007BE 00:87AE: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0007C1 00:87B1: 4C D7 84  JMP loc_84D7



tbl_87B4:
- D 0 - - - 0x0007C4 00:87B4: 30        .byte $30   ; 00
- D 0 - - - 0x0007C5 00:87B5: 20        .byte $20   ; 01
- D 0 - - - 0x0007C6 00:87B6: 10        .byte $10   ; 02
- D 0 - - - 0x0007C7 00:87B7: 0F        .byte $0F   ; 03



ofs_001_87B8_F5:
C - - - - - 0x0007C8 00:87B8: C8        INY
C - - - - - 0x0007C9 00:87B9: A2 00     LDX #$00
C - - - - - 0x0007CB 00:87BB: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0007CD 00:87BD: C9 FF     CMP #$FF
C - - - - - 0x0007CF 00:87BF: F0 03     BEQ bra_87C4_FF
C - - - - - 0x0007D1 00:87C1: 09 80     ORA #$80
C - - - - - 0x0007D3 00:87C3: AA        TAX
bra_87C4_FF:
C - - - - - 0x0007D4 00:87C4: 86 4C     STX ram_004C
C - - - - - 0x0007D6 00:87C6: A9 02     LDA #$02
C - - - - - 0x0007D8 00:87C8: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_87CB_F6_задержка:
C - - - - - 0x0007DB 00:87CB: 20 9A 89  JSR sub_899A___для_0099___бит7_0___бит6_1
C - - - - - 0x0007DE 00:87CE: C8        INY
C - - - - - 0x0007DF 00:87CF: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0007E1 00:87D1: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0007E4 00:87D4: A9 02     LDA #$02
C - - - - - 0x0007E6 00:87D6: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_87D9_F7_toggle_камеру:
loc_87D9_loop:
C - - - - - 0x0007E9 00:87D9: A5 09     LDA ram_0009
C - - - - - 0x0007EB 00:87DB: F0 08     BEQ bra_87E5


; bzk garbage? в новых логах не выполнялось
- - - - - - 0x0007ED 00:87DD: A9 01     LDA #$01
- - - - - - 0x0007EF 00:87DF: 20 A8 9F  JSR sub_9FA8_задержка_кадра
- - - - - - 0x0007F2 00:87E2: 4C D9 87  JMP loc_87D9_loop



bra_87E5:
C - - - - - 0x0007F5 00:87E5: A5 7B     LDA ram_007B
C - - - - - 0x0007F7 00:87E7: 49 01     EOR #$01
C - - - - - 0x0007F9 00:87E9: 85 7B     STA ram_007B
C - - - - - 0x0007FB 00:87EB: A9 00     LDA #$00
C - - - - - 0x0007FD 00:87ED: 85 7A     STA ram_007A
C - - - - - 0x0007FF 00:87EF: 85 44     STA ram_0044
C - - - - - 0x000801 00:87F1: 85 45     STA ram_0045
C - - - - - 0x000803 00:87F3: A9 01     LDA #$01
C - - - - - 0x000805 00:87F5: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_87F8_F8:
C - - - - - 0x000808 00:87F8: C8        INY
C - - - - - 0x000809 00:87F9: B1 4D     LDA (ram_004D),Y
C - - - - - 0x00080B 00:87FB: 85 ED     STA ram_00ED
; bzk bug? следующий байт по идее вообще не должен быть считан
; поскольку в катсценах после F8 должен идти только 1 байт, а следующий может быть вообще каким угодно
; что может привести к багам
C - - - - - 0x00080D 00:87FD: C8        INY
C - - - - - 0x00080E 00:87FE: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000810 00:8800: 85 EC     STA ram_00EC
C - - - - - 0x000812 00:8802: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x000814 00:8804: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000817 00:8807: 20 12 A2  JSR sub_0x004494_подпрограммы_байта_F8_в_катсценах
C - - - - - 0x00081A 00:880A: A8        TAY
C - - - - - 0x00081B 00:880B: A6 56     LDX ram_0056
C - - - - - 0x00081D 00:880D: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000820 00:8810: 98        TYA
C - - - - - 0x000821 00:8811: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8814_F9_задний_фон_1:
C - - - - - 0x000824 00:8814: A5 5B     LDA ram_005B
C - - - - - 0x000826 00:8816: 29 FB     AND #$FB
C - - - - - 0x000828 00:8818: 4C 1F 88  JMP loc_881F



ofs_001_881B_FA_задний_фон_2:
C - - - - - 0x00082B 00:881B: A5 5B     LDA ram_005B
C - - - - - 0x00082D 00:881D: 09 04     ORA #$04
loc_881F:
C D 0 - - - 0x00082F 00:881F: 85 5B     STA ram_005B
C - - - - - 0x000831 00:8821: C8        INY
C - - - - - 0x000832 00:8822: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000834 00:8824: 20 F7 8A  JSR sub_8AF7
C - - - - - 0x000837 00:8827: A6 56     LDX ram_0056
C - - - - - 0x000839 00:8829: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00083C 00:882C: A9 02     LDA #$02
C - - - - - 0x00083E 00:882E: 4C 79 88  JMP loc_8879_сместить_указатель_байтов_катсцены



ofs_001_8831_FB_анимация:
C - - - - - 0x000841 00:8831: 20 85 90  JSR sub_9085
C - - - - - 0x000844 00:8834: 4C E7 84  JMP loc_84E7_продолжить_чтение_байтов_катсцены



ofs_001_8837_FC_новая_строка:
C - - - - - 0x000847 00:8837: 20 9A 89  JSR sub_899A___для_0099___бит7_0___бит6_1
C - - - - - 0x00084A 00:883A: A9 04     LDA #$04
C - - - - - 0x00084C 00:883C: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00084F 00:883F: A5 51     LDA ram_0051
C - - - - - 0x000851 00:8841: 18        CLC
C - - - - - 0x000852 00:8842: 69 40     ADC #< $0040
C - - - - - 0x000854 00:8844: 85 51     STA ram_0051
C - - - - - 0x000856 00:8846: A5 52     LDA ram_0052
C - - - - - 0x000858 00:8848: 69 00     ADC #> $0040
C - - - - - 0x00085A 00:884A: 85 52     STA ram_0052
C - - - - - 0x00085C 00:884C: E6 4D     INC ram_004D
C - - - - - 0x00085E 00:884E: D0 02     BNE bra_8852_not_overflow
C - - - - - 0x000860 00:8850: E6 4E     INC ram_004E
bra_8852_not_overflow:
C - - - - - 0x000862 00:8852: 4C E3 84  JMP loc_84E3



ofs_001_8855_FD_затереть_текст:
C - - - - - 0x000865 00:8855: 20 B1 88  JSR sub_88B1_затирание_текста
C - - - - - 0x000868 00:8858: A9 04     LDA #$04
C - - - - - 0x00086A 00:885A: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00086D 00:885D: A9 01     LDA #$01
C - - - - - 0x00086F 00:885F: 4C 87 88  JMP loc_8887



ofs_001_8862_FE_прыжок:
C - - - - - 0x000872 00:8862: C8        INY
C - - - - - 0x000873 00:8863: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000875 00:8865: AA        TAX
C - - - - - 0x000876 00:8866: C8        INY
C - - - - - 0x000877 00:8867: B1 4D     LDA (ram_004D),Y
C - - - - - 0x000879 00:8869: 85 4E     STA ram_004E
C - - - - - 0x00087B 00:886B: 86 4D     STX ram_004D
C - - - - - 0x00087D 00:886D: 4C E7 84  JMP loc_84E7_продолжить_чтение_байтов_катсцены



ofs_001_8870_FF_выход:
C - - - - - 0x000880 00:8870: A9 00     LDA #$00
C - - - - - 0x000882 00:8872: 85 4D     STA ram_004D
C - - - - - 0x000884 00:8874: 85 4E     STA ram_004E
C - - - - - 0x000886 00:8876: 4C 7E 9F  JMP loc_9F7E_отключить_подпрограмму_в_стеке



loc_8879_сместить_указатель_байтов_катсцены:
; A = размер смещения
C D 0 - - - 0x000889 00:8879: 18        CLC
C - - - - - 0x00088A 00:887A: 65 4D     ADC ram_004D
C - - - - - 0x00088C 00:887C: 85 4D     STA ram_004D
C - - - - - 0x00088E 00:887E: A5 4E     LDA ram_004E
C - - - - - 0x000890 00:8880: 69 00     ADC #$00
C - - - - - 0x000892 00:8882: 85 4E     STA ram_004E
C - - - - - 0x000894 00:8884: 4C E7 84  JMP loc_84E7_продолжить_чтение_байтов_катсцены



loc_8887:
C D 0 - - - 0x000897 00:8887: 18        CLC
C - - - - - 0x000898 00:8888: 65 4D     ADC ram_004D
C - - - - - 0x00089A 00:888A: 85 4D     STA ram_004D
C - - - - - 0x00089C 00:888C: A5 4E     LDA ram_004E
C - - - - - 0x00089E 00:888E: 69 00     ADC #$00
C - - - - - 0x0008A0 00:8890: 85 4E     STA ram_004E
C - - - - - 0x0008A2 00:8892: 4C D7 84  JMP loc_84D7



sub_0x0008A5:
C - - - - - 0x0008A5 00:8895: 85 57     STA ram_0057
C - - - - - 0x0008A7 00:8897: A2 0D     LDX #$0D
C - - - - - 0x0008A9 00:8899: A9 A8     LDA #< (ofs_88A9 - $01)
C - - - - - 0x0008AB 00:889B: 95 00     STA ram_0000,X
C - - - - - 0x0008AD 00:889D: A9 88     LDA #> (ofs_88A9 - $01)
C - - - - - 0x0008AF 00:889F: 95 01     STA ram_0001,X
C - - - - - 0x0008B1 00:88A1: A0 A0     LDY #$A0 - $02
C - - - - - 0x0008B5 00:88A5: 20 69 9F  JSR sub_9F69
C - - - - - 0x0008B8 00:88A8: 60        RTS



ofs_88A9:
C - - - - - 0x0008B9 00:88A9: A2 02     LDX #con_prg_bank + $02
C - - - - - 0x0008BB 00:88AB: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0008BE 00:88AE: 4C 06 A2  JMP loc_0x0042F8



sub_88AF_затирание_текста_тренера:
                                        LDX #$02
                                        BNE bra_88B1    ; jmp



sub_88B0_частичное_затирание_текста:
                                        LDX #$09
bra_88B1:
                                        LDA ram_0054
                                        PHA
                                        STX ram_0054
                                        JSR sub_88B1_затирание_текста
                                        PLA
                                        STA ram_0054
                                        RTS



sub_88B1_затирание_текста:
C - - - - - 0x0008C1 00:88B1: A5 54     LDA ram_0054
C - - - - - 0x0008C3 00:88B3: 49 FF     EOR #$FF
C - - - - - 0x0008C5 00:88B5: 18        CLC
; в итоге получится ?E, чтобы не затирать последние 2 тайла на случай если это рамка диалога
C - - - - - 0x0008C6 00:88B6: 69 1F     ADC #$1F
C - - - - - 0x0008C8 00:88B8: AA        TAX
; количество строк для затирания текста
C - - - - - 0x0008C9 00:88B9: A0 08     LDY #$08
C - - - - - 0x0008CB 00:88BB: A5 4F     LDA ram_004F
C - - - - - 0x0008CD 00:88BD: 29 E0     AND #$E0
C - - - - - 0x0008CF 00:88BF: 05 54     ORA ram_0054
C - - - - - 0x0008D1 00:88C1: 85 E6     STA ram_00E6
C - - - - - 0x0008D3 00:88C3: A5 50     LDA ram_0050
C - - - - - 0x0008D5 00:88C5: 85 E7     STA ram_00E7
C - - - - - 0x0008D7 00:88C7: 4C E8 98  JMP loc_98E8_затереть_часть_экрана



sub_88CA_запись_символа_в_буфер:
sub_0x0008DA_запись_символа_в_буфер:
                                        PHA
                                        LDA #$01
                                        JSR sub_9B28_подготовить_буфер
                                        PLA
                                        STA ram_05E8,X
                                        INX
                                        JSR sub_9B5E_закрыть_буфер
                                        RTS



sub_88FB:
sub_0x00090B:
C - - - - - 0x00090B 00:88FB: A2 00     LDX #$00
bra_88FD_loop:
C - - - - - 0x00090D 00:88FD: BD 6A 04  LDA ram_copy_spr_A,X
C - - - - - 0x000910 00:8900: 49 20     EOR #$20
C - - - - - 0x000912 00:8902: 9D 6A 04  STA ram_copy_spr_A,X
C - - - - - 0x000915 00:8905: E8        INX
C - - - - - 0x000916 00:8906: E8        INX
C - - - - - 0x000917 00:8907: E8        INX
C - - - - - 0x000918 00:8908: E8        INX
C - - - - - 0x000919 00:8909: D0 F2     BNE bra_88FD_loop
C - - - - - 0x00091B 00:890B: 60        RTS



sub_890C_смещение_Y_спрайтов:
sub_0x00091C_смещение_Y_спрайтов:
C - - - - - 0x00091C 00:890C: 85 ED     STA ram_00ED
C - - - - - 0x00091E 00:890E: A2 00     LDX #$00
bra_8910_loop:
C - - - - - 0x000920 00:8910: BD 68 04  LDA ram_copy_spr_Y,X
C - - - - - 0x000923 00:8913: 18        CLC
C - - - - - 0x000924 00:8914: 65 ED     ADC ram_00ED
C - - - - - 0x000926 00:8916: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x000929 00:8919: E8        INX
C - - - - - 0x00092A 00:891A: E8        INX
C - - - - - 0x00092B 00:891B: E8        INX
C - - - - - 0x00092C 00:891C: E8        INX
C - - - - - 0x00092D 00:891D: D0 F1     BNE bra_8910_loop
C - - - - - 0x00092F 00:891F: 60        RTS



sub_8920:
sub_0x000930:
C - - - - - 0x000930 00:8920: A2 13     LDX #$13
C - - - - - 0x000932 00:8922: 20 EE 9D  JSR sub_9DEE_умножить_A_на_X
C - - - - - 0x000935 00:8925: A5 EC     LDA ram_00EC
C - - - - - 0x000937 00:8927: 18        CLC
C - - - - - 0x000938 00:8928: 69 00     ADC #< tbl_0x00DF10
C - - - - - 0x00093A 00:892A: 85 EC     STA ram_00EC
C - - - - - 0x00093C 00:892C: A5 ED     LDA ram_00ED
C - - - - - 0x00093E 00:892E: 69 BF     ADC #> tbl_0x00DF10
C - - - - - 0x000940 00:8930: 85 ED     STA ram_00ED
C - - - - - 0x000942 00:8932: A5 25     LDA ram_for_5115
C - - - - - 0x000944 00:8934: 85 EA     STA ram_00EA
C - - - - - 0x000946 00:8936: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x000948 00:8938: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
bra_893B_infinite_loop:
C - - - - - 0x00094B 00:893B: A5 78     LDA ram_0078
C - - - - - 0x00094D 00:893D: D0 FC     BNE bra_893B_infinite_loop
C - - - - - 0x00094F 00:893F: A0 00     LDY #$00
C - - - - - 0x000951 00:8941: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000953 00:8943: 8D 79 00  STA ram_0079
C - - - - - 0x000956 00:8946: A9 00     LDA #$00
C - - - - - 0x000958 00:8948: 8D 7A 00  STA ram_007A
C - - - - - 0x00095B 00:894B: C8        INY
C - - - - - 0x00095C 00:894C: A2 12     LDX #$12
bra_894E_loop:
C - - - - - 0x00095E 00:894E: B1 EC     LDA (ram_00EC),Y
C - - - - - 0x000960 00:8950: 99 7B 00  STA ram_007B,Y
C - - - - - 0x000963 00:8953: C8        INY
C - - - - - 0x000964 00:8954: CA        DEX
C - - - - - 0x000965 00:8955: D0 F7     BNE bra_894E_loop
C - - - - - 0x000967 00:8957: A6 EA     LDX ram_00EA
C - - - - - 0x000969 00:8959: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00096C 00:895C: 60        RTS



sub_895D:
C - - - - - 0x00096D 00:895D: AA        TAX
C - - - - - 0x00096E 00:895E: A5 99     LDA ram_0099
C - - - - - 0x000970 00:8960: 10 04     BPL bra_8966
C - - - - - 0x000972 00:8962: 49 41     EOR #$41
C - - - - - 0x000974 00:8964: 85 99     STA ram_0099
bra_8966:
bra_8966_loop:
C - - - - - 0x000976 00:8966: A9 01     LDA #$01
C - - - - - 0x000978 00:8968: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x00097B 00:896B: 8A        TXA
C - - - - - 0x00097C 00:896C: 48        PHA
C - - - - - 0x00097D 00:896D: 20 FF 89  JSR sub_89FF_анимация_чарли
C - - - - - 0x000980 00:8970: 68        PLA
C - - - - - 0x000981 00:8971: AA        TAX
C - - - - - 0x000982 00:8972: CA        DEX
C - - - - - 0x000983 00:8973: D0 F1     BNE bra_8966_loop
C - - - - - 0x000985 00:8975: 60        RTS



sub_0x000986:
C - - - - - 0x000986 00:8976: A5 4D     LDA ram_004D
C - - - - - 0x000988 00:8978: 85 EA     STA ram_00EA
C - - - - - 0x00098A 00:897A: A5 4E     LDA ram_004E
C - - - - - 0x00098C 00:897C: 85 EB     STA ram_00EB
C - - - - - 0x00098E 00:897E: A9 02     LDA #$02
C - - - - - 0x000990 00:8980: 85 E6     STA ram_00E6
C - - - - - 0x000992 00:8982: 86 E7     STX ram_00E7
C - - - - - 0x000994 00:8984: 84 E8     STY ram_00E8
C - - - - - 0x000996 00:8986: A9 E5     LDA #$E5
C - - - - - 0x000998 00:8988: 85 4D     STA ram_004D
C - - - - - 0x00099A 00:898A: A9 00     LDA #$00
C - - - - - 0x00099C 00:898C: 85 4E     STA ram_004E
C - - - - - 0x00099E 00:898E: 20 85 90  JSR sub_9085
C - - - - - 0x0009A1 00:8991: A5 EA     LDA ram_00EA
C - - - - - 0x0009A3 00:8993: 85 4D     STA ram_004D
C - - - - - 0x0009A5 00:8995: A5 EB     LDA ram_00EB
C - - - - - 0x0009A7 00:8997: 85 4E     STA ram_004E
C - - - - - 0x0009A9 00:8999: 60        RTS



sub_899A___для_0099___бит7_0___бит6_1:
C - - - - - 0x0009AA 00:899A: A5 99     LDA ram_0099
C - - - - - 0x0009AC 00:899C: 29 80     AND #$80
C - - - - - 0x0009AE 00:899E: 09 40     ORA #$40
C - - - - - 0x0009B0 00:89A0: 85 99     STA ram_0099
C - - - - - 0x0009B2 00:89A2: 60        RTS



sub_89A3_ожидание_перехода_к_след_диалогу:
sub_0x0009B3_ожидание_перехода_к_след_диалогу:
bra_89A3_loop_repeat_моргание:
C - - - - - 0x0009B3 00:89A3: A0 FC     LDY #$FC
bra_89A5_loop_копирование:
C - - - - - 0x0009B5 00:89A5: B9 D2 88  LDA tbl_89CE_spr_data_мячик_диалога - $FC,Y
C - - - - - 0x0009B8 00:89A8: 99 68 04  STA ram_copy_spr_Y,Y
C - - - - - 0x0009BB 00:89AB: C8        INY
C - - - - - 0x0009BC 00:89AC: D0 F7     BNE bra_89A5_loop_копирование
; X = скрыть спрайт, Y = задержка мерцания
C - - - - - 0x0009BE 00:89AE: A2 F8     LDX #$F8
C - - - - - 0x0009C0 00:89B0: A0 00     LDY #$00
loc_89B2_loop_ожидание_нажатия:
bra_89B2_удерживать_код_от_скрытия_мячика:
C D 0 - - - 0x0009C2 00:89B2: A9 01     LDA #$01
C - - - - - 0x0009C4 00:89B4: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0009C7 00:89B7: A5 1E     LDA ram_btn_press
; con_btn_A
; переход к следующей сцене когда мячик на экране
C - - - - - 0x0009C9 00:89B9: 30 0F     BMI bra_89CA_кнопка_A_нажата
C - - - - - 0x0009CB 00:89BB: C8        INY
C - - - - - 0x0009CC 00:89BC: C0 28     CPY #$28
C - - - - - 0x0009CE 00:89BE: F0 E3     BEQ bra_89A3_loop_repeat_моргание
; мячик затирается если эта единственная проверка не пройдена, и счетчик продолжает отсчет
; цикл отрисовки не начнется заново пока счетчик не закончится, поэтому мяч останется скрытым
C - - - - - 0x0009D0 00:89C0: C0 18     CPY #$18
C - - - - - 0x0009D2 00:89C2: D0 EE     BNE bra_89B2_удерживать_код_от_скрытия_мячика
C - - - - - 0x0009D4 00:89C4: 8E 64 05  STX ram_copy_spr_Y + $FC
C - - - - - 0x0009D7 00:89C7: 4C B2 89  JMP loc_89B2_loop_ожидание_нажатия
bra_89CA_кнопка_A_нажата:
C - - - - - 0x0009DA 00:89CA: 8E 64 05  STX ram_copy_spr_Y + $FC
C - - - - - 0x0009DD 00:89CD: 60        RTS



tbl_89CE_spr_data_мячик_диалога:
    .byte $D0, $FF, $03, $E8



sub_89D2_подготовить_чарли:
C - - - - - 0x0009E2 00:89D2: A8        TAY
C - - - - - 0x0009E3 00:89D3: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x0009E5 00:89D5: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0009E8 00:89D8: 98        TYA
C - - - - - 0x0009E9 00:89D9: 0A        ASL
C - - - - - 0x0009EA 00:89DA: AA        TAX
C - - - - - 0x0009EB 00:89DB: BD 00 BD  LDA tbl_0x00DD10_номера_анимаций_чарли,X
C - - - - - 0x0009EE 00:89DE: 8D 54 06  STA ram_data_чарли_lo
C - - - - - 0x0009F1 00:89E1: BD 01 BD  LDA tbl_0x00DD10_номера_анимаций_чарли + $01,X
C - - - - - 0x0009F4 00:89E4: 8D 55 06  STA ram_data_чарли_hi
C - - - - - 0x0009F7 00:89E7: A9 80     LDA #$80
C - - - - - 0x0009F9 00:89E9: 8D 52 06  STA ram_рот_чарли_hi
C - - - - - 0x0009FC 00:89EC: A9 01     LDA #$01
C - - - - - 0x0009FE 00:89EE: 8D 53 06  STA ram_рот_чарли_lo
C - - - - - 0x000A01 00:89F1: A9 00     LDA #con_chr_bank + $00
C - - - - - 0x000A03 00:89F3: 85 90     STA ram_0090
C - - - - - 0x000A05 00:89F5: A9 02     LDA #con_chr_bank + $02
C - - - - - 0x000A07 00:89F7: 85 91     STA ram_0091
C - - - - - 0x000A09 00:89F9: A6 56     LDX ram_0056
C - - - - - 0x000A0B 00:89FB: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
bra_89FE_RTS:
C - - - - - 0x000A0E 00:89FE: 60        RTS


; bzk optimize, отдельный rts
sub_89FF_анимация_чарли:
C - - - - - 0x000A0F 00:89FF: AD 52 06  LDA ram_рот_чарли_hi
C - - - - - 0x000A12 00:8A02: 30 03     BPL bra_89FE_RTS
C - - - - - 0x000A17 00:8A07: CE 53 06  DEC ram_рот_чарли_lo
C - - - - - 0x000A1A 00:8A0A: F0 03     BNE bra_89FE_RTS
C - - - - - 0x000A1F 00:8A0F: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x000A21 00:8A11: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
loc_8A14_loop_анимация:
C D 0 - - - 0x000A24 00:8A14: AD 54 06  LDA ram_data_чарли_lo
C - - - - - 0x000A27 00:8A17: 85 E6     STA ram_00E6
C - - - - - 0x000A29 00:8A19: AD 55 06  LDA ram_data_чарли_hi
C - - - - - 0x000A2C 00:8A1C: 85 E7     STA ram_00E7
C - - - - - 0x000A2E 00:8A1E: AD 52 06  LDA ram_рот_чарли_hi
C - - - - - 0x000A31 00:8A21: EE 52 06  INC ram_рот_чарли_hi
C - - - - - 0x000A34 00:8A24: 29 3F     AND #$3F
C - - - - - 0x000A36 00:8A26: 18        CLC
C - - - - - 0x000A37 00:8A27: 65 E6     ADC ram_00E6
C - - - - - 0x000A39 00:8A29: 85 E6     STA ram_00E6
C - - - - - 0x000A3B 00:8A2B: A5 E7     LDA ram_00E7
C - - - - - 0x000A3D 00:8A2D: 69 00     ADC #$00
C - - - - - 0x000A3F 00:8A2F: 85 E7     STA ram_00E7
C - - - - - 0x000A41 00:8A31: A0 00     LDY #$00
C - - - - - 0x000A43 00:8A33: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x000A45 00:8A35: C9 FF     CMP #$FF
C - - - - - 0x000A47 00:8A37: F0 4D     BEQ bra_8A86_FF_заткнуть_чарли
C - - - - - 0x000A49 00:8A39: C9 FE     CMP #$FE
C - - - - - 0x000A4B 00:8A3B: F0 3E     BEQ bra_8A7B_FE_повторить_цикл_анимации
C - - - - - 0x000A4D 00:8A3D: 29 F8     AND #$F8
C - - - - - 0x000A4F 00:8A3F: 85 E8     STA ram_00E8
C - - - - - 0x000A51 00:8A41: 4A        LSR
C - - - - - 0x000A52 00:8A42: 18        CLC
C - - - - - 0x000A53 00:8A43: 65 E8     ADC ram_00E8
C - - - - - 0x000A55 00:8A45: 85 E8     STA ram_00E8
C - - - - - 0x000A57 00:8A47: A9 00     LDA #$00
C - - - - - 0x000A59 00:8A49: 69 00     ADC #$00
C - - - - - 0x000A5B 00:8A4B: 85 E9     STA ram_00E9
C - - - - - 0x000A5D 00:8A4D: A5 E8     LDA ram_00E8
C - - - - - 0x000A5F 00:8A4F: 18        CLC
C - - - - - 0x000A60 00:8A50: 69 80     ADC #< tbl_0x00DD90_тайлы_чарли_в_катсцене
C - - - - - 0x000A62 00:8A52: 85 E8     STA ram_00E8
C - - - - - 0x000A64 00:8A54: A5 E9     LDA ram_00E9
C - - - - - 0x000A66 00:8A56: 69 BD     ADC #> tbl_0x00DD90_тайлы_чарли_в_катсцене
C - - - - - 0x000A68 00:8A58: 85 E9     STA ram_00E9
C - - - - - 0x000A6A 00:8A5A: A0 02     LDY #< $2302
C - - - - - 0x000A6C 00:8A5C: A2 23     LDX #> $2302
C - - - - - 0x000A6E 00:8A5E: 20 91 8A  JSR sub_8A91_нарисовать_тело_чарли_вертикально
C - - - - - 0x000A71 00:8A61: A0 03     LDY #< $2303
C - - - - - 0x000A73 00:8A63: A2 23     LDX #> $2303
C - - - - - 0x000A75 00:8A65: 20 91 8A  JSR sub_8A91_нарисовать_тело_чарли_вертикально
C - - - - - 0x000A78 00:8A68: A0 04     LDY #< $2304
C - - - - - 0x000A7A 00:8A6A: A2 23     LDX #> $2304
C - - - - - 0x000A7C 00:8A6C: 20 91 8A  JSR sub_8A91_нарисовать_тело_чарли_вертикально
C - - - - - 0x000A7F 00:8A6F: A0 01     LDY #$01
C - - - - - 0x000A81 00:8A71: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x000A83 00:8A73: 29 07     AND #$07
C - - - - - 0x000A85 00:8A75: 8D 53 06  STA ram_рот_чарли_lo
C - - - - - 0x000A88 00:8A78: 4C 8B 8A  JMP loc_8A8B
bra_8A7B_FE_повторить_цикл_анимации:
C - - - - - 0x000A8B 00:8A7B: AD 52 06  LDA ram_рот_чарли_hi
C - - - - - 0x000A8E 00:8A7E: 29 C0     AND #$C0
C - - - - - 0x000A90 00:8A80: 8D 52 06  STA ram_рот_чарли_hi
C - - - - - 0x000A93 00:8A83: 4C 14 8A  JMP loc_8A14_loop_анимация
bra_8A86_FF_заткнуть_чарли:
; bzk optimize, в анимации нету такого байта, он есть только в банке 23, но он означает прыжок
; в новых логах не выполнялось
- - - - - - 0x000A96 00:8A86: A9 00     LDA #$00
- - - - - - 0x000A98 00:8A88: 8D 52 06  STA ram_рот_чарли_hi
loc_8A8B:
C D 0 - - - 0x000A9B 00:8A8B: A6 56     LDX ram_0056
C - - - - - 0x000A9D 00:8A8D: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C D 0 - - - 0x000AA0 00:8A90: 60        RTS



sub_8A91_нарисовать_тело_чарли_вертикально:
; на демо катсцене срабатывает дважды перед выводом следующей буквы комментатора
C - - - - - 0x000AA1 00:8A91: A9 84     LDA #$84
C - - - - - 0x000AA3 00:8A93: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x000AA6 00:8A96: A0 00     LDY #$00
bra_8A98_loop:
C - - - - - 0x000AA8 00:8A98: B1 E8     LDA (ram_00E8),Y
C - - - - - 0x000AAA 00:8A9A: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000AAD 00:8A9D: E8        INX
C - - - - - 0x000AAE 00:8A9E: C8        INY
C - - - - - 0x000AAF 00:8A9F: C0 04     CPY #$04
C - - - - - 0x000AB1 00:8AA1: D0 F5     BNE bra_8A98_loop
C - - - - - 0x000AB3 00:8AA3: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x000AB6 00:8AA6: A5 E8     LDA ram_00E8
C - - - - - 0x000AB8 00:8AA8: 18        CLC
C - - - - - 0x000AB9 00:8AA9: 69 04     ADC #< $0004
C - - - - - 0x000ABB 00:8AAB: 85 E8     STA ram_00E8
C - - - - - 0x000ABD 00:8AAD: A5 E9     LDA ram_00E9
C - - - - - 0x000ABF 00:8AAF: 69 00     ADC #> $0004
C - - - - - 0x000AC1 00:8AB1: 85 E9     STA ram_00E9
C - - - - - 0x000AC3 00:8AB3: 60        RTS



tbl_8AEE:
; выбор банка для чтения текста в зависимости от номера катсцены
    .byte $00
    
    .byte con_prg_bank + $1F + $80
    .byte $07       ; индекс, с которого начинаются катсцены в следующем банке
    
    .byte con_prg_bank + $20 + $80
    .byte $0F
    
    .byte con_prg_bank + $21 + $80
    .byte $13
    
    .byte con_prg_bank + $22 + $80
    .byte $17
    
    .byte con_prg_bank + $23 + $80
    .byte $1F
    
    .byte con_prg_bank + $24 + $80
    .byte $22
    
    .byte con_prg_bank + $25 + $80
    .byte $23
    
    .byte con_prg_bank + $04 + $80
    .byte $47
    
    .byte con_prg_bank + $05 + $80
    .byte $FF



sub_8AF7:
sub_0x000B07:
; на демо катсцене срабатывает перед затемнением экрана перед отображением новой анимации
C - - - - - 0x000B07 00:8AF7: 85 ED     STA ram_00ED
C - - - - - 0x000B09 00:8AF9: A9 00     LDA #$00
C - - - - - 0x000B0B 00:8AFB: 85 09     STA ram_0009
C - - - - - 0x000B0D 00:8AFD: 85 0A     STA ram_000A
C - - - - - 0x000B0F 00:8AFF: 85 0D     STA ram_000D
C - - - - - 0x000B11 00:8B01: 85 0E     STA ram_000E
C - - - - - 0x000B13 00:8B03: A5 5B     LDA ram_005B
C - - - - - 0x000B15 00:8B05: 29 7F     AND #$7F
C - - - - - 0x000B17 00:8B07: 85 5B     STA ram_005B
C - - - - - 0x000B19 00:8B09: A5 25     LDA ram_for_5115
C - - - - - 0x000B1B 00:8B0B: 85 77     STA ram_0077
C - - - - - 0x000B1D 00:8B0D: A2 07     LDX #con_prg_bank + $07
C - - - - - 0x000B1F 00:8B0F: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000B22 00:8B12: A9 00     LDA #$00
C - - - - - 0x000B24 00:8B14: A0 F8     LDY #$F8
bra_8B16_loop:
C - - - - - 0x000B26 00:8B16: 99 52 05  STA ram_0552,Y
C - - - - - 0x000B29 00:8B19: C8        INY
C - - - - - 0x000B2A 00:8B1A: D0 FA     BNE bra_8B16_loop
C - - - - - 0x000B2C 00:8B1C: A5 ED     LDA ram_00ED
C - - - - - 0x000B2E 00:8B1E: 0A        ASL
C - - - - - 0x000B2F 00:8B1F: AA        TAX
C - - - - - 0x000B30 00:8B20: A9 00     LDA #$00
C - - - - - 0x000B32 00:8B22: 2A        ROL
C - - - - - 0x000B33 00:8B23: A8        TAY
C - - - - - 0x000B34 00:8B24: 8A        TXA
C - - - - - 0x000B35 00:8B25: 18        CLC
C - - - - - 0x000B36 00:8B26: 69 00     ADC #< tbl_0x00E010_параметры_заднего_фона
C - - - - - 0x000B38 00:8B28: 85 63     STA ram_0063
C - - - - - 0x000B3A 00:8B2A: 98        TYA
C - - - - - 0x000B3B 00:8B2B: 69 A0     ADC #> tbl_0x00E010_параметры_заднего_фона
C - - - - - 0x000B3D 00:8B2D: 85 64     STA ram_0064
C - - - - - 0x000B3F 00:8B2F: A0 00     LDY #$00
C - - - - - 0x000B41 00:8B31: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B43 00:8B33: AA        TAX
C - - - - - 0x000B44 00:8B34: C8        INY
C - - - - - 0x000B45 00:8B35: B1 63     LDA (ram_0063),Y
C - - - - - 0x000B47 00:8B37: 85 64     STA ram_0064
C - - - - - 0x000B49 00:8B39: 86 63     STX ram_0063
C - - - - - 0x000B4B 00:8B3B: A0 00     LDY #$00
C - - - - - 0x000B4D 00:8B3D: B1 63     LDA (ram_0063),Y
; комменты в 0x00EE5B
; номер банка chr 1
C - - - - - 0x000B4F 00:8B3F: 85 75     STA ram_0075
C - - - - - 0x000B51 00:8B41: C8        INY
C - - - - - 0x000B52 00:8B42: B1 63     LDA (ram_0063),Y
; номер банка chr 2
C - - - - - 0x000B54 00:8B44: 85 76     STA ram_0076
C - - - - - 0x000B56 00:8B46: C8        INY
C - - - - - 0x000B57 00:8B47: B1 63     LDA (ram_0063),Y
; номер палитры + ???
C - - - - - 0x000B59 00:8B49: AA        TAX
C - - - - - 0x000B5A 00:8B4A: 29 3F     AND #$3F
C - - - - - 0x000B5C 00:8B4C: 85 48     STA ram_0048
C - - - - - 0x000B5E 00:8B4E: 8A        TXA
C - - - - - 0x000B5F 00:8B4F: 46 5B     LSR ram_005B
C - - - - - 0x000B61 00:8B51: 2A        ROL
C - - - - - 0x000B62 00:8B52: 26 5B     ROL ram_005B
C - - - - - 0x000B64 00:8B54: C8        INY
; bzk optimize, залупно сделано, при помощи байтов смещения код будет читать байты в самом конце списка
; которые было бы удобнее поместить после этих первых 6 байтов
; то есть по сути эти поинтеры нужны для чтения следующих поинтеров, для чего такое посредничество
; если все равно последние 2 байта читаются перед тем, как продолжить чтение списка
C - - - - - 0x000B65 00:8B55: B1 63     LDA (ram_0063),Y
; множитель счетчика количества байтов для чтения
C - - - - - 0x000B67 00:8B57: 85 5E     STA ram_005E
C - - - - - 0x000B69 00:8B59: C8        INY
C - - - - - 0x000B6A 00:8B5A: B1 63     LDA (ram_0063),Y
; счетчик количества байтов для чтения
C - - - - - 0x000B6C 00:8B5C: 85 5F     STA ram_005F
C - - - - - 0x000B6E 00:8B5E: C8        INY
C - - - - - 0x000B6F 00:8B5F: B1 63     LDA (ram_0063),Y
; смещение для адреса ppu, байт * #100
C - - - - - 0x000B71 00:8B61: 29 F8     AND #$F8
C - - - - - 0x000B73 00:8B63: 85 5C     STA ram_005C
C - - - - - 0x000B75 00:8B65: A9 02     LDA #$02
C - - - - - 0x000B77 00:8B67: 85 5D     STA ram_005D
C - - - - - 0x000B79 00:8B69: 06 5C     ASL ram_005C
C - - - - - 0x000B7B 00:8B6B: 26 5D     ROL ram_005D
C - - - - - 0x000B7D 00:8B6D: 06 5C     ASL ram_005C
C - - - - - 0x000B7F 00:8B6F: 26 5D     ROL ram_005D
C - - - - - 0x000B81 00:8B71: B1 63     LDA (ram_0063),Y
; смещение для адреса ppu, байт * #04
C - - - - - 0x000B83 00:8B73: 29 07     AND #$07
C - - - - - 0x000B85 00:8B75: 05 5C     ORA ram_005C
C - - - - - 0x000B87 00:8B77: 85 5C     STA ram_005C
C - - - - - 0x000B89 00:8B79: 06 5C     ASL ram_005C
C - - - - - 0x000B8B 00:8B7B: 26 5D     ROL ram_005D
C - - - - - 0x000B8D 00:8B7D: 06 5C     ASL ram_005C
C - - - - - 0x000B8F 00:8B7F: 26 5D     ROL ram_005D
C - - - - - 0x000B91 00:8B81: A5 5D     LDA ram_005D
C - - - - - 0x000B93 00:8B83: 29 0C     AND #$0C
C - - - - - 0x000B95 00:8B85: D0 0C     BNE bra_8B93_пропуск
C - - - - - 0x000B97 00:8B87: A5 7B     LDA ram_007B
C - - - - - 0x000B99 00:8B89: 0A        ASL
C - - - - - 0x000B9A 00:8B8A: 0A        ASL
C - - - - - 0x000B9B 00:8B8B: 45 5B     EOR ram_005B
C - - - - - 0x000B9D 00:8B8D: 29 04     AND #$04
C - - - - - 0x000B9F 00:8B8F: 05 5D     ORA ram_005D
C - - - - - 0x000BA1 00:8B91: 85 5D     STA ram_005D
bra_8B93_пропуск:
C - - - - - 0x000BA3 00:8B93: A5 5E     LDA ram_005E
C - - - - - 0x000BA5 00:8B95: C9 09     CMP #$09
C - - - - - 0x000BA7 00:8B97: 90 06     BCC bra_8B9F_00_08
; 09+
C - - - - - 0x000BA9 00:8B99: 20 71 90  JSR sub_9071_очистить_2000_21FF
C - - - - - 0x000BAC 00:8B9C: 4C AB 8B  JMP loc_8BAB
bra_8B9F_00_08:
C - - - - - 0x000BAF 00:8B9F: A5 5D     LDA ram_005D
C - - - - - 0x000BB1 00:8BA1: 29 04     AND #$04
C - - - - - 0x000BB3 00:8BA3: D0 06     BNE bra_8BAB
C - - - - - 0x000BB5 00:8BA5: 20 71 90  JSR sub_9071_очистить_2000_21FF
C - - - - - 0x000BB8 00:8BA8: 4C AE 8B  JMP loc_8BAE
bra_8BAB:
loc_8BAB:
C D 0 - - - 0x000BBB 00:8BAB: 20 76 90  JSR sub_9076_очистить_2400_25FF
loc_8BAE:
C D 0 - - - 0x000BBE 00:8BAE: A9 01     LDA #$01
C - - - - - 0x000BC0 00:8BB0: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000BC3 00:8BB3: A5 63     LDA ram_0063
C - - - - - 0x000BC5 00:8BB5: 18        CLC
C - - - - - 0x000BC6 00:8BB6: 69 06     ADC #< $0006
C - - - - - 0x000BC8 00:8BB8: 85 63     STA ram_0063
C - - - - - 0x000BCA 00:8BBA: A5 64     LDA ram_0064
C - - - - - 0x000BCC 00:8BBC: 69 00     ADC #> $0006
C - - - - - 0x000BCE 00:8BBE: 85 64     STA ram_0064
C - - - - - 0x000BD0 00:8BC0: A5 5E     LDA ram_005E
C - - - - - 0x000BD2 00:8BC2: A6 5F     LDX ram_005F
C - - - - - 0x000BD4 00:8BC4: 20 EE 9D  JSR sub_9DEE_умножить_A_на_X
C - - - - - 0x000BD7 00:8BC7: A5 63     LDA ram_0063
C - - - - - 0x000BD9 00:8BC9: 18        CLC
C - - - - - 0x000BDA 00:8BCA: 65 EC     ADC ram_00EC
C - - - - - 0x000BDC 00:8BCC: 85 70     STA ram_0070
C - - - - - 0x000BDE 00:8BCE: A5 64     LDA ram_0064
C - - - - - 0x000BE0 00:8BD0: 65 ED     ADC ram_00ED
C - - - - - 0x000BE2 00:8BD2: 85 71     STA ram_0071
C - - - - - 0x000BE4 00:8BD4: A9 00     LDA #$00
C - - - - - 0x000BE6 00:8BD6: 85 60     STA ram_0060
C - - - - - 0x000BE8 00:8BD8: A0 01     LDY #$01
C - - - - - 0x000BEA 00:8BDA: B1 70     LDA (ram_0070),Y
C - - - - - 0x000BEC 00:8BDC: 29 E0     AND #$E0
C - - - - - 0x000BEE 00:8BDE: 85 62     STA ram_0062
C - - - - - 0x000BF0 00:8BE0: B1 70     LDA (ram_0070),Y
C - - - - - 0x000BF2 00:8BE2: 29 1F     AND #$1F
C - - - - - 0x000BF4 00:8BE4: AA        TAX
C - - - - - 0x000BF5 00:8BE5: 4A        LSR
C - - - - - 0x000BF6 00:8BE6: 66 60     ROR ram_0060
C - - - - - 0x000BF8 00:8BE8: 4A        LSR
C - - - - - 0x000BF9 00:8BE9: 66 60     ROR ram_0060
C - - - - - 0x000BFB 00:8BEB: 85 61     STA ram_0061
C - - - - - 0x000BFD 00:8BED: 8A        TXA
C - - - - - 0x000BFE 00:8BEE: F0 03     BEQ bra_8BF3_пропуск
C - - - - - 0x000C00 00:8BF0: C8        INY
C - - - - - 0x000C01 00:8BF1: B1 70     LDA (ram_0070),Y
bra_8BF3_пропуск:
C - - - - - 0x000C03 00:8BF3: 85 72     STA ram_0072
C - - - - - 0x000C05 00:8BF5: A5 62     LDA ram_0062
C - - - - - 0x000C07 00:8BF7: 29 C0     AND #$C0
C - - - - - 0x000C09 00:8BF9: F0 48     BEQ bra_8C0C_00
C - - - - - 0x000C0B 00:8BFB: C9 40     CMP #$40
C - - - - - 0x000C0D 00:8BFD: F0 16     BEQ bra_8C15_40
C - - - - - 0x000C0F 00:8BFF: C9 80     CMP #$80
C - - - - - 0x000C11 00:8C01: F0 09     BEQ bra_8C0C_80
; C0 bzk optimize, аналогичный код ниже
C - - - - - 0x000C13 00:8C03: A9 04     LDA #$04
C - - - - - 0x000C15 00:8C05: A2 01     LDX #$01
C - - - - - 0x000C17 00:8C07: A4 5F     LDY ram_005F
C - - - - - 0x000C19 00:8C09: 4C 59 8C  JMP loc_8C59
bra_8C0C_80:
C - - - - - 0x000C1C 00:8C0C: A9 04     LDA #$04
C - - - - - 0x000C1E 00:8C0E: A2 01     LDX #$01
C - - - - - 0x000C20 00:8C10: A4 5F     LDY ram_005F
C - - - - - 0x000C22 00:8C12: 4C 59 8C  JMP loc_8C59
bra_8C15_40:
C - - - - - 0x000C25 00:8C15: A5 5E     LDA ram_005E
C - - - - - 0x000C27 00:8C17: A6 5F     LDX ram_005F
C - - - - - 0x000C29 00:8C19: 20 EE 9D  JSR sub_9DEE_умножить_A_на_X
C - - - - - 0x000C2C 00:8C1C: A5 EC     LDA ram_00EC
C - - - - - 0x000C2E 00:8C1E: 38        SEC
C - - - - - 0x000C2F 00:8C1F: E9 01     SBC #< $0001
C - - - - - 0x000C31 00:8C21: 85 EC     STA ram_00EC
C - - - - - 0x000C33 00:8C23: A5 ED     LDA ram_00ED
C - - - - - 0x000C35 00:8C25: E9 00     SBC #> $0001
C - - - - - 0x000C37 00:8C27: 85 ED     STA ram_00ED
C - - - - - 0x000C39 00:8C29: A5 63     LDA ram_0063
C - - - - - 0x000C3B 00:8C2B: 18        CLC
C - - - - - 0x000C3C 00:8C2C: 65 EC     ADC ram_00EC
C - - - - - 0x000C3E 00:8C2E: 85 63     STA ram_0063
C - - - - - 0x000C40 00:8C30: A5 64     LDA ram_0064
C - - - - - 0x000C42 00:8C32: 65 ED     ADC ram_00ED
C - - - - - 0x000C44 00:8C34: 85 64     STA ram_0064
C - - - - - 0x000C46 00:8C36: A9 00     LDA #$00
C - - - - - 0x000C48 00:8C38: 38        SEC
C - - - - - 0x000C49 00:8C39: E5 5F     SBC ram_005F
C - - - - - 0x000C4B 00:8C3B: A8        TAY
C - - - - - 0x000C4C 00:8C3C: A9 FC     LDA #$FC
C - - - - - 0x000C4E 00:8C3E: A2 FF     LDX #$FF
C - - - - - 0x000C50 00:8C40: 4C 59 8C  JMP loc_8C59
bra_8C0C_00:
C - - - - - 0x000C53 00:8C43: A5 5F     LDA ram_005F
C - - - - - 0x000C55 00:8C45: 38        SEC
C - - - - - 0x000C56 00:8C46: E9 01     SBC #$01
C - - - - - 0x000C58 00:8C48: 18        CLC
C - - - - - 0x000C59 00:8C49: 65 63     ADC ram_0063
C - - - - - 0x000C5B 00:8C4B: 85 63     STA ram_0063
C - - - - - 0x000C5D 00:8C4D: A5 64     LDA ram_0064
C - - - - - 0x000C5F 00:8C4F: 69 00     ADC #$00
C - - - - - 0x000C61 00:8C51: 85 64     STA ram_0064
C - - - - - 0x000C63 00:8C53: A9 FC     LDA #$FC
C - - - - - 0x000C65 00:8C55: A2 FF     LDX #$FF
C - - - - - 0x000C67 00:8C57: A4 5F     LDY ram_005F
loc_8C59:
C D 0 - - - 0x000C69 00:8C59: 85 6D     STA ram_006D
C - - - - - 0x000C6B 00:8C5B: 86 6E     STX ram_006E
C - - - - - 0x000C6D 00:8C5D: 84 6F     STY ram_006F
C - - - - - 0x000C6F 00:8C5F: A5 5E     LDA ram_005E
C - - - - - 0x000C71 00:8C61: C9 07     CMP #$07
C - - - - - 0x000C73 00:8C63: 90 24     BCC bra_8C89
C - - - - - 0x000C75 00:8C65: 38        SEC
C - - - - - 0x000C76 00:8C66: E9 07     SBC #$07
C - - - - - 0x000C78 00:8C68: 85 5E     STA ram_005E
C - - - - - 0x000C7A 00:8C6A: A0 07     LDY #$07
C - - - - - 0x000C7C 00:8C6C: A6 5F     LDX ram_005F
C - - - - - 0x000C7E 00:8C6E: 20 15 8E  JSR sub_8E15
C - - - - - 0x000C81 00:8C71: A9 01     LDA #$01
C - - - - - 0x000C83 00:8C73: 85 7B     STA ram_007B
C - - - - - 0x000C85 00:8C75: A2 09     LDX #$09
C - - - - - 0x000C87 00:8C77: A9 B9     LDA #< (ofs_8CBA - $01)
C - - - - - 0x000C89 00:8C79: 95 00     STA ram_0000,X
C - - - - - 0x000C8B 00:8C7B: A9 8C     LDA #> (ofs_8CBA - $01)
C - - - - - 0x000C8D 00:8C7D: 95 01     STA ram_0001,X
C - - - - - 0x000C8F 00:8C7F: A0 78     LDY #$78 - $02
C - - - - - 0x000C93 00:8C83: 20 69 9F  JSR sub_9F69
C - - - - - 0x000C96 00:8C86: 4C A5 8C  JMP loc_8CA5
bra_8C89:
C - - - - - 0x000C99 00:8C89: A4 5E     LDY ram_005E
C - - - - - 0x000C9B 00:8C8B: A6 5F     LDX ram_005F
C - - - - - 0x000C9D 00:8C8D: 20 15 8E  JSR sub_8E15
C - - - - - 0x000CA0 00:8C90: A5 72     LDA ram_0072
C - - - - - 0x000CA2 00:8C92: F0 11     BEQ bra_8CA5
C - - - - - 0x000CA4 00:8C94: A2 09     LDX #$09
C - - - - - 0x000CA6 00:8C96: A9 21     LDA #< (ofs_8D22 - $01)
C - - - - - 0x000CA8 00:8C98: 95 00     STA ram_0000,X
C - - - - - 0x000CAA 00:8C9A: A9 8D     LDA #> (ofs_8D22 - $01)
C - - - - - 0x000CAC 00:8C9C: 95 01     STA ram_0001,X
C - - - - - 0x000CAE 00:8C9E: A0 78     LDY #$78 - $02
C - - - - - 0x000CB2 00:8CA2: 20 69 9F  JSR sub_9F69
bra_8CA5:
loc_8CA5:
C D 0 - - - 0x000CB5 00:8CA5: A5 75     LDA ram_0075
C - - - - - 0x000CB7 00:8CA7: 85 8E     STA ram_008E
C - - - - - 0x000CB9 00:8CA9: A5 76     LDA ram_0076
C - - - - - 0x000CBB 00:8CAB: 85 8F     STA ram_008F
C - - - - - 0x000CBD 00:8CAD: A9 00     LDA #$00
C - - - - - 0x000CBF 00:8CAF: 85 44     STA ram_0044
C - - - - - 0x000CC1 00:8CB1: 85 45     STA ram_0045
C - - - - - 0x000CC3 00:8CB3: 85 7A     STA ram_007A
C - - - - - 0x000CC5 00:8CB5: A6 77     LDX ram_0077
C - - - - - 0x000CC7 00:8CB7: 4C B9 C4  JMP loc_0x03C4C9_банксвич_PRG_5115



ofs_8CBA:
C - - - - - 0x000CCA 00:8CBA: A2 07     LDX #con_prg_bank + $07
C - - - - - 0x000CCC 00:8CBC: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000CCF 00:8CBF: A9 00     LDA #$00
C - - - - - 0x000CD1 00:8CC1: 85 69     STA ram_0069
C - - - - - 0x000CD3 00:8CC3: 85 6A     STA ram_006A
C - - - - - 0x000CD5 00:8CC5: 24 62     BIT ram_0062
C - - - - - 0x000CD7 00:8CC7: 30 0D     BMI bra_8CD6_loop
C - - - - - 0x000CD9 00:8CC9: A9 00     LDA #$00
C - - - - - 0x000CDB 00:8CCB: 38        SEC
C - - - - - 0x000CDC 00:8CCC: E5 60     SBC ram_0060
C - - - - - 0x000CDE 00:8CCE: 85 60     STA ram_0060
C - - - - - 0x000CE0 00:8CD0: A9 00     LDA #$00
C - - - - - 0x000CE2 00:8CD2: E5 61     SBC ram_0061
C - - - - - 0x000CE4 00:8CD4: 85 61     STA ram_0061
bra_8CD6_loop:
C - - - - - 0x000CE6 00:8CD6: A9 01     LDA #$01
C - - - - - 0x000CE8 00:8CD8: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000CEB 00:8CDB: A5 60     LDA ram_0060
C - - - - - 0x000CED 00:8CDD: 18        CLC
C - - - - - 0x000CEE 00:8CDE: 65 69     ADC ram_0069
C - - - - - 0x000CF0 00:8CE0: 85 69     STA ram_0069
C - - - - - 0x000CF2 00:8CE2: A9 00     LDA #$00
C - - - - - 0x000CF4 00:8CE4: 65 61     ADC ram_0061
C - - - - - 0x000CF6 00:8CE6: AA        TAX
C - - - - - 0x000CF7 00:8CE7: 20 A9 9B  JSR sub_9BA9
C - - - - - 0x000CFA 00:8CEA: 8A        TXA
C - - - - - 0x000CFB 00:8CEB: 10 05     BPL bra_8CF2
C - - - - - 0x000CFD 00:8CED: 49 FF     EOR #$FF
C - - - - - 0x000CFF 00:8CEF: 18        CLC
C - - - - - 0x000D00 00:8CF0: 69 01     ADC #$01
bra_8CF2:
C - - - - - 0x000D02 00:8CF2: 18        CLC
C - - - - - 0x000D03 00:8CF3: 65 6A     ADC ram_006A
C - - - - - 0x000D05 00:8CF5: 85 6A     STA ram_006A
C - - - - - 0x000D07 00:8CF7: 38        SEC
C - - - - - 0x000D08 00:8CF8: E9 20     SBC #$20
C - - - - - 0x000D0A 00:8CFA: 90 DA     BCC bra_8CD6_loop
C - - - - - 0x000D0C 00:8CFC: 85 6A     STA ram_006A
loc_8CFE:
C - - - - - 0x000D0E 00:8CFE: A5 5B     LDA ram_005B
C - - - - - 0x000D10 00:8D00: 10 08     BPL bra_8D0A
- - - - - - 0x000D12 00:8D02: A9 01     LDA #$01
- - - - - - 0x000D14 00:8D04: 20 A8 9F  JSR sub_9FA8_задержка_кадра
- - - - - - 0x000D17 00:8D07: 4C FE 8C  JMP loc_8CFE
bra_8D0A:
C - - - - - 0x000D1A 00:8D0A: A2 0D     LDX #$0D
C - - - - - 0x000D1C 00:8D0C: A9 FE     LDA #< (ofs_8DFF - $01)
C - - - - - 0x000D1E 00:8D0E: 95 00     STA ram_0000,X
C - - - - - 0x000D20 00:8D10: A9 8D     LDA #> (ofs_8DFF - $01)
C - - - - - 0x000D22 00:8D12: 95 01     STA ram_0001,X
C - - - - - 0x000D24 00:8D14: A0 A0     LDY #$A0 - $02
C - - - - - 0x000D28 00:8D18: 20 69 9F  JSR sub_9F69
C - - - - - 0x000D2B 00:8D1B: C6 5E     DEC ram_005E
C - - - - - 0x000D2D 00:8D1D: D0 B7     BNE bra_8CD6_loop
C - - - - - 0x000D2F 00:8D1F: 4C 59 8D  JMP loc_8D59



loc_8D22:
ofs_8D22:
; срабатывает дважды во время бега игрока по полю
; предположительно для обновления спрайтов цифер на миникарте, либо для отображения имен игроков вверху
C D 0 - - - 0x000D32 00:8D22: A2 07     LDX #con_prg_bank + $07
C - - - - - 0x000D34 00:8D24: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000D37 00:8D27: A2 02     LDX #$02
C - - - - - 0x000D39 00:8D29: A0 00     LDY #$00
C - - - - - 0x000D3B 00:8D2B: B1 70     LDA (ram_0070),Y
C - - - - - 0x000D3D 00:8D2D: F0 0B     BEQ bra_8D3A
C - - - - - 0x000D3F 00:8D2F: 0A        ASL
C - - - - - 0x000D40 00:8D30: 90 09     BCC bra_8D3B
C - - - - - 0x000D42 00:8D32: AA        TAX
C - - - - - 0x000D43 00:8D33: A9 FE     LDA #$FE
C - - - - - 0x000D45 00:8D35: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000D48 00:8D38: E8        INX
C - - - - - 0x000D49 00:8D39: E8        INX
bra_8D3A:
C - - - - - 0x000D4A 00:8D3A: 8A        TXA
bra_8D3B:
C - - - - - 0x000D4B 00:8D3B: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000D4E 00:8D3E: A9 00     LDA #$00
C - - - - - 0x000D50 00:8D40: 85 69     STA ram_0069
C - - - - - 0x000D52 00:8D42: 85 6A     STA ram_006A
C - - - - - 0x000D54 00:8D44: 24 62     BIT ram_0062
C - - - - - 0x000D56 00:8D46: 30 0D     BMI bra_8D55
C - - - - - 0x000D58 00:8D48: A9 00     LDA #$00
C - - - - - 0x000D5A 00:8D4A: 38        SEC
C - - - - - 0x000D5B 00:8D4B: E5 60     SBC ram_0060
C - - - - - 0x000D5D 00:8D4D: 85 60     STA ram_0060
C - - - - - 0x000D5F 00:8D4F: A9 00     LDA #$00
C - - - - - 0x000D61 00:8D51: E5 61     SBC ram_0061
C - - - - - 0x000D63 00:8D53: 85 61     STA ram_0061
bra_8D55:
C - - - - - 0x000D65 00:8D55: 24 62     BIT ram_0062
C - - - - - 0x000D67 00:8D57: 50 2F     BVC bra_8D88_loop
loc_8D59:
bra_8D59_loop:
C D 0 - - - 0x000D69 00:8D59: A9 01     LDA #$01
C - - - - - 0x000D6B 00:8D5B: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000D6E 00:8D5E: A5 60     LDA ram_0060
C - - - - - 0x000D70 00:8D60: 18        CLC
C - - - - - 0x000D71 00:8D61: 65 69     ADC ram_0069
C - - - - - 0x000D73 00:8D63: 85 69     STA ram_0069
C - - - - - 0x000D75 00:8D65: A9 00     LDA #$00
C - - - - - 0x000D77 00:8D67: 65 61     ADC ram_0061
C - - - - - 0x000D79 00:8D69: AA        TAX
C - - - - - 0x000D7A 00:8D6A: 20 A9 9B  JSR sub_9BA9
C - - - - - 0x000D7D 00:8D6D: 8A        TXA
C - - - - - 0x000D7E 00:8D6E: 10 05     BPL bra_8D75
C - - - - - 0x000D80 00:8D70: 49 FF     EOR #$FF
C - - - - - 0x000D82 00:8D72: 18        CLC
C - - - - - 0x000D83 00:8D73: 69 01     ADC #$01
bra_8D75:
C - - - - - 0x000D85 00:8D75: 18        CLC
C - - - - - 0x000D86 00:8D76: 65 6A     ADC ram_006A
C - - - - - 0x000D88 00:8D78: 85 6A     STA ram_006A
C - - - - - 0x000D8A 00:8D7A: 38        SEC
C - - - - - 0x000D8B 00:8D7B: E9 20     SBC #$20
C - - - - - 0x000D8D 00:8D7D: 90 DA     BCC bra_8D59_loop
C - - - - - 0x000D8F 00:8D7F: 85 6A     STA ram_006A
C - - - - - 0x000D91 00:8D81: C6 72     DEC ram_0072
C - - - - - 0x000D93 00:8D83: D0 D4     BNE bra_8D59_loop
C - - - - - 0x000D95 00:8D85: 4C C8 8D  JMP loc_8DC8
bra_8D88_loop:
C - - - - - 0x000D98 00:8D88: A9 01     LDA #$01
C - - - - - 0x000D9A 00:8D8A: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x000D9D 00:8D8D: A5 60     LDA ram_0060
C - - - - - 0x000D9F 00:8D8F: 18        CLC
C - - - - - 0x000DA0 00:8D90: 65 69     ADC ram_0069
C - - - - - 0x000DA2 00:8D92: 85 69     STA ram_0069
C - - - - - 0x000DA4 00:8D94: A9 00     LDA #$00
C - - - - - 0x000DA6 00:8D96: 65 61     ADC ram_0061
C - - - - - 0x000DA8 00:8D98: AA        TAX
C - - - - - 0x000DA9 00:8D99: 20 CA 9B  JSR sub_9BCA
C - - - - - 0x000DAC 00:8D9C: 8A        TXA
C - - - - - 0x000DAD 00:8D9D: 10 05     BPL bra_8DA4
C - - - - - 0x000DAF 00:8D9F: 49 FF     EOR #$FF
C - - - - - 0x000DB1 00:8DA1: 18        CLC
C - - - - - 0x000DB2 00:8DA2: 69 01     ADC #$01
bra_8DA4:
C - - - - - 0x000DB4 00:8DA4: 18        CLC
C - - - - - 0x000DB5 00:8DA5: 65 6A     ADC ram_006A
C - - - - - 0x000DB7 00:8DA7: 85 6A     STA ram_006A
C - - - - - 0x000DB9 00:8DA9: 38        SEC
C - - - - - 0x000DBA 00:8DAA: E9 20     SBC #$20
C - - - - - 0x000DBC 00:8DAC: 90 DA     BCC bra_8D88_loop
C - - - - - 0x000DBE 00:8DAE: 85 6A     STA ram_006A
C - - - - - 0x000DC0 00:8DB0: C6 72     DEC ram_0072
C - - - - - 0x000DC2 00:8DB2: D0 D4     BNE bra_8D88_loop
C - - - - - 0x000DC4 00:8DB4: A5 7A     LDA ram_007A
C - - - - - 0x000DC6 00:8DB6: 38        SEC
C - - - - - 0x000DC7 00:8DB7: E5 6A     SBC ram_006A
C - - - - - 0x000DC9 00:8DB9: 85 7A     STA ram_007A
C - - - - - 0x000DCB 00:8DBB: A5 7B     LDA ram_007B
C - - - - - 0x000DCD 00:8DBD: E9 00     SBC #$00
C - - - - - 0x000DCF 00:8DBF: 85 7B     STA ram_007B
C - - - - - 0x000DD1 00:8DC1: A5 47     LDA ram_0047
C - - - - - 0x000DD3 00:8DC3: 38        SEC
C - - - - - 0x000DD4 00:8DC4: E5 6A     SBC ram_006A
C - - - - - 0x000DD6 00:8DC6: 85 47     STA ram_0047
loc_8DC8:
C D 0 - - - 0x000DD8 00:8DC8: A5 62     LDA ram_0062
C - - - - - 0x000DDA 00:8DCA: 29 20     AND #$20
C - - - - - 0x000DDC 00:8DCC: D0 2E     BNE bra_8DFC
C - - - - - 0x000DDE 00:8DCE: A5 70     LDA ram_0070
C - - - - - 0x000DE0 00:8DD0: 18        CLC
C - - - - - 0x000DE1 00:8DD1: 69 03     ADC #< $0003
C - - - - - 0x000DE3 00:8DD3: 85 70     STA ram_0070
C - - - - - 0x000DE5 00:8DD5: A5 71     LDA ram_0071
C - - - - - 0x000DE7 00:8DD7: 69 00     ADC #> $0003
C - - - - - 0x000DE9 00:8DD9: 85 71     STA ram_0071
C - - - - - 0x000DEB 00:8DDB: A9 00     LDA #$00
C - - - - - 0x000DED 00:8DDD: 85 60     STA ram_0060
C - - - - - 0x000DEF 00:8DDF: A0 01     LDY #$01
C - - - - - 0x000DF1 00:8DE1: B1 70     LDA (ram_0070),Y
C - - - - - 0x000DF3 00:8DE3: 29 E0     AND #$E0
C - - - - - 0x000DF5 00:8DE5: 85 62     STA ram_0062
C - - - - - 0x000DF7 00:8DE7: B1 70     LDA (ram_0070),Y
C - - - - - 0x000DF9 00:8DE9: 29 1F     AND #$1F
C - - - - - 0x000DFB 00:8DEB: AA        TAX
C - - - - - 0x000DFC 00:8DEC: 4A        LSR
C - - - - - 0x000DFD 00:8DED: 66 60     ROR ram_0060
C - - - - - 0x000DFF 00:8DEF: 4A        LSR
C - - - - - 0x000E00 00:8DF0: 66 60     ROR ram_0060
C - - - - - 0x000E02 00:8DF2: 85 61     STA ram_0061
C - - - - - 0x000E04 00:8DF4: C8        INY
C - - - - - 0x000E05 00:8DF5: B1 70     LDA (ram_0070),Y
C - - - - - 0x000E07 00:8DF7: 85 72     STA ram_0072
C - - - - - 0x000E09 00:8DF9: 4C 22 8D  JMP loc_8D22
bra_8DFC:
C - - - - - 0x000E0C 00:8DFC: 4C 7E 9F  JMP loc_9F7E_отключить_подпрограмму_в_стеке



ofs_8DFF:
C - - - - - 0x000E0F 00:8DFF: A5 5B     LDA ram_005B
C - - - - - 0x000E11 00:8E01: 09 80     ORA #$80
C - - - - - 0x000E13 00:8E03: 85 5B     STA ram_005B
C - - - - - 0x000E15 00:8E05: A0 01     LDY #$01
C - - - - - 0x000E17 00:8E07: A6 5F     LDX ram_005F
C - - - - - 0x000E19 00:8E09: 20 15 8E  JSR sub_8E15
C - - - - - 0x000E1C 00:8E0C: A5 5B     LDA ram_005B
C - - - - - 0x000E1E 00:8E0E: 29 7F     AND #$7F
C - - - - - 0x000E20 00:8E10: 85 5B     STA ram_005B
C - - - - - 0x000E22 00:8E12: 4C 7E 9F  JMP loc_9F7E_отключить_подпрограмму_в_стеке



sub_8E15:
C - - - - - 0x000E25 00:8E15: 84 6C     STY ram_006C
C - - - - - 0x000E27 00:8E17: 86 6B     STX ram_006B
loc_8E19_loop:
C D 0 - - - 0x000E29 00:8E19: A5 63     LDA ram_0063
C - - - - - 0x000E2B 00:8E1B: 85 65     STA ram_0065
C - - - - - 0x000E2D 00:8E1D: A5 64     LDA ram_0064
C - - - - - 0x000E2F 00:8E1F: 85 66     STA ram_0066
C - - - - - 0x000E31 00:8E21: A5 6B     LDA ram_006B
C - - - - - 0x000E33 00:8E23: 85 ED     STA ram_00ED
C - - - - - 0x000E35 00:8E25: A5 5C     LDA ram_005C
C - - - - - 0x000E37 00:8E27: 85 73     STA ram_0073
C - - - - - 0x000E39 00:8E29: A5 5D     LDA ram_005D
C - - - - - 0x000E3B 00:8E2B: 85 74     STA ram_0074
bra_8E2D_loop:
C - - - - - 0x000E3D 00:8E2D: A0 00     LDY #$00
C - - - - - 0x000E3F 00:8E2F: B1 63     LDA (ram_0063),Y
C - - - - - 0x000E41 00:8E31: 20 F0 8E  JSR sub_8EF0_чтение_блоков_тайлов
C - - - - - 0x000E44 00:8E34: A5 5C     LDA ram_005C
C - - - - - 0x000E46 00:8E36: AA        TAX
C - - - - - 0x000E47 00:8E37: 18        CLC
C - - - - - 0x000E48 00:8E38: 65 6D     ADC ram_006D
C - - - - - 0x000E4A 00:8E3A: 85 5C     STA ram_005C
C - - - - - 0x000E4C 00:8E3C: 8A        TXA
C - - - - - 0x000E4D 00:8E3D: 45 5C     EOR ram_005C
C - - - - - 0x000E4F 00:8E3F: 29 20     AND #$20
C - - - - - 0x000E51 00:8E41: F0 15     BEQ bra_8E58
C - - - - - 0x000E53 00:8E43: A5 6D     LDA ram_006D
C - - - - - 0x000E55 00:8E45: 0A        ASL
C - - - - - 0x000E56 00:8E46: 0A        ASL
C - - - - - 0x000E57 00:8E47: 0A        ASL
C - - - - - 0x000E58 00:8E48: 49 FF     EOR #$FF
C - - - - - 0x000E5A 00:8E4A: 18        CLC
C - - - - - 0x000E5B 00:8E4B: 69 01     ADC #$01
C - - - - - 0x000E5D 00:8E4D: 18        CLC
C - - - - - 0x000E5E 00:8E4E: 65 5C     ADC ram_005C
C - - - - - 0x000E60 00:8E50: 85 5C     STA ram_005C
C - - - - - 0x000E62 00:8E52: A5 5D     LDA ram_005D
C - - - - - 0x000E64 00:8E54: 49 04     EOR #$04
C - - - - - 0x000E66 00:8E56: 85 5D     STA ram_005D
bra_8E58:
C - - - - - 0x000E68 00:8E58: A5 6E     LDA ram_006E
C - - - - - 0x000E6A 00:8E5A: 48        PHA
C - - - - - 0x000E6B 00:8E5B: 18        CLC
C - - - - - 0x000E6C 00:8E5C: 65 63     ADC ram_0063
C - - - - - 0x000E6E 00:8E5E: 85 63     STA ram_0063
C - - - - - 0x000E70 00:8E60: 68        PLA
C - - - - - 0x000E71 00:8E61: 30 07     BMI bra_8E6A
C - - - - - 0x000E73 00:8E63: A5 64     LDA ram_0064
C - - - - - 0x000E75 00:8E65: 69 00     ADC #$00
C - - - - - 0x000E77 00:8E67: 4C 6E 8E  JMP loc_8E6E
bra_8E6A:
C - - - - - 0x000E7A 00:8E6A: A5 64     LDA ram_0064
C - - - - - 0x000E7C 00:8E6C: E9 00     SBC #$00
loc_8E6E:
C D 0 - - - 0x000E7E 00:8E6E: 85 64     STA ram_0064
C - - - - - 0x000E80 00:8E70: C6 ED     DEC ram_00ED
C - - - - - 0x000E82 00:8E72: D0 B9     BNE bra_8E2D_loop
C - - - - - 0x000E84 00:8E74: A5 6F     LDA ram_006F
C - - - - - 0x000E86 00:8E76: 48        PHA
C - - - - - 0x000E87 00:8E77: 18        CLC
C - - - - - 0x000E88 00:8E78: 65 65     ADC ram_0065
C - - - - - 0x000E8A 00:8E7A: 85 63     STA ram_0063
C - - - - - 0x000E8C 00:8E7C: 68        PLA
C - - - - - 0x000E8D 00:8E7D: 30 07     BMI bra_8E86
C - - - - - 0x000E8F 00:8E7F: A5 66     LDA ram_0066
C - - - - - 0x000E91 00:8E81: 69 00     ADC #$00
C - - - - - 0x000E93 00:8E83: 4C 8A 8E  JMP loc_8E8A
bra_8E86:
C - - - - - 0x000E96 00:8E86: A5 66     LDA ram_0066
C - - - - - 0x000E98 00:8E88: E9 00     SBC #$00
loc_8E8A:
C D 0 - - - 0x000E9A 00:8E8A: 85 64     STA ram_0064
C - - - - - 0x000E9C 00:8E8C: A5 62     LDA ram_0062
C - - - - - 0x000E9E 00:8E8E: 29 C0     AND #$C0
C - - - - - 0x000EA0 00:8E90: C9 40     CMP #$40
C - - - - - 0x000EA2 00:8E92: F0 2E     BEQ bra_8EC2
C - - - - - 0x000EA4 00:8E94: A5 73     LDA ram_0073
C - - - - - 0x000EA6 00:8E96: 18        CLC
C - - - - - 0x000EA7 00:8E97: 69 80     ADC #< $0080
C - - - - - 0x000EA9 00:8E99: 85 5C     STA ram_005C
C - - - - - 0x000EAB 00:8E9B: AA        TAX
C - - - - - 0x000EAC 00:8E9C: A5 74     LDA ram_0074
C - - - - - 0x000EAE 00:8E9E: 69 00     ADC #> $0080
C - - - - - 0x000EB0 00:8EA0: 85 5D     STA ram_005D
C - - - - - 0x000EB2 00:8EA2: 8A        TXA
C - - - - - 0x000EB3 00:8EA3: 38        SEC
C - - - - - 0x000EB4 00:8EA4: E9 40     SBC #< $0040
C - - - - - 0x000EB6 00:8EA6: 10 40     BPL bra_8EE8
C - - - - - 0x000EB8 00:8EA8: A5 5D     LDA ram_005D
C - - - - - 0x000EBA 00:8EAA: E9 00     SBC #> $0040
C - - - - - 0x000EBC 00:8EAC: 29 03     AND #$03
C - - - - - 0x000EBE 00:8EAE: C9 03     CMP #$03
C - - - - - 0x000EC0 00:8EB0: D0 36     BNE bra_8EE8
C - - - - - 0x000EC2 00:8EB2: A5 5C     LDA ram_005C
C - - - - - 0x000EC4 00:8EB4: 38        SEC
C - - - - - 0x000EC5 00:8EB5: E9 C0     SBC #< $03C0
C - - - - - 0x000EC7 00:8EB7: 85 5C     STA ram_005C
C - - - - - 0x000EC9 00:8EB9: A5 5D     LDA ram_005D
C - - - - - 0x000ECB 00:8EBB: E9 03     SBC #> $03C0
C - - - - - 0x000ECD 00:8EBD: 85 5D     STA ram_005D
C - - - - - 0x000ECF 00:8EBF: 4C E8 8E  JMP loc_8EE8
bra_8EC2:
C - - - - - 0x000ED2 00:8EC2: A5 73     LDA ram_0073
C - - - - - 0x000ED4 00:8EC4: 38        SEC
C - - - - - 0x000ED5 00:8EC5: E9 80     SBC #< $0080
C - - - - - 0x000ED7 00:8EC7: 85 5C     STA ram_005C
C - - - - - 0x000ED9 00:8EC9: AA        TAX
C - - - - - 0x000EDA 00:8ECA: A5 74     LDA ram_0074
C - - - - - 0x000EDC 00:8ECC: E9 00     SBC #> $0080
C - - - - - 0x000EDE 00:8ECE: 85 5D     STA ram_005D
C - - - - - 0x000EE0 00:8ED0: 8A        TXA
C - - - - - 0x000EE1 00:8ED1: 10 15     BPL bra_8EE8
C - - - - - 0x000EE3 00:8ED3: A5 5D     LDA ram_005D
C - - - - - 0x000EE5 00:8ED5: 29 03     AND #$03
C - - - - - 0x000EE7 00:8ED7: C9 03     CMP #$03
C - - - - - 0x000EE9 00:8ED9: D0 0D     BNE bra_8EE8
C - - - - - 0x000EEB 00:8EDB: A5 5C     LDA ram_005C
C - - - - - 0x000EED 00:8EDD: 18        CLC
C - - - - - 0x000EEE 00:8EDE: 69 C0     ADC #$C0
C - - - - - 0x000EF0 00:8EE0: 85 5C     STA ram_005C
C - - - - - 0x000EF2 00:8EE2: A5 5D     LDA ram_005D
C - - - - - 0x000EF4 00:8EE4: 69 03     ADC #$03
C - - - - - 0x000EF6 00:8EE6: 85 5D     STA ram_005D
bra_8EE8:
loc_8EE8:
C D 0 - - - 0x000EF8 00:8EE8: C6 6C     DEC ram_006C
C - - - - - 0x000EFA 00:8EEA: F0 03     BEQ bra_8EEF_RTS
C - - - - - 0x000EFC 00:8EEC: 4C 19 8E  JMP loc_8E19_loop
bra_8EEF_RTS:
C - - - - - 0x000EFF 00:8EEF: 60        RTS



sub_8EF0_чтение_блоков_тайлов:
C - - - - - 0x000F00 00:8EF0: AA        TAX
C - - - - - 0x000F01 00:8EF1: A5 5C     LDA ram_005C
C - - - - - 0x000F03 00:8EF3: 85 67     STA ram_0067
C - - - - - 0x000F05 00:8EF5: A5 5D     LDA ram_005D
C - - - - - 0x000F07 00:8EF7: 85 68     STA ram_0068
C - - - - - 0x000F09 00:8EF9: A5 5B     LDA ram_005B
C - - - - - 0x000F0B 00:8EFB: 29 01     AND #$01
C - - - - - 0x000F0D 00:8EFD: A8        TAY
C - - - - - 0x000F0E 00:8EFE: 85 EB     STA ram_00EB
C - - - - - 0x000F10 00:8F00: 8A        TXA
C - - - - - 0x000F11 00:8F01: 85 EA     STA ram_00EA
C - - - - - 0x000F13 00:8F03: 0A        ASL
C - - - - - 0x000F14 00:8F04: 26 EB     ROL ram_00EB
C - - - - - 0x000F16 00:8F06: 0A        ASL
C - - - - - 0x000F17 00:8F07: 26 EB     ROL ram_00EB
C - - - - - 0x000F19 00:8F09: 0A        ASL
C - - - - - 0x000F1A 00:8F0A: 26 EB     ROL ram_00EB
C - - - - - 0x000F1C 00:8F0C: 0A        ASL
C - - - - - 0x000F1D 00:8F0D: 26 EB     ROL ram_00EB
C - - - - - 0x000F1F 00:8F0F: 18        CLC
C - - - - - 0x000F20 00:8F10: 65 EA     ADC ram_00EA
C - - - - - 0x000F22 00:8F12: 85 EA     STA ram_00EA
C - - - - - 0x000F24 00:8F14: 98        TYA
C - - - - - 0x000F25 00:8F15: 65 EB     ADC ram_00EB
C - - - - - 0x000F27 00:8F17: 85 EB     STA ram_00EB
C - - - - - 0x000F29 00:8F19: A5 EA     LDA ram_00EA
C - - - - - 0x000F2B 00:8F1B: 18        CLC
C - - - - - 0x000F2C 00:8F1C: 69 00     ADC #< tbl_0x010010_блоки_4x4_тайла
C - - - - - 0x000F2E 00:8F1E: 85 EA     STA ram_00EA
C - - - - - 0x000F30 00:8F20: A5 EB     LDA ram_00EB
C - - - - - 0x000F32 00:8F22: 69 A0     ADC #> tbl_0x010010_блоки_4x4_тайла
C - - - - - 0x000F34 00:8F24: 85 EB     STA ram_00EB
C - - - - - 0x000F36 00:8F26: A2 08     LDX #con_prg_bank + $08
C - - - - - 0x000F38 00:8F28: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000F3B 00:8F2B: A0 00     LDY #$00
C - - - - - 0x000F3D 00:8F2D: B1 EA     LDA (ram_00EA),Y
C - - - - - 0x000F3F 00:8F2F: 85 E7     STA ram_00E7
C - - - - - 0x000F41 00:8F31: 20 D1 8F  JSR sub_8FD1
C - - - - - 0x000F44 00:8F34: E6 EA     INC ram_00EA
C - - - - - 0x000F46 00:8F36: D0 02     BNE bra_8F3A
C - - - - - 0x000F48 00:8F38: E6 EB     INC ram_00EB
bra_8F3A:
C - - - - - 0x000F4A 00:8F3A: A9 04     LDA #$04
C - - - - - 0x000F4C 00:8F3C: 85 E8     STA ram_00E8
bra_8F3E_loop:
loc_8F3E:
C D 0 - - - 0x000F4E 00:8F3E: A4 67     LDY ram_0067
C - - - - - 0x000F50 00:8F40: A6 68     LDX ram_0068
C - - - - - 0x000F52 00:8F42: A9 04     LDA #$04
C - - - - - 0x000F54 00:8F44: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x000F57 00:8F47: A0 00     LDY #$00
bra_8F49_loop:
C - - - - - 0x000F59 00:8F49: B1 EA     LDA (ram_00EA),Y
C - - - - - 0x000F5B 00:8F4B: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000F5E 00:8F4E: E8        INX
C - - - - - 0x000F5F 00:8F4F: C8        INY
C - - - - - 0x000F60 00:8F50: C0 04     CPY #$04
C - - - - - 0x000F62 00:8F52: D0 F5     BNE bra_8F49_loop
C - - - - - 0x000F64 00:8F54: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x000F67 00:8F57: C6 E8     DEC ram_00E8
C - - - - - 0x000F69 00:8F59: F0 70     BEQ bra_8FCB
C - - - - - 0x000F6B 00:8F5B: A5 EA     LDA ram_00EA
C - - - - - 0x000F6D 00:8F5D: 18        CLC
C - - - - - 0x000F6E 00:8F5E: 69 04     ADC #< $0004
C - - - - - 0x000F70 00:8F60: 85 EA     STA ram_00EA
C - - - - - 0x000F72 00:8F62: A5 EB     LDA ram_00EB
C - - - - - 0x000F74 00:8F64: 69 00     ADC #> $0004
C - - - - - 0x000F76 00:8F66: 85 EB     STA ram_00EB
C - - - - - 0x000F78 00:8F68: A5 67     LDA ram_0067
C - - - - - 0x000F7A 00:8F6A: 18        CLC
C - - - - - 0x000F7B 00:8F6B: 69 20     ADC #< $0020
C - - - - - 0x000F7D 00:8F6D: 85 67     STA ram_0067
C - - - - - 0x000F7F 00:8F6F: A5 68     LDA ram_0068
C - - - - - 0x000F81 00:8F71: 69 00     ADC #> $0020
C - - - - - 0x000F83 00:8F73: 85 68     STA ram_0068
C - - - - - 0x000F85 00:8F75: 29 03     AND #$03
C - - - - - 0x000F87 00:8F77: C9 03     CMP #$03
C - - - - - 0x000F89 00:8F79: D0 C3     BNE bra_8F3E_loop
C - - - - - 0x000F8B 00:8F7B: A5 67     LDA ram_0067
C - - - - - 0x000F8D 00:8F7D: C9 C0     CMP #$C0
C - - - - - 0x000F8F 00:8F7F: 90 BD     BCC bra_8F3E_loop
C - - - - - 0x000F91 00:8F81: A5 67     LDA ram_0067
C - - - - - 0x000F93 00:8F83: 38        SEC
C - - - - - 0x000F94 00:8F84: E9 C0     SBC #$C0
C - - - - - 0x000F96 00:8F86: 85 67     STA ram_0067
C - - - - - 0x000F98 00:8F88: A5 68     LDA ram_0068
C - - - - - 0x000F9A 00:8F8A: E9 03     SBC #$03
C - - - - - 0x000F9C 00:8F8C: 85 68     STA ram_0068
C - - - - - 0x000F9E 00:8F8E: 20 49 90  JSR sub_9049
C - - - - - 0x000FA1 00:8F91: A9 01     LDA #$01
C - - - - - 0x000FA3 00:8F93: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x000FA6 00:8F96: A5 67     LDA ram_0067
C - - - - - 0x000FA8 00:8F98: 4A        LSR
C - - - - - 0x000FA9 00:8F99: 4A        LSR
C - - - - - 0x000FAA 00:8F9A: 29 07     AND #$07
C - - - - - 0x000FAC 00:8F9C: A8        TAY
C - - - - - 0x000FAD 00:8F9D: A5 62     LDA ram_0062
C - - - - - 0x000FAF 00:8F9F: 29 C0     AND #$C0
C - - - - - 0x000FB1 00:8FA1: C9 40     CMP #$40
C - - - - - 0x000FB3 00:8FA3: F0 13     BEQ bra_8FB8
C - - - - - 0x000FB5 00:8FA5: A5 E7     LDA ram_00E7
C - - - - - 0x000FB7 00:8FA7: 4A        LSR
C - - - - - 0x000FB8 00:8FA8: 4A        LSR
C - - - - - 0x000FB9 00:8FA9: 4A        LSR
C - - - - - 0x000FBA 00:8FAA: 4A        LSR
C - - - - - 0x000FBB 00:8FAB: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000FBE 00:8FAE: 99 4A 06  STA ram_064A,Y
C - - - - - 0x000FC1 00:8FB1: E8        INX
C - - - - - 0x000FC2 00:8FB2: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x000FC5 00:8FB5: 4C 3E 8F  JMP loc_8F3E
bra_8FB8:
C - - - - - 0x000FC8 00:8FB8: A5 E7     LDA ram_00E7
C - - - - - 0x000FCA 00:8FBA: 4A        LSR
C - - - - - 0x000FCB 00:8FBB: 4A        LSR
C - - - - - 0x000FCC 00:8FBC: 4A        LSR
C - - - - - 0x000FCD 00:8FBD: 4A        LSR
C - - - - - 0x000FCE 00:8FBE: 19 4A 06  ORA ram_064A,Y
C - - - - - 0x000FD1 00:8FC1: 9D E8 05  STA ram_05E8,X
C - - - - - 0x000FD4 00:8FC4: E8        INX
C - - - - - 0x000FD5 00:8FC5: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x000FD8 00:8FC8: 4C 3E 8F  JMP loc_8F3E
bra_8FCB:
C - - - - - 0x000FDB 00:8FCB: A2 07     LDX #con_prg_bank + $07
C - - - - - 0x000FDD 00:8FCD: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x000FE0 00:8FD0: 60        RTS



sub_8FD1:
C - - - - - 0x000FE1 00:8FD1: 20 49 90  JSR sub_9049
C - - - - - 0x000FE4 00:8FD4: 24 67     BIT ram_0067
C - - - - - 0x000FE6 00:8FD6: 50 62     BVC bra_903A
C - - - - - 0x000FE8 00:8FD8: 84 E8     STY ram_00E8
C - - - - - 0x000FEA 00:8FDA: 86 E9     STX ram_00E9
C - - - - - 0x000FEC 00:8FDC: A9 01     LDA #$01
C - - - - - 0x000FEE 00:8FDE: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x000FF1 00:8FE1: A5 67     LDA ram_0067
C - - - - - 0x000FF3 00:8FE3: 4A        LSR
C - - - - - 0x000FF4 00:8FE4: 4A        LSR
C - - - - - 0x000FF5 00:8FE5: 29 07     AND #$07
C - - - - - 0x000FF7 00:8FE7: A8        TAY
C - - - - - 0x000FF8 00:8FE8: A5 62     LDA ram_0062
C - - - - - 0x000FFA 00:8FEA: 29 C0     AND #$C0
C - - - - - 0x000FFC 00:8FEC: C9 40     CMP #$40
C - - - - - 0x000FFE 00:8FEE: F0 1B     BEQ bra_900B


; bzk garbage? в новых логах не выполнялось
- - - - - - 0x001000 00:8FF0: A5 E7     LDA ram_00E7
- - - - - - 0x001002 00:8FF2: 0A        ASL
- - - - - - 0x001003 00:8FF3: 0A        ASL
- - - - - - 0x001004 00:8FF4: 0A        ASL
- - - - - - 0x001005 00:8FF5: 0A        ASL
- - - - - - 0x001006 00:8FF6: 19 4A 06  ORA ram_064A,Y
- - - - - - 0x001009 00:8FF9: 9D E8 05  STA ram_05E8,X
- - - - - - 0x00100C 00:8FFC: E8        INX
- - - - - - 0x00100D 00:8FFD: A5 E7     LDA ram_00E7
- - - - - - 0x00100F 00:8FFF: 4A        LSR
- - - - - - 0x001010 00:9000: 4A        LSR
- - - - - - 0x001011 00:9001: 4A        LSR
- - - - - - 0x001012 00:9002: 4A        LSR
- - - - - - 0x001013 00:9003: 99 4A 06  STA ram_064A,Y
- - - - - - 0x001016 00:9006: 85 E6     STA ram_00E6
- - - - - - 0x001018 00:9008: 4C 25 90  JMP loc_9025



bra_900B:
C - - - - - 0x00101B 00:900B: A5 E7     LDA ram_00E7
C - - - - - 0x00101D 00:900D: 0A        ASL
C - - - - - 0x00101E 00:900E: 0A        ASL
C - - - - - 0x00101F 00:900F: 0A        ASL
C - - - - - 0x001020 00:9010: 0A        ASL
C - - - - - 0x001021 00:9011: 48        PHA
C - - - - - 0x001022 00:9012: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001025 00:9015: E8        INX
C - - - - - 0x001026 00:9016: A5 E7     LDA ram_00E7
C - - - - - 0x001028 00:9018: 4A        LSR
C - - - - - 0x001029 00:9019: 4A        LSR
C - - - - - 0x00102A 00:901A: 4A        LSR
C - - - - - 0x00102B 00:901B: 4A        LSR
C - - - - - 0x00102C 00:901C: 19 4A 06  ORA ram_064A,Y
C - - - - - 0x00102F 00:901F: 85 E6     STA ram_00E6
C - - - - - 0x001031 00:9021: 68        PLA
C - - - - - 0x001032 00:9022: 99 4A 06  STA ram_064A,Y
loc_9025:
C - - - - - 0x001035 00:9025: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x001038 00:9028: A5 E8     LDA ram_00E8
C - - - - - 0x00103A 00:902A: 18        CLC
C - - - - - 0x00103B 00:902B: 69 08     ADC #$08
C - - - - - 0x00103D 00:902D: A8        TAY
C - - - - - 0x00103E 00:902E: A6 E9     LDX ram_00E9
C - - - - - 0x001040 00:9030: A9 01     LDA #$01
C - - - - - 0x001042 00:9032: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x001045 00:9035: A5 E6     LDA ram_00E6
C - - - - - 0x001047 00:9037: 4C 41 90  JMP loc_9041
bra_903A:
C - - - - - 0x00104A 00:903A: A9 01     LDA #$01
C - - - - - 0x00104C 00:903C: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x00104F 00:903F: A5 E7     LDA ram_00E7
loc_9041:
C D 0 - - - 0x001051 00:9041: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001054 00:9044: E8        INX
C - - - - - 0x001055 00:9045: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x001058 00:9048: 60        RTS



sub_9049:
C - - - - - 0x001059 00:9049: A5 67     LDA ram_0067
C - - - - - 0x00105B 00:904B: 29 9C     AND #$9C
C - - - - - 0x00105D 00:904D: 4A        LSR
C - - - - - 0x00105E 00:904E: 4A        LSR
C - - - - - 0x00105F 00:904F: 85 E6     STA ram_00E6
C - - - - - 0x001061 00:9051: 29 20     AND #$20
C - - - - - 0x001063 00:9053: 4A        LSR
C - - - - - 0x001064 00:9054: 4A        LSR
C - - - - - 0x001065 00:9055: 05 E6     ORA ram_00E6
C - - - - - 0x001067 00:9057: 29 0F     AND #$0F
C - - - - - 0x001069 00:9059: 85 E6     STA ram_00E6
C - - - - - 0x00106B 00:905B: A5 68     LDA ram_0068
C - - - - - 0x00106D 00:905D: 0A        ASL
C - - - - - 0x00106E 00:905E: 0A        ASL
C - - - - - 0x00106F 00:905F: 0A        ASL
C - - - - - 0x001070 00:9060: 0A        ASL
C - - - - - 0x001071 00:9061: 29 30     AND #$30
C - - - - - 0x001073 00:9063: 18        CLC
C - - - - - 0x001074 00:9064: 69 C0     ADC #$C0
C - - - - - 0x001076 00:9066: 05 E6     ORA ram_00E6
C - - - - - 0x001078 00:9068: A8        TAY
C - - - - - 0x001079 00:9069: A5 68     LDA ram_0068
C - - - - - 0x00107B 00:906B: 29 FC     AND #$FC
C - - - - - 0x00107D 00:906D: 69 03     ADC #$03
C - - - - - 0x00107F 00:906F: AA        TAX
C - - - - - 0x001080 00:9070: 60        RTS



sub_9071_очистить_2000_21FF:
C - - - - - 0x001081 00:9071: A9 20     LDA #$20
C - - - - - 0x001083 00:9073: 4C 78 90  BNE bra_9078  ; jmp

sub_9076_очистить_2400_25FF:
C - - - - - 0x001086 00:9076: A9 24     LDA #$24
bra_9078:
C D 0 - - - 0x001088 00:9078: 85 E7     STA ram_00E7
C - - - - - 0x00108A 00:907A: A9 00     LDA #$00
C - - - - - 0x00108C 00:907C: 85 E6     STA ram_00E6
C - - - - - 0x00108E 00:907E: A0 10     LDY #$10
C - - - - - 0x001090 00:9080: A2 20     LDX #$20
C - - - - - 0x001092 00:9082: 4C E8 98  JMP loc_98E8_затереть_часть_экрана



sub_9085:
C - - - - - 0x001095 00:9085: A9 00     LDA #$00
C - - - - - 0x001097 00:9087: A0 01     LDY #$01
bra_9089_loop_0468_0556:
C - - - - - 0x001099 00:9089: 99 67 04  STA ram_0468 - $01,Y
C - - - - - 0x00109C 00:908C: C8        INY
C - - - - - 0x00109D 00:908D: D0 FA     BNE bra_9089_loop_0468_0556
C - - - - - 0x00109F 00:908F: A9 00     LDA #$00
C - - - - - 0x0010A1 00:9091: 85 97     STA ram_0097
C - - - - - 0x0010A3 00:9093: A0 01     LDY #$01
C - - - - - 0x0010A5 00:9095: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0010A7 00:9097: 85 EC     STA ram_00EC
C - - - - - 0x0010A9 00:9099: A5 4D     LDA ram_004D
C - - - - - 0x0010AB 00:909B: 18        CLC
C - - - - - 0x0010AC 00:909C: 69 02     ADC #< $0002
C - - - - - 0x0010AE 00:909E: 85 4D     STA ram_004D
C - - - - - 0x0010B0 00:90A0: A5 4E     LDA ram_004E
C - - - - - 0x0010B2 00:90A2: 69 00     ADC #> $0002
C - - - - - 0x0010B4 00:90A4: 85 4E     STA ram_004E
C - - - - - 0x0010B6 00:90A6: A9 68     LDA #< ram_0568
C - - - - - 0x0010B8 00:90A8: 85 94     STA ram_0094
C - - - - - 0x0010BA 00:90AA: A9 05     LDA #> ram_0568
C - - - - - 0x0010BC 00:90AC: 85 95     STA ram_0095
loc_90AE_loop:
C D 0 - - - 0x0010BE 00:90AE: A6 25     LDX ram_for_5115
C - - - - - 0x0010C0 00:90B0: 86 ED     STX ram_00ED
C - - - - - 0x0010C2 00:90B2: A0 00     LDY #$00
C - - - - - 0x0010C4 00:90B4: B1 4D     LDA (ram_004D),Y
C - - - - - 0x0010C6 00:90B6: A8        TAY
C - - - - - 0x0010C7 00:90B7: A2 09     LDX #con_prg_bank + $09
; в банке 10 анимации 00-6C, в банке 11 анимации 6D-CB
C - - - - - 0x0010C9 00:90B9: C9 6D     CMP #$6D
C - - - - - 0x0010CB 00:90BB: 90 05     BCC bra_90C2
C - - - - - 0x0010CD 00:90BD: 38        SEC
C - - - - - 0x0010CE 00:90BE: E9 6D     SBC #$6D
C - - - - - 0x0010D0 00:90C0: A8        TAY
C - - - - - 0x0010D1 00:90C1: E8        INX   ; con_prg_bank + $0A
bra_90C2:
C - - - - - 0x0010D2 00:90C2: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x0010D5 00:90C5: 98        TYA
C - - - - - 0x0010D6 00:90C6: 0A        ASL
C - - - - - 0x0010D7 00:90C7: A8        TAY
C - - - - - 0x0010D8 00:90C8: A9 00     LDA #$00
C - - - - - 0x0010DA 00:90CA: 69 00     ADC #$00
C - - - - - 0x0010DC 00:90CC: AA        TAX
C - - - - - 0x0010DD 00:90CD: 98        TYA
C - - - - - 0x0010DE 00:90CE: 18        CLC
; поинтер на банк 10 и 11 изменять нельзя
C - - - - - 0x0010DF 00:90CF: 69 00     ADC #< $A000
C - - - - - 0x0010E1 00:90D1: 85 92     STA ram_0092
C - - - - - 0x0010E3 00:90D3: 8A        TXA
C - - - - - 0x0010E4 00:90D4: 69 A0     ADC #> $A000
C - - - - - 0x0010E6 00:90D6: 85 93     STA ram_0093
C - - - - - 0x0010E8 00:90D8: A0 00     LDY #$00
C - - - - - 0x0010EA 00:90DA: B1 92     LDA (ram_0092),Y
C - - - - - 0x0010EC 00:90DC: AA        TAX
C - - - - - 0x0010ED 00:90DD: C8        INY
C - - - - - 0x0010EE 00:90DE: B1 92     LDA (ram_0092),Y
C - - - - - 0x0010F0 00:90E0: 85 93     STA ram_0093
C - - - - - 0x0010F2 00:90E2: 86 92     STX ram_0092
C - - - - - 0x0010F4 00:90E4: A0 00     LDY #$00
bra_90E6_loop:
C - - - - - 0x0010F6 00:90E6: B9 8B 97  LDA tbl_978B,Y
C - - - - - 0x0010F9 00:90E9: 91 94     STA (ram_0094),Y
C - - - - - 0x0010FB 00:90EB: C8        INY
C - - - - - 0x0010FC 00:90EC: C0 20     CPY #$20
C - - - - - 0x0010FE 00:90EE: D0 F6     BNE bra_90E6_loop
; bzk optimize что это за херня с номером банка
; bzk bug?
C - - - - - 0x001100 00:90F0: A5 25     LDA ram_for_5115
C - - - - - 0x001102 00:90F2: 38        SEC
C - - - - - 0x001103 00:90F3: E9 09     SBC #$09
C - - - - - 0x001105 00:90F5: A0 00     LDY #$00
C - - - - - 0x001107 00:90F7: 11 94     ORA (ram_0094),Y ; 0568 0588 05A8 
C - - - - - 0x001109 00:90F9: 91 94     STA (ram_0094),Y ; 0568 0588 05A8 
C - - - - - 0x00110B 00:90FB: A0 00     LDY #$00
C - - - - - 0x00110D 00:90FD: B1 92     LDA (ram_0092),Y
C - - - - - 0x00110F 00:90FF: 85 49     STA ram_0049
C - - - - - 0x001111 00:9101: E6 92     INC ram_0092
C - - - - - 0x001113 00:9103: D0 02     BNE bra_9107
C - - - - - 0x001115 00:9105: E6 93     INC ram_0093
bra_9107:
C - - - - - 0x001117 00:9107: A0 02     LDY #$02
C - - - - - 0x001119 00:9109: A5 92     LDA ram_0092
C - - - - - 0x00111B 00:910B: 91 94     STA (ram_0094),Y
C - - - - - 0x00111D 00:910D: C8        INY
C - - - - - 0x00111E 00:910E: A5 93     LDA ram_0093
C - - - - - 0x001120 00:9110: 91 94     STA (ram_0094),Y
C - - - - - 0x001122 00:9112: A6 ED     LDX ram_00ED
C - - - - - 0x001124 00:9114: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x001127 00:9117: E6 4D     INC ram_004D
C - - - - - 0x001129 00:9119: D0 02     BNE bra_911D_not_overflow
- - - - - - 0x00112B 00:911B: E6 4E     INC ram_004E
bra_911D_not_overflow:
C - - - - - 0x00112D 00:911D: A5 94     LDA ram_0094
C - - - - - 0x00112F 00:911F: 18        CLC
C - - - - - 0x001130 00:9120: 69 20     ADC #< $0020
C - - - - - 0x001132 00:9122: 85 94     STA ram_0094
C - - - - - 0x001134 00:9124: A5 95     LDA ram_0095
C - - - - - 0x001136 00:9126: 69 00     ADC #> $0020
C - - - - - 0x001138 00:9128: 85 95     STA ram_0095
C - - - - - 0x00113A 00:912A: C6 EC     DEC ram_00EC
C - - - - - 0x00113C 00:912C: F0 03     BEQ bra_9131
C - - - - - 0x00113E 00:912E: 4C AE 90  JMP loc_90AE_loop
bra_9131:
C - - - - - 0x001141 00:9131: A2 11     LDX #$11
C - - - - - 0x001143 00:9133: A9 47     LDA #< (ofs_9148 - $01)
C - - - - - 0x001145 00:9135: 95 00     STA ram_0000,X
C - - - - - 0x001147 00:9137: A9 91     LDA #> (ofs_9148 - $01)
C - - - - - 0x001149 00:9139: 95 01     STA ram_0001,X
C - - - - - 0x00114B 00:913B: A0 C8     LDY #$C8 - $02
C - - - - - 0x00114F 00:913F: 20 69 9F  JSR sub_9F69
C - - - - - 0x001152 00:9142: 60        RTS



loc_9143:
C D 0 - - - 0x001153 00:9143: A9 01     LDA #$01
C - - - - - 0x001155 00:9145: 20 A8 9F  JSR sub_9FA8_задержка_кадра
ofs_9148:
C - - - - - 0x001158 00:9148: A9 68     LDA #< ram_0568
C - - - - - 0x00115A 00:914A: 85 94     STA ram_0094
C - - - - - 0x00115C 00:914C: A9 05     LDA #> ram_0568
C - - - - - 0x00115E 00:914E: 85 95     STA ram_0095
C - - - - - 0x001160 00:9150: A9 04     LDA #$04
C - - - - - 0x001162 00:9152: 85 96     STA ram_0096
loc_9154:
C D 0 - - - 0x001164 00:9154: A0 00     LDY #$00
C - - - - - 0x001166 00:9156: B1 94     LDA (ram_0094),Y
C - - - - - 0x001168 00:9158: 30 03     BMI bra_915D
C - - - - - 0x00116A 00:915A: 4C C1 94  JMP loc_94C1
bra_915D:
C - - - - - 0x00116D 00:915D: AA        TAX
C - - - - - 0x00116E 00:915E: A0 04     LDY #$04
C - - - - - 0x001170 00:9160: 20 4A 97  JSR sub_974A
C - - - - - 0x001173 00:9163: A0 06     LDY #$06
C - - - - - 0x001175 00:9165: 20 4A 97  JSR sub_974A
C - - - - - 0x001178 00:9168: 8A        TXA
C - - - - - 0x001179 00:9169: 29 10     AND #$10
C - - - - - 0x00117B 00:916B: D0 39     BNE bra_91A6
C - - - - - 0x00117D 00:916D: 8A        TXA
C - - - - - 0x00117E 00:916E: 29 20     AND #$20
C - - - - - 0x001180 00:9170: D0 03     BNE bra_9175
C - - - - - 0x001182 00:9172: 4C F3 91  JMP loc_91F3
bra_9175:
C - - - - - 0x001185 00:9175: A2 04     LDX #$04
C - - - - - 0x001187 00:9177: A0 0A     LDY #$0A
C - - - - - 0x001189 00:9179: 20 5B 97  JSR sub_975B
C - - - - - 0x00118C 00:917C: A5 9A     LDA ram_009A
C - - - - - 0x00118E 00:917E: 85 E6     STA ram_00E6
C - - - - - 0x001190 00:9180: A0 04     LDY #$04
C - - - - - 0x001192 00:9182: 20 4A 97  JSR sub_974A
C - - - - - 0x001195 00:9185: A5 9A     LDA ram_009A
C - - - - - 0x001197 00:9187: 38        SEC
C - - - - - 0x001198 00:9188: E5 E6     SBC ram_00E6
C - - - - - 0x00119A 00:918A: 85 E6     STA ram_00E6
C - - - - - 0x00119C 00:918C: A2 06     LDX #$06
C - - - - - 0x00119E 00:918E: A0 0E     LDY #$0E
C - - - - - 0x0011A0 00:9190: 20 5B 97  JSR sub_975B
C - - - - - 0x0011A3 00:9193: A5 9C     LDA ram_009C
C - - - - - 0x0011A5 00:9195: 85 E8     STA ram_00E8
C - - - - - 0x0011A7 00:9197: A0 06     LDY #$06
C - - - - - 0x0011A9 00:9199: 20 4A 97  JSR sub_974A
C - - - - - 0x0011AC 00:919C: A5 9C     LDA ram_009C
C - - - - - 0x0011AE 00:919E: 38        SEC
C - - - - - 0x0011AF 00:919F: E5 E8     SBC ram_00E8
C - - - - - 0x0011B1 00:91A1: 85 E8     STA ram_00E8
C - - - - - 0x0011B3 00:91A3: 4C B4 91  JMP loc_91B4
bra_91A6:
C - - - - - 0x0011B6 00:91A6: A9 00     LDA #$00
C - - - - - 0x0011B8 00:91A8: 38        SEC
C - - - - - 0x0011B9 00:91A9: E5 46     SBC ram_0046
C - - - - - 0x0011BB 00:91AB: 85 E6     STA ram_00E6
C - - - - - 0x0011BD 00:91AD: A9 00     LDA #$00
C - - - - - 0x0011BF 00:91AF: 38        SEC
C - - - - - 0x0011C0 00:91B0: E5 47     SBC ram_0047
C - - - - - 0x0011C2 00:91B2: 85 E8     STA ram_00E8
loc_91B4:
C D 0 - - - 0x0011C4 00:91B4: A0 10     LDY #$10
C - - - - - 0x0011C6 00:91B6: B1 94     LDA (ram_0094),Y
C - - - - - 0x0011C8 00:91B8: AA        TAX
C - - - - - 0x0011C9 00:91B9: C8        INY
C - - - - - 0x0011CA 00:91BA: B1 94     LDA (ram_0094),Y
C - - - - - 0x0011CC 00:91BC: 4A        LSR
C - - - - - 0x0011CD 00:91BD: 4A        LSR
C - - - - - 0x0011CE 00:91BE: A8        TAY
bra_91BF_loop:
C - - - - - 0x0011CF 00:91BF: A5 E6     LDA ram_00E6
C - - - - - 0x0011D1 00:91C1: 18        CLC
C - - - - - 0x0011D2 00:91C2: 7D 68 04  ADC ram_copy_spr_Y,X
C - - - - - 0x0011D5 00:91C5: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x0011D8 00:91C8: 6A        ROR
C - - - - - 0x0011D9 00:91C9: 45 E6     EOR ram_00E6
C - - - - - 0x0011DB 00:91CB: 10 08     BPL bra_91D5
C - - - - - 0x0011DD 00:91CD: BD 6A 04  LDA ram_copy_spr_A,X
C - - - - - 0x0011E0 00:91D0: 49 08     EOR #$08
C - - - - - 0x0011E2 00:91D2: 9D 6A 04  STA ram_copy_spr_A,X
bra_91D5:
C - - - - - 0x0011E5 00:91D5: A5 E8     LDA ram_00E8
C - - - - - 0x0011E7 00:91D7: 18        CLC
C - - - - - 0x0011E8 00:91D8: 7D 6B 04  ADC ram_copy_spr_X,X
C - - - - - 0x0011EB 00:91DB: 9D 6B 04  STA ram_copy_spr_X,X
C - - - - - 0x0011EE 00:91DE: 6A        ROR
C - - - - - 0x0011EF 00:91DF: 45 E8     EOR ram_00E8
C - - - - - 0x0011F1 00:91E1: 10 08     BPL bra_91EB
C - - - - - 0x0011F3 00:91E3: BD 6A 04  LDA ram_copy_spr_A,X
C - - - - - 0x0011F6 00:91E6: 49 04     EOR #$04
C - - - - - 0x0011F8 00:91E8: 9D 6A 04  STA ram_copy_spr_A,X
bra_91EB:
C - - - - - 0x0011FB 00:91EB: 8A        TXA
C - - - - - 0x0011FC 00:91EC: 18        CLC
C - - - - - 0x0011FD 00:91ED: 69 04     ADC #$04
C - - - - - 0x0011FF 00:91EF: AA        TAX
C - - - - - 0x001200 00:91F0: 88        DEY
C - - - - - 0x001201 00:91F1: D0 CC     BNE bra_91BF_loop
loc_91F3:
C D 0 - - - 0x001203 00:91F3: A0 01     LDY #$01
C - - - - - 0x001205 00:91F5: B1 94     LDA (ram_0094),Y
C - - - - - 0x001207 00:91F7: 38        SEC
C - - - - - 0x001208 00:91F8: E9 01     SBC #$01
C - - - - - 0x00120A 00:91FA: 91 94     STA (ram_0094),Y
C - - - - - 0x00120C 00:91FC: F0 03     BEQ bra_9201
C - - - - - 0x00120E 00:91FE: 4C C1 94  JMP loc_94C1
bra_9201:
C - - - - - 0x001211 00:9201: A0 00     LDY #$00
C - - - - - 0x001213 00:9203: B1 94     LDA (ram_0094),Y
C - - - - - 0x001215 00:9205: 29 01     AND #$01
C - - - - - 0x001217 00:9207: 18        CLC
C - - - - - 0x001218 00:9208: 69 09     ADC #$09  ; con_prg_bank + $09
C - - - - - 0x00121A 00:920A: AA        TAX
C - - - - - 0x00121B 00:920B: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x00121E 00:920E: A0 02     LDY #$02
C - - - - - 0x001220 00:9210: B1 94     LDA (ram_0094),Y
C - - - - - 0x001222 00:9212: 85 92     STA ram_0092
C - - - - - 0x001224 00:9214: C8        INY
C - - - - - 0x001225 00:9215: B1 94     LDA (ram_0094),Y
C - - - - - 0x001227 00:9217: 85 93     STA ram_0093
C - - - - - 0x001229 00:9219: A0 00     LDY #$00
C - - - - - 0x00122B 00:921B: B1 94     LDA (ram_0094),Y
C - - - - - 0x00122D 00:921D: 29 02     AND #$02
C - - - - - 0x00122F 00:921F: F0 03     BEQ bra_9224
C - - - - - 0x001231 00:9221: 4C 59 94  JMP loc_9459
bra_9224:
loc_9224:
C D 0 - - - 0x001234 00:9224: A0 00     LDY #$00
C - - - - - 0x001236 00:9226: B1 92     LDA (ram_0092),Y
C - - - - - 0x001238 00:9228: 30 17     BMI bra_9241_80_FF
; 00-7F
C - - - - - 0x00123A 00:922A: C8        INY
C - - - - - 0x00123B 00:922B: 0A        ASL
C - - - - - 0x00123C 00:922C: 91 94     STA (ram_0094),Y
C - - - - - 0x00123E 00:922E: A0 02     LDY #$02
C - - - - - 0x001240 00:9230: A5 92     LDA ram_0092
C - - - - - 0x001242 00:9232: 18        CLC
C - - - - - 0x001243 00:9233: 69 01     ADC #< $0001
C - - - - - 0x001245 00:9235: 91 94     STA (ram_0094),Y
C - - - - - 0x001247 00:9237: C8        INY
C - - - - - 0x001248 00:9238: A5 93     LDA ram_0093
C - - - - - 0x00124A 00:923A: 69 00     ADC #> $0001
C - - - - - 0x00124C 00:923C: 91 94     STA (ram_0094),Y
C - - - - - 0x00124E 00:923E: 4C C1 94  JMP loc_94C1
bra_9241_80_FF:
C - - - - - 0x001251 00:9241: C9 A0     CMP #$A0
C - - - - - 0x001253 00:9243: B0 13     BCS bra_9258_A0_FF
; 80-9F
C - - - - - 0x001255 00:9245: 18        CLC
C - - - - - 0x001256 00:9246: 69 20     ADC #$20
C - - - - - 0x001258 00:9248: 85 E7     STA ram_00E7
C - - - - - 0x00125A 00:924A: A0 01     LDY #$01
C - - - - - 0x00125C 00:924C: B1 92     LDA (ram_0092),Y
C - - - - - 0x00125E 00:924E: 85 E6     STA ram_00E6
C - - - - - 0x001260 00:9250: 20 D8 94  JSR sub_94D8_чтение_байтов_спрайтов_анимации
C - - - - - 0x001263 00:9253: A9 02     LDA #$02
C - - - - - 0x001265 00:9255: 4C AE 94  JMP loc_94AE
bra_9258_A0_FF:
C - - - - - 0x001268 00:9258: C9 C0     CMP #$C0
C - - - - - 0x00126A 00:925A: B0 0C     BCS bra_9268_С0_FF
; A0-BF
C - - - - - 0x00126C 00:925C: AA        TAX
C - - - - - 0x00126D 00:925D: A0 01     LDY #$01
C - - - - - 0x00126F 00:925F: B1 92     LDA (ram_0092),Y
C - - - - - 0x001271 00:9261: 85 92     STA ram_0092
C - - - - - 0x001273 00:9263: 86 93     STX ram_0093
C - - - - - 0x001275 00:9265: 4C 24 92  JMP loc_9224
bra_9268_С0_FF:
C - - - - - 0x001278 00:9268: C9 E0     CMP #$E0
C - - - - - 0x00127A 00:926A: B0 34     BCS bra_92A0_E0_FF



; C0-DF
; bzk garbage? 9274 бесконечный цикл, код видимо мусорный
; в новых логах не выполнялось
- - - - - - 0x00127C 00:926C: 85 E7     STA ram_00E7
- - - - - - 0x00127E 00:926E: A0 13     LDY #$13
- - - - - - 0x001280 00:9270: B1 94     LDA (ram_0094),Y
- - - - - - 0x001282 00:9272: C9 03     CMP #$03
bra_9274_infinite_loop:
- - - - - - 0x001284 00:9274: B0 FE     BCS bra_9274_infinite_loop
- - - - - - 0x001286 00:9276: AA        TAX
- - - - - - 0x001287 00:9277: 18        CLC
- - - - - - 0x001288 00:9278: 69 01     ADC #$01
- - - - - - 0x00128A 00:927A: 91 94     STA (ram_0094),Y
- - - - - - 0x00128C 00:927C: 8A        TXA
- - - - - - 0x00128D 00:927D: 0A        ASL
- - - - - - 0x00128E 00:927E: 18        CLC
- - - - - - 0x00128F 00:927F: 69 18     ADC #$18
- - - - - - 0x001291 00:9281: A8        TAY
- - - - - - 0x001292 00:9282: A5 92     LDA ram_0092
- - - - - - 0x001294 00:9284: 18        CLC
- - - - - - 0x001295 00:9285: 69 02     ADC #< $0002
- - - - - - 0x001297 00:9287: 91 94     STA (ram_0094),Y
- - - - - - 0x001299 00:9289: C8        INY
- - - - - - 0x00129A 00:928A: A5 93     LDA ram_0093
- - - - - - 0x00129C 00:928C: 69 00     ADC #> $0002
- - - - - - 0x00129E 00:928E: 91 94     STA (ram_0094),Y
- - - - - - 0x0012A0 00:9290: A0 01     LDY #$01
- - - - - - 0x0012A2 00:9292: B1 92     LDA (ram_0092),Y
- - - - - - 0x0012A4 00:9294: 85 92     STA ram_0092
- - - - - - 0x0012A6 00:9296: A5 E7     LDA ram_00E7
- - - - - - 0x0012A8 00:9298: 38        SEC
- - - - - - 0x0012A9 00:9299: E9 20     SBC #$20
- - - - - - 0x0012AB 00:929B: 85 93     STA ram_0093
- - - - - - 0x0012AD 00:929D: 4C 24 92  JMP loc_9224



bra_92A0_E0_FF:
; количество повторов анимации, E0 + количество
; байт F0 указывает на конец списка анимаций для повтора
    ; старый коммент - таймер анимации, после таймера начинается следующая
    ; используется в катсцене где джаиро замахивается
C - - - - - 0x0012B0 00:92A0: C9 F0     CMP #$F0
C - - - - - 0x0012B2 00:92A2: B0 33     BCS bra_92D7_F0_и_выше
C - - - - - 0x0012B4 00:92A4: AA        TAX
C - - - - - 0x0012B5 00:92A5: A0 13     LDY #$13
C - - - - - 0x0012B7 00:92A7: B1 94     LDA (ram_0094),Y
C - - - - - 0x0012B9 00:92A9: C9 04     CMP #$04
; в новых логах условие BCS никогда не выполнялось
; возможно это проверка на баги от разработчиков
; бряк срабатывает когда цубаса замахивается в катсцене с кипером меоном
bra_92AB_infinite_loop:
C - - - - - 0x0012BB 00:92AB: B0 FE     BCS bra_92AB_infinite_loop
C - - - - - 0x0012BD 00:92AD: 18        CLC
C - - - - - 0x0012BE 00:92AE: 69 01     ADC #$01
C - - - - - 0x0012C0 00:92B0: 91 94     STA (ram_0094),Y
C - - - - - 0x0012C2 00:92B2: 18        CLC
C - - - - - 0x0012C3 00:92B3: 69 13     ADC #$13
C - - - - - 0x0012C5 00:92B5: A8        TAY
C - - - - - 0x0012C6 00:92B6: 8A        TXA
C - - - - - 0x0012C7 00:92B7: 38        SEC
C - - - - - 0x0012C8 00:92B8: E9 E0     SBC #$E0
C - - - - - 0x0012CA 00:92BA: 91 94     STA (ram_0094),Y
C - - - - - 0x0012CC 00:92BC: 98        TYA
C - - - - - 0x0012CD 00:92BD: 0A        ASL
C - - - - - 0x0012CE 00:92BE: 38        SEC
C - - - - - 0x0012CF 00:92BF: E9 10     SBC #$10
C - - - - - 0x0012D1 00:92C1: A8        TAY
C - - - - - 0x0012D2 00:92C2: A5 92     LDA ram_0092
C - - - - - 0x0012D4 00:92C4: 18        CLC
C - - - - - 0x0012D5 00:92C5: 69 01     ADC #< $0001
C - - - - - 0x0012D7 00:92C7: 85 92     STA ram_0092
C - - - - - 0x0012D9 00:92C9: 91 94     STA (ram_0094),Y
C - - - - - 0x0012DB 00:92CB: C8        INY
C - - - - - 0x0012DC 00:92CC: A5 93     LDA ram_0093
C - - - - - 0x0012DE 00:92CE: 69 00     ADC #> $0001
C - - - - - 0x0012E0 00:92D0: 85 93     STA ram_0093
C - - - - - 0x0012E2 00:92D2: 91 94     STA (ram_0094),Y
C - - - - - 0x0012E4 00:92D4: 4C 24 92  JMP loc_9224
bra_92D7_F0_и_выше:
C - - - - - 0x0012E7 00:92D7: 38        SEC
C - - - - - 0x0012E8 00:92D8: E9 F0     SBC #$F0
C - - - - - 0x0012EA 00:92DA: 0A        ASL
C - - - - - 0x0012EB 00:92DB: AA        TAX
C - - - - - 0x0012EC 00:92DC: BD E6 92  LDA tbl_92E5_управляющие_байты_анимации + $01,X
C - - - - - 0x0012EF 00:92DF: 48        PHA
C - - - - - 0x0012F0 00:92E0: BD E5 92  LDA tbl_92E5_управляющие_байты_анимации,X
C - - - - - 0x0012F3 00:92E3: 48        PHA
C - - - - - 0x0012F4 00:92E4: 60        RTS

tbl_92E5_управляющие_байты_анимации:
- D 0 - - - 0x0012F5 00:92E5: 04 93     .word ofs_003_9305_F0_повтор_анимации - $01
- D 0 - - - 0x0012F7 00:92E7: 38 93     .word ofs_003_9339_F1_координаты_Y_X - $01
- - - - - - 0x0012F9 00:92E9: 4F 93     .word ofs_003_9350_F2 - $01
- - - - - - 0x0012FB 00:92EB: 5D 93     .word ofs_003_935E_F3 - $01
- - - - - - 0x0012FD 00:92ED: 6B 93     .word ofs_003_936C_F4 - $01
- D 0 - - - 0x0012FF 00:92EF: 8C 93     .word ofs_003_938D_F5 - $01
- D 0 - - - 0x001301 00:92F1: 99 93     .word ofs_003_939A_F6 - $01
- D 0 - - - 0x001303 00:92F3: A6 93     .word ofs_003_93A7_F7_физика - $01
- - - - - - 0x001305 00:92F5: 29 94     .word ofs_003_942A_F8_запись_палитры - $01
- D 0 - - - 0x001307 00:92F7: 34 94     .word ofs_003_9435_F9 - $01
- D 0 - - - 0x001309 00:92F9: 41 94     .word ofs_003_9442_FA_разговор - $01
- - - - - - 0x00130B 00:92FB: 8E 94     .word $0000
- - - - - - 0x00130D 00:92FD: 8E 94     .word $0000
- - - - - - 0x00130F 00:92FF: 8E 94     .word $0000
- - - - - - 0x001311 00:9301: 91 94     .word ofs_003_9492_FE - $01
- D 0 - - - 0x001313 00:9303: BB 94     .word ofs_003_94BC_FF - $01



ofs_003_9305_F0_повтор_анимации:
; количество повторов указывается байтом E0 + количество
; после чего код запоминает начало повтора, далее идет список анимации
; в конце байт F0, указывающий конец списка анимаций для повтора
; может быть больше одного F0
C - - - - - 0x001315 00:9305: A0 13     LDY #$13
C - - - - - 0x001317 00:9307: B1 94     LDA (ram_0094),Y ; 057B 059B 05BB 
; в новых логах условие BEQ никогда не выполнялось
; возможно это проверка на баги от разработчиков
bra_9309_infinite_loop:
C - - - - - 0x001319 00:9309: F0 FE     BEQ bra_9309_infinite_loop
C - - - - - 0x00131B 00:930B: AA        TAX
C - - - - - 0x00131C 00:930C: 18        CLC
C - - - - - 0x00131D 00:930D: 69 13     ADC #$13
C - - - - - 0x00131F 00:930F: A8        TAY
C - - - - - 0x001320 00:9310: B1 94     LDA (ram_0094),Y
C - - - - - 0x001322 00:9312: 38        SEC
C - - - - - 0x001323 00:9313: E9 01     SBC #$01
C - - - - - 0x001325 00:9315: 91 94     STA (ram_0094),Y
C - - - - - 0x001327 00:9317: F0 12     BEQ bra_932B
C - - - - - 0x001329 00:9319: 8A        TXA
C - - - - - 0x00132A 00:931A: 0A        ASL
C - - - - - 0x00132B 00:931B: 18        CLC
C - - - - - 0x00132C 00:931C: 69 16     ADC #$16
C - - - - - 0x00132E 00:931E: A8        TAY
C - - - - - 0x00132F 00:931F: B1 94     LDA (ram_0094),Y
C - - - - - 0x001331 00:9321: 85 92     STA ram_0092
C - - - - - 0x001333 00:9323: C8        INY
C - - - - - 0x001334 00:9324: B1 94     LDA (ram_0094),Y
C - - - - - 0x001336 00:9326: 85 93     STA ram_0093
C - - - - - 0x001338 00:9328: 4C 24 92  JMP loc_9224
bra_932B:
C - - - - - 0x00133B 00:932B: A0 13     LDY #$13
C - - - - - 0x00133D 00:932D: B1 94     LDA (ram_0094),Y
C - - - - - 0x00133F 00:932F: 38        SEC
C - - - - - 0x001340 00:9330: E9 01     SBC #$01
C - - - - - 0x001342 00:9332: 91 94     STA (ram_0094),Y
C - - - - - 0x001344 00:9334: A9 01     LDA #$01
C - - - - - 0x001346 00:9336: 4C AE 94  JMP loc_94AE



ofs_003_9339_F1_координаты_Y_X:
C - - - - - 0x001349 00:9339: A0 01     LDY #$01
C - - - - - 0x00134B 00:933B: B1 92     LDA (ram_0092),Y
C - - - - - 0x00134D 00:933D: A0 04     LDY #$04
C - - - - - 0x00134F 00:933F: 20 35 97  JSR sub_9735
C - - - - - 0x001352 00:9342: A0 02     LDY #$02
C - - - - - 0x001354 00:9344: B1 92     LDA (ram_0092),Y
C - - - - - 0x001356 00:9346: A0 06     LDY #$06
C - - - - - 0x001358 00:9348: 20 35 97  JSR sub_9735
C - - - - - 0x00135B 00:934B: A9 03     LDA #$03
C - - - - - 0x00135D 00:934D: 4C AE 94  JMP loc_94AE



ofs_003_9350_F2:
- - - - - - 0x001360 00:9350: A0 01     LDY #$01
- - - - - - 0x001362 00:9352: B1 92     LDA (ram_0092),Y
- - - - - - 0x001364 00:9354: A0 04     LDY #$04
- - - - - - 0x001366 00:9356: 20 35 97  JSR sub_9735
- - - - - - 0x001369 00:9359: A9 02     LDA #$02
- - - - - - 0x00136B 00:935B: 4C AE 94  JMP loc_94AE



ofs_003_935E_F3:
- - - - - - 0x00136E 00:935E: A0 01     LDY #$01
- - - - - - 0x001370 00:9360: B1 92     LDA (ram_0092),Y
- - - - - - 0x001372 00:9362: A0 06     LDY #$06
- - - - - - 0x001374 00:9364: 20 35 97  JSR sub_9735
- - - - - - 0x001377 00:9367: A9 02     LDA #$02
- - - - - - 0x001379 00:9369: 4C AE 94  JMP loc_94AE



ofs_003_936C_F4:
- - - - - - 0x00137C 00:936C: A0 01     LDY #$01
- - - - - - 0x00137E 00:936E: B1 92     LDA (ram_0092),Y
- - - - - - 0x001380 00:9370: 91 94     STA (ram_0094),Y
- - - - - - 0x001382 00:9372: A5 92     LDA ram_0092
- - - - - - 0x001384 00:9374: 18        CLC
- - - - - - 0x001385 00:9375: 69 02     ADC #< $0002
- - - - - - 0x001387 00:9377: 85 92     STA ram_0092
- - - - - - 0x001389 00:9379: A5 93     LDA ram_0093
- - - - - - 0x00138B 00:937B: 69 00     ADC #> $0002
- - - - - - 0x00138D 00:937D: 85 93     STA ram_0093
- - - - - - 0x00138F 00:937F: A0 02     LDY #$02
- - - - - - 0x001391 00:9381: A5 92     LDA ram_0092
- - - - - - 0x001393 00:9383: 91 94     STA (ram_0094),Y
- - - - - - 0x001395 00:9385: C8        INY
- - - - - - 0x001396 00:9386: A5 93     LDA ram_0093
- - - - - - 0x001398 00:9388: 91 94     STA (ram_0094),Y
- - - - - - 0x00139A 00:938A: 4C C1 94  JMP loc_94C1



ofs_003_938D_F5:
C - - - - - 0x00139D 00:938D: A0 00     LDY #$00
C - - - - - 0x00139F 00:938F: B1 94     LDA (ram_0094),Y
C - - - - - 0x0013A1 00:9391: 09 40     ORA #$40
C - - - - - 0x0013A3 00:9393: 91 94     STA (ram_0094),Y
C - - - - - 0x0013A5 00:9395: A9 01     LDA #$01
C - - - - - 0x0013A7 00:9397: 4C AE 94  JMP loc_94AE



ofs_003_939A_F6:
C - - - - - 0x0013AA 00:939A: A0 00     LDY #$00
C - - - - - 0x0013AC 00:939C: B1 94     LDA (ram_0094),Y
C - - - - - 0x0013AE 00:939E: 29 BF     AND #$40 ^ $FF
C - - - - - 0x0013B0 00:93A0: 91 94     STA (ram_0094),Y
C - - - - - 0x0013B2 00:93A2: A9 01     LDA #$01
C - - - - - 0x0013B4 00:93A4: 4C AE 94  JMP loc_94AE



ofs_003_93A7_F7_физика:
; 1й байт = скорость + угол + направление (00/80), 2й = разгон X, 3й = разгон Y
C - - - - - 0x0013B7 00:93A7: A0 01     LDY #$01
C - - - - - 0x0013B9 00:93A9: B1 92     LDA (ram_0092),Y
C - - - - - 0x0013BB 00:93AB: 4A        LSR
C - - - - - 0x0013BC 00:93AC: 4A        LSR
C - - - - - 0x0013BD 00:93AD: 4A        LSR
C - - - - - 0x0013BE 00:93AE: 4A        LSR
C - - - - - 0x0013BF 00:93AF: 4A        LSR
C - - - - - 0x0013C0 00:93B0: A0 09     LDY #$09
C - - - - - 0x0013C2 00:93B2: 91 94     STA (ram_0094),Y
C - - - - - 0x0013C4 00:93B4: 29 04     AND #$04
C - - - - - 0x0013C6 00:93B6: D0 0F     BNE bra_93C7
C - - - - - 0x0013C8 00:93B8: 6A        ROR
C - - - - - 0x0013C9 00:93B9: 88        DEY
C - - - - - 0x0013CA 00:93BA: 91 94     STA (ram_0094),Y
C - - - - - 0x0013CC 00:93BC: A0 02     LDY #$02
C - - - - - 0x0013CE 00:93BE: B1 92     LDA (ram_0092),Y
C - - - - - 0x0013D0 00:93C0: A0 0A     LDY #$0A
C - - - - - 0x0013D2 00:93C2: 91 94     STA (ram_0094),Y
C - - - - - 0x0013D4 00:93C4: 4C DE 93  JMP loc_93DE
bra_93C7:
C - - - - - 0x0013D7 00:93C7: B1 94     LDA (ram_0094),Y
C - - - - - 0x0013D9 00:93C9: 09 F8     ORA #$F8
C - - - - - 0x0013DB 00:93CB: 91 94     STA (ram_0094),Y
C - - - - - 0x0013DD 00:93CD: A9 00     LDA #$00
C - - - - - 0x0013DF 00:93CF: 6A        ROR
C - - - - - 0x0013E0 00:93D0: 88        DEY
C - - - - - 0x0013E1 00:93D1: 91 94     STA (ram_0094),Y
C - - - - - 0x0013E3 00:93D3: A0 02     LDY #$02
C - - - - - 0x0013E5 00:93D5: A9 00     LDA #$00
C - - - - - 0x0013E7 00:93D7: 38        SEC
C - - - - - 0x0013E8 00:93D8: F1 92     SBC (ram_0092),Y
C - - - - - 0x0013EA 00:93DA: A0 0A     LDY #$0A
C - - - - - 0x0013EC 00:93DC: 91 94     STA (ram_0094),Y
loc_93DE:
C D 0 - - - 0x0013EE 00:93DE: A0 01     LDY #$01
C - - - - - 0x0013F0 00:93E0: B1 92     LDA (ram_0092),Y
C - - - - - 0x0013F2 00:93E2: 29 0F     AND #$0F
C - - - - - 0x0013F4 00:93E4: 4A        LSR
C - - - - - 0x0013F5 00:93E5: A0 0D     LDY #$0D
C - - - - - 0x0013F7 00:93E7: 91 94     STA (ram_0094),Y
C - - - - - 0x0013F9 00:93E9: 29 04     AND #$04
C - - - - - 0x0013FB 00:93EB: D0 0F     BNE bra_93FC
C - - - - - 0x0013FD 00:93ED: 6A        ROR
C - - - - - 0x0013FE 00:93EE: 88        DEY
C - - - - - 0x0013FF 00:93EF: 91 94     STA (ram_0094),Y
C - - - - - 0x001401 00:93F1: A0 03     LDY #$03
C - - - - - 0x001403 00:93F3: B1 92     LDA (ram_0092),Y
C - - - - - 0x001405 00:93F5: A0 0E     LDY #$0E
C - - - - - 0x001407 00:93F7: 91 94     STA (ram_0094),Y
C - - - - - 0x001409 00:93F9: 4C 13 94  JMP loc_9413
bra_93FC:
C - - - - - 0x00140C 00:93FC: B1 94     LDA (ram_0094),Y
C - - - - - 0x00140E 00:93FE: 09 F8     ORA #$F8
C - - - - - 0x001410 00:9400: 91 94     STA (ram_0094),Y
C - - - - - 0x001412 00:9402: A9 00     LDA #$00
C - - - - - 0x001414 00:9404: 6A        ROR
C - - - - - 0x001415 00:9405: 88        DEY
C - - - - - 0x001416 00:9406: 91 94     STA (ram_0094),Y
C - - - - - 0x001418 00:9408: A0 03     LDY #$03
C - - - - - 0x00141A 00:940A: A9 00     LDA #$00
C - - - - - 0x00141C 00:940C: 38        SEC
C - - - - - 0x00141D 00:940D: F1 92     SBC (ram_0092),Y
C - - - - - 0x00141F 00:940F: A0 0E     LDY #$0E
C - - - - - 0x001421 00:9411: 91 94     STA (ram_0094),Y
loc_9413:
C D 0 - - - 0x001423 00:9413: A9 00     LDA #$00
C - - - - - 0x001425 00:9415: A0 0B     LDY #$0B
C - - - - - 0x001427 00:9417: 91 94     STA (ram_0094),Y
C - - - - - 0x001429 00:9419: A0 0F     LDY #$0F
C - - - - - 0x00142B 00:941B: 91 94     STA (ram_0094),Y
C - - - - - 0x00142D 00:941D: A0 00     LDY #$00
C - - - - - 0x00142F 00:941F: B1 94     LDA (ram_0094),Y
C - - - - - 0x001431 00:9421: 09 20     ORA #$20
C - - - - - 0x001433 00:9423: 91 94     STA (ram_0094),Y
C - - - - - 0x001435 00:9425: A9 04     LDA #$04
C - - - - - 0x001437 00:9427: 4C AE 94  JMP loc_94AE



ofs_003_942A_F8_запись_палитры:
- - - - - - 0x00143A 00:942A: A0 01     LDY #$01
- - - - - - 0x00143C 00:942C: B1 92     LDA (ram_0092),Y
- - - - - - 0x00143E 00:942E: 85 49     STA ram_0049
- - - - - - 0x001440 00:9430: A9 02     LDA #$02
- - - - - - 0x001442 00:9432: 20 AE 94  JSR sub_94AE
ofs_003_9435_F9:
C - - - - - 0x001445 00:9435: A0 00     LDY #$00
C - - - - - 0x001447 00:9437: B1 94     LDA (ram_0094),Y
C - - - - - 0x001449 00:9439: 09 10     ORA #$10
C - - - - - 0x00144B 00:943B: 91 94     STA (ram_0094),Y
C - - - - - 0x00144D 00:943D: A9 01     LDA #$01
C - - - - - 0x00144F 00:943F: 4C AE 94  JMP loc_94AE



ofs_003_9442_FA_разговор:
; 2 развилки для анимации персоранажа, если тот молчит/говорит
C - - - - - 0x001452 00:9442: A0 00     LDY #$00
C - - - - - 0x001454 00:9444: B1 94     LDA (ram_0094),Y
C - - - - - 0x001456 00:9446: 09 02     ORA #$02
C - - - - - 0x001458 00:9448: 91 94     STA (ram_0094),Y
C - - - - - 0x00145A 00:944A: A9 C0     LDA #$C0
C - - - - - 0x00145C 00:944C: 85 99     STA ram_0099
C - - - - - 0x00145E 00:944E: A0 02     LDY #$02
C - - - - - 0x001460 00:9450: A5 92     LDA ram_0092
C - - - - - 0x001462 00:9452: 91 94     STA (ram_0094),Y
C - - - - - 0x001464 00:9454: C8        INY
C - - - - - 0x001465 00:9455: A5 93     LDA ram_0093
C - - - - - 0x001467 00:9457: 91 94     STA (ram_0094),Y
loc_9459:
C D 0 - - - 0x001469 00:9459: 24 99     BIT ram_0099
C - - - - - 0x00146B 00:945B: 50 1D     BVC bra_947A
C - - - - - 0x00146D 00:945D: A5 99     LDA ram_0099
C - - - - - 0x00146F 00:945F: 29 01     AND #$01
C - - - - - 0x001471 00:9461: 38        SEC
C - - - - - 0x001472 00:9462: 2A        ROL
C - - - - - 0x001473 00:9463: A8        TAY
C - - - - - 0x001474 00:9464: B1 92     LDA (ram_0092),Y
C - - - - - 0x001476 00:9466: 85 E6     STA ram_00E6
C - - - - - 0x001478 00:9468: C8        INY
C - - - - - 0x001479 00:9469: B1 92     LDA (ram_0092),Y
C - - - - - 0x00147B 00:946B: 85 E7     STA ram_00E7
C - - - - - 0x00147D 00:946D: 20 D8 94  JSR sub_94D8_чтение_байтов_спрайтов_анимации
C - - - - - 0x001480 00:9470: A5 99     LDA ram_0099
C - - - - - 0x001482 00:9472: C9 FE     CMP #$FE
C - - - - - 0x001484 00:9474: F0 0C     BEQ bra_9482_FE
C - - - - - 0x001486 00:9476: 29 BF     AND #$40 ^ $FF
C - - - - - 0x001488 00:9478: 85 99     STA ram_0099
bra_947A:
C - - - - - 0x00148A 00:947A: A9 01     LDA #$01
C - - - - - 0x00148C 00:947C: A8        TAY
C - - - - - 0x00148D 00:947D: 91 94     STA (ram_0094),Y
C - - - - - 0x00148F 00:947F: 4C C1 94  JMP loc_94C1
bra_9482_FE:
; в новых логах выполнялось
- - - - - - 0x001492 00:9482: A0 00     LDY #$00
- - - - - - 0x001494 00:9484: B1 94     LDA (ram_0094),Y
- - - - - - 0x001496 00:9486: 29 FD     AND #$FD
- - - - - - 0x001498 00:9488: 91 94     STA (ram_0094),Y
- - - - - - 0x00149A 00:948A: A9 05     LDA #$05
- - - - - - 0x00149C 00:948C: 4C AE 94  JMP loc_94AE



ofs_003_9492_FE:
; bzk garbage? в новых логах не выполнялось
- - - - - - 0x0014A2 00:9492: A0 13     LDY #$13
- - - - - - 0x0014A4 00:9494: B1 94     LDA (ram_0094),Y
; bzk warning, бесконечный цикл
; возможно это проверка на баги от разработчиков
bra_9496_infinite_loop:
- - - - - - 0x0014A6 00:9496: F0 FE     BEQ bra_9496_infinite_loop
- - - - - - 0x0014A8 00:9498: 38        SEC
- - - - - - 0x0014A9 00:9499: E9 01     SBC #$01
- - - - - - 0x0014AB 00:949B: 91 94     STA (ram_0094),Y
- - - - - - 0x0014AD 00:949D: 0A        ASL
- - - - - - 0x0014AE 00:949E: 18        CLC
- - - - - - 0x0014AF 00:949F: 69 18     ADC #$18
- - - - - - 0x0014B1 00:94A1: A8        TAY
- - - - - - 0x0014B2 00:94A2: B1 94     LDA (ram_0094),Y
- - - - - - 0x0014B4 00:94A4: 85 92     STA ram_0092
- - - - - - 0x0014B6 00:94A6: C8        INY
- - - - - - 0x0014B7 00:94A7: B1 94     LDA (ram_0094),Y
- - - - - - 0x0014B9 00:94A9: 85 93     STA ram_0093
- - - - - - 0x0014BB 00:94AB: 4C 24 92  JMP loc_9224



loc_94AE:
sub_94AE:
C D 0 - - - 0x0014BE 00:94AE: 18        CLC
C - - - - - 0x0014BF 00:94AF: 65 92     ADC ram_0092
C - - - - - 0x0014C1 00:94B1: 85 92     STA ram_0092
C - - - - - 0x0014C3 00:94B3: A5 93     LDA ram_0093
C - - - - - 0x0014C5 00:94B5: 69 00     ADC #$00
C - - - - - 0x0014C7 00:94B7: 85 93     STA ram_0093
C - - - - - 0x0014C9 00:94B9: 4C 24 92  JMP loc_9224



ofs_003_94BC_FF:
C - - - - - 0x0014CC 00:94BC: A9 00     LDA #$00
C - - - - - 0x0014CE 00:94BE: A8        TAY
C - - - - - 0x0014CF 00:94BF: 91 94     STA (ram_0094),Y
loc_94C1:
C D 0 - - - 0x0014D1 00:94C1: A5 94     LDA ram_0094
C - - - - - 0x0014D3 00:94C3: 18        CLC
C - - - - - 0x0014D4 00:94C4: 69 20     ADC #< $0020
C - - - - - 0x0014D6 00:94C6: 85 94     STA ram_0094
C - - - - - 0x0014D8 00:94C8: A5 95     LDA ram_0095
C - - - - - 0x0014DA 00:94CA: 69 00     ADC #> $0020
C - - - - - 0x0014DC 00:94CC: 85 95     STA ram_0095
C - - - - - 0x0014DE 00:94CE: C6 96     DEC ram_0096
C - - - - - 0x0014E0 00:94D0: F0 03     BEQ bra_94D5
C - - - - - 0x0014E2 00:94D2: 4C 54 91  JMP loc_9154
bra_94D5:
C - - - - - 0x0014E5 00:94D5: 4C 43 91  JMP loc_9143



sub_94D8_чтение_байтов_спрайтов_анимации:
C - - - - - 0x0014E8 00:94D8: A0 00     LDY #$00
C - - - - - 0x0014EA 00:94DA: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0014EE 00:94DE: 85 9E     STA ram_for_5124
C - - - - - 0x0014F0 00:94E0: C8        INY
C - - - - - 0x0014F1 00:94E1: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0014F3 00:94E3: 85 9F     STA ram_for_5125
                                        INY
C - - - - - 0x0014F7 00:94E7: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0014F9 00:94E9: 85 A0     STA ram_for_5126
C - - - - - 0x0014FB 00:94EB: C8        INY
C - - - - - 0x0014FC 00:94EC: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0014FE 00:94EE: 85 A1     STA ram_for_5127
C - - - - - 0x001500 00:94F0: A5 E6     LDA ram_00E6
C - - - - - 0x001502 00:94F2: 18        CLC
C - - - - - 0x001503 00:94F3: 69 04     ADC #< $0004
C - - - - - 0x001505 00:94F5: 85 E6     STA ram_00E6
C - - - - - 0x001507 00:94F7: A5 E7     LDA ram_00E7
C - - - - - 0x001509 00:94F9: 69 00     ADC #> $0004
C - - - - - 0x00150B 00:94FB: 85 E7     STA ram_00E7
C - - - - - 0x00150D 00:94FD: A0 00     LDY #$00
C - - - - - 0x00150F 00:94FF: B1 94     LDA (ram_0094),Y
C - - - - - 0x001511 00:9501: A0 10     LDY #$10
C - - - - - 0x001513 00:9503: 29 08     AND #$08
C - - - - - 0x001515 00:9505: D0 04     BNE bra_950B
C - - - - - 0x001517 00:9507: A5 97     LDA ram_0097
C - - - - - 0x001519 00:9509: 91 94     STA (ram_0094),Y
bra_950B:
C - - - - - 0x00151B 00:950B: B1 94     LDA (ram_0094),Y
C - - - - - 0x00151D 00:950D: 85 98     STA ram_0098
C - - - - - 0x00151F 00:950F: A9 00     LDA #$00
C - - - - - 0x001521 00:9511: 85 E8     STA ram_00E8
C - - - - - 0x001523 00:9513: 85 E9     STA ram_00E9
loc_9515_продолжить_чтение_байтов_спрайтов_анимации:
C D 0 - - - 0x001525 00:9515: A0 00     LDY #$00
C - - - - - 0x001527 00:9517: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001529 00:9519: 30 6E     BMI bra_9589_80_FF
; 00-7F
C - - - - - 0x00152B 00:951B: A6 98     LDX ram_0098
C - - - - - 0x00152D 00:951D: 29 3C     AND #$3C
C - - - - - 0x00152F 00:951F: 0A        ASL
C - - - - - 0x001530 00:9520: 0A        ASL
C - - - - - 0x001531 00:9521: 30 10     BMI bra_9533
C - - - - - 0x001533 00:9523: 4A        LSR
C - - - - - 0x001534 00:9524: 18        CLC
C - - - - - 0x001535 00:9525: 65 9A     ADC ram_009A
C - - - - - 0x001537 00:9527: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x00153A 00:952A: 85 EA     STA ram_00EA
C - - - - - 0x00153C 00:952C: A9 00     LDA #$00
C - - - - - 0x00153E 00:952E: 65 9B     ADC ram_009B
C - - - - - 0x001540 00:9530: 4C 41 95  JMP loc_9541
bra_9533:
C - - - - - 0x001543 00:9533: 38        SEC
C - - - - - 0x001544 00:9534: 6A        ROR
C - - - - - 0x001545 00:9535: 18        CLC
C - - - - - 0x001546 00:9536: 65 9A     ADC ram_009A
C - - - - - 0x001548 00:9538: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x00154B 00:953B: 85 EA     STA ram_00EA
C - - - - - 0x00154D 00:953D: A9 00     LDA #$00
C - - - - - 0x00154F 00:953F: E5 9B     SBC ram_009B
loc_9541:
C D 0 - - - 0x001551 00:9541: 29 01     AND #$01
C - - - - - 0x001553 00:9543: 85 EB     STA ram_00EB
C - - - - - 0x001555 00:9545: 0A        ASL
C - - - - - 0x001556 00:9546: 85 EC     STA ram_00EC
C - - - - - 0x001558 00:9548: A5 E8     LDA ram_00E8
C - - - - - 0x00155A 00:954A: 9D 6B 04  STA ram_copy_spr_X,X
C - - - - - 0x00155D 00:954D: A5 E9     LDA ram_00E9
C - - - - - 0x00155F 00:954F: 29 01     AND #$01
C - - - - - 0x001561 00:9551: 05 EC     ORA ram_00EC
C - - - - - 0x001563 00:9553: 0A        ASL
C - - - - - 0x001564 00:9554: 0A        ASL
C - - - - - 0x001565 00:9555: 85 EC     STA ram_00EC
C - - - - - 0x001567 00:9557: A0 00     LDY #$00
C - - - - - 0x001569 00:9559: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x00156B 00:955B: 51 94     EOR (ram_0094),Y
C - - - - - 0x00156D 00:955D: 29 40     AND #$40
C - - - - - 0x00156F 00:955F: 05 EC     ORA ram_00EC
C - - - - - 0x001571 00:9561: 85 EC     STA ram_00EC
C - - - - - 0x001573 00:9563: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001575 00:9565: 29 03     AND #$03
C - - - - - 0x001577 00:9567: 05 EC     ORA ram_00EC
C - - - - - 0x001579 00:9569: 9D 6A 04  STA ram_copy_spr_A,X
C - - - - - 0x00157C 00:956C: C8        INY
C - - - - - 0x00157D 00:956D: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x00157F 00:956F: 9D 69 04  STA ram_copy_spr_T,X
C - - - - - 0x001582 00:9572: A5 98     LDA ram_0098
C - - - - - 0x001584 00:9574: 18        CLC
C - - - - - 0x001585 00:9575: 69 04     ADC #$04
C - - - - - 0x001587 00:9577: 85 98     STA ram_0098
C - - - - - 0x001589 00:9579: A5 E6     LDA ram_00E6
C - - - - - 0x00158B 00:957B: 18        CLC
C - - - - - 0x00158C 00:957C: 69 02     ADC #< $0002
C - - - - - 0x00158E 00:957E: 85 E6     STA ram_00E6
C - - - - - 0x001590 00:9580: A5 E7     LDA ram_00E7
C - - - - - 0x001592 00:9582: 69 00     ADC #> $0002
C - - - - - 0x001594 00:9584: 85 E7     STA ram_00E7
C - - - - - 0x001596 00:9586: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации
bra_9589_80_FF:
C - - - - - 0x001599 00:9589: C9 A0     CMP #$A0
C - - - - - 0x00159B 00:958B: B0 22     BCS bra_95AF_A0_FF
; 80-9F
C - - - - - 0x00159D 00:958D: A2 00     LDX #$00
; умножение на 8, по сути умножение первых 4х битов
C - - - - - 0x00159F 00:958F: 0A        ASL
C - - - - - 0x0015A0 00:9590: 0A        ASL
C - - - - - 0x0015A1 00:9591: 0A        ASL
C - - - - - 0x0015A2 00:9592: 85 EA     STA ram_00EA
; 80+ будет если умножается байт 90-9F
C - - - - - 0x0015A4 00:9594: 10 01     BPL bra_9597
C - - - - - 0x0015A6 00:9596: CA        DEX ; FF
bra_9597:
C - - - - - 0x0015A7 00:9597: 86 EB     STX ram_00EB
C - - - - - 0x0015A9 00:9599: A5 9A     LDA ram_009A
C - - - - - 0x0015AB 00:959B: 18        CLC
C - - - - - 0x0015AC 00:959C: 65 EA     ADC ram_00EA
C - - - - - 0x0015AE 00:959E: 85 EA     STA ram_00EA
C - - - - - 0x0015B0 00:95A0: A5 9B     LDA ram_009B
C - - - - - 0x0015B2 00:95A2: 65 EB     ADC ram_00EB
C - - - - - 0x0015B4 00:95A4: 85 EB     STA ram_00EB
C - - - - - 0x0015B6 00:95A6: E6 E6     INC ram_00E6
C - - - - - 0x0015B8 00:95A8: D0 02     BNE bra_95AC
- - - - - - 0x0015BA 00:95AA: E6 E7     INC ram_00E7
bra_95AC:
C - - - - - 0x0015BC 00:95AC: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации
bra_95AF_A0_FF:
C - - - - - 0x0015BF 00:95AF: C9 C0     CMP #$C0
C - - - - - 0x0015C1 00:95B1: B0 32     BCS bra_95E5_C0_FF
; A0-BF
C - - - - - 0x0015C3 00:95B3: AA        TAX
C - - - - - 0x0015C4 00:95B4: A0 00     LDY #$00
C - - - - - 0x0015C6 00:95B6: B1 94     LDA (ram_0094),Y
C - - - - - 0x0015C8 00:95B8: 0A        ASL
C - - - - - 0x0015C9 00:95B9: 10 07     BPL bra_95C2
C - - - - - 0x0015CB 00:95BB: 8A        TXA
C - - - - - 0x0015CC 00:95BC: 49 FF     EOR #$FF
C - - - - - 0x0015CE 00:95BE: 18        CLC
C - - - - - 0x0015CF 00:95BF: 69 01     ADC #$01
C - - - - - 0x0015D1 00:95C1: AA        TAX
bra_95C2:
C - - - - - 0x0015D2 00:95C2: 8A        TXA
C - - - - - 0x0015D3 00:95C3: A2 00     LDX #$00
C - - - - - 0x0015D5 00:95C5: 0A        ASL
C - - - - - 0x0015D6 00:95C6: 0A        ASL
C - - - - - 0x0015D7 00:95C7: 0A        ASL
C - - - - - 0x0015D8 00:95C8: 85 E8     STA ram_00E8
C - - - - - 0x0015DA 00:95CA: 10 01     BPL bra_95CD
C - - - - - 0x0015DC 00:95CC: CA        DEX ; FF
bra_95CD:
C - - - - - 0x0015DD 00:95CD: 86 E9     STX ram_00E9
C - - - - - 0x0015DF 00:95CF: A5 9C     LDA ram_009C
C - - - - - 0x0015E1 00:95D1: 18        CLC
C - - - - - 0x0015E2 00:95D2: 65 E8     ADC ram_00E8
C - - - - - 0x0015E4 00:95D4: 85 E8     STA ram_00E8
C - - - - - 0x0015E6 00:95D6: A5 9D     LDA ram_009D
C - - - - - 0x0015E8 00:95D8: 65 E9     ADC ram_00E9
C - - - - - 0x0015EA 00:95DA: 85 E9     STA ram_00E9
C - - - - - 0x0015EC 00:95DC: E6 E6     INC ram_00E6
C - - - - - 0x0015EE 00:95DE: D0 02     BNE bra_95E2
C - - - - - 0x0015F0 00:95E0: E6 E7     INC ram_00E7
bra_95E2:
C - - - - - 0x0015F2 00:95E2: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации
bra_95E5_C0_FF:
C - - - - - 0x0015F5 00:95E5: C9 D0     CMP #$D0
C - - - - - 0x0015F7 00:95E7: 90 03     BCC bra_95EC_C0_CF
; D0-FF
C - - - - - 0x0015F9 00:95E9: 4C 84 96  JMP loc_9684_D0_FF
bra_95EC_C0_CF:
C - - - - - 0x0015FC 00:95EC: AA        TAX
C - - - - - 0x0015FD 00:95ED: A0 00     LDY #$00
C - - - - - 0x0015FF 00:95EF: B1 94     LDA (ram_0094),Y
C - - - - - 0x001601 00:95F1: 0A        ASL
C - - - - - 0x001602 00:95F2: 10 07     BPL bra_95FB
C - - - - - 0x001604 00:95F4: 8A        TXA
C - - - - - 0x001605 00:95F5: 49 FF     EOR #$FF
C - - - - - 0x001607 00:95F7: 18        CLC
C - - - - - 0x001608 00:95F8: 69 01     ADC #$01
C - - - - - 0x00160A 00:95FA: AA        TAX
bra_95FB:
C - - - - - 0x00160B 00:95FB: 8A        TXA
C - - - - - 0x00160C 00:95FC: 29 08     AND #$08
C - - - - - 0x00160E 00:95FE: D0 08     BNE bra_9608
C - - - - - 0x001610 00:9600: 8A        TXA
C - - - - - 0x001611 00:9601: 29 07     AND #$07
C - - - - - 0x001613 00:9603: A0 00     LDY #$00
C - - - - - 0x001615 00:9605: 4C 0D 96  JMP loc_960D
bra_9608:
C - - - - - 0x001618 00:9608: 8A        TXA
C - - - - - 0x001619 00:9609: 09 F0     ORA #$F0
C - - - - - 0x00161B 00:960B: A0 FF     LDY #$FF
loc_960D:
C D 0 - - - 0x00161D 00:960D: 18        CLC
C - - - - - 0x00161E 00:960E: 65 E8     ADC ram_00E8
C - - - - - 0x001620 00:9610: A6 98     LDX ram_0098
C - - - - - 0x001622 00:9612: 9D 6B 04  STA ram_copy_spr_X,X
C - - - - - 0x001625 00:9615: 98        TYA
C - - - - - 0x001626 00:9616: 65 E9     ADC ram_00E9
C - - - - - 0x001628 00:9618: 29 01     AND #$01
C - - - - - 0x00162A 00:961A: 85 EC     STA ram_00EC
C - - - - - 0x00162C 00:961C: A0 01     LDY #$01
C - - - - - 0x00162E 00:961E: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001630 00:9620: 29 3C     AND #$3C
C - - - - - 0x001632 00:9622: 4A        LSR
C - - - - - 0x001633 00:9623: 4A        LSR
C - - - - - 0x001634 00:9624: A8        TAY
C - - - - - 0x001635 00:9625: 29 08     AND #$08
C - - - - - 0x001637 00:9627: D0 0E     BNE bra_9637
C - - - - - 0x001639 00:9629: 98        TYA
C - - - - - 0x00163A 00:962A: 18        CLC
C - - - - - 0x00163B 00:962B: 65 EA     ADC ram_00EA
C - - - - - 0x00163D 00:962D: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x001640 00:9630: A5 EB     LDA ram_00EB
C - - - - - 0x001642 00:9632: 69 00     ADC #$00
C - - - - - 0x001644 00:9634: 4C 45 96  JMP loc_9645
bra_9637:
C - - - - - 0x001647 00:9637: 98        TYA
C - - - - - 0x001648 00:9638: 18        CLC
C - - - - - 0x001649 00:9639: 69 F0     ADC #$F0
C - - - - - 0x00164B 00:963B: 18        CLC
C - - - - - 0x00164C 00:963C: 65 EA     ADC ram_00EA
C - - - - - 0x00164E 00:963E: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x001651 00:9641: A5 EB     LDA ram_00EB
C - - - - - 0x001653 00:9643: E9 00     SBC #$00
loc_9645:
C D 0 - - - 0x001655 00:9645: 29 01     AND #$01
C - - - - - 0x001657 00:9647: 0A        ASL
C - - - - - 0x001658 00:9648: 05 EC     ORA ram_00EC
C - - - - - 0x00165A 00:964A: 0A        ASL
C - - - - - 0x00165B 00:964B: 0A        ASL
C - - - - - 0x00165C 00:964C: 85 EC     STA ram_00EC
C - - - - - 0x00165E 00:964E: A0 01     LDY #$01
C - - - - - 0x001660 00:9650: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001662 00:9652: A0 00     LDY #$00
C - - - - - 0x001664 00:9654: 51 94     EOR (ram_0094),Y
C - - - - - 0x001666 00:9656: 29 40     AND #$40
C - - - - - 0x001668 00:9658: 05 EC     ORA ram_00EC
C - - - - - 0x00166A 00:965A: 85 EC     STA ram_00EC
C - - - - - 0x00166C 00:965C: A0 01     LDY #$01
C - - - - - 0x00166E 00:965E: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001670 00:9660: 29 03     AND #$03
C - - - - - 0x001672 00:9662: 05 EC     ORA ram_00EC
C - - - - - 0x001674 00:9664: 9D 6A 04  STA ram_copy_spr_A,X
C - - - - - 0x001677 00:9667: C8        INY
C - - - - - 0x001678 00:9668: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x00167A 00:966A: 9D 69 04  STA ram_copy_spr_T,X
C - - - - - 0x00167D 00:966D: A5 98     LDA ram_0098
C - - - - - 0x00167F 00:966F: 18        CLC
C - - - - - 0x001680 00:9670: 69 04     ADC #$04
C - - - - - 0x001682 00:9672: 85 98     STA ram_0098
C - - - - - 0x001684 00:9674: A5 E6     LDA ram_00E6
C - - - - - 0x001686 00:9676: 18        CLC
C - - - - - 0x001687 00:9677: 69 03     ADC #< $0003
C - - - - - 0x001689 00:9679: 85 E6     STA ram_00E6
C - - - - - 0x00168B 00:967B: A5 E7     LDA ram_00E7
C - - - - - 0x00168D 00:967D: 69 00     ADC #> $0003
C - - - - - 0x00168F 00:967F: 85 E7     STA ram_00E7
C - - - - - 0x001691 00:9681: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации



loc_9684_D0_FF:
; bzk warning код, который сюда прыгает, уверен что байт будет F8-FF, хотя условие для перехода сюда это >=D0
C D 0 - - - 0x001694 00:9684: 38        SEC
C - - - - - 0x001695 00:9685: E9 F8     SBC #$F8
C - - - - - 0x001697 00:9687: 0A        ASL
C - - - - - 0x001698 00:9688: AA        TAX
C - - - - - 0x001699 00:9689: BD 93 96  LDA tbl_9692_управляющие_байты_спрайтов_анимации + $01,X
C - - - - - 0x00169C 00:968C: 48        PHA
C - - - - - 0x00169D 00:968D: BD 92 96  LDA tbl_9692_управляющие_байты_спрайтов_анимации,X
C - - - - - 0x0016A0 00:9690: 48        PHA
C - - - - - 0x0016A1 00:9691: 60        RTS



tbl_9692_управляющие_байты_спрайтов_анимации:
- - - - - - 0x0016A2 00:9692: A1 96     .word $0000
- - - - - - 0x0016A4 00:9694: A1 96     .word $0000
- D 0 - - - 0x0016A6 00:9696: A4 96     .word ofs_004_96A5_FA_прыжок_с_возвратом - $01
- D 0 - - - 0x0016A8 00:9698: C6 96     .word ofs_004_96C7_FB_прыжок - $01
- - - - - - 0x0016AA 00:969A: A1 96     .word $0000
- - - - - - 0x0016AC 00:969C: A1 96     .word $0000
- D 0 - - - 0x0016AE 00:969E: D5 96     .word ofs_004_96D6_FE - $01
- D 0 - - - 0x0016B0 00:96A0: F1 96     .word ofs_004_96F2_FF_выход - $01



ofs_004_96A5_FA_прыжок_с_возвратом:
C - - - - - 0x0016B5 00:96A5: A0 13     LDY #$13
C - - - - - 0x0016B7 00:96A7: B1 94     LDA (ram_0094),Y
C - - - - - 0x0016B9 00:96A9: C9 04     CMP #$04
; в новых логах уловие BCS никогда не выполнялось
bra_96AB_infinite_loop:
C - - - - - 0x0016BB 00:96AB: B0 FE     BCS bra_96AB_infinite_loop
C - - - - - 0x0016BD 00:96AD: AA        TAX
C - - - - - 0x0016BE 00:96AE: 18        CLC
C - - - - - 0x0016BF 00:96AF: 69 01     ADC #$01
C - - - - - 0x0016C1 00:96B1: 91 94     STA (ram_0094),Y
C - - - - - 0x0016C3 00:96B3: 8A        TXA
C - - - - - 0x0016C4 00:96B4: 0A        ASL
C - - - - - 0x0016C5 00:96B5: 18        CLC
C - - - - - 0x0016C6 00:96B6: 69 18     ADC #$18
C - - - - - 0x0016C8 00:96B8: A8        TAY
C - - - - - 0x0016C9 00:96B9: A5 E6     LDA ram_00E6
C - - - - - 0x0016CB 00:96BB: 18        CLC
C - - - - - 0x0016CC 00:96BC: 69 03     ADC #< $0003
C - - - - - 0x0016CE 00:96BE: 91 94     STA (ram_0094),Y
C - - - - - 0x0016D0 00:96C0: A5 E7     LDA ram_00E7
C - - - - - 0x0016D2 00:96C2: 69 00     ADC #> $0003
C - - - - - 0x0016D4 00:96C4: C8        INY
C - - - - - 0x0016D5 00:96C5: 91 94     STA (ram_0094),Y
ofs_004_96C7_FB_прыжок:
C - - - - - 0x0016D7 00:96C7: A0 01     LDY #$01
C - - - - - 0x0016D9 00:96C9: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0016DB 00:96CB: AA        TAX
C - - - - - 0x0016DC 00:96CC: C8        INY
C - - - - - 0x0016DD 00:96CD: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0016DF 00:96CF: 85 E7     STA ram_00E7
C - - - - - 0x0016E1 00:96D1: 86 E6     STX ram_00E6
C - - - - - 0x0016E3 00:96D3: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации



ofs_004_96D6_FE:
C - - - - - 0x0016E6 00:96D6: A0 13     LDY #$13
C - - - - - 0x0016E8 00:96D8: B1 94     LDA (ram_0094),Y ; 057B 059B 05BB 
; в новых логах условие BEQ никогда не выполнялось
; возможно это проверка на баги от разработчиков
bra_96DA_infinite_loop:
C - - - - - 0x0016EA 00:96DA: F0 FE     BEQ bra_96DA_infinite_loop
C - - - - - 0x0016EC 00:96DC: 38        SEC
C - - - - - 0x0016ED 00:96DD: E9 01     SBC #$01
C - - - - - 0x0016EF 00:96DF: 91 94     STA (ram_0094),Y ; 057B 059B 05BB 
C - - - - - 0x0016F1 00:96E1: 0A        ASL
C - - - - - 0x0016F2 00:96E2: 18        CLC
C - - - - - 0x0016F3 00:96E3: 69 18     ADC #$18
C - - - - - 0x0016F5 00:96E5: A8        TAY
C - - - - - 0x0016F6 00:96E6: B1 94     LDA (ram_0094),Y
C - - - - - 0x0016F8 00:96E8: 85 E6     STA ram_00E6
C - - - - - 0x0016FA 00:96EA: C8        INY
C - - - - - 0x0016FB 00:96EB: B1 94     LDA (ram_0094),Y
C - - - - - 0x0016FD 00:96ED: 85 E7     STA ram_00E7
C - - - - - 0x0016FF 00:96EF: 4C 15 95  JMP loc_9515_продолжить_чтение_байтов_спрайтов_анимации



ofs_004_96F2_FF_выход:
C - - - - - 0x001702 00:96F2: A0 00     LDY #$00
C - - - - - 0x001704 00:96F4: B1 94     LDA (ram_0094),Y
C - - - - - 0x001706 00:96F6: 29 08     AND #$08
C - - - - - 0x001708 00:96F8: D0 09     BNE bra_9703
C - - - - - 0x00170A 00:96FA: B1 94     LDA (ram_0094),Y
C - - - - - 0x00170C 00:96FC: 09 08     ORA #$08
C - - - - - 0x00170E 00:96FE: 91 94     STA (ram_0094),Y
C - - - - - 0x001710 00:9700: 4C 27 97  JMP loc_9727  ; bzk optimize, можно заменить на BNE
bra_9703:
C - - - - - 0x001713 00:9703: A0 10     LDY #$10
C - - - - - 0x001715 00:9705: B1 94     LDA (ram_0094),Y
C - - - - - 0x001717 00:9707: C8        INY
C - - - - - 0x001718 00:9708: 18        CLC
C - - - - - 0x001719 00:9709: 71 94     ADC (ram_0094),Y
C - - - - - 0x00171B 00:970B: 38        SEC
C - - - - - 0x00171C 00:970C: E5 98     SBC ram_0098
C - - - - - 0x00171E 00:970E: F0 24     BEQ bra_9734_RTS
C - - - - - 0x001720 00:9710: 90 15     BCC bra_9727
C - - - - - 0x001722 00:9712: 4A        LSR
C - - - - - 0x001723 00:9713: 4A        LSR
C - - - - - 0x001724 00:9714: A8        TAY
C - - - - - 0x001725 00:9715: A6 98     LDX ram_0098
bra_9717_loop:
C - - - - - 0x001727 00:9717: A9 F8     LDA #$F8
C - - - - - 0x001729 00:9719: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x00172C 00:971C: 8A        TXA
C - - - - - 0x00172D 00:971D: 18        CLC
C - - - - - 0x00172E 00:971E: 69 04     ADC #$04
C - - - - - 0x001730 00:9720: AA        TAX
C - - - - - 0x001731 00:9721: 88        DEY
C - - - - - 0x001732 00:9722: D0 F3     BNE bra_9717_loop
C - - - - - 0x001734 00:9724: 4C 34 97  RTS
bra_9727:
loc_9727:
C D 0 - - - 0x001737 00:9727: A5 98     LDA ram_0098
C - - - - - 0x001739 00:9729: AA        TAX
C - - - - - 0x00173A 00:972A: A0 10     LDY #$10
C - - - - - 0x00173C 00:972C: 38        SEC
C - - - - - 0x00173D 00:972D: F1 94     SBC (ram_0094),Y
C - - - - - 0x00173F 00:972F: C8        INY
C - - - - - 0x001740 00:9730: 91 94     STA (ram_0094),Y
C - - - - - 0x001742 00:9732: 86 97     STX ram_0097
bra_9734_RTS:
C D 0 - - - 0x001744 00:9734: 60        RTS



sub_9735:
C - - - - - 0x001745 00:9735: AA        TAX
C - - - - - 0x001746 00:9736: A9 00     LDA #$00
C - - - - - 0x001748 00:9738: 91 94     STA (ram_0094),Y
C - - - - - 0x00174A 00:973A: C8        INY
C - - - - - 0x00174B 00:973B: 8A        TXA
C - - - - - 0x00174C 00:973C: 91 94     STA (ram_0094),Y
C - - - - - 0x00174E 00:973E: 0A        ASL
C - - - - - 0x00174F 00:973F: 99 95 00  STA ram_0095,Y
C - - - - - 0x001752 00:9742: A9 00     LDA #$00
C - - - - - 0x001754 00:9744: 69 00     ADC #$00
C - - - - - 0x001756 00:9746: 99 96 00  STA ram_0096,Y
C - - - - - 0x001759 00:9749: 60        RTS



sub_974A:
C - - - - - 0x00175A 00:974A: B1 94     LDA (ram_0094),Y
C - - - - - 0x00175C 00:974C: 0A        ASL
C - - - - - 0x00175D 00:974D: C8        INY
C - - - - - 0x00175E 00:974E: B1 94     LDA (ram_0094),Y
C - - - - - 0x001760 00:9750: 2A        ROL
C - - - - - 0x001761 00:9751: 99 95 00  STA ram_0095,Y
C - - - - - 0x001764 00:9754: A9 00     LDA #$00
C - - - - - 0x001766 00:9756: 2A        ROL
C - - - - - 0x001767 00:9757: 99 96 00  STA ram_0096,Y
C - - - - - 0x00176A 00:975A: 60        RTS



sub_975B:
C - - - - - 0x00176B 00:975B: 86 ED     STX ram_00ED
C - - - - - 0x00176D 00:975D: B1 94     LDA (ram_0094),Y
C - - - - - 0x00176F 00:975F: 2A        ROL
C - - - - - 0x001770 00:9760: 2A        ROL
C - - - - - 0x001771 00:9761: 29 01     AND #$01
C - - - - - 0x001773 00:9763: 49 FF     EOR #$FF
C - - - - - 0x001775 00:9765: 18        CLC
C - - - - - 0x001776 00:9766: 69 01     ADC #$01
C - - - - - 0x001778 00:9768: AA        TAX
C - - - - - 0x001779 00:9769: B1 94     LDA (ram_0094),Y
C - - - - - 0x00177B 00:976B: 88        DEY
C - - - - - 0x00177C 00:976C: 88        DEY
C - - - - - 0x00177D 00:976D: 18        CLC
C - - - - - 0x00177E 00:976E: 71 94     ADC (ram_0094),Y
C - - - - - 0x001780 00:9770: 91 94     STA (ram_0094),Y
C - - - - - 0x001782 00:9772: 85 EC     STA ram_00EC
C - - - - - 0x001784 00:9774: C8        INY
C - - - - - 0x001785 00:9775: 8A        TXA
C - - - - - 0x001786 00:9776: 71 94     ADC (ram_0094),Y
C - - - - - 0x001788 00:9778: 91 94     STA (ram_0094),Y
C - - - - - 0x00178A 00:977A: AA        TAX
C - - - - - 0x00178B 00:977B: A4 ED     LDY ram_00ED
C - - - - - 0x00178D 00:977D: A5 EC     LDA ram_00EC
C - - - - - 0x00178F 00:977F: 18        CLC
C - - - - - 0x001790 00:9780: 71 94     ADC (ram_0094),Y
C - - - - - 0x001792 00:9782: 91 94     STA (ram_0094),Y
C - - - - - 0x001794 00:9784: 8A        TXA
C - - - - - 0x001795 00:9785: C8        INY
C - - - - - 0x001796 00:9786: 71 94     ADC (ram_0094),Y
C - - - - - 0x001798 00:9788: 91 94     STA (ram_0094),Y
C - - - - - 0x00179A 00:978A: 60        RTS



tbl_978B:
; 00-1F
- D 0 - - - 0x00179B 00:978B: 80        .byte $80
- D 0 - - - 0x00179C 00:978C: 01        .byte $01   ; <あ>
- D 0 - - - 0x00179D 00:978D: 00        .byte $00
- D 0 - - - 0x00179E 00:978E: 00        .byte $00
- D 0 - - - 0x00179F 00:978F: 00        .byte $00
- D 0 - - - 0x0017A0 00:9790: 30        .byte $30   ; <ゃ>
- D 0 - - - 0x0017A1 00:9791: 00        .byte $00
- D 0 - - - 0x0017A2 00:9792: 40        .byte $40   ; <「>
- D 0 - - - 0x0017A3 00:9793: 00        .byte $00
- D 0 - - - 0x0017A4 00:9794: 00        .byte $00
- D 0 - - - 0x0017A5 00:9795: 00        .byte $00
- D 0 - - - 0x0017A6 00:9796: 00        .byte $00
- D 0 - - - 0x0017A7 00:9797: 00        .byte $00
- D 0 - - - 0x0017A8 00:9798: 00        .byte $00
- D 0 - - - 0x0017A9 00:9799: 00        .byte $00
- D 0 - - - 0x0017AA 00:979A: 00        .byte $00
- D 0 - - - 0x0017AB 00:979B: 00        .byte $00
- D 0 - - - 0x0017AC 00:979C: 00        .byte $00
- D 0 - - - 0x0017AD 00:979D: 00        .byte $00
- D 0 - - - 0x0017AE 00:979E: 00        .byte $00
- D 0 - - - 0x0017AF 00:979F: 00        .byte $00
- D 0 - - - 0x0017B0 00:97A0: 00        .byte $00
- D 0 - - - 0x0017B1 00:97A1: 00        .byte $00
- D 0 - - - 0x0017B2 00:97A2: 00        .byte $00
- D 0 - - - 0x0017B3 00:97A3: 00        .byte $00
- D 0 - - - 0x0017B4 00:97A4: 00        .byte $00
- D 0 - - - 0x0017B5 00:97A5: 00        .byte $00
- D 0 - - - 0x0017B6 00:97A6: 00        .byte $00
- D 0 - - - 0x0017B7 00:97A7: 00        .byte $00
- D 0 - - - 0x0017B8 00:97A8: 00        .byte $00
- D 0 - - - 0x0017B9 00:97A9: 00        .byte $00
- D 0 - - - 0x0017BA 00:97AA: 00        .byte $00



sub_0x0017BB:
C - - - - - 0x0017BB 00:97AB: A9 00     LDA #$00
sub_0x0017BD:
; bzk optimize, этот экспорт раньше использовался в трех местах
; 2 из которых для опций расстановка и защита у японцев
; добавляет смещение к ppu адресу
; теперь остался только прыжок из потенциально неиспользуемого кода
C - - - - - 0x0017BD 00:97AD: 85 E9     STA ram_00E9
C - - - - - 0x0017BF 00:97AF: A9 01     LDA #$01
C - - - - - 0x0017C1 00:97B1: 85 EB     STA ram_00EB
C - - - - - 0x0017C3 00:97B3: 4C C4 97  JMP loc_97C4



sub_97B6_запись_в_буфер_без_смещения:
sub_0x0017C6_запись_в_буфер_без_смещения:
C - - - - - 0x0017C6 00:97B6: A9 00     LDA #$00
sub_0x0017C8_запись_в_буфер_со_смещением:
; первый байт indirect - количество байтов для записи
    ; если +40 то это последнее чтение
; второй и третий - адрес ppu
; остальные - байты для записи в буфер

; на вход подается младший Y и старший X
; 00E8 сначала отвечает за ???, потом хранит себе счетчик записи в буфер
; 00E9 хранит в себе дополнительное смещение для ppu адреса, может быть положительным или отрицательным
; 00EB что-то типа флага перехода куда-то по стеку если не 00
C - - - - - 0x0017C8 00:97B8: 85 E9     STA ram_00E9
C - - - - - 0x0017CA 00:97BA: A5 4A     LDA ram_степень_яркости_фона
C - - - - - 0x0017CC 00:97BC: 05 4B     ORA ram_степень_яркости_спрайтов
C - - - - - 0x0017CE 00:97BE: F0 59     BEQ bra_9819
C - - - - - 0x0017D0 00:97C0: A9 00     LDA #$00
C - - - - - 0x0017D2 00:97C2: 85 EB     STA ram_00EB
loc_97C4:
C D 0 - - - 0x0017D4 00:97C4: 84 E6     STY ram_00E6
C - - - - - 0x0017D6 00:97C6: 86 E7     STX ram_00E7
bra_97C8_loop_repeat:
C - - - - - 0x0017D8 00:97C8: A0 01     LDY #$01
C - - - - - 0x0017DA 00:97CA: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0017DC 00:97CC: 18        CLC
C - - - - - 0x0017DD 00:97CD: 65 E9     ADC ram_00E9
C - - - - - 0x0017DF 00:97CF: 85 E8     STA ram_00E8
C - - - - - 0x0017E1 00:97D1: C8        INY
C - - - - - 0x0017E2 00:97D2: A9 00     LDA #$00
C - - - - - 0x0017E4 00:97D4: 24 E9     BIT ram_00E9
C - - - - - 0x0017E6 00:97D6: 10 02     BPL bra_97DA
C - - - - - 0x0017E8 00:97D8: A9 FF     LDA #$FF
bra_97DA:
C - - - - - 0x0017EA 00:97DA: 71 E6     ADC (ram_00E6),Y
C - - - - - 0x0017EC 00:97DC: AA        TAX
C - - - - - 0x0017ED 00:97DD: A0 00     LDY #$00
C - - - - - 0x0017EF 00:97DF: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x0017F1 00:97E1: A4 E8     LDY ram_00E8
C - - - - - 0x0017F3 00:97E3: 85 E8     STA ram_00E8
C - - - - - 0x0017F5 00:97E5: 29 BF     AND #$40 ^ $FF
C - - - - - 0x0017F7 00:97E7: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x0017FA 00:97EA: A5 E8     LDA ram_00E8
C - - - - - 0x0017FC 00:97EC: 29 3F     AND #$3F
C - - - - - 0x0017FE 00:97EE: A0 03     LDY #$03
bra_97F0_продолжить_копирование_в_буфер:
C - - - - - 0x001800 00:97F0: 48        PHA
C - - - - - 0x001801 00:97F1: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001803 00:97F3: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001806 00:97F6: C8        INY
C - - - - - 0x001807 00:97F7: E8        INX
C - - - - - 0x001808 00:97F8: 68        PLA
C - - - - - 0x001809 00:97F9: 38        SEC
C - - - - - 0x00180A 00:97FA: E9 01     SBC #$01
C - - - - - 0x00180C 00:97FC: D0 F2     BNE bra_97F0_продолжить_копирование_в_буфер
C - - - - - 0x00180E 00:97FE: 98        TYA
C - - - - - 0x00180F 00:97FF: 18        CLC
C - - - - - 0x001810 00:9800: 65 E6     ADC ram_00E6
C - - - - - 0x001812 00:9802: 85 E6     STA ram_00E6
C - - - - - 0x001814 00:9804: A5 E7     LDA ram_00E7
C - - - - - 0x001816 00:9806: 69 00     ADC #$00
C - - - - - 0x001818 00:9808: 85 E7     STA ram_00E7
C - - - - - 0x00181A 00:980A: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x00181D 00:980D: A5 EB     LDA ram_00EB
C - - - - - 0x00181F 00:980F: F0 03     BEQ bra_9814_пропуск
C - - - - - 0x001821 00:9811: 20 A8 9F  JSR sub_9FA8_задержка_кадра
bra_9814_пропуск:
C - - - - - 0x001824 00:9814: 24 E8     BIT ram_00E8
C - - - - - 0x001826 00:9816: 50 B0     BVC bra_97C8_loop_repeat
C - - - - - 0x001828 00:9818: 60        RTS
bra_9819:
C - - - - - 0x001829 00:9819: A5 20     LDA ram_0020
C - - - - - 0x00182B 00:981B: 29 7F     AND #$7F
C - - - - - 0x00182D 00:981D: 8D 00 20  STA $2000
C - - - - - 0x001830 00:9820: 85 20     STA ram_0020
C - - - - - 0x001832 00:9822: A5 21     LDA ram_for_2001
C - - - - - 0x001834 00:9824: 29 E7     AND #$E7
C - - - - - 0x001836 00:9826: 8D 01 20  STA $2001
C - - - - - 0x001839 00:9829: 85 21     STA ram_for_2001
C - - - - - 0x00183B 00:982B: 84 E6     STY ram_00E6
C - - - - - 0x00183D 00:982D: 86 E7     STX ram_00E7
loc_982F:
C D 0 - - - 0x00183F 00:982F: A0 01     LDY #$01
C - - - - - 0x001841 00:9831: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001843 00:9833: 18        CLC
C - - - - - 0x001844 00:9834: 65 E9     ADC ram_00E9
C - - - - - 0x001846 00:9836: AA        TAX
C - - - - - 0x001847 00:9837: C8        INY
C - - - - - 0x001848 00:9838: A9 00     LDA #$00
C - - - - - 0x00184A 00:983A: 24 E9     BIT ram_00E9
C - - - - - 0x00184C 00:983C: 10 02     BPL bra_9840
C - - - - - 0x00184E 00:983E: A9 FF     LDA #$FF
bra_9840:
C - - - - - 0x001850 00:9840: 71 E6     ADC (ram_00E6),Y
C - - - - - 0x001852 00:9842: 8D 06 20  STA $2006
C - - - - - 0x001855 00:9845: 8E 06 20  STX $2006
C - - - - - 0x001858 00:9848: A2 00     LDX #$00
C - - - - - 0x00185A 00:984A: A0 00     LDY #$00
C - - - - - 0x00185C 00:984C: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x00185E 00:984E: 10 02     BPL bra_9852
C - - - - - 0x001860 00:9850: A2 04     LDX #$04
bra_9852:
C - - - - - 0x001862 00:9852: 8E 00 20  STX $2000
C - - - - - 0x001865 00:9855: 48        PHA
C - - - - - 0x001866 00:9856: 29 3F     AND #$3F
C - - - - - 0x001868 00:9858: AA        TAX
C - - - - - 0x001869 00:9859: A0 03     LDY #$03
bra_985B_loop:
C - - - - - 0x00186B 00:985B: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x00186D 00:985D: 8D 07 20  STA $2007
C - - - - - 0x001870 00:9860: C8        INY
C - - - - - 0x001871 00:9861: CA        DEX
C - - - - - 0x001872 00:9862: D0 F7     BNE bra_985B_loop
C - - - - - 0x001874 00:9864: 68        PLA
C - - - - - 0x001875 00:9865: 0A        ASL
C - - - - - 0x001876 00:9866: 30 0F     BMI bra_9877_закончить
C - - - - - 0x001878 00:9868: 98        TYA
C - - - - - 0x001879 00:9869: 18        CLC
C - - - - - 0x00187A 00:986A: 65 E6     ADC ram_00E6
C - - - - - 0x00187C 00:986C: 85 E6     STA ram_00E6
C - - - - - 0x00187E 00:986E: A5 E7     LDA ram_00E7
C - - - - - 0x001880 00:9870: 69 00     ADC #$00
C - - - - - 0x001882 00:9872: 85 E7     STA ram_00E7
C - - - - - 0x001884 00:9874: 4C 2F 98  JMP loc_982F
bra_9877_закончить:
C - - - - - 0x001887 00:9877: A5 21     LDA ram_for_2001
C - - - - - 0x001889 00:9879: 09 18     ORA #$18
C - - - - - 0x00188B 00:987B: 8D 01 20  STA $2001
C - - - - - 0x00188E 00:987E: 85 21     STA ram_for_2001
C - - - - - 0x001890 00:9880: A5 20     LDA ram_0020
C - - - - - 0x001892 00:9882: 09 80     ORA #$80
C - - - - - 0x001894 00:9884: 85 20     STA ram_0020
C - - - - - 0x001896 00:9886: 8D 00 20  STA $2000
C - - - - - 0x001899 00:9889: 60        RTS



sub_0x0018A5:
loc_0x0018A5:
C D 0 - - - 0x0018A5 00:9895: 84 E6     STY ram_00E6
C - - - - - 0x0018A7 00:9897: 86 E7     STX ram_00E7
C - - - - - 0x0018A9 00:9899: A6 E9     LDX ram_00E9
C - - - - - 0x0018AB 00:989B: A0 01     LDY #$01
C - - - - - 0x0018AD 00:989D: 4C EA 98  JMP loc_98EA_замостить_часть_экрана_тайлом



sub_98A0_очистка_двух_nametable:
sub_0x0018B0_очистка_двух_nametable:
; выключить рендеринг
C - - - - - 0x0018B0 00:98A0: A5 20     LDA ram_0020
C - - - - - 0x0018B2 00:98A2: 29 7F     AND #$7F
C - - - - - 0x0018B4 00:98A4: 8D 00 20  STA $2000
C - - - - - 0x0018B7 00:98A7: 85 20     STA ram_0020
C - - - - - 0x0018B9 00:98A9: A5 21     LDA ram_for_2001
C - - - - - 0x0018BB 00:98AB: 29 E7     AND #$E7      ; выключить рендеринг
C - - - - - 0x0018BD 00:98AD: 8D 01 20  STA $2001
C - - - - - 0x0018C0 00:98B0: 85 21     STA ram_for_2001
C - - - - - 0x0018C2 00:98B2: A9 20     LDA #> $2000
C - - - - - 0x0018C4 00:98B4: 8D 06 20  STA $2006
C - - - - - 0x0018C7 00:98B7: A9 00     LDA #< $2000
C - - - - - 0x0018C9 00:98B9: 8D 06 20  STA $2006
C - - - - - 0x0018CC 00:98BC: A0 08     LDY #$08
; A = 00
C - - - - - 0x0018D0 00:98C0: AA        TAX
bra_98C1_loop_очистки:
C - - - - - 0x0018D1 00:98C1: 8D 07 20  STA $2007
C - - - - - 0x0018D4 00:98C4: E8        INX
C - - - - - 0x0018D5 00:98C5: D0 FA     BNE bra_98C1_loop_очистки
C - - - - - 0x0018D7 00:98C7: 88        DEY
C - - - - - 0x0018D8 00:98C8: D0 F7     BNE bra_98C1_loop_очистки
C - - - - - 0x0018DA 00:98CA: A5 21     LDA ram_for_2001
C - - - - - 0x0018DC 00:98CC: 09 18     ORA #$18      ; включить рендеринг
C - - - - - 0x0018DE 00:98CE: 8D 01 20  STA $2001
C - - - - - 0x0018E1 00:98D1: 85 21     STA ram_for_2001
C - - - - - 0x0018E3 00:98D3: A5 20     LDA ram_0020
C - - - - - 0x0018E5 00:98D5: 09 80     ORA #$80
C - - - - - 0x0018E7 00:98D7: 85 20     STA ram_0020
C - - - - - 0x0018E9 00:98D9: 8D 00 20  STA $2000
C - - - - - 0x0018EC 00:98DC: 60        RTS



sub_0x0018EF:
- - - - - - 0x0018EF 00:98DF: 85 EB     STA ram_00EB
- - - - - - 0x0018F1 00:98E1: 98        TYA
- - - - - - 0x0018F2 00:98E2: 09 80     ORA #$80
- - - - - - 0x0018F4 00:98E4: A8        TAY
- - - - - - 0x0018F5 00:98E5: 4C F2 98  JMP loc_98F2



sub_98E8_затереть_часть_экрана:
loc_98E8_затереть_часть_экрана:
sub_0x0018F8_затереть_часть_экрана:
; на вход подается
    ; X - длина строки
    ; Y - количество строк
    ; 00E6 - начальный адрес 2006 (lo)
    ; 00E7 - начальный адрес 2006 (hi)
                                        LDA #$00
sub_98EA_замостить_часть_экрана_тайлом:
loc_98EA_замостить_часть_экрана_тайлом:
sub_0x0018FA_замостить_часть_экрана_тайлом:
; на вход подается
    ; A - номер тайла
    ; + все что выше
                                        STA ram_00EB
                                        LDA ram_степень_яркости_фона
                                        ORA ram_степень_яркости_спрайтов
                                        BEQ bra_992C
loc_98F2:
                                        STY ram_00E8
                                        STX ram_00E9
bra_98F6_loop:
                                        LDA ram_00E9
                                        LDY ram_00E6
                                        LDX ram_00E7
                                        JSR sub_9B28_подготовить_буфер
                                        LDY ram_00E9
                                        LDA ram_00EB
bra_9903_loop:
                                        STA ram_05E8,X
                                        INX
                                        DEY
                                        BNE bra_9903_loop
                                        JSR sub_9B5E_закрыть_буфер
                                        LDA ram_00E8
                                        BPL bra_9916
                                        LDA #$01
                                        JSR sub_9FA8_задержка_кадра
bra_9916:
                                        LDA ram_00E6
                                        CLC
                                        ADC #< $0020
                                        STA ram_00E6
                                        LDA ram_00E7
                                        ADC #> $0020
                                        STA ram_00E7
                                        DEC ram_00E8
                                        LDA ram_00E8
                                        AND #$7F
                                        BNE bra_98F6_loop
                                        RTS
bra_992C:
                                        LDA ram_0020
                                        AND #$7F
                                        STA $2000
                                        STA ram_0020
                                        LDA ram_for_2001
                                        AND #$E7
                                        STA $2001
                                        STA ram_for_2001
                                        STX ram_00E9
                                        STY ram_00E8
bra_9942:
                                        LDY ram_00E9
                                        LDA ram_00E7
                                        STA $2006
                                        LDA ram_00E6
                                        STA $2006
                                        LDA ram_00EB
bra_9950_loop:
                                        STA $2007
                                        DEY
                                        BNE bra_9950_loop
                                        LDA ram_00E6
                                        CLC
                                        ADC #< $0020
                                        STA ram_00E6
                                        LDA ram_00E7
                                        ADC #> $0020
                                        STA ram_00E7
                                        DEC ram_00E8
                                        BNE bra_9942
                                        LDA ram_for_2001
                                        ORA #$18
                                        STA $2001
                                        STA ram_for_2001
                                        LDA ram_0020
                                        ORA #$80
                                        STA ram_0020
                                        STA $2000
                                        RTS



sub_0x00198A_запись_палитры_фона_и_спрайтов:
C - - - - - 0x00198A 00:997A: 85 48     STA ram_0048
C - - - - - 0x00198C 00:997C: 86 49     STX ram_0049
sub_997E_запись_палитры_фона_и_спрайтов:
sub_0x00198E_запись_палитры_фона_и_спрайтов:
C - - - - - 0x00198E 00:997E: 20 07 9B  JSR sub_9B07
C - - - - - 0x001991 00:9981: 20 B8 9A  JSR sub_9AB8_запись_палитры_фона_в_буфер
C - - - - - 0x001994 00:9984: 20 DA 9A  JSR sub_9ADA_запись_палитры_спрайтов_в_буфер
C - - - - - 0x001997 00:9987: A6 E9     LDX ram_00E9
C - - - - - 0x001999 00:9989: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
bra_998C_loop:
C - - - - - 0x00199C 00:998C: A5 4A     LDA ram_степень_яркости_фона
C - - - - - 0x00199E 00:998E: C9 0F     CMP #$0F
C - - - - - 0x0019A0 00:9990: B0 02     BCS bra_9994
C - - - - - 0x0019A2 00:9992: E6 4A     INC ram_степень_яркости_фона
bra_9994:
C - - - - - 0x0019A4 00:9994: A5 4B     LDA ram_степень_яркости_спрайтов
C - - - - - 0x0019A6 00:9996: C9 0F     CMP #$0F
C - - - - - 0x0019A8 00:9998: B0 02     BCS bra_999C
C - - - - - 0x0019AA 00:999A: E6 4B     INC ram_степень_яркости_спрайтов
bra_999C:
C - - - - - 0x0019AC 00:999C: 20 71 9A  JSR sub_9A71
C - - - - - 0x0019AF 00:999F: A9 01     LDA #$01
C - - - - - 0x0019B1 00:99A1: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0019B4 00:99A4: A5 4A     LDA ram_степень_яркости_фона
C - - - - - 0x0019B6 00:99A6: 18        CLC
C - - - - - 0x0019B7 00:99A7: 65 4B     ADC ram_степень_яркости_спрайтов
C - - - - - 0x0019B9 00:99A9: C9 1E     CMP #$1E
C - - - - - 0x0019BB 00:99AB: 90 DF     BCC bra_998C_loop
C - - - - - 0x0019BD 00:99AD: 60        RTS



sub_99D1:
C - - - - - 0x0019E1 00:99D1: 20 07 9B  JSR sub_9B07
C - - - - - 0x0019E4 00:99D4: 20 DA 9A  JSR sub_9ADA_запись_палитры_спрайтов_в_буфер
C - - - - - 0x0019E7 00:99D7: A6 E9     LDX ram_00E9
C - - - - - 0x0019E9 00:99D9: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
loc_99DC:
C D 0 - - - 0x0019EC 00:99DC: A5 4B     LDA ram_степень_яркости_спрайтов
C - - - - - 0x0019EE 00:99DE: C9 0F     CMP #$0F
C - - - - - 0x0019F0 00:99E0: B0 0D     BCS bra_99EF_RTS
C - - - - - 0x0019F2 00:99E2: E6 4B     INC ram_степень_яркости_спрайтов
C - - - - - 0x0019F4 00:99E4: 20 71 9A  JSR sub_9A71
C - - - - - 0x0019F7 00:99E7: A9 01     LDA #$01
C - - - - - 0x0019F9 00:99E9: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x0019FC 00:99EC: 4C DC 99  JMP loc_99DC
bra_99EF_RTS:
C - - - - - 0x0019FF 00:99EF: 60        RTS



sub_99F0_выход_из_экрана:
sub_0x001A00_выход_из_экрана:
loc_99F0_loop:
C D 0 - - - 0x001A00 00:99F0: A5 4A     LDA ram_степень_яркости_фона
C - - - - - 0x001A02 00:99F2: 05 4B     ORA ram_степень_яркости_спрайтов
C - - - - - 0x001A04 00:99F4: F0 16     BEQ bra_9A0C_RTS
C - - - - - 0x001A06 00:99F6: AA        TAX
C - - - - - 0x001A07 00:99F7: F0 02     BEQ bra_99FB
C - - - - - 0x001A09 00:99F9: C6 4A     DEC ram_степень_яркости_фона
bra_99FB:
C - - - - - 0x001A0B 00:99FB: A5 4B     LDA ram_степень_яркости_спрайтов
C - - - - - 0x001A0D 00:99FD: F0 02     BEQ bra_9A01
C - - - - - 0x001A0F 00:99FF: C6 4B     DEC ram_степень_яркости_спрайтов
bra_9A01:
C - - - - - 0x001A11 00:9A01: 20 71 9A  JSR sub_9A71
C - - - - - 0x001A14 00:9A04: A9 01     LDA #$01
C - - - - - 0x001A16 00:9A06: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001A19 00:9A09: 4C F0 99  JMP loc_99F0_loop
bra_9A0C_RTS:
C - - - - - 0x001A1C 00:9A0C: 60        RTS



sub_9A0D:
sub_0x001A1D:
loc_9A0D_loop:
C D 0 - - - 0x001A1D 00:9A0D: A5 4A     LDA ram_степень_яркости_фона
C - - - - - 0x001A1F 00:9A0F: F0 0D     BEQ bra_9A1E_RTS
C - - - - - 0x001A21 00:9A11: C6 4A     DEC ram_степень_яркости_фона
C - - - - - 0x001A23 00:9A13: 20 71 9A  JSR sub_9A71
C - - - - - 0x001A26 00:9A16: A9 01     LDA #$01
C - - - - - 0x001A28 00:9A18: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001A2B 00:9A1B: 4C 0D 9A  JMP loc_9A0D_loop
bra_9A1E_RTS:
C - - - - - 0x001A2E 00:9A1E: 60        RTS



sub_9A1F:
loc_9A1F:
C D 0 - - - 0x001A2F 00:9A1F: A5 4B     LDA ram_степень_яркости_спрайтов
C - - - - - 0x001A31 00:9A21: F0 0D     BEQ bra_9A30_RTS
C - - - - - 0x001A33 00:9A23: C6 4B     DEC ram_степень_яркости_спрайтов
C - - - - - 0x001A35 00:9A25: 20 71 9A  JSR sub_9A71
C - - - - - 0x001A38 00:9A28: A9 01     LDA #$01
C - - - - - 0x001A3A 00:9A2A: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001A3D 00:9A2D: 4C 1F 9A  JMP loc_9A1F
bra_9A30_RTS:
C - - - - - 0x001A40 00:9A30: 60        RTS



sub_9A31:
C - - - - - 0x001A41 00:9A31: 85 48     STA ram_0048
C - - - - - 0x001A43 00:9A33: 86 49     STX ram_0049
sub_9A35:
sub_0x001A45:
C - - - - - 0x001A45 00:9A35: 20 07 9B  JSR sub_9B07
C - - - - - 0x001A48 00:9A38: 20 B8 9A  JSR sub_9AB8_запись_палитры_фона_в_буфер
C - - - - - 0x001A4B 00:9A3B: 20 DA 9A  JSR sub_9ADA_запись_палитры_спрайтов_в_буфер
C - - - - - 0x001A4E 00:9A3E: A6 E9     LDX ram_00E9
C - - - - - 0x001A50 00:9A40: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
sub_9A43:
sub_0x001A53:
C - - - - - 0x001A53 00:9A43: A9 0F     LDA #$0F
C - - - - - 0x001A55 00:9A45: 85 4A     STA ram_степень_яркости_фона
C - - - - - 0x001A57 00:9A47: 85 4B     STA ram_степень_яркости_спрайтов
C - - - - - 0x001A59 00:9A49: 4C 71 9A  JMP loc_9A71



sub_9A4C:
C - - - - - 0x001A5C 00:9A4C: 85 48     STA ram_0048
C - - - - - 0x001A5E 00:9A4E: 20 07 9B  JSR sub_9B07
C - - - - - 0x001A61 00:9A51: 20 B8 9A  JSR sub_9AB8_запись_палитры_фона_в_буфер
C - - - - - 0x001A64 00:9A54: A6 E9     LDX ram_00E9
C - - - - - 0x001A66 00:9A56: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x001A69 00:9A59: A9 0F     LDA #$0F
C - - - - - 0x001A6B 00:9A5B: 85 4A     STA ram_степень_яркости_фона
C - - - - - 0x001A6D 00:9A5D: 4C 71 9A  JMP loc_9A71



sub_9A60:
C - - - - - 0x001A70 00:9A60: 85 49     STA ram_0049
C - - - - - 0x001A72 00:9A62: 20 07 9B  JSR sub_9B07
C - - - - - 0x001A75 00:9A65: 20 DA 9A  JSR sub_9ADA_запись_палитры_спрайтов_в_буфер
C - - - - - 0x001A78 00:9A68: A6 E9     LDX ram_00E9
C - - - - - 0x001A7A 00:9A6A: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x001A7D 00:9A6D: A9 0F     LDA #$0F
C - - - - - 0x001A7F 00:9A6F: 85 4B     STA ram_степень_яркости_спрайтов
sub_9A71:
loc_9A71:
C D 0 - - - 0x001A81 00:9A71: A9 20     LDA #$20
C - - - - - 0x001A83 00:9A73: A0 00     LDY #$00
C - - - - - 0x001A85 00:9A75: A2 3F     LDX #$3F
C - - - - - 0x001A87 00:9A77: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x001A8A 00:9A7A: 86 E7     STX ram_00E7
C - - - - - 0x001A8C 00:9A7C: A0 00     LDY #$00
bra_9A7E_loop:
C - - - - - 0x001A8E 00:9A7E: B9 2A 06  LDA ram_062A,Y
C - - - - - 0x001A91 00:9A81: 29 30     AND #$30
C - - - - - 0x001A93 00:9A83: 18        CLC
C - - - - - 0x001A94 00:9A84: 65 4A     ADC ram_степень_яркости_фона
C - - - - - 0x001A96 00:9A86: 20 A2 9A  JSR sub_9AA2_вычислить_яркость_цвета
C - - - - - 0x001A99 00:9A89: C0 10     CPY #$10
C - - - - - 0x001A9B 00:9A8B: D0 F1     BNE bra_9A7E_loop
bra_9A8D_loop_063A_0649:
C - - - - - 0x001A9D 00:9A8D: B9 2A 06  LDA ram_063A - $10,Y
C - - - - - 0x001AA0 00:9A90: 29 30     AND #$30
C - - - - - 0x001AA2 00:9A92: 18        CLC
C - - - - - 0x001AA3 00:9A93: 65 4B     ADC ram_степень_яркости_спрайтов
C - - - - - 0x001AA5 00:9A95: 20 A2 9A  JSR sub_9AA2_вычислить_яркость_цвета
C - - - - - 0x001AA8 00:9A98: C0 20     CPY #$20
C - - - - - 0x001AAA 00:9A9A: D0 F1     BNE bra_9A8D_loop_063A_0649
C - - - - - 0x001AAC 00:9A9C: A6 E7     LDX ram_00E7
C - - - - - 0x001AAE 00:9A9E: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x001AB1 00:9AA1: 60        RTS



sub_9AA2_вычислить_яркость_цвета:
C - - - - - 0x001AB2 00:9AA2: AA        TAX
C - - - - - 0x001AB3 00:9AA3: BD A2 9E  LDA tbl_9EA2_яркость_цвета,X
C - - - - - 0x001AB6 00:9AA6: 85 E6     STA ram_00E6
C - - - - - 0x001AB8 00:9AA8: B9 2A 06  LDA ram_062A,Y
C - - - - - 0x001ABB 00:9AAB: 29 0F     AND #$0F
C - - - - - 0x001ABD 00:9AAD: 05 E6     ORA ram_00E6
C - - - - - 0x001ABF 00:9AAF: A6 E7     LDX ram_00E7
C - - - - - 0x001AC1 00:9AB1: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001AC4 00:9AB4: E6 E7     INC ram_00E7
C - - - - - 0x001AC6 00:9AB6: C8        INY
C - - - - - 0x001AC7 00:9AB7: 60        RTS



sub_9AB8_запись_палитры_фона_в_буфер:
C - - - - - 0x001AC8 00:9AB8: A9 00     LDA #$00
C - - - - - 0x001ACA 00:9ABA: 85 E7     STA ram_00E7
; * 10
C - - - - - 0x001ACC 00:9ABC: A5 48     LDA ram_0048
C - - - - - 0x001ACE 00:9ABE: 0A        ASL
C - - - - - 0x001ACF 00:9ABF: 26 E7     ROL ram_00E7
C - - - - - 0x001AD1 00:9AC1: 0A        ASL
C - - - - - 0x001AD2 00:9AC2: 26 E7     ROL ram_00E7
C - - - - - 0x001AD4 00:9AC4: 0A        ASL
C - - - - - 0x001AD5 00:9AC5: 26 E7     ROL ram_00E7
C - - - - - 0x001AD7 00:9AC7: 0A        ASL
C - - - - - 0x001AD8 00:9AC8: 26 E7     ROL ram_00E7
C - - - - - 0x001ADA 00:9ACA: 18        CLC
C - - - - - 0x001ADB 00:9ACB: 69 00     ADC #< tbl_0x00D010_палитра_фона
C - - - - - 0x001ADD 00:9ACD: 85 E6     STA ram_00E6
C - - - - - 0x001ADF 00:9ACF: A5 E7     LDA ram_00E7
C - - - - - 0x001AE1 00:9AD1: 69 B0     ADC #> tbl_0x00D010_палитра_фона
C - - - - - 0x001AE3 00:9AD3: 85 E7     STA ram_00E7
C - - - - - 0x001AE5 00:9AD5: A2 00     LDX #$00
C - - - - - 0x001AE7 00:9AD7: 4C F9 9A  JMP loc_9AF9_чтение_палитры



sub_9ADA_запись_палитры_спрайтов_в_буфер:
C - - - - - 0x001AEA 00:9ADA: A9 00     LDA #$00
C - - - - - 0x001AEC 00:9ADC: 85 E7     STA ram_00E7
C - - - - - 0x001AEE 00:9ADE: A5 49     LDA ram_0049
C - - - - - 0x001AF0 00:9AE0: 0A        ASL
C - - - - - 0x001AF1 00:9AE1: 26 E7     ROL ram_00E7
C - - - - - 0x001AF3 00:9AE3: 0A        ASL
C - - - - - 0x001AF4 00:9AE4: 26 E7     ROL ram_00E7
C - - - - - 0x001AF6 00:9AE6: 0A        ASL
C - - - - - 0x001AF7 00:9AE7: 26 E7     ROL ram_00E7
C - - - - - 0x001AF9 00:9AE9: 0A        ASL
C - - - - - 0x001AFA 00:9AEA: 26 E7     ROL ram_00E7
C - - - - - 0x001AFC 00:9AEC: 18        CLC
C - - - - - 0x001AFD 00:9AED: 69 00     ADC #< tbl_0x00D310_палитра_спрайтов
C - - - - - 0x001AFF 00:9AEF: 85 E6     STA ram_00E6
C - - - - - 0x001B01 00:9AF1: A5 E7     LDA ram_00E7
C - - - - - 0x001B03 00:9AF3: 69 B3     ADC #> tbl_0x00D310_палитра_спрайтов
C - - - - - 0x001B05 00:9AF5: 85 E7     STA ram_00E7
C - - - - - 0x001B07 00:9AF7: A2 10     LDX #$10
loc_9AF9_чтение_палитры:
C D 0 - - - 0x001B09 00:9AF9: A0 00     LDY #$00
bra_9AFB_loop:
C - - - - - 0x001B0B 00:9AFB: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001B0D 00:9AFD: 9D 2A 06  STA ram_062A,X
C - - - - - 0x001B10 00:9B00: E8        INX
C - - - - - 0x001B11 00:9B01: C8        INY
C - - - - - 0x001B12 00:9B02: C0 10     CPY #$10
C - - - - - 0x001B14 00:9B04: D0 F5     BNE bra_9AFB_loop
C - - - - - 0x001B16 00:9B06: 60        RTS



sub_9B07:
C - - - - - 0x001B17 00:9B07: A5 25     LDA ram_for_5115
C - - - - - 0x001B19 00:9B09: 85 E9     STA ram_00E9
C - - - - - 0x001B1B 00:9B0B: A2 06     LDX #con_prg_bank + $06
C - - - - - 0x001B1D 00:9B0D: 20 B9 C4  JSR sub_0x03C4C9_банксвич_PRG_5115
C - - - - - 0x001B20 00:9B10: 60        RTS



sub_9B11:
C - - - - - 0x001B21 00:9B11: A9 00     LDA #$00
C - - - - - 0x001B23 00:9B13: 85 48     STA ram_0048
C - - - - - 0x001B25 00:9B15: 85 49     STA ram_0049
C - - - - - 0x001B27 00:9B17: 85 4A     STA ram_степень_яркости_фона
C - - - - - 0x001B29 00:9B19: 85 4B     STA ram_степень_яркости_спрайтов
C - - - - - 0x001B2B 00:9B1B: A9 0F     LDA #$0F
C - - - - - 0x001B2D 00:9B1D: A0 E0     LDY #$E0
bra_9B1F_loop:
C - - - - - 0x001B2F 00:9B1F: 99 4A 05  STA ram_062A - $E0,Y
C - - - - - 0x001B32 00:9B22: C8        INY
C - - - - - 0x001B33 00:9B23: D0 FA     BNE bra_9B1F_loop
C - - - - - 0x001B35 00:9B25: 4C 71 9A  JMP loc_9A71



sub_9B28_подготовить_буфер:
sub_0x001B38_подготовить_буфер:
loc_9B28_повторить:
; на вход подается
    ; A = подается выделенное количество тайлов для буфера перед записью в него
        ; +80 = вывести тайлы вертикально
    ; X = hi 2006
    ; Y = lo 2006
C D 0 - - - 0x001B38 00:9B28: 48        PHA
C - - - - - 0x001B39 00:9B29: 2C 29 06  BIT ram_0629
; вероятно это флаг ожидания выключения рендеринга
C - - - - - 0x001B3C 00:9B2C: 50 09     BVC bra_9B37
bra_9B2E_буфер_переполнен:
C - - - - - 0x001B3E 00:9B2E: A9 01     LDA #$01
C - - - - - 0x001B40 00:9B30: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001B43 00:9B33: 68        PLA
C - - - - - 0x001B44 00:9B34: 4C 28 9B  JMP loc_9B28_повторить
bra_9B37:
C - - - - - 0x001B47 00:9B37: 29 3F     AND #$3F
C - - - - - 0x001B49 00:9B39: 18        CLC
C - - - - - 0x001B4A 00:9B3A: 6D 28 06  ADC ram_индекс_буфера
C - - - - - 0x001B4D 00:9B3D: C9 3D     CMP #$3D
C - - - - - 0x001B4F 00:9B3F: B0 ED     BCS bra_9B2E_буфер_переполнен
C - - - - - 0x001B51 00:9B41: 68        PLA
C - - - - - 0x001B52 00:9B42: 09 40     ORA #$40
C - - - - - 0x001B54 00:9B44: 8D 29 06  STA ram_0629
C - - - - - 0x001B57 00:9B47: 8A        TXA
C - - - - - 0x001B58 00:9B48: AE 28 06  LDX ram_индекс_буфера
C - - - - - 0x001B5B 00:9B4B: 9D EA 05  STA ram_облако,X
C - - - - - 0x001B5E 00:9B4E: 98        TYA
C - - - - - 0x001B5F 00:9B4F: 9D E9 05  STA ram_таймер_облака_ХЗ,X
C - - - - - 0x001B62 00:9B52: AD 29 06  LDA ram_0629
C - - - - - 0x001B65 00:9B55: 29 BF     AND #$40 ^ $FF
C - - - - - 0x001B67 00:9B57: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001B6A 00:9B5A: E8        INX
C - - - - - 0x001B6B 00:9B5B: E8        INX
C - - - - - 0x001B6C 00:9B5C: E8        INX
C - - - - - 0x001B6D 00:9B5D: 60        RTS



sub_9B5E_закрыть_буфер:
loc_9B5E_закрыть_буфер:
sub_0x001B6E_закрыть_буфер:
C D 0 - - - 0x001B6E 00:9B5E: A9 00     LDA #$00
C - - - - - 0x001B70 00:9B60: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001B73 00:9B63: 8E 28 06  STX ram_индекс_буфера
C - - - - - 0x001B76 00:9B66: AD 29 06  LDA ram_0629
C - - - - - 0x001B79 00:9B69: 29 BF     AND #$40 ^ $FF
C - - - - - 0x001B7B 00:9B6B: 8D 29 06  STA ram_0629
C - - - - - 0x001B7E 00:9B6E: 60        RTS



sub_0x001B7F_запись_первых_двух_банков_спрайтов:
C - - - - - 0x001B7F 00:9B6F: 86 9E     STX ram_for_5124
C - - - - - 0x001B81 00:9B71: 84 9F     STY ram_for_5125
C - - - - - 0x001B83 00:9B73: 60        RTS



sub_0x001B84_запись_вторых_двух_банков_спрайтов:
C - - - - - 0x001B84 00:9B74: 86 A0     STX ram_for_5126
C - - - - - 0x001B86 00:9B76: 84 A1     STY ram_for_5127
C - - - - - 0x001B8E 00:9B7E: 60        RTS



sub_0x001B8F_очистить_обе_памяти_спрайтов:
sub_9B7F_очистить_обе_памяти_спрайтов:
loc_9B7F_очистить_обе_памяти_спрайтов:
; bzk optimize, очищать оба диапазона одновременно, а не в разных циклах
C D 0 - - - 0x001B8F 00:9B7F: A2 00     LDX #$00
C - - - - - 0x001B91 00:9B81: A9 F8     LDA #$F8
bra_9B83_loop:
C - - - - - 0x001B93 00:9B83: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x001B96 00:9B86: E8        INX
C - - - - - 0x001B97 00:9B87: D0 FA     BNE bra_9B83_loop
; X = 00
C - - - - - 0x001B99 00:9B89: A9 F8     LDA #$F8
bra_9B8B_loop:
C - - - - - 0x001B9B 00:9B8B: 9D 00 02  STA ram_spr_Y,X
C - - - - - 0x001B9E 00:9B8E: E8        INX
C - - - - - 0x001B9F 00:9B8F: D0 FA     BNE bra_9B8B_loop
sub_0x001BA1_очистить_0568_0588_05A8_05C8:
C - - - - - 0x001BA1 00:9B91: A9 00     LDA #$00
C - - - - - 0x001BA3 00:9B93: 8D 68 05  STA ram_0568
C - - - - - 0x001BA6 00:9B96: 8D 88 05  STA ram_0588
C - - - - - 0x001BA9 00:9B99: 8D A8 05  STA ram_05A8
C - - - - - 0x001BAC 00:9B9C: 8D C8 05  STA ram_05C8
C - - - - - 0x001BAF 00:9B9F: 60        RTS



sub_9BA0:
sub_0x001BB0:
C - - - - - 0x001BB0 00:9BA0: 20 F0 99  JSR sub_99F0_выход_из_экрана
C - - - - - 0x001BB3 00:9BA3: 20 A0 98  JSR sub_98A0_очистка_двух_nametable
C - - - - - 0x001BB6 00:9BA6: 4C 7F 9B  JMP loc_9B7F_очистить_обе_памяти_спрайтов



sub_9BA9:
C - - - - - 0x001BB9 00:9BA9: 85 46     STA ram_0046
C - - - - - 0x001BBB 00:9BAB: A8        TAY
C - - - - - 0x001BBC 00:9BAC: 30 0E     BMI bra_9BBC
C - - - - - 0x001BBE 00:9BAE: 18        CLC
C - - - - - 0x001BBF 00:9BAF: 65 44     ADC ram_0044
C - - - - - 0x001BC1 00:9BB1: C9 F0     CMP #$F0
C - - - - - 0x001BC3 00:9BB3: 90 04     BCC bra_9BB9
; C = 1
C - - - - - 0x001BC5 00:9BB5: 69 0F     ADC #$0F
C - - - - - 0x001BC7 00:9BB7: E6 45     INC ram_0045
bra_9BB9:
C - - - - - 0x001BC9 00:9BB9: 85 44     STA ram_0044
C - - - - - 0x001BCB 00:9BBB: 60        RTS
bra_9BBC:
C - - - - - 0x001BCC 00:9BBC: 18        CLC
C - - - - - 0x001BCD 00:9BBD: 65 44     ADC ram_0044
C - - - - - 0x001BCF 00:9BBF: C9 F0     CMP #$F0
C - - - - - 0x001BD1 00:9BC1: 90 04     BCC bra_9BC7
; C = 1
C - - - - - 0x001BD3 00:9BC3: E9 10     SBC #$10
C - - - - - 0x001BD5 00:9BC5: C6 45     DEC ram_0045
bra_9BC7:
C - - - - - 0x001BD7 00:9BC7: 85 44     STA ram_0044
C - - - - - 0x001BD9 00:9BC9: 60        RTS



sub_9BCA:
C - - - - - 0x001BDA 00:9BCA: 85 47     STA ram_0047
C - - - - - 0x001BDC 00:9BCC: 48        PHA
C - - - - - 0x001BDD 00:9BCD: 18        CLC
C - - - - - 0x001BDE 00:9BCE: 65 7A     ADC ram_007A
C - - - - - 0x001BE0 00:9BD0: 85 7A     STA ram_007A
C - - - - - 0x001BE2 00:9BD2: 68        PLA
C - - - - - 0x001BE3 00:9BD3: 30 07     BMI bra_9BDC
C - - - - - 0x001BE5 00:9BD5: A5 7B     LDA ram_007B
C - - - - - 0x001BE7 00:9BD7: 69 00     ADC #$00
C - - - - - 0x001BE9 00:9BD9: 4C E0 9B  JMP loc_9BE0
bra_9BDC:
C - - - - - 0x001BEC 00:9BDC: A5 7B     LDA ram_007B
C - - - - - 0x001BEE 00:9BDE: E9 00     SBC #$00
loc_9BE0:
C D 0 - - - 0x001BF0 00:9BE0: 85 7B     STA ram_007B
C - - - - - 0x001BF2 00:9BE2: 60        RTS



sub_0x001BF3:
; bzk optimize, на вход подаются одинаковые AXY
C - - - - - 0x001BF3 00:9BE3: 86 E7     STX ram_00E7
C - - - - - 0x001BF5 00:9BE5: 84 E6     STY ram_00E6
C - - - - - 0x001BF7 00:9BE7: A8        TAY
sub_0x001BF8:
bra_9BE8_кнопка_не_нажата:
C - - - - - 0x001BF8 00:9BE8: A9 01     LDA #$01
C - - - - - 0x001BFA 00:9BEA: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001BFD 00:9BED: A5 1E     LDA ram_btn_press
C - - - - - 0x001BFF 00:9BEF: 20 E7 9C  JSR sub_9CE7_сдвинуть_курсор_вверх_вниз
C - - - - - 0x001C02 00:9BF2: A5 1E     LDA ram_btn_press
C - - - - - 0x001C04 00:9BF4: 29 90     AND #con_btn_A + con_btn_Start
C - - - - - 0x001C06 00:9BF6: 10 F0     BPL bra_9BE8_кнопка_не_нажата
bra_9BF8_кнопка_нажата:
C - - - - - 0x001C08 00:9BF8: B9 68 04  LDA ram_copy_spr_Y,Y
C - - - - - 0x001C0B 00:9BFB: AA        TAX
C - - - - - 0x001C0C 00:9BFC: 38        SEC
C - - - - - 0x001C0D 00:9BFD: E5 E7     SBC ram_00E7
C - - - - - 0x001C0F 00:9BFF: 4A        LSR
C - - - - - 0x001C10 00:9C00: 4A        LSR
C - - - - - 0x001C11 00:9C01: 4A        LSR
C - - - - - 0x001C12 00:9C02: 85 E7     STA ram_00E7
C - - - - - 0x001C14 00:9C04: A9 F8     LDA #$F8
C - - - - - 0x001C16 00:9C06: 99 68 04  STA ram_copy_spr_Y,Y
C - - - - - 0x001C19 00:9C09: A5 E7     LDA ram_00E7
C - - - - - 0x001C1B 00:9C0B: 18        CLC
C - - - - - 0x001C1C 00:9C0C: 60        RTS



sub_0x001C1D_скрыть_курсор_после_выбора_опции:
bra_9C0D_B_не_нажата:
C - - - - - 0x001C1D 00:9C0D: A9 01     LDA #$01
C - - - - - 0x001C1F 00:9C0F: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001C22 00:9C12: A5 1E     LDA ram_btn_press
C - - - - - 0x001C24 00:9C14: 20 E7 9C  JSR sub_9CE7_сдвинуть_курсор_вверх_вниз
C - - - - - 0x001C27 00:9C17: A5 1E     LDA ram_btn_press
; bzk bug? тут проверяется на кнопку старт, это опции defense
; однако для опции formation старт не предусмотрена
C - - - - - 0x001C29 00:9C19: 29 90     AND #con_btn_A + con_btn_Start
C - - - - - 0x001C2B 00:9C1B: D0 DB     BNE bra_9BF8_кнопка_нажата
C - - - - - 0x001C2D 00:9C1D: 24 1E     BIT ram_btn_press
; con_btn_B
C - - - - - 0x001C2F 00:9C1F: 50 EC     BVC bra_9C0D_B_не_нажата
C - - - - - 0x001C31 00:9C21: A9 F8     LDA #$F8
C - - - - - 0x001C33 00:9C23: 99 68 04  STA ram_copy_spr_Y,Y
C - - - - - 0x001C36 00:9C26: 38        SEC
C - - - - - 0x001C37 00:9C27: 60        RTS



loc_0x001C38_непрямой_прыжок:
; A = 00 02 04 06 08 
C D 0 - - - 0x001C38 00:9C28: 84 E6     STY ram_00E6
C - - - - - 0x001C3A 00:9C2A: 86 E7     STX ram_00E7
C - - - - - 0x001C3C 00:9C2C: A8        TAY
C - - - - - 0x001C3D 00:9C2D: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C3F 00:9C2F: AA        TAX
C - - - - - 0x001C40 00:9C30: C8        INY
C - - - - - 0x001C41 00:9C31: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C43 00:9C33: 85 E7     STA ram_00E7
C - - - - - 0x001C45 00:9C35: 86 E6     STX ram_00E6
C - - - - - 0x001C47 00:9C37: 6C E6 00  JMP (ram_00E6)



sub_0x001C4A_отобразить_курсор:
C - - - - - 0x001C4A 00:9C3A: A9 00     LDA #$00
sub_0x001C4C_отобразить_курсор_со_смещением:
C - - - - - 0x001C4C 00:9C3C: 85 E9     STA ram_00E9
C - - - - - 0x001C4E 00:9C3E: 84 E6     STY ram_00E6
C - - - - - 0x001C50 00:9C40: 86 E7     STX ram_00E7
C - - - - - 0x001C52 00:9C42: A0 00     LDY #$00
C - - - - - 0x001C54 00:9C44: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C56 00:9C46: AA        TAX
C - - - - - 0x001C57 00:9C47: C8        INY
C - - - - - 0x001C58 00:9C48: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C5A 00:9C4A: 85 E8     STA ram_00E8
C - - - - - 0x001C5C 00:9C4C: C5 E9     CMP ram_00E9
C - - - - - 0x001C5E 00:9C4E: D0 03     BNE bra_9C53
C - - - - - 0x001C60 00:9C50: 18        CLC
C - - - - - 0x001C61 00:9C51: 69 10     ADC #$10
bra_9C53:
C - - - - - 0x001C63 00:9C53: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x001C66 00:9C56: E8        INX
C - - - - - 0x001C67 00:9C57: C8        INY
bra_9C58_loop:
C - - - - - 0x001C68 00:9C58: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C6A 00:9C5A: 9D 68 04  STA ram_copy_spr_Y,X
C - - - - - 0x001C6D 00:9C5D: E8        INX
C - - - - - 0x001C6E 00:9C5E: C8        INY
C - - - - - 0x001C6F 00:9C5F: C0 05     CPY #$05
C - - - - - 0x001C71 00:9C61: D0 F5     BNE bra_9C58_loop
C - - - - - 0x001C73 00:9C63: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001C75 00:9C65: 85 E6     STA ram_00E6
C - - - - - 0x001C77 00:9C67: 8A        TXA
C - - - - - 0x001C78 00:9C68: 38        SEC
C - - - - - 0x001C79 00:9C69: E9 04     SBC #$04
C - - - - - 0x001C7B 00:9C6B: A8        TAY
C - - - - - 0x001C7C 00:9C6C: A5 E8     LDA ram_00E8
C - - - - - 0x001C7E 00:9C6E: 85 E7     STA ram_00E7
C - - - - - 0x001C80 00:9C70: 60        RTS



sub_9C71_поиск_забаненых_игроков:
sub_0x001C81_поиск_забаненых_игроков:
C - - - - - 0x001C81 00:9C71: A9 10     LDA #$10
loc_9C73_loop:
C D 0 - - - 0x001C83 00:9C73: 85 E8     STA ram_00E8
bra_9C75_loop:
C - - - - - 0x001C85 00:9C75: A5 1C     LDA ram_btn_hold
C - - - - - 0x001C87 00:9C77: 20 E7 9C  JSR sub_9CE7_сдвинуть_курсор_вверх_вниз
C - - - - - 0x001C8A 00:9C7A: 90 4C     BCC bra_9CC8_RTS
C - - - - - 0x001C8C 00:9C7C: A6 E9     LDX ram_00E9
C - - - - - 0x001C8E 00:9C7E: E0 FF     CPX #$FF
C - - - - - 0x001C90 00:9C80: F0 07     BEQ bra_9C89
C - - - - - 0x001C92 00:9C82: C5 E9     CMP ram_00E9
C - - - - - 0x001C94 00:9C84: F0 EF     BEQ bra_9C75_loop
C - - - - - 0x001C96 00:9C86: 4C B3 9C  JMP loc_9CB3
bra_9C89:
C - - - - - 0x001C99 00:9C89: C5 EB     CMP ram_00EB
C - - - - - 0x001C9B 00:9C8B: F0 E8     BEQ bra_9C75_loop
C - - - - - 0x001C9D 00:9C8D: AD 5C 05  LDA ram_055C
C - - - - - 0x001CA0 00:9C90: C9 B8     CMP #$B8
C - - - - - 0x001CA2 00:9C92: 90 03     BCC bra_9C97
; C = 1, bzk optimize
C - - - - - 0x001CA4 00:9C94: 38        SEC
C - - - - - 0x001CA5 00:9C95: E9 10     SBC #$10
bra_9C97:
C - - - - - 0x001CA7 00:9C97: A8        TAY
C - - - - - 0x001CA8 00:9C98: AE 5F 05  LDX ram_055F
C - - - - - 0x001CAB 00:9C9B: 20 08 9D  JSR sub_9D08
C - - - - - 0x001CAE 00:9C9E: A0 00     LDY #con_plr_id
C - - - - - 0x001CB0 00:9CA0: B1 34     LDA (ram_plr_data),Y    ; con_plr_id
C - - - - - 0x001CB2 00:9CA2: A0 F4     LDY #$F4
C - - - - - 0x001CB4 00:9CA4: CD 51 04  CMP ram_забаненный_игрок
C - - - - - 0x001CB7 00:9CA7: F0 CC     BEQ bra_9C75_loop
C - - - - - 0x001CB9 00:9CA9: CD 52 04  CMP ram_забаненный_игрок + $01
C - - - - - 0x001CBC 00:9CAC: F0 C7     BEQ bra_9C75_loop
C - - - - - 0x001CBE 00:9CAE: CD 53 04  CMP ram_забаненный_игрок + $02
C - - - - - 0x001CC1 00:9CB1: F0 C2     BEQ bra_9C75_loop
loc_9CB3:
bra_9CB3_loop:
C D 0 - - - 0x001CC3 00:9CB3: A9 01     LDA #$01
C - - - - - 0x001CC5 00:9CB5: 20 A8 9F  JSR sub_9FA8_задержка_кадра
C - - - - - 0x001CC8 00:9CB8: A6 1C     LDX ram_btn_hold
; bzk bug, раскомментировать фикс
                                       ;AND #con_btns_Dpad
C - - - - - 0x001CCA 00:9CBA: BD E2 9E  LDA tbl_9EE2_кнопка_вверх_или_вниз,X
C - - - - - 0x001CCD 00:9CBD: F0 09     BEQ bra_9CC8_RTS
C - - - - - 0x001CCF 00:9CBF: C6 E8     DEC ram_00E8
C - - - - - 0x001CD1 00:9CC1: D0 F0     BNE bra_9CB3_loop
C - - - - - 0x001CD3 00:9CC3: A9 08     LDA #$08
C - - - - - 0x001CD5 00:9CC5: 4C 73 9C  JMP loc_9C73_loop
bra_9CC8_RTS:
C - - - - - 0x001CD8 00:9CC8: 60        RTS



sub_0x001CD9:
C - - - - - 0x001CD9 00:9CC9: A9 00     LDA #$00
C - - - - - 0x001CDB 00:9CCB: 20 D3 9C  JSR sub_9CD3
C - - - - - 0x001CDE 00:9CCE: 20 71 9C  JSR sub_9C71_поиск_забаненых_игроков
C - - - - - 0x001CE1 00:9CD1: A9 02     LDA #$02
sub_9CD3:
sub_0x001CE3:
C - - - - - 0x001CE3 00:9CD3: BE 6B 04  LDX ram_copy_spr_X,Y
C - - - - - 0x001CE6 00:9CD6: 30 0E     BMI bra_9CE6_RTS
C - - - - - 0x001CE8 00:9CD8: 48        PHA
C - - - - - 0x001CE9 00:9CD9: B9 68 04  LDA ram_copy_spr_Y,Y
C - - - - - 0x001CEC 00:9CDC: 38        SEC
C - - - - - 0x001CED 00:9CDD: E5 E7     SBC ram_00E7
C - - - - - 0x001CEF 00:9CDF: 4A        LSR
C - - - - - 0x001CF0 00:9CE0: 4A        LSR
C - - - - - 0x001CF1 00:9CE1: AA        TAX
C - - - - - 0x001CF2 00:9CE2: 68        PLA
C - - - - - 0x001CF3 00:9CE3: 9D 6A 04  STA ram_copy_spr_A,X
bra_9CE6_RTS:
C - - - - - 0x001CF6 00:9CE6: 60        RTS



sub_9CE7_сдвинуть_курсор_вверх_вниз:
.scope
tmp_max_Y = ram_00E6
tmp_min_Y = ram_00E7
C - - - - - 0x001CF7 00:9CE7: 29 0F     AND #con_btns_Dpad
C - - - - - 0x001CF9 00:9CE9: AA        TAX
C - - - - - 0x001CFA 00:9CEA: BD E2 9E  LDA tbl_9EE2_кнопка_вверх_или_вниз,X
C - - - - - 0x001CFD 00:9CED: F0 17     BEQ bra_9D06_нужная_кнопка_не_нажата
C - - - - - 0x001CFF 00:9CEF: 18        CLC
C - - - - - 0x001D00 00:9CF0: 79 68 04  ADC ram_copy_spr_Y,Y
C - - - - - 0x001D03 00:9CF3: C5 E7     CMP tmp_min_Y
C - - - - - 0x001D05 00:9CF5: B0 02     BCS bra_9CF9
C - - - - - 0x001D07 00:9CF7: A5 E6     LDA tmp_max_Y
bra_9CF9:
C - - - - - 0x001D09 00:9CF9: C5 E6     CMP tmp_max_Y
C - - - - - 0x001D0B 00:9CFB: F0 04     BEQ bra_9D01
C - - - - - 0x001D0D 00:9CFD: 90 02     BCC bra_9D01
C - - - - - 0x001D0F 00:9CFF: A5 E7     LDA tmp_min_Y
bra_9D01:
C - - - - - 0x001D11 00:9D01: 99 68 04  STA ram_copy_spr_Y,Y
C - - - - - 0x001D14 00:9D04: 38        SEC
C - - - - - 0x001D15 00:9D05: 60        RTS
bra_9D06_нужная_кнопка_не_нажата:
C - - - - - 0x001D16 00:9D06: 18        CLC
C - - - - - 0x001D17 00:9D07: 60        RTS
.endscope



sub_9D08:
sub_0x001D18:
C - - - - - 0x001D18 00:9D08: 8A        TXA
C - - - - - 0x001D19 00:9D09: 30 0F     BMI bra_9D1A
C - - - - - 0x001D1B 00:9D0B: 98        TYA
C - - - - - 0x001D1C 00:9D0C: 49 FF     EOR #$FF
C - - - - - 0x001D1E 00:9D0E: 38        SEC
C - - - - - 0x001D1F 00:9D0F: E9 28     SBC #$28
C - - - - - 0x001D21 00:9D11: 4A        LSR
C - - - - - 0x001D22 00:9D12: 4A        LSR
C - - - - - 0x001D23 00:9D13: 4A        LSR
C - - - - - 0x001D24 00:9D14: 4A        LSR
C - - - - - 0x001D25 00:9D15: 85 ED     STA ram_00ED
C - - - - - 0x001D27 00:9D17: 4C 0C C5  JMP loc_0x03CD8C_получить_адрес_игрока
bra_9D1A:
C - - - - - 0x001D2A 00:9D1A: 98        TYA
C - - - - - 0x001D2B 00:9D1B: 4A        LSR
C - - - - - 0x001D2C 00:9D1C: 4A        LSR
C - - - - - 0x001D2D 00:9D1D: 4A        LSR
C - - - - - 0x001D2E 00:9D1E: 4A        LSR
C - - - - - 0x001D2F 00:9D1F: 18        CLC
C - - - - - 0x001D30 00:9D20: 69 14     ADC #$14
C - - - - - 0x001D32 00:9D22: 85 ED     STA ram_00ED
C - - - - - 0x001D34 00:9D24: 4C 0C C5  JMP loc_0x03CD8C_получить_адрес_игрока



sub_0x001D37_запись_в_буфер:
; первый и второй байты indirect - адрес ppu
; затем байты для чтения
; в конце ставится FD для продолжения чтения, либо FF для завершения
; адрес ppu смещается вниз на #20
C - - - - - 0x001D37 00:9D27: 84 E6     STY ram_00E6
C - - - - - 0x001D39 00:9D29: 86 E7     STX ram_00E7
bra_9D2B_loop:
C - - - - - 0x001D3B 00:9D2B: A0 00     LDY #$00
C - - - - - 0x001D3D 00:9D2D: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001D3F 00:9D2F: 85 E8     STA ram_00E8
C - - - - - 0x001D41 00:9D31: C8        INY
C - - - - - 0x001D42 00:9D32: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001D44 00:9D34: 85 E9     STA ram_00E9
C - - - - - 0x001D46 00:9D36: 84 EB     STY ram_00EB
C - - - - - 0x001D48 00:9D38: 20 58 9D  JSR sub_9D58
C - - - - - 0x001D4B 00:9D3B: AA        TAX
C - - - - - 0x001D4C 00:9D3C: E6 EB     INC ram_00EB
C - - - - - 0x001D4E 00:9D3E: A5 EB     LDA ram_00EB
C - - - - - 0x001D50 00:9D40: 18        CLC
C - - - - - 0x001D51 00:9D41: 65 E6     ADC ram_00E6
C - - - - - 0x001D53 00:9D43: 85 E6     STA ram_00E6
C - - - - - 0x001D55 00:9D45: A5 E7     LDA ram_00E7
C - - - - - 0x001D57 00:9D47: 69 00     ADC #$00
C - - - - - 0x001D59 00:9D49: 85 E7     STA ram_00E7
C - - - - - 0x001D5B 00:9D4B: E0 FF     CPX #$FF
C - - - - - 0x001D5D 00:9D4D: D0 DC     BNE bra_9D2B_loop
C - - - - - 0x001D5F 00:9D4F: 60        RTS



sub_0x001D60_запись_имени_в_буфер:
C D 0 - - - 0x001D60 00:9D50: 84 E6     STY ram_00E6
C - - - - - 0x001D62 00:9D52: 86 E7     STX ram_00E7
C - - - - - 0x001D64 00:9D54: A9 FF     LDA #$FF
C - - - - - 0x001D66 00:9D56: 85 EB     STA ram_00EB
sub_9D58:
loc_9D58_loop:
C D 0 - - - 0x001D68 00:9D58: E6 EB     INC ram_00EB
C - - - - - 0x001D6A 00:9D5A: A4 EB     LDY ram_00EB
C - - - - - 0x001D6C 00:9D5C: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001D6E 00:9D5E: C9 FC     CMP #$FC
C - - - - - 0x001D70 00:9D60: B0 10     BCS bra_9D72_RTS
C - - - - - 0x001D72 00:9D62: A4 E8     LDY ram_00E8
C - - - - - 0x001D74 00:9D64: A6 E9     LDX ram_00E9
C - - - - - 0x001D76 00:9D66: 20 CA 88  JSR sub_88CA_запись_символа_в_буфер
C - - - - - 0x001D79 00:9D69: E6 E8     INC ram_00E8
C - - - - - 0x001D7B 00:9D6B: D0 02     BNE bra_9D6F_пропустить
- - - - - - 0x001D7D 00:9D6D: E6 E9     INC ram_00E9
bra_9D6F_пропустить:
C - - - - - 0x001D7F 00:9D6F: 4C 58 9D  JMP loc_9D58_loop
bra_9D72_RTS:
C - - - - - 0x001D82 00:9D72: 60        RTS



sub_0x001D83:
C - - - - - 0x001D83 00:9D73: 85 E8     STA ram_00E8
C - - - - - 0x001D85 00:9D75: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x001D88 00:9D78: A5 E8     LDA ram_00E8
C - - - - - 0x001D8A 00:9D7A: 29 3F     AND #$3F
C - - - - - 0x001D8C 00:9D7C: 85 E8     STA ram_00E8
C - - - - - 0x001D8E 00:9D7E: A0 00     LDY #$00
bra_9D80_loop:
C - - - - - 0x001D90 00:9D80: B1 E6     LDA (ram_00E6),Y
C - - - - - 0x001D92 00:9D82: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001D95 00:9D85: C8        INY
C - - - - - 0x001D96 00:9D86: E8        INX
C - - - - - 0x001D97 00:9D87: C6 E8     DEC ram_00E8
C - - - - - 0x001D99 00:9D89: D0 F5     BNE bra_9D80_loop
C - - - - - 0x001D9B 00:9D8B: 4C 5E 9B  JMP loc_9B5E_закрыть_буфер



sub_0x001D9E_запись_в_буфер_уровня_игрока:
C - - - - - 0x001D9E 00:9D8E: 85 EC     STA ram_00EC
C - - - - - 0x001DA0 00:9D90: A9 02     LDA #$02
C - - - - - 0x001DA2 00:9D92: 20 28 9B  JSR sub_9B28_подготовить_буфер
C - - - - - 0x001DA5 00:9D95: A5 EC     LDA ram_00EC
C - - - - - 0x001DA7 00:9D97: 4A        LSR
C - - - - - 0x001DA8 00:9D98: 4A        LSR
C - - - - - 0x001DA9 00:9D99: 4A        LSR
C - - - - - 0x001DAA 00:9D9A: 4A        LSR
C - - - - - 0x001DAB 00:9D9B: D0 02     BNE bra_9D9F_десятки_есть
; иначе D0 + 30 = тайл 00
C - - - - - 0x001DAD 00:9D9D: A9 CD     LDA #$D0
bra_9D9F_десятки_есть:
C - - - - - 0x001DAF 00:9D9F: 18        CLC
C - - - - - 0x001DB0 00:9DA0: 69 33     ADC #$30
C - - - - - 0x001DB2 00:9DA2: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001DB5 00:9DA5: E8        INX
C - - - - - 0x001DB6 00:9DA6: A5 EC     LDA ram_00EC
C - - - - - 0x001DB8 00:9DA8: 29 0F     AND #$0F
C - - - - - 0x001DBA 00:9DAA: 18        CLC
C - - - - - 0x001DBB 00:9DAB: 69 33     ADC #$30
C - - - - - 0x001DBD 00:9DAD: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001DC0 00:9DB0: E8        INX
C - - - - - 0x001DC1 00:9DB1: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x001DC4 00:9DB4: 60        RTS



sub_0x001DC5_запись_чисел_в_буфер:
; 00EC - десятки и единицы
; 00ED - сотни и тысячи
C - - - - - 0x001DC5 00:9DB5: A9 04     LDA #$03
C - - - - - 0x001DC7 00:9DB7: 20 28 9B  JSR sub_9B28_подготовить_буфер
; тайл, который следует записать если разряд числа = 0
C - - - - - 0x001DCA 00:9DBA: A9 00     LDA #$00
C - - - - - 0x001DCC 00:9DBC: 85 E7     STA ram_00E7
C - - - - - 0x001DD3 00:9DC3: A5 ED     LDA ram_00ED
C - - - - - 0x001DD5 00:9DC5: 20 DE 9D  JSR sub_9DDE_единицы
C - - - - - 0x001DD8 00:9DC8: A5 EC     LDA ram_00EC
C - - - - - 0x001DDA 00:9DCA: 20 DA 9D  JSR sub_9DDA_десятки
; корректировка номера тайла для цифры единиц
C - - - - - 0x001DDD 00:9DCD: A9 33     LDA #$30
C - - - - - 0x001DDF 00:9DCF: 85 E7     STA ram_00E7
C - - - - - 0x001DE1 00:9DD1: A5 EC     LDA ram_00EC
C - - - - - 0x001DE3 00:9DD3: 20 DE 9D  JSR sub_9DDE_единицы
C - - - - - 0x001DE6 00:9DD6: 20 5E 9B  JSR sub_9B5E_закрыть_буфер
C - - - - - 0x001DE9 00:9DD9: 60        RTS



sub_9DDA_десятки:
C - - - - - 0x001DEA 00:9DDA: 4A        LSR
C - - - - - 0x001DEB 00:9DDB: 4A        LSR
C - - - - - 0x001DEC 00:9DDC: 4A        LSR
C - - - - - 0x001DED 00:9DDD: 4A        LSR
sub_9DDE_единицы:
C - - - - - 0x001DEE 00:9DDE: 29 0F     AND #$0F
C - - - - - 0x001DF0 00:9DE0: F0 04     BEQ bra_9DE6
; корректировка номера тайла для десятков и сотен
C - - - - - 0x001DF2 00:9DE2: A0 33     LDY #$30
C - - - - - 0x001DF4 00:9DE4: 84 E7     STY ram_00E7
bra_9DE6:
C - - - - - 0x001DF6 00:9DE6: 18        CLC
C - - - - - 0x001DF7 00:9DE7: 65 E7     ADC ram_00E7
C - - - - - 0x001DF9 00:9DE9: 9D E8 05  STA ram_05E8,X
C - - - - - 0x001DFC 00:9DEC: E8        INX
C - - - - - 0x001DFD 00:9DED: 60        RTS



sub_0x001DFE_умножить_A_на_X:
sub_9DEE_умножить_A_на_X:
; 00EC = lo
; 00ED = hi
    STA $5205
    STX $5206
    LDA $5205
    STA ram_00EC
    LDA $5206
    STA ram_00ED
    RTS



sub_9E0C:
sub_0x001E1C:
C - - - - - 0x001E1C 00:9E0C: A9 00     LDA #$00
C - - - - - 0x001E1E 00:9E0E: 85 E8     STA ram_00E8
C - - - - - 0x001E20 00:9E10: 85 E9     STA ram_00E9
C - - - - - 0x001E22 00:9E12: A2 10     LDX #$10
bra_9E14_loop:
C - - - - - 0x001E24 00:9E14: 06 EC     ASL ram_00EC
C - - - - - 0x001E26 00:9E16: 26 ED     ROL ram_00ED
C - - - - - 0x001E28 00:9E18: 26 E8     ROL ram_00E8
C - - - - - 0x001E2A 00:9E1A: 26 E9     ROL ram_00E9
C - - - - - 0x001E2C 00:9E1C: A5 E8     LDA ram_00E8
C - - - - - 0x001E2E 00:9E1E: 38        SEC
C - - - - - 0x001E2F 00:9E1F: E5 EA     SBC ram_00EA
C - - - - - 0x001E31 00:9E21: A8        TAY
C - - - - - 0x001E32 00:9E22: A5 E9     LDA ram_00E9
C - - - - - 0x001E34 00:9E24: E5 EB     SBC ram_00EB
C - - - - - 0x001E36 00:9E26: 90 0A     BCC bra_9E32
C - - - - - 0x001E38 00:9E28: 85 E9     STA ram_00E9
C - - - - - 0x001E3A 00:9E2A: 84 E8     STY ram_00E8
C - - - - - 0x001E3C 00:9E2C: E6 EC     INC ram_00EC
C - - - - - 0x001E3E 00:9E2E: D0 02     BNE bra_9E32
- - - - - - 0x001E40 00:9E30: E6 ED     INC ram_00ED
bra_9E32:
C - - - - - 0x001E42 00:9E32: CA        DEX
C - - - - - 0x001E43 00:9E33: D0 DF     BNE bra_9E14_loop
C - - - - - 0x001E45 00:9E35: 60        RTS



sub_0x001E5F:
C - - - - - 0x001E5F 00:9E4F: A9 0A     LDA #$0A
C - - - - - 0x001E61 00:9E51: 85 EA     STA ram_00EA
C - - - - - 0x001E63 00:9E53: A9 00     LDA #$00
C - - - - - 0x001E65 00:9E55: 85 EB     STA ram_00EB
C - - - - - 0x001E67 00:9E57: A9 03     LDA #$03
C - - - - - 0x001E69 00:9E59: 85 E6     STA ram_00E6
bra_9E5B_loop:
C - - - - - 0x001E6B 00:9E5B: 20 0C 9E  JSR sub_9E0C
C - - - - - 0x001E6E 00:9E5E: A5 E8     LDA ram_00E8
C - - - - - 0x001E70 00:9E60: 85 E7     STA ram_00E7
C - - - - - 0x001E72 00:9E62: 20 0C 9E  JSR sub_9E0C
C - - - - - 0x001E75 00:9E65: A5 E8     LDA ram_00E8
C - - - - - 0x001E77 00:9E67: 0A        ASL
C - - - - - 0x001E78 00:9E68: 0A        ASL
C - - - - - 0x001E79 00:9E69: 0A        ASL
C - - - - - 0x001E7A 00:9E6A: 0A        ASL
C - - - - - 0x001E7B 00:9E6B: 05 E7     ORA ram_00E7
C - - - - - 0x001E7D 00:9E6D: 48        PHA
C - - - - - 0x001E7E 00:9E6E: C6 E6     DEC ram_00E6
C - - - - - 0x001E80 00:9E70: D0 E9     BNE bra_9E5B_loop
C - - - - - 0x001E82 00:9E72: 68        PLA
C - - - - - 0x001E83 00:9E73: 85 EA     STA ram_00EA
C - - - - - 0x001E85 00:9E75: 68        PLA
C - - - - - 0x001E86 00:9E76: 85 E9     STA ram_00E9
C - - - - - 0x001E88 00:9E78: 68        PLA
C - - - - - 0x001E89 00:9E79: 85 E8     STA ram_00E8
C - - - - - 0x001E8B 00:9E7B: 60        RTS



sub_0x001E8C_перевод_из_HEX_в_DEC:
; на вход в A подается байт, который нужно перевести в DEC
; на выходе DEC число будет храниться в 00ED (сотни) и 00EC (десятки + единицы)
                                        STA ram_00ED
                                        LDA #$0A
                                        STA ram_00EC
                                        JSR sub_9E36_конвертация
                                        LDA ram_00EA
                                        STA ram_00EB
                                        JSR sub_9E36_конвертация
                                        LDA ram_00EA
                                        ASL
                                        ASL
                                        ASL
                                        ASL
                                        ORA ram_00EB
                                        STA ram_00EB
                                        JSR sub_9E36_конвертация
                                        LDA ram_00EA
                                        STA ram_00ED
                                        LDA ram_00EB
                                        STA ram_00EC
                                        RTS



sub_9E36_конвертация:
                                        LDA #$00
                                        STA ram_00EA
                                        LDX #$08
bra_9E3C_loop:
                                        ASL ram_00ED
                                        ROL ram_00EA
                                        LDA ram_00EA
                                        SEC
                                        SBC ram_00EC
                                        BCC bra_9E4B
                                        STA ram_00EA
                                        INC ram_00ED
bra_9E4B:
                                        DEX
                                        BNE bra_9E3C_loop
                                        RTS



tbl_9EA2_яркость_цвета:
;          00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
    .byte $0F, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00 ; 00
    .byte $0F, $00, $00, $00, $00, $00, $10, $10, $20, $20, $30, $30, $20, $20, $10, $10 ; 10
    .byte $0F, $00, $00, $00, $10, $10, $10, $20, $20, $20, $30, $30, $30, $20, $20, $20 ; 20
    .byte $0F, $00, $10, $10, $10, $20, $20, $30, $30, $30, $30, $30, $30, $30, $30, $30 ; 30



tbl_9EE2_кнопка_вверх_или_вниз:
    .byte $00   ; 00
    .byte $00   ; 01
    .byte $00   ; 02
    .byte $00   ; 03
    .byte $10   ; 04 down
    .byte $00   ; 05
    .byte $00   ; 06
    .byte $00   ; 07
    .byte $F0   ; 08 up
    .byte $00   ; 09
    .byte $00   ; 0A



loc_9EED:
loc_0x001EFD:
C D 0 - - - 0x001EFD 00:9EED: A2 01     LDX #$01
bra_9EEF_loop:
C - - - - - 0x001EFF 00:9EEF: B5 00     LDA ram_0000,X
C - - - - - 0x001F01 00:9EF1: F0 08     BEQ bra_9EFB
C - - - - - 0x001F03 00:9EF3: C9 FF     CMP #$FF
C - - - - - 0x001F05 00:9EF5: F0 5B     BEQ bra_9F52
C - - - - - 0x001F07 00:9EF7: D6 00     DEC ram_0000,X
C - - - - - 0x001F09 00:9EF9: F0 14     BEQ bra_9F0F
bra_9EFB:
loc_9EFB:
C D 0 - - - 0x001F0B 00:9EFB: 8A        TXA
C - - - - - 0x001F0C 00:9EFC: 18        CLC
C - - - - - 0x001F0D 00:9EFD: 69 04     ADC #$04
C - - - - - 0x001F0F 00:9EFF: AA        TAX
C - - - - - 0x001F10 00:9F00: E0 19     CPX #$19
C - - - - - 0x001F12 00:9F02: D0 EB     BNE bra_9EEF_loop
bra_9F04_infinite_loop:
C - - - - - 0x001F14 00:9F04: A5 1B     LDA ram_флаг_nmi
C - - - - - 0x001F16 00:9F06: 10 FC     BPL bra_9F04_infinite_loop
C - - - - - 0x001F18 00:9F08: 29 7F     AND #$7F
C - - - - - 0x001F1A 00:9F0A: 85 1B     STA ram_флаг_nmi
C - - - - - 0x001F1C 00:9F0C: 4C ED 9E  JMP loc_9EED
bra_9F0F:
C - - - - - 0x001F1F 00:9F0F: 86 00     STX ram_0000
C - - - - - 0x001F2A 00:9F1A: B5 03     LDA ram_0003,X
C - - - - - 0x001F2C 00:9F1C: 85 25     STA ram_for_5115
                                        ORA #$80
C - - - - - 0x001F2E 00:9F1E: 8D 01 80  STA $5115
C - - - - - 0x001F3A 00:9F2A: B5 02     LDA ram_0002,X
C - - - - - 0x001F3C 00:9F2C: 85 24     STA ram_for_5114
                                        ORA #$80
C - - - - - 0x001F3E 00:9F2E: 8D 01 80  STA $5114
C - - - - - 0x001F41 00:9F31: B5 01     LDA ram_0001,X
C - - - - - 0x001F43 00:9F33: AA        TAX
C - - - - - 0x001F44 00:9F34: 9A        TXS
C - - - - - 0x001F45 00:9F35: 68        PLA
C - - - - - 0x001F46 00:9F36: 85 E6     STA ram_00E6
C - - - - - 0x001F48 00:9F38: 68        PLA
C - - - - - 0x001F49 00:9F39: 85 E7     STA ram_00E7
C - - - - - 0x001F4B 00:9F3B: 68        PLA
C - - - - - 0x001F4C 00:9F3C: 85 E8     STA ram_00E8
C - - - - - 0x001F4E 00:9F3E: 68        PLA
C - - - - - 0x001F4F 00:9F3F: 85 E9     STA ram_00E9
C - - - - - 0x001F51 00:9F41: 68        PLA
C - - - - - 0x001F52 00:9F42: 85 EA     STA ram_00EA
C - - - - - 0x001F54 00:9F44: 68        PLA
C - - - - - 0x001F55 00:9F45: 85 EB     STA ram_00EB
C - - - - - 0x001F57 00:9F47: 68        PLA
C - - - - - 0x001F58 00:9F48: 85 EC     STA ram_00EC
C - - - - - 0x001F5A 00:9F4A: 68        PLA
C - - - - - 0x001F5B 00:9F4B: 85 ED     STA ram_00ED
C - - - - - 0x001F5D 00:9F4D: 68        PLA
C - - - - - 0x001F5E 00:9F4E: A8        TAY
C - - - - - 0x001F5F 00:9F4F: 68        PLA
C - - - - - 0x001F60 00:9F50: AA        TAX
C - - - - - 0x001F61 00:9F51: 60        RTS
bra_9F52:
C - - - - - 0x001F62 00:9F52: 86 00     STX ram_0000
C - - - - - 0x001F6D 00:9F5D: B5 02     LDA ram_0002,X
C - - - - - 0x001F6F 00:9F5F: 85 24     STA ram_for_5114
                                        ORA #$80
C - - - - - 0x001F71 00:9F61: 8D 01 80  STA $5114
C - - - - - 0x001F74 00:9F64: B5 01     LDA ram_0001,X
C D 0 - - - 0x001F76 00:9F66: AA        TAX
C - - - - - 0x001F77 00:9F67: 9A        TXS
C - - - - - 0x001F78 00:9F68: 60        RTS



sub_9F69:
sub_0x001F79:
                                        LDA #$00
C - - - - - 0x001F79 00:9F69: 95 02     STA ram_0002,X
C - - - - - 0x001F7D 00:9F6D: B5 00     LDA ram_0000,X
C - - - - - 0x001F7F 00:9F6F: 99 01 01  STA ram_stack + $01,Y
C - - - - - 0x001F82 00:9F72: B5 01     LDA ram_0001,X
C - - - - - 0x001F84 00:9F74: 99 02 01  STA ram_stack + $02,Y
C - - - - - 0x001F87 00:9F77: 94 01     STY ram_0001,X
C - - - - - 0x001F89 00:9F79: A9 FF     LDA #$FF
C - - - - - 0x001F8B 00:9F7B: 95 00     STA ram_0000,X
C - - - - - 0x001F8D 00:9F7D: 60        RTS



loc_9F7E_отключить_подпрограмму_в_стеке:
C D 0 - - - 0x001F8E 00:9F7E: A9 00     LDA #$00
C - - - - - 0x001F90 00:9F80: A6 00     LDX ram_0000
C - - - - - 0x001F92 00:9F82: 95 00     STA ram_0000,X
C - - - - - 0x001F94 00:9F84: 95 01     STA ram_0001,X
C - - - - - 0x001F96 00:9F86: 4C FB 9E  JMP loc_9EFB



sub_0x001F99:
C - - - - - 0x001F99 00:9F89: B5 01     LDA ram_0001,X
C - - - - - 0x001F9B 00:9F8B: F0 08     BEQ bra_9F95_RTS
C - - - - - 0x001F9D 00:9F8D: B5 00     LDA ram_0000,X
C - - - - - 0x001F9F 00:9F8F: D0 04     BNE bra_9F95_RTS
C - - - - - 0x001FA1 00:9F91: A9 01     LDA #$01
C - - - - - 0x001FA3 00:9F93: 95 00     STA ram_0000,X
bra_9F95_RTS:
C - - - - - 0x001FA5 00:9F95: 60        RTS



sub_0x001FA6:
; bzk optimize, переместить в другой банк
C - - - - - 0x001FA6 00:9F96: B5 00     LDA ram_0000,X
C - - - - - 0x001FA8 00:9F98: C9 FF     CMP #$FF
C - - - - - 0x001FAA 00:9F9A: D0 05     BNE bra_9FA1
C - - - - - 0x001FAC 00:9F9C: A9 01     LDA #$01
C - - - - - 0x001FAE 00:9F9E: 20 A8 9F  JSR sub_9FA8_задержка_кадра
bra_9FA1:
C - - - - - 0x001FB1 00:9FA1: A9 00     LDA #$00
C - - - - - 0x001FB3 00:9FA3: 95 00     STA ram_0000,X
C - - - - - 0x001FB5 00:9FA5: 60        RTS



sub_9FA8_задержка_кадра:
sub_0x001FB8_задержка_кадра:
; а может и нет, пока хз
; на вход в A подается количество кадров
C - - - - - 0x001FB8 00:9FA8: 85 19     STA ram_0019
C - - - - - 0x001FBA 00:9FAA: 8A        TXA
C - - - - - 0x001FBB 00:9FAB: 48        PHA
C - - - - - 0x001FBC 00:9FAC: 98        TYA
C - - - - - 0x001FBD 00:9FAD: 48        PHA
C - - - - - 0x001FBE 00:9FAE: A5 ED     LDA ram_00ED
C - - - - - 0x001FC0 00:9FB0: 48        PHA
C - - - - - 0x001FC1 00:9FB1: A5 EC     LDA ram_00EC
C - - - - - 0x001FC3 00:9FB3: 48        PHA
C - - - - - 0x001FC4 00:9FB4: A5 EB     LDA ram_00EB
C - - - - - 0x001FC6 00:9FB6: 48        PHA
C - - - - - 0x001FC7 00:9FB7: A5 EA     LDA ram_00EA
C - - - - - 0x001FC9 00:9FB9: 48        PHA
C - - - - - 0x001FCA 00:9FBA: A5 E9     LDA ram_00E9
C - - - - - 0x001FCC 00:9FBC: 48        PHA
C - - - - - 0x001FCD 00:9FBD: A5 E8     LDA ram_00E8
C - - - - - 0x001FCF 00:9FBF: 48        PHA
C - - - - - 0x001FD0 00:9FC0: A5 E7     LDA ram_00E7
C - - - - - 0x001FD2 00:9FC2: 48        PHA
C - - - - - 0x001FD3 00:9FC3: A5 E6     LDA ram_00E6
C - - - - - 0x001FD5 00:9FC5: 48        PHA
C - - - - - 0x001FD6 00:9FC6: BA        TSX
C - - - - - 0x001FD7 00:9FC7: 8A        TXA
C - - - - - 0x001FD8 00:9FC8: A6 00     LDX ram_0000
C - - - - - 0x001FDA 00:9FCA: 95 01     STA ram_0001,X
C - - - - - 0x001FDC 00:9FCC: AD 24 00  LDA ram_for_5114
C - - - - - 0x001FDF 00:9FCF: 95 02     STA ram_0002,X
C - - - - - 0x001FE1 00:9FD1: AD 25 00  LDA ram_for_5115
C - - - - - 0x001FE4 00:9FD4: 95 03     STA ram_0003,X
C - - - - - 0x001FE6 00:9FD6: A5 19     LDA ram_0019
C - - - - - 0x001FE8 00:9FD8: F0 04     BEQ bra_9FDE
C - - - - - 0x001FEA 00:9FDA: C9 FF     CMP #$FF
C - - - - - 0x001FEC 00:9FDC: D0 02     BNE bra_9FE0
bra_9FDE:
C - - - - - 0x001FEE 00:9FDE: A9 FE     LDA #$FE
bra_9FE0:
C - - - - - 0x001FF0 00:9FE0: 95 00     STA ram_0000,X
C - - - - - 0x001FF2 00:9FE2: 4C FB 9E  JMP loc_9EFB



.out .sprintf("Free bytes in bank 00: 0x%04X [%d]", ($A000 - *), ($A000 - *))
