.segment "BANK_0B"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"



.export ofs_0x01601C
.export ofs_0x016093
.export ofs_0x01615C
.export sub_0x0164B1



loc_800C:
ofs_0x01601C:
C D - - - - 0x01601C 0B:800C: A9 01     LDA #$01
C - - - - - 0x01601E 0B:800E: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x016021 0B:8011: AD D4 05  LDA ram_05D4
C - - - - - 0x016024 0B:8014: 2C D7 05  BIT ram_05D7
C - - - - - 0x016027 0B:8017: 10 05     BPL bra_801E
C - - - - - 0x016029 0B:8019: 49 FF     EOR #$FF
C - - - - - 0x01602B 0B:801B: 18        CLC
C - - - - - 0x01602C 0B:801C: 69 11     ADC #$11
bra_801E:
C - - - - - 0x01602E 0B:801E: 29 E0     AND #$E0
C - - - - - 0x016030 0B:8020: CD D8 05  CMP ram_05D8
C - - - - - 0x016033 0B:8023: D0 03     BNE bra_8028
C - - - - - 0x016035 0B:8025: 4C 0C 80  JMP loc_800C
bra_8028:
C - - - - - 0x016038 0B:8028: 8D D8 05  STA ram_05D8
C - - - - - 0x01603B 0B:802B: 20 0C 81  JSR sub_810C
C - - - - - 0x01603E 0B:802E: A5 3B     LDA ram_003B
C - - - - - 0x016040 0B:8030: 29 FE     AND #$FE
C - - - - - 0x016042 0B:8032: 20 2B 81  JSR sub_812B
C - - - - - 0x016045 0B:8035: A9 E0     LDA #$E0
C - - - - - 0x016047 0B:8037: 2C D7 05  BIT ram_05D7
C - - - - - 0x01604A 0B:803A: 10 02     BPL bra_803E
C - - - - - 0x01604C 0B:803C: A9 A0     LDA #$A0
bra_803E:
C - - - - - 0x01604E 0B:803E: 18        CLC
C - - - - - 0x01604F 0B:803F: 6D D4 05  ADC ram_05D4
C - - - - - 0x016052 0B:8042: 29 E0     AND #$E0
C - - - - - 0x016054 0B:8044: 4A        LSR
C - - - - - 0x016055 0B:8045: 4A        LSR
C - - - - - 0x016056 0B:8046: 09 40     ORA #$40
C - - - - - 0x016058 0B:8048: 85 5A     STA ram_005A
C - - - - - 0x01605A 0B:804A: A9 04     LDA #$04
bra_804C_loop:
C - - - - - 0x01605C 0B:804C: 48        PHA
bra_804D_loop:
C - - - - - 0x01605D 0B:804D: A9 01     LDA #$01
C - - - - - 0x01605F 0B:804F: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x016062 0B:8052: AD 15 05  LDA ram_0515
C - - - - - 0x016065 0B:8055: D0 F6     BNE bra_804D_loop
C - - - - - 0x016067 0B:8057: A9 01     LDA #$01
C - - - - - 0x016069 0B:8059: 8D 15 05  STA ram_0515
C - - - - - 0x01606C 0B:805C: A2 00     LDX #$00
C - - - - - 0x01606E 0B:805E: A9 02     LDA #$02
bra_8060_loop:
C - - - - - 0x016070 0B:8060: 48        PHA
C - - - - - 0x016071 0B:8061: A5 5A     LDA ram_005A
C - - - - - 0x016073 0B:8063: 29 3F     AND #$3F
C - - - - - 0x016075 0B:8065: A8        TAY
C - - - - - 0x016076 0B:8066: B1 58     LDA (ram_0058),Y
C - - - - - 0x016078 0B:8068: A4 5A     LDY ram_005A
C - - - - - 0x01607A 0B:806A: 20 C2 85  JSR sub_85C2
C - - - - - 0x01607D 0B:806D: E6 5A     INC ram_005A
C - - - - - 0x01607F 0B:806F: 68        PLA
C - - - - - 0x016080 0B:8070: 38        SEC
C - - - - - 0x016081 0B:8071: E9 01     SBC #$01
C - - - - - 0x016083 0B:8073: D0 EB     BNE bra_8060_loop
C - - - - - 0x016085 0B:8075: A9 80     LDA #$80
C - - - - - 0x016087 0B:8077: 8D 15 05  STA ram_0515
C - - - - - 0x01608A 0B:807A: 68        PLA
C - - - - - 0x01608B 0B:807B: 38        SEC
C - - - - - 0x01608C 0B:807C: E9 01     SBC #$01
C - - - - - 0x01608E 0B:807E: D0 CC     BNE bra_804C_loop
C - - - - - 0x016090 0B:8080: 4C 0C 80  JMP loc_800C



loc_8083:
ofs_0x016093:
C D - - - - 0x016093 0B:8083: A9 01     LDA #$01
C - - - - - 0x016095 0B:8085: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x016098 0B:8088: AD D4 05  LDA ram_05D4
C - - - - - 0x01609B 0B:808B: 2C D7 05  BIT ram_05D7
C - - - - - 0x01609E 0B:808E: 10 05     BPL bra_8095
C - - - - - 0x0160A0 0B:8090: 49 FF     EOR #$FF
C - - - - - 0x0160A2 0B:8092: 18        CLC
C - - - - - 0x0160A3 0B:8093: 69 01     ADC #$01
bra_8095:
C - - - - - 0x0160A5 0B:8095: 29 E0     AND #$E0
C - - - - - 0x0160A7 0B:8097: CD D8 05  CMP ram_05D8
C - - - - - 0x0160AA 0B:809A: D0 03     BNE bra_809F
C - - - - - 0x0160AC 0B:809C: 4C 83 80  JMP loc_8083
bra_809F:
C - - - - - 0x0160AF 0B:809F: 8D D8 05  STA ram_05D8
C - - - - - 0x0160B2 0B:80A2: 20 0C 81  JSR sub_810C
C - - - - - 0x0160B5 0B:80A5: A9 E0     LDA #$E0
C - - - - - 0x0160B7 0B:80A7: A0 FF     LDY #$FF
C - - - - - 0x0160B9 0B:80A9: 2C D7 05  BIT ram_05D7
C - - - - - 0x0160BC 0B:80AC: 10 02     BPL bra_80B0
C - - - - - 0x0160BE 0B:80AE: A9 00     LDA #$00
bra_80B0:
C - - - - - 0x0160C0 0B:80B0: 18        CLC
C - - - - - 0x0160C1 0B:80B1: 6D D4 05  ADC ram_05D4
C - - - - - 0x0160C4 0B:80B4: AA        TAX
C - - - - - 0x0160C5 0B:80B5: 98        TYA
C - - - - - 0x0160C6 0B:80B6: 6D D5 05  ADC ram_05D5
C - - - - - 0x0160C9 0B:80B9: A8        TAY
C - - - - - 0x0160CA 0B:80BA: 8A        TXA
C - - - - - 0x0160CB 0B:80BB: 4A        LSR
C - - - - - 0x0160CC 0B:80BC: 4A        LSR
C - - - - - 0x0160CD 0B:80BD: 4A        LSR
C - - - - - 0x0160CE 0B:80BE: 4A        LSR
C - - - - - 0x0160CF 0B:80BF: 4A        LSR
C - - - - - 0x0160D0 0B:80C0: 85 5A     STA ram_005A
C - - - - - 0x0160D2 0B:80C2: 98        TYA
C - - - - - 0x0160D3 0B:80C3: 4A        LSR
C - - - - - 0x0160D4 0B:80C4: A9 00     LDA #$00
C - - - - - 0x0160D6 0B:80C6: 90 02     BCC bra_80CA
- - - - - - 0x0160D8 0B:80C8: A9 40     LDA #$40
bra_80CA:
C - - - - - 0x0160DA 0B:80CA: 05 5A     ORA ram_005A
C - - - - - 0x0160DC 0B:80CC: 85 5A     STA ram_005A
C - - - - - 0x0160DE 0B:80CE: A9 02     LDA #$02
bra_80D0_loop:
C - - - - - 0x0160E0 0B:80D0: 48        PHA
bra_80D1_loop:
C - - - - - 0x0160E1 0B:80D1: A9 01     LDA #$01
C - - - - - 0x0160E3 0B:80D3: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0160E6 0B:80D6: AD 15 05  LDA ram_0515
C - - - - - 0x0160E9 0B:80D9: D0 F6     BNE bra_80D1_loop
C - - - - - 0x0160EB 0B:80DB: A9 01     LDA #$01
C - - - - - 0x0160ED 0B:80DD: 8D 15 05  STA ram_0515
C - - - - - 0x0160F0 0B:80E0: A2 00     LDX #$00
C - - - - - 0x0160F2 0B:80E2: A9 02     LDA #$02
bra_80E4_loop:
C - - - - - 0x0160F4 0B:80E4: 48        PHA
C - - - - - 0x0160F5 0B:80E5: A5 5A     LDA ram_005A
C - - - - - 0x0160F7 0B:80E7: 29 3F     AND #$3F
C - - - - - 0x0160F9 0B:80E9: A8        TAY
C - - - - - 0x0160FA 0B:80EA: B1 58     LDA (ram_0058),Y
C - - - - - 0x0160FC 0B:80EC: A4 5A     LDY ram_005A
C - - - - - 0x0160FE 0B:80EE: 20 C2 85  JSR sub_85C2
C - - - - - 0x016101 0B:80F1: A5 5A     LDA ram_005A
C - - - - - 0x016103 0B:80F3: 18        CLC
C - - - - - 0x016104 0B:80F4: 69 08     ADC #$08
C - - - - - 0x016106 0B:80F6: 85 5A     STA ram_005A
C - - - - - 0x016108 0B:80F8: 68        PLA
C - - - - - 0x016109 0B:80F9: 38        SEC
C - - - - - 0x01610A 0B:80FA: E9 01     SBC #$01
C - - - - - 0x01610C 0B:80FC: D0 E6     BNE bra_80E4_loop
C - - - - - 0x01610E 0B:80FE: A9 80     LDA #$80
C - - - - - 0x016110 0B:8100: 8D 15 05  STA ram_0515
C - - - - - 0x016113 0B:8103: 68        PLA
C - - - - - 0x016114 0B:8104: 38        SEC
C - - - - - 0x016115 0B:8105: E9 01     SBC #$01
C - - - - - 0x016117 0B:8107: D0 C7     BNE bra_80D0_loop
C - - - - - 0x016119 0B:8109: 4C 83 80  JMP loc_8083

sub_810C:
C - - - - - 0x01611C 0B:810C: AE D4 05  LDX ram_05D4
C - - - - - 0x01611F 0B:810F: AC D5 05  LDY ram_05D5
C - - - - - 0x016122 0B:8112: 10 0C     BPL bra_8120
C - - - - - 0x016124 0B:8114: 8A        TXA
C - - - - - 0x016125 0B:8115: 49 FF     EOR #$FF
C - - - - - 0x016127 0B:8117: AA        TAX
C - - - - - 0x016128 0B:8118: 98        TYA
C - - - - - 0x016129 0B:8119: 49 FF     EOR #$FF
C - - - - - 0x01612B 0B:811B: A8        TAY
C - - - - - 0x01612C 0B:811C: E8        INX
C - - - - - 0x01612D 0B:811D: D0 01     BNE bra_8120
- - - - - - 0x01612F 0B:811F: C8        INY
bra_8120:
C - - - - - 0x016130 0B:8120: 8A        TXA
C - - - - - 0x016131 0B:8121: 18        CLC
C - - - - - 0x016132 0B:8122: 69 E0     ADC #$E0
C - - - - - 0x016134 0B:8124: 85 3A     STA ram_003A
C - - - - - 0x016136 0B:8126: 98        TYA
C - - - - - 0x016137 0B:8127: 69 01     ADC #$01
C - - - - - 0x016139 0B:8129: 85 3B     STA ram_003B
sub_812B:
C - - - - - 0x01613B 0B:812B: A8        TAY
C - - - - - 0x01613C 0B:812C: B1 5B     LDA (ram_005B),Y
C - - - - - 0x01613E 0B:812E: 20 D3 86  JSR sub_86D3
C - - - - - 0x016141 0B:8131: A2 00     LDX #$00
C - - - - - 0x016143 0B:8133: 86 58     STX ram_0058
C - - - - - 0x016145 0B:8135: 4A        LSR
C - - - - - 0x016146 0B:8136: 66 58     ROR ram_0058
C - - - - - 0x016148 0B:8138: 4A        LSR
C - - - - - 0x016149 0B:8139: 66 58     ROR ram_0058
C - - - - - 0x01614B 0B:813B: 4A        LSR
C - - - - - 0x01614C 0B:813C: 66 58     ROR ram_0058
C - - - - - 0x01614E 0B:813E: AA        TAX
C - - - - - 0x01614F 0B:813F: A5 58     LDA ram_0058
C - - - - - 0x016151 0B:8141: 18        CLC
C - - - - - 0x016152 0B:8142: 69 64     ADC #< tbl_8B64
C - - - - - 0x016154 0B:8144: 85 58     STA ram_0058
C - - - - - 0x016156 0B:8146: 8A        TXA
C - - - - - 0x016157 0B:8147: 69 8B     ADC #> tbl_8B64
C - - - - - 0x016159 0B:8149: 85 59     STA ram_0059
C - - - - - 0x01615B 0B:814B: 60        RTS



ofs_0x01615C:
; bzk вероятно можно немного сэкономить, если сначала проверить на FF у адреса, а только потом грузить поинтеры
; убедиться что эти поинтеры в дальнейшем не понадобятся
C D - - - - 0x01615C 0B:814C: A9 F6     LDA #< tbl_87F6_фоны_анимаций
C - - - - - 0x01615E 0B:814E: 85 52     STA ram_0052
C - - - - - 0x016160 0B:8150: A9 87     LDA #> tbl_87F6_фоны_анимаций
C - - - - - 0x016162 0B:8152: 85 53     STA ram_0053
C - - - - - 0x016164 0B:8154: AD 24 05  LDA ram_фон_анимации
C - - - - - 0x016167 0B:8157: C9 FF     CMP #$FF
C - - - - - 0x016169 0B:8159: F0 41     BEQ bra_819C
C - - - - - 0x01616B 0B:815B: 0A        ASL
C - - - - - 0x01616C 0B:815C: 90 02     BCC bra_8160_not_overflow
- - - - - - 0x01616E 0B:815E: E6 53     INC ram_0053
bra_8160_not_overflow:
C - - - - - 0x016170 0B:8160: A8        TAY
C - - - - - 0x016171 0B:8161: B1 52     LDA (ram_0052),Y
C - - - - - 0x016173 0B:8163: AA        TAX
C - - - - - 0x016174 0B:8164: C8        INY
C - - - - - 0x016175 0B:8165: B1 52     LDA (ram_0052),Y
C - - - - - 0x016177 0B:8167: 85 53     STA ram_0053
C - - - - - 0x016179 0B:8169: 86 52     STX ram_0052
C - - - - - 0x01617B 0B:816B: A9 00     LDA #$00
C - - - - - 0x01617D 0B:816D: 8D D1 05  STA ram_05D1
C - - - - - 0x016180 0B:8170: 85 3A     STA ram_003A
C - - - - - 0x016182 0B:8172: A4 3A     LDY ram_003A
C - - - - - 0x016184 0B:8174: B1 52     LDA (ram_0052),Y
C - - - - - 0x016186 0B:8176: C9 F0     CMP #$F0
C - - - - - 0x016188 0B:8178: 90 0E     BCC bra_8188_EF_и_ниже
C - - - - - 0x01618A 0B:817A: 20 BC 81  JSR sub_81BC_управляющие_байты
C - - - - - 0x01618D 0B:817D: A9 02     LDA #$02
C - - - - - 0x01618F 0B:817F: 8D D0 05  STA ram_05D0
C - - - - - 0x016192 0B:8182: 8D 25 05  STA ram_0525
C - - - - - 0x016195 0B:8185: 4C 9C 81  JMP loc_819C
bra_8188_EF_и_ниже:
C - - - - - 0x016198 0B:8188: 8D 25 05  STA ram_0525
C - - - - - 0x01619B 0B:818B: 98        TYA
C - - - - - 0x01619C 0B:818C: 18        CLC
C - - - - - 0x01619D 0B:818D: 65 52     ADC ram_0052
C - - - - - 0x01619F 0B:818F: 85 52     STA ram_0052
C - - - - - 0x0161A1 0B:8191: 90 02     BCC bra_8195_not_overflow
- - - - - - 0x0161A3 0B:8193: E6 53     INC ram_0053
bra_8195_not_overflow:
C - - - - - 0x0161A5 0B:8195: A0 01     LDY #$01
C - - - - - 0x0161A7 0B:8197: B1 52     LDA (ram_0052),Y
C - - - - - 0x0161A9 0B:8199: 20 A7 81  JSR sub_81A7_управляющие_байты
bra_819C:
loc_819C:
C D - - - - 0x0161AC 0B:819C: AD 16 05  LDA ram_флаг_сценария_ХЗ
C - - - - - 0x0161AF 0B:819F: 09 10     ORA #$10
C - - - - - 0x0161B1 0B:81A1: 8D 16 05  STA ram_флаг_сценария_ХЗ
C - - - - - 0x0161B4 0B:81A4: 4C 12 C5  JMP loc_0x03CB07

sub_81A7_управляющие_байты:
C - - - - - 0x0161B7 0B:81A7: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x0161BA 0B:81AA: 27 83     .word ofs_009_8327_00
- D - I - - 0x0161BC 0B:81AC: E7 83     .word ofs_009_83E7_01___
- - - - - - 0x0161BE 0B:81AE: FF 83     .word ofs_009_83FF_02
- D - I - - 0x0161C0 0B:81B0: 58 83     .word ofs_009_8358_03
- D - I - - 0x0161C2 0B:81B2: 77 83     .word ofs_009_8377_04
- D - I - - 0x0161C4 0B:81B4: 64 83     .word ofs_009_8364_05
- D - I - - 0x0161C6 0B:81B6: D2 83     .word ofs_009_83D2_06
- - - - - - 0x0161C8 0B:81B8: E7 83     .word ofs_009_83E7_01___
- D - I - - 0x0161CA 0B:81BA: EE 83     .word ofs_009_83EE_08

sub_81BC_управляющие_байты:
C - - - - - 0x0161CC 0B:81BC: A2 00     LDX #$00
C - - - - - 0x0161CE 0B:81BE: 8E 25 05  STX ram_0525
C - - - - - 0x0161D1 0B:81C1: 29 0F     AND #$0F
C - - - - - 0x0161D3 0B:81C3: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x0161D6 0B:81C6: CC 81     .word ofs_010_81CC_F0
- - - - - - 0x0161D8 0B:81C8: 76 82     .word ofs_010_8276_F1
- D - I - - 0x0161DA 0B:81CA: 4D 82     .word ofs_010_824D_F2

ofs_010_81CC_F0:
C - J - - - 0x0161DC 0B:81CC: 20 F7 82  JSR sub_82F7
C - - - - - 0x0161DF 0B:81CF: BD D5 81  LDA tbl_81D5,X
C - - - - - 0x0161E2 0B:81D2: 4C 2B 83  JMP loc_832B

tbl_81D5:
- D - - - - 0x0161E5 0B:81D5: 0A        .byte $0A   ; <こ>
- D - - - - 0x0161E6 0B:81D6: 0C        .byte $0C   ; <し>
- D - - - - 0x0161E7 0B:81D7: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161E8 0B:81D8: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161E9 0B:81D9: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161EA 0B:81DA: 12        .byte $12   ; <つ>
- D - - - - 0x0161EB 0B:81DB: 10        .byte $10   ; <た>
- D - - - - 0x0161EC 0B:81DC: 10        .byte $10   ; <た>
- D - - - - 0x0161ED 0B:81DD: 12        .byte $12   ; <つ>
- D - - - - 0x0161EE 0B:81DE: 12        .byte $12   ; <つ>
- - - - - - 0x0161EF 0B:81DF: 1E        .byte $1E   ; <ほ>
- - - - - - 0x0161F0 0B:81E0: 1A        .byte $1A   ; <は>
- D - - - - 0x0161F1 0B:81E1: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161F2 0B:81E2: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161F3 0B:81E3: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161F4 0B:81E4: 12        .byte $12   ; <つ>
- D - - - - 0x0161F5 0B:81E5: 10        .byte $10   ; <た>
- D - - - - 0x0161F6 0B:81E6: 10        .byte $10   ; <た>
- - - - - - 0x0161F7 0B:81E7: 12        .byte $12   ; <つ>
- D - - - - 0x0161F8 0B:81E8: 12        .byte $12   ; <つ>
- - - - - - 0x0161F9 0B:81E9: 15        .byte $15   ; <な>
- - - - - - 0x0161FA 0B:81EA: 1A        .byte $1A   ; <は>
- D - - - - 0x0161FB 0B:81EB: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161FC 0B:81EC: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161FD 0B:81ED: 0E        .byte $0E   ; <せ>
- D - - - - 0x0161FE 0B:81EE: 12        .byte $12   ; <つ>
- D - - - - 0x0161FF 0B:81EF: 10        .byte $10   ; <た>
- D - - - - 0x016200 0B:81F0: 10        .byte $10   ; <た>
- D - - - - 0x016201 0B:81F1: 12        .byte $12   ; <つ>
- D - - - - 0x016202 0B:81F2: 12        .byte $12   ; <つ>
- - - - - - 0x016203 0B:81F3: 17        .byte $17   ; <ぬ>
- - - - - - 0x016204 0B:81F4: 1B        .byte $1B   ; <ひ>
- D - - - - 0x016205 0B:81F5: 0F        .byte $0F   ; <そ>
- D - - - - 0x016206 0B:81F6: 0F        .byte $0F   ; <そ>
- D - - - - 0x016207 0B:81F7: 0F        .byte $0F   ; <そ>
- D - - - - 0x016208 0B:81F8: 13        .byte $13   ; <て>
- D - - - - 0x016209 0B:81F9: 11        .byte $11   ; <ち>
- D - - - - 0x01620A 0B:81FA: 11        .byte $11   ; <ち>
- D - - - - 0x01620B 0B:81FB: 13        .byte $13   ; <て>
- D - - - - 0x01620C 0B:81FC: 13        .byte $13   ; <て>
- - - - - - 0x01620D 0B:81FD: 1F        .byte $1F   ; <ま>
- - - - - - 0x01620E 0B:81FE: 1B        .byte $1B   ; <ひ>
- D - - - - 0x01620F 0B:81FF: 0F        .byte $0F   ; <そ>
- D - - - - 0x016210 0B:8200: 0F        .byte $0F   ; <そ>
- D - - - - 0x016211 0B:8201: 0F        .byte $0F   ; <そ>
- D - - - - 0x016212 0B:8202: 13        .byte $13   ; <て>
- D - - - - 0x016213 0B:8203: 11        .byte $11   ; <ち>
- D - - - - 0x016214 0B:8204: 11        .byte $11   ; <ち>
- D - - - - 0x016215 0B:8205: 13        .byte $13   ; <て>
- D - - - - 0x016216 0B:8206: 13        .byte $13   ; <て>
- D - - - - 0x016217 0B:8207: 0B        .byte $0B   ; <さ>
- - - - - - 0x016218 0B:8208: 0D        .byte $0D   ; <す>
- D - - - - 0x016219 0B:8209: 0F        .byte $0F   ; <そ>
- - - - - - 0x01621A 0B:820A: 0F        .byte $0F   ; <そ>
- - - - - - 0x01621B 0B:820B: 0F        .byte $0F   ; <そ>
- D - - - - 0x01621C 0B:820C: 13        .byte $13   ; <て>
- D - - - - 0x01621D 0B:820D: 11        .byte $11   ; <ち>
- D - - - - 0x01621E 0B:820E: 11        .byte $11   ; <ち>
- D - - - - 0x01621F 0B:820F: 13        .byte $13   ; <て>
- D - - - - 0x016220 0B:8210: 13        .byte $13   ; <て>
- D - - - - 0x016221 0B:8211: 00        .byte $00
- D - - - - 0x016222 0B:8212: 00        .byte $00
- D - - - - 0x016223 0B:8213: 02        .byte $02   ; <い>
- D - - - - 0x016224 0B:8214: 02        .byte $02   ; <い>
- D - - - - 0x016225 0B:8215: 00        .byte $00
- D - - - - 0x016226 0B:8216: 04        .byte $04   ; <え>
- D - - - - 0x016227 0B:8217: 04        .byte $04   ; <え>
- D - - - - 0x016228 0B:8218: 04        .byte $04   ; <え>
- D - - - - 0x016229 0B:8219: 06        .byte $06   ; <か>
- - - - - - 0x01622A 0B:821A: 08        .byte $08   ; <く>
- D - - - - 0x01622B 0B:821B: 00        .byte $00
- D - - - - 0x01622C 0B:821C: 00        .byte $00
- D - - - - 0x01622D 0B:821D: 02        .byte $02   ; <い>
- D - - - - 0x01622E 0B:821E: 02        .byte $02   ; <い>
- D - - - - 0x01622F 0B:821F: 00        .byte $00
- D - - - - 0x016230 0B:8220: 04        .byte $04   ; <え>
- D - - - - 0x016231 0B:8221: 04        .byte $04   ; <え>
- D - - - - 0x016232 0B:8222: 04        .byte $04   ; <え>
- - - - - - 0x016233 0B:8223: 1B        .byte $1B   ; <ひ>
- - - - - - 0x016234 0B:8224: 1F        .byte $1F   ; <ま>
- D - - - - 0x016235 0B:8225: 00        .byte $00
- D - - - - 0x016236 0B:8226: 00        .byte $00
- D - - - - 0x016237 0B:8227: 02        .byte $02   ; <い>
- D - - - - 0x016238 0B:8228: 02        .byte $02   ; <い>
- D - - - - 0x016239 0B:8229: 00        .byte $00
- D - - - - 0x01623A 0B:822A: 04        .byte $04   ; <え>
- D - - - - 0x01623B 0B:822B: 04        .byte $04   ; <え>
- D - - - - 0x01623C 0B:822C: 04        .byte $04   ; <え>
- - - - - - 0x01623D 0B:822D: 1B        .byte $1B   ; <ひ>
- - - - - - 0x01623E 0B:822E: 17        .byte $17   ; <ぬ>
- D - - - - 0x01623F 0B:822F: 01        .byte $01   ; <あ>
- D - - - - 0x016240 0B:8230: 01        .byte $01   ; <あ>
- D - - - - 0x016241 0B:8231: 03        .byte $03   ; <う>
- D - - - - 0x016242 0B:8232: 03        .byte $03   ; <う>
- D - - - - 0x016243 0B:8233: 01        .byte $01   ; <あ>
- D - - - - 0x016244 0B:8234: 05        .byte $05   ; <お>
- D - - - - 0x016245 0B:8235: 05        .byte $05   ; <お>
- D - - - - 0x016246 0B:8236: 05        .byte $05   ; <お>
- - - - - - 0x016247 0B:8237: 1A        .byte $1A   ; <は>
- - - - - - 0x016248 0B:8238: 15        .byte $15   ; <な>
- - - - - - 0x016249 0B:8239: 01        .byte $01   ; <あ>
- D - - - - 0x01624A 0B:823A: 01        .byte $01   ; <あ>
- D - - - - 0x01624B 0B:823B: 03        .byte $03   ; <う>
- D - - - - 0x01624C 0B:823C: 03        .byte $03   ; <う>
- D - - - - 0x01624D 0B:823D: 01        .byte $01   ; <あ>
- D - - - - 0x01624E 0B:823E: 05        .byte $05   ; <お>
- D - - - - 0x01624F 0B:823F: 05        .byte $05   ; <お>
- D - - - - 0x016250 0B:8240: 05        .byte $05   ; <お>
- - - - - - 0x016251 0B:8241: 1A        .byte $1A   ; <は>
- - - - - - 0x016252 0B:8242: 1E        .byte $1E   ; <ほ>
- D - - - - 0x016253 0B:8243: 01        .byte $01   ; <あ>
- D - - - - 0x016254 0B:8244: 01        .byte $01   ; <あ>
- D - - - - 0x016255 0B:8245: 03        .byte $03   ; <う>
- D - - - - 0x016256 0B:8246: 03        .byte $03   ; <う>
- D - - - - 0x016257 0B:8247: 01        .byte $01   ; <あ>
- D - - - - 0x016258 0B:8248: 05        .byte $05   ; <お>
- D - - - - 0x016259 0B:8249: 05        .byte $05   ; <お>
- - - - - - 0x01625A 0B:824A: 05        .byte $05   ; <お>
- - - - - - 0x01625B 0B:824B: 07        .byte $07   ; <き>
- D - - - - 0x01625C 0B:824C: 09        .byte $09   ; <け>

ofs_010_824D_F2:
C - J - - - 0x01625D 0B:824D: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x016260 0B:8250: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x016263 0B:8253: AD 38 06  LDA ram_0638
C - - - - - 0x016266 0B:8256: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - - 0x016269 0B:8259: 8A        TXA
C - - - - - 0x01626A 0B:825A: A0 06     LDY #con_plr_pos_X_hi
C - - - - - 0x01626C 0B:825C: 38        SEC
C - - - - - 0x01626D 0B:825D: F1 34     SBC (ram_plr_data),Y
C - - - - - 0x01626F 0B:825F: AC FB 05  LDY ram_команда_с_мячом
C - - - - - 0x016272 0B:8262: F0 05     BEQ bra_8269_команда_слева
; if комада справа
C - - - - - 0x016274 0B:8264: 49 FF     EOR #$FF
C - - - - - 0x016276 0B:8266: 18        CLC
C - - - - - 0x016277 0B:8267: 69 01     ADC #$01
bra_8269_команда_слева:
C - - - - - 0x016279 0B:8269: AA        TAX
C - - - - - 0x01627A 0B:826A: 10 04     BPL bra_8270
C - - - - - 0x01627C 0B:826C: 98        TYA
C - - - - - 0x01627D 0B:826D: 49 0B     EOR #$0B
C - - - - - 0x01627F 0B:826F: A8        TAY
bra_8270:
C - - - - - 0x016280 0B:8270: 20 FE 82  JSR sub_82FE
C - - - - - 0x016283 0B:8273: 4C 79 82  JMP loc_8279

ofs_010_8276_F1:
- - - - - - 0x016286 0B:8276: 20 F7 82  JSR sub_82F7
loc_8279:
C D - - - - 0x016289 0B:8279: BD 7F 82  LDA tbl_827F,X
C - - - - - 0x01628C 0B:827C: 4C 2B 83  JMP loc_832B

tbl_827F:
- D - - - - 0x01628F 0B:827F: 0E        .byte $0E   ; 00
- D - - - - 0x016290 0B:8280: 0E        .byte $0E   ; 01
- D - - - - 0x016291 0B:8281: 10        .byte $10   ; 02
- D - - - - 0x016292 0B:8282: 10        .byte $10   ; 03
- D - - - - 0x016293 0B:8283: 10        .byte $10   ; 04
- D - - - - 0x016294 0B:8284: 12        .byte $12   ; 05
- D - - - - 0x016295 0B:8285: 10        .byte $10   ; 06
- D - - - - 0x016296 0B:8286: 10        .byte $10   ; 07
- D - - - - 0x016297 0B:8287: 12        .byte $12   ; 08
- - - - - - 0x016298 0B:8288: 12        .byte $12   ; 09
- D - - - - 0x016299 0B:8289: 0C        .byte $0C   ; 0A
- D - - - - 0x01629A 0B:828A: 0C        .byte $0C   ; 0B
- D - - - - 0x01629B 0B:828B: 10        .byte $10   ; 0C
- D - - - - 0x01629C 0B:828C: 10        .byte $10   ; 0D
- D - - - - 0x01629D 0B:828D: 10        .byte $10   ; 0E
- D - - - - 0x01629E 0B:828E: 12        .byte $12   ; 0F
- D - - - - 0x01629F 0B:828F: 10        .byte $10   ; 10
- D - - - - 0x0162A0 0B:8290: 10        .byte $10   ; 11
- D - - - - 0x0162A1 0B:8291: 12        .byte $12   ; 12
- - - - - - 0x0162A2 0B:8292: 12        .byte $12   ; 13
- D - - - - 0x0162A3 0B:8293: 1A        .byte $1A   ; 14
- D - - - - 0x0162A4 0B:8294: 0C        .byte $0C   ; 15
- D - - - - 0x0162A5 0B:8295: 10        .byte $10   ; 16
- D - - - - 0x0162A6 0B:8296: 10        .byte $10   ; 17
- D - - - - 0x0162A7 0B:8297: 10        .byte $10   ; 18
- D - - - - 0x0162A8 0B:8298: 12        .byte $12   ; 19
- D - - - - 0x0162A9 0B:8299: 10        .byte $10   ; 1A
- D - - - - 0x0162AA 0B:829A: 10        .byte $10   ; 1B
- D - - - - 0x0162AB 0B:829B: 12        .byte $12   ; 1C
- D - - - - 0x0162AC 0B:829C: 12        .byte $12   ; 1D
- D - - - - 0x0162AD 0B:829D: 1B        .byte $1B   ; 1E
- D - - - - 0x0162AE 0B:829E: 0D        .byte $0D   ; 1F
- D - - - - 0x0162AF 0B:829F: 11        .byte $11   ; 20
- D - - - - 0x0162B0 0B:82A0: 11        .byte $11   ; 21
- D - - - - 0x0162B1 0B:82A1: 11        .byte $11   ; 22
- D - - - - 0x0162B2 0B:82A2: 13        .byte $13   ; 23
- D - - - - 0x0162B3 0B:82A3: 11        .byte $11   ; 24
- D - - - - 0x0162B4 0B:82A4: 11        .byte $11   ; 25
- D - - - - 0x0162B5 0B:82A5: 13        .byte $13   ; 26
- - - - - - 0x0162B6 0B:82A6: 13        .byte $13   ; 27
- D - - - - 0x0162B7 0B:82A7: 0D        .byte $0D   ; 28
- D - - - - 0x0162B8 0B:82A8: 0D        .byte $0D   ; 29
- D - - - - 0x0162B9 0B:82A9: 11        .byte $11   ; 2A
- D - - - - 0x0162BA 0B:82AA: 11        .byte $11   ; 2B
- D - - - - 0x0162BB 0B:82AB: 11        .byte $11   ; 2C
- D - - - - 0x0162BC 0B:82AC: 13        .byte $13   ; 2D
- D - - - - 0x0162BD 0B:82AD: 11        .byte $11   ; 2E
- D - - - - 0x0162BE 0B:82AE: 11        .byte $11   ; 2F
- D - - - - 0x0162BF 0B:82AF: 13        .byte $13   ; 30
- D - - - - 0x0162C0 0B:82B0: 13        .byte $13   ; 31
- D - - - - 0x0162C1 0B:82B1: 0F        .byte $0F   ; 32
- D - - - - 0x0162C2 0B:82B2: 0F        .byte $0F   ; 33
- D - - - - 0x0162C3 0B:82B3: 11        .byte $11   ; 34
- D - - - - 0x0162C4 0B:82B4: 11        .byte $11   ; 35
- D - - - - 0x0162C5 0B:82B5: 11        .byte $11   ; 36
- D - - - - 0x0162C6 0B:82B6: 13        .byte $13   ; 37
- D - - - - 0x0162C7 0B:82B7: 11        .byte $11   ; 38
- D - - - - 0x0162C8 0B:82B8: 11        .byte $11   ; 39
- D - - - - 0x0162C9 0B:82B9: 13        .byte $13   ; 3A
- - - - - - 0x0162CA 0B:82BA: 13        .byte $13   ; 3B
- D - - - - 0x0162CB 0B:82BB: 00        .byte $00   ; 3C
- D - - - - 0x0162CC 0B:82BC: 00        .byte $00   ; 3D
- D - - - - 0x0162CD 0B:82BD: 02        .byte $02   ; 3E
- D - - - - 0x0162CE 0B:82BE: 02        .byte $02   ; 3F
- D - - - - 0x0162CF 0B:82BF: 00        .byte $00   ; 40
- D - - - - 0x0162D0 0B:82C0: 02        .byte $02   ; 41
- D - - - - 0x0162D1 0B:82C1: 02        .byte $02   ; 42
- D - - - - 0x0162D2 0B:82C2: 02        .byte $02   ; 43
- D - - - - 0x0162D3 0B:82C3: 04        .byte $04   ; 44
- D - - - - 0x0162D4 0B:82C4: 04        .byte $04   ; 45
- D - - - - 0x0162D5 0B:82C5: 00        .byte $00   ; 46
- D - - - - 0x0162D6 0B:82C6: 00        .byte $00   ; 47
- D - - - - 0x0162D7 0B:82C7: 02        .byte $02   ; 48
- D - - - - 0x0162D8 0B:82C8: 02        .byte $02   ; 49
- D - - - - 0x0162D9 0B:82C9: 00        .byte $00   ; 4A
- D - - - - 0x0162DA 0B:82CA: 02        .byte $02   ; 4B
- D - - - - 0x0162DB 0B:82CB: 02        .byte $02   ; 4C
- D - - - - 0x0162DC 0B:82CC: 02        .byte $02   ; 4D
- D - - - - 0x0162DD 0B:82CD: 06        .byte $06   ; 4E
- D - - - - 0x0162DE 0B:82CE: 06        .byte $06   ; 4F
- D - - - - 0x0162DF 0B:82CF: 00        .byte $00   ; 50
- D - - - - 0x0162E0 0B:82D0: 00        .byte $00   ; 51
- D - - - - 0x0162E1 0B:82D1: 02        .byte $02   ; 52
- D - - - - 0x0162E2 0B:82D2: 02        .byte $02   ; 53
- D - - - - 0x0162E3 0B:82D3: 00        .byte $00   ; 54
- D - - - - 0x0162E4 0B:82D4: 02        .byte $02   ; 55
- D - - - - 0x0162E5 0B:82D5: 02        .byte $02   ; 56
- D - - - - 0x0162E6 0B:82D6: 02        .byte $02   ; 57
- D - - - - 0x0162E7 0B:82D7: 06        .byte $06   ; 58
- D - - - - 0x0162E8 0B:82D8: 1B        .byte $1B   ; 59
- - - - - - 0x0162E9 0B:82D9: 01        .byte $01   ; 5A
- D - - - - 0x0162EA 0B:82DA: 01        .byte $01   ; 5B
- D - - - - 0x0162EB 0B:82DB: 03        .byte $03   ; 5C
- D - - - - 0x0162EC 0B:82DC: 03        .byte $03   ; 5D
- D - - - - 0x0162ED 0B:82DD: 01        .byte $01   ; 5E
- D - - - - 0x0162EE 0B:82DE: 03        .byte $03   ; 5F
- D - - - - 0x0162EF 0B:82DF: 03        .byte $03   ; 60
- D - - - - 0x0162F0 0B:82E0: 03        .byte $03   ; 61
- D - - - - 0x0162F1 0B:82E1: 07        .byte $07   ; 62
- D - - - - 0x0162F2 0B:82E2: 1A        .byte $1A   ; 63
- D - - - - 0x0162F3 0B:82E3: 01        .byte $01   ; 64
- D - - - - 0x0162F4 0B:82E4: 01        .byte $01   ; 65
- D - - - - 0x0162F5 0B:82E5: 03        .byte $03   ; 66
- D - - - - 0x0162F6 0B:82E6: 03        .byte $03   ; 67
- D - - - - 0x0162F7 0B:82E7: 01        .byte $01   ; 68
- D - - - - 0x0162F8 0B:82E8: 03        .byte $03   ; 69
- D - - - - 0x0162F9 0B:82E9: 03        .byte $03   ; 6A
- D - - - - 0x0162FA 0B:82EA: 03        .byte $03   ; 6B
- D - - - - 0x0162FB 0B:82EB: 07        .byte $07   ; 6C
- D - - - - 0x0162FC 0B:82EC: 07        .byte $07   ; 6D
- - - - - - 0x0162FD 0B:82ED: 01        .byte $01   ; 6E
- D - - - - 0x0162FE 0B:82EE: 01        .byte $01   ; 6F
- - - - - - 0x0162FF 0B:82EF: 03        .byte $03   ; 70
- D - - - - 0x016300 0B:82F0: 03        .byte $03   ; 71
- D - - - - 0x016301 0B:82F1: 01        .byte $01   ; 72
- D - - - - 0x016302 0B:82F2: 03        .byte $03   ; 73
- D - - - - 0x016303 0B:82F3: 03        .byte $03   ; 74
- D - - - - 0x016304 0B:82F4: 03        .byte $03   ; 75
- D - - - - 0x016305 0B:82F5: 05        .byte $05   ; 76
- D - - - - 0x016306 0B:82F6: 05        .byte $05   ; 77

sub_82F7:
C - - - - - 0x016307 0B:82F7: AC FB 05  LDY ram_команда_с_мячом
; bzk опт, удалить jsr и rts
C - - - - - 0x01630A 0B:82FA: 20 FE 82  JSR sub_82FE
C - - - - - 0x01630D 0B:82FD: 60        RTS

sub_82FE:
C - - - - - 0x01630E 0B:82FE: AD 37 06  LDA ram_0637
C - - - - - 0x016311 0B:8301: 38        SEC
C - - - - - 0x016312 0B:8302: E9 50     SBC #$50
C - - - - - 0x016314 0B:8304: 29 F0     AND #$F0
C - - - - - 0x016316 0B:8306: 4A        LSR
C - - - - - 0x016317 0B:8307: 85 3A     STA ram_003A
C - - - - - 0x016319 0B:8309: 4A        LSR
C - - - - - 0x01631A 0B:830A: 4A        LSR
C - - - - - 0x01631B 0B:830B: 65 3A     ADC ram_003A
C - - - - - 0x01631D 0B:830D: 85 3A     STA ram_003A
C - - - - - 0x01631F 0B:830F: AD 35 06  LDA ram_0635
C - - - - - 0x016322 0B:8312: 38        SEC
C - - - - - 0x016323 0B:8313: E9 30     SBC #$30
C - - - - - 0x016325 0B:8315: 29 F0     AND #$F0
C - - - - - 0x016327 0B:8317: 4A        LSR
C - - - - - 0x016328 0B:8318: 4A        LSR
C - - - - - 0x016329 0B:8319: 4A        LSR
C - - - - - 0x01632A 0B:831A: 4A        LSR
C - - - - - 0x01632B 0B:831B: 65 3A     ADC ram_003A
C - - - - - 0x01632D 0B:831D: AA        TAX
C - - - - - 0x01632E 0B:831E: 98        TYA
C - - - - - 0x01632F 0B:831F: F0 05     BEQ bra_8326
C - - - - - 0x016331 0B:8321: 8A        TXA
C - - - - - 0x016332 0B:8322: 18        CLC
C - - - - - 0x016333 0B:8323: 69 3C     ADC #$3C
C - - - - - 0x016335 0B:8325: AA        TAX
bra_8326:
C - - - - - 0x016336 0B:8326: 60        RTS

ofs_009_8327_00:
C - J - - - 0x016337 0B:8327: A0 02     LDY #$02
bra_8329:
loc_8329:
C D - - - - 0x016339 0B:8329: B1 52     LDA (ram_0052),Y
loc_832B:
C D - - - - 0x01633B 0B:832B: 8D CC 05  STA ram_05CC
C - - - - - 0x01633E 0B:832E: AC CD 05  LDY ram_05CD
C - - - - - 0x016341 0B:8331: 20 25 85  JSR sub_8525
C - - - - - 0x016344 0B:8334: A9 01     LDA #$50
C - - - - - 0x016346 0B:8336: 8D CB 05  STA ram_для_046B_mirroring
C - - - - - 0x016349 0B:8339: AD CD 05  LDA ram_05CD
C - - - - - 0x01634C 0B:833C: F0 04     BEQ bra_8342
C - - - - - 0x01634E 0B:833E: 29 20     AND #$20
C - - - - - 0x016350 0B:8340: 09 80     ORA #$80
bra_8342:
C - - - - - 0x016352 0B:8342: 8D CE 05  STA ram_05CE
C - - - - - 0x016355 0B:8345: 09 80     ORA #$80
C - - - - - 0x016357 0B:8347: 49 20     EOR #$20
C - - - - - 0x016359 0B:8349: 8D CD 05  STA ram_05CD
C - - - - - 0x01635C 0B:834C: A9 00     LDA #$00
C - - - - - 0x01635E 0B:834E: 8D DB 05  STA ram_05DB
C - - - - - 0x016361 0B:8351: 8D DC 05  STA ram_05DC
C - - - - - 0x016364 0B:8354: 8D DD 05  STA ram_05DD
C - - - - - 0x016367 0B:8357: 60        RTS

ofs_009_8358_03:
C - J - - - 0x016368 0B:8358: 20 D9 84  JSR sub_84D9
C - - - - - 0x01636B 0B:835B: A9 80     LDA #$80
C - - - - - 0x01636D 0B:835D: 8D D1 05  STA ram_05D1
C - - - - - 0x016370 0B:8360: A0 04     LDY #$04
C - - - - - 0x016372 0B:8362: D0 C5     BNE bra_8329    ; jmp

ofs_009_8364_05:
C - J - - - 0x016374 0B:8364: 20 D9 84  JSR sub_84D9
C - - - - - 0x016377 0B:8367: A9 80     LDA #$80
C - - - - - 0x016379 0B:8369: 8D D1 05  STA ram_05D1
C - - - - - 0x01637C 0B:836C: A0 04     LDY #$04
C - - - - - 0x01637E 0B:836E: 2C 2A 05  BIT ram_флаг_зеркала_анимации
C - - - - - 0x016381 0B:8371: 50 01     BVC bra_8374
C - - - - - 0x016383 0B:8373: C8        INY
bra_8374:
C - - - - - 0x016384 0B:8374: 4C 29 83  JMP loc_8329

ofs_009_8377_04:
C - J - - - 0x016387 0B:8377: 20 CF 84  JSR sub_84CF
C - - - - - 0x01638A 0B:837A: A0 04     LDY #$04
C - - - - - 0x01638C 0B:837C: B1 52     LDA (ram_0052),Y
C - - - - - 0x01638E 0B:837E: 8D E2 05  STA ram_05E2
C - - - - - 0x016391 0B:8381: A9 00     LDA #$00
C - - - - - 0x016393 0B:8383: 8D E1 05  STA ram_05E1
loc_8386:
C D - - - - 0x016396 0B:8386: A9 01     LDA #$50
C - - - - - 0x016398 0B:8388: 8D 6B 04  STA ram_mirroring
C - - - - - 0x01639B 0B:838B: A0 A0     LDY #$A0
C - - - - - 0x01639D 0B:838D: AD CC 05  LDA ram_05CC
C - - - - - 0x0163A0 0B:8390: 20 25 85  JSR sub_8525
C - - - - - 0x0163A3 0B:8393: A9 A0     LDA #$A0
C - - - - - 0x0163A5 0B:8395: 20 A1 84  JSR sub_84A1
C - - - - - 0x0163A8 0B:8398: A9 01     LDA #$01
C - - - - - 0x0163AA 0B:839A: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0163AD 0B:839D: A0 05     LDY #$05
C - - - - - 0x0163AF 0B:839F: B1 52     LDA (ram_0052),Y
C - - - - - 0x0163B1 0B:83A1: A0 00     LDY #$00
C - - - - - 0x0163B3 0B:83A3: 8C CE 05  STY ram_05CE
C - - - - - 0x0163B6 0B:83A6: 20 25 85  JSR sub_8525
C - - - - - 0x0163B9 0B:83A9: A0 06     LDY #$06
C - - - - - 0x0163BB 0B:83AB: B1 52     LDA (ram_0052),Y
C - - - - - 0x0163BD 0B:83AD: A0 80     LDY #$80
C - - - - - 0x0163BF 0B:83AF: 20 25 85  JSR sub_8525
C - - - - - 0x0163C2 0B:83B2: A9 00     LDA #$44
C - - - - - 0x0163C4 0B:83B4: 8D CB 05  STA ram_для_046B_mirroring
C - - - - - 0x0163C7 0B:83B7: A9 60     LDA #$60
C - - - - - 0x0163C9 0B:83B9: 8D CD 05  STA ram_05CD
C - - - - - 0x0163CC 0B:83BC: A9 00     LDA #$00
C - - - - - 0x0163CE 0B:83BE: 8D DB 05  STA ram_05DB
C - - - - - 0x0163D1 0B:83C1: 8D DC 05  STA ram_05DC
C - - - - - 0x0163D4 0B:83C4: 8D DD 05  STA ram_05DD
C - - - - - 0x0163D7 0B:83C7: 8D E0 05  STA ram_05E0
C - - - - - 0x0163DA 0B:83CA: A9 82     LDA #$82
C - - - - - 0x0163DC 0B:83CC: 8D D1 05  STA ram_05D1
C - - - - - 0x0163DF 0B:83CF: 4C 93 84  JMP loc_8493

ofs_009_83D2_06:
C - J - - - 0x0163E2 0B:83D2: 20 D9 84  JSR sub_84D9
C - - - - - 0x0163E5 0B:83D5: A0 04     LDY #$04
C - - - - - 0x0163E7 0B:83D7: B1 52     LDA (ram_0052),Y
C - - - - - 0x0163E9 0B:83D9: 8D E2 05  STA ram_05E2
C - - - - - 0x0163EC 0B:83DC: A9 00     LDA #$00
C - - - - - 0x0163EE 0B:83DE: 8D E1 05  STA ram_05E1
C - - - - - 0x0163F1 0B:83E1: 20 7F 84  JSR sub_847F
C - - - - - 0x0163F4 0B:83E4: 4C 86 83  JMP loc_8386

ofs_009_83E7_01___:
C - J - - - 0x0163F7 0B:83E7: A9 C0     LDA #$C0
C - - - - - 0x0163F9 0B:83E9: 8D D1 05  STA ram_05D1
C - - - - - 0x0163FC 0B:83EC: D0 1C     BNE bra_840A

ofs_009_83EE_08:
C - J - - - 0x0163FE 0B:83EE: A9 C2     LDA #$C2
C - - - - - 0x016400 0B:83F0: 8D D1 05  STA ram_05D1
C - - - - - 0x016403 0B:83F3: 20 CF 84  JSR sub_84CF
C - - - - - 0x016406 0B:83F6: 20 5C 84  JSR sub_845C
C - - - - - 0x016409 0B:83F9: 20 7F 84  JSR sub_847F
C - - - - - 0x01640C 0B:83FC: 4C 0D 84  JMP loc_840D

ofs_009_83FF_02:
- - - - - - 0x01640F 0B:83FF: A9 C2     LDA #$C2
- - - - - - 0x016411 0B:8401: 8D D1 05  STA ram_05D1
- - - - - - 0x016414 0B:8404: 20 CF 84  JSR sub_84CF
- - - - - - 0x016417 0B:8407: 20 5C 84  JSR sub_845C
bra_840A:
C - - - - - 0x01641A 0B:840A: 20 CF 84  JSR sub_84CF
loc_840D:
C D - - - - 0x01641D 0B:840D: A9 01     LDA #$50
C - - - - - 0x01641F 0B:840F: 8D 6B 04  STA ram_mirroring
C - - - - - 0x016422 0B:8412: A0 00     LDY #$00
C - - - - - 0x016424 0B:8414: AD CC 05  LDA ram_05CC
C - - - - - 0x016427 0B:8417: 20 25 85  JSR sub_8525
C - - - - - 0x01642A 0B:841A: A9 00     LDA #$00
C - - - - - 0x01642C 0B:841C: 20 A1 84  JSR sub_84A1
C - - - - - 0x01642F 0B:841F: A0 05     LDY #$05
C - - - - - 0x016431 0B:8421: B1 52     LDA (ram_0052),Y
C - - - - - 0x016433 0B:8423: A0 80     LDY #$80
C - - - - - 0x016435 0B:8425: 20 25 85  JSR sub_8525
C - - - - - 0x016438 0B:8428: A0 06     LDY #$06
C - - - - - 0x01643A 0B:842A: B1 52     LDA (ram_0052),Y
C - - - - - 0x01643C 0B:842C: A0 A0     LDY #$A0
C - - - - - 0x01643E 0B:842E: 20 25 85  JSR sub_8525
C - - - - - 0x016441 0B:8431: A9 00     LDA #$44
C - - - - - 0x016443 0B:8433: 8D CB 05  STA ram_для_046B_mirroring
C - - - - - 0x016446 0B:8436: A9 40     LDA #$40
C - - - - - 0x016448 0B:8438: 8D CE 05  STA ram_05CE
C - - - - - 0x01644B 0B:843B: A9 00     LDA #$00
C - - - - - 0x01644D 0B:843D: 8D CD 05  STA ram_05CD
C - - - - - 0x016450 0B:8440: A9 00     LDA #$00
C - - - - - 0x016452 0B:8442: 8D DB 05  STA ram_05DB
C - - - - - 0x016455 0B:8445: A9 E0     LDA #$E0
C - - - - - 0x016457 0B:8447: A2 FF     LDX #$FF
C - - - - - 0x016459 0B:8449: 8D DC 05  STA ram_05DC
C - - - - - 0x01645C 0B:844C: 8E DD 05  STX ram_05DD
C - - - - - 0x01645F 0B:844F: 2C DF 05  BIT ram_05DF
C - - - - - 0x016462 0B:8452: 10 02     BPL bra_8456
C - - - - - 0x016464 0B:8454: A9 20     LDA #$20
bra_8456:
C - - - - - 0x016466 0B:8456: 8D E0 05  STA ram_05E0
C - - - - - 0x016469 0B:8459: 4C 93 84  JMP loc_8493

sub_845C:
C - - - - - 0x01646C 0B:845C: A0 04     LDY #$04
C - - - - - 0x01646E 0B:845E: B1 52     LDA (ram_0052),Y
C - - - - - 0x016470 0B:8460: 2C DF 05  BIT ram_05DF
C - - - - - 0x016473 0B:8463: 30 0C     BMI bra_8471
- - - - - - 0x016475 0B:8465: 38        SEC
- - - - - - 0x016476 0B:8466: E9 01     SBC #$01
- - - - - - 0x016478 0B:8468: A2 74     LDX #$74
- - - - - - 0x01647A 0B:846A: 4A        LSR
- - - - - - 0x01647B 0B:846B: 90 0B     BCC bra_8478
- - - - - - 0x01647D 0B:846D: A2 E4     LDX #$E4
- - - - - - 0x01647F 0B:846F: D0 07     BNE bra_8478
bra_8471:
C - - - - - 0x016481 0B:8471: A2 1C     LDX #$1C
C - - - - - 0x016483 0B:8473: 4A        LSR
C - - - - - 0x016484 0B:8474: 90 02     BCC bra_8478
C - - - - - 0x016486 0B:8476: A2 8C     LDX #$8C
bra_8478:
C - - - - - 0x016488 0B:8478: 8E E1 05  STX ram_05E1
C - - - - - 0x01648B 0B:847B: 8D E2 05  STA ram_05E2
C - - - - - 0x01648E 0B:847E: 60        RTS

sub_847F:
C - - - - - 0x01648F 0B:847F: A0 05     LDY #$05
C - - - - - 0x016491 0B:8481: 2C 2A 05  BIT ram_флаг_зеркала_анимации
C - - - - - 0x016494 0B:8484: 50 02     BVC bra_8488
C - - - - - 0x016496 0B:8486: C8        INY
C - - - - - 0x016497 0B:8487: C8        INY
bra_8488:
C - - - - - 0x016498 0B:8488: B1 52     LDA (ram_0052),Y
C - - - - - 0x01649A 0B:848A: AA        TAX
C - - - - - 0x01649B 0B:848B: C8        INY
C - - - - - 0x01649C 0B:848C: B1 52     LDA (ram_0052),Y
C - - - - - 0x01649E 0B:848E: 85 53     STA ram_0053
C - - - - - 0x0164A0 0B:8490: 86 52     STX ram_0052
C - - - - - 0x0164A2 0B:8492: 60        RTS
loc_8493:
C D - - - - 0x0164A3 0B:8493: A9 05     LDA #$05
C - - - - - 0x0164A5 0B:8495: 18        CLC
C - - - - - 0x0164A6 0B:8496: 65 52     ADC ram_0052
C - - - - - 0x0164A8 0B:8498: 85 5B     STA ram_005B
C - - - - - 0x0164AA 0B:849A: A5 53     LDA ram_0053
C - - - - - 0x0164AC 0B:849C: 69 00     ADC #$00
C - - - - - 0x0164AE 0B:849E: 85 5C     STA ram_005C
C - - - - - 0x0164B0 0B:84A0: 60        RTS

sub_0x0164B1:
sub_84A1:
C D - - - - 0x0164B1 0B:84A1: A2 02     LDX #$02
C - - - - - 0x0164B3 0B:84A3: C9 80     CMP #$80
C - - - - - 0x0164B5 0B:84A5: B0 06     BCS bra_84AD
C - - - - - 0x0164B7 0B:84A7: CA        DEX
C - - - - - 0x0164B8 0B:84A8: C9 40     CMP #$40
C - - - - - 0x0164BA 0B:84AA: B0 01     BCS bra_84AD
C - - - - - 0x0164BC 0B:84AC: CA        DEX
bra_84AD:
C - - - - - 0x0164BD 0B:84AD: A0 74     LDY #$74
C - - - - - 0x0164BF 0B:84AF: 29 3F     AND #$3F
C - - - - - 0x0164C1 0B:84B1: C9 20     CMP #$20
C - - - - - 0x0164C3 0B:84B3: B0 06     BCS bra_84BB
C - - - - - 0x0164C5 0B:84B5: A0 E4     LDY #$E4
C - - - - - 0x0164C7 0B:84B7: 8A        TXA
C - - - - - 0x0164C8 0B:84B8: 49 02     EOR #$02
C - - - - - 0x0164CA 0B:84BA: AA        TAX
bra_84BB:
C - - - - - 0x0164CB 0B:84BB: A5 20     LDA ram_0020
C - - - - - 0x0164CD 0B:84BD: 29 FC     AND #$FC
C - - - - - 0x0164CF 0B:84BF: 85 20     STA ram_0020
C - - - - - 0x0164D1 0B:84C1: 8A        TXA
C - - - - - 0x0164D2 0B:84C2: 05 20     ORA ram_0020
C - - - - - 0x0164D4 0B:84C4: 85 20     STA ram_0020
C - - - - - 0x0164D6 0B:84C6: 84 4B     STY ram_004B
C - - - - - 0x0164D8 0B:84C8: AD CB 05  LDA ram_для_046B_mirroring
C - - - - - 0x0164DB 0B:84CB: 8D 6B 04  STA ram_mirroring
C - - - - - 0x0164DE 0B:84CE: 60        RTS

sub_84CF:
C - - - - - 0x0164DF 0B:84CF: 20 F4 84  JSR sub_84F4
C - - - - - 0x0164E2 0B:84D2: 8E DE 05  STX ram_05DE
C - - - - - 0x0164E5 0B:84D5: 8C DF 05  STY ram_05DF
C - - - - - 0x0164E8 0B:84D8: 60        RTS

sub_84D9:
C - - - - - 0x0164E9 0B:84D9: 20 F4 84  JSR sub_84F4
C - - - - - 0x0164EC 0B:84DC: 2C 2A 05  BIT ram_флаг_зеркала_анимации
C - - - - - 0x0164EF 0B:84DF: 50 0C     BVC bra_84ED
C - - - - - 0x0164F1 0B:84E1: 8A        TXA
C - - - - - 0x0164F2 0B:84E2: 49 FF     EOR #$FF
C - - - - - 0x0164F4 0B:84E4: AA        TAX
C - - - - - 0x0164F5 0B:84E5: 98        TYA
C - - - - - 0x0164F6 0B:84E6: 49 FF     EOR #$FF
C - - - - - 0x0164F8 0B:84E8: A8        TAY
C - - - - - 0x0164F9 0B:84E9: E8        INX
C - - - - - 0x0164FA 0B:84EA: D0 01     BNE bra_84ED
C - - - - - 0x0164FC 0B:84EC: C8        INY
bra_84ED:
C - - - - - 0x0164FD 0B:84ED: 8E DE 05  STX ram_05DE
C - - - - - 0x016500 0B:84F0: 8C DF 05  STY ram_05DF
C - - - - - 0x016503 0B:84F3: 60        RTS

sub_84F4:
C - - - - - 0x016504 0B:84F4: A0 02     LDY #$02
C - - - - - 0x016506 0B:84F6: B1 52     LDA (ram_0052),Y
C - - - - - 0x016508 0B:84F8: AA        TAX
C - - - - - 0x016509 0B:84F9: C8        INY
C - - - - - 0x01650A 0B:84FA: B1 52     LDA (ram_0052),Y
C - - - - - 0x01650C 0B:84FC: A8        TAY
C - - - - - 0x01650D 0B:84FD: C9 80     CMP #$80
C - - - - - 0x01650F 0B:84FF: F0 01     BEQ bra_8502
C - - - - - 0x016511 0B:8501: 60        RTS
bra_8502:
C - - - - - 0x016512 0B:8502: AD 1D 06  LDA ram_сила_действия_hi
C - - - - - 0x016515 0B:8505: 85 3A     STA ram_003A
C - - - - - 0x016517 0B:8507: AD 1C 06  LDA ram_сила_действия_lo
C - - - - - 0x01651A 0B:850A: 0A        ASL
C - - - - - 0x01651B 0B:850B: 26 3A     ROL ram_003A
C - - - - - 0x01651D 0B:850D: 0A        ASL
C - - - - - 0x01651E 0B:850E: 26 3A     ROL ram_003A
C - - - - - 0x016520 0B:8510: 0A        ASL
C - - - - - 0x016521 0B:8511: 26 3A     ROL ram_003A
C - - - - - 0x016523 0B:8513: E0 01     CPX #$01
C - - - - - 0x016525 0B:8515: F0 03     BEQ bra_851A
C - - - - - 0x016527 0B:8517: 0A        ASL
C - - - - - 0x016528 0B:8518: 26 3A     ROL ram_003A
bra_851A:
C - - - - - 0x01652A 0B:851A: A4 3A     LDY ram_003A
C - - - - - 0x01652C 0B:851C: 18        CLC
C - - - - - 0x01652D 0B:851D: 69 C0     ADC #$C0
C - - - - - 0x01652F 0B:851F: AA        TAX
C - - - - - 0x016530 0B:8520: 98        TYA
C - - - - - 0x016531 0B:8521: 69 00     ADC #$00
C - - - - - 0x016533 0B:8523: A8        TAY
C - - - - - 0x016534 0B:8524: 60        RTS

sub_8525:
C - - - - - 0x016535 0B:8525: 8C C8 05  STY ram_05C8
C - - - - - 0x016538 0B:8528: 48        PHA
C - - - - - 0x016539 0B:8529: AA        TAX
C - - - - - 0x01653A 0B:852A: A9 EE     LDA #< tbl_86EE
C - - - - - 0x01653C 0B:852C: 85 54     STA ram_0054
C - - - - - 0x01653E 0B:852E: A9 86     LDA #> tbl_86EE
C - - - - - 0x016540 0B:8530: 85 55     STA ram_0055
C - - - - - 0x016542 0B:8532: 8A        TXA
C - - - - - 0x016543 0B:8533: 0A        ASL
C - - - - - 0x016544 0B:8534: 90 02     BCC bra_8538_not_overflow
C - - - - - 0x016546 0B:8536: E6 55     INC ram_0055
bra_8538_not_overflow:
C - - - - - 0x016548 0B:8538: A8        TAY
C - - - - - 0x016549 0B:8539: B1 54     LDA (ram_0054),Y
C - - - - - 0x01654B 0B:853B: 09 80     ORA #$80
C - - - - - 0x01654D 0B:853D: 8D 26 05  STA ram_0526
C - - - - - 0x016550 0B:8540: C8        INY
C - - - - - 0x016551 0B:8541: B1 54     LDA (ram_0054),Y
C - - - - - 0x016553 0B:8543: 8D 27 05  STA ram_0527
C - - - - - 0x016556 0B:8546: 68        PLA
C - - - - - 0x016557 0B:8547: 20 D3 86  JSR sub_86D3
C - - - - - 0x01655A 0B:854A: A2 00     LDX #$00
C - - - - - 0x01655C 0B:854C: 86 54     STX ram_0054
C - - - - - 0x01655E 0B:854E: 4A        LSR
C - - - - - 0x01655F 0B:854F: 66 54     ROR ram_0054
C - - - - - 0x016561 0B:8551: 4A        LSR
C - - - - - 0x016562 0B:8552: 66 54     ROR ram_0054
C - - - - - 0x016564 0B:8554: 4A        LSR
C - - - - - 0x016565 0B:8555: 66 54     ROR ram_0054
C - - - - - 0x016567 0B:8557: AA        TAX
C - - - - - 0x016568 0B:8558: A5 54     LDA ram_0054
C - - - - - 0x01656A 0B:855A: 18        CLC
C - - - - - 0x01656B 0B:855B: 69 64     ADC #< tbl_8B64
C - - - - - 0x01656D 0B:855D: 85 54     STA ram_0054
C - - - - - 0x01656F 0B:855F: 8A        TXA
C - - - - - 0x016570 0B:8560: 69 8B     ADC #> tbl_8B64
C - - - - - 0x016572 0B:8562: 85 55     STA ram_0055
C - - - - - 0x016574 0B:8564: A9 20     LDA #$20
C - - - - - 0x016576 0B:8566: 8D C9 05  STA ram_05C9
C - - - - - 0x016579 0B:8569: AD CA 05  LDA ram_05CA
C - - - - - 0x01657C 0B:856C: 48        PHA
bra_856D_loop:
loc_856D:
C D - - - - 0x01657D 0B:856D: A9 01     LDA #$01
C - - - - - 0x01657F 0B:856F: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x016582 0B:8572: AD 15 05  LDA ram_0515
C - - - - - 0x016585 0B:8575: D0 F6     BNE bra_856D_loop
C - - - - - 0x016587 0B:8577: A9 01     LDA #$01
C - - - - - 0x016589 0B:8579: 8D 15 05  STA ram_0515
C - - - - - 0x01658C 0B:857C: A9 00     LDA #$00
C - - - - - 0x01658E 0B:857E: 8D C7 05  STA ram_05C7
C - - - - - 0x016591 0B:8581: A9 03     LDA #$03
bra_8583_loop:
C - - - - - 0x016593 0B:8583: AA        TAX
C - - - - - 0x016594 0B:8584: 68        PLA
C - - - - - 0x016595 0B:8585: 8D CA 05  STA ram_05CA
C - - - - - 0x016598 0B:8588: 48        PHA
C - - - - - 0x016599 0B:8589: 8A        TXA
C - - - - - 0x01659A 0B:858A: 48        PHA
C - - - - - 0x01659B 0B:858B: A9 20     LDA #$20
C - - - - - 0x01659D 0B:858D: 38        SEC
C - - - - - 0x01659E 0B:858E: ED C9 05  SBC ram_05C9
C - - - - - 0x0165A1 0B:8591: A8        TAY
C - - - - - 0x0165A2 0B:8592: B1 54     LDA (ram_0054),Y
C - - - - - 0x0165A4 0B:8594: AE C7 05  LDX ram_05C7
C - - - - - 0x0165A7 0B:8597: AC C8 05  LDY ram_05C8
C - - - - - 0x0165AA 0B:859A: 20 C2 85  JSR sub_85C2
C - - - - - 0x0165AD 0B:859D: 8E C7 05  STX ram_05C7
C - - - - - 0x0165B0 0B:85A0: EE C8 05  INC ram_05C8
C - - - - - 0x0165B3 0B:85A3: 68        PLA
C - - - - - 0x0165B4 0B:85A4: CE C9 05  DEC ram_05C9
C - - - - - 0x0165B7 0B:85A7: F0 0D     BEQ bra_85B6
C - - - - - 0x0165B9 0B:85A9: 38        SEC
C - - - - - 0x0165BA 0B:85AA: E9 01     SBC #$01
C - - - - - 0x0165BC 0B:85AC: D0 D5     BNE bra_8583_loop
C - - - - - 0x0165BE 0B:85AE: A9 80     LDA #$80
C - - - - - 0x0165C0 0B:85B0: 8D 15 05  STA ram_0515
C - - - - - 0x0165C3 0B:85B3: 4C 6D 85  JMP loc_856D
bra_85B6:
C - - - - - 0x0165C6 0B:85B6: 68        PLA
C - - - - - 0x0165C7 0B:85B7: A9 80     LDA #$80
C - - - - - 0x0165C9 0B:85B9: 8D 15 05  STA ram_0515
C - - - - - 0x0165CC 0B:85BC: A9 01     LDA #$01
C - - - - - 0x0165CE 0B:85BE: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x0165D1 0B:85C1: 60        RTS

sub_85C2:
C - - - - - 0x0165D2 0B:85C2: 85 56     STA ram_0056
C - - - - - 0x0165D4 0B:85C4: 98        TYA
C - - - - - 0x0165D5 0B:85C5: 29 07     AND #$07
C - - - - - 0x0165D7 0B:85C7: 0A        ASL
C - - - - - 0x0165D8 0B:85C8: 0A        ASL
C - - - - - 0x0165D9 0B:85C9: 9D A6 04  STA ram_04A6,X
C - - - - - 0x0165DC 0B:85CC: A9 00     LDA #$00
C - - - - - 0x0165DE 0B:85CE: 9D A7 04  STA ram_04A7,X
C - - - - - 0x0165E1 0B:85D1: 98        TYA
C - - - - - 0x0165E2 0B:85D2: 29 38     AND #$38
C - - - - - 0x0165E4 0B:85D4: 0A        ASL
C - - - - - 0x0165E5 0B:85D5: 0A        ASL
C - - - - - 0x0165E6 0B:85D6: 0A        ASL
C - - - - - 0x0165E7 0B:85D7: 3E A7 04  ROL ram_04A7,X
C - - - - - 0x0165EA 0B:85DA: 0A        ASL
C - - - - - 0x0165EB 0B:85DB: 3E A7 04  ROL ram_04A7,X
C - - - - - 0x0165EE 0B:85DE: 1D A6 04  ORA ram_04A6,X
C - - - - - 0x0165F1 0B:85E1: 9D A6 04  STA ram_04A6,X
C - - - - - 0x0165F4 0B:85E4: 98        TYA
C - - - - - 0x0165F5 0B:85E5: 29 C0     AND #$C0
C - - - - - 0x0165F7 0B:85E7: 4A        LSR
C - - - - - 0x0165F8 0B:85E8: 4A        LSR
C - - - - - 0x0165F9 0B:85E9: 4A        LSR
C - - - - - 0x0165FA 0B:85EA: 4A        LSR
C - - - - - 0x0165FB 0B:85EB: 09 20     ORA #$20
C - - - - - 0x0165FD 0B:85ED: 1D A7 04  ORA ram_04A7,X
C - - - - - 0x016600 0B:85F0: 9D A7 04  STA ram_04A7,X
C - - - - - 0x016603 0B:85F3: 9D AE 04  STA ram_04AE,X
C - - - - - 0x016606 0B:85F6: 9D B5 04  STA ram_04B5,X
C - - - - - 0x016609 0B:85F9: 9D BC 04  STA ram_04BC,X
C - - - - - 0x01660C 0B:85FC: BD A6 04  LDA ram_04A6,X
C - - - - - 0x01660F 0B:85FF: 18        CLC
C - - - - - 0x016610 0B:8600: 69 20     ADC #$20
C - - - - - 0x016612 0B:8602: 9D AD 04  STA ram_04AD,X
C - - - - - 0x016615 0B:8605: 69 20     ADC #$20
C - - - - - 0x016617 0B:8607: 9D B4 04  STA ram_04B4,X
C - - - - - 0x01661A 0B:860A: 69 20     ADC #$20
C - - - - - 0x01661C 0B:860C: 9D BB 04  STA ram_04BB,X
C - - - - - 0x01661F 0B:860F: 98        TYA
C - - - - - 0x016620 0B:8610: 29 3F     AND #$3F
C - - - - - 0x016622 0B:8612: 09 C0     ORA #$C0
C - - - - - 0x016624 0B:8614: 9D C2 04  STA ram_04C2,X
C - - - - - 0x016627 0B:8617: 98        TYA
C - - - - - 0x016628 0B:8618: 29 C0     AND #$C0
C - - - - - 0x01662A 0B:861A: 4A        LSR
C - - - - - 0x01662B 0B:861B: 4A        LSR
C - - - - - 0x01662C 0B:861C: 4A        LSR
C - - - - - 0x01662D 0B:861D: 4A        LSR
C - - - - - 0x01662E 0B:861E: 09 23     ORA #$23
C - - - - - 0x016630 0B:8620: 9D C3 04  STA ram_04C3,X
C - - - - - 0x016633 0B:8623: A9 04     LDA #$04
C - - - - - 0x016635 0B:8625: 9D A5 04  STA ram_04A5,X
C - - - - - 0x016638 0B:8628: 9D AC 04  STA ram_04AC,X
C - - - - - 0x01663B 0B:862B: 9D B3 04  STA ram_04B3,X
C - - - - - 0x01663E 0B:862E: 9D BA 04  STA ram_04BA,X
C - - - - - 0x016641 0B:8631: A9 01     LDA #$01
C - - - - - 0x016643 0B:8633: 9D C1 04  STA ram_04C1,X
C - - - - - 0x016646 0B:8636: 98        TYA
C - - - - - 0x016647 0B:8637: 48        PHA
C - - - - - 0x016648 0B:8638: 8A        TXA
C - - - - - 0x016649 0B:8639: 48        PHA
; срабатывает перед матчем
C - - - - - 0x01664A 0B:863A: A4 56     LDY ram_0056
C - - - - - 0x01664C 0B:863C: A9 E4     LDA #< tbl_9BE4
C - - - - - 0x01664E 0B:863E: 85 56     STA ram_0056
C - - - - - 0x016650 0B:8640: AD CA 05  LDA ram_05CA
C - - - - - 0x016653 0B:8643: 18        CLC
C - - - - - 0x016654 0B:8644: 69 9B     ADC #> tbl_9BE4
C - - - - - 0x016656 0B:8646: 85 57     STA ram_0057
C - - - - - 0x016658 0B:8648: B1 56     LDA (ram_0056),Y
C - - - - - 0x01665A 0B:864A: 9D C4 04  STA ram_04C4,X
C - - - - - 0x01665D 0B:864D: AD CA 05  LDA ram_05CA
C - - - - - 0x016660 0B:8650: 85 3A     STA ram_003A
C - - - - - 0x016662 0B:8652: A9 00     LDA #$00
C - - - - - 0x016664 0B:8654: 85 56     STA ram_0056
C - - - - - 0x016666 0B:8656: 98        TYA
C - - - - - 0x016667 0B:8657: 46 3A     LSR ram_003A
C - - - - - 0x016669 0B:8659: 6A        ROR
C - - - - - 0x01666A 0B:865A: 66 56     ROR ram_0056
C - - - - - 0x01666C 0B:865C: 46 3A     LSR ram_003A
C - - - - - 0x01666E 0B:865E: 6A        ROR
C - - - - - 0x01666F 0B:865F: 66 56     ROR ram_0056
C - - - - - 0x016671 0B:8661: 4A        LSR
C - - - - - 0x016672 0B:8662: 66 56     ROR ram_0056
C - - - - - 0x016674 0B:8664: 4A        LSR
C - - - - - 0x016675 0B:8665: 66 56     ROR ram_0056
C - - - - - 0x016677 0B:8667: 48        PHA
C - - - - - 0x016678 0B:8668: 29 1F     AND #$1F
C - - - - - 0x01667A 0B:866A: 09 A0     ORA #$A0
C - - - - - 0x01667C 0B:866C: 85 57     STA ram_0057
C - - - - - 0x01667E 0B:866E: 68        PLA
C - - - - - 0x01667F 0B:866F: 29 20     AND #$20
C - - - - - 0x016681 0B:8671: 08        PHP
C - - - - - 0x016682 0B:8672: A9 12     LDA #con_prg_bank + $92
C - - - - - 0x016684 0B:8674: 28        PLP
C - - - - - 0x016685 0B:8675: F0 02     BEQ bra_8679
C - - - - - 0x016687 0B:8677: A9 13     LDA #con_prg_bank + $93
bra_8679:
C - - - - - 0x016694 0B:8684: 8D 25 00  STA ram_для_5115
C - - - - - 0x016697 0B:8687: 8D 01 80  STA $5115
C - - - - - 0x01669A 0B:868A: A9 04     LDA #$04
C - - - - - 0x01669C 0B:868C: A0 00     LDY #$00
bra_868E_loop:
C - - - - - 0x01669E 0B:868E: 48        PHA
C - - - - - 0x01669F 0B:868F: A9 04     LDA #$04
bra_8691_loop:
C - - - - - 0x0166A1 0B:8691: 48        PHA
C - - - - - 0x0166A2 0B:8692: B1 56     LDA (ram_0056),Y
C - - - - - 0x0166A4 0B:8694: 9D A8 04  STA ram_04A8,X
C - - - - - 0x0166A7 0B:8697: E8        INX
C - - - - - 0x0166A8 0B:8698: C8        INY
C - - - - - 0x0166A9 0B:8699: 68        PLA
C - - - - - 0x0166AA 0B:869A: 38        SEC
C - - - - - 0x0166AB 0B:869B: E9 01     SBC #$01
C - - - - - 0x0166AD 0B:869D: D0 F2     BNE bra_8691_loop
C - - - - - 0x0166AF 0B:869F: E8        INX
C - - - - - 0x0166B0 0B:86A0: E8        INX
C - - - - - 0x0166B1 0B:86A1: E8        INX
C - - - - - 0x0166B2 0B:86A2: 68        PLA
C - - - - - 0x0166B3 0B:86A3: 38        SEC
C - - - - - 0x0166B4 0B:86A4: E9 01     SBC #$01
C - - - - - 0x0166B6 0B:86A6: D0 E6     BNE bra_868E_loop
C - - - - - 0x0166B8 0B:86A8: 68        PLA
C - - - - - 0x0166B9 0B:86A9: AA        TAX
C - - - - - 0x0166BA 0B:86AA: A9 00     LDA #$00
C - - - - - 0x0166BC 0B:86AC: 9D C5 04  STA ram_04C5,X
C - - - - - 0x0166BF 0B:86AF: 68        PLA
C - - - - - 0x0166C0 0B:86B0: 29 3F     AND #$3F
C - - - - - 0x0166C2 0B:86B2: C9 38     CMP #$38
C - - - - - 0x0166C4 0B:86B4: B0 06     BCS bra_86BC
C - - - - - 0x0166C6 0B:86B6: 8A        TXA
C - - - - - 0x0166C7 0B:86B7: 18        CLC
C - - - - - 0x0166C8 0B:86B8: 69 20     ADC #$20
C - - - - - 0x0166CA 0B:86BA: AA        TAX
C - - - - - 0x0166CB 0B:86BB: 60        RTS
bra_86BC:
C - - - - - 0x0166CC 0B:86BC: 8A        TXA
C - - - - - 0x0166CD 0B:86BD: A8        TAY
C - - - - - 0x0166CE 0B:86BE: 18        CLC
C - - - - - 0x0166CF 0B:86BF: 69 12     ADC #$12
C - - - - - 0x0166D1 0B:86C1: AA        TAX
C - - - - - 0x0166D2 0B:86C2: A9 05     LDA #$05
bra_86C4_loop:
C - - - - - 0x0166D4 0B:86C4: 48        PHA
C - - - - - 0x0166D5 0B:86C5: B9 C1 04  LDA ram_04C1,Y
C - - - - - 0x0166D8 0B:86C8: 99 B3 04  STA ram_04B3,Y
C - - - - - 0x0166DB 0B:86CB: C8        INY
C - - - - - 0x0166DC 0B:86CC: 68        PLA
C - - - - - 0x0166DD 0B:86CD: 38        SEC
C - - - - - 0x0166DE 0B:86CE: E9 01     SBC #$01
C - - - - - 0x0166E0 0B:86D0: D0 F2     BNE bra_86C4_loop
C - - - - - 0x0166E2 0B:86D2: 60        RTS

sub_86D3:
C - - - - - 0x0166E3 0B:86D3: 48        PHA
C - - - - - 0x0166E4 0B:86D4: 29 03     AND #$03
C - - - - - 0x0166E6 0B:86D6: AA        TAX
C - - - - - 0x0166E7 0B:86D7: 68        PLA
C - - - - - 0x0166E8 0B:86D8: 48        PHA
C - - - - - 0x0166E9 0B:86D9: 4A        LSR
C - - - - - 0x0166EA 0B:86DA: 4A        LSR
C - - - - - 0x0166EB 0B:86DB: A8        TAY
C - - - - - 0x0166EC 0B:86DC: B9 42 8B  LDA tbl_8B42,Y
loc_86DF:
C D - - - - 0x0166EF 0B:86DF: CA        DEX
C - - - - - 0x0166F0 0B:86E0: 30 05     BMI bra_86E7
C - - - - - 0x0166F2 0B:86E2: 4A        LSR
C - - - - - 0x0166F3 0B:86E3: 4A        LSR
C - - - - - 0x0166F4 0B:86E4: 4C DF 86  JMP loc_86DF
bra_86E7:
C - - - - - 0x0166F7 0B:86E7: 29 03     AND #$03
C - - - - - 0x0166F9 0B:86E9: 8D CA 05  STA ram_05CA
C - - - - - 0x0166FC 0B:86EC: 68        PLA
C - - - - - 0x0166FD 0B:86ED: 60        RTS

tbl_86EE:
- D - I - - 0x0166FE 0B:86EE: 3C        .byte $3C   ; <9>
- D - I - - 0x0166FF 0B:86EF: 4A        .byte $4A   ; <コ>
- D - I - - 0x016700 0B:86F0: 3C        .byte $3C   ; <9>
- D - I - - 0x016701 0B:86F1: 4A        .byte $4A   ; <コ>
- D - I - - 0x016702 0B:86F2: 3C        .byte $3C   ; <9>
- D - I - - 0x016703 0B:86F3: 4A        .byte $4A   ; <コ>
- D - I - - 0x016704 0B:86F4: 3C        .byte $3C   ; <9>
- D - I - - 0x016705 0B:86F5: 4A        .byte $4A   ; <コ>
- D - I - - 0x016706 0B:86F6: 3C        .byte $3C   ; <9>
- D - I - - 0x016707 0B:86F7: 4A        .byte $4A   ; <コ>
- D - I - - 0x016708 0B:86F8: 3C        .byte $3C   ; <9>
- D - I - - 0x016709 0B:86F9: 4A        .byte $4A   ; <コ>
- D - I - - 0x01670A 0B:86FA: 3C        .byte $3C   ; <9>
- D - I - - 0x01670B 0B:86FB: 4A        .byte $4A   ; <コ>
- D - I - - 0x01670C 0B:86FC: 3C        .byte $3C   ; <9>
- D - I - - 0x01670D 0B:86FD: 4A        .byte $4A   ; <コ>
- - - - - - 0x01670E 0B:86FE: 3C        .byte $3C   ; <9>
- - - - - - 0x01670F 0B:86FF: 4A        .byte $4A   ; <コ>
- D - I - - 0x016710 0B:8700: 3C        .byte $3C   ; <9>
- D - I - - 0x016711 0B:8701: 4A        .byte $4A   ; <コ>
- D - I - - 0x016712 0B:8702: 3C        .byte $3C   ; <9>
- D - I - - 0x016713 0B:8703: 4A        .byte $4A   ; <コ>
- D - I - - 0x016714 0B:8704: 3C        .byte $3C   ; <9>
- D - I - - 0x016715 0B:8705: 4A        .byte $4A   ; <コ>
- D - I - - 0x016716 0B:8706: 3C        .byte $3C   ; <9>
- D - I - - 0x016717 0B:8707: 4A        .byte $4A   ; <コ>
- D - I - - 0x016718 0B:8708: 3C        .byte $3C   ; <9>
- D - I - - 0x016719 0B:8709: 4A        .byte $4A   ; <コ>
- D - I - - 0x01671A 0B:870A: 3C        .byte $3C   ; <9>
- D - I - - 0x01671B 0B:870B: 4A        .byte $4A   ; <コ>
- D - I - - 0x01671C 0B:870C: 3C        .byte $3C   ; <9>
- D - I - - 0x01671D 0B:870D: 4A        .byte $4A   ; <コ>
- D - I - - 0x01671E 0B:870E: 3C        .byte $3C   ; <9>
- D - I - - 0x01671F 0B:870F: 4A        .byte $4A   ; <コ>
- D - I - - 0x016720 0B:8710: 3C        .byte $3C   ; <9>
- D - I - - 0x016721 0B:8711: 4A        .byte $4A   ; <コ>
- D - I - - 0x016722 0B:8712: 3C        .byte $3C   ; <9>
- D - I - - 0x016723 0B:8713: 4A        .byte $4A   ; <コ>
- D - I - - 0x016724 0B:8714: 3C        .byte $3C   ; <9>
- D - I - - 0x016725 0B:8715: 4A        .byte $4A   ; <コ>
- D - I - - 0x016726 0B:8716: 54        .byte $54   ; <ト>
- D - I - - 0x016727 0B:8717: 56        .byte $56   ; <ニ>
- D - I - - 0x016728 0B:8718: 54        .byte $54   ; <ト>
- D - I - - 0x016729 0B:8719: 56        .byte $56   ; <ニ>
- D - I - - 0x01672A 0B:871A: 50        .byte $50   ; <タ>
- D - I - - 0x01672B 0B:871B: 52        .byte $52   ; <ツ>
- D - I - - 0x01672C 0B:871C: 50        .byte $50   ; <タ>
- D - I - - 0x01672D 0B:871D: 52        .byte $52   ; <ツ>
- - - - - - 0x01672E 0B:871E: 54        .byte $54   ; <ト>
- - - - - - 0x01672F 0B:871F: 56        .byte $56   ; <ニ>
- - - - - - 0x016730 0B:8720: 50        .byte $50   ; <タ>
- - - - - - 0x016731 0B:8721: 52        .byte $52   ; <ツ>
- D - I - - 0x016732 0B:8722: 54        .byte $54   ; <ト>
- D - I - - 0x016733 0B:8723: 56        .byte $56   ; <ニ>
- D - I - - 0x016734 0B:8724: 50        .byte $50   ; <タ>
- D - I - - 0x016735 0B:8725: 52        .byte $52   ; <ツ>
- D - I - - 0x016736 0B:8726: 54        .byte $54   ; <ト>
- D - I - - 0x016737 0B:8727: 56        .byte $56   ; <ニ>
- D - I - - 0x016738 0B:8728: 50        .byte $50   ; <タ>
- D - I - - 0x016739 0B:8729: 52        .byte $52   ; <ツ>
- D - I - - 0x01673A 0B:872A: 54        .byte $54   ; <ト>
- D - I - - 0x01673B 0B:872B: 56        .byte $56   ; <ニ>
- D - I - - 0x01673C 0B:872C: 50        .byte $50   ; <タ>
- D - I - - 0x01673D 0B:872D: 52        .byte $52   ; <ツ>
- D - I - - 0x01673E 0B:872E: 3C        .byte $3C   ; <9>
- D - I - - 0x01673F 0B:872F: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016740 0B:8730: 3C        .byte $3C   ; <9>
- D - I - - 0x016741 0B:8731: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016742 0B:8732: 4C        .byte $4C   ; <シ>
- D - I - - 0x016743 0B:8733: 2E        .byte $2E   ; <ん>
- D - I - - 0x016744 0B:8734: 4E        .byte $4E   ; <セ>
- D - I - - 0x016745 0B:8735: 2E        .byte $2E   ; <ん>
- D - I - - 0x016746 0B:8736: 60        .byte $60   ; <ミ>
- D - I - - 0x016747 0B:8737: 62        .byte $62   ; <メ>
- D - I - - 0x016748 0B:8738: 3C        .byte $3C   ; <9>
- D - I - - 0x016749 0B:8739: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01674A 0B:873A: 3A        .byte $3A   ; <7>
- D - I - - 0x01674B 0B:873B: 00        .byte $00
- D - I - - 0x01674C 0B:873C: 3A        .byte $3A   ; <7>
- D - I - - 0x01674D 0B:873D: 00        .byte $00
- D - I - - 0x01674E 0B:873E: 3A        .byte $3A   ; <7>
- D - I - - 0x01674F 0B:873F: 00        .byte $00
- D - I - - 0x016750 0B:8740: 3A        .byte $3A   ; <7>
- D - I - - 0x016751 0B:8741: 00        .byte $00
- D - I - - 0x016752 0B:8742: 38        .byte $38   ; <5>
- D - I - - 0x016753 0B:8743: 00        .byte $00
- D - I - - 0x016754 0B:8744: 38        .byte $38   ; <5>
- D - I - - 0x016755 0B:8745: 00        .byte $00
- D - I - - 0x016756 0B:8746: 60        .byte $60   ; <ミ>
- D - I - - 0x016757 0B:8747: 62        .byte $62   ; <メ>
- D - I - - 0x016758 0B:8748: 00        .byte $00
- D - I - - 0x016759 0B:8749: 02        .byte $02   ; <い>
- D - I - - 0x01675A 0B:874A: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01675B 0B:874B: 00        .byte $00
- D - I - - 0x01675C 0B:874C: 3C        .byte $3C   ; <9>
- D - I - - 0x01675D 0B:874D: 4A        .byte $4A   ; <コ>
- D - I - - 0x01675E 0B:874E: 2E        .byte $2E   ; <ん>
- D - I - - 0x01675F 0B:874F: 3C        .byte $3C   ; <9>
- D - I - - 0x016760 0B:8750: 3C        .byte $3C   ; <9>
- D - I - - 0x016761 0B:8751: 46        .byte $46   ; <カ>
- D - I - - 0x016762 0B:8752: 3C        .byte $3C   ; <9>
- D - I - - 0x016763 0B:8753: 46        .byte $46   ; <カ>
- D - I - - 0x016764 0B:8754: 3C        .byte $3C   ; <9>
- D - I - - 0x016765 0B:8755: 4A        .byte $4A   ; <コ>
- D - I - - 0x016766 0B:8756: 3C        .byte $3C   ; <9>
- D - I - - 0x016767 0B:8757: 4A        .byte $4A   ; <コ>
- D - I - - 0x016768 0B:8758: 00        .byte $00
- D - I - - 0x016769 0B:8759: 3C        .byte $3C   ; <9>
- D - I - - 0x01676A 0B:875A: 00        .byte $00
- D - I - - 0x01676B 0B:875B: 3C        .byte $3C   ; <9>
- D - I - - 0x01676C 0B:875C: 3C        .byte $3C   ; <9>
- D - I - - 0x01676D 0B:875D: 4A        .byte $4A   ; <コ>
- D - I - - 0x01676E 0B:875E: 48        .byte $48   ; <ク>
- D - I - - 0x01676F 0B:875F: 42        .byte $42   ; <イ>
- D - I - - 0x016770 0B:8760: 48        .byte $48   ; <ク>
- D - I - - 0x016771 0B:8761: 42        .byte $42   ; <イ>
- D - I - - 0x016772 0B:8762: 48        .byte $48   ; <ク>
- D - I - - 0x016773 0B:8763: 42        .byte $42   ; <イ>
- D - I - - 0x016774 0B:8764: 48        .byte $48   ; <ク>
- D - I - - 0x016775 0B:8765: 42        .byte $42   ; <イ>
- D - I - - 0x016776 0B:8766: 48        .byte $48   ; <ク>
- D - I - - 0x016777 0B:8767: 42        .byte $42   ; <イ>
- D - I - - 0x016778 0B:8768: 48        .byte $48   ; <ク>
- D - I - - 0x016779 0B:8769: 42        .byte $42   ; <イ>
- D - I - - 0x01677A 0B:876A: 48        .byte $48   ; <ク>
- D - I - - 0x01677B 0B:876B: 42        .byte $42   ; <イ>
- D - I - - 0x01677C 0B:876C: 48        .byte $48   ; <ク>
- D - I - - 0x01677D 0B:876D: 42        .byte $42   ; <イ>
- D - I - - 0x01677E 0B:876E: 3C        .byte $3C   ; <9>
- D - I - - 0x01677F 0B:876F: 2E        .byte $2E   ; <ん>
- D - I - - 0x016780 0B:8770: 3C        .byte $3C   ; <9>
- D - I - - 0x016781 0B:8771: 04        .byte $04   ; <え>
- D - I - - 0x016782 0B:8772: 3C        .byte $3C   ; <9>
- D - I - - 0x016783 0B:8773: 2C        .byte $2C   ; <わ>
- D - I - - 0x016784 0B:8774: 3C        .byte $3C   ; <9>
- D - I - - 0x016785 0B:8775: 2C        .byte $2C   ; <わ>
- D - I - - 0x016786 0B:8776: 56        .byte $56   ; <ニ>
- D - I - - 0x016787 0B:8777: 00        .byte $00
- D - I - - 0x016788 0B:8778: 56        .byte $56   ; <ニ>
- D - I - - 0x016789 0B:8779: 00        .byte $00
- D - I - - 0x01678A 0B:877A: 50        .byte $50   ; <タ>
- D - I - - 0x01678B 0B:877B: 52        .byte $52   ; <ツ>
- D - I - - 0x01678C 0B:877C: 3C        .byte $3C   ; <9>
- D - I - - 0x01678D 0B:877D: 52        .byte $52   ; <ツ>
- D - I - - 0x01678E 0B:877E: 3C        .byte $3C   ; <9>
- D - I - - 0x01678F 0B:877F: 52        .byte $52   ; <ツ>
- D - I - - 0x016790 0B:8780: 3C        .byte $3C   ; <9>
- D - I - - 0x016791 0B:8781: 52        .byte $52   ; <ツ>
- D - I - - 0x016792 0B:8782: 3C        .byte $3C   ; <9>
- D - I - - 0x016793 0B:8783: 44        .byte $44   ; <エ>
- - - - - - 0x016794 0B:8784: 3C        .byte $3C   ; <9>
- - - - - - 0x016795 0B:8785: 44        .byte $44   ; <エ>
- D - I - - 0x016796 0B:8786: 3C        .byte $3C   ; <9>
- D - I - - 0x016797 0B:8787: 44        .byte $44   ; <エ>
- - - - - - 0x016798 0B:8788: 3C        .byte $3C   ; <9>
- - - - - - 0x016799 0B:8789: 44        .byte $44   ; <エ>
- D - I - - 0x01679A 0B:878A: 3C        .byte $3C   ; <9>
- D - I - - 0x01679B 0B:878B: 00        .byte $00
- D - I - - 0x01679C 0B:878C: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01679D 0B:878D: 00        .byte $00
- D - I - - 0x01679E 0B:878E: 3C        .byte $3C   ; <9>
- D - I - - 0x01679F 0B:878F: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167A0 0B:8790: 3C        .byte $3C   ; <9>
- D - I - - 0x0167A1 0B:8791: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167A2 0B:8792: 3C        .byte $3C   ; <9>
- D - I - - 0x0167A3 0B:8793: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167A4 0B:8794: 4C        .byte $4C   ; <シ>
- D - I - - 0x0167A5 0B:8795: 00        .byte $00
- D - I - - 0x0167A6 0B:8796: 4C        .byte $4C   ; <シ>
- D - I - - 0x0167A7 0B:8797: 00        .byte $00
- D - I - - 0x0167A8 0B:8798: 50        .byte $50   ; <タ>
- D - I - - 0x0167A9 0B:8799: 52        .byte $52   ; <ツ>
- D - I - - 0x0167AA 0B:879A: 3C        .byte $3C   ; <9>
- D - I - - 0x0167AB 0B:879B: 2E        .byte $2E   ; <ん>
- D - I - - 0x0167AC 0B:879C: 3C        .byte $3C   ; <9>
- D - I - - 0x0167AD 0B:879D: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167AE 0B:879E: 3C        .byte $3C   ; <9>
- D - I - - 0x0167AF 0B:879F: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167B0 0B:87A0: 3C        .byte $3C   ; <9>
- D - I - - 0x0167B1 0B:87A1: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167B2 0B:87A2: 42        .byte $42   ; <イ>
- D - I - - 0x0167B3 0B:87A3: 44        .byte $44   ; <エ>
- D - I - - 0x0167B4 0B:87A4: 42        .byte $42   ; <イ>
- D - I - - 0x0167B5 0B:87A5: 44        .byte $44   ; <エ>
- D - I - - 0x0167B6 0B:87A6: 42        .byte $42   ; <イ>
- D - I - - 0x0167B7 0B:87A7: 44        .byte $44   ; <エ>
- D - I - - 0x0167B8 0B:87A8: 06        .byte $06   ; <か>
- D - I - - 0x0167B9 0B:87A9: 3D        .byte $3D   ; <+>
- D - I - - 0x0167BA 0B:87AA: 06        .byte $06   ; <か>
- D - I - - 0x0167BB 0B:87AB: 3C        .byte $3C   ; <9>
- D - I - - 0x0167BC 0B:87AC: 06        .byte $06   ; <か>
- D - I - - 0x0167BD 0B:87AD: 00        .byte $00
- D - I - - 0x0167BE 0B:87AE: 06        .byte $06   ; <か>
- D - I - - 0x0167BF 0B:87AF: 3C        .byte $3C   ; <9>
- - - - - - 0x0167C0 0B:87B0: 48        .byte $48   ; <ク>
- - - - - - 0x0167C1 0B:87B1: 42        .byte $42   ; <イ>
- - - - - - 0x0167C2 0B:87B2: 3C        .byte $3C   ; <9>
- - - - - - 0x0167C3 0B:87B3: 4A        .byte $4A   ; <コ>
- - - - - - 0x0167C4 0B:87B4: 3C        .byte $3C   ; <9>
- - - - - - 0x0167C5 0B:87B5: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167C6 0B:87B6: 60        .byte $60   ; <ミ>
- D - I - - 0x0167C7 0B:87B7: 62        .byte $62   ; <メ>
- D - I - - 0x0167C8 0B:87B8: 48        .byte $48   ; <ク>
- D - I - - 0x0167C9 0B:87B9: 42        .byte $42   ; <イ>
- D - I - - 0x0167CA 0B:87BA: 48        .byte $48   ; <ク>
- D - I - - 0x0167CB 0B:87BB: 42        .byte $42   ; <イ>
- D - I - - 0x0167CC 0B:87BC: 48        .byte $48   ; <ク>
- D - I - - 0x0167CD 0B:87BD: 42        .byte $42   ; <イ>
- D - I - - 0x0167CE 0B:87BE: 48        .byte $48   ; <ク>
- D - I - - 0x0167CF 0B:87BF: 42        .byte $42   ; <イ>
- D - I - - 0x0167D0 0B:87C0: 48        .byte $48   ; <ク>
- D - I - - 0x0167D1 0B:87C1: 42        .byte $42   ; <イ>
- D - I - - 0x0167D2 0B:87C2: 52        .byte $52   ; <ツ>
- D - I - - 0x0167D3 0B:87C3: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167D4 0B:87C4: 3C        .byte $3C   ; <9>
- D - I - - 0x0167D5 0B:87C5: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167D6 0B:87C6: 40        .byte $40   ; <「>
- D - I - - 0x0167D7 0B:87C7: 00        .byte $00
- D - I - - 0x0167D8 0B:87C8: 40        .byte $40   ; <「>
- D - I - - 0x0167D9 0B:87C9: 00        .byte $00
- D - I - - 0x0167DA 0B:87CA: 06        .byte $06   ; <か>
- D - I - - 0x0167DB 0B:87CB: 3C        .byte $3C   ; <9>
- D - I - - 0x0167DC 0B:87CC: 40        .byte $40   ; <「>
- D - I - - 0x0167DD 0B:87CD: 3C        .byte $3C   ; <9>
- D - I - - 0x0167DE 0B:87CE: 58        .byte $58   ; <ネ>
- D - I - - 0x0167DF 0B:87CF: 5A        .byte $5A   ; <ハ>
- D - I - - 0x0167E0 0B:87D0: 58        .byte $58   ; <ネ>
- D - I - - 0x0167E1 0B:87D1: 5A        .byte $5A   ; <ハ>
- D - I - - 0x0167E2 0B:87D2: 58        .byte $58   ; <ネ>
- D - I - - 0x0167E3 0B:87D3: 5A        .byte $5A   ; <ハ>
- D - I - - 0x0167E4 0B:87D4: 3C        .byte $3C   ; <9>
- D - I - - 0x0167E5 0B:87D5: 4A        .byte $4A   ; <コ>
- - - - - - 0x0167E6 0B:87D6: 54        .byte $54   ; <ト>
- - - - - - 0x0167E7 0B:87D7: 56        .byte $56   ; <ニ>
- D - I - - 0x0167E8 0B:87D8: 3C        .byte $3C   ; <9>
- D - I - - 0x0167E9 0B:87D9: 2E        .byte $2E   ; <ん>
- D - I - - 0x0167EA 0B:87DA: 3C        .byte $3C   ; <9>
- D - I - - 0x0167EB 0B:87DB: 52        .byte $52   ; <ツ>
- D - I - - 0x0167EC 0B:87DC: 3C        .byte $3C   ; <9>
- D - I - - 0x0167ED 0B:87DD: 52        .byte $52   ; <ツ>
- - - - - - 0x0167EE 0B:87DE: 54        .byte $54   ; <ト>
- - - - - - 0x0167EF 0B:87DF: 56        .byte $56   ; <ニ>
- - - - - - 0x0167F0 0B:87E0: 50        .byte $50   ; <タ>
- - - - - - 0x0167F1 0B:87E1: 52        .byte $52   ; <ツ>
- D - I - - 0x0167F2 0B:87E2: 3C        .byte $3C   ; <9>
- D - I - - 0x0167F3 0B:87E3: 04        .byte $04   ; <え>
- D - I - - 0x0167F4 0B:87E4: 3C        .byte $3C   ; <9>
- D - I - - 0x0167F5 0B:87E5: 04        .byte $04   ; <え>
- D - I - - 0x0167F6 0B:87E6: 54        .byte $54   ; <ト>
- D - I - - 0x0167F7 0B:87E7: 56        .byte $56   ; <ニ>
- D - I - - 0x0167F8 0B:87E8: 54        .byte $54   ; <ト>
- D - I - - 0x0167F9 0B:87E9: 56        .byte $56   ; <ニ>
- D - I - - 0x0167FA 0B:87EA: 50        .byte $50   ; <タ>
- D - I - - 0x0167FB 0B:87EB: 52        .byte $52   ; <ツ>
- D - I - - 0x0167FC 0B:87EC: 56        .byte $56   ; <ニ>
- D - I - - 0x0167FD 0B:87ED: 4A        .byte $4A   ; <コ>
- D - I - - 0x0167FE 0B:87EE: 3A        .byte $3A   ; <7>
- D - I - - 0x0167FF 0B:87EF: 00        .byte $00
- D - I - - 0x016800 0B:87F0: 3A        .byte $3A   ; <7>
- D - I - - 0x016801 0B:87F1: 00        .byte $00
- D - I - - 0x016802 0B:87F2: 3A        .byte $3A   ; <7>
- D - I - - 0x016803 0B:87F3: 00        .byte $00
- D - I - - 0x016804 0B:87F4: 3C        .byte $3C   ; <9>
- D - I - - 0x016805 0B:87F5: 4A        .byte $4A   ; <コ>

tbl_87F6_фоны_анимаций:
- D - I - - 0x016806 0B:87F6: DE 88     .word off_88DE_00     ; 
- D - I - - 0x016808 0B:87F8: E3 88     .word off_88E3_01     ; 
- D - I - - 0x01680A 0B:87FA: E4 88     .word off_88E4_02     ; 
- D - I - - 0x01680C 0B:87FC: E7 88     .word off_88E7_03     ; 
- D - I - - 0x01680E 0B:87FE: ED 88     .word off_88ED_04     ; 
- D - I - - 0x016810 0B:8800: F3 88     .word off_88F3_05     ; 
- D - I - - 0x016812 0B:8802: F6 88     .word off_88F6_06     ; 
- D - I - - 0x016814 0B:8804: FC 88     .word off_88FC_07     ; 
- D - I - - 0x016816 0B:8806: 02 89     .word off_8902_08     ; 
- D - I - - 0x016818 0B:8808: 05 89     .word off_8905_09     ; 
- D - I - - 0x01681A 0B:880A: 08 89     .word off_8908_0A     ; 
- D - I - - 0x01681C 0B:880C: 0B 89     .word off_890B_0B     ; 
- D - I - - 0x01681E 0B:880E: 11 89     .word off_8911_0C     ; 
- D - I - - 0x016820 0B:8810: 14 89     .word off_8914_0D     ; 
- D - I - - 0x016822 0B:8812: 17 89     .word off_8917_0E     ; 
- D - I - - 0x016824 0B:8814: 1D 89     .word off_891D_0F     ; 
- D - I - - 0x016826 0B:8816: 23 89     .word off_8923_10     ; 
- D - I - - 0x016828 0B:8818: 26 89     .word off_8926_11     ; 
- D - I - - 0x01682A 0B:881A: 2C 89     .word off_892C_12     ; 
- D - I - - 0x01682C 0B:881C: 2F 89     .word off_892F_13     ; 
- D - I - - 0x01682E 0B:881E: 35 89     .word off_8935_14     ; 
- D - I - - 0x016830 0B:8820: 3B 89     .word off_893B_15     ; 
- D - I - - 0x016832 0B:8822: 41 89     .word off_8941_16     ; 
- D - I - - 0x016834 0B:8824: 44 89     .word off_8944_17     ; 
- D - I - - 0x016836 0B:8826: 4A 89     .word off_894A_18     ; 
- D - I - - 0x016838 0B:8828: 50 89     .word off_8950_19     ; 
- - - - - - 0x01683A 0B:882A: 55 89     .word off_8955_1A     ; ! unused байтов в сценариях не найдено
- D - I - - 0x01683C 0B:882C: 56 89     .word off_8956_1B     ; 
- D - I - - 0x01683E 0B:882E: 5B 89     .word off_895B_1C     ; 
- D - I - - 0x016840 0B:8830: 60 89     .word off_8960_1D     ; 
- D - I - - 0x016842 0B:8832: 65 89     .word off_8965_1E     ; 
- D - I - - 0x016844 0B:8834: 6A 89     .word off_896A_1F     ; 
- D - I - - 0x016846 0B:8836: 6F 89     .word off_896F_20     ; 
- - - - - - 0x016848 0B:8838: 74 89     .word off_8974_21     ; ! unused байтов в сценариях не найдено
- D - I - - 0x01684A 0B:883A: 7B 89     .word off_897B_22     ; 
- D - I - - 0x01684C 0B:883C: 80 89     .word off_8980_23     ; 
- D - I - - 0x01684E 0B:883E: 85 89     .word off_8985_24     ; 
- D - I - - 0x016850 0B:8840: 8A 89     .word off_898A_25     ; 
- D - I - - 0x016852 0B:8842: 8F 89     .word off_898F_26     ; 
- D - I - - 0x016854 0B:8844: 95 89     .word off_8995_27     ; 
- D - I - - 0x016856 0B:8846: 9A 89     .word off_899A_28     ; 
- D - I - - 0x016858 0B:8848: 9F 89     .word off_899F_29     ; 
- D - I - - 0x01685A 0B:884A: A4 89     .word off_89A4_2A     ; 
- D - I - - 0x01685C 0B:884C: A9 89     .word off_89A9_2B     ; 
- D - I - - 0x01685E 0B:884E: AF 89     .word off_89AF_2C     ; 
- D - I - - 0x016860 0B:8850: B2 89     .word off_89B2_2D     ; 
- D - I - - 0x016862 0B:8852: B5 89     .word off_89B5_2E     ; 
- D - I - - 0x016864 0B:8854: C2 89     .word off_89C2_2F     ; 
- D - I - - 0x016866 0B:8856: CF 89     .word off_89CF_30     ; 
- D - I - - 0x016868 0B:8858: D5 89     .word off_89D5_31     ; 
- D - I - - 0x01686A 0B:885A: DB 89     .word off_89DB_32     ; 
- D - I - - 0x01686C 0B:885C: DE 89     .word off_89DE_33     ; 
- D - I - - 0x01686E 0B:885E: E1 89     .word off_89E1_34     ; 
- D - I - - 0x016870 0B:8860: E4 89     .word off_89E4_35     ; 
- D - I - - 0x016872 0B:8862: E7 89     .word off_89E7_36     ; 
- D - I - - 0x016874 0B:8864: EA 89     .word off_89EA_37     ; 
- D - I - - 0x016876 0B:8866: ED 89     .word off_89ED_38     ; 
- D - I - - 0x016878 0B:8868: F0 89     .word off_89F0_39     ; 
- D - I - - 0x01687A 0B:886A: F3 89     .word off_89F3_3A     ; 
- - - - - - 0x01687C 0B:886C: F6 89     .word off_89F6_3B     ; ! unused байтов в сценариях не найдено
- D - I - - 0x01687E 0B:886E: FC 89     .word off_89FC_3C     ; 
- - - - - - 0x016880 0B:8870: FF 89     .word off_89FF_3D     ; ! unused байтов в сценариях не найдено
- D - I - - 0x016882 0B:8872: 04 8A     .word off_8A04_3E     ; 
- D - I - - 0x016884 0B:8874: 0A 8A     .word off_8A0A_3F     ; 
- D - I - - 0x016886 0B:8876: 11 8A     .word off_8A11_40     ; 
- D - I - - 0x016888 0B:8878: 17 8A     .word off_8A17_41     ; 
- D - I - - 0x01688A 0B:887A: 1A 8A     .word off_8A1A_42     ; 
- D - I - - 0x01688C 0B:887C: 20 8A     .word off_8A20_43     ; 
- D - I - - 0x01688E 0B:887E: 23 8A     .word off_8A23_44     ; 
- D - I - - 0x016890 0B:8880: 2A 8A     .word off_8A2A_45     ; 
- D - I - - 0x016892 0B:8882: 2D 8A     .word off_8A2D_46     ; 
- D - I - - 0x016894 0B:8884: 30 8A     .word off_8A30_47     ; 
- D - I - - 0x016896 0B:8886: 35 8A     .word off_8A35_48     ; 
- D - I - - 0x016898 0B:8888: 3A 8A     .word off_8A3A_49     ; 
- D - I - - 0x01689A 0B:888A: 41 8A     .word off_8A41_4A     ; 
- D - I - - 0x01689C 0B:888C: 48 8A     .word off_8A48_4B     ; 
- D - I - - 0x01689E 0B:888E: 4D 8A     .word off_8A4D_4C     ; 
- D - I - - 0x0168A0 0B:8890: 5C 8A     .word off_8A5C_4D     ; 
- D - I - - 0x0168A2 0B:8892: 61 8A     .word off_8A61_4E     ; 
- D - I - - 0x0168A4 0B:8894: 66 8A     .word off_8A66_4F     ; 
- - - - - - 0x0168A6 0B:8896: 69 8A     .word off_8A69_50     ; ! unused байтов в сценариях не найдено
- D - I - - 0x0168A8 0B:8898: 6E 8A     .word off_8A6E_51     ; 
- D - I - - 0x0168AA 0B:889A: 74 8A     .word off_8A74_52     ; 
- D - I - - 0x0168AC 0B:889C: 77 8A     .word off_8A77_53     ; 
- D - I - - 0x0168AE 0B:889E: 7D 8A     .word off_8A7D_54     ; 
- D - I - - 0x0168B0 0B:88A0: 8A 8A     .word off_8A8A_55     ; 
- D - I - - 0x0168B2 0B:88A2: 8D 8A     .word off_8A8D_56     ; 
- D - I - - 0x0168B4 0B:88A4: 92 8A     .word off_8A92_57     ; 
- D - I - - 0x0168B6 0B:88A6: 98 8A     .word off_8A98_58     ; 
- D - I - - 0x0168B8 0B:88A8: 9E 8A     .word off_8A9E_59     ; 
- D - I - - 0x0168BA 0B:88AA: A1 8A     .word off_8AA1_5A     ; 
- D - I - - 0x0168BC 0B:88AC: A6 8A     .word off_8AA6_5B     ; 
- D - I - - 0x0168BE 0B:88AE: AB 8A     .word off_8AAB_5C     ; 
- D - I - - 0x0168C0 0B:88B0: B2 8A     .word off_8AB2_5D     ; 
- D - I - - 0x0168C2 0B:88B2: B7 8A     .word off_8AB7_5E     ; 
- D - I - - 0x0168C4 0B:88B4: BC 8A     .word off_8ABC_5F     ; 
- D - I - - 0x0168C6 0B:88B6: C3 8A     .word off_8AC3_60     ; 
- D - I - - 0x0168C8 0B:88B8: C8 8A     .word off_8AC8_61     ; 
- D - I - - 0x0168CA 0B:88BA: CB 8A     .word off_8ACB_62     ; 
- D - I - - 0x0168CC 0B:88BC: D8 8A     .word off_8AD8_63     ; 
- D - I - - 0x0168CE 0B:88BE: DB 8A     .word off_8ADB_64     ; 
- D - I - - 0x0168D0 0B:88C0: E0 8A     .word off_8AE0_65     ; 
- - - - - - 0x0168D2 0B:88C2: E6 8A     .word off_8AE6_66     ; ! unused байтов в сценариях не найдено
- D - I - - 0x0168D4 0B:88C4: ED 8A     .word off_8AED_67     ; 
- D - I - - 0x0168D6 0B:88C6: F3 8A     .word off_8AF3_68     ; 
- D - I - - 0x0168D8 0B:88C8: F9 8A     .word off_8AF9_69     ; 
- D - I - - 0x0168DA 0B:88CA: FF 8A     .word off_8AFF_6A     ; 
- D - I - - 0x0168DC 0B:88CC: 04 8B     .word off_8B04_6B     ; 
- D - I - - 0x0168DE 0B:88CE: 09 8B     .word off_8B09_6C     ; 
- D - I - - 0x0168E0 0B:88D0: 0F 8B     .word off_8B0F_6D     ; 
- D - I - - 0x0168E2 0B:88D2: 1C 8B     .word off_8B1C_6E     ; 
- - - - - - 0x0168E4 0B:88D4: 2B 8B     .word off_8B2B_6F     ; ! unused байтов в сценариях не найдено
- D - I - - 0x0168E6 0B:88D6: 38 8B     .word off_8B38_70     ; 
- D - I - - 0x0168E8 0B:88D8: 3B 8B     .word off_8B3B_71     ; 
- D - I - - 0x0168EA 0B:88DA: 3E 8B     .word off_8B3E_72     ; 
- - - - - - 0x0168EC 0B:88DC: 3F 8B     .word off_8B3F_73     ; ! найден 1 случай в сценариях, что-то связанное с вакашимазу



con___F0          = $F0 ; 01
; unused          = $F1 ; 
con___F2          = $F2 ; 72



off_88DE_00:
- D - I - - 0x0168EE 0B:88DE: 02        .byte $02
- D - I - - 0x0168EF 0B:88DF: 03        .byte $03
- D - I - - 0x0168F0 0B:88E0: 00        .byte $00
- D - I - - 0x0168F1 0B:88E1: 06        .byte $06
- D - I - - 0x0168F2 0B:88E2: 50        .byte $50

off_88E3_01:
- D - I - - 0x0168F3 0B:88E3: F0        .byte con___F0

off_88E4_02:
- D - I - - 0x0168F4 0B:88E4: 02        .byte $02
- D - I - - 0x0168F5 0B:88E5: 00        .byte $00
- D - I - - 0x0168F6 0B:88E6: 52        .byte $52

off_88E7_03:
- D - I - - 0x0168F7 0B:88E7: 02        .byte $02
- D - I - - 0x0168F8 0B:88E8: 05        .byte $05
- D - I - - 0x0168F9 0B:88E9: 00        .byte $00
- D - I - - 0x0168FA 0B:88EA: 00        .byte $00
- D - I - - 0x0168FB 0B:88EB: 4C        .byte $4C
- D - I - - 0x0168FC 0B:88EC: 4A        .byte $4A

off_88ED_04:
- D - I - - 0x0168FD 0B:88ED: 02        .byte $02
- D - I - - 0x0168FE 0B:88EE: 05        .byte $05
- D - I - - 0x0168FF 0B:88EF: 00        .byte $00
- D - I - - 0x016900 0B:88F0: 00        .byte $00
- D - I - - 0x016901 0B:88F1: 21        .byte $21
- D - I - - 0x016902 0B:88F2: 20        .byte $20

off_88F3_05:
- D - I - - 0x016903 0B:88F3: 02        .byte $02
- D - I - - 0x016904 0B:88F4: 00        .byte $00
- D - I - - 0x016905 0B:88F5: 55        .byte $55

off_88F6_06:
- D - I - - 0x016906 0B:88F6: 02        .byte $02
- D - I - - 0x016907 0B:88F7: 05        .byte $05
- D - I - - 0x016908 0B:88F8: 00        .byte $00
- D - I - - 0x016909 0B:88F9: 00        .byte $00
- D - I - - 0x01690A 0B:88FA: 54        .byte $54
- D - I - - 0x01690B 0B:88FB: 53        .byte $53

off_88FC_07:
- D - I - - 0x01690C 0B:88FC: 02        .byte $02
- D - I - - 0x01690D 0B:88FD: 05        .byte $05
- D - I - - 0x01690E 0B:88FE: 00        .byte $00
- D - I - - 0x01690F 0B:88FF: 00        .byte $00
- D - I - - 0x016910 0B:8900: 31        .byte $31
- D - I - - 0x016911 0B:8901: 32        .byte $32

off_8902_08:
- D - I - - 0x016912 0B:8902: 07        .byte $07
- D - I - - 0x016913 0B:8903: 00        .byte $00
- D - I - - 0x016914 0B:8904: 70        .byte $70

off_8905_09:
- D - I - - 0x016915 0B:8905: 07        .byte $07
- D - I - - 0x016916 0B:8906: 00        .byte $00
- D - I - - 0x016917 0B:8907: 71        .byte $71

off_8908_0A:
- D - I - - 0x016918 0B:8908: 08        .byte $08
- D - I - - 0x016919 0B:8909: 00        .byte $00
- D - I - - 0x01691A 0B:890A: 72        .byte $72

off_890B_0B:
- D - I - - 0x01691B 0B:890B: 07        .byte $07
- D - I - - 0x01691C 0B:890C: 05        .byte $05
- D - I - - 0x01691D 0B:890D: 00        .byte $00
- D - I - - 0x01691E 0B:890E: 00        .byte $00
- D - I - - 0x01691F 0B:890F: 44        .byte $44
- D - I - - 0x016920 0B:8910: 45        .byte $45

off_8911_0C:
- D - I - - 0x016921 0B:8911: 02        .byte $02
- D - I - - 0x016922 0B:8912: 00        .byte $00
- D - I - - 0x016923 0B:8913: 43        .byte $43

off_8914_0D:
- D - I - - 0x016924 0B:8914: 01        .byte $01
- D - I - - 0x016925 0B:8915: 00        .byte $00
- D - I - - 0x016926 0B:8916: 4F        .byte $4F

off_8917_0E:
- D - I - - 0x016927 0B:8917: 02        .byte $02
- D - I - - 0x016928 0B:8918: 05        .byte $05
- D - I - - 0x016929 0B:8919: 00        .byte $00
- D - I - - 0x01692A 0B:891A: 00        .byte $00
- D - I - - 0x01692B 0B:891B: 23        .byte $23
- D - I - - 0x01692C 0B:891C: 22        .byte $22

off_891D_0F:
- D - I - - 0x01692D 0B:891D: 02        .byte $02
- D - I - - 0x01692E 0B:891E: 05        .byte $05
- D - I - - 0x01692F 0B:891F: 00        .byte $00
- D - I - - 0x016930 0B:8920: 00        .byte $00
- D - I - - 0x016931 0B:8921: 76        .byte $76
- D - I - - 0x016932 0B:8922: 77        .byte $77

off_8923_10:
- D - I - - 0x016933 0B:8923: 02        .byte $02
- D - I - - 0x016934 0B:8924: 00        .byte $00
- D - I - - 0x016935 0B:8925: 6F        .byte $6F

off_8926_11:
- D - I - - 0x016936 0B:8926: 02        .byte $02
- D - I - - 0x016937 0B:8927: 05        .byte $05
- D - I - - 0x016938 0B:8928: 00        .byte $00
- D - I - - 0x016939 0B:8929: 00        .byte $00
- - - - - - 0x01693A 0B:892A: 38        .byte $38
- D - I - - 0x01693B 0B:892B: 3A        .byte $3A

off_892C_12:
- D - I - - 0x01693C 0B:892C: 02        .byte $02
- D - I - - 0x01693D 0B:892D: 00        .byte $00
- D - I - - 0x01693E 0B:892E: 39        .byte $39

off_892F_13:
- D - I - - 0x01693F 0B:892F: 02        .byte $02
- D - I - - 0x016940 0B:8930: 05        .byte $05
- D - I - - 0x016941 0B:8931: 00        .byte $00
- D - I - - 0x016942 0B:8932: 00        .byte $00
- D - I - - 0x016943 0B:8933: 3A        .byte $3A
- D - I - - 0x016944 0B:8934: 38        .byte $38

off_8935_14:
- D - I - - 0x016945 0B:8935: 02        .byte $02
- D - I - - 0x016946 0B:8936: 05        .byte $05
- D - I - - 0x016947 0B:8937: 00        .byte $00
- D - I - - 0x016948 0B:8938: 00        .byte $00
- D - I - - 0x016949 0B:8939: 3B        .byte $3B
- D - I - - 0x01694A 0B:893A: 3F        .byte $3F

off_893B_15:
- D - I - - 0x01694B 0B:893B: 02        .byte $02
- D - I - - 0x01694C 0B:893C: 05        .byte $05
- D - I - - 0x01694D 0B:893D: 00        .byte $00
- D - I - - 0x01694E 0B:893E: 00        .byte $00
- D - I - - 0x01694F 0B:893F: 3C        .byte $3C
- D - I - - 0x016950 0B:8940: 3E        .byte $3E

off_8941_16:
- D - I - - 0x016951 0B:8941: 02        .byte $02
- D - I - - 0x016952 0B:8942: 00        .byte $00
- D - I - - 0x016953 0B:8943: 3D        .byte $3D

off_8944_17:
- D - I - - 0x016954 0B:8944: 02        .byte $02
- D - I - - 0x016955 0B:8945: 05        .byte $05
- D - I - - 0x016956 0B:8946: 00        .byte $00
- D - I - - 0x016957 0B:8947: 00        .byte $00
- D - I - - 0x016958 0B:8948: 3E        .byte $3E
- D - I - - 0x016959 0B:8949: 3C        .byte $3C

off_894A_18:
- D - I - - 0x01695A 0B:894A: 02        .byte $02
- D - I - - 0x01695B 0B:894B: 05        .byte $05
- D - I - - 0x01695C 0B:894C: 00        .byte $00
- D - I - - 0x01695D 0B:894D: 00        .byte $00
- D - I - - 0x01695E 0B:894E: 3F        .byte $3F
- D - I - - 0x01695F 0B:894F: 3B        .byte $3B

off_8950_19:
- D - I - - 0x016960 0B:8950: 02        .byte $02
- D - I - - 0x016961 0B:8951: 03        .byte $03
- D - I - - 0x016962 0B:8952: 60        .byte $60
- D - I - - 0x016963 0B:8953: 00        .byte $00
- D - I - - 0x016964 0B:8954: 04        .byte $04

off_8955_1A:
- - - - - - 0x016965 0B:8955: F1        .byte $F1

off_8956_1B:
- D - I - - 0x016966 0B:8956: 02        .byte $02
- D - I - - 0x016967 0B:8957: 03        .byte $03
- D - I - - 0x016968 0B:8958: 01        .byte $01
- D - I - - 0x016969 0B:8959: 80        .byte $80
- D - I - - 0x01696A 0B:895A: 52        .byte $52

off_895B_1C:
- D - I - - 0x01696B 0B:895B: 02        .byte $02
- D - I - - 0x01696C 0B:895C: 03        .byte $03
- D - I - - 0x01696D 0B:895D: 00        .byte $00
- D - I - - 0x01696E 0B:895E: 80        .byte $80
- D - I - - 0x01696F 0B:895F: 52        .byte $52

off_8960_1D:
- D - I - - 0x016970 0B:8960: 02        .byte $02
- D - I - - 0x016971 0B:8961: 03        .byte $03
- D - I - - 0x016972 0B:8962: 00        .byte $00
- D - I - - 0x016973 0B:8963: FC        .byte $FC
- D - I - - 0x016974 0B:8964: 52        .byte $52

off_8965_1E:
- D - I - - 0x016975 0B:8965: 02        .byte $02
- D - I - - 0x016976 0B:8966: 03        .byte $03
- D - I - - 0x016977 0B:8967: 00        .byte $00
- D - I - - 0x016978 0B:8968: F9        .byte $F9
- D - I - - 0x016979 0B:8969: 52        .byte $52

off_896A_1F:
- D - I - - 0x01697A 0B:896A: 02        .byte $02
- D - I - - 0x01697B 0B:896B: 03        .byte $03
- D - I - - 0x01697C 0B:896C: 00        .byte $00
- D - I - - 0x01697D 0B:896D: 04        .byte $04
- D - I - - 0x01697E 0B:896E: 52        .byte $52

off_896F_20:
- D - I - - 0x01697F 0B:896F: 02        .byte $02
- D - I - - 0x016980 0B:8970: 03        .byte $03
- D - I - - 0x016981 0B:8971: 00        .byte $00
- D - I - - 0x016982 0B:8972: 07        .byte $07
- D - I - - 0x016983 0B:8973: 52        .byte $52

off_8974_21:
- - - - - - 0x016984 0B:8974: 02        .byte $02
- - - - - - 0x016985 0B:8975: 01        .byte $01
- - - - - - 0x016986 0B:8976: 00        .byte $00
- - - - - - 0x016987 0B:8977: FF        .byte $FF
- - - - - - 0x016988 0B:8978: 00        .byte $00
- - - - - - 0x016989 0B:8979: 52        .byte $52
- - - - - - 0x01698A 0B:897A: 52        .byte $52

off_897B_22:
- D - I - - 0x01698B 0B:897B: 06        .byte $06
- D - I - - 0x01698C 0B:897C: 03        .byte $03
- D - I - - 0x01698D 0B:897D: 00        .byte $00
- D - I - - 0x01698E 0B:897E: 01        .byte $01
- D - I - - 0x01698F 0B:897F: 35        .byte $35

off_8980_23:
- D - I - - 0x016990 0B:8980: 06        .byte $06
- D - I - - 0x016991 0B:8981: 03        .byte $03
- D - I - - 0x016992 0B:8982: 00        .byte $00
- D - I - - 0x016993 0B:8983: FF        .byte $FF
- D - I - - 0x016994 0B:8984: 35        .byte $35

off_8985_24:
- D - I - - 0x016995 0B:8985: 06        .byte $06
- D - I - - 0x016996 0B:8986: 03        .byte $03
- D - I - - 0x016997 0B:8987: 00        .byte $00
- D - I - - 0x016998 0B:8988: 06        .byte $06
- D - I - - 0x016999 0B:8989: 35        .byte $35

off_898A_25:
- D - I - - 0x01699A 0B:898A: 06        .byte $06
- D - I - - 0x01699B 0B:898B: 03        .byte $03
- D - I - - 0x01699C 0B:898C: 00        .byte $00
- D - I - - 0x01699D 0B:898D: FA        .byte $FA
- D - I - - 0x01699E 0B:898E: 35        .byte $35

off_898F_26:
- D - I - - 0x01699F 0B:898F: 02        .byte $02
- D - I - - 0x0169A0 0B:8990: 05        .byte $05
- D - I - - 0x0169A1 0B:8991: 00        .byte $00
- D - I - - 0x0169A2 0B:8992: 00        .byte $00
- D - I - - 0x0169A3 0B:8993: 1F        .byte $1F
- D - I - - 0x0169A4 0B:8994: 1E        .byte $1E

off_8995_27:
- D - I - - 0x0169A5 0B:8995: 02        .byte $02
- D - I - - 0x0169A6 0B:8996: 03        .byte $03
- D - I - - 0x0169A7 0B:8997: 00        .byte $00
- D - I - - 0x0169A8 0B:8998: 0B        .byte $0B
- D - I - - 0x0169A9 0B:8999: 30        .byte $30

off_899A_28:
- D - I - - 0x0169AA 0B:899A: 02        .byte $02
- D - I - - 0x0169AB 0B:899B: 03        .byte $03
- D - I - - 0x0169AC 0B:899C: 00        .byte $00
- D - I - - 0x0169AD 0B:899D: 02        .byte $02
- D - I - - 0x0169AE 0B:899E: 50        .byte $50

off_899F_29:
- D - I - - 0x0169AF 0B:899F: 02        .byte $02
- D - I - - 0x0169B0 0B:89A0: 03        .byte $03
- D - I - - 0x0169B1 0B:89A1: 00        .byte $00
- D - I - - 0x0169B2 0B:89A2: FE        .byte $FE
- D - I - - 0x0169B3 0B:89A3: 50        .byte $50

off_89A4_2A:
- D - I - - 0x0169B4 0B:89A4: 02        .byte $02
- D - I - - 0x0169B5 0B:89A5: 03        .byte $03
- D - I - - 0x0169B6 0B:89A6: 00        .byte $00
- D - I - - 0x0169B7 0B:89A7: 04        .byte $04
- D - I - - 0x0169B8 0B:89A8: 51        .byte $51

off_89A9_2B:
- D - I - - 0x0169B9 0B:89A9: 02        .byte $02
- D - I - - 0x0169BA 0B:89AA: 05        .byte $05
- D - I - - 0x0169BB 0B:89AB: 00        .byte $00
- D - I - - 0x0169BC 0B:89AC: 03        .byte $03
- D - I - - 0x0169BD 0B:89AD: 67        .byte $67
- D - I - - 0x0169BE 0B:89AE: 65        .byte $65

off_89AF_2C:
- D - I - - 0x0169BF 0B:89AF: 02        .byte $02
- D - I - - 0x0169C0 0B:89B0: 00        .byte $00
- D - I - - 0x0169C1 0B:89B1: 75        .byte $75

off_89B2_2D:
- D - I - - 0x0169C2 0B:89B2: 05        .byte $05
- D - I - - 0x0169C3 0B:89B3: 00        .byte $00
- D - I - - 0x0169C4 0B:89B4: 64        .byte $64

off_89B5_2E:
- D - I - - 0x0169C5 0B:89B5: 02        .byte $02
- D - I - - 0x0169C6 0B:89B6: 06        .byte $06
- D - I - - 0x0169C7 0B:89B7: E0        .byte $E0
- D - I - - 0x0169C8 0B:89B8: FF        .byte $FF
- D - I - - 0x0169C9 0B:89B9: 01        .byte $01
- D - I - - 0x0169CA 0B:89BA: B9 89     .word off_89BE - 5
- D - I - - 0x0169CC 0B:89BC: BB 89     .word off_89C0 - 5
off_89BE:
- D - I - - 0x0169CE 0B:89BE: 49        .byte $49
- D - I - - 0x0169CF 0B:89BF: 48        .byte $48
off_89C0:
- D - I - - 0x0169D0 0B:89C0: 47        .byte $47
- D - I - - 0x0169D1 0B:89C1: 48        .byte $48

off_89C2_2F:
- D - I - - 0x0169D2 0B:89C2: 02        .byte $02
- D - I - - 0x0169D3 0B:89C3: 08        .byte $08
- D - I - - 0x0169D4 0B:89C4: B0        .byte $B0
- D - I - - 0x0169D5 0B:89C5: FE        .byte $FE
- D - I - - 0x0169D6 0B:89C6: 02        .byte $02
- D - I - - 0x0169D7 0B:89C7: C6 89     .word off_89CB - 5
- D - I - - 0x0169D9 0B:89C9: C8 89     .word off_89CD - 5
off_89CB:
- D - I - - 0x0169DB 0B:89CB: 68        .byte $68
- D - I - - 0x0169DC 0B:89CC: 67        .byte $67
off_89CD:
- D - I - - 0x0169DD 0B:89CD: 66        .byte $66
- D - I - - 0x0169DE 0B:89CE: 65        .byte $65

off_89CF_30:
- D - I - - 0x0169DF 0B:89CF: 03        .byte $03
- D - I - - 0x0169E0 0B:89D0: 05        .byte $05
- D - I - - 0x0169E1 0B:89D1: 00        .byte $00
- D - I - - 0x0169E2 0B:89D2: 00        .byte $00
- D - I - - 0x0169E3 0B:89D3: 26        .byte $26
- D - I - - 0x0169E4 0B:89D4: 27        .byte $27

off_89D5_31:
- D - I - - 0x0169E5 0B:89D5: 03        .byte $03
- D - I - - 0x0169E6 0B:89D6: 05        .byte $05
- D - I - - 0x0169E7 0B:89D7: 00        .byte $00
- D - I - - 0x0169E8 0B:89D8: 00        .byte $00
- D - I - - 0x0169E9 0B:89D9: 28        .byte $28
- D - I - - 0x0169EA 0B:89DA: 29        .byte $29

off_89DB_32:
- D - I - - 0x0169EB 0B:89DB: 04        .byte $04
- D - I - - 0x0169EC 0B:89DC: 00        .byte $00
- D - I - - 0x0169ED 0B:89DD: 2A        .byte $2A

off_89DE_33:
- D - I - - 0x0169EE 0B:89DE: 04        .byte $04
- D - I - - 0x0169EF 0B:89DF: 00        .byte $00
- D - I - - 0x0169F0 0B:89E0: 2B        .byte $2B

off_89E1_34:
- D - I - - 0x0169F1 0B:89E1: 02        .byte $02
- D - I - - 0x0169F2 0B:89E2: 00        .byte $00
- D - I - - 0x0169F3 0B:89E3: 2D        .byte $2D

off_89E4_35:
- D - I - - 0x0169F4 0B:89E4: 00        .byte $00
- D - I - - 0x0169F5 0B:89E5: 00        .byte $00
- D - I - - 0x0169F6 0B:89E6: 2E        .byte $2E

off_89E7_36:
- D - I - - 0x0169F7 0B:89E7: 02        .byte $02
- D - I - - 0x0169F8 0B:89E8: 00        .byte $00
- D - I - - 0x0169F9 0B:89E9: 2F        .byte $2F

off_89EA_37:
- D - I - - 0x0169FA 0B:89EA: 02        .byte $02
- D - I - - 0x0169FB 0B:89EB: 00        .byte $00
- D - I - - 0x0169FC 0B:89EC: 33        .byte $33

off_89ED_38:
- D - I - - 0x0169FD 0B:89ED: 02        .byte $02
- D - I - - 0x0169FE 0B:89EE: 00        .byte $00
- D - I - - 0x0169FF 0B:89EF: 34        .byte $34

off_89F0_39:
- D - I - - 0x016A00 0B:89F0: 02        .byte $02
- D - I - - 0x016A01 0B:89F1: 00        .byte $00
- D - I - - 0x016A02 0B:89F2: 41        .byte $41

off_89F3_3A:
- D - I - - 0x016A03 0B:89F3: 02        .byte $02
- D - I - - 0x016A04 0B:89F4: 00        .byte $00
- D - I - - 0x016A05 0B:89F5: 42        .byte $42

off_89F6_3B:
- - - - - - 0x016A06 0B:89F6: 02        .byte $02
- - - - - - 0x016A07 0B:89F7: 05        .byte $05
- - - - - - 0x016A08 0B:89F8: 00        .byte $00
- - - - - - 0x016A09 0B:89F9: 00        .byte $00
- - - - - - 0x016A0A 0B:89FA: 4B        .byte $4B
- - - - - - 0x016A0B 0B:89FB: 4D        .byte $4D

off_89FC_3C:
- D - I - - 0x016A0C 0B:89FC: 02        .byte $02
- D - I - - 0x016A0D 0B:89FD: 00        .byte $00
- D - I - - 0x016A0E 0B:89FE: 4E        .byte $4E

off_89FF_3D:
- - - - - - 0x016A0F 0B:89FF: 02        .byte $02
- - - - - - 0x016A10 0B:8A00: 03        .byte $03
- - - - - - 0x016A11 0B:8A01: 00        .byte $00
- - - - - - 0x016A12 0B:8A02: F9        .byte $F9
- - - - - - 0x016A13 0B:8A03: 61        .byte $61

off_8A04_3E:
- D - I - - 0x016A14 0B:8A04: 02        .byte $02
- D - I - - 0x016A15 0B:8A05: 05        .byte $05
- D - I - - 0x016A16 0B:8A06: 00        .byte $00
- D - I - - 0x016A17 0B:8A07: 01        .byte $01
- D - I - - 0x016A18 0B:8A08: 7D        .byte $7D
- D - I - - 0x016A19 0B:8A09: 46        .byte $46

off_8A0A_3F:
- D - I - - 0x016A1A 0B:8A0A: 05        .byte $05
- D - I - - 0x016A1B 0B:8A0B: 04        .byte $04
- D - I - - 0x016A1C 0B:8A0C: 80        .byte $80
- D - I - - 0x016A1D 0B:8A0D: 00        .byte $00
- D - I - - 0x016A1E 0B:8A0E: 01        .byte $01
- D - I - - 0x016A1F 0B:8A0F: 24        .byte $24
- D - I - - 0x016A20 0B:8A10: 64        .byte $64

off_8A11_40:
- D - I - - 0x016A21 0B:8A11: 02        .byte $02
- D - I - - 0x016A22 0B:8A12: 05        .byte $05
- D - I - - 0x016A23 0B:8A13: 00        .byte $00
- D - I - - 0x016A24 0B:8A14: 00        .byte $00
- D - I - - 0x016A25 0B:8A15: 6C        .byte $6C
- D - I - - 0x016A26 0B:8A16: 6D        .byte $6D

off_8A17_41:
- D - I - - 0x016A27 0B:8A17: 02        .byte $02
- D - I - - 0x016A28 0B:8A18: 00        .byte $00
- D - I - - 0x016A29 0B:8A19: 6E        .byte $6E

off_8A1A_42:
- D - I - - 0x016A2A 0B:8A1A: 02        .byte $02
- D - I - - 0x016A2B 0B:8A1B: 05        .byte $05
- D - I - - 0x016A2C 0B:8A1C: 00        .byte $00
- D - I - - 0x016A2D 0B:8A1D: 00        .byte $00
- D - I - - 0x016A2E 0B:8A1E: 7A        .byte $7A
- D - I - - 0x016A2F 0B:8A1F: 7B        .byte $7B

off_8A20_43:
- D - I - - 0x016A30 0B:8A20: 02        .byte $02
- D - I - - 0x016A31 0B:8A21: 00        .byte $00
- D - I - - 0x016A32 0B:8A22: 40        .byte $40

off_8A23_44:
- D - I - - 0x016A33 0B:8A23: 02        .byte $02
- D - I - - 0x016A34 0B:8A24: 01        .byte $01
- D - I - - 0x016A35 0B:8A25: 00        .byte $00
- D - I - - 0x016A36 0B:8A26: 0B        .byte $0B
- - - - - - 0x016A37 0B:8A27: 00        .byte $00
- D - I - - 0x016A38 0B:8A28: 60        .byte $60
- D - I - - 0x016A39 0B:8A29: 60        .byte $60

off_8A2A_45:
- D - I - - 0x016A3A 0B:8A2A: 06        .byte $06
- D - I - - 0x016A3B 0B:8A2B: 00        .byte $00
- D - I - - 0x016A3C 0B:8A2C: 36        .byte $36

off_8A2D_46:
- D - I - - 0x016A3D 0B:8A2D: 02        .byte $02
- D - I - - 0x016A3E 0B:8A2E: 00        .byte $00
- D - I - - 0x016A3F 0B:8A2F: 37        .byte $37

off_8A30_47:
- D - I - - 0x016A40 0B:8A30: 02        .byte $02
- D - I - - 0x016A41 0B:8A31: 03        .byte $03
- D - I - - 0x016A42 0B:8A32: 00        .byte $00
- D - I - - 0x016A43 0B:8A33: F5        .byte $F5
- D - I - - 0x016A44 0B:8A34: 5D        .byte $5D

off_8A35_48:
- D - I - - 0x016A45 0B:8A35: 02        .byte $02
- D - I - - 0x016A46 0B:8A36: 03        .byte $03
- D - I - - 0x016A47 0B:8A37: 00        .byte $00
- D - I - - 0x016A48 0B:8A38: 0B        .byte $0B
- D - I - - 0x016A49 0B:8A39: 5E        .byte $5E

off_8A3A_49:
- D - I - - 0x016A4A 0B:8A3A: 02        .byte $02
- D - I - - 0x016A4B 0B:8A3B: 01        .byte $01
- D - I - - 0x016A4C 0B:8A3C: 00        .byte $00
- D - I - - 0x016A4D 0B:8A3D: F5        .byte $F5
- - - - - - 0x016A4E 0B:8A3E: 00        .byte $00
- D - I - - 0x016A4F 0B:8A3F: 5F        .byte $5F
- D - I - - 0x016A50 0B:8A40: 5F        .byte $5F

off_8A41_4A:
- D - I - - 0x016A51 0B:8A41: 02        .byte $02
- D - I - - 0x016A52 0B:8A42: 01        .byte $01
- D - I - - 0x016A53 0B:8A43: 00        .byte $00
- D - I - - 0x016A54 0B:8A44: F5        .byte $F5
- - - - - - 0x016A55 0B:8A45: 00        .byte $00
- D - I - - 0x016A56 0B:8A46: 60        .byte $60
- D - I - - 0x016A57 0B:8A47: 60        .byte $60

off_8A48_4B:
- D - I - - 0x016A58 0B:8A48: 02        .byte $02
- D - I - - 0x016A59 0B:8A49: 03        .byte $03
- D - I - - 0x016A5A 0B:8A4A: 00        .byte $00
- D - I - - 0x016A5B 0B:8A4B: 0B        .byte $0B
- D - I - - 0x016A5C 0B:8A4C: 5D        .byte $5D

off_8A4D_4C:
- D - I - - 0x016A5D 0B:8A4D: 02        .byte $02
- D - I - - 0x016A5E 0B:8A4E: 08        .byte $08
- D - I - - 0x016A5F 0B:8A4F: B0        .byte $B0
- D - I - - 0x016A60 0B:8A50: FE        .byte $FE
- D - I - - 0x016A61 0B:8A51: 03        .byte $03
- D - I - - 0x016A62 0B:8A52: 51 8A     .word off_8A56 - 5
- D - I - - 0x016A64 0B:8A54: 54 8A     .word off_8A59 - 5
off_8A56:
- D - I - - 0x016A66 0B:8A56: 57        .byte $57
- D - I - - 0x016A67 0B:8A57: 58        .byte $58
- D - I - - 0x016A68 0B:8A58: 58        .byte $58
off_8A59:
- D - I - - 0x016A69 0B:8A59: 59        .byte $59
- D - I - - 0x016A6A 0B:8A5A: 58        .byte $58
- D - I - - 0x016A6B 0B:8A5B: 58        .byte $58

off_8A5C_4D:
- D - I - - 0x016A6C 0B:8A5C: 02        .byte $02
- D - I - - 0x016A6D 0B:8A5D: 03        .byte $03
- D - I - - 0x016A6E 0B:8A5E: 60        .byte $60
- D - I - - 0x016A6F 0B:8A5F: 00        .byte $00
- D - I - - 0x016A70 0B:8A60: 25        .byte $25

off_8A61_4E:
- D - I - - 0x016A71 0B:8A61: 02        .byte $02
- D - I - - 0x016A72 0B:8A62: 03        .byte $03
- D - I - - 0x016A73 0B:8A63: 00        .byte $00
- D - I - - 0x016A74 0B:8A64: 07        .byte $07
- D - I - - 0x016A75 0B:8A65: 39        .byte $39

off_8A66_4F:
- D - I - - 0x016A76 0B:8A66: 03        .byte $03
- D - I - - 0x016A77 0B:8A67: 00        .byte $00
- D - I - - 0x016A78 0B:8A68: 81        .byte $81

off_8A69_50:
- - - - - - 0x016A79 0B:8A69: 02        .byte $02
- - - - - - 0x016A7A 0B:8A6A: 03        .byte $03
- - - - - - 0x016A7B 0B:8A6B: 00        .byte $00
- - - - - - 0x016A7C 0B:8A6C: 0B        .byte $0B
- - - - - - 0x016A7D 0B:8A6D: 5D        .byte $5D

off_8A6E_51:
- D - I - - 0x016A7E 0B:8A6E: 02        .byte $02
- D - I - - 0x016A7F 0B:8A6F: 05        .byte $05
- D - I - - 0x016A80 0B:8A70: 00        .byte $00
- D - I - - 0x016A81 0B:8A71: 02        .byte $02
- D - I - - 0x016A82 0B:8A72: 7C        .byte $7C
- - - - - - 0x016A83 0B:8A73: 7E        .byte $7E

off_8A74_52:
- D - I - - 0x016A84 0B:8A74: 00        .byte $00
- D - I - - 0x016A85 0B:8A75: 00        .byte $00
- D - I - - 0x016A86 0B:8A76: 2C        .byte $2C

off_8A77_53:
- D - I - - 0x016A87 0B:8A77: 02        .byte $02
- D - I - - 0x016A88 0B:8A78: 05        .byte $05
- D - I - - 0x016A89 0B:8A79: 00        .byte $00
- D - I - - 0x016A8A 0B:8A7A: 00        .byte $00
- D - I - - 0x016A8B 0B:8A7B: 66        .byte $66
- - - - - - 0x016A8C 0B:8A7C: 68        .byte $68

off_8A7D_54:
- D - I - - 0x016A8D 0B:8A7D: 03        .byte $03
- D - I - - 0x016A8E 0B:8A7E: 06        .byte $06
- D - I - - 0x016A8F 0B:8A7F: 00        .byte $00
- D - I - - 0x016A90 0B:8A80: 08        .byte $08
- D - I - - 0x016A91 0B:8A81: 01        .byte $01
- D - I - - 0x016A92 0B:8A82: 81 8A     .word off_8A86 - 5
- D - I - - 0x016A94 0B:8A84: 83 8A     .word off_8A88 - 5
off_8A86:
- D - I - - 0x016A96 0B:8A86: 80        .byte $80
- D - I - - 0x016A97 0B:8A87: 26        .byte $26
off_8A88:
- D - I - - 0x016A98 0B:8A88: 80        .byte $80
- D - I - - 0x016A99 0B:8A89: 27        .byte $27

off_8A8A_55:
- D - I - - 0x016A9A 0B:8A8A: 03        .byte $03
- D - I - - 0x016A9B 0B:8A8B: 00        .byte $00
- D - I - - 0x016A9C 0B:8A8C: 82        .byte $82

off_8A8D_56:
- D - I - - 0x016A9D 0B:8A8D: 02        .byte $02
- D - I - - 0x016A9E 0B:8A8E: 03        .byte $03
- D - I - - 0x016A9F 0B:8A8F: 00        .byte $00
- D - I - - 0x016AA0 0B:8A90: FF        .byte $FF
- D - I - - 0x016AA1 0B:8A91: 51        .byte $51

off_8A92_57:
- D - I - - 0x016AA2 0B:8A92: 01        .byte $01
- D - I - - 0x016AA3 0B:8A93: 05        .byte $05
- D - I - - 0x016AA4 0B:8A94: 00        .byte $00
- D - I - - 0x016AA5 0B:8A95: 00        .byte $00
- D - I - - 0x016AA6 0B:8A96: 5A        .byte $5A
- D - I - - 0x016AA7 0B:8A97: 5C        .byte $5C

off_8A98_58:
- D - I - - 0x016AA8 0B:8A98: 01        .byte $01
- D - I - - 0x016AA9 0B:8A99: 05        .byte $05
- D - I - - 0x016AAA 0B:8A9A: 00        .byte $00
- D - I - - 0x016AAB 0B:8A9B: 00        .byte $00
- D - I - - 0x016AAC 0B:8A9C: 5C        .byte $5C
- D - I - - 0x016AAD 0B:8A9D: 5A        .byte $5A

off_8A9E_59:
- D - I - - 0x016AAE 0B:8A9E: 01        .byte $01
- D - I - - 0x016AAF 0B:8A9F: 00        .byte $00
- D - I - - 0x016AB0 0B:8AA0: 5B        .byte $5B

off_8AA1_5A:
- D - I - - 0x016AB1 0B:8AA1: 02        .byte $02
- D - I - - 0x016AB2 0B:8AA2: 03        .byte $03
- D - I - - 0x016AB3 0B:8AA3: 00        .byte $00
- D - I - - 0x016AB4 0B:8AA4: 80        .byte $80
- D - I - - 0x016AB5 0B:8AA5: 50        .byte $50

off_8AA6_5B:
- D - I - - 0x016AB6 0B:8AA6: 02        .byte $02
- D - I - - 0x016AB7 0B:8AA7: 03        .byte $03
- D - I - - 0x016AB8 0B:8AA8: 00        .byte $00
- D - I - - 0x016AB9 0B:8AA9: 80        .byte $80
- D - I - - 0x016ABA 0B:8AAA: 51        .byte $51

off_8AAB_5C:
- D - I - - 0x016ABB 0B:8AAB: 02        .byte $02
- D - I - - 0x016ABC 0B:8AAC: 01        .byte $01
- D - I - - 0x016ABD 0B:8AAD: 00        .byte $00
- D - I - - 0x016ABE 0B:8AAE: 0B        .byte $0B
- - - - - - 0x016ABF 0B:8AAF: 00        .byte $00
- D - I - - 0x016AC0 0B:8AB0: 5F        .byte $5F
- D - I - - 0x016AC1 0B:8AB1: 5F        .byte $5F

off_8AB2_5D:
- D - I - - 0x016AC2 0B:8AB2: 02        .byte $02
- D - I - - 0x016AC3 0B:8AB3: 03        .byte $03
- D - I - - 0x016AC4 0B:8AB4: 00        .byte $00
- D - I - - 0x016AC5 0B:8AB5: 80        .byte $80
- D - I - - 0x016AC6 0B:8AB6: 30        .byte $30

off_8AB7_5E:
- D - I - - 0x016AC7 0B:8AB7: 06        .byte $06
- D - I - - 0x016AC8 0B:8AB8: 03        .byte $03
- D - I - - 0x016AC9 0B:8AB9: 00        .byte $00
- D - I - - 0x016ACA 0B:8ABA: 80        .byte $80
- D - I - - 0x016ACB 0B:8ABB: 35        .byte $35

off_8ABC_5F:
- D - I - - 0x016ACC 0B:8ABC: 02        .byte $02
- D - I - - 0x016ACD 0B:8ABD: 01        .byte $01
- D - I - - 0x016ACE 0B:8ABE: 00        .byte $00
- D - I - - 0x016ACF 0B:8ABF: 01        .byte $01
- - - - - - 0x016AD0 0B:8AC0: 00        .byte $00
- D - I - - 0x016AD1 0B:8AC1: 52        .byte $52
- D - I - - 0x016AD2 0B:8AC2: 52        .byte $52

off_8AC3_60:
- D - I - - 0x016AD3 0B:8AC3: 02        .byte $02
- D - I - - 0x016AD4 0B:8AC4: 03        .byte $03
- D - I - - 0x016AD5 0B:8AC5: 00        .byte $00
- D - I - - 0x016AD6 0B:8AC6: 80        .byte $80
- D - I - - 0x016AD7 0B:8AC7: 5E        .byte $5E

off_8AC8_61:
- D - I - - 0x016AD8 0B:8AC8: 02        .byte $02
- D - I - - 0x016AD9 0B:8AC9: 00        .byte $00
- D - I - - 0x016ADA 0B:8ACA: 69        .byte $69

off_8ACB_62:
- D - I - - 0x016ADB 0B:8ACB: 02        .byte $02
- D - I - - 0x016ADC 0B:8ACC: 06        .byte $06
- D - I - - 0x016ADD 0B:8ACD: 00        .byte $00
- D - I - - 0x016ADE 0B:8ACE: 08        .byte $08
- D - I - - 0x016ADF 0B:8ACF: 01        .byte $01
- D - I - - 0x016AE0 0B:8AD0: CF 8A     .word off_8AD4 - 5
- D - I - - 0x016AE2 0B:8AD2: D1 8A     .word off_8AD6 - 5
off_8AD4:
- D - I - - 0x016AE4 0B:8AD4: 73        .byte $73
- D - I - - 0x016AE5 0B:8AD5: 04        .byte $04
off_8AD6:
- D - I - - 0x016AE6 0B:8AD6: 73        .byte $73
- D - I - - 0x016AE7 0B:8AD7: 05        .byte $05

off_8AD8_63:
- D - I - - 0x016AE8 0B:8AD8: 02        .byte $02
- D - I - - 0x016AE9 0B:8AD9: 00        .byte $00
- D - I - - 0x016AEA 0B:8ADA: 51        .byte $51

off_8ADB_64:
- D - I - - 0x016AEB 0B:8ADB: 02        .byte $02
- D - I - - 0x016AEC 0B:8ADC: 03        .byte $03
- D - I - - 0x016AED 0B:8ADD: 00        .byte $00
- D - I - - 0x016AEE 0B:8ADE: F9        .byte $F9
- D - I - - 0x016AEF 0B:8ADF: 39        .byte $39

off_8AE0_65:
- D - I - - 0x016AF0 0B:8AE0: 02        .byte $02
- D - I - - 0x016AF1 0B:8AE1: 05        .byte $05
- D - I - - 0x016AF2 0B:8AE2: 00        .byte $00
- D - I - - 0x016AF3 0B:8AE3: 00        .byte $00
- D - I - - 0x016AF4 0B:8AE4: 83        .byte $83
- D - I - - 0x016AF5 0B:8AE5: 6B        .byte $6B

off_8AE6_66:
- - - - - - 0x016AF6 0B:8AE6: 02        .byte $02
- - - - - - 0x016AF7 0B:8AE7: 01        .byte $01
- - - - - - 0x016AF8 0B:8AE8: 00        .byte $00
- - - - - - 0x016AF9 0B:8AE9: 80        .byte $80
- - - - - - 0x016AFA 0B:8AEA: 00        .byte $00
- - - - - - 0x016AFB 0B:8AEB: 5F        .byte $5F
- - - - - - 0x016AFC 0B:8AEC: 5F        .byte $5F

off_8AED_67:
- D - I - - 0x016AFD 0B:8AED: 02        .byte $02
- D - I - - 0x016AFE 0B:8AEE: 05        .byte $05
- D - I - - 0x016AFF 0B:8AEF: 00        .byte $00
- D - I - - 0x016B00 0B:8AF0: 00        .byte $00
- D - I - - 0x016B01 0B:8AF1: 7C        .byte $7C
- D - I - - 0x016B02 0B:8AF2: 7E        .byte $7E

off_8AF3_68:
- D - I - - 0x016B03 0B:8AF3: 02        .byte $02
- D - I - - 0x016B04 0B:8AF4: 05        .byte $05
- D - I - - 0x016B05 0B:8AF5: 00        .byte $00
- D - I - - 0x016B06 0B:8AF6: 80        .byte $80
- D - I - - 0x016B07 0B:8AF7: 7D        .byte $7D
- D - I - - 0x016B08 0B:8AF8: 46        .byte $46

off_8AF9_69:
- D - I - - 0x016B09 0B:8AF9: 02        .byte $02
- D - I - - 0x016B0A 0B:8AFA: 05        .byte $05
- D - I - - 0x016B0B 0B:8AFB: 00        .byte $00
- D - I - - 0x016B0C 0B:8AFC: 00        .byte $00
- D - I - - 0x016B0D 0B:8AFD: 6A        .byte $6A
- D - I - - 0x016B0E 0B:8AFE: 7F        .byte $7F

off_8AFF_6A:
- D - I - - 0x016B0F 0B:8AFF: 02        .byte $02
- D - I - - 0x016B10 0B:8B00: 03        .byte $03
- D - I - - 0x016B11 0B:8B01: 00        .byte $00
- D - I - - 0x016B12 0B:8B02: F5        .byte $F5
- D - I - - 0x016B13 0B:8B03: 5E        .byte $5E

off_8B04_6B:
- D - I - - 0x016B14 0B:8B04: 02        .byte $02
- D - I - - 0x016B15 0B:8B05: 03        .byte $03
- D - I - - 0x016B16 0B:8B06: 00        .byte $00
- D - I - - 0x016B17 0B:8B07: F5        .byte $F5
- D - I - - 0x016B18 0B:8B08: 30        .byte $30

off_8B09_6C:
- D - I - - 0x016B19 0B:8B09: 02        .byte $02
- D - I - - 0x016B1A 0B:8B0A: 05        .byte $05
- D - I - - 0x016B1B 0B:8B0B: 00        .byte $00
- D - I - - 0x016B1C 0B:8B0C: 00        .byte $00
- D - I - - 0x016B1D 0B:8B0D: 68        .byte $68
- D - I - - 0x016B1E 0B:8B0E: 66        .byte $66

off_8B0F_6D:
- D - I - - 0x016B1F 0B:8B0F: 02        .byte $02
- D - I - - 0x016B20 0B:8B10: 08        .byte $08
- D - I - - 0x016B21 0B:8B11: B0        .byte $B0
- D - I - - 0x016B22 0B:8B12: FE        .byte $FE
- D - I - - 0x016B23 0B:8B13: 02        .byte $02
- D - I - - 0x016B24 0B:8B14: 13 8B     .word off_8B18 - 5
- D - I - - 0x016B26 0B:8B16: 15 8B     .word off_8B1A - 5
off_8B18:
- D - I - - 0x016B28 0B:8B18: 1B        .byte $1B
- D - I - - 0x016B29 0B:8B19: 1D        .byte $1D
off_8B1A:
- D - I - - 0x016B2A 0B:8B1A: 1A        .byte $1A
- D - I - - 0x016B2B 0B:8B1B: 1C        .byte $1C

off_8B1C_6E:
- D - I - - 0x016B2C 0B:8B1C: 02        .byte $02
- D - I - - 0x016B2D 0B:8B1D: 08        .byte $08
- D - I - - 0x016B2E 0B:8B1E: 00        .byte $00
- D - I - - 0x016B2F 0B:8B1F: FD        .byte $FD
- D - I - - 0x016B30 0B:8B20: 03        .byte $03
- D - I - - 0x016B31 0B:8B21: 20 8B     .word off_8B25 - 5
- D - I - - 0x016B33 0B:8B23: 23 8B     .word off_8B28 - 5
off_8B25:
- D - I - - 0x016B35 0B:8B25: 17        .byte $17
- D - I - - 0x016B36 0B:8B26: 16        .byte $16
- D - I - - 0x016B37 0B:8B27: 55        .byte $55
off_8B28:
- D - I - - 0x016B38 0B:8B28: 15        .byte $15
- D - I - - 0x016B39 0B:8B29: 14        .byte $14
- D - I - - 0x016B3A 0B:8B2A: 74        .byte $74

off_8B2B_6F:
- - - - - - 0x016B3B 0B:8B2B: 02        .byte $02
- - - - - - 0x016B3C 0B:8B2C: 06        .byte $06
- - - - - - 0x016B3D 0B:8B2D: B0        .byte $B0
- - - - - - 0x016B3E 0B:8B2E: FE        .byte $FE
- - - - - - 0x016B3F 0B:8B2F: 01        .byte $01
- - - - - - 0x016B40 0B:8B30: 2F 8B     .word off_8B34 - 5
- - - - - - 0x016B42 0B:8B32: 31 8B     .word off_8B36 - 5
off_8B34:
- - - - - - 0x016B44 0B:8B34: 1B        .byte $1B
- - - - - - 0x016B45 0B:8B35: 46        .byte $46
off_8B36:
- - - - - - 0x016B46 0B:8B36: 1A        .byte $1A
- - - - - - 0x016B47 0B:8B37: 7D        .byte $7D

off_8B38_70:
- D - I - - 0x016B48 0B:8B38: 06        .byte $06
- D - I - - 0x016B49 0B:8B39: 00        .byte $00
- D - I - - 0x016B4A 0B:8B3A: 56        .byte $56

off_8B3B_71:
- D - I - - 0x016B4B 0B:8B3B: 02        .byte $02
- D - I - - 0x016B4C 0B:8B3C: 00        .byte $00
- D - I - - 0x016B4D 0B:8B3D: 80        .byte $80

off_8B3E_72:
- D - I - - 0x016B4E 0B:8B3E: F2        .byte con___F2

off_8B3F_73:
- - - - - - 0x016B4F 0B:8B3F: 19        .byte $19
- - - - - - 0x016B50 0B:8B40: 00        .byte $00
- - - - - - 0x016B51 0B:8B41: 2B        .byte $2B



tbl_8B42:
- D - - - - 0x016B52 0B:8B42: 00        .byte $00
- D - - - - 0x016B53 0B:8B43: 00        .byte $00
- D - - - - 0x016B54 0B:8B44: 00        .byte $00
- D - - - - 0x016B55 0B:8B45: 00        .byte $00
- D - - - - 0x016B56 0B:8B46: 00        .byte $00
- D - - - - 0x016B57 0B:8B47: 00        .byte $00
- D - - - - 0x016B58 0B:8B48: 00        .byte $00
- D - - - - 0x016B59 0B:8B49: 00        .byte $00
- D - - - - 0x016B5A 0B:8B4A: AA        .byte $AA   ; <だ>
- D - - - - 0x016B5B 0B:8B4B: AA        .byte $AA   ; <だ>
- D - - - - 0x016B5C 0B:8B4C: AA        .byte $AA   ; <だ>
- D - - - - 0x016B5D 0B:8B4D: 6A        .byte $6A   ; <レ>
- D - - - - 0x016B5E 0B:8B4E: 29        .byte $29   ; <る>
- D - - - - 0x016B5F 0B:8B4F: 94        .byte $94
- D - - - - 0x016B60 0B:8B50: 55        .byte $55   ; <ナ>
- D - - - - 0x016B61 0B:8B51: 55        .byte $55   ; <ナ>
- D - - - - 0x016B62 0B:8B52: 52        .byte $52   ; <ツ>
- D - - - - 0x016B63 0B:8B53: 8A        .byte $8A   ; <N>
- D - - - - 0x016B64 0B:8B54: AA        .byte $AA   ; <だ>
- D - - - - 0x016B65 0B:8B55: AA        .byte $AA   ; <だ>
- D - - - - 0x016B66 0B:8B56: 80        .byte $80
- D - - - - 0x016B67 0B:8B57: 22        .byte $22   ; <め>
- D - - - - 0x016B68 0B:8B58: 50        .byte $50   ; <タ>
- D - - - - 0x016B69 0B:8B59: 55        .byte $55   ; <ナ>
- D - - - - 0x016B6A 0B:8B5A: 05        .byte $05   ; <お>
- D - - - - 0x016B6B 0B:8B5B: 56        .byte $56   ; <ニ>
- D - - - - 0x016B6C 0B:8B5C: 05        .byte $05   ; <お>
- D - - - - 0x016B6D 0B:8B5D: 4A        .byte $4A   ; <コ>
- D - - - - 0x016B6E 0B:8B5E: 15        .byte $15   ; <な>
- D - - - - 0x016B6F 0B:8B5F: A4        .byte $A4   ; <ご>
- D - - - - 0x016B70 0B:8B60: 80        .byte $80
- D - - - - 0x016B71 0B:8B61: 00        .byte $00
- D - - - - 0x016B72 0B:8B62: 2A        .byte $2A   ; <れ>
- - - - - - 0x016B73 0B:8B63: 00        .byte $00

tbl_8B64:
- D - I - - 0x016B74 0B:8B64: 00        .byte $00
- D - I - - 0x016B75 0B:8B65: 0A        .byte $0A   ; <こ>
- D - I - - 0x016B76 0B:8B66: 00        .byte $00
- D - I - - 0x016B77 0B:8B67: 00        .byte $00
- D - I - - 0x016B78 0B:8B68: 09        .byte $09   ; <け>
- D - I - - 0x016B79 0B:8B69: 02        .byte $02   ; <い>
- D - I - - 0x016B7A 0B:8B6A: 03        .byte $03   ; <う>
- D - I - - 0x016B7B 0B:8B6B: 04        .byte $04   ; <え>
- D - I - - 0x016B7C 0B:8B6C: 0C        .byte $0C   ; <し>
- D - I - - 0x016B7D 0B:8B6D: 0D        .byte $0D   ; <す>
- D - I - - 0x016B7E 0B:8B6E: 0C        .byte $0C   ; <し>
- D - I - - 0x016B7F 0B:8B6F: 0D        .byte $0D   ; <す>
- D - I - - 0x016B80 0B:8B70: 0E        .byte $0E   ; <せ>
- D - I - - 0x016B81 0B:8B71: 0F        .byte $0F   ; <そ>
- D - I - - 0x016B82 0B:8B72: 10        .byte $10   ; <た>
- D - I - - 0x016B83 0B:8B73: 11        .byte $11   ; <ち>
- D - I - - 0x016B84 0B:8B74: 12        .byte $12   ; <つ>
- D - I - - 0x016B85 0B:8B75: 12        .byte $12   ; <つ>
- D - I - - 0x016B86 0B:8B76: 12        .byte $12   ; <つ>
- D - I - - 0x016B87 0B:8B77: 12        .byte $12   ; <つ>
- D - I - - 0x016B88 0B:8B78: 12        .byte $12   ; <つ>
- D - I - - 0x016B89 0B:8B79: 12        .byte $12   ; <つ>
- D - I - - 0x016B8A 0B:8B7A: 12        .byte $12   ; <つ>
- D - I - - 0x016B8B 0B:8B7B: 12        .byte $12   ; <つ>
- D - I - - 0x016B8C 0B:8B7C: 13        .byte $13   ; <て>
- D - I - - 0x016B8D 0B:8B7D: 13        .byte $13   ; <て>
- D - I - - 0x016B8E 0B:8B7E: 13        .byte $13   ; <て>
- D - I - - 0x016B8F 0B:8B7F: 13        .byte $13   ; <て>
- D - I - - 0x016B90 0B:8B80: 13        .byte $13   ; <て>
- D - I - - 0x016B91 0B:8B81: 13        .byte $13   ; <て>
- D - I - - 0x016B92 0B:8B82: 13        .byte $13   ; <て>
- D - I - - 0x016B93 0B:8B83: 13        .byte $13   ; <て>
- D - I - - 0x016B94 0B:8B84: 01        .byte $01   ; <あ>
- D - I - - 0x016B95 0B:8B85: 02        .byte $02   ; <い>
- D - I - - 0x016B96 0B:8B86: 03        .byte $03   ; <う>
- D - I - - 0x016B97 0B:8B87: 04        .byte $04   ; <え>
- D - I - - 0x016B98 0B:8B88: 0A        .byte $0A   ; <こ>
- D - I - - 0x016B99 0B:8B89: 00        .byte $00
- D - I - - 0x016B9A 0B:8B8A: 00        .byte $00
- D - I - - 0x016B9B 0B:8B8B: 05        .byte $05   ; <お>
- D - I - - 0x016B9C 0B:8B8C: 0E        .byte $0E   ; <せ>
- D - I - - 0x016B9D 0B:8B8D: 0F        .byte $0F   ; <そ>
- D - I - - 0x016B9E 0B:8B8E: 10        .byte $10   ; <た>
- D - I - - 0x016B9F 0B:8B8F: 11        .byte $11   ; <ち>
- D - I - - 0x016BA0 0B:8B90: 0C        .byte $0C   ; <し>
- D - I - - 0x016BA1 0B:8B91: 0D        .byte $0D   ; <す>
- D - I - - 0x016BA2 0B:8B92: 0C        .byte $0C   ; <し>
- D - I - - 0x016BA3 0B:8B93: 0D        .byte $0D   ; <す>
- D - I - - 0x016BA4 0B:8B94: 12        .byte $12   ; <つ>
- D - I - - 0x016BA5 0B:8B95: 12        .byte $12   ; <つ>
- D - I - - 0x016BA6 0B:8B96: 12        .byte $12   ; <つ>
- D - I - - 0x016BA7 0B:8B97: 12        .byte $12   ; <つ>
- D - I - - 0x016BA8 0B:8B98: 12        .byte $12   ; <つ>
- D - I - - 0x016BA9 0B:8B99: 12        .byte $12   ; <つ>
- D - I - - 0x016BAA 0B:8B9A: 12        .byte $12   ; <つ>
- D - I - - 0x016BAB 0B:8B9B: 12        .byte $12   ; <つ>
- D - I - - 0x016BAC 0B:8B9C: 13        .byte $13   ; <て>
- D - I - - 0x016BAD 0B:8B9D: 13        .byte $13   ; <て>
- D - I - - 0x016BAE 0B:8B9E: 13        .byte $13   ; <て>
- D - I - - 0x016BAF 0B:8B9F: 13        .byte $13   ; <て>
- D - I - - 0x016BB0 0B:8BA0: 13        .byte $13   ; <て>
- D - I - - 0x016BB1 0B:8BA1: 13        .byte $13   ; <て>
- D - I - - 0x016BB2 0B:8BA2: 13        .byte $13   ; <て>
- D - I - - 0x016BB3 0B:8BA3: 13        .byte $13   ; <て>
- D - I - - 0x016BB4 0B:8BA4: 00        .byte $00
- D - I - - 0x016BB5 0B:8BA5: 00        .byte $00
- D - I - - 0x016BB6 0B:8BA6: 00        .byte $00
- D - I - - 0x016BB7 0B:8BA7: 0A        .byte $0A   ; <こ>
- D - I - - 0x016BB8 0B:8BA8: 01        .byte $01   ; <あ>
- D - I - - 0x016BB9 0B:8BA9: 02        .byte $02   ; <い>
- D - I - - 0x016BBA 0B:8BAA: 03        .byte $03   ; <う>
- D - I - - 0x016BBB 0B:8BAB: 04        .byte $04   ; <え>
- D - I - - 0x016BBC 0B:8BAC: 0C        .byte $0C   ; <し>
- D - I - - 0x016BBD 0B:8BAD: 0D        .byte $0D   ; <す>
- D - I - - 0x016BBE 0B:8BAE: 0C        .byte $0C   ; <し>
- D - I - - 0x016BBF 0B:8BAF: 0D        .byte $0D   ; <す>
- D - I - - 0x016BC0 0B:8BB0: 0E        .byte $0E   ; <せ>
- D - I - - 0x016BC1 0B:8BB1: 0F        .byte $0F   ; <そ>
- D - I - - 0x016BC2 0B:8BB2: 10        .byte $10   ; <た>
- D - I - - 0x016BC3 0B:8BB3: 11        .byte $11   ; <ち>
- D - I - - 0x016BC4 0B:8BB4: 14        .byte $14   ; <と>
- D - I - - 0x016BC5 0B:8BB5: 14        .byte $14   ; <と>
- D - I - - 0x016BC6 0B:8BB6: 14        .byte $14   ; <と>
- D - I - - 0x016BC7 0B:8BB7: 14        .byte $14   ; <と>
- D - I - - 0x016BC8 0B:8BB8: 14        .byte $14   ; <と>
- D - I - - 0x016BC9 0B:8BB9: 14        .byte $14   ; <と>
- D - I - - 0x016BCA 0B:8BBA: 14        .byte $14   ; <と>
- D - I - - 0x016BCB 0B:8BBB: 14        .byte $14   ; <と>
- D - I - - 0x016BCC 0B:8BBC: 13        .byte $13   ; <て>
- D - I - - 0x016BCD 0B:8BBD: 13        .byte $13   ; <て>
- D - I - - 0x016BCE 0B:8BBE: 13        .byte $13   ; <て>
- D - I - - 0x016BCF 0B:8BBF: 13        .byte $13   ; <て>
- D - I - - 0x016BD0 0B:8BC0: 13        .byte $13   ; <て>
- D - I - - 0x016BD1 0B:8BC1: 13        .byte $13   ; <て>
- D - I - - 0x016BD2 0B:8BC2: 13        .byte $13   ; <て>
- D - I - - 0x016BD3 0B:8BC3: 13        .byte $13   ; <て>
- D - I - - 0x016BD4 0B:8BC4: 01        .byte $01   ; <あ>
- D - I - - 0x016BD5 0B:8BC5: 02        .byte $02   ; <い>
- D - I - - 0x016BD6 0B:8BC6: 03        .byte $03   ; <う>
- D - I - - 0x016BD7 0B:8BC7: 04        .byte $04   ; <え>
- D - I - - 0x016BD8 0B:8BC8: 05        .byte $05   ; <お>
- D - I - - 0x016BD9 0B:8BC9: 00        .byte $00
- D - I - - 0x016BDA 0B:8BCA: 08        .byte $08   ; <く>
- D - I - - 0x016BDB 0B:8BCB: 00        .byte $00
- D - I - - 0x016BDC 0B:8BCC: 0E        .byte $0E   ; <せ>
- D - I - - 0x016BDD 0B:8BCD: 0F        .byte $0F   ; <そ>
- D - I - - 0x016BDE 0B:8BCE: 10        .byte $10   ; <た>
- D - I - - 0x016BDF 0B:8BCF: 11        .byte $11   ; <ち>
- D - I - - 0x016BE0 0B:8BD0: 0C        .byte $0C   ; <し>
- D - I - - 0x016BE1 0B:8BD1: 0D        .byte $0D   ; <す>
- D - I - - 0x016BE2 0B:8BD2: 0C        .byte $0C   ; <し>
- D - I - - 0x016BE3 0B:8BD3: 0D        .byte $0D   ; <す>
- D - I - - 0x016BE4 0B:8BD4: 14        .byte $14   ; <と>
- D - I - - 0x016BE5 0B:8BD5: 14        .byte $14   ; <と>
- D - I - - 0x016BE6 0B:8BD6: 14        .byte $14   ; <と>
- D - I - - 0x016BE7 0B:8BD7: 14        .byte $14   ; <と>
- D - I - - 0x016BE8 0B:8BD8: 14        .byte $14   ; <と>
- D - I - - 0x016BE9 0B:8BD9: 14        .byte $14   ; <と>
- D - I - - 0x016BEA 0B:8BDA: 14        .byte $14   ; <と>
- D - I - - 0x016BEB 0B:8BDB: 14        .byte $14   ; <と>
- D - I - - 0x016BEC 0B:8BDC: 13        .byte $13   ; <て>
- D - I - - 0x016BED 0B:8BDD: 13        .byte $13   ; <て>
- D - I - - 0x016BEE 0B:8BDE: 13        .byte $13   ; <て>
- D - I - - 0x016BEF 0B:8BDF: 13        .byte $13   ; <て>
- D - I - - 0x016BF0 0B:8BE0: 13        .byte $13   ; <て>
- D - I - - 0x016BF1 0B:8BE1: 13        .byte $13   ; <て>
- D - I - - 0x016BF2 0B:8BE2: 13        .byte $13   ; <て>
- D - I - - 0x016BF3 0B:8BE3: 13        .byte $13   ; <て>
- D - I - - 0x016BF4 0B:8BE4: 15        .byte $15   ; <な>
- D - I - - 0x016BF5 0B:8BE5: 16        .byte $16   ; <に>
- D - I - - 0x016BF6 0B:8BE6: 15        .byte $15   ; <な>
- D - I - - 0x016BF7 0B:8BE7: 16        .byte $16   ; <に>
- D - I - - 0x016BF8 0B:8BE8: 17        .byte $17   ; <ぬ>
- D - I - - 0x016BF9 0B:8BE9: 18        .byte $18   ; <ね>
- D - I - - 0x016BFA 0B:8BEA: 17        .byte $17   ; <ぬ>
- D - I - - 0x016BFB 0B:8BEB: 16        .byte $16   ; <に>
- D - I - - 0x016BFC 0B:8BEC: 19        .byte $19   ; <の>
- D - I - - 0x016BFD 0B:8BED: 1A        .byte $1A   ; <は>
- D - I - - 0x016BFE 0B:8BEE: 19        .byte $19   ; <の>
- D - I - - 0x016BFF 0B:8BEF: 1A        .byte $1A   ; <は>
- D - I - - 0x016C00 0B:8BF0: 19        .byte $19   ; <の>
- D - I - - 0x016C01 0B:8BF1: 1B        .byte $1B   ; <ひ>
- D - I - - 0x016C02 0B:8BF2: 1C        .byte $1C   ; <ふ>
- D - I - - 0x016C03 0B:8BF3: 1A        .byte $1A   ; <は>
- D - I - - 0x016C04 0B:8BF4: 14        .byte $14   ; <と>
- D - I - - 0x016C05 0B:8BF5: 14        .byte $14   ; <と>
- D - I - - 0x016C06 0B:8BF6: 14        .byte $14   ; <と>
- D - I - - 0x016C07 0B:8BF7: 14        .byte $14   ; <と>
- D - I - - 0x016C08 0B:8BF8: 14        .byte $14   ; <と>
- D - I - - 0x016C09 0B:8BF9: 14        .byte $14   ; <と>
- D - I - - 0x016C0A 0B:8BFA: 14        .byte $14   ; <と>
- D - I - - 0x016C0B 0B:8BFB: 14        .byte $14   ; <と>
- D - I - - 0x016C0C 0B:8BFC: 13        .byte $13   ; <て>
- D - I - - 0x016C0D 0B:8BFD: 13        .byte $13   ; <て>
- D - I - - 0x016C0E 0B:8BFE: 13        .byte $13   ; <て>
- D - I - - 0x016C0F 0B:8BFF: 13        .byte $13   ; <て>
- D - I - - 0x016C10 0B:8C00: 13        .byte $13   ; <て>
- D - I - - 0x016C11 0B:8C01: 13        .byte $13   ; <て>
- D - I - - 0x016C12 0B:8C02: 13        .byte $13   ; <て>
- D - I - - 0x016C13 0B:8C03: 13        .byte $13   ; <て>
- D - I - - 0x016C14 0B:8C04: 16        .byte $16   ; <に>
- D - I - - 0x016C15 0B:8C05: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C16 0B:8C06: 18        .byte $18   ; <ね>
- D - I - - 0x016C17 0B:8C07: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C18 0B:8C08: 16        .byte $16   ; <に>
- D - I - - 0x016C19 0B:8C09: 15        .byte $15   ; <な>
- D - I - - 0x016C1A 0B:8C0A: 16        .byte $16   ; <に>
- D - I - - 0x016C1B 0B:8C0B: 15        .byte $15   ; <な>
- D - I - - 0x016C1C 0B:8C0C: 1A        .byte $1A   ; <は>
- D - I - - 0x016C1D 0B:8C0D: 19        .byte $19   ; <の>
- D - I - - 0x016C1E 0B:8C0E: 1B        .byte $1B   ; <ひ>
- D - I - - 0x016C1F 0B:8C0F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x016C20 0B:8C10: 1A        .byte $1A   ; <は>
- D - I - - 0x016C21 0B:8C11: 19        .byte $19   ; <の>
- D - I - - 0x016C22 0B:8C12: 1A        .byte $1A   ; <は>
- D - I - - 0x016C23 0B:8C13: 19        .byte $19   ; <の>
- D - I - - 0x016C24 0B:8C14: 14        .byte $14   ; <と>
- D - I - - 0x016C25 0B:8C15: 14        .byte $14   ; <と>
- D - I - - 0x016C26 0B:8C16: 14        .byte $14   ; <と>
- D - I - - 0x016C27 0B:8C17: 14        .byte $14   ; <と>
- D - I - - 0x016C28 0B:8C18: 14        .byte $14   ; <と>
- D - I - - 0x016C29 0B:8C19: 14        .byte $14   ; <と>
- D - I - - 0x016C2A 0B:8C1A: 14        .byte $14   ; <と>
- D - I - - 0x016C2B 0B:8C1B: 14        .byte $14   ; <と>
- D - I - - 0x016C2C 0B:8C1C: 13        .byte $13   ; <て>
- D - I - - 0x016C2D 0B:8C1D: 13        .byte $13   ; <て>
- D - I - - 0x016C2E 0B:8C1E: 13        .byte $13   ; <て>
- D - I - - 0x016C2F 0B:8C1F: 13        .byte $13   ; <て>
- D - I - - 0x016C30 0B:8C20: 13        .byte $13   ; <て>
- D - I - - 0x016C31 0B:8C21: 13        .byte $13   ; <て>
- D - I - - 0x016C32 0B:8C22: 13        .byte $13   ; <て>
- D - I - - 0x016C33 0B:8C23: 13        .byte $13   ; <て>
- D - I - - 0x016C34 0B:8C24: 15        .byte $15   ; <な>
- D - I - - 0x016C35 0B:8C25: 16        .byte $16   ; <に>
- D - I - - 0x016C36 0B:8C26: 15        .byte $15   ; <な>
- D - I - - 0x016C37 0B:8C27: 16        .byte $16   ; <に>
- D - I - - 0x016C38 0B:8C28: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C39 0B:8C29: 18        .byte $18   ; <ね>
- D - I - - 0x016C3A 0B:8C2A: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C3B 0B:8C2B: 16        .byte $16   ; <に>
- D - I - - 0x016C3C 0B:8C2C: 19        .byte $19   ; <の>
- D - I - - 0x016C3D 0B:8C2D: 1A        .byte $1A   ; <は>
- D - I - - 0x016C3E 0B:8C2E: 19        .byte $19   ; <の>
- D - I - - 0x016C3F 0B:8C2F: 1A        .byte $1A   ; <は>
- D - I - - 0x016C40 0B:8C30: 19        .byte $19   ; <の>
- D - I - - 0x016C41 0B:8C31: 1D        .byte $1D   ; <へ>
- D - I - - 0x016C42 0B:8C32: 1E        .byte $1E   ; <ほ>
- D - I - - 0x016C43 0B:8C33: 2E        .byte $2E   ; <ん>
- D - I - - 0x016C44 0B:8C34: 23        .byte $23   ; <も>
- D - I - - 0x016C45 0B:8C35: 23        .byte $23   ; <も>
- D - I - - 0x016C46 0B:8C36: 23        .byte $23   ; <も>
- D - I - - 0x016C47 0B:8C37: 23        .byte $23   ; <も>
- D - I - - 0x016C48 0B:8C38: 23        .byte $23   ; <も>
- D - I - - 0x016C49 0B:8C39: 20        .byte $20   ; <み>
- D - I - - 0x016C4A 0B:8C3A: 21        .byte $21   ; <む>
- D - I - - 0x016C4B 0B:8C3B: 22        .byte $22   ; <め>
- D - I - - 0x016C4C 0B:8C3C: 13        .byte $13   ; <て>
- D - I - - 0x016C4D 0B:8C3D: 13        .byte $13   ; <て>
- D - I - - 0x016C4E 0B:8C3E: 13        .byte $13   ; <て>
- D - I - - 0x016C4F 0B:8C3F: 13        .byte $13   ; <て>
- D - I - - 0x016C50 0B:8C40: 13        .byte $13   ; <て>
- D - I - - 0x016C51 0B:8C41: 13        .byte $13   ; <て>
- D - I - - 0x016C52 0B:8C42: 13        .byte $13   ; <て>
- D - I - - 0x016C53 0B:8C43: 13        .byte $13   ; <て>
- D - I - - 0x016C54 0B:8C44: 16        .byte $16   ; <に>
- D - I - - 0x016C55 0B:8C45: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C56 0B:8C46: 18        .byte $18   ; <ね>
- D - I - - 0x016C57 0B:8C47: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C58 0B:8C48: 16        .byte $16   ; <に>
- D - I - - 0x016C59 0B:8C49: 15        .byte $15   ; <な>
- D - I - - 0x016C5A 0B:8C4A: 16        .byte $16   ; <に>
- D - I - - 0x016C5B 0B:8C4B: 15        .byte $15   ; <な>
- D - I - - 0x016C5C 0B:8C4C: 1A        .byte $1A   ; <は>
- D - I - - 0x016C5D 0B:8C4D: 19        .byte $19   ; <の>
- D - I - - 0x016C5E 0B:8C4E: 1D        .byte $1D   ; <へ>
- D - I - - 0x016C5F 0B:8C4F: 1E        .byte $1E   ; <ほ>
- D - I - - 0x016C60 0B:8C50: 2E        .byte $2E   ; <ん>
- D - I - - 0x016C61 0B:8C51: 19        .byte $19   ; <の>
- D - I - - 0x016C62 0B:8C52: 1A        .byte $1A   ; <は>
- D - I - - 0x016C63 0B:8C53: 19        .byte $19   ; <の>
- D - I - - 0x016C64 0B:8C54: 23        .byte $23   ; <も>
- D - I - - 0x016C65 0B:8C55: 23        .byte $23   ; <も>
- D - I - - 0x016C66 0B:8C56: 20        .byte $20   ; <み>
- D - I - - 0x016C67 0B:8C57: 21        .byte $21   ; <む>
- D - I - - 0x016C68 0B:8C58: 22        .byte $22   ; <め>
- D - I - - 0x016C69 0B:8C59: 23        .byte $23   ; <も>
- D - I - - 0x016C6A 0B:8C5A: 23        .byte $23   ; <も>
- D - I - - 0x016C6B 0B:8C5B: 23        .byte $23   ; <も>
- D - I - - 0x016C6C 0B:8C5C: 13        .byte $13   ; <て>
- D - I - - 0x016C6D 0B:8C5D: 13        .byte $13   ; <て>
- D - I - - 0x016C6E 0B:8C5E: 13        .byte $13   ; <て>
- D - I - - 0x016C6F 0B:8C5F: 13        .byte $13   ; <て>
- D - I - - 0x016C70 0B:8C60: 13        .byte $13   ; <て>
- D - I - - 0x016C71 0B:8C61: 13        .byte $13   ; <て>
- D - I - - 0x016C72 0B:8C62: 13        .byte $13   ; <て>
- D - I - - 0x016C73 0B:8C63: 13        .byte $13   ; <て>
- - - - - - 0x016C74 0B:8C64: 15        .byte $15   ; <な>
- - - - - - 0x016C75 0B:8C65: 16        .byte $16   ; <に>
- - - - - - 0x016C76 0B:8C66: 15        .byte $15   ; <な>
- - - - - - 0x016C77 0B:8C67: 16        .byte $16   ; <に>
- - - - - - 0x016C78 0B:8C68: 17        .byte $17   ; <ぬ>
- - - - - - 0x016C79 0B:8C69: 18        .byte $18   ; <ね>
- - - - - - 0x016C7A 0B:8C6A: 17        .byte $17   ; <ぬ>
- - - - - - 0x016C7B 0B:8C6B: 16        .byte $16   ; <に>
- - - - - - 0x016C7C 0B:8C6C: 19        .byte $19   ; <の>
- - - - - - 0x016C7D 0B:8C6D: 1A        .byte $1A   ; <は>
- - - - - - 0x016C7E 0B:8C6E: 19        .byte $19   ; <の>
- - - - - - 0x016C7F 0B:8C6F: 1A        .byte $1A   ; <は>
- - - - - - 0x016C80 0B:8C70: 19        .byte $19   ; <の>
- - - - - - 0x016C81 0B:8C71: 24        .byte $24   ; <や>
- - - - - - 0x016C82 0B:8C72: 25        .byte $25   ; <ゆ>
- - - - - - 0x016C83 0B:8C73: 26        .byte $26   ; <よ>
- - - - - - 0x016C84 0B:8C74: 2D        .byte $2D   ; <を>
- - - - - - 0x016C85 0B:8C75: 2D        .byte $2D   ; <を>
- - - - - - 0x016C86 0B:8C76: 2D        .byte $2D   ; <を>
- - - - - - 0x016C87 0B:8C77: 2D        .byte $2D   ; <を>
- - - - - - 0x016C88 0B:8C78: 2D        .byte $2D   ; <を>
- - - - - - 0x016C89 0B:8C79: 28        .byte $28   ; <り>
- - - - - - 0x016C8A 0B:8C7A: 29        .byte $29   ; <る>
- - - - - - 0x016C8B 0B:8C7B: 2A        .byte $2A   ; <れ>
- - - - - - 0x016C8C 0B:8C7C: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C8D 0B:8C7D: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C8E 0B:8C7E: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C8F 0B:8C7F: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C90 0B:8C80: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C91 0B:8C81: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C92 0B:8C82: 2C        .byte $2C   ; <わ>
- - - - - - 0x016C93 0B:8C83: 2C        .byte $2C   ; <わ>
- D - I - - 0x016C94 0B:8C84: 16        .byte $16   ; <に>
- D - I - - 0x016C95 0B:8C85: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C96 0B:8C86: 18        .byte $18   ; <ね>
- D - I - - 0x016C97 0B:8C87: 17        .byte $17   ; <ぬ>
- D - I - - 0x016C98 0B:8C88: 16        .byte $16   ; <に>
- D - I - - 0x016C99 0B:8C89: 15        .byte $15   ; <な>
- D - I - - 0x016C9A 0B:8C8A: 16        .byte $16   ; <に>
- D - I - - 0x016C9B 0B:8C8B: 15        .byte $15   ; <な>
- D - I - - 0x016C9C 0B:8C8C: 26        .byte $26   ; <よ>
- D - I - - 0x016C9D 0B:8C8D: 25        .byte $25   ; <ゆ>
- D - I - - 0x016C9E 0B:8C8E: 27        .byte $27   ; <ら>
- D - I - - 0x016C9F 0B:8C8F: 19        .byte $19   ; <の>
- D - I - - 0x016CA0 0B:8C90: 1A        .byte $1A   ; <は>
- D - I - - 0x016CA1 0B:8C91: 19        .byte $19   ; <の>
- D - I - - 0x016CA2 0B:8C92: 1A        .byte $1A   ; <は>
- D - I - - 0x016CA3 0B:8C93: 19        .byte $19   ; <の>
- D - I - - 0x016CA4 0B:8C94: 2A        .byte $2A   ; <れ>
- D - I - - 0x016CA5 0B:8C95: 29        .byte $29   ; <る>
- D - I - - 0x016CA6 0B:8C96: 2B        .byte $2B   ; <ろ>
- D - I - - 0x016CA7 0B:8C97: 2D        .byte $2D   ; <を>
- D - I - - 0x016CA8 0B:8C98: 2D        .byte $2D   ; <を>
- D - I - - 0x016CA9 0B:8C99: 2D        .byte $2D   ; <を>
- D - I - - 0x016CAA 0B:8C9A: 2D        .byte $2D   ; <を>
- D - I - - 0x016CAB 0B:8C9B: 2D        .byte $2D   ; <を>
- D - I - - 0x016CAC 0B:8C9C: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CAD 0B:8C9D: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CAE 0B:8C9E: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CAF 0B:8C9F: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CB0 0B:8CA0: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CB1 0B:8CA1: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CB2 0B:8CA2: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CB3 0B:8CA3: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CB4 0B:8CA4: 16        .byte $16   ; <に>
- D - I - - 0x016CB5 0B:8CA5: 15        .byte $15   ; <な>
- D - I - - 0x016CB6 0B:8CA6: 16        .byte $16   ; <に>
- D - I - - 0x016CB7 0B:8CA7: 15        .byte $15   ; <な>
- D - I - - 0x016CB8 0B:8CA8: 16        .byte $16   ; <に>
- D - I - - 0x016CB9 0B:8CA9: 15        .byte $15   ; <な>
- D - I - - 0x016CBA 0B:8CAA: 16        .byte $16   ; <に>
- D - I - - 0x016CBB 0B:8CAB: 15        .byte $15   ; <な>
- D - I - - 0x016CBC 0B:8CAC: 26        .byte $26   ; <よ>
- D - I - - 0x016CBD 0B:8CAD: 25        .byte $25   ; <ゆ>
- D - I - - 0x016CBE 0B:8CAE: 2E        .byte $2E   ; <ん>
- D - I - - 0x016CBF 0B:8CAF: 19        .byte $19   ; <の>
- D - I - - 0x016CC0 0B:8CB0: 1A        .byte $1A   ; <は>
- D - I - - 0x016CC1 0B:8CB1: 19        .byte $19   ; <の>
- D - I - - 0x016CC2 0B:8CB2: 1A        .byte $1A   ; <は>
- D - I - - 0x016CC3 0B:8CB3: 19        .byte $19   ; <の>
- D - I - - 0x016CC4 0B:8CB4: 2A        .byte $2A   ; <れ>
- D - I - - 0x016CC5 0B:8CB5: 29        .byte $29   ; <る>
- D - I - - 0x016CC6 0B:8CB6: 2B        .byte $2B   ; <ろ>
- D - I - - 0x016CC7 0B:8CB7: 2D        .byte $2D   ; <を>
- D - I - - 0x016CC8 0B:8CB8: 2D        .byte $2D   ; <を>
- D - I - - 0x016CC9 0B:8CB9: 2D        .byte $2D   ; <を>
- D - I - - 0x016CCA 0B:8CBA: 2D        .byte $2D   ; <を>
- D - I - - 0x016CCB 0B:8CBB: 2D        .byte $2D   ; <を>
- D - I - - 0x016CCC 0B:8CBC: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CCD 0B:8CBD: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CCE 0B:8CBE: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CCF 0B:8CBF: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CD0 0B:8CC0: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CD1 0B:8CC1: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CD2 0B:8CC2: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CD3 0B:8CC3: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CD4 0B:8CC4: 15        .byte $15   ; <な>
- D - I - - 0x016CD5 0B:8CC5: 16        .byte $16   ; <に>
- D - I - - 0x016CD6 0B:8CC6: 15        .byte $15   ; <な>
- D - I - - 0x016CD7 0B:8CC7: 16        .byte $16   ; <に>
- D - I - - 0x016CD8 0B:8CC8: 15        .byte $15   ; <な>
- D - I - - 0x016CD9 0B:8CC9: 16        .byte $16   ; <に>
- D - I - - 0x016CDA 0B:8CCA: 15        .byte $15   ; <な>
- D - I - - 0x016CDB 0B:8CCB: 16        .byte $16   ; <に>
- D - I - - 0x016CDC 0B:8CCC: 19        .byte $19   ; <の>
- D - I - - 0x016CDD 0B:8CCD: 1A        .byte $1A   ; <は>
- D - I - - 0x016CDE 0B:8CCE: 19        .byte $19   ; <の>
- D - I - - 0x016CDF 0B:8CCF: 1A        .byte $1A   ; <は>
- D - I - - 0x016CE0 0B:8CD0: 19        .byte $19   ; <の>
- D - I - - 0x016CE1 0B:8CD1: 31        .byte $31   ; <ゅ>
- D - I - - 0x016CE2 0B:8CD2: 25        .byte $25   ; <ゆ>
- D - I - - 0x016CE3 0B:8CD3: 26        .byte $26   ; <よ>
- D - I - - 0x016CE4 0B:8CD4: 2D        .byte $2D   ; <を>
- D - I - - 0x016CE5 0B:8CD5: 2D        .byte $2D   ; <を>
- D - I - - 0x016CE6 0B:8CD6: 2D        .byte $2D   ; <を>
- D - I - - 0x016CE7 0B:8CD7: 2D        .byte $2D   ; <を>
- D - I - - 0x016CE8 0B:8CD8: 2D        .byte $2D   ; <を>
- D - I - - 0x016CE9 0B:8CD9: 28        .byte $28   ; <り>
- D - I - - 0x016CEA 0B:8CDA: 29        .byte $29   ; <る>
- D - I - - 0x016CEB 0B:8CDB: 2A        .byte $2A   ; <れ>
- D - I - - 0x016CEC 0B:8CDC: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CED 0B:8CDD: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CEE 0B:8CDE: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CEF 0B:8CDF: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CF0 0B:8CE0: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CF1 0B:8CE1: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CF2 0B:8CE2: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CF3 0B:8CE3: 2C        .byte $2C   ; <わ>
- D - I - - 0x016CF4 0B:8CE4: 15        .byte $15   ; <な>
- D - I - - 0x016CF5 0B:8CE5: 16        .byte $16   ; <に>
- D - I - - 0x016CF6 0B:8CE6: 15        .byte $15   ; <な>
- D - I - - 0x016CF7 0B:8CE7: 16        .byte $16   ; <に>
- D - I - - 0x016CF8 0B:8CE8: 15        .byte $15   ; <な>
- D - I - - 0x016CF9 0B:8CE9: 16        .byte $16   ; <に>
- D - I - - 0x016CFA 0B:8CEA: 15        .byte $15   ; <な>
- D - I - - 0x016CFB 0B:8CEB: 16        .byte $16   ; <に>
- D - I - - 0x016CFC 0B:8CEC: 19        .byte $19   ; <の>
- D - I - - 0x016CFD 0B:8CED: 2F        .byte $2F   ; <っ>
- D - I - - 0x016CFE 0B:8CEE: 1E        .byte $1E   ; <ほ>
- D - I - - 0x016CFF 0B:8CEF: 2E        .byte $2E   ; <ん>
- D - I - - 0x016D00 0B:8CF0: 19        .byte $19   ; <の>
- D - I - - 0x016D01 0B:8CF1: 1A        .byte $1A   ; <は>
- D - I - - 0x016D02 0B:8CF2: 19        .byte $19   ; <の>
- D - I - - 0x016D03 0B:8CF3: 1A        .byte $1A   ; <は>
- D - I - - 0x016D04 0B:8CF4: 23        .byte $23   ; <も>
- D - I - - 0x016D05 0B:8CF5: 20        .byte $20   ; <み>
- D - I - - 0x016D06 0B:8CF6: 21        .byte $21   ; <む>
- D - I - - 0x016D07 0B:8CF7: 22        .byte $22   ; <め>
- D - I - - 0x016D08 0B:8CF8: 23        .byte $23   ; <も>
- D - I - - 0x016D09 0B:8CF9: 23        .byte $23   ; <も>
- D - I - - 0x016D0A 0B:8CFA: 23        .byte $23   ; <も>
- D - I - - 0x016D0B 0B:8CFB: 23        .byte $23   ; <も>
- D - I - - 0x016D0C 0B:8CFC: 13        .byte $13   ; <て>
- D - I - - 0x016D0D 0B:8CFD: 13        .byte $13   ; <て>
- D - I - - 0x016D0E 0B:8CFE: 13        .byte $13   ; <て>
- D - I - - 0x016D0F 0B:8CFF: 13        .byte $13   ; <て>
- D - I - - 0x016D10 0B:8D00: 13        .byte $13   ; <て>
- D - I - - 0x016D11 0B:8D01: 13        .byte $13   ; <て>
- D - I - - 0x016D12 0B:8D02: 13        .byte $13   ; <て>
- D - I - - 0x016D13 0B:8D03: 13        .byte $13   ; <て>
- D - I - - 0x016D14 0B:8D04: 15        .byte $15   ; <な>
- D - I - - 0x016D15 0B:8D05: 16        .byte $16   ; <に>
- D - I - - 0x016D16 0B:8D06: 15        .byte $15   ; <な>
- D - I - - 0x016D17 0B:8D07: 16        .byte $16   ; <に>
- D - I - - 0x016D18 0B:8D08: 15        .byte $15   ; <な>
- D - I - - 0x016D19 0B:8D09: 16        .byte $16   ; <に>
- D - I - - 0x016D1A 0B:8D0A: 15        .byte $15   ; <な>
- D - I - - 0x016D1B 0B:8D0B: 16        .byte $16   ; <に>
- D - I - - 0x016D1C 0B:8D0C: 19        .byte $19   ; <の>
- D - I - - 0x016D1D 0B:8D0D: 1A        .byte $1A   ; <は>
- D - I - - 0x016D1E 0B:8D0E: 19        .byte $19   ; <の>
- D - I - - 0x016D1F 0B:8D0F: 1A        .byte $1A   ; <は>
- D - I - - 0x016D20 0B:8D10: 19        .byte $19   ; <の>
- D - I - - 0x016D21 0B:8D11: 2F        .byte $2F   ; <っ>
- D - I - - 0x016D22 0B:8D12: 1E        .byte $1E   ; <ほ>
- D - I - - 0x016D23 0B:8D13: 2E        .byte $2E   ; <ん>
- D - I - - 0x016D24 0B:8D14: 23        .byte $23   ; <も>
- D - I - - 0x016D25 0B:8D15: 23        .byte $23   ; <も>
- D - I - - 0x016D26 0B:8D16: 23        .byte $23   ; <も>
- D - I - - 0x016D27 0B:8D17: 23        .byte $23   ; <も>
- D - I - - 0x016D28 0B:8D18: 23        .byte $23   ; <も>
- D - I - - 0x016D29 0B:8D19: 20        .byte $20   ; <み>
- D - I - - 0x016D2A 0B:8D1A: 21        .byte $21   ; <む>
- D - I - - 0x016D2B 0B:8D1B: 22        .byte $22   ; <め>
- D - I - - 0x016D2C 0B:8D1C: 13        .byte $13   ; <て>
- D - I - - 0x016D2D 0B:8D1D: 13        .byte $13   ; <て>
- D - I - - 0x016D2E 0B:8D1E: 13        .byte $13   ; <て>
- D - I - - 0x016D2F 0B:8D1F: 13        .byte $13   ; <て>
- D - I - - 0x016D30 0B:8D20: 13        .byte $13   ; <て>
- D - I - - 0x016D31 0B:8D21: 13        .byte $13   ; <て>
- D - I - - 0x016D32 0B:8D22: 13        .byte $13   ; <て>
- D - I - - 0x016D33 0B:8D23: 13        .byte $13   ; <て>
- D - I - - 0x016D34 0B:8D24: 00        .byte $00
- D - I - - 0x016D35 0B:8D25: 05        .byte $05   ; <お>
- D - I - - 0x016D36 0B:8D26: 00        .byte $00
- D - I - - 0x016D37 0B:8D27: 00        .byte $00
- D - I - - 0x016D38 0B:8D28: 00        .byte $00
- D - I - - 0x016D39 0B:8D29: 0A        .byte $0A   ; <こ>
- D - I - - 0x016D3A 0B:8D2A: 06        .byte $06   ; <か>
- D - I - - 0x016D3B 0B:8D2B: 07        .byte $07   ; <き>
- D - I - - 0x016D3C 0B:8D2C: 0D        .byte $0D   ; <す>
- D - I - - 0x016D3D 0B:8D2D: 0C        .byte $0C   ; <し>
- D - I - - 0x016D3E 0B:8D2E: 32        .byte $32   ; <ょ>
- D - I - - 0x016D3F 0B:8D2F: 33        .byte $33   ; <0>
- D - I - - 0x016D40 0B:8D30: 0D        .byte $0D   ; <す>
- D - I - - 0x016D41 0B:8D31: 0C        .byte $0C   ; <し>
- D - I - - 0x016D42 0B:8D32: 0D        .byte $0D   ; <す>
- D - I - - 0x016D43 0B:8D33: 0C        .byte $0C   ; <し>
- D - I - - 0x016D44 0B:8D34: 14        .byte $14   ; <と>
- D - I - - 0x016D45 0B:8D35: 14        .byte $14   ; <と>
- D - I - - 0x016D46 0B:8D36: 14        .byte $14   ; <と>
- D - I - - 0x016D47 0B:8D37: 14        .byte $14   ; <と>
- D - I - - 0x016D48 0B:8D38: 14        .byte $14   ; <と>
- D - I - - 0x016D49 0B:8D39: 14        .byte $14   ; <と>
- D - I - - 0x016D4A 0B:8D3A: 14        .byte $14   ; <と>
- D - I - - 0x016D4B 0B:8D3B: 14        .byte $14   ; <と>
- D - I - - 0x016D4C 0B:8D3C: 13        .byte $13   ; <て>
- D - I - - 0x016D4D 0B:8D3D: 13        .byte $13   ; <て>
- D - I - - 0x016D4E 0B:8D3E: 13        .byte $13   ; <て>
- D - I - - 0x016D4F 0B:8D3F: 13        .byte $13   ; <て>
- D - I - - 0x016D50 0B:8D40: 13        .byte $13   ; <て>
- D - I - - 0x016D51 0B:8D41: 13        .byte $13   ; <て>
- D - I - - 0x016D52 0B:8D42: 13        .byte $13   ; <て>
- D - I - - 0x016D53 0B:8D43: 13        .byte $13   ; <て>
- D - I - - 0x016D54 0B:8D44: 00        .byte $00
- D - I - - 0x016D55 0B:8D45: 00        .byte $00
- D - I - - 0x016D56 0B:8D46: 0A        .byte $0A   ; <こ>
- D - I - - 0x016D57 0B:8D47: 08        .byte $08   ; <く>
- D - I - - 0x016D58 0B:8D48: 00        .byte $00
- D - I - - 0x016D59 0B:8D49: 00        .byte $00
- D - I - - 0x016D5A 0B:8D4A: 05        .byte $05   ; <お>
- D - I - - 0x016D5B 0B:8D4B: 00        .byte $00
- D - I - - 0x016D5C 0B:8D4C: 0C        .byte $0C   ; <し>
- D - I - - 0x016D5D 0B:8D4D: 0D        .byte $0D   ; <す>
- D - I - - 0x016D5E 0B:8D4E: 0C        .byte $0C   ; <し>
- D - I - - 0x016D5F 0B:8D4F: 0D        .byte $0D   ; <す>
- D - I - - 0x016D60 0B:8D50: 0C        .byte $0C   ; <し>
- D - I - - 0x016D61 0B:8D51: 32        .byte $32   ; <ょ>
- D - I - - 0x016D62 0B:8D52: 33        .byte $33   ; <0>
- D - I - - 0x016D63 0B:8D53: 0D        .byte $0D   ; <す>
- D - I - - 0x016D64 0B:8D54: 14        .byte $14   ; <と>
- D - I - - 0x016D65 0B:8D55: 14        .byte $14   ; <と>
- D - I - - 0x016D66 0B:8D56: 14        .byte $14   ; <と>
- D - I - - 0x016D67 0B:8D57: 14        .byte $14   ; <と>
- D - I - - 0x016D68 0B:8D58: 14        .byte $14   ; <と>
- D - I - - 0x016D69 0B:8D59: 14        .byte $14   ; <と>
- D - I - - 0x016D6A 0B:8D5A: 14        .byte $14   ; <と>
- D - I - - 0x016D6B 0B:8D5B: 14        .byte $14   ; <と>
- D - I - - 0x016D6C 0B:8D5C: 13        .byte $13   ; <て>
- D - I - - 0x016D6D 0B:8D5D: 13        .byte $13   ; <て>
- D - I - - 0x016D6E 0B:8D5E: 13        .byte $13   ; <て>
- D - I - - 0x016D6F 0B:8D5F: 13        .byte $13   ; <て>
- D - I - - 0x016D70 0B:8D60: 13        .byte $13   ; <て>
- D - I - - 0x016D71 0B:8D61: 13        .byte $13   ; <て>
- D - I - - 0x016D72 0B:8D62: 13        .byte $13   ; <て>
- D - I - - 0x016D73 0B:8D63: 13        .byte $13   ; <て>
- D - I - - 0x016D74 0B:8D64: 15        .byte $15   ; <な>
- D - I - - 0x016D75 0B:8D65: 16        .byte $16   ; <に>
- D - I - - 0x016D76 0B:8D66: 15        .byte $15   ; <な>
- D - I - - 0x016D77 0B:8D67: 16        .byte $16   ; <に>
- D - I - - 0x016D78 0B:8D68: 15        .byte $15   ; <な>
- D - I - - 0x016D79 0B:8D69: 16        .byte $16   ; <に>
- D - I - - 0x016D7A 0B:8D6A: 15        .byte $15   ; <な>
- D - I - - 0x016D7B 0B:8D6B: 16        .byte $16   ; <に>
- D - I - - 0x016D7C 0B:8D6C: 19        .byte $19   ; <の>
- D - I - - 0x016D7D 0B:8D6D: 30        .byte $30   ; <ゃ>
- D - I - - 0x016D7E 0B:8D6E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x016D7F 0B:8D6F: 1A        .byte $1A   ; <は>
- D - I - - 0x016D80 0B:8D70: 19        .byte $19   ; <の>
- D - I - - 0x016D81 0B:8D71: 1A        .byte $1A   ; <は>
- D - I - - 0x016D82 0B:8D72: 19        .byte $19   ; <の>
- D - I - - 0x016D83 0B:8D73: 1A        .byte $1A   ; <は>
- D - I - - 0x016D84 0B:8D74: 14        .byte $14   ; <と>
- D - I - - 0x016D85 0B:8D75: 14        .byte $14   ; <と>
- D - I - - 0x016D86 0B:8D76: 14        .byte $14   ; <と>
- D - I - - 0x016D87 0B:8D77: 14        .byte $14   ; <と>
- D - I - - 0x016D88 0B:8D78: 14        .byte $14   ; <と>
- D - I - - 0x016D89 0B:8D79: 14        .byte $14   ; <と>
- D - I - - 0x016D8A 0B:8D7A: 14        .byte $14   ; <と>
- D - I - - 0x016D8B 0B:8D7B: 14        .byte $14   ; <と>
- D - I - - 0x016D8C 0B:8D7C: 13        .byte $13   ; <て>
- D - I - - 0x016D8D 0B:8D7D: 13        .byte $13   ; <て>
- D - I - - 0x016D8E 0B:8D7E: 13        .byte $13   ; <て>
- D - I - - 0x016D8F 0B:8D7F: 13        .byte $13   ; <て>
- D - I - - 0x016D90 0B:8D80: 13        .byte $13   ; <て>
- D - I - - 0x016D91 0B:8D81: 13        .byte $13   ; <て>
- D - I - - 0x016D92 0B:8D82: 13        .byte $13   ; <て>
- D - I - - 0x016D93 0B:8D83: 13        .byte $13   ; <て>
- D - I - - 0x016D94 0B:8D84: 15        .byte $15   ; <な>
- D - I - - 0x016D95 0B:8D85: 16        .byte $16   ; <に>
- D - I - - 0x016D96 0B:8D86: 15        .byte $15   ; <な>
- D - I - - 0x016D97 0B:8D87: 16        .byte $16   ; <に>
- D - I - - 0x016D98 0B:8D88: 15        .byte $15   ; <な>
- D - I - - 0x016D99 0B:8D89: 16        .byte $16   ; <に>
- D - I - - 0x016D9A 0B:8D8A: 15        .byte $15   ; <な>
- D - I - - 0x016D9B 0B:8D8B: 16        .byte $16   ; <に>
- D - I - - 0x016D9C 0B:8D8C: 19        .byte $19   ; <の>
- D - I - - 0x016D9D 0B:8D8D: 1A        .byte $1A   ; <は>
- D - I - - 0x016D9E 0B:8D8E: 19        .byte $19   ; <の>
- D - I - - 0x016D9F 0B:8D8F: 1A        .byte $1A   ; <は>
- D - I - - 0x016DA0 0B:8D90: 19        .byte $19   ; <の>
- D - I - - 0x016DA1 0B:8D91: 30        .byte $30   ; <ゃ>
- D - I - - 0x016DA2 0B:8D92: 1C        .byte $1C   ; <ふ>
- D - I - - 0x016DA3 0B:8D93: 1A        .byte $1A   ; <は>
- D - I - - 0x016DA4 0B:8D94: 14        .byte $14   ; <と>
- D - I - - 0x016DA5 0B:8D95: 14        .byte $14   ; <と>
- D - I - - 0x016DA6 0B:8D96: 14        .byte $14   ; <と>
- D - I - - 0x016DA7 0B:8D97: 14        .byte $14   ; <と>
- D - I - - 0x016DA8 0B:8D98: 14        .byte $14   ; <と>
- D - I - - 0x016DA9 0B:8D99: 14        .byte $14   ; <と>
- D - I - - 0x016DAA 0B:8D9A: 14        .byte $14   ; <と>
- D - I - - 0x016DAB 0B:8D9B: 14        .byte $14   ; <と>
- D - I - - 0x016DAC 0B:8D9C: 13        .byte $13   ; <て>
- D - I - - 0x016DAD 0B:8D9D: 13        .byte $13   ; <て>
- D - I - - 0x016DAE 0B:8D9E: 13        .byte $13   ; <て>
- D - I - - 0x016DAF 0B:8D9F: 13        .byte $13   ; <て>
- D - I - - 0x016DB0 0B:8DA0: 13        .byte $13   ; <て>
- D - I - - 0x016DB1 0B:8DA1: 13        .byte $13   ; <て>
- D - I - - 0x016DB2 0B:8DA2: 13        .byte $13   ; <て>
- D - I - - 0x016DB3 0B:8DA3: 13        .byte $13   ; <て>
- D - I - - 0x016DB4 0B:8DA4: 00        .byte $00
- D - I - - 0x016DB5 0B:8DA5: 08        .byte $08   ; <く>
- D - I - - 0x016DB6 0B:8DA6: 00        .byte $00
- D - I - - 0x016DB7 0B:8DA7: 06        .byte $06   ; <か>
- D - I - - 0x016DB8 0B:8DA8: 07        .byte $07   ; <き>
- D - I - - 0x016DB9 0B:8DA9: 00        .byte $00
- D - I - - 0x016DBA 0B:8DAA: 0A        .byte $0A   ; <こ>
- D - I - - 0x016DBB 0B:8DAB: 00        .byte $00
- D - I - - 0x016DBC 0B:8DAC: 0D        .byte $0D   ; <す>
- D - I - - 0x016DBD 0B:8DAD: 0C        .byte $0C   ; <し>
- D - I - - 0x016DBE 0B:8DAE: 32        .byte $32   ; <ょ>
- D - I - - 0x016DBF 0B:8DAF: 33        .byte $33   ; <0>
- D - I - - 0x016DC0 0B:8DB0: 0D        .byte $0D   ; <す>
- D - I - - 0x016DC1 0B:8DB1: 0C        .byte $0C   ; <し>
- D - I - - 0x016DC2 0B:8DB2: 0D        .byte $0D   ; <す>
- D - I - - 0x016DC3 0B:8DB3: 0C        .byte $0C   ; <し>
- D - I - - 0x016DC4 0B:8DB4: 12        .byte $12   ; <つ>
- D - I - - 0x016DC5 0B:8DB5: 12        .byte $12   ; <つ>
- D - I - - 0x016DC6 0B:8DB6: 12        .byte $12   ; <つ>
- D - I - - 0x016DC7 0B:8DB7: 12        .byte $12   ; <つ>
- D - I - - 0x016DC8 0B:8DB8: 12        .byte $12   ; <つ>
- D - I - - 0x016DC9 0B:8DB9: 12        .byte $12   ; <つ>
- D - I - - 0x016DCA 0B:8DBA: 12        .byte $12   ; <つ>
- D - I - - 0x016DCB 0B:8DBB: 12        .byte $12   ; <つ>
- D - I - - 0x016DCC 0B:8DBC: 13        .byte $13   ; <て>
- D - I - - 0x016DCD 0B:8DBD: 13        .byte $13   ; <て>
- D - I - - 0x016DCE 0B:8DBE: 13        .byte $13   ; <て>
- D - I - - 0x016DCF 0B:8DBF: 13        .byte $13   ; <て>
- D - I - - 0x016DD0 0B:8DC0: 13        .byte $13   ; <て>
- D - I - - 0x016DD1 0B:8DC1: 13        .byte $13   ; <て>
- D - I - - 0x016DD2 0B:8DC2: 13        .byte $13   ; <て>
- D - I - - 0x016DD3 0B:8DC3: 13        .byte $13   ; <て>
- D - I - - 0x016DD4 0B:8DC4: 0A        .byte $0A   ; <こ>
- D - I - - 0x016DD5 0B:8DC5: 00        .byte $00
- D - I - - 0x016DD6 0B:8DC6: 08        .byte $08   ; <く>
- D - I - - 0x016DD7 0B:8DC7: 00        .byte $00
- D - I - - 0x016DD8 0B:8DC8: 06        .byte $06   ; <か>
- D - I - - 0x016DD9 0B:8DC9: 07        .byte $07   ; <き>
- D - I - - 0x016DDA 0B:8DCA: 00        .byte $00
- D - I - - 0x016DDB 0B:8DCB: 00        .byte $00
- D - I - - 0x016DDC 0B:8DCC: 0C        .byte $0C   ; <し>
- D - I - - 0x016DDD 0B:8DCD: 0D        .byte $0D   ; <す>
- D - I - - 0x016DDE 0B:8DCE: 0C        .byte $0C   ; <し>
- D - I - - 0x016DDF 0B:8DCF: 0D        .byte $0D   ; <す>
- D - I - - 0x016DE0 0B:8DD0: 0C        .byte $0C   ; <し>
- D - I - - 0x016DE1 0B:8DD1: 32        .byte $32   ; <ょ>
- D - I - - 0x016DE2 0B:8DD2: 33        .byte $33   ; <0>
- D - I - - 0x016DE3 0B:8DD3: 0D        .byte $0D   ; <す>
- D - I - - 0x016DE4 0B:8DD4: 12        .byte $12   ; <つ>
- D - I - - 0x016DE5 0B:8DD5: 12        .byte $12   ; <つ>
- D - I - - 0x016DE6 0B:8DD6: 12        .byte $12   ; <つ>
- D - I - - 0x016DE7 0B:8DD7: 12        .byte $12   ; <つ>
- D - I - - 0x016DE8 0B:8DD8: 12        .byte $12   ; <つ>
- D - I - - 0x016DE9 0B:8DD9: 12        .byte $12   ; <つ>
- D - I - - 0x016DEA 0B:8DDA: 12        .byte $12   ; <つ>
- D - I - - 0x016DEB 0B:8DDB: 12        .byte $12   ; <つ>
- D - I - - 0x016DEC 0B:8DDC: 13        .byte $13   ; <て>
- D - I - - 0x016DED 0B:8DDD: 13        .byte $13   ; <て>
- D - I - - 0x016DEE 0B:8DDE: 13        .byte $13   ; <て>
- D - I - - 0x016DEF 0B:8DDF: 13        .byte $13   ; <て>
- D - I - - 0x016DF0 0B:8DE0: 13        .byte $13   ; <て>
- D - I - - 0x016DF1 0B:8DE1: 13        .byte $13   ; <て>
- D - I - - 0x016DF2 0B:8DE2: 13        .byte $13   ; <て>
- D - I - - 0x016DF3 0B:8DE3: 13        .byte $13   ; <て>
- D - I - - 0x016DF4 0B:8DE4: 85        .byte $85   ; <E>
- D - I - - 0x016DF5 0B:8DE5: 86        .byte $86   ; <F>
- D - I - - 0x016DF6 0B:8DE6: 85        .byte $85   ; <E>
- D - I - - 0x016DF7 0B:8DE7: 85        .byte $85   ; <E>
- D - I - - 0x016DF8 0B:8DE8: 85        .byte $85   ; <E>
- D - I - - 0x016DF9 0B:8DE9: 86        .byte $86   ; <F>
- D - I - - 0x016DFA 0B:8DEA: 85        .byte $85   ; <E>
- D - I - - 0x016DFB 0B:8DEB: 85        .byte $85   ; <E>
- D - I - - 0x016DFC 0B:8DEC: 34        .byte $34   ; <1>
- D - I - - 0x016DFD 0B:8DED: 35        .byte $35   ; <2>
- D - I - - 0x016DFE 0B:8DEE: 56        .byte $56   ; <ニ>
- D - I - - 0x016DFF 0B:8DEF: 56        .byte $56   ; <ニ>
- D - I - - 0x016E00 0B:8DF0: 56        .byte $56   ; <ニ>
- D - I - - 0x016E01 0B:8DF1: 45        .byte $45   ; <オ>
- D - I - - 0x016E02 0B:8DF2: 46        .byte $46   ; <カ>
- D - I - - 0x016E03 0B:8DF3: 56        .byte $56   ; <ニ>
- D - I - - 0x016E04 0B:8DF4: 39        .byte $39   ; <6>
- D - I - - 0x016E05 0B:8DF5: 3A        .byte $3A   ; <7>
- D - I - - 0x016E06 0B:8DF6: 37        .byte $37   ; <4>
- D - I - - 0x016E07 0B:8DF7: 38        .byte $38   ; <5>
- D - I - - 0x016E08 0B:8DF8: 55        .byte $55   ; <ナ>
- D - I - - 0x016E09 0B:8DF9: 55        .byte $55   ; <ナ>
- D - I - - 0x016E0A 0B:8DFA: 8F        .byte $8F   ; <S>
- D - I - - 0x016E0B 0B:8DFB: 55        .byte $55   ; <ナ>
- D - I - - 0x016E0C 0B:8DFC: 3B        .byte $3B   ; <8>
- D - I - - 0x016E0D 0B:8DFD: 3C        .byte $3C   ; <9>
- D - I - - 0x016E0E 0B:8DFE: 3D        .byte $3D   ; <+>
- D - I - - 0x016E0F 0B:8DFF: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016E10 0B:8E00: 56        .byte $56   ; <ニ>
- D - I - - 0x016E11 0B:8E01: 56        .byte $56   ; <ニ>
- D - I - - 0x016E12 0B:8E02: 92        .byte $92   ; <W>
- D - I - - 0x016E13 0B:8E03: 87        .byte $87   ; <G>
- D - I - - 0x016E14 0B:8E04: C5        .byte $C5   ; <ブ>
- D - I - - 0x016E15 0B:8E05: C6        .byte $C6   ; <ベ>
- D - I - - 0x016E16 0B:8E06: C7        .byte $C7   ; <ボ>
- D - I - - 0x016E17 0B:8E07: C8        .byte $C8   ; <ぱ>
- D - I - - 0x016E18 0B:8E08: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E19 0B:8E09: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E1A 0B:8E0A: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E1B 0B:8E0B: CA        .byte $CA   ; <ぷ>
- D - I - - 0x016E1C 0B:8E0C: CB        .byte $CB   ; <ぺ>
- D - I - - 0x016E1D 0B:8E0D: CC        .byte $CC   ; <ぽ>
- D - I - - 0x016E1E 0B:8E0E: CD        .byte $CD   ; <パ>
- D - I - - 0x016E1F 0B:8E0F: CE        .byte $CE   ; <ピ>
- D - I - - 0x016E20 0B:8E10: CF        .byte $CF   ; <プ>
- D - I - - 0x016E21 0B:8E11: CF        .byte $CF   ; <プ>
- D - I - - 0x016E22 0B:8E12: CF        .byte $CF   ; <プ>
- D - I - - 0x016E23 0B:8E13: CF        .byte $CF   ; <プ>
- D - I - - 0x016E24 0B:8E14: D0        .byte $D0   ; <ペ>
- D - I - - 0x016E25 0B:8E15: D1        .byte $D1   ; <ポ>
- D - I - - 0x016E26 0B:8E16: D2        .byte $D2
- D - I - - 0x016E27 0B:8E17: D3        .byte $D3
- D - I - - 0x016E28 0B:8E18: D4        .byte $D4
- D - I - - 0x016E29 0B:8E19: D5        .byte $D5
- D - I - - 0x016E2A 0B:8E1A: D6        .byte $D6
- D - I - - 0x016E2B 0B:8E1B: D7        .byte $D7
- D - I - - 0x016E2C 0B:8E1C: F4        .byte $F4
- D - I - - 0x016E2D 0B:8E1D: D8        .byte $D8
- D - I - - 0x016E2E 0B:8E1E: 13        .byte $13   ; <て>
- D - I - - 0x016E2F 0B:8E1F: 13        .byte $13   ; <て>
- D - I - - 0x016E30 0B:8E20: 13        .byte $13   ; <て>
- D - I - - 0x016E31 0B:8E21: 13        .byte $13   ; <て>
- D - I - - 0x016E32 0B:8E22: 13        .byte $13   ; <て>
- D - I - - 0x016E33 0B:8E23: 13        .byte $13   ; <て>
- D - I - - 0x016E34 0B:8E24: 85        .byte $85   ; <E>
- D - I - - 0x016E35 0B:8E25: 85        .byte $85   ; <E>
- D - I - - 0x016E36 0B:8E26: 99        .byte $99
- D - I - - 0x016E37 0B:8E27: 85        .byte $85   ; <E>
- D - I - - 0x016E38 0B:8E28: 85        .byte $85   ; <E>
- D - I - - 0x016E39 0B:8E29: 85        .byte $85   ; <E>
- D - I - - 0x016E3A 0B:8E2A: 99        .byte $99
- D - I - - 0x016E3B 0B:8E2B: 85        .byte $85   ; <E>
- D - I - - 0x016E3C 0B:8E2C: 56        .byte $56   ; <ニ>
- D - I - - 0x016E3D 0B:8E2D: 56        .byte $56   ; <ニ>
- D - I - - 0x016E3E 0B:8E2E: 71        .byte $71   ; <ュ>
- D - I - - 0x016E3F 0B:8E2F: 72        .byte $72   ; <ョ>
- D - I - - 0x016E40 0B:8E30: 56        .byte $56   ; <ニ>
- D - I - - 0x016E41 0B:8E31: 56        .byte $56   ; <ニ>
- D - I - - 0x016E42 0B:8E32: 67        .byte $67   ; <ラ>
- D - I - - 0x016E43 0B:8E33: 68        .byte $68   ; <リ>
- D - I - - 0x016E44 0B:8E34: 55        .byte $55   ; <ナ>
- D - I - - 0x016E45 0B:8E35: 55        .byte $55   ; <ナ>
- D - I - - 0x016E46 0B:8E36: F2        .byte $F2
- D - I - - 0x016E47 0B:8E37: 55        .byte $55   ; <ナ>
- D - I - - 0x016E48 0B:8E38: 63        .byte $63   ; <モ>
- D - I - - 0x016E49 0B:8E39: 64        .byte $64   ; <ヤ>
- D - I - - 0x016E4A 0B:8E3A: 65        .byte $65   ; <ユ>
- D - I - - 0x016E4B 0B:8E3B: 66        .byte $66   ; <ヨ>
- D - I - - 0x016E4C 0B:8E3C: 9C        .byte $9C
- D - I - - 0x016E4D 0B:8E3D: A1        .byte $A1   ; <ぎ>
- D - I - - 0x016E4E 0B:8E3E: 56        .byte $56   ; <ニ>
- D - I - - 0x016E4F 0B:8E3F: 56        .byte $56   ; <ニ>
- D - I - - 0x016E50 0B:8E40: 5F        .byte $5F   ; <マ>
- D - I - - 0x016E51 0B:8E41: 60        .byte $60   ; <ミ>
- D - I - - 0x016E52 0B:8E42: 61        .byte $61   ; <ム>
- D - I - - 0x016E53 0B:8E43: 62        .byte $62   ; <メ>
- D - I - - 0x016E54 0B:8E44: D9        .byte $D9
- D - I - - 0x016E55 0B:8E45: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E56 0B:8E46: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E57 0B:8E47: C9        .byte $C9   ; <ぴ>
- D - I - - 0x016E58 0B:8E48: DA        .byte $DA
- D - I - - 0x016E59 0B:8E49: DB        .byte $DB
- D - I - - 0x016E5A 0B:8E4A: DC        .byte $DC
- D - I - - 0x016E5B 0B:8E4B: DD        .byte $DD
- D - I - - 0x016E5C 0B:8E4C: CF        .byte $CF   ; <プ>
- D - I - - 0x016E5D 0B:8E4D: CF        .byte $CF   ; <プ>
- D - I - - 0x016E5E 0B:8E4E: CF        .byte $CF   ; <プ>
- D - I - - 0x016E5F 0B:8E4F: CF        .byte $CF   ; <プ>
- D - I - - 0x016E60 0B:8E50: DE        .byte $DE
- D - I - - 0x016E61 0B:8E51: DF        .byte $DF
- D - I - - 0x016E62 0B:8E52: E0        .byte $E0
- D - I - - 0x016E63 0B:8E53: E1        .byte $E1
- D - I - - 0x016E64 0B:8E54: E3        .byte $E3
- D - I - - 0x016E65 0B:8E55: E4        .byte $E4
- D - I - - 0x016E66 0B:8E56: E5        .byte $E5
- D - I - - 0x016E67 0B:8E57: E6        .byte $E6
- D - I - - 0x016E68 0B:8E58: E7        .byte $E7
- D - I - - 0x016E69 0B:8E59: E8        .byte $E8
- D - I - - 0x016E6A 0B:8E5A: E9        .byte $E9
- D - I - - 0x016E6B 0B:8E5B: EA        .byte $EA
- D - I - - 0x016E6C 0B:8E5C: 13        .byte $13   ; <て>
- D - I - - 0x016E6D 0B:8E5D: 13        .byte $13   ; <て>
- D - I - - 0x016E6E 0B:8E5E: 13        .byte $13   ; <て>
- D - I - - 0x016E6F 0B:8E5F: 13        .byte $13   ; <て>
- D - I - - 0x016E70 0B:8E60: 13        .byte $13   ; <て>
- D - I - - 0x016E71 0B:8E61: 13        .byte $13   ; <て>
- D - I - - 0x016E72 0B:8E62: E2        .byte $E2
- D - I - - 0x016E73 0B:8E63: FF        .byte $FF
- - - - - - 0x016E74 0B:8E64: 86        .byte $86   ; <F>
- - - - - - 0x016E75 0B:8E65: 85        .byte $85   ; <E>
- - - - - - 0x016E76 0B:8E66: 85        .byte $85   ; <E>
- - - - - - 0x016E77 0B:8E67: 86        .byte $86   ; <F>
- - - - - - 0x016E78 0B:8E68: 85        .byte $85   ; <E>
- - - - - - 0x016E79 0B:8E69: 85        .byte $85   ; <E>
- - - - - - 0x016E7A 0B:8E6A: 86        .byte $86   ; <F>
- - - - - - 0x016E7B 0B:8E6B: 85        .byte $85   ; <E>
- - - - - - 0x016E7C 0B:8E6C: 87        .byte $87   ; <G>
- - - - - - 0x016E7D 0B:8E6D: 56        .byte $56   ; <ニ>
- - - - - - 0x016E7E 0B:8E6E: 56        .byte $56   ; <ニ>
- - - - - - 0x016E7F 0B:8E6F: 88        .byte $88   ; <H>
- - - - - - 0x016E80 0B:8E70: 89        .byte $89   ; <I>
- - - - - - 0x016E81 0B:8E71: 56        .byte $56   ; <ニ>
- - - - - - 0x016E82 0B:8E72: 56        .byte $56   ; <ニ>
- - - - - - 0x016E83 0B:8E73: 45        .byte $45   ; <オ>
- - - - - - 0x016E84 0B:8E74: 8A        .byte $8A   ; <N>
- - - - - - 0x016E85 0B:8E75: 8A        .byte $8A   ; <N>
- - - - - - 0x016E86 0B:8E76: 8A        .byte $8A   ; <N>
- - - - - - 0x016E87 0B:8E77: 8B        .byte $8B   ; <K>
- - - - - - 0x016E88 0B:8E78: 8E        .byte $8E   ; <L>
- - - - - - 0x016E89 0B:8E79: B2        .byte $B2   ; <べ>
- - - - - - 0x016E8A 0B:8E7A: 36        .byte $36   ; <3>
- - - - - - 0x016E8B 0B:8E7B: 36        .byte $36   ; <3>
- - - - - - 0x016E8C 0B:8E7C: 8C        .byte $8C   ; <M>
- - - - - - 0x016E8D 0B:8E7D: 8C        .byte $8C   ; <M>
- - - - - - 0x016E8E 0B:8E7E: 8C        .byte $8C   ; <M>
- - - - - - 0x016E8F 0B:8E7F: 8D        .byte $8D   ; <P>
- - - - - - 0x016E90 0B:8E80: 44        .byte $44   ; <エ>
- - - - - - 0x016E91 0B:8E81: 47        .byte $47   ; <キ>
- - - - - - 0x016E92 0B:8E82: 44        .byte $44   ; <エ>
- - - - - - 0x016E93 0B:8E83: 44        .byte $44   ; <エ>
- - - - - - 0x016E94 0B:8E84: 85        .byte $85   ; <E>
- - - - - - 0x016E95 0B:8E85: 99        .byte $99
- - - - - - 0x016E96 0B:8E86: 85        .byte $85   ; <E>
- - - - - - 0x016E97 0B:8E87: 85        .byte $85   ; <E>
- - - - - - 0x016E98 0B:8E88: 99        .byte $99
- - - - - - 0x016E99 0B:8E89: 85        .byte $85   ; <E>
- - - - - - 0x016E9A 0B:8E8A: 85        .byte $85   ; <E>
- - - - - - 0x016E9B 0B:8E8B: 99        .byte $99
- - - - - - 0x016E9C 0B:8E8C: 72        .byte $72   ; <ョ>
- - - - - - 0x016E9D 0B:8E8D: 56        .byte $56   ; <ニ>
- - - - - - 0x016E9E 0B:8E8E: 56        .byte $56   ; <ニ>
- - - - - - 0x016E9F 0B:8E8F: 9A        .byte $9A
- - - - - - 0x016EA0 0B:8E90: 9B        .byte $9B
- - - - - - 0x016EA1 0B:8E91: 56        .byte $56   ; <ニ>
- - - - - - 0x016EA2 0B:8E92: 56        .byte $56   ; <ニ>
- - - - - - 0x016EA3 0B:8E93: 9C        .byte $9C
- - - - - - 0x016EA4 0B:8E94: 36        .byte $36   ; <3>
- - - - - - 0x016EA5 0B:8E95: 36        .byte $36   ; <3>
- - - - - - 0x016EA6 0B:8E96: A0        .byte $A0   ; <が>
- - - - - - 0x016EA7 0B:8E97: 9F        .byte $9F
- - - - - - 0x016EA8 0B:8E98: 9D        .byte $9D
- - - - - - 0x016EA9 0B:8E99: 8A        .byte $8A   ; <N>
- - - - - - 0x016EAA 0B:8E9A: 8A        .byte $8A   ; <N>
- - - - - - 0x016EAB 0B:8E9B: 8A        .byte $8A   ; <N>
- - - - - - 0x016EAC 0B:8E9C: 44        .byte $44   ; <エ>
- - - - - - 0x016EAD 0B:8E9D: 44        .byte $44   ; <エ>
- - - - - - 0x016EAE 0B:8E9E: 73        .byte $73   ; <ヮ>
- - - - - - 0x016EAF 0B:8E9F: 44        .byte $44   ; <エ>
- - - - - - 0x016EB0 0B:8EA0: 9E        .byte $9E
- - - - - - 0x016EB1 0B:8EA1: 8C        .byte $8C   ; <M>
- - - - - - 0x016EB2 0B:8EA2: 8C        .byte $8C   ; <M>
- - - - - - 0x016EB3 0B:8EA3: 8C        .byte $8C   ; <M>
- D - I - - 0x016EB4 0B:8EA4: 55        .byte $55   ; <ナ>
- D - I - - 0x016EB5 0B:8EA5: F1        .byte $F1
- D - I - - 0x016EB6 0B:8EA6: 55        .byte $55   ; <ナ>
- D - I - - 0x016EB7 0B:8EA7: 90        .byte $90   ; <U>
- D - I - - 0x016EB8 0B:8EA8: 91        .byte $91   ; <V>
- D - I - - 0x016EB9 0B:8EA9: 55        .byte $55   ; <ナ>
- D - I - - 0x016EBA 0B:8EAA: 55        .byte $55   ; <ナ>
- D - I - - 0x016EBB 0B:8EAB: F1        .byte $F1
- D - I - - 0x016EBC 0B:8EAC: 93        .byte $93   ; <Y>
- D - I - - 0x016EBD 0B:8EAD: 93        .byte $93   ; <Y>
- D - I - - 0x016EBE 0B:8EAE: 93        .byte $93   ; <Y>
- D - I - - 0x016EBF 0B:8EAF: 94        .byte $94
- D - I - - 0x016EC0 0B:8EB0: 92        .byte $92   ; <W>
- D - I - - 0x016EC1 0B:8EB1: 87        .byte $87   ; <G>
- D - I - - 0x016EC2 0B:8EB2: 56        .byte $56   ; <ニ>
- D - I - - 0x016EC3 0B:8EB3: 56        .byte $56   ; <ニ>
- D - I - - 0x016EC4 0B:8EB4: 95        .byte $95
- D - I - - 0x016EC5 0B:8EB5: 95        .byte $95
- D - I - - 0x016EC6 0B:8EB6: 95        .byte $95
- D - I - - 0x016EC7 0B:8EB7: 96        .byte $96
- D - I - - 0x016EC8 0B:8EB8: 97        .byte $97
- D - I - - 0x016EC9 0B:8EB9: 97        .byte $97
- D - I - - 0x016ECA 0B:8EBA: 97        .byte $97
- D - I - - 0x016ECB 0B:8EBB: 97        .byte $97
- D - I - - 0x016ECC 0B:8EBC: 13        .byte $13   ; <て>
- D - I - - 0x016ECD 0B:8EBD: 13        .byte $13   ; <て>
- D - I - - 0x016ECE 0B:8EBE: 13        .byte $13   ; <て>
- D - I - - 0x016ECF 0B:8EBF: 13        .byte $13   ; <て>
- D - I - - 0x016ED0 0B:8EC0: 13        .byte $13   ; <て>
- D - I - - 0x016ED1 0B:8EC1: 13        .byte $13   ; <て>
- D - I - - 0x016ED2 0B:8EC2: 13        .byte $13   ; <て>
- D - I - - 0x016ED3 0B:8EC3: 13        .byte $13   ; <て>
- D - I - - 0x016ED4 0B:8EC4: F2        .byte $F2
- D - I - - 0x016ED5 0B:8EC5: 55        .byte $55   ; <ナ>
- D - I - - 0x016ED6 0B:8EC6: 55        .byte $55   ; <ナ>
- D - I - - 0x016ED7 0B:8EC7: BD        .byte $BD   ; <ゾ>
- D - I - - 0x016ED8 0B:8EC8: BE        .byte $BE   ; <ダ>
- D - I - - 0x016ED9 0B:8EC9: 55        .byte $55   ; <ナ>
- D - I - - 0x016EDA 0B:8ECA: F2        .byte $F2
- D - I - - 0x016EDB 0B:8ECB: 55        .byte $55   ; <ナ>
- D - I - - 0x016EDC 0B:8ECC: 56        .byte $56   ; <ニ>
- D - I - - 0x016EDD 0B:8ECD: 56        .byte $56   ; <ニ>
- D - I - - 0x016EDE 0B:8ECE: 9C        .byte $9C
- D - I - - 0x016EDF 0B:8ECF: A1        .byte $A1   ; <ぎ>
- D - I - - 0x016EE0 0B:8ED0: A4        .byte $A4   ; <ご>
- D - I - - 0x016EE1 0B:8ED1: 93        .byte $93   ; <Y>
- D - I - - 0x016EE2 0B:8ED2: 93        .byte $93   ; <Y>
- D - I - - 0x016EE3 0B:8ED3: 93        .byte $93   ; <Y>
- D - I - - 0x016EE4 0B:8ED4: 97        .byte $97
- D - I - - 0x016EE5 0B:8ED5: 97        .byte $97
- D - I - - 0x016EE6 0B:8ED6: 97        .byte $97
- D - I - - 0x016EE7 0B:8ED7: 97        .byte $97
- D - I - - 0x016EE8 0B:8ED8: A5        .byte $A5   ; <ざ>
- D - I - - 0x016EE9 0B:8ED9: 95        .byte $95
- D - I - - 0x016EEA 0B:8EDA: 95        .byte $95
- D - I - - 0x016EEB 0B:8EDB: 95        .byte $95
- D - I - - 0x016EEC 0B:8EDC: 13        .byte $13   ; <て>
- D - I - - 0x016EED 0B:8EDD: 13        .byte $13   ; <て>
- D - I - - 0x016EEE 0B:8EDE: 13        .byte $13   ; <て>
- D - I - - 0x016EEF 0B:8EDF: 13        .byte $13   ; <て>
- D - I - - 0x016EF0 0B:8EE0: 13        .byte $13   ; <て>
- D - I - - 0x016EF1 0B:8EE1: 13        .byte $13   ; <て>
- D - I - - 0x016EF2 0B:8EE2: 13        .byte $13   ; <て>
- D - I - - 0x016EF3 0B:8EE3: 13        .byte $13   ; <て>
- D - I - - 0x016EF4 0B:8EE4: C3        .byte $C3   ; <バ>
- D - I - - 0x016EF5 0B:8EE5: C3        .byte $C3   ; <バ>
- D - I - - 0x016EF6 0B:8EE6: C3        .byte $C3   ; <バ>
- D - I - - 0x016EF7 0B:8EE7: C3        .byte $C3   ; <バ>
- D - I - - 0x016EF8 0B:8EE8: C3        .byte $C3   ; <バ>
- D - I - - 0x016EF9 0B:8EE9: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFA 0B:8EEA: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFB 0B:8EEB: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFC 0B:8EEC: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFD 0B:8EED: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFE 0B:8EEE: C3        .byte $C3   ; <バ>
- D - I - - 0x016EFF 0B:8EEF: C3        .byte $C3   ; <バ>
- D - I - - 0x016F00 0B:8EF0: C3        .byte $C3   ; <バ>
- D - I - - 0x016F01 0B:8EF1: C3        .byte $C3   ; <バ>
- D - I - - 0x016F02 0B:8EF2: C3        .byte $C3   ; <バ>
- D - I - - 0x016F03 0B:8EF3: C3        .byte $C3   ; <バ>
- D - I - - 0x016F04 0B:8EF4: 86        .byte $86   ; <F>
- D - I - - 0x016F05 0B:8EF5: 85        .byte $85   ; <E>
- D - I - - 0x016F06 0B:8EF6: 85        .byte $85   ; <E>
- D - I - - 0x016F07 0B:8EF7: 86        .byte $86   ; <F>
- D - I - - 0x016F08 0B:8EF8: 85        .byte $85   ; <E>
- D - I - - 0x016F09 0B:8EF9: 85        .byte $85   ; <E>
- D - I - - 0x016F0A 0B:8EFA: 86        .byte $86   ; <F>
- D - I - - 0x016F0B 0B:8EFB: 85        .byte $85   ; <E>
- D - I - - 0x016F0C 0B:8EFC: 92        .byte $92   ; <W>
- D - I - - 0x016F0D 0B:8EFD: 87        .byte $87   ; <G>
- D - I - - 0x016F0E 0B:8EFE: 56        .byte $56   ; <ニ>
- D - I - - 0x016F0F 0B:8EFF: 88        .byte $88   ; <H>
- D - I - - 0x016F10 0B:8F00: 89        .byte $89   ; <I>
- D - I - - 0x016F11 0B:8F01: 56        .byte $56   ; <ニ>
- D - I - - 0x016F12 0B:8F02: 92        .byte $92   ; <W>
- D - I - - 0x016F13 0B:8F03: 87        .byte $87   ; <G>
- D - I - - 0x016F14 0B:8F04: C3        .byte $C3   ; <バ>
- D - I - - 0x016F15 0B:8F05: C3        .byte $C3   ; <バ>
- D - I - - 0x016F16 0B:8F06: C3        .byte $C3   ; <バ>
- D - I - - 0x016F17 0B:8F07: C3        .byte $C3   ; <バ>
- D - I - - 0x016F18 0B:8F08: C3        .byte $C3   ; <バ>
- D - I - - 0x016F19 0B:8F09: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1A 0B:8F0A: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1B 0B:8F0B: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1C 0B:8F0C: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1D 0B:8F0D: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1E 0B:8F0E: C3        .byte $C3   ; <バ>
- D - I - - 0x016F1F 0B:8F0F: C3        .byte $C3   ; <バ>
- D - I - - 0x016F20 0B:8F10: C3        .byte $C3   ; <バ>
- D - I - - 0x016F21 0B:8F11: C3        .byte $C3   ; <バ>
- D - I - - 0x016F22 0B:8F12: C3        .byte $C3   ; <バ>
- D - I - - 0x016F23 0B:8F13: C3        .byte $C3   ; <バ>
- D - I - - 0x016F24 0B:8F14: 85        .byte $85   ; <E>
- D - I - - 0x016F25 0B:8F15: 99        .byte $99
- D - I - - 0x016F26 0B:8F16: 85        .byte $85   ; <E>
- D - I - - 0x016F27 0B:8F17: 85        .byte $85   ; <E>
- D - I - - 0x016F28 0B:8F18: 99        .byte $99
- D - I - - 0x016F29 0B:8F19: 85        .byte $85   ; <E>
- D - I - - 0x016F2A 0B:8F1A: 85        .byte $85   ; <E>
- D - I - - 0x016F2B 0B:8F1B: 99        .byte $99
- D - I - - 0x016F2C 0B:8F1C: 9C        .byte $9C
- D - I - - 0x016F2D 0B:8F1D: A1        .byte $A1   ; <ぎ>
- D - I - - 0x016F2E 0B:8F1E: 56        .byte $56   ; <ニ>
- D - I - - 0x016F2F 0B:8F1F: 9A        .byte $9A
- D - I - - 0x016F30 0B:8F20: 9B        .byte $9B
- D - I - - 0x016F31 0B:8F21: 56        .byte $56   ; <ニ>
- D - I - - 0x016F32 0B:8F22: 9C        .byte $9C
- D - I - - 0x016F33 0B:8F23: A1        .byte $A1   ; <ぎ>
- D - I - - 0x016F34 0B:8F24: AD        .byte $AD   ; <で>
- D - I - - 0x016F35 0B:8F25: AE        .byte $AE   ; <ど>
- D - I - - 0x016F36 0B:8F26: 8E        .byte $8E   ; <L>
- D - I - - 0x016F37 0B:8F27: B2        .byte $B2   ; <べ>
- D - I - - 0x016F38 0B:8F28: 36        .byte $36   ; <3>
- D - I - - 0x016F39 0B:8F29: 36        .byte $36   ; <3>
- D - I - - 0x016F3A 0B:8F2A: 36        .byte $36   ; <3>
- D - I - - 0x016F3B 0B:8F2B: A8        .byte $A8   ; <ぜ>
- D - I - - 0x016F3C 0B:8F2C: B1        .byte $B1   ; <ぶ>
- D - I - - 0x016F3D 0B:8F2D: B3        .byte $B3   ; <ぼ>
- D - I - - 0x016F3E 0B:8F2E: 55        .byte $55   ; <ナ>
- D - I - - 0x016F3F 0B:8F2F: F1        .byte $F1
- D - I - - 0x016F40 0B:8F30: 55        .byte $55   ; <ナ>
- D - I - - 0x016F41 0B:8F31: 55        .byte $55   ; <ナ>
- D - I - - 0x016F42 0B:8F32: 55        .byte $55   ; <ナ>
- D - I - - 0x016F43 0B:8F33: A9        .byte $A9   ; <ぞ>
- D - I - - 0x016F44 0B:8F34: B5        .byte $B5   ; <ギ>
- D - I - - 0x016F45 0B:8F35: B6        .byte $B6   ; <グ>
- D - I - - 0x016F46 0B:8F36: AF        .byte $AF   ; <ば>
- D - I - - 0x016F47 0B:8F37: AF        .byte $AF   ; <ば>
- D - I - - 0x016F48 0B:8F38: AF        .byte $AF   ; <ば>
- D - I - - 0x016F49 0B:8F39: AF        .byte $AF   ; <ば>
- D - I - - 0x016F4A 0B:8F3A: AF        .byte $AF   ; <ば>
- D - I - - 0x016F4B 0B:8F3B: AF        .byte $AF   ; <ば>
- D - I - - 0x016F4C 0B:8F3C: 13        .byte $13   ; <て>
- D - I - - 0x016F4D 0B:8F3D: 13        .byte $13   ; <て>
- D - I - - 0x016F4E 0B:8F3E: 13        .byte $13   ; <て>
- D - I - - 0x016F4F 0B:8F3F: 13        .byte $13   ; <て>
- D - I - - 0x016F50 0B:8F40: 13        .byte $13   ; <て>
- D - I - - 0x016F51 0B:8F41: 13        .byte $13   ; <て>
- D - I - - 0x016F52 0B:8F42: 13        .byte $13   ; <て>
- D - I - - 0x016F53 0B:8F43: 13        .byte $13   ; <て>
- D - I - - 0x016F54 0B:8F44: AA        .byte $AA   ; <だ>
- D - I - - 0x016F55 0B:8F45: 36        .byte $36   ; <3>
- D - I - - 0x016F56 0B:8F46: 36        .byte $36   ; <3>
- D - I - - 0x016F57 0B:8F47: 36        .byte $36   ; <3>
- D - I - - 0x016F58 0B:8F48: A0        .byte $A0   ; <が>
- D - I - - 0x016F59 0B:8F49: 9F        .byte $9F
- D - I - - 0x016F5A 0B:8F4A: AC        .byte $AC   ; <づ>
- D - I - - 0x016F5B 0B:8F4B: AD        .byte $AD   ; <で>
- D - I - - 0x016F5C 0B:8F4C: AB        .byte $AB   ; <ぢ>
- D - I - - 0x016F5D 0B:8F4D: 55        .byte $55   ; <ナ>
- D - I - - 0x016F5E 0B:8F4E: 55        .byte $55   ; <ナ>
- D - I - - 0x016F5F 0B:8F4F: 55        .byte $55   ; <ナ>
- D - I - - 0x016F60 0B:8F50: A3        .byte $A3   ; <げ>
- D - I - - 0x016F61 0B:8F51: 55        .byte $55   ; <ナ>
- D - I - - 0x016F62 0B:8F52: B0        .byte $B0   ; <び>
- D - I - - 0x016F63 0B:8F53: B1        .byte $B1   ; <ぶ>
- D - I - - 0x016F64 0B:8F54: AF        .byte $AF   ; <ば>
- D - I - - 0x016F65 0B:8F55: AF        .byte $AF   ; <ば>
- D - I - - 0x016F66 0B:8F56: AF        .byte $AF   ; <ば>
- D - I - - 0x016F67 0B:8F57: AF        .byte $AF   ; <ば>
- D - I - - 0x016F68 0B:8F58: AF        .byte $AF   ; <ば>
- D - I - - 0x016F69 0B:8F59: AF        .byte $AF   ; <ば>
- D - I - - 0x016F6A 0B:8F5A: B4        .byte $B4   ; <ガ>
- D - I - - 0x016F6B 0B:8F5B: B5        .byte $B5   ; <ギ>
- D - I - - 0x016F6C 0B:8F5C: 13        .byte $13   ; <て>
- D - I - - 0x016F6D 0B:8F5D: 13        .byte $13   ; <て>
- D - I - - 0x016F6E 0B:8F5E: 13        .byte $13   ; <て>
- D - I - - 0x016F6F 0B:8F5F: 13        .byte $13   ; <て>
- D - I - - 0x016F70 0B:8F60: 13        .byte $13   ; <て>
- D - I - - 0x016F71 0B:8F61: 13        .byte $13   ; <て>
- D - I - - 0x016F72 0B:8F62: 13        .byte $13   ; <て>
- D - I - - 0x016F73 0B:8F63: 13        .byte $13   ; <て>
- D - I - - 0x016F74 0B:8F64: 0D        .byte $0D   ; <す>
- D - I - - 0x016F75 0B:8F65: 0E        .byte $0E   ; <せ>
- D - I - - 0x016F76 0B:8F66: 0F        .byte $0F   ; <そ>
- D - I - - 0x016F77 0B:8F67: 15        .byte $15   ; <な>
- D - I - - 0x016F78 0B:8F68: 16        .byte $16   ; <に>
- D - I - - 0x016F79 0B:8F69: 15        .byte $15   ; <な>
- D - I - - 0x016F7A 0B:8F6A: 15        .byte $15   ; <な>
- D - I - - 0x016F7B 0B:8F6B: 17        .byte $17   ; <ぬ>
- D - I - - 0x016F7C 0B:8F6C: 1D        .byte $1D   ; <へ>
- D - I - - 0x016F7D 0B:8F6D: 1E        .byte $1E   ; <ほ>
- D - I - - 0x016F7E 0B:8F6E: 15        .byte $15   ; <な>
- D - I - - 0x016F7F 0B:8F6F: 18        .byte $18   ; <ね>
- D - I - - 0x016F80 0B:8F70: 15        .byte $15   ; <な>
- D - I - - 0x016F81 0B:8F71: 1A        .byte $1A   ; <は>
- D - I - - 0x016F82 0B:8F72: 18        .byte $18   ; <ね>
- D - I - - 0x016F83 0B:8F73: 15        .byte $15   ; <な>
- D - I - - 0x016F84 0B:8F74: 1F        .byte $1F   ; <ま>
- D - I - - 0x016F85 0B:8F75: 10        .byte $10   ; <た>
- D - I - - 0x016F86 0B:8F76: 1B        .byte $1B   ; <ひ>
- D - I - - 0x016F87 0B:8F77: 10        .byte $10   ; <た>
- D - I - - 0x016F88 0B:8F78: 10        .byte $10   ; <た>
- D - I - - 0x016F89 0B:8F79: 10        .byte $10   ; <た>
- D - I - - 0x016F8A 0B:8F7A: 10        .byte $10   ; <た>
- D - I - - 0x016F8B 0B:8F7B: 10        .byte $10   ; <た>
- D - I - - 0x016F8C 0B:8F7C: 20        .byte $20   ; <み>
- D - I - - 0x016F8D 0B:8F7D: 12        .byte $12   ; <つ>
- D - I - - 0x016F8E 0B:8F7E: 11        .byte $11   ; <ち>
- D - I - - 0x016F8F 0B:8F7F: 12        .byte $12   ; <つ>
- D - I - - 0x016F90 0B:8F80: 11        .byte $11   ; <ち>
- D - I - - 0x016F91 0B:8F81: 12        .byte $12   ; <つ>
- D - I - - 0x016F92 0B:8F82: 11        .byte $11   ; <ち>
- D - I - - 0x016F93 0B:8F83: 12        .byte $12   ; <つ>
- D - I - - 0x016F94 0B:8F84: 17        .byte $17   ; <ぬ>
- D - I - - 0x016F95 0B:8F85: 15        .byte $15   ; <な>
- D - I - - 0x016F96 0B:8F86: 15        .byte $15   ; <な>
- D - I - - 0x016F97 0B:8F87: 15        .byte $15   ; <な>
- D - I - - 0x016F98 0B:8F88: 15        .byte $15   ; <な>
- D - I - - 0x016F99 0B:8F89: 06        .byte $06   ; <か>
- D - I - - 0x016F9A 0B:8F8A: 07        .byte $07   ; <き>
- D - I - - 0x016F9B 0B:8F8B: 08        .byte $08   ; <く>
- D - I - - 0x016F9C 0B:8F8C: 15        .byte $15   ; <な>
- D - I - - 0x016F9D 0B:8F8D: 16        .byte $16   ; <に>
- D - I - - 0x016F9E 0B:8F8E: 15        .byte $15   ; <な>
- D - I - - 0x016F9F 0B:8F8F: 15        .byte $15   ; <な>
- D - I - - 0x016FA0 0B:8F90: 18        .byte $18   ; <ね>
- D - I - - 0x016FA1 0B:8F91: 15        .byte $15   ; <な>
- D - I - - 0x016FA2 0B:8F92: 09        .byte $09   ; <け>
- D - I - - 0x016FA3 0B:8F93: 0A        .byte $0A   ; <こ>
- D - I - - 0x016FA4 0B:8F94: 10        .byte $10   ; <た>
- D - I - - 0x016FA5 0B:8F95: 10        .byte $10   ; <た>
- D - I - - 0x016FA6 0B:8F96: 10        .byte $10   ; <た>
- D - I - - 0x016FA7 0B:8F97: 10        .byte $10   ; <た>
- D - I - - 0x016FA8 0B:8F98: 10        .byte $10   ; <た>
- D - I - - 0x016FA9 0B:8F99: 1B        .byte $1B   ; <ひ>
- D - I - - 0x016FAA 0B:8F9A: 10        .byte $10   ; <た>
- D - I - - 0x016FAB 0B:8F9B: 0B        .byte $0B   ; <さ>
- D - I - - 0x016FAC 0B:8F9C: 11        .byte $11   ; <ち>
- D - I - - 0x016FAD 0B:8F9D: 12        .byte $12   ; <つ>
- D - I - - 0x016FAE 0B:8F9E: 11        .byte $11   ; <ち>
- D - I - - 0x016FAF 0B:8F9F: 12        .byte $12   ; <つ>
- D - I - - 0x016FB0 0B:8FA0: 11        .byte $11   ; <ち>
- D - I - - 0x016FB1 0B:8FA1: 12        .byte $12   ; <つ>
- D - I - - 0x016FB2 0B:8FA2: 11        .byte $11   ; <ち>
- D - I - - 0x016FB3 0B:8FA3: 0C        .byte $0C   ; <し>
- D - I - - 0x016FB4 0B:8FA4: D3        .byte $D3
- D - I - - 0x016FB5 0B:8FA5: D4        .byte $D4
- D - I - - 0x016FB6 0B:8FA6: D5        .byte $D5
- D - I - - 0x016FB7 0B:8FA7: 15        .byte $15   ; <な>
- D - I - - 0x016FB8 0B:8FA8: 15        .byte $15   ; <な>
- D - I - - 0x016FB9 0B:8FA9: 15        .byte $15   ; <な>
- D - I - - 0x016FBA 0B:8FAA: 15        .byte $15   ; <な>
- D - I - - 0x016FBB 0B:8FAB: 15        .byte $15   ; <な>
- D - I - - 0x016FBC 0B:8FAC: D6        .byte $D6
- D - I - - 0x016FBD 0B:8FAD: D7        .byte $D7
- D - I - - 0x016FBE 0B:8FAE: D8        .byte $D8
- D - I - - 0x016FBF 0B:8FAF: D9        .byte $D9
- D - I - - 0x016FC0 0B:8FB0: 15        .byte $15   ; <な>
- D - I - - 0x016FC1 0B:8FB1: 15        .byte $15   ; <な>
- D - I - - 0x016FC2 0B:8FB2: 15        .byte $15   ; <な>
- D - I - - 0x016FC3 0B:8FB3: F4        .byte $F4
- D - I - - 0x016FC4 0B:8FB4: DA        .byte $DA
- D - I - - 0x016FC5 0B:8FB5: DB        .byte $DB
- D - I - - 0x016FC6 0B:8FB6: DC        .byte $DC
- D - I - - 0x016FC7 0B:8FB7: DD        .byte $DD
- D - I - - 0x016FC8 0B:8FB8: 15        .byte $15   ; <な>
- D - I - - 0x016FC9 0B:8FB9: 15        .byte $15   ; <な>
- D - I - - 0x016FCA 0B:8FBA: F2        .byte $F2
- D - I - - 0x016FCB 0B:8FBB: F3        .byte $F3
- D - I - - 0x016FCC 0B:8FBC: DE        .byte $DE
- D - I - - 0x016FCD 0B:8FBD: DF        .byte $DF
- D - I - - 0x016FCE 0B:8FBE: E0        .byte $E0
- D - I - - 0x016FCF 0B:8FBF: E1        .byte $E1
- D - I - - 0x016FD0 0B:8FC0: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016FD1 0B:8FC1: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016FD2 0B:8FC2: EE        .byte $EE
- D - I - - 0x016FD3 0B:8FC3: F6        .byte $F6
- D - I - - 0x016FD4 0B:8FC4: 15        .byte $15   ; <な>
- D - I - - 0x016FD5 0B:8FC5: 15        .byte $15   ; <な>
- D - I - - 0x016FD6 0B:8FC6: 15        .byte $15   ; <な>
- D - I - - 0x016FD7 0B:8FC7: 15        .byte $15   ; <な>
- D - I - - 0x016FD8 0B:8FC8: 15        .byte $15   ; <な>
- D - I - - 0x016FD9 0B:8FC9: E3        .byte $E3
- D - I - - 0x016FDA 0B:8FCA: E4        .byte $E4
- D - I - - 0x016FDB 0B:8FCB: E5        .byte $E5
- D - I - - 0x016FDC 0B:8FCC: F1        .byte $F1
- D - I - - 0x016FDD 0B:8FCD: 15        .byte $15   ; <な>
- D - I - - 0x016FDE 0B:8FCE: 15        .byte $15   ; <な>
- D - I - - 0x016FDF 0B:8FCF: 15        .byte $15   ; <な>
- D - I - - 0x016FE0 0B:8FD0: E2        .byte $E2
- D - I - - 0x016FE1 0B:8FD1: E6        .byte $E6
- D - I - - 0x016FE2 0B:8FD2: E7        .byte $E7
- D - I - - 0x016FE3 0B:8FD3: E8        .byte $E8
- D - I - - 0x016FE4 0B:8FD4: F0        .byte $F0
- D - I - - 0x016FE5 0B:8FD5: EF        .byte $EF
- D - I - - 0x016FE6 0B:8FD6: 15        .byte $15   ; <な>
- D - I - - 0x016FE7 0B:8FD7: 15        .byte $15   ; <な>
- D - I - - 0x016FE8 0B:8FD8: E9        .byte $E9
- D - I - - 0x016FE9 0B:8FD9: EA        .byte $EA
- D - I - - 0x016FEA 0B:8FDA: EB        .byte $EB
- D - I - - 0x016FEB 0B:8FDB: EC        .byte $EC
- D - I - - 0x016FEC 0B:8FDC: F6        .byte $F6
- D - I - - 0x016FED 0B:8FDD: ED        .byte $ED
- D - I - - 0x016FEE 0B:8FDE: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016FEF 0B:8FDF: 3E        .byte $3E   ; <Jr>
- D - I - - 0x016FF0 0B:8FE0: CE        .byte $CE   ; <ピ>
- D - I - - 0x016FF1 0B:8FE1: CF        .byte $CF   ; <プ>
- D - I - - 0x016FF2 0B:8FE2: D0        .byte $D0   ; <ペ>
- D - I - - 0x016FF3 0B:8FE3: D1        .byte $D1   ; <ポ>
- D - I - - 0x016FF4 0B:8FE4: 00        .byte $00
- D - I - - 0x016FF5 0B:8FE5: 00        .byte $00
- D - I - - 0x016FF6 0B:8FE6: 00        .byte $00
- D - I - - 0x016FF7 0B:8FE7: 00        .byte $00
- D - I - - 0x016FF8 0B:8FE8: 00        .byte $00
- D - I - - 0x016FF9 0B:8FE9: 00        .byte $00
- D - I - - 0x016FFA 0B:8FEA: 00        .byte $00
- D - I - - 0x016FFB 0B:8FEB: 00        .byte $00
- D - I - - 0x016FFC 0B:8FEC: 15        .byte $15   ; <な>
- D - I - - 0x016FFD 0B:8FED: 15        .byte $15   ; <な>
- D - I - - 0x016FFE 0B:8FEE: 15        .byte $15   ; <な>
- D - I - - 0x016FFF 0B:8FEF: 15        .byte $15   ; <な>
- D - I - - 0x017000 0B:8FF0: 15        .byte $15   ; <な>
- D - I - - 0x017001 0B:8FF1: 15        .byte $15   ; <な>
- D - I - - 0x017002 0B:8FF2: 15        .byte $15   ; <な>
- D - I - - 0x017003 0B:8FF3: 15        .byte $15   ; <な>
- D - I - - 0x017004 0B:8FF4: 15        .byte $15   ; <な>
- D - I - - 0x017005 0B:8FF5: 15        .byte $15   ; <な>
- D - I - - 0x017006 0B:8FF6: 15        .byte $15   ; <な>
- D - I - - 0x017007 0B:8FF7: 15        .byte $15   ; <な>
- D - I - - 0x017008 0B:8FF8: 15        .byte $15   ; <な>
- D - I - - 0x017009 0B:8FF9: 15        .byte $15   ; <な>
- D - I - - 0x01700A 0B:8FFA: 15        .byte $15   ; <な>
- D - I - - 0x01700B 0B:8FFB: 15        .byte $15   ; <な>
- D - I - - 0x01700C 0B:8FFC: 00        .byte $00
- D - I - - 0x01700D 0B:8FFD: 00        .byte $00
- D - I - - 0x01700E 0B:8FFE: 00        .byte $00
- D - I - - 0x01700F 0B:8FFF: 00        .byte $00
- D - I - - 0x017010 0B:9000: 00        .byte $00
- D - I - - 0x017011 0B:9001: 00        .byte $00
- D - I - - 0x017012 0B:9002: 00        .byte $00
- D - I - - 0x017013 0B:9003: 00        .byte $00
- D - I - - 0x017014 0B:9004: 00        .byte $00
- D - I - - 0x017015 0B:9005: 00        .byte $00
- D - I - - 0x017016 0B:9006: 00        .byte $00
- D - I - - 0x017017 0B:9007: 00        .byte $00
- D - I - - 0x017018 0B:9008: 00        .byte $00
- D - I - - 0x017019 0B:9009: 00        .byte $00
- D - I - - 0x01701A 0B:900A: 00        .byte $00
- D - I - - 0x01701B 0B:900B: 00        .byte $00
- D - I - - 0x01701C 0B:900C: 15        .byte $15   ; <な>
- D - I - - 0x01701D 0B:900D: 15        .byte $15   ; <な>
- D - I - - 0x01701E 0B:900E: 15        .byte $15   ; <な>
- D - I - - 0x01701F 0B:900F: 15        .byte $15   ; <な>
- D - I - - 0x017020 0B:9010: 1A        .byte $1A   ; <は>
- D - I - - 0x017021 0B:9011: 15        .byte $15   ; <な>
- D - I - - 0x017022 0B:9012: 18        .byte $18   ; <ね>
- D - I - - 0x017023 0B:9013: 15        .byte $15   ; <な>
- D - I - - 0x017024 0B:9014: 15        .byte $15   ; <な>
- D - I - - 0x017025 0B:9015: 16        .byte $16   ; <に>
- D - I - - 0x017026 0B:9016: 15        .byte $15   ; <な>
- D - I - - 0x017027 0B:9017: 15        .byte $15   ; <な>
- D - I - - 0x017028 0B:9018: 15        .byte $15   ; <な>
- D - I - - 0x017029 0B:9019: 15        .byte $15   ; <な>
- D - I - - 0x01702A 0B:901A: 15        .byte $15   ; <な>
- D - I - - 0x01702B 0B:901B: 15        .byte $15   ; <な>
- D - I - - 0x01702C 0B:901C: 00        .byte $00
- D - I - - 0x01702D 0B:901D: 00        .byte $00
- D - I - - 0x01702E 0B:901E: 00        .byte $00
- D - I - - 0x01702F 0B:901F: 00        .byte $00
- D - I - - 0x017030 0B:9020: 00        .byte $00
- D - I - - 0x017031 0B:9021: 00        .byte $00
- D - I - - 0x017032 0B:9022: 00        .byte $00
- D - I - - 0x017033 0B:9023: 00        .byte $00
- D - I - - 0x017034 0B:9024: C4        .byte $C4   ; <ビ>
- D - I - - 0x017035 0B:9025: C4        .byte $C4   ; <ビ>
- D - I - - 0x017036 0B:9026: C4        .byte $C4   ; <ビ>
- D - I - - 0x017037 0B:9027: C4        .byte $C4   ; <ビ>
- D - I - - 0x017038 0B:9028: C4        .byte $C4   ; <ビ>
- D - I - - 0x017039 0B:9029: C4        .byte $C4   ; <ビ>
- D - I - - 0x01703A 0B:902A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01703B 0B:902B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01703C 0B:902C: C4        .byte $C4   ; <ビ>
- D - I - - 0x01703D 0B:902D: C4        .byte $C4   ; <ビ>
- D - I - - 0x01703E 0B:902E: D2        .byte $D2
- D - I - - 0x01703F 0B:902F: C8        .byte $C8   ; <ぱ>
- D - I - - 0x017040 0B:9030: C3        .byte $C3   ; <バ>
- D - I - - 0x017041 0B:9031: D2        .byte $D2
- D - I - - 0x017042 0B:9032: C4        .byte $C4   ; <ビ>
- D - I - - 0x017043 0B:9033: C4        .byte $C4   ; <ビ>
- D - I - - 0x017044 0B:9034: C4        .byte $C4   ; <ビ>
- D - I - - 0x017045 0B:9035: C4        .byte $C4   ; <ビ>
- D - I - - 0x017046 0B:9036: C2        .byte $C2   ; <ド>
- D - I - - 0x017047 0B:9037: C5        .byte $C5   ; <ブ>
- D - I - - 0x017048 0B:9038: C6        .byte $C6   ; <ベ>
- D - I - - 0x017049 0B:9039: C7        .byte $C7   ; <ボ>
- D - I - - 0x01704A 0B:903A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01704B 0B:903B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01704C 0B:903C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01704D 0B:903D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01704E 0B:903E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01704F 0B:903F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017050 0B:9040: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017051 0B:9041: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017052 0B:9042: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017053 0B:9043: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017054 0B:9044: C4        .byte $C4   ; <ビ>
- D - I - - 0x017055 0B:9045: C4        .byte $C4   ; <ビ>
- D - I - - 0x017056 0B:9046: C4        .byte $C4   ; <ビ>
- D - I - - 0x017057 0B:9047: C4        .byte $C4   ; <ビ>
- D - I - - 0x017058 0B:9048: C4        .byte $C4   ; <ビ>
- D - I - - 0x017059 0B:9049: C4        .byte $C4   ; <ビ>
- D - I - - 0x01705A 0B:904A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01705B 0B:904B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01705C 0B:904C: C4        .byte $C4   ; <ビ>
- D - I - - 0x01705D 0B:904D: C4        .byte $C4   ; <ビ>
- D - I - - 0x01705E 0B:904E: D2        .byte $D2
- D - I - - 0x01705F 0B:904F: C9        .byte $C9   ; <ぴ>
- D - I - - 0x017060 0B:9050: CA        .byte $CA   ; <ぷ>
- D - I - - 0x017061 0B:9051: D2        .byte $D2
- D - I - - 0x017062 0B:9052: C4        .byte $C4   ; <ビ>
- D - I - - 0x017063 0B:9053: C4        .byte $C4   ; <ビ>
- D - I - - 0x017064 0B:9054: C4        .byte $C4   ; <ビ>
- D - I - - 0x017065 0B:9055: C4        .byte $C4   ; <ビ>
- D - I - - 0x017066 0B:9056: CD        .byte $CD   ; <パ>
- D - I - - 0x017067 0B:9057: CB        .byte $CB   ; <ぺ>
- D - I - - 0x017068 0B:9058: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017069 0B:9059: C2        .byte $C2   ; <ド>
- D - I - - 0x01706A 0B:905A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01706B 0B:905B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01706C 0B:905C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01706D 0B:905D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01706E 0B:905E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01706F 0B:905F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017070 0B:9060: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017071 0B:9061: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017072 0B:9062: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017073 0B:9063: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017074 0B:9064: C4        .byte $C4   ; <ビ>
- D - I - - 0x017075 0B:9065: C4        .byte $C4   ; <ビ>
- D - I - - 0x017076 0B:9066: C4        .byte $C4   ; <ビ>
- D - I - - 0x017077 0B:9067: C4        .byte $C4   ; <ビ>
- D - I - - 0x017078 0B:9068: C4        .byte $C4   ; <ビ>
- D - I - - 0x017079 0B:9069: C4        .byte $C4   ; <ビ>
- D - I - - 0x01707A 0B:906A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01707B 0B:906B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01707C 0B:906C: C4        .byte $C4   ; <ビ>
- D - I - - 0x01707D 0B:906D: C4        .byte $C4   ; <ビ>
- D - I - - 0x01707E 0B:906E: D2        .byte $D2
- D - I - - 0x01707F 0B:906F: F8        .byte $F8
- D - I - - 0x017080 0B:9070: C3        .byte $C3   ; <バ>
- D - I - - 0x017081 0B:9071: D2        .byte $D2
- D - I - - 0x017082 0B:9072: C4        .byte $C4   ; <ビ>
- D - I - - 0x017083 0B:9073: C4        .byte $C4   ; <ビ>
- D - I - - 0x017084 0B:9074: C4        .byte $C4   ; <ビ>
- D - I - - 0x017085 0B:9075: C4        .byte $C4   ; <ビ>
- D - I - - 0x017086 0B:9076: C2        .byte $C2   ; <ド>
- D - I - - 0x017087 0B:9077: C5        .byte $C5   ; <ブ>
- D - I - - 0x017088 0B:9078: F9        .byte $F9
- D - I - - 0x017089 0B:9079: FA        .byte $FA
- D - I - - 0x01708A 0B:907A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01708B 0B:907B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01708C 0B:907C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01708D 0B:907D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01708E 0B:907E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01708F 0B:907F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017090 0B:9080: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017091 0B:9081: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017092 0B:9082: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017093 0B:9083: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017094 0B:9084: C4        .byte $C4   ; <ビ>
- D - I - - 0x017095 0B:9085: C4        .byte $C4   ; <ビ>
- D - I - - 0x017096 0B:9086: C4        .byte $C4   ; <ビ>
- D - I - - 0x017097 0B:9087: C4        .byte $C4   ; <ビ>
- D - I - - 0x017098 0B:9088: C4        .byte $C4   ; <ビ>
- D - I - - 0x017099 0B:9089: C4        .byte $C4   ; <ビ>
- D - I - - 0x01709A 0B:908A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01709B 0B:908B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01709C 0B:908C: C4        .byte $C4   ; <ビ>
- D - I - - 0x01709D 0B:908D: C4        .byte $C4   ; <ビ>
- D - I - - 0x01709E 0B:908E: D2        .byte $D2
- D - I - - 0x01709F 0B:908F: C9        .byte $C9   ; <ぴ>
- D - I - - 0x0170A0 0B:9090: FD        .byte $FD
- D - I - - 0x0170A1 0B:9091: D2        .byte $D2
- D - I - - 0x0170A2 0B:9092: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170A3 0B:9093: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170A4 0B:9094: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170A5 0B:9095: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170A6 0B:9096: FB        .byte $FB
- D - I - - 0x0170A7 0B:9097: FC        .byte $FC
- D - I - - 0x0170A8 0B:9098: CC        .byte $CC   ; <ぽ>
- D - I - - 0x0170A9 0B:9099: C2        .byte $C2   ; <ド>
- D - I - - 0x0170AA 0B:909A: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170AB 0B:909B: C4        .byte $C4   ; <ビ>
- D - I - - 0x0170AC 0B:909C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170AD 0B:909D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170AE 0B:909E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170AF 0B:909F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170B0 0B:90A0: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170B1 0B:90A1: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170B2 0B:90A2: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170B3 0B:90A3: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0170B4 0B:90A4: 00        .byte $00
- D - I - - 0x0170B5 0B:90A5: 00        .byte $00
- D - I - - 0x0170B6 0B:90A6: 00        .byte $00
- D - I - - 0x0170B7 0B:90A7: 00        .byte $00
- D - I - - 0x0170B8 0B:90A8: 00        .byte $00
- D - I - - 0x0170B9 0B:90A9: 00        .byte $00
- D - I - - 0x0170BA 0B:90AA: 00        .byte $00
- D - I - - 0x0170BB 0B:90AB: 00        .byte $00
- D - I - - 0x0170BC 0B:90AC: 00        .byte $00
- D - I - - 0x0170BD 0B:90AD: 00        .byte $00
- D - I - - 0x0170BE 0B:90AE: BA        .byte $BA   ; <ジ>
- D - I - - 0x0170BF 0B:90AF: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0170C0 0B:90B0: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0170C1 0B:90B1: BB        .byte $BB   ; <ズ>
- D - I - - 0x0170C2 0B:90B2: 00        .byte $00
- D - I - - 0x0170C3 0B:90B3: 00        .byte $00
- D - I - - 0x0170C4 0B:90B4: 00        .byte $00
- D - I - - 0x0170C5 0B:90B5: 00        .byte $00
- D - I - - 0x0170C6 0B:90B6: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0170C7 0B:90B7: BE        .byte $BE   ; <ダ>
- D - I - - 0x0170C8 0B:90B8: BF        .byte $BF   ; <ヂ>
- D - I - - 0x0170C9 0B:90B9: C0        .byte $C0   ; <ヅ>
- D - I - - 0x0170CA 0B:90BA: 00        .byte $00
- D - I - - 0x0170CB 0B:90BB: 00        .byte $00
- D - I - - 0x0170CC 0B:90BC: 00        .byte $00
- D - I - - 0x0170CD 0B:90BD: 00        .byte $00
- D - I - - 0x0170CE 0B:90BE: 00        .byte $00
- D - I - - 0x0170CF 0B:90BF: 00        .byte $00
- D - I - - 0x0170D0 0B:90C0: 00        .byte $00
- D - I - - 0x0170D1 0B:90C1: 00        .byte $00
- D - I - - 0x0170D2 0B:90C2: 00        .byte $00
- D - I - - 0x0170D3 0B:90C3: 00        .byte $00
- D - I - - 0x0170D4 0B:90C4: 00        .byte $00
- D - I - - 0x0170D5 0B:90C5: 00        .byte $00
- D - I - - 0x0170D6 0B:90C6: 00        .byte $00
- D - I - - 0x0170D7 0B:90C7: 00        .byte $00
- D - I - - 0x0170D8 0B:90C8: 00        .byte $00
- D - I - - 0x0170D9 0B:90C9: 00        .byte $00
- D - I - - 0x0170DA 0B:90CA: 00        .byte $00
- D - I - - 0x0170DB 0B:90CB: 00        .byte $00
- D - I - - 0x0170DC 0B:90CC: 00        .byte $00
- D - I - - 0x0170DD 0B:90CD: 00        .byte $00
- D - I - - 0x0170DE 0B:90CE: BA        .byte $BA   ; <ジ>
- D - I - - 0x0170DF 0B:90CF: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0170E0 0B:90D0: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0170E1 0B:90D1: BB        .byte $BB   ; <ズ>
- D - I - - 0x0170E2 0B:90D2: 00        .byte $00
- D - I - - 0x0170E3 0B:90D3: 00        .byte $00
- D - I - - 0x0170E4 0B:90D4: 00        .byte $00
- D - I - - 0x0170E5 0B:90D5: 00        .byte $00
- D - I - - 0x0170E6 0B:90D6: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0170E7 0B:90D7: BE        .byte $BE   ; <ダ>
- D - I - - 0x0170E8 0B:90D8: BF        .byte $BF   ; <ヂ>
- D - I - - 0x0170E9 0B:90D9: C1        .byte $C1   ; <デ>
- D - I - - 0x0170EA 0B:90DA: 00        .byte $00
- D - I - - 0x0170EB 0B:90DB: 00        .byte $00
- D - I - - 0x0170EC 0B:90DC: 00        .byte $00
- D - I - - 0x0170ED 0B:90DD: 00        .byte $00
- D - I - - 0x0170EE 0B:90DE: 00        .byte $00
- D - I - - 0x0170EF 0B:90DF: 00        .byte $00
- D - I - - 0x0170F0 0B:90E0: 00        .byte $00
- D - I - - 0x0170F1 0B:90E1: 00        .byte $00
- D - I - - 0x0170F2 0B:90E2: 00        .byte $00
- D - I - - 0x0170F3 0B:90E3: 00        .byte $00
- D - I - - 0x0170F4 0B:90E4: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170F5 0B:90E5: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170F6 0B:90E6: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170F7 0B:90E7: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170F8 0B:90E8: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170F9 0B:90E9: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170FA 0B:90EA: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170FB 0B:90EB: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170FC 0B:90EC: A9        .byte $A9   ; <ぞ>
- D - I - - 0x0170FD 0B:90ED: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170FE 0B:90EE: AB        .byte $AB   ; <ぢ>
- D - I - - 0x0170FF 0B:90EF: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017100 0B:90F0: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017101 0B:90F1: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017102 0B:90F2: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017103 0B:90F3: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017104 0B:90F4: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017105 0B:90F5: A9        .byte $A9   ; <ぞ>
- D - I - - 0x017106 0B:90F6: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017107 0B:90F7: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017108 0B:90F8: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017109 0B:90F9: AB        .byte $AB   ; <ぢ>
- D - I - - 0x01710A 0B:90FA: AB        .byte $AB   ; <ぢ>
- D - I - - 0x01710B 0B:90FB: AB        .byte $AB   ; <ぢ>
- D - I - - 0x01710C 0B:90FC: AC        .byte $AC   ; <づ>
- D - I - - 0x01710D 0B:90FD: AC        .byte $AC   ; <づ>
- D - I - - 0x01710E 0B:90FE: AA        .byte $AA   ; <だ>
- D - I - - 0x01710F 0B:90FF: AC        .byte $AC   ; <づ>
- D - I - - 0x017110 0B:9100: AC        .byte $AC   ; <づ>
- D - I - - 0x017111 0B:9101: AC        .byte $AC   ; <づ>
- D - I - - 0x017112 0B:9102: AC        .byte $AC   ; <づ>
- D - I - - 0x017113 0B:9103: AC        .byte $AC   ; <づ>
- D - I - - 0x017114 0B:9104: 00        .byte $00
- D - I - - 0x017115 0B:9105: 71        .byte $71   ; <ュ>
- D - I - - 0x017116 0B:9106: 72        .byte $72   ; <ョ>
- D - I - - 0x017117 0B:9107: 72        .byte $72   ; <ョ>
- D - I - - 0x017118 0B:9108: 73        .byte $73   ; <ヮ>
- D - I - - 0x017119 0B:9109: 72        .byte $72   ; <ョ>
- D - I - - 0x01711A 0B:910A: 74        .byte $74   ; <ィ>
- D - I - - 0x01711B 0B:910B: 00        .byte $00
- D - I - - 0x01711C 0B:910C: 00        .byte $00
- D - I - - 0x01711D 0B:910D: 75        .byte $75   ; <ェ>
- D - I - - 0x01711E 0B:910E: 76        .byte $76   ; <ォ>
- D - I - - 0x01711F 0B:910F: 77        .byte $77   ; <:>
- D - I - - 0x017120 0B:9110: 78        .byte $78   ; <?>
- D - I - - 0x017121 0B:9111: 79        .byte $79   ; <!>
- D - I - - 0x017122 0B:9112: 7A        .byte $7A   ; <、>
- D - I - - 0x017123 0B:9113: 00        .byte $00
- D - I - - 0x017124 0B:9114: 00        .byte $00
- D - I - - 0x017125 0B:9115: 7B        .byte $7B   ; <。>
- D - I - - 0x017126 0B:9116: 7C        .byte $7C   ; <~>
- D - I - - 0x017127 0B:9117: 7D        .byte $7D   ; <ー>
- D - I - - 0x017128 0B:9118: 7E        .byte $7E   ; <.>
- D - I - - 0x017129 0B:9119: 7F        .byte $7F   ; <,>
- D - I - - 0x01712A 0B:911A: 80        .byte $80
- D - I - - 0x01712B 0B:911B: 00        .byte $00
- D - I - - 0x01712C 0B:911C: 00        .byte $00
- D - I - - 0x01712D 0B:911D: 81        .byte $81   ; <A>
- D - I - - 0x01712E 0B:911E: 82        .byte $82   ; <B>
- D - I - - 0x01712F 0B:911F: 82        .byte $82   ; <B>
- D - I - - 0x017130 0B:9120: 83        .byte $83   ; <C>
- D - I - - 0x017131 0B:9121: 82        .byte $82   ; <B>
- D - I - - 0x017132 0B:9122: 84        .byte $84   ; <D>
- D - I - - 0x017133 0B:9123: 00        .byte $00
- D - I - - 0x017134 0B:9124: F7        .byte $F7
- D - I - - 0x017135 0B:9125: F7        .byte $F7
- D - I - - 0x017136 0B:9126: F7        .byte $F7
- D - I - - 0x017137 0B:9127: F7        .byte $F7
- D - I - - 0x017138 0B:9128: F7        .byte $F7
- D - I - - 0x017139 0B:9129: F7        .byte $F7
- D - I - - 0x01713A 0B:912A: F7        .byte $F7
- D - I - - 0x01713B 0B:912B: F7        .byte $F7
- D - I - - 0x01713C 0B:912C: F7        .byte $F7
- D - I - - 0x01713D 0B:912D: F7        .byte $F7
- D - I - - 0x01713E 0B:912E: F7        .byte $F7
- D - I - - 0x01713F 0B:912F: F7        .byte $F7
- D - I - - 0x017140 0B:9130: F7        .byte $F7
- D - I - - 0x017141 0B:9131: F7        .byte $F7
- D - I - - 0x017142 0B:9132: F7        .byte $F7
- D - I - - 0x017143 0B:9133: F7        .byte $F7
- D - I - - 0x017144 0B:9134: F7        .byte $F7
- D - I - - 0x017145 0B:9135: F7        .byte $F7
- D - I - - 0x017146 0B:9136: F7        .byte $F7
- D - I - - 0x017147 0B:9137: F7        .byte $F7
- D - I - - 0x017148 0B:9138: F7        .byte $F7
- D - I - - 0x017149 0B:9139: F7        .byte $F7
- D - I - - 0x01714A 0B:913A: F7        .byte $F7
- D - I - - 0x01714B 0B:913B: F7        .byte $F7
- D - I - - 0x01714C 0B:913C: FE        .byte $FE
- D - I - - 0x01714D 0B:913D: FE        .byte $FE
- D - I - - 0x01714E 0B:913E: FE        .byte $FE
- D - I - - 0x01714F 0B:913F: FE        .byte $FE
- D - I - - 0x017150 0B:9140: FE        .byte $FE
- D - I - - 0x017151 0B:9141: FE        .byte $FE
- D - I - - 0x017152 0B:9142: FE        .byte $FE
- D - I - - 0x017153 0B:9143: FE        .byte $FE
- D - I - - 0x017154 0B:9144: 15        .byte $15   ; <な>
- D - I - - 0x017155 0B:9145: 16        .byte $16   ; <に>
- D - I - - 0x017156 0B:9146: 15        .byte $15   ; <な>
- D - I - - 0x017157 0B:9147: 16        .byte $16   ; <に>
- D - I - - 0x017158 0B:9148: 15        .byte $15   ; <な>
- D - I - - 0x017159 0B:9149: 16        .byte $16   ; <に>
- D - I - - 0x01715A 0B:914A: 15        .byte $15   ; <な>
- D - I - - 0x01715B 0B:914B: 16        .byte $16   ; <に>
- D - I - - 0x01715C 0B:914C: 17        .byte $17   ; <ぬ>
- D - I - - 0x01715D 0B:914D: 18        .byte $18   ; <ね>
- D - I - - 0x01715E 0B:914E: 17        .byte $17   ; <ぬ>
- D - I - - 0x01715F 0B:914F: 18        .byte $18   ; <ね>
- D - I - - 0x017160 0B:9150: 17        .byte $17   ; <ぬ>
- D - I - - 0x017161 0B:9151: 18        .byte $18   ; <ね>
- D - I - - 0x017162 0B:9152: 17        .byte $17   ; <ぬ>
- D - I - - 0x017163 0B:9153: 18        .byte $18   ; <ね>
- D - I - - 0x017164 0B:9154: 26        .byte $26   ; <よ>
- D - I - - 0x017165 0B:9155: 26        .byte $26   ; <よ>
- D - I - - 0x017166 0B:9156: 26        .byte $26   ; <よ>
- D - I - - 0x017167 0B:9157: 26        .byte $26   ; <よ>
- D - I - - 0x017168 0B:9158: 26        .byte $26   ; <よ>
- D - I - - 0x017169 0B:9159: 26        .byte $26   ; <よ>
- D - I - - 0x01716A 0B:915A: 26        .byte $26   ; <よ>
- D - I - - 0x01716B 0B:915B: 26        .byte $26   ; <よ>
- D - I - - 0x01716C 0B:915C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01716D 0B:915D: 25        .byte $25   ; <ゆ>
- D - I - - 0x01716E 0B:915E: 25        .byte $25   ; <ゆ>
- D - I - - 0x01716F 0B:915F: 25        .byte $25   ; <ゆ>
- D - I - - 0x017170 0B:9160: 25        .byte $25   ; <ゆ>
- D - I - - 0x017171 0B:9161: 25        .byte $25   ; <ゆ>
- D - I - - 0x017172 0B:9162: 25        .byte $25   ; <ゆ>
- D - I - - 0x017173 0B:9163: 25        .byte $25   ; <ゆ>
- D - I - - 0x017174 0B:9164: 61        .byte $61   ; <ム>
- D - I - - 0x017175 0B:9165: 62        .byte $62   ; <メ>
- D - I - - 0x017176 0B:9166: 63        .byte $63   ; <モ>
- D - I - - 0x017177 0B:9167: 64        .byte $64   ; <ヤ>
- D - I - - 0x017178 0B:9168: 62        .byte $62   ; <メ>
- D - I - - 0x017179 0B:9169: 63        .byte $63   ; <モ>
- D - I - - 0x01717A 0B:916A: 65        .byte $65   ; <ユ>
- D - I - - 0x01717B 0B:916B: 66        .byte $66   ; <ヨ>
- D - I - - 0x01717C 0B:916C: 67        .byte $67   ; <ラ>
- D - I - - 0x01717D 0B:916D: 68        .byte $68   ; <リ>
- D - I - - 0x01717E 0B:916E: 69        .byte $69   ; <ル>
- D - I - - 0x01717F 0B:916F: 6A        .byte $6A   ; <レ>
- D - I - - 0x017180 0B:9170: 6B        .byte $6B   ; <ロ>
- D - I - - 0x017181 0B:9171: 6C        .byte $6C   ; <ワ>
- D - I - - 0x017182 0B:9172: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x017183 0B:9173: 6E        .byte $6E   ; <ン>
- D - I - - 0x017184 0B:9174: 30        .byte $30   ; <ゃ>
- D - I - - 0x017185 0B:9175: 30        .byte $30   ; <ゃ>
- D - I - - 0x017186 0B:9176: 30        .byte $30   ; <ゃ>
- D - I - - 0x017187 0B:9177: 30        .byte $30   ; <ゃ>
- D - I - - 0x017188 0B:9178: 30        .byte $30   ; <ゃ>
- D - I - - 0x017189 0B:9179: 30        .byte $30   ; <ゃ>
- D - I - - 0x01718A 0B:917A: 30        .byte $30   ; <ゃ>
- D - I - - 0x01718B 0B:917B: 30        .byte $30   ; <ゃ>
- D - I - - 0x01718C 0B:917C: 31        .byte $31   ; <ゅ>
- D - I - - 0x01718D 0B:917D: 31        .byte $31   ; <ゅ>
- D - I - - 0x01718E 0B:917E: 31        .byte $31   ; <ゅ>
- D - I - - 0x01718F 0B:917F: 31        .byte $31   ; <ゅ>
- D - I - - 0x017190 0B:9180: 31        .byte $31   ; <ゅ>
- D - I - - 0x017191 0B:9181: 31        .byte $31   ; <ゅ>
- D - I - - 0x017192 0B:9182: 31        .byte $31   ; <ゅ>
- D - I - - 0x017193 0B:9183: 31        .byte $31   ; <ゅ>
- D - I - - 0x017194 0B:9184: 15        .byte $15   ; <な>
- D - I - - 0x017195 0B:9185: 15        .byte $15   ; <な>
- D - I - - 0x017196 0B:9186: 15        .byte $15   ; <な>
- D - I - - 0x017197 0B:9187: 15        .byte $15   ; <な>
- D - I - - 0x017198 0B:9188: 15        .byte $15   ; <な>
- D - I - - 0x017199 0B:9189: 15        .byte $15   ; <な>
- D - I - - 0x01719A 0B:918A: 15        .byte $15   ; <な>
- D - I - - 0x01719B 0B:918B: 15        .byte $15   ; <な>
- D - I - - 0x01719C 0B:918C: 15        .byte $15   ; <な>
- D - I - - 0x01719D 0B:918D: 85        .byte $85   ; <E>
- D - I - - 0x01719E 0B:918E: 86        .byte $86   ; <F>
- D - I - - 0x01719F 0B:918F: 87        .byte $87   ; <G>
- D - I - - 0x0171A0 0B:9190: 19        .byte $19   ; <の>
- D - I - - 0x0171A1 0B:9191: 19        .byte $19   ; <の>
- D - I - - 0x0171A2 0B:9192: 8C        .byte $8C   ; <M>
- D - I - - 0x0171A3 0B:9193: 15        .byte $15   ; <な>
- D - I - - 0x0171A4 0B:9194: 15        .byte $15   ; <な>
- D - I - - 0x0171A5 0B:9195: 88        .byte $88   ; <H>
- D - I - - 0x0171A6 0B:9196: 89        .byte $89   ; <I>
- D - I - - 0x0171A7 0B:9197: 8A        .byte $8A   ; <N>
- D - I - - 0x0171A8 0B:9198: 13        .byte $13   ; <て>
- D - I - - 0x0171A9 0B:9199: 14        .byte $14   ; <と>
- D - I - - 0x0171AA 0B:919A: 8B        .byte $8B   ; <K>
- D - I - - 0x0171AB 0B:919B: 15        .byte $15   ; <な>
- D - I - - 0x0171AC 0B:919C: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171AD 0B:919D: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171AE 0B:919E: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171AF 0B:919F: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171B0 0B:91A0: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171B1 0B:91A1: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171B2 0B:91A2: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171B3 0B:91A3: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171B4 0B:91A4: 15        .byte $15   ; <な>
- D - I - - 0x0171B5 0B:91A5: 15        .byte $15   ; <な>
- D - I - - 0x0171B6 0B:91A6: 15        .byte $15   ; <な>
- D - I - - 0x0171B7 0B:91A7: 15        .byte $15   ; <な>
- D - I - - 0x0171B8 0B:91A8: 15        .byte $15   ; <な>
- D - I - - 0x0171B9 0B:91A9: 15        .byte $15   ; <な>
- D - I - - 0x0171BA 0B:91AA: 15        .byte $15   ; <な>
- D - I - - 0x0171BB 0B:91AB: 15        .byte $15   ; <な>
- D - I - - 0x0171BC 0B:91AC: 15        .byte $15   ; <な>
- D - I - - 0x0171BD 0B:91AD: 94        .byte $94
- D - I - - 0x0171BE 0B:91AE: 19        .byte $19   ; <の>
- D - I - - 0x0171BF 0B:91AF: 19        .byte $19   ; <の>
- D - I - - 0x0171C0 0B:91B0: 8D        .byte $8D   ; <P>
- D - I - - 0x0171C1 0B:91B1: 8E        .byte $8E   ; <L>
- D - I - - 0x0171C2 0B:91B2: 8F        .byte $8F   ; <S>
- D - I - - 0x0171C3 0B:91B3: 15        .byte $15   ; <な>
- D - I - - 0x0171C4 0B:91B4: 15        .byte $15   ; <な>
- D - I - - 0x0171C5 0B:91B5: 90        .byte $90   ; <U>
- D - I - - 0x0171C6 0B:91B6: 13        .byte $13   ; <て>
- D - I - - 0x0171C7 0B:91B7: 14        .byte $14   ; <と>
- D - I - - 0x0171C8 0B:91B8: 91        .byte $91   ; <V>
- D - I - - 0x0171C9 0B:91B9: 92        .byte $92   ; <W>
- D - I - - 0x0171CA 0B:91BA: 93        .byte $93   ; <Y>
- D - I - - 0x0171CB 0B:91BB: 15        .byte $15   ; <な>
- D - I - - 0x0171CC 0B:91BC: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171CD 0B:91BD: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171CE 0B:91BE: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171CF 0B:91BF: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171D0 0B:91C0: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171D1 0B:91C1: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171D2 0B:91C2: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171D3 0B:91C3: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0171D4 0B:91C4: 00        .byte $00
- D - I - - 0x0171D5 0B:91C5: 0A        .byte $0A   ; <こ>
- D - I - - 0x0171D6 0B:91C6: 00        .byte $00
- D - I - - 0x0171D7 0B:91C7: 00        .byte $00
- D - I - - 0x0171D8 0B:91C8: 06        .byte $06   ; <か>
- D - I - - 0x0171D9 0B:91C9: 07        .byte $07   ; <き>
- D - I - - 0x0171DA 0B:91CA: 00        .byte $00
- D - I - - 0x0171DB 0B:91CB: 00        .byte $00
- D - I - - 0x0171DC 0B:91CC: 0C        .byte $0C   ; <し>
- D - I - - 0x0171DD 0B:91CD: 0D        .byte $0D   ; <す>
- D - I - - 0x0171DE 0B:91CE: 7B        .byte $7B   ; <。>
- D - I - - 0x0171DF 0B:91CF: 7C        .byte $7C   ; <~>
- D - I - - 0x0171E0 0B:91D0: 7D        .byte $7D   ; <ー>
- D - I - - 0x0171E1 0B:91D1: 7E        .byte $7E   ; <.>
- D - I - - 0x0171E2 0B:91D2: 0C        .byte $0C   ; <し>
- D - I - - 0x0171E3 0B:91D3: 0D        .byte $0D   ; <す>
- D - I - - 0x0171E4 0B:91D4: 2D        .byte $2D   ; <を>
- D - I - - 0x0171E5 0B:91D5: 2D        .byte $2D   ; <を>
- D - I - - 0x0171E6 0B:91D6: 79        .byte $79   ; <!>
- D - I - - 0x0171E7 0B:91D7: 2A        .byte $2A   ; <れ>
- D - I - - 0x0171E8 0B:91D8: 2A        .byte $2A   ; <れ>
- D - I - - 0x0171E9 0B:91D9: 7A        .byte $7A   ; <、>
- D - I - - 0x0171EA 0B:91DA: 2D        .byte $2D   ; <を>
- D - I - - 0x0171EB 0B:91DB: 2D        .byte $2D   ; <を>
- D - I - - 0x0171EC 0B:91DC: 13        .byte $13   ; <て>
- D - I - - 0x0171ED 0B:91DD: 13        .byte $13   ; <て>
- D - I - - 0x0171EE 0B:91DE: 13        .byte $13   ; <て>
- D - I - - 0x0171EF 0B:91DF: 13        .byte $13   ; <て>
- D - I - - 0x0171F0 0B:91E0: 13        .byte $13   ; <て>
- D - I - - 0x0171F1 0B:91E1: 13        .byte $13   ; <て>
- D - I - - 0x0171F2 0B:91E2: 13        .byte $13   ; <て>
- D - I - - 0x0171F3 0B:91E3: 13        .byte $13   ; <て>
- D - I - - 0x0171F4 0B:91E4: 06        .byte $06   ; <か>
- D - I - - 0x0171F5 0B:91E5: 07        .byte $07   ; <き>
- D - I - - 0x0171F6 0B:91E6: 01        .byte $01   ; <あ>
- D - I - - 0x0171F7 0B:91E7: 02        .byte $02   ; <い>
- D - I - - 0x0171F8 0B:91E8: 70        .byte $70   ; <ャ>
- D - I - - 0x0171F9 0B:91E9: 04        .byte $04   ; <え>
- D - I - - 0x0171FA 0B:91EA: 00        .byte $00
- D - I - - 0x0171FB 0B:91EB: 0A        .byte $0A   ; <こ>
- D - I - - 0x0171FC 0B:91EC: 0C        .byte $0C   ; <し>
- D - I - - 0x0171FD 0B:91ED: 0D        .byte $0D   ; <す>
- D - I - - 0x0171FE 0B:91EE: 75        .byte $75   ; <ェ>
- D - I - - 0x0171FF 0B:91EF: 76        .byte $76   ; <ォ>
- D - I - - 0x017200 0B:91F0: 77        .byte $77   ; <:>
- D - I - - 0x017201 0B:91F1: 78        .byte $78   ; <?>
- D - I - - 0x017202 0B:91F2: 0C        .byte $0C   ; <し>
- D - I - - 0x017203 0B:91F3: 0D        .byte $0D   ; <す>
- D - I - - 0x017204 0B:91F4: 2D        .byte $2D   ; <を>
- D - I - - 0x017205 0B:91F5: 2D        .byte $2D   ; <を>
- D - I - - 0x017206 0B:91F6: 79        .byte $79   ; <!>
- D - I - - 0x017207 0B:91F7: 2A        .byte $2A   ; <れ>
- D - I - - 0x017208 0B:91F8: 2A        .byte $2A   ; <れ>
- D - I - - 0x017209 0B:91F9: 7A        .byte $7A   ; <、>
- D - I - - 0x01720A 0B:91FA: 2D        .byte $2D   ; <を>
- D - I - - 0x01720B 0B:91FB: 2D        .byte $2D   ; <を>
- D - I - - 0x01720C 0B:91FC: 13        .byte $13   ; <て>
- D - I - - 0x01720D 0B:91FD: 13        .byte $13   ; <て>
- D - I - - 0x01720E 0B:91FE: 13        .byte $13   ; <て>
- D - I - - 0x01720F 0B:91FF: 13        .byte $13   ; <て>
- D - I - - 0x017210 0B:9200: 13        .byte $13   ; <て>
- D - I - - 0x017211 0B:9201: 13        .byte $13   ; <て>
- D - I - - 0x017212 0B:9202: 13        .byte $13   ; <て>
- D - I - - 0x017213 0B:9203: 13        .byte $13   ; <て>
- D - I - - 0x017214 0B:9204: 33        .byte $33   ; <0>
- D - I - - 0x017215 0B:9205: 33        .byte $33   ; <0>
- D - I - - 0x017216 0B:9206: 33        .byte $33   ; <0>
- D - I - - 0x017217 0B:9207: 32        .byte $32   ; <ょ>
- D - I - - 0x017218 0B:9208: 33        .byte $33   ; <0>
- D - I - - 0x017219 0B:9209: 33        .byte $33   ; <0>
- D - I - - 0x01721A 0B:920A: 33        .byte $33   ; <0>
- D - I - - 0x01721B 0B:920B: 33        .byte $33   ; <0>
- D - I - - 0x01721C 0B:920C: 2E        .byte $2E   ; <ん>
- D - I - - 0x01721D 0B:920D: 2D        .byte $2D   ; <を>
- D - I - - 0x01721E 0B:920E: 2E        .byte $2E   ; <ん>
- D - I - - 0x01721F 0B:920F: 2E        .byte $2E   ; <ん>
- D - I - - 0x017220 0B:9210: 2E        .byte $2E   ; <ん>
- D - I - - 0x017221 0B:9211: 2D        .byte $2D   ; <を>
- D - I - - 0x017222 0B:9212: 2E        .byte $2E   ; <ん>
- D - I - - 0x017223 0B:9213: 2E        .byte $2E   ; <ん>
- D - I - - 0x017224 0B:9214: 30        .byte $30   ; <ゃ>
- D - I - - 0x017225 0B:9215: 30        .byte $30   ; <ゃ>
- D - I - - 0x017226 0B:9216: 30        .byte $30   ; <ゃ>
- D - I - - 0x017227 0B:9217: 30        .byte $30   ; <ゃ>
- D - I - - 0x017228 0B:9218: 30        .byte $30   ; <ゃ>
- D - I - - 0x017229 0B:9219: 30        .byte $30   ; <ゃ>
- D - I - - 0x01722A 0B:921A: 30        .byte $30   ; <ゃ>
- D - I - - 0x01722B 0B:921B: 30        .byte $30   ; <ゃ>
- D - I - - 0x01722C 0B:921C: 31        .byte $31   ; <ゅ>
- D - I - - 0x01722D 0B:921D: 31        .byte $31   ; <ゅ>
- D - I - - 0x01722E 0B:921E: 31        .byte $31   ; <ゅ>
- D - I - - 0x01722F 0B:921F: 31        .byte $31   ; <ゅ>
- D - I - - 0x017230 0B:9220: 31        .byte $31   ; <ゅ>
- D - I - - 0x017231 0B:9221: 31        .byte $31   ; <ゅ>
- D - I - - 0x017232 0B:9222: 31        .byte $31   ; <ゅ>
- D - I - - 0x017233 0B:9223: 31        .byte $31   ; <ゅ>
- D - I - - 0x017234 0B:9224: 2B        .byte $2B   ; <ろ>
- D - I - - 0x017235 0B:9225: 2B        .byte $2B   ; <ろ>
- D - I - - 0x017236 0B:9226: 2B        .byte $2B   ; <ろ>
- D - I - - 0x017237 0B:9227: 2B        .byte $2B   ; <ろ>
- D - I - - 0x017238 0B:9228: EE        .byte $EE
- D - I - - 0x017239 0B:9229: 2B        .byte $2B   ; <ろ>
- D - I - - 0x01723A 0B:922A: 2B        .byte $2B   ; <ろ>
- D - I - - 0x01723B 0B:922B: 2B        .byte $2B   ; <ろ>
- D - I - - 0x01723C 0B:922C: 2D        .byte $2D   ; <を>
- D - I - - 0x01723D 0B:922D: 2E        .byte $2E   ; <ん>
- D - I - - 0x01723E 0B:922E: 2E        .byte $2E   ; <ん>
- D - I - - 0x01723F 0B:922F: 2E        .byte $2E   ; <ん>
- D - I - - 0x017240 0B:9230: EF        .byte $EF
- D - I - - 0x017241 0B:9231: 2E        .byte $2E   ; <ん>
- D - I - - 0x017242 0B:9232: 2E        .byte $2E   ; <ん>
- D - I - - 0x017243 0B:9233: 2E        .byte $2E   ; <ん>
- D - I - - 0x017244 0B:9234: 30        .byte $30   ; <ゃ>
- D - I - - 0x017245 0B:9235: 30        .byte $30   ; <ゃ>
- D - I - - 0x017246 0B:9236: 30        .byte $30   ; <ゃ>
- D - I - - 0x017247 0B:9237: 30        .byte $30   ; <ゃ>
- D - I - - 0x017248 0B:9238: 30        .byte $30   ; <ゃ>
- D - I - - 0x017249 0B:9239: 30        .byte $30   ; <ゃ>
- D - I - - 0x01724A 0B:923A: 30        .byte $30   ; <ゃ>
- D - I - - 0x01724B 0B:923B: 30        .byte $30   ; <ゃ>
- D - I - - 0x01724C 0B:923C: 31        .byte $31   ; <ゅ>
- D - I - - 0x01724D 0B:923D: 31        .byte $31   ; <ゅ>
- D - I - - 0x01724E 0B:923E: 31        .byte $31   ; <ゅ>
- D - I - - 0x01724F 0B:923F: 31        .byte $31   ; <ゅ>
- D - I - - 0x017250 0B:9240: 31        .byte $31   ; <ゅ>
- D - I - - 0x017251 0B:9241: 31        .byte $31   ; <ゅ>
- D - I - - 0x017252 0B:9242: 31        .byte $31   ; <ゅ>
- D - I - - 0x017253 0B:9243: 31        .byte $31   ; <ゅ>
- D - I - - 0x017254 0B:9244: 10        .byte $10   ; <た>
- D - I - - 0x017255 0B:9245: 10        .byte $10   ; <た>
- D - I - - 0x017256 0B:9246: B0        .byte $B0   ; <び>
- D - I - - 0x017257 0B:9247: B1        .byte $B1   ; <ぶ>
- D - I - - 0x017258 0B:9248: B2        .byte $B2   ; <べ>
- D - I - - 0x017259 0B:9249: B3        .byte $B3   ; <ぼ>
- D - I - - 0x01725A 0B:924A: 29        .byte $29   ; <る>
- D - I - - 0x01725B 0B:924B: 10        .byte $10   ; <た>
- D - I - - 0x01725C 0B:924C: 13        .byte $13   ; <て>
- D - I - - 0x01725D 0B:924D: 14        .byte $14   ; <と>
- D - I - - 0x01725E 0B:924E: B4        .byte $B4   ; <ガ>
- D - I - - 0x01725F 0B:924F: B5        .byte $B5   ; <ギ>
- D - I - - 0x017260 0B:9250: B6        .byte $B6   ; <グ>
- D - I - - 0x017261 0B:9251: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017262 0B:9252: 13        .byte $13   ; <て>
- D - I - - 0x017263 0B:9253: 14        .byte $14   ; <と>
- D - I - - 0x017264 0B:9254: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017265 0B:9255: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017266 0B:9256: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017267 0B:9257: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017268 0B:9258: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017269 0B:9259: B8        .byte $B8   ; <ゴ>
- D - I - - 0x01726A 0B:925A: B8        .byte $B8   ; <ゴ>
- D - I - - 0x01726B 0B:925B: B8        .byte $B8   ; <ゴ>
- D - I - - 0x01726C 0B:925C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01726D 0B:925D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01726E 0B:925E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01726F 0B:925F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017270 0B:9260: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017271 0B:9261: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017272 0B:9262: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017273 0B:9263: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017274 0B:9264: 26        .byte $26   ; <よ>
- D - I - - 0x017275 0B:9265: E7        .byte $E7
- D - I - - 0x017276 0B:9266: E4        .byte $E4
- D - I - - 0x017277 0B:9267: E2        .byte $E2
- D - I - - 0x017278 0B:9268: 33        .byte $33   ; <0>
- D - I - - 0x017279 0B:9269: 33        .byte $33   ; <0>
- D - I - - 0x01727A 0B:926A: 33        .byte $33   ; <0>
- D - I - - 0x01727B 0B:926B: 33        .byte $33   ; <0>
- D - I - - 0x01727C 0B:926C: 26        .byte $26   ; <よ>
- D - I - - 0x01727D 0B:926D: 26        .byte $26   ; <よ>
- D - I - - 0x01727E 0B:926E: E7        .byte $E7
- D - I - - 0x01727F 0B:926F: E3        .byte $E3
- D - I - - 0x017280 0B:9270: E2        .byte $E2
- D - I - - 0x017281 0B:9271: 33        .byte $33   ; <0>
- D - I - - 0x017282 0B:9272: 33        .byte $33   ; <0>
- D - I - - 0x017283 0B:9273: 33        .byte $33   ; <0>
- D - I - - 0x017284 0B:9274: 26        .byte $26   ; <よ>
- D - I - - 0x017285 0B:9275: 26        .byte $26   ; <よ>
- D - I - - 0x017286 0B:9276: 26        .byte $26   ; <よ>
- D - I - - 0x017287 0B:9277: E7        .byte $E7
- D - I - - 0x017288 0B:9278: E4        .byte $E4
- D - I - - 0x017289 0B:9279: E2        .byte $E2
- D - I - - 0x01728A 0B:927A: E5        .byte $E5
- D - I - - 0x01728B 0B:927B: 33        .byte $33   ; <0>
- D - I - - 0x01728C 0B:927C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01728D 0B:927D: 25        .byte $25   ; <ゆ>
- D - I - - 0x01728E 0B:927E: 25        .byte $25   ; <ゆ>
- D - I - - 0x01728F 0B:927F: 25        .byte $25   ; <ゆ>
- D - I - - 0x017290 0B:9280: E8        .byte $E8
- D - I - - 0x017291 0B:9281: E9        .byte $E9
- D - I - - 0x017292 0B:9282: E1        .byte $E1
- D - I - - 0x017293 0B:9283: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017294 0B:9284: 33        .byte $33   ; <0>
- D - I - - 0x017295 0B:9285: B1        .byte $B1   ; <ぶ>
- D - I - - 0x017296 0B:9286: 33        .byte $33   ; <0>
- D - I - - 0x017297 0B:9287: 33        .byte $33   ; <0>
- D - I - - 0x017298 0B:9288: 33        .byte $33   ; <0>
- D - I - - 0x017299 0B:9289: B2        .byte $B2   ; <べ>
- D - I - - 0x01729A 0B:928A: 33        .byte $33   ; <0>
- D - I - - 0x01729B 0B:928B: 33        .byte $33   ; <0>
- D - I - - 0x01729C 0B:928C: B4        .byte $B4   ; <ガ>
- D - I - - 0x01729D 0B:928D: B5        .byte $B5   ; <ギ>
- D - I - - 0x01729E 0B:928E: B4        .byte $B4   ; <ガ>
- D - I - - 0x01729F 0B:928F: B5        .byte $B5   ; <ギ>
- D - I - - 0x0172A0 0B:9290: B4        .byte $B4   ; <ガ>
- D - I - - 0x0172A1 0B:9291: B5        .byte $B5   ; <ギ>
- D - I - - 0x0172A2 0B:9292: B4        .byte $B4   ; <ガ>
- D - I - - 0x0172A3 0B:9293: B5        .byte $B5   ; <ギ>
- D - I - - 0x0172A4 0B:9294: B6        .byte $B6   ; <グ>
- D - I - - 0x0172A5 0B:9295: B6        .byte $B6   ; <グ>
- D - I - - 0x0172A6 0B:9296: B6        .byte $B6   ; <グ>
- D - I - - 0x0172A7 0B:9297: B6        .byte $B6   ; <グ>
- D - I - - 0x0172A8 0B:9298: B6        .byte $B6   ; <グ>
- D - I - - 0x0172A9 0B:9299: B6        .byte $B6   ; <グ>
- D - I - - 0x0172AA 0B:929A: B6        .byte $B6   ; <グ>
- D - I - - 0x0172AB 0B:929B: B6        .byte $B6   ; <グ>
- D - I - - 0x0172AC 0B:929C: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172AD 0B:929D: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172AE 0B:929E: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172AF 0B:929F: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172B0 0B:92A0: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172B1 0B:92A1: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172B2 0B:92A2: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172B3 0B:92A3: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172B4 0B:92A4: 33        .byte $33   ; <0>
- D - I - - 0x0172B5 0B:92A5: 33        .byte $33   ; <0>
- D - I - - 0x0172B6 0B:92A6: 33        .byte $33   ; <0>
- D - I - - 0x0172B7 0B:92A7: 33        .byte $33   ; <0>
- D - I - - 0x0172B8 0B:92A8: BB        .byte $BB   ; <ズ>
- D - I - - 0x0172B9 0B:92A9: BE        .byte $BE   ; <ダ>
- D - I - - 0x0172BA 0B:92AA: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0172BB 0B:92AB: 26        .byte $26   ; <よ>
- D - I - - 0x0172BC 0B:92AC: 33        .byte $33   ; <0>
- D - I - - 0x0172BD 0B:92AD: 33        .byte $33   ; <0>
- D - I - - 0x0172BE 0B:92AE: 33        .byte $33   ; <0>
- D - I - - 0x0172BF 0B:92AF: BB        .byte $BB   ; <ズ>
- D - I - - 0x0172C0 0B:92B0: BF        .byte $BF   ; <ヂ>
- D - I - - 0x0172C1 0B:92B1: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0172C2 0B:92B2: 26        .byte $26   ; <よ>
- D - I - - 0x0172C3 0B:92B3: 26        .byte $26   ; <よ>
- D - I - - 0x0172C4 0B:92B4: 33        .byte $33   ; <0>
- D - I - - 0x0172C5 0B:92B5: BA        .byte $BA   ; <ジ>
- D - I - - 0x0172C6 0B:92B6: BB        .byte $BB   ; <ズ>
- D - I - - 0x0172C7 0B:92B7: BE        .byte $BE   ; <ダ>
- D - I - - 0x0172C8 0B:92B8: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0172C9 0B:92B9: 26        .byte $26   ; <よ>
- D - I - - 0x0172CA 0B:92BA: 26        .byte $26   ; <よ>
- D - I - - 0x0172CB 0B:92BB: 26        .byte $26   ; <よ>
- D - I - - 0x0172CC 0B:92BC: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0172CD 0B:92BD: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0172CE 0B:92BE: C0        .byte $C0   ; <ヅ>
- D - I - - 0x0172CF 0B:92BF: B8        .byte $B8   ; <ゴ>
- D - I - - 0x0172D0 0B:92C0: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172D1 0B:92C1: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172D2 0B:92C2: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172D3 0B:92C3: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172D4 0B:92C4: 33        .byte $33   ; <0>
- D - I - - 0x0172D5 0B:92C5: 33        .byte $33   ; <0>
- D - I - - 0x0172D6 0B:92C6: 33        .byte $33   ; <0>
- D - I - - 0x0172D7 0B:92C7: C2        .byte $C2   ; <ド>
- D - I - - 0x0172D8 0B:92C8: C5        .byte $C5   ; <ブ>
- D - I - - 0x0172D9 0B:92C9: 26        .byte $26   ; <よ>
- D - I - - 0x0172DA 0B:92CA: 26        .byte $26   ; <よ>
- D - I - - 0x0172DB 0B:92CB: 26        .byte $26   ; <よ>
- D - I - - 0x0172DC 0B:92CC: 33        .byte $33   ; <0>
- D - I - - 0x0172DD 0B:92CD: 33        .byte $33   ; <0>
- D - I - - 0x0172DE 0B:92CE: 33        .byte $33   ; <0>
- D - I - - 0x0172DF 0B:92CF: C4        .byte $C4   ; <ビ>
- D - I - - 0x0172E0 0B:92D0: C5        .byte $C5   ; <ブ>
- D - I - - 0x0172E1 0B:92D1: 26        .byte $26   ; <よ>
- D - I - - 0x0172E2 0B:92D2: 26        .byte $26   ; <よ>
- D - I - - 0x0172E3 0B:92D3: 26        .byte $26   ; <よ>
- D - I - - 0x0172E4 0B:92D4: 33        .byte $33   ; <0>
- D - I - - 0x0172E5 0B:92D5: 33        .byte $33   ; <0>
- D - I - - 0x0172E6 0B:92D6: 33        .byte $33   ; <0>
- D - I - - 0x0172E7 0B:92D7: C2        .byte $C2   ; <ド>
- D - I - - 0x0172E8 0B:92D8: C5        .byte $C5   ; <ブ>
- D - I - - 0x0172E9 0B:92D9: 26        .byte $26   ; <よ>
- D - I - - 0x0172EA 0B:92DA: 26        .byte $26   ; <よ>
- D - I - - 0x0172EB 0B:92DB: 26        .byte $26   ; <よ>
- D - I - - 0x0172EC 0B:92DC: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0172ED 0B:92DD: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0172EE 0B:92DE: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0172EF 0B:92DF: C3        .byte $C3   ; <バ>
- D - I - - 0x0172F0 0B:92E0: C6        .byte $C6   ; <ベ>
- D - I - - 0x0172F1 0B:92E1: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172F2 0B:92E2: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172F3 0B:92E3: 25        .byte $25   ; <ゆ>
- D - I - - 0x0172F4 0B:92E4: 33        .byte $33   ; <0>
- D - I - - 0x0172F5 0B:92E5: C8        .byte $C8   ; <ぱ>
- D - I - - 0x0172F6 0B:92E6: CA        .byte $CA   ; <ぷ>
- D - I - - 0x0172F7 0B:92E7: CD        .byte $CD   ; <パ>
- D - I - - 0x0172F8 0B:92E8: 26        .byte $26   ; <よ>
- D - I - - 0x0172F9 0B:92E9: 26        .byte $26   ; <よ>
- D - I - - 0x0172FA 0B:92EA: 26        .byte $26   ; <よ>
- D - I - - 0x0172FB 0B:92EB: 26        .byte $26   ; <よ>
- D - I - - 0x0172FC 0B:92EC: 33        .byte $33   ; <0>
- D - I - - 0x0172FD 0B:92ED: C7        .byte $C7   ; <ボ>
- D - I - - 0x0172FE 0B:92EE: C8        .byte $C8   ; <ぱ>
- D - I - - 0x0172FF 0B:92EF: CB        .byte $CB   ; <ぺ>
- D - I - - 0x017300 0B:92F0: CD        .byte $CD   ; <パ>
- D - I - - 0x017301 0B:92F1: 26        .byte $26   ; <よ>
- D - I - - 0x017302 0B:92F2: 26        .byte $26   ; <よ>
- D - I - - 0x017303 0B:92F3: 26        .byte $26   ; <よ>
- D - I - - 0x017304 0B:92F4: 33        .byte $33   ; <0>
- D - I - - 0x017305 0B:92F5: 33        .byte $33   ; <0>
- D - I - - 0x017306 0B:92F6: 33        .byte $33   ; <0>
- D - I - - 0x017307 0B:92F7: C8        .byte $C8   ; <ぱ>
- D - I - - 0x017308 0B:92F8: CA        .byte $CA   ; <ぷ>
- D - I - - 0x017309 0B:92F9: CD        .byte $CD   ; <パ>
- D - I - - 0x01730A 0B:92FA: 26        .byte $26   ; <よ>
- D - I - - 0x01730B 0B:92FB: 26        .byte $26   ; <よ>
- D - I - - 0x01730C 0B:92FC: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01730D 0B:92FD: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01730E 0B:92FE: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01730F 0B:92FF: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017310 0B:9300: C9        .byte $C9   ; <ぴ>
- D - I - - 0x017311 0B:9301: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017312 0B:9302: FE        .byte $FE
- D - I - - 0x017313 0B:9303: 26        .byte $26   ; <よ>
- D - I - - 0x017314 0B:9304: CE        .byte $CE   ; <ピ>
- D - I - - 0x017315 0B:9305: CE        .byte $CE   ; <ピ>
- D - I - - 0x017316 0B:9306: CE        .byte $CE   ; <ピ>
- D - I - - 0x017317 0B:9307: CE        .byte $CE   ; <ピ>
- D - I - - 0x017318 0B:9308: CE        .byte $CE   ; <ピ>
- D - I - - 0x017319 0B:9309: CE        .byte $CE   ; <ピ>
- D - I - - 0x01731A 0B:930A: CE        .byte $CE   ; <ピ>
- D - I - - 0x01731B 0B:930B: CE        .byte $CE   ; <ピ>
- D - I - - 0x01731C 0B:930C: CF        .byte $CF   ; <プ>
- D - I - - 0x01731D 0B:930D: D0        .byte $D0   ; <ペ>
- D - I - - 0x01731E 0B:930E: CF        .byte $CF   ; <プ>
- D - I - - 0x01731F 0B:930F: D0        .byte $D0   ; <ペ>
- D - I - - 0x017320 0B:9310: CF        .byte $CF   ; <プ>
- D - I - - 0x017321 0B:9311: D0        .byte $D0   ; <ペ>
- D - I - - 0x017322 0B:9312: CF        .byte $CF   ; <プ>
- D - I - - 0x017323 0B:9313: D0        .byte $D0   ; <ペ>
- D - I - - 0x017324 0B:9314: FF        .byte $FF
- D - I - - 0x017325 0B:9315: D1        .byte $D1   ; <ポ>
- D - I - - 0x017326 0B:9316: FF        .byte $FF
- D - I - - 0x017327 0B:9317: FF        .byte $FF
- D - I - - 0x017328 0B:9318: FF        .byte $FF
- D - I - - 0x017329 0B:9319: FF        .byte $FF
- D - I - - 0x01732A 0B:931A: 70        .byte $70   ; <ャ>
- D - I - - 0x01732B 0B:931B: FF        .byte $FF
- D - I - - 0x01732C 0B:931C: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01732D 0B:931D: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01732E 0B:931E: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01732F 0B:931F: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017330 0B:9320: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017331 0B:9321: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017332 0B:9322: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017333 0B:9323: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017334 0B:9324: 26        .byte $26   ; <よ>
- D - I - - 0x017335 0B:9325: 26        .byte $26   ; <よ>
- D - I - - 0x017336 0B:9326: 26        .byte $26   ; <よ>
- D - I - - 0x017337 0B:9327: 26        .byte $26   ; <よ>
- D - I - - 0x017338 0B:9328: D9        .byte $D9
- D - I - - 0x017339 0B:9329: D5        .byte $D5
- D - I - - 0x01733A 0B:932A: D2        .byte $D2
- D - I - - 0x01733B 0B:932B: 33        .byte $33   ; <0>
- D - I - - 0x01733C 0B:932C: 26        .byte $26   ; <よ>
- D - I - - 0x01733D 0B:932D: 26        .byte $26   ; <よ>
- D - I - - 0x01733E 0B:932E: 26        .byte $26   ; <よ>
- D - I - - 0x01733F 0B:932F: D9        .byte $D9
- D - I - - 0x017340 0B:9330: D5        .byte $D5
- D - I - - 0x017341 0B:9331: D3        .byte $D3
- D - I - - 0x017342 0B:9332: D8        .byte $D8
- D - I - - 0x017343 0B:9333: 33        .byte $33   ; <0>
- D - I - - 0x017344 0B:9334: 26        .byte $26   ; <よ>
- D - I - - 0x017345 0B:9335: 26        .byte $26   ; <よ>
- D - I - - 0x017346 0B:9336: D9        .byte $D9
- D - I - - 0x017347 0B:9337: D5        .byte $D5
- D - I - - 0x017348 0B:9338: D2        .byte $D2
- D - I - - 0x017349 0B:9339: 33        .byte $33   ; <0>
- D - I - - 0x01734A 0B:933A: 33        .byte $33   ; <0>
- D - I - - 0x01734B 0B:933B: 33        .byte $33   ; <0>
- D - I - - 0x01734C 0B:933C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01734D 0B:933D: DA        .byte $DA
- D - I - - 0x01734E 0B:933E: D6        .byte $D6
- D - I - - 0x01734F 0B:933F: D4        .byte $D4
- D - I - - 0x017350 0B:9340: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017351 0B:9341: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017352 0B:9342: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017353 0B:9343: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017354 0B:9344: 26        .byte $26   ; <よ>
- D - I - - 0x017355 0B:9345: 26        .byte $26   ; <よ>
- D - I - - 0x017356 0B:9346: 26        .byte $26   ; <よ>
- D - I - - 0x017357 0B:9347: DB        .byte $DB
- D - I - - 0x017358 0B:9348: DC        .byte $DC
- D - I - - 0x017359 0B:9349: 33        .byte $33   ; <0>
- D - I - - 0x01735A 0B:934A: 33        .byte $33   ; <0>
- D - I - - 0x01735B 0B:934B: 33        .byte $33   ; <0>
- D - I - - 0x01735C 0B:934C: 26        .byte $26   ; <よ>
- D - I - - 0x01735D 0B:934D: 26        .byte $26   ; <よ>
- D - I - - 0x01735E 0B:934E: 26        .byte $26   ; <よ>
- D - I - - 0x01735F 0B:934F: DD        .byte $DD
- D - I - - 0x017360 0B:9350: DC        .byte $DC
- D - I - - 0x017361 0B:9351: 33        .byte $33   ; <0>
- D - I - - 0x017362 0B:9352: 33        .byte $33   ; <0>
- D - I - - 0x017363 0B:9353: 33        .byte $33   ; <0>
- D - I - - 0x017364 0B:9354: 26        .byte $26   ; <よ>
- D - I - - 0x017365 0B:9355: 26        .byte $26   ; <よ>
- D - I - - 0x017366 0B:9356: 26        .byte $26   ; <よ>
- D - I - - 0x017367 0B:9357: DB        .byte $DB
- D - I - - 0x017368 0B:9358: DC        .byte $DC
- D - I - - 0x017369 0B:9359: 33        .byte $33   ; <0>
- D - I - - 0x01736A 0B:935A: 33        .byte $33   ; <0>
- D - I - - 0x01736B 0B:935B: 33        .byte $33   ; <0>
- D - I - - 0x01736C 0B:935C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01736D 0B:935D: 25        .byte $25   ; <ゆ>
- D - I - - 0x01736E 0B:935E: 25        .byte $25   ; <ゆ>
- D - I - - 0x01736F 0B:935F: DE        .byte $DE
- D - I - - 0x017370 0B:9360: DF        .byte $DF
- D - I - - 0x017371 0B:9361: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017372 0B:9362: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017373 0B:9363: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017374 0B:9364: A5        .byte $A5   ; <ざ>
- D - I - - 0x017375 0B:9365: A5        .byte $A5   ; <ざ>
- D - I - - 0x017376 0B:9366: A5        .byte $A5   ; <ざ>
- D - I - - 0x017377 0B:9367: A5        .byte $A5   ; <ざ>
- D - I - - 0x017378 0B:9368: A5        .byte $A5   ; <ざ>
- D - I - - 0x017379 0B:9369: A5        .byte $A5   ; <ざ>
- D - I - - 0x01737A 0B:936A: A5        .byte $A5   ; <ざ>
- D - I - - 0x01737B 0B:936B: A5        .byte $A5   ; <ざ>
- D - I - - 0x01737C 0B:936C: A6        .byte $A6   ; <じ>
- D - I - - 0x01737D 0B:936D: A6        .byte $A6   ; <じ>
- D - I - - 0x01737E 0B:936E: A6        .byte $A6   ; <じ>
- D - I - - 0x01737F 0B:936F: A6        .byte $A6   ; <じ>
- D - I - - 0x017380 0B:9370: A6        .byte $A6   ; <じ>
- D - I - - 0x017381 0B:9371: A6        .byte $A6   ; <じ>
- D - I - - 0x017382 0B:9372: A6        .byte $A6   ; <じ>
- D - I - - 0x017383 0B:9373: A6        .byte $A6   ; <じ>
- D - I - - 0x017384 0B:9374: A7        .byte $A7   ; <ず>
- D - I - - 0x017385 0B:9375: A7        .byte $A7   ; <ず>
- D - I - - 0x017386 0B:9376: A7        .byte $A7   ; <ず>
- D - I - - 0x017387 0B:9377: A7        .byte $A7   ; <ず>
- D - I - - 0x017388 0B:9378: A7        .byte $A7   ; <ず>
- D - I - - 0x017389 0B:9379: A7        .byte $A7   ; <ず>
- D - I - - 0x01738A 0B:937A: A7        .byte $A7   ; <ず>
- D - I - - 0x01738B 0B:937B: A7        .byte $A7   ; <ず>
- D - I - - 0x01738C 0B:937C: A8        .byte $A8   ; <ぜ>
- D - I - - 0x01738D 0B:937D: A8        .byte $A8   ; <ぜ>
- D - I - - 0x01738E 0B:937E: A8        .byte $A8   ; <ぜ>
- D - I - - 0x01738F 0B:937F: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017390 0B:9380: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017391 0B:9381: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017392 0B:9382: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017393 0B:9383: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017394 0B:9384: 05        .byte $05   ; <お>
- D - I - - 0x017395 0B:9385: 00        .byte $00
- D - I - - 0x017396 0B:9386: C4        .byte $C4   ; <ビ>
- D - I - - 0x017397 0B:9387: 00        .byte $00
- D - I - - 0x017398 0B:9388: 00        .byte $00
- D - I - - 0x017399 0B:9389: 08        .byte $08   ; <く>
- D - I - - 0x01739A 0B:938A: 00        .byte $00
- D - I - - 0x01739B 0B:938B: 0A        .byte $0A   ; <こ>
- D - I - - 0x01739C 0B:938C: 0D        .byte $0D   ; <す>
- D - I - - 0x01739D 0B:938D: 0C        .byte $0C   ; <し>
- D - I - - 0x01739E 0B:938E: 0D        .byte $0D   ; <す>
- D - I - - 0x01739F 0B:938F: 0C        .byte $0C   ; <し>
- D - I - - 0x0173A0 0B:9390: 0D        .byte $0D   ; <す>
- D - I - - 0x0173A1 0B:9391: 0C        .byte $0C   ; <し>
- D - I - - 0x0173A2 0B:9392: 0D        .byte $0D   ; <す>
- D - I - - 0x0173A3 0B:9393: 0C        .byte $0C   ; <し>
- D - I - - 0x0173A4 0B:9394: FA        .byte $FA
- D - I - - 0x0173A5 0B:9395: FA        .byte $FA
- D - I - - 0x0173A6 0B:9396: FA        .byte $FA
- D - I - - 0x0173A7 0B:9397: FA        .byte $FA
- D - I - - 0x0173A8 0B:9398: FA        .byte $FA
- D - I - - 0x0173A9 0B:9399: FA        .byte $FA
- D - I - - 0x0173AA 0B:939A: FA        .byte $FA
- D - I - - 0x0173AB 0B:939B: FA        .byte $FA
- D - I - - 0x0173AC 0B:939C: 13        .byte $13   ; <て>
- D - I - - 0x0173AD 0B:939D: 13        .byte $13   ; <て>
- D - I - - 0x0173AE 0B:939E: 13        .byte $13   ; <て>
- D - I - - 0x0173AF 0B:939F: 13        .byte $13   ; <て>
- D - I - - 0x0173B0 0B:93A0: 13        .byte $13   ; <て>
- D - I - - 0x0173B1 0B:93A1: 13        .byte $13   ; <て>
- D - I - - 0x0173B2 0B:93A2: 13        .byte $13   ; <て>
- D - I - - 0x0173B3 0B:93A3: 13        .byte $13   ; <て>
- D - I - - 0x0173B4 0B:93A4: 14        .byte $14   ; <と>
- D - I - - 0x0173B5 0B:93A5: 14        .byte $14   ; <と>
- D - I - - 0x0173B6 0B:93A6: 14        .byte $14   ; <と>
- D - I - - 0x0173B7 0B:93A7: 14        .byte $14   ; <と>
- D - I - - 0x0173B8 0B:93A8: 14        .byte $14   ; <と>
- D - I - - 0x0173B9 0B:93A9: 14        .byte $14   ; <と>
- D - I - - 0x0173BA 0B:93AA: 14        .byte $14   ; <と>
- D - I - - 0x0173BB 0B:93AB: 14        .byte $14   ; <と>
- D - I - - 0x0173BC 0B:93AC: 33        .byte $33   ; <0>
- D - I - - 0x0173BD 0B:93AD: 33        .byte $33   ; <0>
- D - I - - 0x0173BE 0B:93AE: 33        .byte $33   ; <0>
- D - I - - 0x0173BF 0B:93AF: 33        .byte $33   ; <0>
- D - I - - 0x0173C0 0B:93B0: 33        .byte $33   ; <0>
- D - I - - 0x0173C1 0B:93B1: 33        .byte $33   ; <0>
- D - I - - 0x0173C2 0B:93B2: 33        .byte $33   ; <0>
- D - I - - 0x0173C3 0B:93B3: 33        .byte $33   ; <0>
- D - I - - 0x0173C4 0B:93B4: 15        .byte $15   ; <な>
- D - I - - 0x0173C5 0B:93B5: 16        .byte $16   ; <に>
- D - I - - 0x0173C6 0B:93B6: 15        .byte $15   ; <な>
- D - I - - 0x0173C7 0B:93B7: EA        .byte $EA
- D - I - - 0x0173C8 0B:93B8: EB        .byte $EB
- D - I - - 0x0173C9 0B:93B9: 16        .byte $16   ; <に>
- D - I - - 0x0173CA 0B:93BA: 15        .byte $15   ; <な>
- D - I - - 0x0173CB 0B:93BB: 16        .byte $16   ; <に>
- D - I - - 0x0173CC 0B:93BC: 14        .byte $14   ; <と>
- D - I - - 0x0173CD 0B:93BD: 14        .byte $14   ; <と>
- D - I - - 0x0173CE 0B:93BE: 14        .byte $14   ; <と>
- D - I - - 0x0173CF 0B:93BF: 14        .byte $14   ; <と>
- D - I - - 0x0173D0 0B:93C0: 14        .byte $14   ; <と>
- D - I - - 0x0173D1 0B:93C1: 14        .byte $14   ; <と>
- D - I - - 0x0173D2 0B:93C2: 14        .byte $14   ; <と>
- D - I - - 0x0173D3 0B:93C3: 14        .byte $14   ; <と>
- D - I - - 0x0173D4 0B:93C4: 14        .byte $14   ; <と>
- D - I - - 0x0173D5 0B:93C5: 14        .byte $14   ; <と>
- D - I - - 0x0173D6 0B:93C6: 14        .byte $14   ; <と>
- D - I - - 0x0173D7 0B:93C7: 14        .byte $14   ; <と>
- D - I - - 0x0173D8 0B:93C8: 14        .byte $14   ; <と>
- D - I - - 0x0173D9 0B:93C9: 14        .byte $14   ; <と>
- D - I - - 0x0173DA 0B:93CA: 14        .byte $14   ; <と>
- D - I - - 0x0173DB 0B:93CB: 14        .byte $14   ; <と>
- D - I - - 0x0173DC 0B:93CC: 33        .byte $33   ; <0>
- D - I - - 0x0173DD 0B:93CD: 33        .byte $33   ; <0>
- D - I - - 0x0173DE 0B:93CE: 2F        .byte $2F   ; <っ>
- D - I - - 0x0173DF 0B:93CF: 33        .byte $33   ; <0>
- D - I - - 0x0173E0 0B:93D0: ED        .byte $ED
- D - I - - 0x0173E1 0B:93D1: 33        .byte $33   ; <0>
- D - I - - 0x0173E2 0B:93D2: 34        .byte $34   ; <1>
- D - I - - 0x0173E3 0B:93D3: 33        .byte $33   ; <0>
- D - I - - 0x0173E4 0B:93D4: 15        .byte $15   ; <な>
- D - I - - 0x0173E5 0B:93D5: 16        .byte $16   ; <に>
- D - I - - 0x0173E6 0B:93D6: 15        .byte $15   ; <な>
- D - I - - 0x0173E7 0B:93D7: EA        .byte $EA
- D - I - - 0x0173E8 0B:93D8: EC        .byte $EC
- D - I - - 0x0173E9 0B:93D9: 16        .byte $16   ; <に>
- D - I - - 0x0173EA 0B:93DA: 15        .byte $15   ; <な>
- D - I - - 0x0173EB 0B:93DB: 16        .byte $16   ; <に>
- D - I - - 0x0173EC 0B:93DC: 14        .byte $14   ; <と>
- D - I - - 0x0173ED 0B:93DD: 14        .byte $14   ; <と>
- D - I - - 0x0173EE 0B:93DE: 14        .byte $14   ; <と>
- D - I - - 0x0173EF 0B:93DF: 14        .byte $14   ; <と>
- D - I - - 0x0173F0 0B:93E0: 14        .byte $14   ; <と>
- D - I - - 0x0173F1 0B:93E1: 14        .byte $14   ; <と>
- D - I - - 0x0173F2 0B:93E2: 14        .byte $14   ; <と>
- D - I - - 0x0173F3 0B:93E3: 14        .byte $14   ; <と>
- D - I - - 0x0173F4 0B:93E4: 15        .byte $15   ; <な>
- D - I - - 0x0173F5 0B:93E5: 15        .byte $15   ; <な>
- D - I - - 0x0173F6 0B:93E6: 69        .byte $69   ; <ル>
- D - I - - 0x0173F7 0B:93E7: 6A        .byte $6A   ; <レ>
- D - I - - 0x0173F8 0B:93E8: 6B        .byte $6B   ; <ロ>
- D - I - - 0x0173F9 0B:93E9: 6C        .byte $6C   ; <ワ>
- D - I - - 0x0173FA 0B:93EA: 15        .byte $15   ; <な>
- D - I - - 0x0173FB 0B:93EB: 15        .byte $15   ; <な>
- D - I - - 0x0173FC 0B:93EC: 15        .byte $15   ; <な>
- D - I - - 0x0173FD 0B:93ED: 15        .byte $15   ; <な>
- D - I - - 0x0173FE 0B:93EE: 70        .byte $70   ; <ャ>
- D - I - - 0x0173FF 0B:93EF: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x017400 0B:93F0: 6E        .byte $6E   ; <ン>
- D - I - - 0x017401 0B:93F1: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017402 0B:93F2: 15        .byte $15   ; <な>
- D - I - - 0x017403 0B:93F3: 15        .byte $15   ; <な>
- D - I - - 0x017404 0B:93F4: 15        .byte $15   ; <な>
- D - I - - 0x017405 0B:93F5: 15        .byte $15   ; <な>
- D - I - - 0x017406 0B:93F6: 70        .byte $70   ; <ャ>
- D - I - - 0x017407 0B:93F7: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x017408 0B:93F8: 6E        .byte $6E   ; <ン>
- D - I - - 0x017409 0B:93F9: 6F        .byte $6F   ; <ッ>
- D - I - - 0x01740A 0B:93FA: 15        .byte $15   ; <な>
- D - I - - 0x01740B 0B:93FB: 15        .byte $15   ; <な>
- D - I - - 0x01740C 0B:93FC: 15        .byte $15   ; <な>
- D - I - - 0x01740D 0B:93FD: 15        .byte $15   ; <な>
- D - I - - 0x01740E 0B:93FE: 15        .byte $15   ; <な>
- D - I - - 0x01740F 0B:93FF: 15        .byte $15   ; <な>
- D - I - - 0x017410 0B:9400: 15        .byte $15   ; <な>
- D - I - - 0x017411 0B:9401: 15        .byte $15   ; <な>
- D - I - - 0x017412 0B:9402: 15        .byte $15   ; <な>
- D - I - - 0x017413 0B:9403: 15        .byte $15   ; <な>
- D - I - - 0x017414 0B:9404: 15        .byte $15   ; <な>
- D - I - - 0x017415 0B:9405: 15        .byte $15   ; <な>
- D - I - - 0x017416 0B:9406: 61        .byte $61   ; <ム>
- D - I - - 0x017417 0B:9407: 62        .byte $62   ; <メ>
- D - I - - 0x017418 0B:9408: 63        .byte $63   ; <モ>
- D - I - - 0x017419 0B:9409: 64        .byte $64   ; <ヤ>
- D - I - - 0x01741A 0B:940A: 15        .byte $15   ; <な>
- D - I - - 0x01741B 0B:940B: 15        .byte $15   ; <な>
- D - I - - 0x01741C 0B:940C: 15        .byte $15   ; <な>
- D - I - - 0x01741D 0B:940D: 15        .byte $15   ; <な>
- D - I - - 0x01741E 0B:940E: 65        .byte $65   ; <ユ>
- D - I - - 0x01741F 0B:940F: 66        .byte $66   ; <ヨ>
- D - I - - 0x017420 0B:9410: 67        .byte $67   ; <ラ>
- D - I - - 0x017421 0B:9411: 68        .byte $68   ; <リ>
- D - I - - 0x017422 0B:9412: 15        .byte $15   ; <な>
- D - I - - 0x017423 0B:9413: 15        .byte $15   ; <な>
- D - I - - 0x017424 0B:9414: 15        .byte $15   ; <な>
- D - I - - 0x017425 0B:9415: 15        .byte $15   ; <な>
- D - I - - 0x017426 0B:9416: 65        .byte $65   ; <ユ>
- D - I - - 0x017427 0B:9417: 66        .byte $66   ; <ヨ>
- D - I - - 0x017428 0B:9418: 67        .byte $67   ; <ラ>
- D - I - - 0x017429 0B:9419: 68        .byte $68   ; <リ>
- D - I - - 0x01742A 0B:941A: 15        .byte $15   ; <な>
- D - I - - 0x01742B 0B:941B: 15        .byte $15   ; <な>
- D - I - - 0x01742C 0B:941C: 15        .byte $15   ; <な>
- D - I - - 0x01742D 0B:941D: 15        .byte $15   ; <な>
- D - I - - 0x01742E 0B:941E: 15        .byte $15   ; <な>
- D - I - - 0x01742F 0B:941F: 15        .byte $15   ; <な>
- D - I - - 0x017430 0B:9420: 15        .byte $15   ; <な>
- D - I - - 0x017431 0B:9421: 15        .byte $15   ; <な>
- D - I - - 0x017432 0B:9422: 15        .byte $15   ; <な>
- D - I - - 0x017433 0B:9423: 15        .byte $15   ; <な>
- D - I - - 0x017434 0B:9424: A2        .byte $A2   ; <ぐ>
- D - I - - 0x017435 0B:9425: 55        .byte $55   ; <ナ>
- D - I - - 0x017436 0B:9426: 55        .byte $55   ; <ナ>
- D - I - - 0x017437 0B:9427: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017438 0B:9428: BE        .byte $BE   ; <ダ>
- D - I - - 0x017439 0B:9429: 55        .byte $55   ; <ナ>
- D - I - - 0x01743A 0B:942A: 55        .byte $55   ; <ナ>
- D - I - - 0x01743B 0B:942B: BC        .byte $BC   ; <ゼ>
- D - I - - 0x01743C 0B:942C: 56        .byte $56   ; <ニ>
- D - I - - 0x01743D 0B:942D: 56        .byte $56   ; <ニ>
- D - I - - 0x01743E 0B:942E: 71        .byte $71   ; <ュ>
- D - I - - 0x01743F 0B:942F: 72        .byte $72   ; <ョ>
- D - I - - 0x017440 0B:9430: 56        .byte $56   ; <ニ>
- D - I - - 0x017441 0B:9431: 56        .byte $56   ; <ニ>
- D - I - - 0x017442 0B:9432: 9A        .byte $9A
- D - I - - 0x017443 0B:9433: 9B        .byte $9B
- D - I - - 0x017444 0B:9434: 97        .byte $97
- D - I - - 0x017445 0B:9435: 97        .byte $97
- D - I - - 0x017446 0B:9436: 97        .byte $97
- D - I - - 0x017447 0B:9437: 97        .byte $97
- D - I - - 0x017448 0B:9438: 97        .byte $97
- D - I - - 0x017449 0B:9439: 97        .byte $97
- D - I - - 0x01744A 0B:943A: 97        .byte $97
- D - I - - 0x01744B 0B:943B: 97        .byte $97
- D - I - - 0x01744C 0B:943C: 13        .byte $13   ; <て>
- D - I - - 0x01744D 0B:943D: 13        .byte $13   ; <て>
- D - I - - 0x01744E 0B:943E: 13        .byte $13   ; <て>
- D - I - - 0x01744F 0B:943F: 13        .byte $13   ; <て>
- D - I - - 0x017450 0B:9440: 13        .byte $13   ; <て>
- D - I - - 0x017451 0B:9441: 13        .byte $13   ; <て>
- D - I - - 0x017452 0B:9442: 13        .byte $13   ; <て>
- D - I - - 0x017453 0B:9443: 13        .byte $13   ; <て>
- D - I - - 0x017454 0B:9444: 15        .byte $15   ; <な>
- D - I - - 0x017455 0B:9445: 16        .byte $16   ; <に>
- D - I - - 0x017456 0B:9446: 15        .byte $15   ; <な>
- D - I - - 0x017457 0B:9447: 15        .byte $15   ; <な>
- D - I - - 0x017458 0B:9448: 15        .byte $15   ; <な>
- D - I - - 0x017459 0B:9449: 15        .byte $15   ; <な>
- D - I - - 0x01745A 0B:944A: 17        .byte $17   ; <ぬ>
- D - I - - 0x01745B 0B:944B: 15        .byte $15   ; <な>
- D - I - - 0x01745C 0B:944C: 49        .byte $49   ; <ケ>
- D - I - - 0x01745D 0B:944D: 4A        .byte $4A   ; <コ>
- D - I - - 0x01745E 0B:944E: 15        .byte $15   ; <な>
- D - I - - 0x01745F 0B:944F: 18        .byte $18   ; <ね>
- D - I - - 0x017460 0B:9450: 15        .byte $15   ; <な>
- D - I - - 0x017461 0B:9451: 15        .byte $15   ; <な>
- D - I - - 0x017462 0B:9452: 15        .byte $15   ; <な>
- D - I - - 0x017463 0B:9453: 15        .byte $15   ; <な>
- D - I - - 0x017464 0B:9454: 4C        .byte $4C   ; <シ>
- D - I - - 0x017465 0B:9455: 48        .byte $48   ; <ク>
- D - I - - 0x017466 0B:9456: 49        .byte $49   ; <ケ>
- D - I - - 0x017467 0B:9457: 4A        .byte $4A   ; <コ>
- D - I - - 0x017468 0B:9458: 15        .byte $15   ; <な>
- D - I - - 0x017469 0B:9459: 15        .byte $15   ; <な>
- D - I - - 0x01746A 0B:945A: 15        .byte $15   ; <な>
- D - I - - 0x01746B 0B:945B: 16        .byte $16   ; <に>
- D - I - - 0x01746C 0B:945C: 4B        .byte $4B   ; <サ>
- D - I - - 0x01746D 0B:945D: 4B        .byte $4B   ; <サ>
- D - I - - 0x01746E 0B:945E: 4B        .byte $4B   ; <サ>
- D - I - - 0x01746F 0B:945F: 46        .byte $46   ; <カ>
- D - I - - 0x017470 0B:9460: 47        .byte $47   ; <キ>
- D - I - - 0x017471 0B:9461: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017472 0B:9462: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017473 0B:9463: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017474 0B:9464: 15        .byte $15   ; <な>
- D - I - - 0x017475 0B:9465: 16        .byte $16   ; <に>
- D - I - - 0x017476 0B:9466: 15        .byte $15   ; <な>
- D - I - - 0x017477 0B:9467: 15        .byte $15   ; <な>
- D - I - - 0x017478 0B:9468: 15        .byte $15   ; <な>
- D - I - - 0x017479 0B:9469: 17        .byte $17   ; <ぬ>
- D - I - - 0x01747A 0B:946A: 15        .byte $15   ; <な>
- D - I - - 0x01747B 0B:946B: 15        .byte $15   ; <な>
- D - I - - 0x01747C 0B:946C: 15        .byte $15   ; <な>
- D - I - - 0x01747D 0B:946D: 15        .byte $15   ; <な>
- D - I - - 0x01747E 0B:946E: 18        .byte $18   ; <ね>
- D - I - - 0x01747F 0B:946F: 15        .byte $15   ; <な>
- D - I - - 0x017480 0B:9470: 15        .byte $15   ; <な>
- D - I - - 0x017481 0B:9471: 15        .byte $15   ; <な>
- D - I - - 0x017482 0B:9472: 15        .byte $15   ; <な>
- D - I - - 0x017483 0B:9473: 15        .byte $15   ; <な>
- D - I - - 0x017484 0B:9474: 16        .byte $16   ; <に>
- D - I - - 0x017485 0B:9475: 15        .byte $15   ; <な>
- D - I - - 0x017486 0B:9476: 15        .byte $15   ; <な>
- D - I - - 0x017487 0B:9477: 15        .byte $15   ; <な>
- D - I - - 0x017488 0B:9478: 18        .byte $18   ; <ね>
- D - I - - 0x017489 0B:9479: 15        .byte $15   ; <な>
- D - I - - 0x01748A 0B:947A: 15        .byte $15   ; <な>
- D - I - - 0x01748B 0B:947B: 16        .byte $16   ; <に>
- D - I - - 0x01748C 0B:947C: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01748D 0B:947D: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01748E 0B:947E: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01748F 0B:947F: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017490 0B:9480: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017491 0B:9481: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017492 0B:9482: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017493 0B:9483: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017494 0B:9484: 15        .byte $15   ; <な>
- D - I - - 0x017495 0B:9485: 17        .byte $17   ; <ぬ>
- D - I - - 0x017496 0B:9486: 15        .byte $15   ; <な>
- D - I - - 0x017497 0B:9487: 15        .byte $15   ; <な>
- D - I - - 0x017498 0B:9488: 15        .byte $15   ; <な>
- D - I - - 0x017499 0B:9489: 15        .byte $15   ; <な>
- D - I - - 0x01749A 0B:948A: 16        .byte $16   ; <に>
- D - I - - 0x01749B 0B:948B: 15        .byte $15   ; <な>
- D - I - - 0x01749C 0B:948C: 15        .byte $15   ; <な>
- D - I - - 0x01749D 0B:948D: 15        .byte $15   ; <な>
- D - I - - 0x01749E 0B:948E: 15        .byte $15   ; <な>
- D - I - - 0x01749F 0B:948F: 15        .byte $15   ; <な>
- D - I - - 0x0174A0 0B:9490: 18        .byte $18   ; <ね>
- D - I - - 0x0174A1 0B:9491: 15        .byte $15   ; <な>
- D - I - - 0x0174A2 0B:9492: 40        .byte $40   ; <「>
- D - I - - 0x0174A3 0B:9493: 41        .byte $41   ; <ア>
- D - I - - 0x0174A4 0B:9494: 15        .byte $15   ; <な>
- D - I - - 0x0174A5 0B:9495: 16        .byte $16   ; <に>
- D - I - - 0x0174A6 0B:9496: 15        .byte $15   ; <な>
- D - I - - 0x0174A7 0B:9497: 15        .byte $15   ; <な>
- D - I - - 0x0174A8 0B:9498: 40        .byte $40   ; <「>
- D - I - - 0x0174A9 0B:9499: 41        .byte $41   ; <ア>
- D - I - - 0x0174AA 0B:949A: 42        .byte $42   ; <イ>
- D - I - - 0x0174AB 0B:949B: 43        .byte $43   ; <ウ>
- D - I - - 0x0174AC 0B:949C: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0174AD 0B:949D: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0174AE 0B:949E: 3E        .byte $3E   ; <Jr>
- D - I - - 0x0174AF 0B:949F: 3F        .byte $3F   ; <•>
- D - I - - 0x0174B0 0B:94A0: 45        .byte $45   ; <オ>
- D - I - - 0x0174B1 0B:94A1: 44        .byte $44   ; <エ>
- D - I - - 0x0174B2 0B:94A2: 44        .byte $44   ; <エ>
- D - I - - 0x0174B3 0B:94A3: 44        .byte $44   ; <エ>
- D - I - - 0x0174B4 0B:94A4: 21        .byte $21   ; <む>
- D - I - - 0x0174B5 0B:94A5: 22        .byte $22   ; <め>
- D - I - - 0x0174B6 0B:94A6: 10        .byte $10   ; <た>
- D - I - - 0x0174B7 0B:94A7: 1B        .byte $1B   ; <ひ>
- D - I - - 0x0174B8 0B:94A8: 10        .byte $10   ; <た>
- D - I - - 0x0174B9 0B:94A9: 10        .byte $10   ; <た>
- D - I - - 0x0174BA 0B:94AA: 10        .byte $10   ; <た>
- D - I - - 0x0174BB 0B:94AB: 10        .byte $10   ; <た>
- D - I - - 0x0174BC 0B:94AC: 2A        .byte $2A   ; <れ>
- D - I - - 0x0174BD 0B:94AD: 23        .byte $23   ; <も>
- D - I - - 0x0174BE 0B:94AE: 14        .byte $14   ; <と>
- D - I - - 0x0174BF 0B:94AF: 13        .byte $13   ; <て>
- D - I - - 0x0174C0 0B:94B0: 14        .byte $14   ; <と>
- D - I - - 0x0174C1 0B:94B1: 13        .byte $13   ; <て>
- D - I - - 0x0174C2 0B:94B2: 14        .byte $14   ; <と>
- D - I - - 0x0174C3 0B:94B3: 13        .byte $13   ; <て>
- D - I - - 0x0174C4 0B:94B4: 2B        .byte $2B   ; <ろ>
- D - I - - 0x0174C5 0B:94B5: 24        .byte $24   ; <や>
- D - I - - 0x0174C6 0B:94B6: 28        .byte $28   ; <り>
- D - I - - 0x0174C7 0B:94B7: 27        .byte $27   ; <ら>
- D - I - - 0x0174C8 0B:94B8: 27        .byte $27   ; <ら>
- D - I - - 0x0174C9 0B:94B9: 27        .byte $27   ; <ら>
- D - I - - 0x0174CA 0B:94BA: 27        .byte $27   ; <ら>
- D - I - - 0x0174CB 0B:94BB: 27        .byte $27   ; <ら>
- D - I - - 0x0174CC 0B:94BC: 2C        .byte $2C   ; <わ>
- D - I - - 0x0174CD 0B:94BD: 25        .byte $25   ; <ゆ>
- D - I - - 0x0174CE 0B:94BE: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174CF 0B:94BF: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174D0 0B:94C0: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174D1 0B:94C1: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174D2 0B:94C2: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174D3 0B:94C3: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174D4 0B:94C4: 3A        .byte $3A   ; <7>
- - - - - - 0x0174D5 0B:94C5: 3B        .byte $3B   ; <8>
- - - - - - 0x0174D6 0B:94C6: 15        .byte $15   ; <な>
- - - - - - 0x0174D7 0B:94C7: 15        .byte $15   ; <な>
- - - - - - 0x0174D8 0B:94C8: 15        .byte $15   ; <な>
- - - - - - 0x0174D9 0B:94C9: 15        .byte $15   ; <な>
- - - - - - 0x0174DA 0B:94CA: 15        .byte $15   ; <な>
- - - - - - 0x0174DB 0B:94CB: 15        .byte $15   ; <な>
- - - - - - 0x0174DC 0B:94CC: 38        .byte $38   ; <5>
- - - - - - 0x0174DD 0B:94CD: 39        .byte $39   ; <6>
- - - - - - 0x0174DE 0B:94CE: 10        .byte $10   ; <た>
- - - - - - 0x0174DF 0B:94CF: 10        .byte $10   ; <た>
- - - - - - 0x0174E0 0B:94D0: 10        .byte $10   ; <た>
- - - - - - 0x0174E1 0B:94D1: 10        .byte $10   ; <た>
- - - - - - 0x0174E2 0B:94D2: 29        .byte $29   ; <る>
- - - - - - 0x0174E3 0B:94D3: 10        .byte $10   ; <た>
- - - - - - 0x0174E4 0B:94D4: 2A        .byte $2A   ; <れ>
- - - - - - 0x0174E5 0B:94D5: 23        .byte $23   ; <も>
- - - - - - 0x0174E6 0B:94D6: 14        .byte $14   ; <と>
- - - - - - 0x0174E7 0B:94D7: 13        .byte $13   ; <て>
- - - - - - 0x0174E8 0B:94D8: 14        .byte $14   ; <と>
- - - - - - 0x0174E9 0B:94D9: 13        .byte $13   ; <て>
- - - - - - 0x0174EA 0B:94DA: 14        .byte $14   ; <と>
- - - - - - 0x0174EB 0B:94DB: 13        .byte $13   ; <て>
- - - - - - 0x0174EC 0B:94DC: 35        .byte $35   ; <2>
- - - - - - 0x0174ED 0B:94DD: 36        .byte $36   ; <3>
- - - - - - 0x0174EE 0B:94DE: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174EF 0B:94DF: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174F0 0B:94E0: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174F1 0B:94E1: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174F2 0B:94E2: 1C        .byte $1C   ; <ふ>
- - - - - - 0x0174F3 0B:94E3: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0174F4 0B:94E4: 10        .byte $10   ; <た>
- D - I - - 0x0174F5 0B:94E5: 29        .byte $29   ; <る>
- D - I - - 0x0174F6 0B:94E6: 10        .byte $10   ; <た>
- D - I - - 0x0174F7 0B:94E7: 10        .byte $10   ; <た>
- D - I - - 0x0174F8 0B:94E8: 10        .byte $10   ; <た>
- D - I - - 0x0174F9 0B:94E9: 10        .byte $10   ; <た>
- D - I - - 0x0174FA 0B:94EA: 2D        .byte $2D   ; <を>
- D - I - - 0x0174FB 0B:94EB: 2E        .byte $2E   ; <ん>
- D - I - - 0x0174FC 0B:94EC: 14        .byte $14   ; <と>
- D - I - - 0x0174FD 0B:94ED: 13        .byte $13   ; <て>
- D - I - - 0x0174FE 0B:94EE: 14        .byte $14   ; <と>
- D - I - - 0x0174FF 0B:94EF: 13        .byte $13   ; <て>
- D - I - - 0x017500 0B:94F0: 14        .byte $14   ; <と>
- D - I - - 0x017501 0B:94F1: 13        .byte $13   ; <て>
- D - I - - 0x017502 0B:94F2: 2F        .byte $2F   ; <っ>
- D - I - - 0x017503 0B:94F3: 2A        .byte $2A   ; <れ>
- D - I - - 0x017504 0B:94F4: 27        .byte $27   ; <ら>
- D - I - - 0x017505 0B:94F5: 27        .byte $27   ; <ら>
- D - I - - 0x017506 0B:94F6: 27        .byte $27   ; <ら>
- D - I - - 0x017507 0B:94F7: 27        .byte $27   ; <ら>
- D - I - - 0x017508 0B:94F8: 27        .byte $27   ; <ら>
- D - I - - 0x017509 0B:94F9: 26        .byte $26   ; <よ>
- D - I - - 0x01750A 0B:94FA: 30        .byte $30   ; <ゃ>
- D - I - - 0x01750B 0B:94FB: 2B        .byte $2B   ; <ろ>
- D - I - - 0x01750C 0B:94FC: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01750D 0B:94FD: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01750E 0B:94FE: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01750F 0B:94FF: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017510 0B:9500: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017511 0B:9501: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017512 0B:9502: 31        .byte $31   ; <ゅ>
- D - I - - 0x017513 0B:9503: 2C        .byte $2C   ; <わ>
- - - - - - 0x017514 0B:9504: 15        .byte $15   ; <な>
- - - - - - 0x017515 0B:9505: 16        .byte $16   ; <に>
- - - - - - 0x017516 0B:9506: 15        .byte $15   ; <な>
- - - - - - 0x017517 0B:9507: 15        .byte $15   ; <な>
- - - - - - 0x017518 0B:9508: 15        .byte $15   ; <な>
- - - - - - 0x017519 0B:9509: 15        .byte $15   ; <な>
- - - - - - 0x01751A 0B:950A: 3C        .byte $3C   ; <9>
- - - - - - 0x01751B 0B:950B: 3D        .byte $3D   ; <+>
- - - - - - 0x01751C 0B:950C: 10        .byte $10   ; <た>
- - - - - - 0x01751D 0B:950D: 10        .byte $10   ; <た>
- - - - - - 0x01751E 0B:950E: 10        .byte $10   ; <た>
- - - - - - 0x01751F 0B:950F: 10        .byte $10   ; <た>
- - - - - - 0x017520 0B:9510: 10        .byte $10   ; <た>
- - - - - - 0x017521 0B:9511: 10        .byte $10   ; <た>
- - - - - - 0x017522 0B:9512: 37        .byte $37   ; <4>
- - - - - - 0x017523 0B:9513: 38        .byte $38   ; <5>
- - - - - - 0x017524 0B:9514: 13        .byte $13   ; <て>
- - - - - - 0x017525 0B:9515: 14        .byte $14   ; <と>
- - - - - - 0x017526 0B:9516: 13        .byte $13   ; <て>
- - - - - - 0x017527 0B:9517: 14        .byte $14   ; <と>
- - - - - - 0x017528 0B:9518: 13        .byte $13   ; <て>
- - - - - - 0x017529 0B:9519: 14        .byte $14   ; <と>
- - - - - - 0x01752A 0B:951A: 2F        .byte $2F   ; <っ>
- - - - - - 0x01752B 0B:951B: 2A        .byte $2A   ; <れ>
- - - - - - 0x01752C 0B:951C: 1C        .byte $1C   ; <ふ>
- - - - - - 0x01752D 0B:951D: 1C        .byte $1C   ; <ふ>
- - - - - - 0x01752E 0B:951E: 1C        .byte $1C   ; <ふ>
- - - - - - 0x01752F 0B:951F: 1C        .byte $1C   ; <ふ>
- - - - - - 0x017530 0B:9520: 1C        .byte $1C   ; <ふ>
- - - - - - 0x017531 0B:9521: 1C        .byte $1C   ; <ふ>
- - - - - - 0x017532 0B:9522: 34        .byte $34   ; <1>
- - - - - - 0x017533 0B:9523: 35        .byte $35   ; <2>
- D - I - - 0x017534 0B:9524: 10        .byte $10   ; <た>
- D - I - - 0x017535 0B:9525: 1B        .byte $1B   ; <ひ>
- D - I - - 0x017536 0B:9526: 10        .byte $10   ; <た>
- D - I - - 0x017537 0B:9527: 10        .byte $10   ; <た>
- D - I - - 0x017538 0B:9528: 10        .byte $10   ; <た>
- D - I - - 0x017539 0B:9529: 29        .byte $29   ; <る>
- D - I - - 0x01753A 0B:952A: 10        .byte $10   ; <た>
- D - I - - 0x01753B 0B:952B: 10        .byte $10   ; <た>
- D - I - - 0x01753C 0B:952C: 14        .byte $14   ; <と>
- D - I - - 0x01753D 0B:952D: 13        .byte $13   ; <て>
- D - I - - 0x01753E 0B:952E: 14        .byte $14   ; <と>
- D - I - - 0x01753F 0B:952F: 13        .byte $13   ; <て>
- D - I - - 0x017540 0B:9530: 14        .byte $14   ; <と>
- D - I - - 0x017541 0B:9531: 13        .byte $13   ; <て>
- D - I - - 0x017542 0B:9532: 14        .byte $14   ; <と>
- D - I - - 0x017543 0B:9533: 13        .byte $13   ; <て>
- D - I - - 0x017544 0B:9534: C4        .byte $C4   ; <ビ>
- D - I - - 0x017545 0B:9535: C4        .byte $C4   ; <ビ>
- D - I - - 0x017546 0B:9536: C4        .byte $C4   ; <ビ>
- D - I - - 0x017547 0B:9537: C4        .byte $C4   ; <ビ>
- D - I - - 0x017548 0B:9538: C4        .byte $C4   ; <ビ>
- D - I - - 0x017549 0B:9539: C4        .byte $C4   ; <ビ>
- D - I - - 0x01754A 0B:953A: C4        .byte $C4   ; <ビ>
- D - I - - 0x01754B 0B:953B: C4        .byte $C4   ; <ビ>
- D - I - - 0x01754C 0B:953C: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01754D 0B:953D: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01754E 0B:953E: 1C        .byte $1C   ; <ふ>
- D - I - - 0x01754F 0B:953F: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017550 0B:9540: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017551 0B:9541: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017552 0B:9542: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017553 0B:9543: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017554 0B:9544: F7        .byte $F7
- D - I - - 0x017555 0B:9545: F7        .byte $F7
- D - I - - 0x017556 0B:9546: F7        .byte $F7
- D - I - - 0x017557 0B:9547: F7        .byte $F7
- D - I - - 0x017558 0B:9548: F7        .byte $F7
- D - I - - 0x017559 0B:9549: F7        .byte $F7
- D - I - - 0x01755A 0B:954A: F7        .byte $F7
- D - I - - 0x01755B 0B:954B: F7        .byte $F7
- D - I - - 0x01755C 0B:954C: F7        .byte $F7
- D - I - - 0x01755D 0B:954D: F7        .byte $F7
- D - I - - 0x01755E 0B:954E: F7        .byte $F7
- D - I - - 0x01755F 0B:954F: F7        .byte $F7
- D - I - - 0x017560 0B:9550: F7        .byte $F7
- D - I - - 0x017561 0B:9551: F7        .byte $F7
- D - I - - 0x017562 0B:9552: F7        .byte $F7
- D - I - - 0x017563 0B:9553: F7        .byte $F7
- D - I - - 0x017564 0B:9554: F7        .byte $F7
- D - I - - 0x017565 0B:9555: F7        .byte $F7
- D - I - - 0x017566 0B:9556: F7        .byte $F7
- D - I - - 0x017567 0B:9557: 32        .byte $32   ; <ょ>
- D - I - - 0x017568 0B:9558: 33        .byte $33   ; <0>
- D - I - - 0x017569 0B:9559: F7        .byte $F7
- D - I - - 0x01756A 0B:955A: F7        .byte $F7
- D - I - - 0x01756B 0B:955B: F7        .byte $F7
- D - I - - 0x01756C 0B:955C: FE        .byte $FE
- D - I - - 0x01756D 0B:955D: FE        .byte $FE
- D - I - - 0x01756E 0B:955E: FE        .byte $FE
- D - I - - 0x01756F 0B:955F: FE        .byte $FE
- D - I - - 0x017570 0B:9560: FE        .byte $FE
- D - I - - 0x017571 0B:9561: FE        .byte $FE
- D - I - - 0x017572 0B:9562: FE        .byte $FE
- D - I - - 0x017573 0B:9563: FE        .byte $FE
- D - I - - 0x017574 0B:9564: C3        .byte $C3   ; <バ>
- D - I - - 0x017575 0B:9565: C3        .byte $C3   ; <バ>
- D - I - - 0x017576 0B:9566: C3        .byte $C3   ; <バ>
- D - I - - 0x017577 0B:9567: 48        .byte $48   ; <ク>
- D - I - - 0x017578 0B:9568: C3        .byte $C3   ; <バ>
- D - I - - 0x017579 0B:9569: C3        .byte $C3   ; <バ>
- D - I - - 0x01757A 0B:956A: 48        .byte $48   ; <ク>
- D - I - - 0x01757B 0B:956B: C3        .byte $C3   ; <バ>
- D - I - - 0x01757C 0B:956C: 49        .byte $49   ; <ケ>
- D - I - - 0x01757D 0B:956D: 4A        .byte $4A   ; <コ>
- D - I - - 0x01757E 0B:956E: C3        .byte $C3   ; <バ>
- D - I - - 0x01757F 0B:956F: C3        .byte $C3   ; <バ>
- D - I - - 0x017580 0B:9570: 48        .byte $48   ; <ク>
- D - I - - 0x017581 0B:9571: C3        .byte $C3   ; <バ>
- D - I - - 0x017582 0B:9572: C3        .byte $C3   ; <バ>
- D - I - - 0x017583 0B:9573: C3        .byte $C3   ; <バ>
- D - I - - 0x017584 0B:9574: 00        .byte $00
- D - I - - 0x017585 0B:9575: 00        .byte $00
- D - I - - 0x017586 0B:9576: 00        .byte $00
- D - I - - 0x017587 0B:9577: 00        .byte $00
- D - I - - 0x017588 0B:9578: 00        .byte $00
- D - I - - 0x017589 0B:9579: 00        .byte $00
- D - I - - 0x01758A 0B:957A: 00        .byte $00
- D - I - - 0x01758B 0B:957B: 00        .byte $00
- D - I - - 0x01758C 0B:957C: 84        .byte $84   ; <D>
- D - I - - 0x01758D 0B:957D: 83        .byte $83   ; <C>
- D - I - - 0x01758E 0B:957E: 84        .byte $84   ; <D>
- D - I - - 0x01758F 0B:957F: 83        .byte $83   ; <C>
- D - I - - 0x017590 0B:9580: 84        .byte $84   ; <D>
- D - I - - 0x017591 0B:9581: 83        .byte $83   ; <C>
- D - I - - 0x017592 0B:9582: 84        .byte $84   ; <D>
- D - I - - 0x017593 0B:9583: 83        .byte $83   ; <C>
- D - I - - 0x017594 0B:9584: 49        .byte $49   ; <ケ>
- D - I - - 0x017595 0B:9585: 4A        .byte $4A   ; <コ>
- D - I - - 0x017596 0B:9586: C3        .byte $C3   ; <バ>
- D - I - - 0x017597 0B:9587: C3        .byte $C3   ; <バ>
- D - I - - 0x017598 0B:9588: 48        .byte $48   ; <ク>
- D - I - - 0x017599 0B:9589: C3        .byte $C3   ; <バ>
- D - I - - 0x01759A 0B:958A: C3        .byte $C3   ; <バ>
- D - I - - 0x01759B 0B:958B: C3        .byte $C3   ; <バ>
- D - I - - 0x01759C 0B:958C: C3        .byte $C3   ; <バ>
- D - I - - 0x01759D 0B:958D: C3        .byte $C3   ; <バ>
- D - I - - 0x01759E 0B:958E: C3        .byte $C3   ; <バ>
- D - I - - 0x01759F 0B:958F: 48        .byte $48   ; <ク>
- D - I - - 0x0175A0 0B:9590: C3        .byte $C3   ; <バ>
- D - I - - 0x0175A1 0B:9591: C3        .byte $C3   ; <バ>
- D - I - - 0x0175A2 0B:9592: C3        .byte $C3   ; <バ>
- D - I - - 0x0175A3 0B:9593: 48        .byte $48   ; <ク>
- D - I - - 0x0175A4 0B:9594: 7F        .byte $7F   ; <,>
- D - I - - 0x0175A5 0B:9595: 80        .byte $80
- D - I - - 0x0175A6 0B:9596: 7F        .byte $7F   ; <,>
- D - I - - 0x0175A7 0B:9597: 80        .byte $80
- D - I - - 0x0175A8 0B:9598: 7F        .byte $7F   ; <,>
- D - I - - 0x0175A9 0B:9599: 80        .byte $80
- D - I - - 0x0175AA 0B:959A: 7F        .byte $7F   ; <,>
- D - I - - 0x0175AB 0B:959B: 80        .byte $80
- D - I - - 0x0175AC 0B:959C: 81        .byte $81   ; <A>
- D - I - - 0x0175AD 0B:959D: 82        .byte $82   ; <B>
- D - I - - 0x0175AE 0B:959E: 81        .byte $81   ; <A>
- D - I - - 0x0175AF 0B:959F: 82        .byte $82   ; <B>
- D - I - - 0x0175B0 0B:95A0: 81        .byte $81   ; <A>
- D - I - - 0x0175B1 0B:95A1: 82        .byte $82   ; <B>
- D - I - - 0x0175B2 0B:95A2: 81        .byte $81   ; <A>
- D - I - - 0x0175B3 0B:95A3: 82        .byte $82   ; <B>
- D - I - - 0x0175B4 0B:95A4: C3        .byte $C3   ; <バ>
- D - I - - 0x0175B5 0B:95A5: C3        .byte $C3   ; <バ>
- D - I - - 0x0175B6 0B:95A6: C3        .byte $C3   ; <バ>
- D - I - - 0x0175B7 0B:95A7: 49        .byte $49   ; <ケ>
- D - I - - 0x0175B8 0B:95A8: 4A        .byte $4A   ; <コ>
- D - I - - 0x0175B9 0B:95A9: C3        .byte $C3   ; <バ>
- D - I - - 0x0175BA 0B:95AA: 4B        .byte $4B   ; <サ>
- D - I - - 0x0175BB 0B:95AB: C3        .byte $C3   ; <バ>
- D - I - - 0x0175BC 0B:95AC: 4A        .byte $4A   ; <コ>
- D - I - - 0x0175BD 0B:95AD: C3        .byte $C3   ; <バ>
- D - I - - 0x0175BE 0B:95AE: 4B        .byte $4B   ; <サ>
- D - I - - 0x0175BF 0B:95AF: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C0 0B:95B0: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C1 0B:95B1: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C2 0B:95B2: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C3 0B:95B3: 49        .byte $49   ; <ケ>
- D - I - - 0x0175C4 0B:95B4: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C5 0B:95B5: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C6 0B:95B6: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C7 0B:95B7: C3        .byte $C3   ; <バ>
- D - I - - 0x0175C8 0B:95B8: 49        .byte $49   ; <ケ>
- D - I - - 0x0175C9 0B:95B9: 4A        .byte $4A   ; <コ>
- D - I - - 0x0175CA 0B:95BA: C3        .byte $C3   ; <バ>
- D - I - - 0x0175CB 0B:95BB: C3        .byte $C3   ; <バ>
- D - I - - 0x0175CC 0B:95BC: C3        .byte $C3   ; <バ>
- D - I - - 0x0175CD 0B:95BD: 4B        .byte $4B   ; <サ>
- D - I - - 0x0175CE 0B:95BE: C3        .byte $C3   ; <バ>
- D - I - - 0x0175CF 0B:95BF: C3        .byte $C3   ; <バ>
- D - I - - 0x0175D0 0B:95C0: C3        .byte $C3   ; <バ>
- D - I - - 0x0175D1 0B:95C1: C3        .byte $C3   ; <バ>
- D - I - - 0x0175D2 0B:95C2: 49        .byte $49   ; <ケ>
- D - I - - 0x0175D3 0B:95C3: 4A        .byte $4A   ; <コ>
- D - I - - 0x0175D4 0B:95C4: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175D5 0B:95C5: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175D6 0B:95C6: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175D7 0B:95C7: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175D8 0B:95C8: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175D9 0B:95C9: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175DA 0B:95CA: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175DB 0B:95CB: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175DC 0B:95CC: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175DD 0B:95CD: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175DE 0B:95CE: 01        .byte $01   ; <あ>
- D - I - - 0x0175DF 0B:95CF: 02        .byte $02   ; <い>
- D - I - - 0x0175E0 0B:95D0: 03        .byte $03   ; <う>
- D - I - - 0x0175E1 0B:95D1: 03        .byte $03   ; <う>
- D - I - - 0x0175E2 0B:95D2: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175E3 0B:95D3: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175E4 0B:95D4: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175E5 0B:95D5: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175E6 0B:95D6: 01        .byte $01   ; <あ>
- D - I - - 0x0175E7 0B:95D7: 02        .byte $02   ; <い>
- D - I - - 0x0175E8 0B:95D8: 03        .byte $03   ; <う>
- D - I - - 0x0175E9 0B:95D9: 03        .byte $03   ; <う>
- D - I - - 0x0175EA 0B:95DA: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175EB 0B:95DB: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175EC 0B:95DC: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175ED 0B:95DD: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175EE 0B:95DE: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175EF 0B:95DF: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F0 0B:95E0: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F1 0B:95E1: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F2 0B:95E2: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F3 0B:95E3: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F4 0B:95E4: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F5 0B:95E5: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F6 0B:95E6: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F7 0B:95E7: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F8 0B:95E8: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175F9 0B:95E9: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175FA 0B:95EA: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175FB 0B:95EB: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175FC 0B:95EC: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175FD 0B:95ED: C4        .byte $C4   ; <ビ>
- D - I - - 0x0175FE 0B:95EE: 04        .byte $04   ; <え>
- D - I - - 0x0175FF 0B:95EF: 04        .byte $04   ; <え>
- D - I - - 0x017600 0B:95F0: 05        .byte $05   ; <お>
- D - I - - 0x017601 0B:95F1: 01        .byte $01   ; <あ>
- D - I - - 0x017602 0B:95F2: C4        .byte $C4   ; <ビ>
- D - I - - 0x017603 0B:95F3: C4        .byte $C4   ; <ビ>
- D - I - - 0x017604 0B:95F4: C4        .byte $C4   ; <ビ>
- D - I - - 0x017605 0B:95F5: C4        .byte $C4   ; <ビ>
- D - I - - 0x017606 0B:95F6: 04        .byte $04   ; <え>
- D - I - - 0x017607 0B:95F7: 04        .byte $04   ; <え>
- D - I - - 0x017608 0B:95F8: 05        .byte $05   ; <お>
- D - I - - 0x017609 0B:95F9: 01        .byte $01   ; <あ>
- D - I - - 0x01760A 0B:95FA: C4        .byte $C4   ; <ビ>
- D - I - - 0x01760B 0B:95FB: C4        .byte $C4   ; <ビ>
- D - I - - 0x01760C 0B:95FC: C4        .byte $C4   ; <ビ>
- D - I - - 0x01760D 0B:95FD: C4        .byte $C4   ; <ビ>
- D - I - - 0x01760E 0B:95FE: C4        .byte $C4   ; <ビ>
- D - I - - 0x01760F 0B:95FF: C4        .byte $C4   ; <ビ>
- D - I - - 0x017610 0B:9600: C4        .byte $C4   ; <ビ>
- D - I - - 0x017611 0B:9601: C4        .byte $C4   ; <ビ>
- D - I - - 0x017612 0B:9602: C4        .byte $C4   ; <ビ>
- D - I - - 0x017613 0B:9603: C4        .byte $C4   ; <ビ>
- D - I - - 0x017614 0B:9604: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017615 0B:9605: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017616 0B:9606: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017617 0B:9607: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017618 0B:9608: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017619 0B:9609: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761A 0B:960A: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761B 0B:960B: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761C 0B:960C: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761D 0B:960D: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761E 0B:960E: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01761F 0B:960F: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017620 0B:9610: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017621 0B:9611: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017622 0B:9612: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017623 0B:9613: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017624 0B:9614: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017625 0B:9615: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017626 0B:9616: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017627 0B:9617: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017628 0B:9618: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017629 0B:9619: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762A 0B:961A: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762B 0B:961B: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762C 0B:961C: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762D 0B:961D: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762E 0B:961E: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01762F 0B:961F: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017630 0B:9620: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017631 0B:9621: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017632 0B:9622: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017633 0B:9623: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017634 0B:9624: 15        .byte $15   ; <な>
- D - I - - 0x017635 0B:9625: 16        .byte $16   ; <に>
- D - I - - 0x017636 0B:9626: 15        .byte $15   ; <な>
- D - I - - 0x017637 0B:9627: 15        .byte $15   ; <な>
- D - I - - 0x017638 0B:9628: 1A        .byte $1A   ; <は>
- D - I - - 0x017639 0B:9629: 16        .byte $16   ; <に>
- D - I - - 0x01763A 0B:962A: 15        .byte $15   ; <な>
- D - I - - 0x01763B 0B:962B: 15        .byte $15   ; <な>
- D - I - - 0x01763C 0B:962C: AD        .byte $AD   ; <で>
- D - I - - 0x01763D 0B:962D: AD        .byte $AD   ; <で>
- D - I - - 0x01763E 0B:962E: AD        .byte $AD   ; <で>
- D - I - - 0x01763F 0B:962F: AD        .byte $AD   ; <で>
- D - I - - 0x017640 0B:9630: AD        .byte $AD   ; <で>
- D - I - - 0x017641 0B:9631: AD        .byte $AD   ; <で>
- D - I - - 0x017642 0B:9632: AD        .byte $AD   ; <で>
- D - I - - 0x017643 0B:9633: AD        .byte $AD   ; <で>
- D - I - - 0x017644 0B:9634: AE        .byte $AE   ; <ど>
- D - I - - 0x017645 0B:9635: AE        .byte $AE   ; <ど>
- D - I - - 0x017646 0B:9636: AE        .byte $AE   ; <ど>
- D - I - - 0x017647 0B:9637: AE        .byte $AE   ; <ど>
- D - I - - 0x017648 0B:9638: AE        .byte $AE   ; <ど>
- D - I - - 0x017649 0B:9639: AE        .byte $AE   ; <ど>
- D - I - - 0x01764A 0B:963A: AE        .byte $AE   ; <ど>
- D - I - - 0x01764B 0B:963B: AE        .byte $AE   ; <ど>
- D - I - - 0x01764C 0B:963C: AF        .byte $AF   ; <ば>
- D - I - - 0x01764D 0B:963D: AF        .byte $AF   ; <ば>
- D - I - - 0x01764E 0B:963E: AF        .byte $AF   ; <ば>
- D - I - - 0x01764F 0B:963F: AF        .byte $AF   ; <ば>
- D - I - - 0x017650 0B:9640: AF        .byte $AF   ; <ば>
- D - I - - 0x017651 0B:9641: AF        .byte $AF   ; <ば>
- D - I - - 0x017652 0B:9642: AF        .byte $AF   ; <ば>
- D - I - - 0x017653 0B:9643: AF        .byte $AF   ; <ば>
- D - I - - 0x017654 0B:9644: 16        .byte $16   ; <に>
- D - I - - 0x017655 0B:9645: 17        .byte $17   ; <ぬ>
- D - I - - 0x017656 0B:9646: 18        .byte $18   ; <ね>
- D - I - - 0x017657 0B:9647: 17        .byte $17   ; <ぬ>
- D - I - - 0x017658 0B:9648: 16        .byte $16   ; <に>
- D - I - - 0x017659 0B:9649: 15        .byte $15   ; <な>
- D - I - - 0x01765A 0B:964A: 43        .byte $43   ; <ウ>
- D - I - - 0x01765B 0B:964B: 15        .byte $15   ; <な>
- D - I - - 0x01765C 0B:964C: 26        .byte $26   ; <よ>
- D - I - - 0x01765D 0B:964D: FD        .byte $FD
- D - I - - 0x01765E 0B:964E: 27        .byte $27   ; <ら>
- D - I - - 0x01765F 0B:964F: 19        .byte $19   ; <の>
- D - I - - 0x017660 0B:9650: 1A        .byte $1A   ; <は>
- D - I - - 0x017661 0B:9651: 19        .byte $19   ; <の>
- D - I - - 0x017662 0B:9652: 1A        .byte $1A   ; <は>
- D - I - - 0x017663 0B:9653: 19        .byte $19   ; <の>
- D - I - - 0x017664 0B:9654: 21        .byte $21   ; <む>
- D - I - - 0x017665 0B:9655: 21        .byte $21   ; <む>
- D - I - - 0x017666 0B:9656: 22        .byte $22   ; <め>
- D - I - - 0x017667 0B:9657: 54        .byte $54   ; <ト>
- D - I - - 0x017668 0B:9658: 6C        .byte $6C   ; <ワ>
- D - I - - 0x017669 0B:9659: 4D        .byte $4D   ; <ス>
- D - I - - 0x01766A 0B:965A: 6A        .byte $6A   ; <レ>
- D - I - - 0x01766B 0B:965B: 6B        .byte $6B   ; <ロ>
- D - I - - 0x01766C 0B:965C: 69        .byte $69   ; <ル>
- D - I - - 0x01766D 0B:965D: 69        .byte $69   ; <ル>
- D - I - - 0x01766E 0B:965E: 69        .byte $69   ; <ル>
- D - I - - 0x01766F 0B:965F: 69        .byte $69   ; <ル>
- D - I - - 0x017670 0B:9660: 69        .byte $69   ; <ル>
- D - I - - 0x017671 0B:9661: 69        .byte $69   ; <ル>
- D - I - - 0x017672 0B:9662: 69        .byte $69   ; <ル>
- D - I - - 0x017673 0B:9663: 69        .byte $69   ; <ル>
- D - I - - 0x017674 0B:9664: C3        .byte $C3   ; <バ>
- D - I - - 0x017675 0B:9665: C3        .byte $C3   ; <バ>
- D - I - - 0x017676 0B:9666: C3        .byte $C3   ; <バ>
- D - I - - 0x017677 0B:9667: C3        .byte $C3   ; <バ>
- D - I - - 0x017678 0B:9668: 48        .byte $48   ; <ク>
- D - I - - 0x017679 0B:9669: C3        .byte $C3   ; <バ>
- D - I - - 0x01767A 0B:966A: C3        .byte $C3   ; <バ>
- D - I - - 0x01767B 0B:966B: C3        .byte $C3   ; <バ>
- D - I - - 0x01767C 0B:966C: 4B        .byte $4B   ; <サ>
- D - I - - 0x01767D 0B:966D: C3        .byte $C3   ; <バ>
- D - I - - 0x01767E 0B:966E: C3        .byte $C3   ; <バ>
- D - I - - 0x01767F 0B:966F: C3        .byte $C3   ; <バ>
- D - I - - 0x017680 0B:9670: C3        .byte $C3   ; <バ>
- D - I - - 0x017681 0B:9671: C3        .byte $C3   ; <バ>
- D - I - - 0x017682 0B:9672: C3        .byte $C3   ; <バ>
- D - I - - 0x017683 0B:9673: C3        .byte $C3   ; <バ>
- D - I - - 0x017684 0B:9674: C3        .byte $C3   ; <バ>
- D - I - - 0x017685 0B:9675: C3        .byte $C3   ; <バ>
- D - I - - 0x017686 0B:9676: 4C        .byte $4C   ; <シ>
- D - I - - 0x017687 0B:9677: C3        .byte $C3   ; <バ>
- D - I - - 0x017688 0B:9678: C3        .byte $C3   ; <バ>
- D - I - - 0x017689 0B:9679: 49        .byte $49   ; <ケ>
- D - I - - 0x01768A 0B:967A: 4A        .byte $4A   ; <コ>
- D - I - - 0x01768B 0B:967B: C3        .byte $C3   ; <バ>
- D - I - - 0x01768C 0B:967C: C3        .byte $C3   ; <バ>
- D - I - - 0x01768D 0B:967D: C3        .byte $C3   ; <バ>
- D - I - - 0x01768E 0B:967E: C3        .byte $C3   ; <バ>
- D - I - - 0x01768F 0B:967F: C3        .byte $C3   ; <バ>
- D - I - - 0x017690 0B:9680: C3        .byte $C3   ; <バ>
- D - I - - 0x017691 0B:9681: C3        .byte $C3   ; <バ>
- D - I - - 0x017692 0B:9682: C3        .byte $C3   ; <バ>
- D - I - - 0x017693 0B:9683: C3        .byte $C3   ; <バ>
- D - I - - 0x017694 0B:9684: 15        .byte $15   ; <な>
- D - I - - 0x017695 0B:9685: 43        .byte $43   ; <ウ>
- D - I - - 0x017696 0B:9686: 15        .byte $15   ; <な>
- D - I - - 0x017697 0B:9687: 16        .byte $16   ; <に>
- D - I - - 0x017698 0B:9688: 17        .byte $17   ; <ぬ>
- D - I - - 0x017699 0B:9689: 18        .byte $18   ; <ね>
- D - I - - 0x01769A 0B:968A: 17        .byte $17   ; <ぬ>
- D - I - - 0x01769B 0B:968B: 16        .byte $16   ; <に>
- D - I - - 0x01769C 0B:968C: 19        .byte $19   ; <の>
- D - I - - 0x01769D 0B:968D: 1A        .byte $1A   ; <は>
- D - I - - 0x01769E 0B:968E: 19        .byte $19   ; <の>
- D - I - - 0x01769F 0B:968F: 1A        .byte $1A   ; <は>
- D - I - - 0x0176A0 0B:9690: 19        .byte $19   ; <の>
- D - I - - 0x0176A1 0B:9691: 1F        .byte $1F   ; <ま>
- D - I - - 0x0176A2 0B:9692: FD        .byte $FD
- D - I - - 0x0176A3 0B:9693: 1E        .byte $1E   ; <ほ>
- D - I - - 0x0176A4 0B:9694: 4E        .byte $4E   ; <セ>
- D - I - - 0x0176A5 0B:9695: 4F        .byte $4F   ; <ソ>
- D - I - - 0x0176A6 0B:9696: 4D        .byte $4D   ; <ス>
- D - I - - 0x0176A7 0B:9697: 53        .byte $53   ; <テ>
- D - I - - 0x0176A8 0B:9698: 54        .byte $54   ; <ト>
- D - I - - 0x0176A9 0B:9699: 74        .byte $74   ; <ィ>
- D - I - - 0x0176AA 0B:969A: 21        .byte $21   ; <む>
- D - I - - 0x0176AB 0B:969B: 21        .byte $21   ; <む>
- D - I - - 0x0176AC 0B:969C: 69        .byte $69   ; <ル>
- D - I - - 0x0176AD 0B:969D: 69        .byte $69   ; <ル>
- D - I - - 0x0176AE 0B:969E: 69        .byte $69   ; <ル>
- D - I - - 0x0176AF 0B:969F: 69        .byte $69   ; <ル>
- D - I - - 0x0176B0 0B:96A0: 69        .byte $69   ; <ル>
- D - I - - 0x0176B1 0B:96A1: 69        .byte $69   ; <ル>
- D - I - - 0x0176B2 0B:96A2: 69        .byte $69   ; <ル>
- D - I - - 0x0176B3 0B:96A3: 69        .byte $69   ; <ル>
- D - I - - 0x0176B4 0B:96A4: 26        .byte $26   ; <よ>
- D - I - - 0x0176B5 0B:96A5: 26        .byte $26   ; <よ>
- D - I - - 0x0176B6 0B:96A6: 26        .byte $26   ; <よ>
- D - I - - 0x0176B7 0B:96A7: 26        .byte $26   ; <よ>
- D - I - - 0x0176B8 0B:96A8: 26        .byte $26   ; <よ>
- D - I - - 0x0176B9 0B:96A9: 26        .byte $26   ; <よ>
- D - I - - 0x0176BA 0B:96AA: 26        .byte $26   ; <よ>
- D - I - - 0x0176BB 0B:96AB: 26        .byte $26   ; <よ>
- D - I - - 0x0176BC 0B:96AC: 97        .byte $97
- D - I - - 0x0176BD 0B:96AD: 26        .byte $26   ; <よ>
- D - I - - 0x0176BE 0B:96AE: 26        .byte $26   ; <よ>
- D - I - - 0x0176BF 0B:96AF: 26        .byte $26   ; <よ>
- D - I - - 0x0176C0 0B:96B0: 26        .byte $26   ; <よ>
- D - I - - 0x0176C1 0B:96B1: 26        .byte $26   ; <よ>
- D - I - - 0x0176C2 0B:96B2: 26        .byte $26   ; <よ>
- D - I - - 0x0176C3 0B:96B3: 26        .byte $26   ; <よ>
- D - I - - 0x0176C4 0B:96B4: A4        .byte $A4   ; <ご>
- D - I - - 0x0176C5 0B:96B5: 98        .byte $98
- D - I - - 0x0176C6 0B:96B6: 99        .byte $99
- D - I - - 0x0176C7 0B:96B7: 9A        .byte $9A
- D - I - - 0x0176C8 0B:96B8: 97        .byte $97
- D - I - - 0x0176C9 0B:96B9: 26        .byte $26   ; <よ>
- D - I - - 0x0176CA 0B:96BA: 26        .byte $26   ; <よ>
- D - I - - 0x0176CB 0B:96BB: 26        .byte $26   ; <よ>
- D - I - - 0x0176CC 0B:96BC: 9C        .byte $9C
- D - I - - 0x0176CD 0B:96BD: 9D        .byte $9D
- D - I - - 0x0176CE 0B:96BE: 9E        .byte $9E
- D - I - - 0x0176CF 0B:96BF: 9F        .byte $9F
- D - I - - 0x0176D0 0B:96C0: A1        .byte $A1   ; <ぎ>
- D - I - - 0x0176D1 0B:96C1: A0        .byte $A0   ; <が>
- D - I - - 0x0176D2 0B:96C2: 9B        .byte $9B
- D - I - - 0x0176D3 0B:96C3: 25        .byte $25   ; <ゆ>
- D - I - - 0x0176D4 0B:96C4: 26        .byte $26   ; <よ>
- D - I - - 0x0176D5 0B:96C5: 26        .byte $26   ; <よ>
- D - I - - 0x0176D6 0B:96C6: 26        .byte $26   ; <よ>
- D - I - - 0x0176D7 0B:96C7: 26        .byte $26   ; <よ>
- D - I - - 0x0176D8 0B:96C8: 26        .byte $26   ; <よ>
- D - I - - 0x0176D9 0B:96C9: 26        .byte $26   ; <よ>
- D - I - - 0x0176DA 0B:96CA: 26        .byte $26   ; <よ>
- D - I - - 0x0176DB 0B:96CB: 26        .byte $26   ; <よ>
- D - I - - 0x0176DC 0B:96CC: 26        .byte $26   ; <よ>
- D - I - - 0x0176DD 0B:96CD: 26        .byte $26   ; <よ>
- D - I - - 0x0176DE 0B:96CE: 26        .byte $26   ; <よ>
- D - I - - 0x0176DF 0B:96CF: 26        .byte $26   ; <よ>
- D - I - - 0x0176E0 0B:96D0: 26        .byte $26   ; <よ>
- D - I - - 0x0176E1 0B:96D1: 26        .byte $26   ; <よ>
- D - I - - 0x0176E2 0B:96D2: 26        .byte $26   ; <よ>
- D - I - - 0x0176E3 0B:96D3: 26        .byte $26   ; <よ>
- D - I - - 0x0176E4 0B:96D4: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176E5 0B:96D5: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176E6 0B:96D6: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176E7 0B:96D7: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176E8 0B:96D8: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176E9 0B:96D9: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176EA 0B:96DA: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176EB 0B:96DB: A2        .byte $A2   ; <ぐ>
- D - I - - 0x0176EC 0B:96DC: A3        .byte $A3   ; <げ>
- D - I - - 0x0176ED 0B:96DD: A3        .byte $A3   ; <げ>
- D - I - - 0x0176EE 0B:96DE: A3        .byte $A3   ; <げ>
- D - I - - 0x0176EF 0B:96DF: A3        .byte $A3   ; <げ>
- D - I - - 0x0176F0 0B:96E0: A3        .byte $A3   ; <げ>
- D - I - - 0x0176F1 0B:96E1: A3        .byte $A3   ; <げ>
- D - I - - 0x0176F2 0B:96E2: A3        .byte $A3   ; <げ>
- D - I - - 0x0176F3 0B:96E3: A3        .byte $A3   ; <げ>
- D - I - - 0x0176F4 0B:96E4: 26        .byte $26   ; <よ>
- D - I - - 0x0176F5 0B:96E5: 26        .byte $26   ; <よ>
- D - I - - 0x0176F6 0B:96E6: 26        .byte $26   ; <よ>
- D - I - - 0x0176F7 0B:96E7: 26        .byte $26   ; <よ>
- D - I - - 0x0176F8 0B:96E8: 26        .byte $26   ; <よ>
- D - I - - 0x0176F9 0B:96E9: 26        .byte $26   ; <よ>
- D - I - - 0x0176FA 0B:96EA: 26        .byte $26   ; <よ>
- D - I - - 0x0176FB 0B:96EB: 26        .byte $26   ; <よ>
- D - I - - 0x0176FC 0B:96EC: 26        .byte $26   ; <よ>
- D - I - - 0x0176FD 0B:96ED: 26        .byte $26   ; <よ>
- D - I - - 0x0176FE 0B:96EE: 26        .byte $26   ; <よ>
- D - I - - 0x0176FF 0B:96EF: 26        .byte $26   ; <よ>
- D - I - - 0x017700 0B:96F0: 26        .byte $26   ; <よ>
- D - I - - 0x017701 0B:96F1: 26        .byte $26   ; <よ>
- D - I - - 0x017702 0B:96F2: 26        .byte $26   ; <よ>
- D - I - - 0x017703 0B:96F3: A6        .byte $A6   ; <じ>
- D - I - - 0x017704 0B:96F4: 26        .byte $26   ; <よ>
- D - I - - 0x017705 0B:96F5: 26        .byte $26   ; <よ>
- D - I - - 0x017706 0B:96F6: 26        .byte $26   ; <よ>
- D - I - - 0x017707 0B:96F7: A6        .byte $A6   ; <じ>
- D - I - - 0x017708 0B:96F8: A7        .byte $A7   ; <ず>
- D - I - - 0x017709 0B:96F9: A8        .byte $A8   ; <ぜ>
- D - I - - 0x01770A 0B:96FA: A9        .byte $A9   ; <ぞ>
- D - I - - 0x01770B 0B:96FB: A5        .byte $A5   ; <ざ>
- D - I - - 0x01770C 0B:96FC: 25        .byte $25   ; <ゆ>
- D - I - - 0x01770D 0B:96FD: AA        .byte $AA   ; <だ>
- D - I - - 0x01770E 0B:96FE: AB        .byte $AB   ; <ぢ>
- D - I - - 0x01770F 0B:96FF: AC        .byte $AC   ; <づ>
- D - I - - 0x017710 0B:9700: AD        .byte $AD   ; <で>
- D - I - - 0x017711 0B:9701: AE        .byte $AE   ; <ど>
- D - I - - 0x017712 0B:9702: AF        .byte $AF   ; <ば>
- D - I - - 0x017713 0B:9703: B0        .byte $B0   ; <び>
- D - I - - 0x017714 0B:9704: 35        .byte $35   ; <2>
- D - I - - 0x017715 0B:9705: 36        .byte $36   ; <3>
- D - I - - 0x017716 0B:9706: 37        .byte $37   ; <4>
- D - I - - 0x017717 0B:9707: 38        .byte $38   ; <5>
- D - I - - 0x017718 0B:9708: 39        .byte $39   ; <6>
- D - I - - 0x017719 0B:9709: 3A        .byte $3A   ; <7>
- D - I - - 0x01771A 0B:970A: 3B        .byte $3B   ; <8>
- D - I - - 0x01771B 0B:970B: 3C        .byte $3C   ; <9>
- D - I - - 0x01771C 0B:970C: 3D        .byte $3D   ; <+>
- D - I - - 0x01771D 0B:970D: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01771E 0B:970E: 3F        .byte $3F   ; <•>
- D - I - - 0x01771F 0B:970F: 40        .byte $40   ; <「>
- D - I - - 0x017720 0B:9710: 41        .byte $41   ; <ア>
- D - I - - 0x017721 0B:9711: 42        .byte $42   ; <イ>
- D - I - - 0x017722 0B:9712: 43        .byte $43   ; <ウ>
- D - I - - 0x017723 0B:9713: 44        .byte $44   ; <エ>
- D - I - - 0x017724 0B:9714: 45        .byte $45   ; <オ>
- D - I - - 0x017725 0B:9715: 46        .byte $46   ; <カ>
- D - I - - 0x017726 0B:9716: 47        .byte $47   ; <キ>
- D - I - - 0x017727 0B:9717: 48        .byte $48   ; <ク>
- D - I - - 0x017728 0B:9718: 49        .byte $49   ; <ケ>
- D - I - - 0x017729 0B:9719: 4A        .byte $4A   ; <コ>
- D - I - - 0x01772A 0B:971A: 4B        .byte $4B   ; <サ>
- D - I - - 0x01772B 0B:971B: 4C        .byte $4C   ; <シ>
- D - I - - 0x01772C 0B:971C: 4D        .byte $4D   ; <ス>
- D - I - - 0x01772D 0B:971D: 4D        .byte $4D   ; <ス>
- D - I - - 0x01772E 0B:971E: 4E        .byte $4E   ; <セ>
- D - I - - 0x01772F 0B:971F: 4F        .byte $4F   ; <ソ>
- D - I - - 0x017730 0B:9720: 50        .byte $50   ; <タ>
- D - I - - 0x017731 0B:9721: 51        .byte $51   ; <チ>
- D - I - - 0x017732 0B:9722: 4F        .byte $4F   ; <ソ>
- D - I - - 0x017733 0B:9723: 50        .byte $50   ; <タ>
- D - I - - 0x017734 0B:9724: 14        .byte $14   ; <と>
- D - I - - 0x017735 0B:9725: 14        .byte $14   ; <と>
- D - I - - 0x017736 0B:9726: 14        .byte $14   ; <と>
- D - I - - 0x017737 0B:9727: 14        .byte $14   ; <と>
- D - I - - 0x017738 0B:9728: 14        .byte $14   ; <と>
- D - I - - 0x017739 0B:9729: 14        .byte $14   ; <と>
- D - I - - 0x01773A 0B:972A: 14        .byte $14   ; <と>
- D - I - - 0x01773B 0B:972B: 14        .byte $14   ; <と>
- D - I - - 0x01773C 0B:972C: 52        .byte $52   ; <ツ>
- D - I - - 0x01773D 0B:972D: 53        .byte $53   ; <テ>
- D - I - - 0x01773E 0B:972E: 54        .byte $54   ; <ト>
- D - I - - 0x01773F 0B:972F: 55        .byte $55   ; <ナ>
- D - I - - 0x017740 0B:9730: 56        .byte $56   ; <ニ>
- D - I - - 0x017741 0B:9731: 57        .byte $57   ; <ヌ>
- D - I - - 0x017742 0B:9732: 58        .byte $58   ; <ネ>
- D - I - - 0x017743 0B:9733: 59        .byte $59   ; <ノ>
- D - I - - 0x017744 0B:9734: 5A        .byte $5A   ; <ハ>
- D - I - - 0x017745 0B:9735: 5B        .byte $5B   ; <ヒ>
- D - I - - 0x017746 0B:9736: 5C        .byte $5C   ; <フ>
- D - I - - 0x017747 0B:9737: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017748 0B:9738: 5E        .byte $5E   ; <ホ>
- D - I - - 0x017749 0B:9739: 5F        .byte $5F   ; <マ>
- D - I - - 0x01774A 0B:973A: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x01774B 0B:973B: 60        .byte $60   ; <ミ>
- D - I - - 0x01774C 0B:973C: 14        .byte $14   ; <と>
- D - I - - 0x01774D 0B:973D: 14        .byte $14   ; <と>
- D - I - - 0x01774E 0B:973E: 14        .byte $14   ; <と>
- D - I - - 0x01774F 0B:973F: 14        .byte $14   ; <と>
- D - I - - 0x017750 0B:9740: 14        .byte $14   ; <と>
- D - I - - 0x017751 0B:9741: 14        .byte $14   ; <と>
- D - I - - 0x017752 0B:9742: 14        .byte $14   ; <と>
- D - I - - 0x017753 0B:9743: 14        .byte $14   ; <と>
- D - I - - 0x017754 0B:9744: 71        .byte $71   ; <ュ>
- D - I - - 0x017755 0B:9745: 75        .byte $75   ; <ェ>
- D - I - - 0x017756 0B:9746: 79        .byte $79   ; <!>
- D - I - - 0x017757 0B:9747: 7D        .byte $7D   ; <ー>
- D - I - - 0x017758 0B:9748: 81        .byte $81   ; <A>
- D - I - - 0x017759 0B:9749: 85        .byte $85   ; <E>
- D - I - - 0x01775A 0B:974A: 89        .byte $89   ; <I>
- D - I - - 0x01775B 0B:974B: 8D        .byte $8D   ; <P>
- D - I - - 0x01775C 0B:974C: 72        .byte $72   ; <ョ>
- D - I - - 0x01775D 0B:974D: 76        .byte $76   ; <ォ>
- D - I - - 0x01775E 0B:974E: 7A        .byte $7A   ; <、>
- D - I - - 0x01775F 0B:974F: 7E        .byte $7E   ; <.>
- D - I - - 0x017760 0B:9750: 82        .byte $82   ; <B>
- D - I - - 0x017761 0B:9751: 86        .byte $86   ; <F>
- D - I - - 0x017762 0B:9752: 8A        .byte $8A   ; <N>
- D - I - - 0x017763 0B:9753: 8E        .byte $8E   ; <L>
- D - I - - 0x017764 0B:9754: 73        .byte $73   ; <ヮ>
- D - I - - 0x017765 0B:9755: 77        .byte $77   ; <:>
- D - I - - 0x017766 0B:9756: 7B        .byte $7B   ; <。>
- D - I - - 0x017767 0B:9757: 7F        .byte $7F   ; <,>
- D - I - - 0x017768 0B:9758: 83        .byte $83   ; <C>
- D - I - - 0x017769 0B:9759: 87        .byte $87   ; <G>
- D - I - - 0x01776A 0B:975A: 8B        .byte $8B   ; <K>
- D - I - - 0x01776B 0B:975B: 8F        .byte $8F   ; <S>
- D - I - - 0x01776C 0B:975C: 74        .byte $74   ; <ィ>
- D - I - - 0x01776D 0B:975D: 78        .byte $78   ; <?>
- D - I - - 0x01776E 0B:975E: 7C        .byte $7C   ; <~>
- D - I - - 0x01776F 0B:975F: 80        .byte $80
- D - I - - 0x017770 0B:9760: 84        .byte $84   ; <D>
- D - I - - 0x017771 0B:9761: 88        .byte $88   ; <H>
- D - I - - 0x017772 0B:9762: 8C        .byte $8C   ; <M>
- D - I - - 0x017773 0B:9763: 90        .byte $90   ; <U>
- D - I - - 0x017774 0B:9764: 14        .byte $14   ; <と>
- D - I - - 0x017775 0B:9765: 14        .byte $14   ; <と>
- D - I - - 0x017776 0B:9766: 91        .byte $91   ; <V>
- D - I - - 0x017777 0B:9767: 7D        .byte $7D   ; <ー>
- D - I - - 0x017778 0B:9768: 81        .byte $81   ; <A>
- D - I - - 0x017779 0B:9769: 94        .byte $94
- D - I - - 0x01777A 0B:976A: 14        .byte $14   ; <と>
- D - I - - 0x01777B 0B:976B: 14        .byte $14   ; <と>
- D - I - - 0x01777C 0B:976C: 14        .byte $14   ; <と>
- D - I - - 0x01777D 0B:976D: 14        .byte $14   ; <と>
- D - I - - 0x01777E 0B:976E: 92        .byte $92   ; <W>
- D - I - - 0x01777F 0B:976F: 7E        .byte $7E   ; <.>
- D - I - - 0x017780 0B:9770: 82        .byte $82   ; <B>
- D - I - - 0x017781 0B:9771: 95        .byte $95
- D - I - - 0x017782 0B:9772: 14        .byte $14   ; <と>
- D - I - - 0x017783 0B:9773: 14        .byte $14   ; <と>
- D - I - - 0x017784 0B:9774: 14        .byte $14   ; <と>
- D - I - - 0x017785 0B:9775: 14        .byte $14   ; <と>
- D - I - - 0x017786 0B:9776: 91        .byte $91   ; <V>
- D - I - - 0x017787 0B:9777: 7F        .byte $7F   ; <,>
- D - I - - 0x017788 0B:9778: 83        .byte $83   ; <C>
- D - I - - 0x017789 0B:9779: 94        .byte $94
- D - I - - 0x01778A 0B:977A: 14        .byte $14   ; <と>
- D - I - - 0x01778B 0B:977B: 14        .byte $14   ; <と>
- D - I - - 0x01778C 0B:977C: 14        .byte $14   ; <と>
- D - I - - 0x01778D 0B:977D: 14        .byte $14   ; <と>
- D - I - - 0x01778E 0B:977E: 91        .byte $91   ; <V>
- D - I - - 0x01778F 0B:977F: 80        .byte $80
- D - I - - 0x017790 0B:9780: 84        .byte $84   ; <D>
- D - I - - 0x017791 0B:9781: 96        .byte $96
- D - I - - 0x017792 0B:9782: 14        .byte $14   ; <と>
- D - I - - 0x017793 0B:9783: 14        .byte $14   ; <と>
- - - - - - 0x017794 0B:9784: 33        .byte $33   ; <0>
- - - - - - 0x017795 0B:9785: B1        .byte $B1   ; <ぶ>
- - - - - - 0x017796 0B:9786: 33        .byte $33   ; <0>
- - - - - - 0x017797 0B:9787: 33        .byte $33   ; <0>
- - - - - - 0x017798 0B:9788: 33        .byte $33   ; <0>
- - - - - - 0x017799 0B:9789: B2        .byte $B2   ; <べ>
- - - - - - 0x01779A 0B:978A: 33        .byte $33   ; <0>
- - - - - - 0x01779B 0B:978B: 33        .byte $33   ; <0>
- - - - - - 0x01779C 0B:978C: B4        .byte $B4   ; <ガ>
- - - - - - 0x01779D 0B:978D: B5        .byte $B5   ; <ギ>
- - - - - - 0x01779E 0B:978E: B4        .byte $B4   ; <ガ>
- - - - - - 0x01779F 0B:978F: B5        .byte $B5   ; <ギ>
- - - - - - 0x0177A0 0B:9790: B4        .byte $B4   ; <ガ>
- - - - - - 0x0177A1 0B:9791: B5        .byte $B5   ; <ギ>
- - - - - - 0x0177A2 0B:9792: B4        .byte $B4   ; <ガ>
- - - - - - 0x0177A3 0B:9793: B5        .byte $B5   ; <ギ>
- - - - - - 0x0177A4 0B:9794: 27        .byte $27   ; <ら>
- - - - - - 0x0177A5 0B:9795: 27        .byte $27   ; <ら>
- - - - - - 0x0177A6 0B:9796: 27        .byte $27   ; <ら>
- - - - - - 0x0177A7 0B:9797: 27        .byte $27   ; <ら>
- - - - - - 0x0177A8 0B:9798: 27        .byte $27   ; <ら>
- - - - - - 0x0177A9 0B:9799: 27        .byte $27   ; <ら>
- - - - - - 0x0177AA 0B:979A: 27        .byte $27   ; <ら>
- - - - - - 0x0177AB 0B:979B: 27        .byte $27   ; <ら>
- - - - - - 0x0177AC 0B:979C: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177AD 0B:979D: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177AE 0B:979E: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177AF 0B:979F: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177B0 0B:97A0: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177B1 0B:97A1: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177B2 0B:97A2: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177B3 0B:97A3: 25        .byte $25   ; <ゆ>
- - - - - - 0x0177B4 0B:97A4: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177B5 0B:97A5: 6E        .byte $6E   ; <ン>
- - - - - - 0x0177B6 0B:97A6: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177B7 0B:97A7: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177B8 0B:97A8: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177B9 0B:97A9: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177BA 0B:97AA: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177BB 0B:97AB: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177BC 0B:97AC: 16        .byte $16   ; <に>
- - - - - - 0x0177BD 0B:97AD: 17        .byte $17   ; <ぬ>
- - - - - - 0x0177BE 0B:97AE: 18        .byte $18   ; <ね>
- - - - - - 0x0177BF 0B:97AF: 17        .byte $17   ; <ぬ>
- - - - - - 0x0177C0 0B:97B0: 16        .byte $16   ; <に>
- - - - - - 0x0177C1 0B:97B1: 15        .byte $15   ; <な>
- - - - - - 0x0177C2 0B:97B2: 43        .byte $43   ; <ウ>
- - - - - - 0x0177C3 0B:97B3: 15        .byte $15   ; <な>
- - - - - - 0x0177C4 0B:97B4: 26        .byte $26   ; <よ>
- - - - - - 0x0177C5 0B:97B5: FD        .byte $FD
- - - - - - 0x0177C6 0B:97B6: 27        .byte $27   ; <ら>
- - - - - - 0x0177C7 0B:97B7: 19        .byte $19   ; <の>
- - - - - - 0x0177C8 0B:97B8: 1A        .byte $1A   ; <は>
- - - - - - 0x0177C9 0B:97B9: 19        .byte $19   ; <の>
- - - - - - 0x0177CA 0B:97BA: 1A        .byte $1A   ; <は>
- - - - - - 0x0177CB 0B:97BB: 19        .byte $19   ; <の>
- - - - - - 0x0177CC 0B:97BC: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177CD 0B:97BD: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177CE 0B:97BE: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177CF 0B:97BF: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177D0 0B:97C0: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177D1 0B:97C1: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177D2 0B:97C2: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177D3 0B:97C3: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177D4 0B:97C4: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177D5 0B:97C5: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177D6 0B:97C6: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177D7 0B:97C7: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177D8 0B:97C8: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177D9 0B:97C9: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177DA 0B:97CA: 6E        .byte $6E   ; <ン>
- - - - - - 0x0177DB 0B:97CB: 6D        .byte $6D   ; <ヲ>
- - - - - - 0x0177DC 0B:97CC: 15        .byte $15   ; <な>
- - - - - - 0x0177DD 0B:97CD: 43        .byte $43   ; <ウ>
- - - - - - 0x0177DE 0B:97CE: 15        .byte $15   ; <な>
- - - - - - 0x0177DF 0B:97CF: 16        .byte $16   ; <に>
- - - - - - 0x0177E0 0B:97D0: 17        .byte $17   ; <ぬ>
- - - - - - 0x0177E1 0B:97D1: 18        .byte $18   ; <ね>
- - - - - - 0x0177E2 0B:97D2: 17        .byte $17   ; <ぬ>
- - - - - - 0x0177E3 0B:97D3: 16        .byte $16   ; <に>
- - - - - - 0x0177E4 0B:97D4: 19        .byte $19   ; <の>
- - - - - - 0x0177E5 0B:97D5: 1A        .byte $1A   ; <は>
- - - - - - 0x0177E6 0B:97D6: 19        .byte $19   ; <の>
- - - - - - 0x0177E7 0B:97D7: 1A        .byte $1A   ; <は>
- - - - - - 0x0177E8 0B:97D8: 19        .byte $19   ; <の>
- - - - - - 0x0177E9 0B:97D9: 1F        .byte $1F   ; <ま>
- - - - - - 0x0177EA 0B:97DA: FD        .byte $FD
- - - - - - 0x0177EB 0B:97DB: 1E        .byte $1E   ; <ほ>
- - - - - - 0x0177EC 0B:97DC: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177ED 0B:97DD: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177EE 0B:97DE: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177EF 0B:97DF: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177F0 0B:97E0: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177F1 0B:97E1: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177F2 0B:97E2: 6F        .byte $6F   ; <ッ>
- - - - - - 0x0177F3 0B:97E3: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0177F4 0B:97E4: 00        .byte $00
- D - I - - 0x0177F5 0B:97E5: 00        .byte $00
- D - I - - 0x0177F6 0B:97E6: 00        .byte $00
- D - I - - 0x0177F7 0B:97E7: 00        .byte $00
- D - I - - 0x0177F8 0B:97E8: 00        .byte $00
- D - I - - 0x0177F9 0B:97E9: 00        .byte $00
- D - I - - 0x0177FA 0B:97EA: 00        .byte $00
- D - I - - 0x0177FB 0B:97EB: 00        .byte $00
- D - I - - 0x0177FC 0B:97EC: 15        .byte $15   ; <な>
- D - I - - 0x0177FD 0B:97ED: 99        .byte $99
- D - I - - 0x0177FE 0B:97EE: 9A        .byte $9A
- D - I - - 0x0177FF 0B:97EF: 9B        .byte $9B
- D - I - - 0x017800 0B:97F0: 9C        .byte $9C
- D - I - - 0x017801 0B:97F1: 9D        .byte $9D
- D - I - - 0x017802 0B:97F2: 9E        .byte $9E
- D - I - - 0x017803 0B:97F3: 15        .byte $15   ; <な>
- D - I - - 0x017804 0B:97F4: 15        .byte $15   ; <な>
- D - I - - 0x017805 0B:97F5: 9F        .byte $9F
- D - I - - 0x017806 0B:97F6: A0        .byte $A0   ; <が>
- D - I - - 0x017807 0B:97F7: A1        .byte $A1   ; <ぎ>
- D - I - - 0x017808 0B:97F8: A2        .byte $A2   ; <ぐ>
- D - I - - 0x017809 0B:97F9: A3        .byte $A3   ; <げ>
- D - I - - 0x01780A 0B:97FA: A4        .byte $A4   ; <ご>
- D - I - - 0x01780B 0B:97FB: 15        .byte $15   ; <な>
- D - I - - 0x01780C 0B:97FC: 00        .byte $00
- D - I - - 0x01780D 0B:97FD: 00        .byte $00
- D - I - - 0x01780E 0B:97FE: 00        .byte $00
- D - I - - 0x01780F 0B:97FF: 00        .byte $00
- D - I - - 0x017810 0B:9800: 00        .byte $00
- D - I - - 0x017811 0B:9801: 00        .byte $00
- D - I - - 0x017812 0B:9802: 00        .byte $00
- D - I - - 0x017813 0B:9803: 00        .byte $00
- D - I - - 0x017814 0B:9804: 33        .byte $33   ; <0>
- D - I - - 0x017815 0B:9805: 33        .byte $33   ; <0>
- D - I - - 0x017816 0B:9806: 33        .byte $33   ; <0>
- D - I - - 0x017817 0B:9807: 33        .byte $33   ; <0>
- D - I - - 0x017818 0B:9808: 33        .byte $33   ; <0>
- D - I - - 0x017819 0B:9809: 33        .byte $33   ; <0>
- D - I - - 0x01781A 0B:980A: E5        .byte $E5
- D - I - - 0x01781B 0B:980B: 33        .byte $33   ; <0>
- D - I - - 0x01781C 0B:980C: 33        .byte $33   ; <0>
- D - I - - 0x01781D 0B:980D: E5        .byte $E5
- D - I - - 0x01781E 0B:980E: 33        .byte $33   ; <0>
- D - I - - 0x01781F 0B:980F: 33        .byte $33   ; <0>
- D - I - - 0x017820 0B:9810: 33        .byte $33   ; <0>
- D - I - - 0x017821 0B:9811: 33        .byte $33   ; <0>
- D - I - - 0x017822 0B:9812: 33        .byte $33   ; <0>
- D - I - - 0x017823 0B:9813: 33        .byte $33   ; <0>
- D - I - - 0x017824 0B:9814: 33        .byte $33   ; <0>
- D - I - - 0x017825 0B:9815: 33        .byte $33   ; <0>
- D - I - - 0x017826 0B:9816: 33        .byte $33   ; <0>
- D - I - - 0x017827 0B:9817: E5        .byte $E5
- D - I - - 0x017828 0B:9818: 33        .byte $33   ; <0>
- D - I - - 0x017829 0B:9819: 33        .byte $33   ; <0>
- D - I - - 0x01782A 0B:981A: E5        .byte $E5
- D - I - - 0x01782B 0B:981B: 33        .byte $33   ; <0>
- D - I - - 0x01782C 0B:981C: 33        .byte $33   ; <0>
- D - I - - 0x01782D 0B:981D: 33        .byte $33   ; <0>
- D - I - - 0x01782E 0B:981E: 33        .byte $33   ; <0>
- D - I - - 0x01782F 0B:981F: 33        .byte $33   ; <0>
- D - I - - 0x017830 0B:9820: 33        .byte $33   ; <0>
- D - I - - 0x017831 0B:9821: 33        .byte $33   ; <0>
- D - I - - 0x017832 0B:9822: 33        .byte $33   ; <0>
- D - I - - 0x017833 0B:9823: 33        .byte $33   ; <0>
- D - I - - 0x017834 0B:9824: E2        .byte $E2
- D - I - - 0x017835 0B:9825: E5        .byte $E5
- D - I - - 0x017836 0B:9826: 33        .byte $33   ; <0>
- D - I - - 0x017837 0B:9827: 33        .byte $33   ; <0>
- D - I - - 0x017838 0B:9828: 33        .byte $33   ; <0>
- D - I - - 0x017839 0B:9829: 33        .byte $33   ; <0>
- D - I - - 0x01783A 0B:982A: 33        .byte $33   ; <0>
- D - I - - 0x01783B 0B:982B: 33        .byte $33   ; <0>
- D - I - - 0x01783C 0B:982C: E3        .byte $E3
- D - I - - 0x01783D 0B:982D: E2        .byte $E2
- D - I - - 0x01783E 0B:982E: 33        .byte $33   ; <0>
- D - I - - 0x01783F 0B:982F: 33        .byte $33   ; <0>
- D - I - - 0x017840 0B:9830: 33        .byte $33   ; <0>
- D - I - - 0x017841 0B:9831: 33        .byte $33   ; <0>
- D - I - - 0x017842 0B:9832: 33        .byte $33   ; <0>
- D - I - - 0x017843 0B:9833: 33        .byte $33   ; <0>
- D - I - - 0x017844 0B:9834: E7        .byte $E7
- D - I - - 0x017845 0B:9835: E4        .byte $E4
- D - I - - 0x017846 0B:9836: E2        .byte $E2
- D - I - - 0x017847 0B:9837: 33        .byte $33   ; <0>
- D - I - - 0x017848 0B:9838: 33        .byte $33   ; <0>
- D - I - - 0x017849 0B:9839: E5        .byte $E5
- D - I - - 0x01784A 0B:983A: 33        .byte $33   ; <0>
- D - I - - 0x01784B 0B:983B: 33        .byte $33   ; <0>
- D - I - - 0x01784C 0B:983C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01784D 0B:983D: E8        .byte $E8
- D - I - - 0x01784E 0B:983E: E9        .byte $E9
- D - I - - 0x01784F 0B:983F: E1        .byte $E1
- D - I - - 0x017850 0B:9840: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017851 0B:9841: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017852 0B:9842: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017853 0B:9843: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017854 0B:9844: 33        .byte $33   ; <0>
- D - I - - 0x017855 0B:9845: 33        .byte $33   ; <0>
- D - I - - 0x017856 0B:9846: 33        .byte $33   ; <0>
- D - I - - 0x017857 0B:9847: B9        .byte $B9   ; <ザ>
- D - I - - 0x017858 0B:9848: 33        .byte $33   ; <0>
- D - I - - 0x017859 0B:9849: 33        .byte $33   ; <0>
- D - I - - 0x01785A 0B:984A: 33        .byte $33   ; <0>
- D - I - - 0x01785B 0B:984B: 33        .byte $33   ; <0>
- D - I - - 0x01785C 0B:984C: 33        .byte $33   ; <0>
- D - I - - 0x01785D 0B:984D: 33        .byte $33   ; <0>
- D - I - - 0x01785E 0B:984E: 33        .byte $33   ; <0>
- D - I - - 0x01785F 0B:984F: 33        .byte $33   ; <0>
- D - I - - 0x017860 0B:9850: 33        .byte $33   ; <0>
- D - I - - 0x017861 0B:9851: 33        .byte $33   ; <0>
- D - I - - 0x017862 0B:9852: B9        .byte $B9   ; <ザ>
- D - I - - 0x017863 0B:9853: 33        .byte $33   ; <0>
- D - I - - 0x017864 0B:9854: 33        .byte $33   ; <0>
- D - I - - 0x017865 0B:9855: BA        .byte $BA   ; <ジ>
- D - I - - 0x017866 0B:9856: 33        .byte $33   ; <0>
- D - I - - 0x017867 0B:9857: 33        .byte $33   ; <0>
- D - I - - 0x017868 0B:9858: 33        .byte $33   ; <0>
- D - I - - 0x017869 0B:9859: 33        .byte $33   ; <0>
- D - I - - 0x01786A 0B:985A: 33        .byte $33   ; <0>
- D - I - - 0x01786B 0B:985B: 33        .byte $33   ; <0>
- D - I - - 0x01786C 0B:985C: 33        .byte $33   ; <0>
- D - I - - 0x01786D 0B:985D: 33        .byte $33   ; <0>
- D - I - - 0x01786E 0B:985E: 33        .byte $33   ; <0>
- D - I - - 0x01786F 0B:985F: 33        .byte $33   ; <0>
- D - I - - 0x017870 0B:9860: 33        .byte $33   ; <0>
- D - I - - 0x017871 0B:9861: 33        .byte $33   ; <0>
- D - I - - 0x017872 0B:9862: 33        .byte $33   ; <0>
- D - I - - 0x017873 0B:9863: 33        .byte $33   ; <0>
- D - I - - 0x017874 0B:9864: 33        .byte $33   ; <0>
- D - I - - 0x017875 0B:9865: 33        .byte $33   ; <0>
- D - I - - 0x017876 0B:9866: 33        .byte $33   ; <0>
- D - I - - 0x017877 0B:9867: 33        .byte $33   ; <0>
- D - I - - 0x017878 0B:9868: 33        .byte $33   ; <0>
- D - I - - 0x017879 0B:9869: 33        .byte $33   ; <0>
- D - I - - 0x01787A 0B:986A: 33        .byte $33   ; <0>
- D - I - - 0x01787B 0B:986B: BB        .byte $BB   ; <ズ>
- D - I - - 0x01787C 0B:986C: 33        .byte $33   ; <0>
- D - I - - 0x01787D 0B:986D: 33        .byte $33   ; <0>
- D - I - - 0x01787E 0B:986E: 33        .byte $33   ; <0>
- D - I - - 0x01787F 0B:986F: 33        .byte $33   ; <0>
- D - I - - 0x017880 0B:9870: 33        .byte $33   ; <0>
- D - I - - 0x017881 0B:9871: BA        .byte $BA   ; <ジ>
- D - I - - 0x017882 0B:9872: BB        .byte $BB   ; <ズ>
- D - I - - 0x017883 0B:9873: BF        .byte $BF   ; <ヂ>
- D - I - - 0x017884 0B:9874: 33        .byte $33   ; <0>
- D - I - - 0x017885 0B:9875: 33        .byte $33   ; <0>
- D - I - - 0x017886 0B:9876: B9        .byte $B9   ; <ザ>
- D - I - - 0x017887 0B:9877: 33        .byte $33   ; <0>
- D - I - - 0x017888 0B:9878: 33        .byte $33   ; <0>
- D - I - - 0x017889 0B:9879: BB        .byte $BB   ; <ズ>
- D - I - - 0x01788A 0B:987A: BE        .byte $BE   ; <ダ>
- D - I - - 0x01788B 0B:987B: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01788C 0B:987C: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01788D 0B:987D: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01788E 0B:987E: BD        .byte $BD   ; <ゾ>
- D - I - - 0x01788F 0B:987F: BD        .byte $BD   ; <ゾ>
- D - I - - 0x017890 0B:9880: BC        .byte $BC   ; <ゼ>
- D - I - - 0x017891 0B:9881: C0        .byte $C0   ; <ヅ>
- D - I - - 0x017892 0B:9882: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017893 0B:9883: 25        .byte $25   ; <ゆ>
- D - I - - 0x017894 0B:9884: 33        .byte $33   ; <0>
- D - I - - 0x017895 0B:9885: 33        .byte $33   ; <0>
- D - I - - 0x017896 0B:9886: 33        .byte $33   ; <0>
- D - I - - 0x017897 0B:9887: 33        .byte $33   ; <0>
- D - I - - 0x017898 0B:9888: 33        .byte $33   ; <0>
- D - I - - 0x017899 0B:9889: BA        .byte $BA   ; <ジ>
- D - I - - 0x01789A 0B:988A: 33        .byte $33   ; <0>
- D - I - - 0x01789B 0B:988B: BB        .byte $BB   ; <ズ>
- D - I - - 0x01789C 0B:988C: 33        .byte $33   ; <0>
- D - I - - 0x01789D 0B:988D: 33        .byte $33   ; <0>
- D - I - - 0x01789E 0B:988E: 33        .byte $33   ; <0>
- D - I - - 0x01789F 0B:988F: 33        .byte $33   ; <0>
- D - I - - 0x0178A0 0B:9890: 33        .byte $33   ; <0>
- D - I - - 0x0178A1 0B:9891: 33        .byte $33   ; <0>
- D - I - - 0x0178A2 0B:9892: BB        .byte $BB   ; <ズ>
- D - I - - 0x0178A3 0B:9893: 29        .byte $29   ; <る>
- D - I - - 0x0178A4 0B:9894: 33        .byte $33   ; <0>
- D - I - - 0x0178A5 0B:9895: B9        .byte $B9   ; <ザ>
- D - I - - 0x0178A6 0B:9896: 33        .byte $33   ; <0>
- D - I - - 0x0178A7 0B:9897: 33        .byte $33   ; <0>
- D - I - - 0x0178A8 0B:9898: 33        .byte $33   ; <0>
- D - I - - 0x0178A9 0B:9899: BB        .byte $BB   ; <ズ>
- D - I - - 0x0178AA 0B:989A: 2A        .byte $2A   ; <れ>
- D - I - - 0x0178AB 0B:989B: 28        .byte $28   ; <り>
- D - I - - 0x0178AC 0B:989C: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0178AD 0B:989D: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0178AE 0B:989E: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0178AF 0B:989F: BD        .byte $BD   ; <ゾ>
- D - I - - 0x0178B0 0B:98A0: BC        .byte $BC   ; <ゼ>
- D - I - - 0x0178B1 0B:98A1: C0        .byte $C0   ; <ヅ>
- D - I - - 0x0178B2 0B:98A2: 2C        .byte $2C   ; <わ>
- D - I - - 0x0178B3 0B:98A3: 25        .byte $25   ; <ゆ>
- D - I - - 0x0178B4 0B:98A4: ED        .byte $ED
- D - I - - 0x0178B5 0B:98A5: ED        .byte $ED
- D - I - - 0x0178B6 0B:98A6: 98        .byte $98
- D - I - - 0x0178B7 0B:98A7: ED        .byte $ED
- D - I - - 0x0178B8 0B:98A8: FB        .byte $FB
- D - I - - 0x0178B9 0B:98A9: B8        .byte $B8   ; <ゴ>
- D - I - - 0x0178BA 0B:98AA: B8        .byte $B8   ; <ゴ>
- D - I - - 0x0178BB 0B:98AB: B8        .byte $B8   ; <ゴ>
- D - I - - 0x0178BC 0B:98AC: F5        .byte $F5
- D - I - - 0x0178BD 0B:98AD: F5        .byte $F5
- D - I - - 0x0178BE 0B:98AE: F5        .byte $F5
- D - I - - 0x0178BF 0B:98AF: F5        .byte $F5
- D - I - - 0x0178C0 0B:98B0: FC        .byte $FC
- D - I - - 0x0178C1 0B:98B1: EE        .byte $EE
- D - I - - 0x0178C2 0B:98B2: EE        .byte $EE
- D - I - - 0x0178C3 0B:98B3: EE        .byte $EE
- D - I - - 0x0178C4 0B:98B4: F0        .byte $F0
- D - I - - 0x0178C5 0B:98B5: F0        .byte $F0
- D - I - - 0x0178C6 0B:98B6: F0        .byte $F0
- D - I - - 0x0178C7 0B:98B7: F0        .byte $F0
- D - I - - 0x0178C8 0B:98B8: F0        .byte $F0
- D - I - - 0x0178C9 0B:98B9: F0        .byte $F0
- D - I - - 0x0178CA 0B:98BA: F0        .byte $F0
- D - I - - 0x0178CB 0B:98BB: F0        .byte $F0
- D - I - - 0x0178CC 0B:98BC: 13        .byte $13   ; <て>
- D - I - - 0x0178CD 0B:98BD: 13        .byte $13   ; <て>
- D - I - - 0x0178CE 0B:98BE: 13        .byte $13   ; <て>
- D - I - - 0x0178CF 0B:98BF: 13        .byte $13   ; <て>
- D - I - - 0x0178D0 0B:98C0: 13        .byte $13   ; <て>
- D - I - - 0x0178D1 0B:98C1: 13        .byte $13   ; <て>
- D - I - - 0x0178D2 0B:98C2: 13        .byte $13   ; <て>
- D - I - - 0x0178D3 0B:98C3: 13        .byte $13   ; <て>
- D - I - - 0x0178D4 0B:98C4: 51        .byte $51   ; <チ>
- D - I - - 0x0178D5 0B:98C5: 51        .byte $51   ; <チ>
- D - I - - 0x0178D6 0B:98C6: 51        .byte $51   ; <チ>
- D - I - - 0x0178D7 0B:98C7: 51        .byte $51   ; <チ>
- D - I - - 0x0178D8 0B:98C8: 51        .byte $51   ; <チ>
- D - I - - 0x0178D9 0B:98C9: 51        .byte $51   ; <チ>
- D - I - - 0x0178DA 0B:98CA: 51        .byte $51   ; <チ>
- D - I - - 0x0178DB 0B:98CB: 51        .byte $51   ; <チ>
- D - I - - 0x0178DC 0B:98CC: 7C        .byte $7C   ; <~>
- D - I - - 0x0178DD 0B:98CD: 7D        .byte $7D   ; <ー>
- D - I - - 0x0178DE 0B:98CE: 7E        .byte $7E   ; <.>
- D - I - - 0x0178DF 0B:98CF: 0C        .byte $0C   ; <し>
- D - I - - 0x0178E0 0B:98D0: 0D        .byte $0D   ; <す>
- D - I - - 0x0178E1 0B:98D1: 0C        .byte $0C   ; <し>
- D - I - - 0x0178E2 0B:98D2: 0D        .byte $0D   ; <す>
- D - I - - 0x0178E3 0B:98D3: 0C        .byte $0C   ; <し>
- D - I - - 0x0178E4 0B:98D4: 2A        .byte $2A   ; <れ>
- D - I - - 0x0178E5 0B:98D5: 2A        .byte $2A   ; <れ>
- D - I - - 0x0178E6 0B:98D6: 7A        .byte $7A   ; <、>
- D - I - - 0x0178E7 0B:98D7: 2D        .byte $2D   ; <を>
- D - I - - 0x0178E8 0B:98D8: 6D        .byte $6D   ; <ヲ>
- D - I - - 0x0178E9 0B:98D9: 2D        .byte $2D   ; <を>
- D - I - - 0x0178EA 0B:98DA: 2D        .byte $2D   ; <を>
- D - I - - 0x0178EB 0B:98DB: 2D        .byte $2D   ; <を>
- D - I - - 0x0178EC 0B:98DC: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178ED 0B:98DD: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178EE 0B:98DE: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178EF 0B:98DF: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178F0 0B:98E0: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178F1 0B:98E1: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178F2 0B:98E2: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178F3 0B:98E3: 6F        .byte $6F   ; <ッ>
- D - I - - 0x0178F4 0B:98E4: 15        .byte $15   ; <な>
- D - I - - 0x0178F5 0B:98E5: 15        .byte $15   ; <な>
- D - I - - 0x0178F6 0B:98E6: 15        .byte $15   ; <な>
- D - I - - 0x0178F7 0B:98E7: 53        .byte $53   ; <テ>
- D - I - - 0x0178F8 0B:98E8: 54        .byte $54   ; <ト>
- D - I - - 0x0178F9 0B:98E9: 55        .byte $55   ; <ナ>
- D - I - - 0x0178FA 0B:98EA: 56        .byte $56   ; <ニ>
- D - I - - 0x0178FB 0B:98EB: 56        .byte $56   ; <ニ>
- D - I - - 0x0178FC 0B:98EC: 4E        .byte $4E   ; <セ>
- D - I - - 0x0178FD 0B:98ED: 50        .byte $50   ; <タ>
- D - I - - 0x0178FE 0B:98EE: 15        .byte $15   ; <な>
- D - I - - 0x0178FF 0B:98EF: 15        .byte $15   ; <な>
- D - I - - 0x017900 0B:98F0: 53        .byte $53   ; <テ>
- D - I - - 0x017901 0B:98F1: 54        .byte $54   ; <ト>
- D - I - - 0x017902 0B:98F2: 55        .byte $55   ; <ナ>
- D - I - - 0x017903 0B:98F3: 56        .byte $56   ; <ニ>
- D - I - - 0x017904 0B:98F4: 4D        .byte $4D   ; <ス>
- D - I - - 0x017905 0B:98F5: 4E        .byte $4E   ; <セ>
- D - I - - 0x017906 0B:98F6: 15        .byte $15   ; <な>
- D - I - - 0x017907 0B:98F7: 15        .byte $15   ; <な>
- D - I - - 0x017908 0B:98F8: 15        .byte $15   ; <な>
- D - I - - 0x017909 0B:98F9: 53        .byte $53   ; <テ>
- D - I - - 0x01790A 0B:98FA: 54        .byte $54   ; <ト>
- D - I - - 0x01790B 0B:98FB: 55        .byte $55   ; <ナ>
- D - I - - 0x01790C 0B:98FC: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01790D 0B:98FD: 4F        .byte $4F   ; <ソ>
- D - I - - 0x01790E 0B:98FE: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01790F 0B:98FF: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017910 0B:9900: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017911 0B:9901: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017912 0B:9902: 51        .byte $51   ; <チ>
- D - I - - 0x017913 0B:9903: 52        .byte $52   ; <ツ>
- D - I - - 0x017914 0B:9904: 60        .byte $60   ; <ミ>
- D - I - - 0x017915 0B:9905: 60        .byte $60   ; <ミ>
- D - I - - 0x017916 0B:9906: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017917 0B:9907: 5E        .byte $5E   ; <ホ>
- D - I - - 0x017918 0B:9908: 5F        .byte $5F   ; <マ>
- D - I - - 0x017919 0B:9909: 15        .byte $15   ; <な>
- D - I - - 0x01791A 0B:990A: 15        .byte $15   ; <な>
- D - I - - 0x01791B 0B:990B: 15        .byte $15   ; <な>
- D - I - - 0x01791C 0B:990C: 60        .byte $60   ; <ミ>
- D - I - - 0x01791D 0B:990D: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x01791E 0B:990E: 5E        .byte $5E   ; <ホ>
- D - I - - 0x01791F 0B:990F: 5F        .byte $5F   ; <マ>
- D - I - - 0x017920 0B:9910: 15        .byte $15   ; <な>
- D - I - - 0x017921 0B:9911: 15        .byte $15   ; <な>
- D - I - - 0x017922 0B:9912: 57        .byte $57   ; <ヌ>
- D - I - - 0x017923 0B:9913: 59        .byte $59   ; <ノ>
- D - I - - 0x017924 0B:9914: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017925 0B:9915: 5E        .byte $5E   ; <ホ>
- D - I - - 0x017926 0B:9916: 5F        .byte $5F   ; <マ>
- D - I - - 0x017927 0B:9917: 15        .byte $15   ; <な>
- D - I - - 0x017928 0B:9918: 15        .byte $15   ; <な>
- D - I - - 0x017929 0B:9919: 15        .byte $15   ; <な>
- D - I - - 0x01792A 0B:991A: 59        .byte $59   ; <ノ>
- D - I - - 0x01792B 0B:991B: 5A        .byte $5A   ; <ハ>
- D - I - - 0x01792C 0B:991C: 5B        .byte $5B   ; <ヒ>
- D - I - - 0x01792D 0B:991D: 5C        .byte $5C   ; <フ>
- D - I - - 0x01792E 0B:991E: 3E        .byte $3E   ; <Jr>
- D - I - - 0x01792F 0B:991F: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017930 0B:9920: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017931 0B:9921: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017932 0B:9922: 58        .byte $58   ; <ネ>
- D - I - - 0x017933 0B:9923: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017934 0B:9924: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017935 0B:9925: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017936 0B:9926: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017937 0B:9927: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017938 0B:9928: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017939 0B:9929: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01793A 0B:992A: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01793B 0B:992B: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01793C 0B:992C: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01793D 0B:992D: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01793E 0B:992E: F6        .byte $F6
- D - I - - 0x01793F 0B:992F: F6        .byte $F6
- D - I - - 0x017940 0B:9930: F6        .byte $F6
- D - I - - 0x017941 0B:9931: F6        .byte $F6
- D - I - - 0x017942 0B:9932: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017943 0B:9933: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017944 0B:9934: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017945 0B:9935: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017946 0B:9936: C3        .byte $C3   ; <バ>
- D - I - - 0x017947 0B:9937: C3        .byte $C3   ; <バ>
- D - I - - 0x017948 0B:9938: C3        .byte $C3   ; <バ>
- D - I - - 0x017949 0B:9939: C3        .byte $C3   ; <バ>
- D - I - - 0x01794A 0B:993A: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01794B 0B:993B: B7        .byte $B7   ; <ゲ>
- D - I - - 0x01794C 0B:993C: F3        .byte $F3
- D - I - - 0x01794D 0B:993D: F3        .byte $F3
- D - I - - 0x01794E 0B:993E: F3        .byte $F3
- D - I - - 0x01794F 0B:993F: F3        .byte $F3
- D - I - - 0x017950 0B:9940: F3        .byte $F3
- D - I - - 0x017951 0B:9941: F3        .byte $F3
- D - I - - 0x017952 0B:9942: F3        .byte $F3
- D - I - - 0x017953 0B:9943: F3        .byte $F3
- D - I - - 0x017954 0B:9944: 26        .byte $26   ; <よ>
- D - I - - 0x017955 0B:9945: 26        .byte $26   ; <よ>
- D - I - - 0x017956 0B:9946: 26        .byte $26   ; <よ>
- D - I - - 0x017957 0B:9947: 26        .byte $26   ; <よ>
- D - I - - 0x017958 0B:9948: 26        .byte $26   ; <よ>
- D - I - - 0x017959 0B:9949: 26        .byte $26   ; <よ>
- D - I - - 0x01795A 0B:994A: 26        .byte $26   ; <よ>
- D - I - - 0x01795B 0B:994B: 26        .byte $26   ; <よ>
- D - I - - 0x01795C 0B:994C: 26        .byte $26   ; <よ>
- D - I - - 0x01795D 0B:994D: 26        .byte $26   ; <よ>
- D - I - - 0x01795E 0B:994E: F0        .byte $F0
- D - I - - 0x01795F 0B:994F: F1        .byte $F1
- D - I - - 0x017960 0B:9950: F0        .byte $F0
- D - I - - 0x017961 0B:9951: F4        .byte $F4
- D - I - - 0x017962 0B:9952: 26        .byte $26   ; <よ>
- D - I - - 0x017963 0B:9953: 26        .byte $26   ; <よ>
- D - I - - 0x017964 0B:9954: 26        .byte $26   ; <よ>
- D - I - - 0x017965 0B:9955: 26        .byte $26   ; <よ>
- D - I - - 0x017966 0B:9956: 93        .byte $93   ; <Y>
- D - I - - 0x017967 0B:9957: F3        .byte $F3
- D - I - - 0x017968 0B:9958: F2        .byte $F2
- D - I - - 0x017969 0B:9959: F5        .byte $F5
- D - I - - 0x01796A 0B:995A: 26        .byte $26   ; <よ>
- D - I - - 0x01796B 0B:995B: 26        .byte $26   ; <よ>
- D - I - - 0x01796C 0B:995C: 25        .byte $25   ; <ゆ>
- D - I - - 0x01796D 0B:995D: 25        .byte $25   ; <ゆ>
- D - I - - 0x01796E 0B:995E: 25        .byte $25   ; <ゆ>
- D - I - - 0x01796F 0B:995F: 25        .byte $25   ; <ゆ>
- D - I - - 0x017970 0B:9960: 25        .byte $25   ; <ゆ>
- D - I - - 0x017971 0B:9961: 25        .byte $25   ; <ゆ>
- D - I - - 0x017972 0B:9962: 25        .byte $25   ; <ゆ>
- D - I - - 0x017973 0B:9963: 25        .byte $25   ; <ゆ>
- D - I - - 0x017974 0B:9964: 26        .byte $26   ; <よ>
- D - I - - 0x017975 0B:9965: 00        .byte $00
- D - I - - 0x017976 0B:9966: F0        .byte $F0
- D - I - - 0x017977 0B:9967: 01        .byte $01   ; <あ>
- D - I - - 0x017978 0B:9968: F0        .byte $F0
- D - I - - 0x017979 0B:9969: 02        .byte $02   ; <い>
- D - I - - 0x01797A 0B:996A: 03        .byte $03   ; <う>
- D - I - - 0x01797B 0B:996B: 26        .byte $26   ; <よ>
- D - I - - 0x01797C 0B:996C: 26        .byte $26   ; <よ>
- D - I - - 0x01797D 0B:996D: 04        .byte $04   ; <え>
- D - I - - 0x01797E 0B:996E: 05        .byte $05   ; <お>
- D - I - - 0x01797F 0B:996F: 06        .byte $06   ; <か>
- D - I - - 0x017980 0B:9970: 07        .byte $07   ; <き>
- D - I - - 0x017981 0B:9971: 08        .byte $08   ; <く>
- D - I - - 0x017982 0B:9972: 09        .byte $09   ; <け>
- D - I - - 0x017983 0B:9973: 26        .byte $26   ; <よ>
- D - I - - 0x017984 0B:9974: 26        .byte $26   ; <よ>
- D - I - - 0x017985 0B:9975: 0A        .byte $0A   ; <こ>
- D - I - - 0x017986 0B:9976: 0B        .byte $0B   ; <さ>
- D - I - - 0x017987 0B:9977: 0C        .byte $0C   ; <し>
- D - I - - 0x017988 0B:9978: 0D        .byte $0D   ; <す>
- D - I - - 0x017989 0B:9979: 0E        .byte $0E   ; <せ>
- D - I - - 0x01798A 0B:997A: 0F        .byte $0F   ; <そ>
- D - I - - 0x01798B 0B:997B: 26        .byte $26   ; <よ>
- D - I - - 0x01798C 0B:997C: 26        .byte $26   ; <よ>
- D - I - - 0x01798D 0B:997D: 26        .byte $26   ; <よ>
- D - I - - 0x01798E 0B:997E: 26        .byte $26   ; <よ>
- D - I - - 0x01798F 0B:997F: 26        .byte $26   ; <よ>
- D - I - - 0x017990 0B:9980: 26        .byte $26   ; <よ>
- D - I - - 0x017991 0B:9981: 26        .byte $26   ; <よ>
- D - I - - 0x017992 0B:9982: 26        .byte $26   ; <よ>
- D - I - - 0x017993 0B:9983: 26        .byte $26   ; <よ>
- D - I - - 0x017994 0B:9984: 26        .byte $26   ; <よ>
- D - I - - 0x017995 0B:9985: 00        .byte $00
- D - I - - 0x017996 0B:9986: 10        .byte $10   ; <た>
- D - I - - 0x017997 0B:9987: 11        .byte $11   ; <ち>
- D - I - - 0x017998 0B:9988: F0        .byte $F0
- D - I - - 0x017999 0B:9989: 02        .byte $02   ; <い>
- D - I - - 0x01799A 0B:998A: 03        .byte $03   ; <う>
- D - I - - 0x01799B 0B:998B: 26        .byte $26   ; <よ>
- D - I - - 0x01799C 0B:998C: 26        .byte $26   ; <よ>
- D - I - - 0x01799D 0B:998D: 12        .byte $12   ; <つ>
- D - I - - 0x01799E 0B:998E: 13        .byte $13   ; <て>
- D - I - - 0x01799F 0B:998F: 19        .byte $19   ; <の>
- D - I - - 0x0179A0 0B:9990: 1A        .byte $1A   ; <は>
- D - I - - 0x0179A1 0B:9991: 08        .byte $08   ; <く>
- D - I - - 0x0179A2 0B:9992: 09        .byte $09   ; <け>
- D - I - - 0x0179A3 0B:9993: 26        .byte $26   ; <よ>
- D - I - - 0x0179A4 0B:9994: 26        .byte $26   ; <よ>
- D - I - - 0x0179A5 0B:9995: 1B        .byte $1B   ; <ひ>
- D - I - - 0x0179A6 0B:9996: 1C        .byte $1C   ; <ふ>
- D - I - - 0x0179A7 0B:9997: 1D        .byte $1D   ; <へ>
- D - I - - 0x0179A8 0B:9998: 1E        .byte $1E   ; <ほ>
- D - I - - 0x0179A9 0B:9999: 1F        .byte $1F   ; <ま>
- D - I - - 0x0179AA 0B:999A: 0F        .byte $0F   ; <そ>
- D - I - - 0x0179AB 0B:999B: 26        .byte $26   ; <よ>
- D - I - - 0x0179AC 0B:999C: 26        .byte $26   ; <よ>
- D - I - - 0x0179AD 0B:999D: 26        .byte $26   ; <よ>
- D - I - - 0x0179AE 0B:999E: 26        .byte $26   ; <よ>
- D - I - - 0x0179AF 0B:999F: 26        .byte $26   ; <よ>
- D - I - - 0x0179B0 0B:99A0: 26        .byte $26   ; <よ>
- D - I - - 0x0179B1 0B:99A1: 26        .byte $26   ; <よ>
- D - I - - 0x0179B2 0B:99A2: 26        .byte $26   ; <よ>
- D - I - - 0x0179B3 0B:99A3: 26        .byte $26   ; <よ>
- D - I - - 0x0179B4 0B:99A4: 26        .byte $26   ; <よ>
- D - I - - 0x0179B5 0B:99A5: 20        .byte $20   ; <み>
- D - I - - 0x0179B6 0B:99A6: F0        .byte $F0
- D - I - - 0x0179B7 0B:99A7: F0        .byte $F0
- D - I - - 0x0179B8 0B:99A8: F0        .byte $F0
- D - I - - 0x0179B9 0B:99A9: 21        .byte $21   ; <む>
- D - I - - 0x0179BA 0B:99AA: F4        .byte $F4
- D - I - - 0x0179BB 0B:99AB: 26        .byte $26   ; <よ>
- D - I - - 0x0179BC 0B:99AC: 26        .byte $26   ; <よ>
- D - I - - 0x0179BD 0B:99AD: 22        .byte $22   ; <め>
- D - I - - 0x0179BE 0B:99AE: 23        .byte $23   ; <も>
- D - I - - 0x0179BF 0B:99AF: 93        .byte $93   ; <Y>
- D - I - - 0x0179C0 0B:99B0: 24        .byte $24   ; <や>
- D - I - - 0x0179C1 0B:99B1: F6        .byte $F6
- D - I - - 0x0179C2 0B:99B2: F7        .byte $F7
- D - I - - 0x0179C3 0B:99B3: 26        .byte $26   ; <よ>
- D - I - - 0x0179C4 0B:99B4: 26        .byte $26   ; <よ>
- D - I - - 0x0179C5 0B:99B5: F8        .byte $F8
- D - I - - 0x0179C6 0B:99B6: F9        .byte $F9
- D - I - - 0x0179C7 0B:99B7: FA        .byte $FA
- D - I - - 0x0179C8 0B:99B8: FB        .byte $FB
- D - I - - 0x0179C9 0B:99B9: FC        .byte $FC
- D - I - - 0x0179CA 0B:99BA: FD        .byte $FD
- D - I - - 0x0179CB 0B:99BB: 26        .byte $26   ; <よ>
- D - I - - 0x0179CC 0B:99BC: 26        .byte $26   ; <よ>
- D - I - - 0x0179CD 0B:99BD: 26        .byte $26   ; <よ>
- D - I - - 0x0179CE 0B:99BE: 26        .byte $26   ; <よ>
- D - I - - 0x0179CF 0B:99BF: 26        .byte $26   ; <よ>
- D - I - - 0x0179D0 0B:99C0: 26        .byte $26   ; <よ>
- D - I - - 0x0179D1 0B:99C1: 26        .byte $26   ; <よ>
- D - I - - 0x0179D2 0B:99C2: 26        .byte $26   ; <よ>
- D - I - - 0x0179D3 0B:99C3: 26        .byte $26   ; <よ>
- D - I - - 0x0179D4 0B:99C4: 15        .byte $15   ; <な>
- D - I - - 0x0179D5 0B:99C5: 16        .byte $16   ; <に>
- D - I - - 0x0179D6 0B:99C6: 15        .byte $15   ; <な>
- D - I - - 0x0179D7 0B:99C7: 16        .byte $16   ; <に>
- D - I - - 0x0179D8 0B:99C8: 16        .byte $16   ; <に>
- D - I - - 0x0179D9 0B:99C9: 15        .byte $15   ; <な>
- D - I - - 0x0179DA 0B:99CA: 16        .byte $16   ; <に>
- D - I - - 0x0179DB 0B:99CB: 15        .byte $15   ; <な>
- D - I - - 0x0179DC 0B:99CC: 19        .byte $19   ; <の>
- D - I - - 0x0179DD 0B:99CD: 1A        .byte $1A   ; <は>
- D - I - - 0x0179DE 0B:99CE: 19        .byte $19   ; <の>
- D - I - - 0x0179DF 0B:99CF: 1A        .byte $1A   ; <は>
- D - I - - 0x0179E0 0B:99D0: 1A        .byte $1A   ; <は>
- D - I - - 0x0179E1 0B:99D1: 19        .byte $19   ; <の>
- D - I - - 0x0179E2 0B:99D2: 1A        .byte $1A   ; <は>
- D - I - - 0x0179E3 0B:99D3: 19        .byte $19   ; <の>
- D - I - - 0x0179E4 0B:99D4: 14        .byte $14   ; <と>
- D - I - - 0x0179E5 0B:99D5: 14        .byte $14   ; <と>
- D - I - - 0x0179E6 0B:99D6: 14        .byte $14   ; <と>
- D - I - - 0x0179E7 0B:99D7: 14        .byte $14   ; <と>
- D - I - - 0x0179E8 0B:99D8: 14        .byte $14   ; <と>
- D - I - - 0x0179E9 0B:99D9: 14        .byte $14   ; <と>
- D - I - - 0x0179EA 0B:99DA: 14        .byte $14   ; <と>
- D - I - - 0x0179EB 0B:99DB: 14        .byte $14   ; <と>
- D - I - - 0x0179EC 0B:99DC: 13        .byte $13   ; <て>
- D - I - - 0x0179ED 0B:99DD: 13        .byte $13   ; <て>
- D - I - - 0x0179EE 0B:99DE: 13        .byte $13   ; <て>
- D - I - - 0x0179EF 0B:99DF: 13        .byte $13   ; <て>
- D - I - - 0x0179F0 0B:99E0: 13        .byte $13   ; <て>
- D - I - - 0x0179F1 0B:99E1: 13        .byte $13   ; <て>
- D - I - - 0x0179F2 0B:99E2: 13        .byte $13   ; <て>
- D - I - - 0x0179F3 0B:99E3: 13        .byte $13   ; <て>
- D - I - - 0x0179F4 0B:99E4: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179F5 0B:99E5: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179F6 0B:99E6: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179F7 0B:99E7: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179F8 0B:99E8: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179F9 0B:99E9: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FA 0B:99EA: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FB 0B:99EB: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FC 0B:99EC: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FD 0B:99ED: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FE 0B:99EE: B7        .byte $B7   ; <ゲ>
- D - I - - 0x0179FF 0B:99EF: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A00 0B:99F0: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A01 0B:99F1: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A02 0B:99F2: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A03 0B:99F3: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A04 0B:99F4: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A05 0B:99F5: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A06 0B:99F6: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A07 0B:99F7: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A08 0B:99F8: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A09 0B:99F9: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0A 0B:99FA: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0B 0B:99FB: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0C 0B:99FC: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0D 0B:99FD: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0E 0B:99FE: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A0F 0B:99FF: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A10 0B:9A00: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A11 0B:9A01: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A12 0B:9A02: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A13 0B:9A03: B7        .byte $B7   ; <ゲ>
- D - I - - 0x017A14 0B:9A04: 15        .byte $15   ; <な>
- D - I - - 0x017A15 0B:9A05: 16        .byte $16   ; <に>
- D - I - - 0x017A16 0B:9A06: 15        .byte $15   ; <な>
- D - I - - 0x017A17 0B:9A07: 16        .byte $16   ; <に>
- D - I - - 0x017A18 0B:9A08: 15        .byte $15   ; <な>
- D - I - - 0x017A19 0B:9A09: 16        .byte $16   ; <に>
- D - I - - 0x017A1A 0B:9A0A: 15        .byte $15   ; <な>
- D - I - - 0x017A1B 0B:9A0B: 16        .byte $16   ; <に>
- D - I - - 0x017A1C 0B:9A0C: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A1D 0B:9A0D: 18        .byte $18   ; <ね>
- D - I - - 0x017A1E 0B:9A0E: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A1F 0B:9A0F: 18        .byte $18   ; <ね>
- D - I - - 0x017A20 0B:9A10: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A21 0B:9A11: 18        .byte $18   ; <ね>
- D - I - - 0x017A22 0B:9A12: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A23 0B:9A13: 18        .byte $18   ; <ね>
- D - I - - 0x017A24 0B:9A14: 26        .byte $26   ; <よ>
- D - I - - 0x017A25 0B:9A15: 26        .byte $26   ; <よ>
- D - I - - 0x017A26 0B:9A16: 26        .byte $26   ; <よ>
- D - I - - 0x017A27 0B:9A17: 26        .byte $26   ; <よ>
- D - I - - 0x017A28 0B:9A18: 26        .byte $26   ; <よ>
- D - I - - 0x017A29 0B:9A19: 26        .byte $26   ; <よ>
- D - I - - 0x017A2A 0B:9A1A: 26        .byte $26   ; <よ>
- D - I - - 0x017A2B 0B:9A1B: 26        .byte $26   ; <よ>
- D - I - - 0x017A2C 0B:9A1C: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A2D 0B:9A1D: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A2E 0B:9A1E: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A2F 0B:9A1F: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A30 0B:9A20: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A31 0B:9A21: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A32 0B:9A22: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A33 0B:9A23: 25        .byte $25   ; <ゆ>
- D - I - - 0x017A34 0B:9A24: 15        .byte $15   ; <な>
- D - I - - 0x017A35 0B:9A25: 1A        .byte $1A   ; <は>
- D - I - - 0x017A36 0B:9A26: 18        .byte $18   ; <ね>
- D - I - - 0x017A37 0B:9A27: 15        .byte $15   ; <な>
- D - I - - 0x017A38 0B:9A28: 15        .byte $15   ; <な>
- D - I - - 0x017A39 0B:9A29: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A3A 0B:9A2A: 15        .byte $15   ; <な>
- D - I - - 0x017A3B 0B:9A2B: 15        .byte $15   ; <な>
- D - I - - 0x017A3C 0B:9A2C: 15        .byte $15   ; <な>
- D - I - - 0x017A3D 0B:9A2D: 15        .byte $15   ; <な>
- D - I - - 0x017A3E 0B:9A2E: 15        .byte $15   ; <な>
- D - I - - 0x017A3F 0B:9A2F: 15        .byte $15   ; <な>
- D - I - - 0x017A40 0B:9A30: 15        .byte $15   ; <な>
- D - I - - 0x017A41 0B:9A31: 15        .byte $15   ; <な>
- D - I - - 0x017A42 0B:9A32: 18        .byte $18   ; <ね>
- D - I - - 0x017A43 0B:9A33: 40        .byte $40   ; <「>
- D - I - - 0x017A44 0B:9A34: 1A        .byte $1A   ; <は>
- D - I - - 0x017A45 0B:9A35: 15        .byte $15   ; <な>
- D - I - - 0x017A46 0B:9A36: 15        .byte $15   ; <な>
- D - I - - 0x017A47 0B:9A37: 16        .byte $16   ; <に>
- D - I - - 0x017A48 0B:9A38: 15        .byte $15   ; <な>
- D - I - - 0x017A49 0B:9A39: 40        .byte $40   ; <「>
- D - I - - 0x017A4A 0B:9A3A: 41        .byte $41   ; <ア>
- D - I - - 0x017A4B 0B:9A3B: 42        .byte $42   ; <イ>
- D - I - - 0x017A4C 0B:9A3C: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A4D 0B:9A3D: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A4E 0B:9A3E: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A4F 0B:9A3F: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A50 0B:9A40: 3F        .byte $3F   ; <•>
- D - I - - 0x017A51 0B:9A41: 45        .byte $45   ; <オ>
- D - I - - 0x017A52 0B:9A42: 44        .byte $44   ; <エ>
- D - I - - 0x017A53 0B:9A43: 44        .byte $44   ; <エ>
- D - I - - 0x017A54 0B:9A44: 15        .byte $15   ; <な>
- D - I - - 0x017A55 0B:9A45: 16        .byte $16   ; <に>
- D - I - - 0x017A56 0B:9A46: 15        .byte $15   ; <な>
- D - I - - 0x017A57 0B:9A47: 15        .byte $15   ; <な>
- D - I - - 0x017A58 0B:9A48: 15        .byte $15   ; <な>
- D - I - - 0x017A59 0B:9A49: 15        .byte $15   ; <な>
- D - I - - 0x017A5A 0B:9A4A: 17        .byte $17   ; <ぬ>
- D - I - - 0x017A5B 0B:9A4B: 15        .byte $15   ; <な>
- D - I - - 0x017A5C 0B:9A4C: 4A        .byte $4A   ; <コ>
- D - I - - 0x017A5D 0B:9A4D: 15        .byte $15   ; <な>
- D - I - - 0x017A5E 0B:9A4E: 15        .byte $15   ; <な>
- D - I - - 0x017A5F 0B:9A4F: 15        .byte $15   ; <な>
- D - I - - 0x017A60 0B:9A50: 15        .byte $15   ; <な>
- D - I - - 0x017A61 0B:9A51: 18        .byte $18   ; <ね>
- D - I - - 0x017A62 0B:9A52: 15        .byte $15   ; <な>
- D - I - - 0x017A63 0B:9A53: 15        .byte $15   ; <な>
- D - I - - 0x017A64 0B:9A54: 48        .byte $48   ; <ク>
- D - I - - 0x017A65 0B:9A55: 49        .byte $49   ; <ケ>
- D - I - - 0x017A66 0B:9A56: 4A        .byte $4A   ; <コ>
- D - I - - 0x017A67 0B:9A57: 16        .byte $16   ; <に>
- D - I - - 0x017A68 0B:9A58: 15        .byte $15   ; <な>
- D - I - - 0x017A69 0B:9A59: 15        .byte $15   ; <な>
- D - I - - 0x017A6A 0B:9A5A: 1A        .byte $1A   ; <は>
- D - I - - 0x017A6B 0B:9A5B: 18        .byte $18   ; <ね>
- D - I - - 0x017A6C 0B:9A5C: 4B        .byte $4B   ; <サ>
- D - I - - 0x017A6D 0B:9A5D: 4B        .byte $4B   ; <サ>
- D - I - - 0x017A6E 0B:9A5E: 46        .byte $46   ; <カ>
- D - I - - 0x017A6F 0B:9A5F: 47        .byte $47   ; <キ>
- D - I - - 0x017A70 0B:9A60: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A71 0B:9A61: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A72 0B:9A62: 3E        .byte $3E   ; <Jr>
- D - I - - 0x017A73 0B:9A63: 3E        .byte $3E   ; <Jr>
- - - - - - 0x017A74 0B:9A64: 36        .byte $36   ; <3>
- - - - - - 0x017A75 0B:9A65: 36        .byte $36   ; <3>
- - - - - - 0x017A76 0B:9A66: 36        .byte $36   ; <3>
- - - - - - 0x017A77 0B:9A67: 8E        .byte $8E   ; <L>
- - - - - - 0x017A78 0B:9A68: B2        .byte $B2   ; <べ>
- - - - - - 0x017A79 0B:9A69: 36        .byte $36   ; <3>
- - - - - - 0x017A7A 0B:9A6A: 36        .byte $36   ; <3>
- - - - - - 0x017A7B 0B:9A6B: 36        .byte $36   ; <3>
- - - - - - 0x017A7C 0B:9A6C: 55        .byte $55   ; <ナ>
- - - - - - 0x017A7D 0B:9A6D: 55        .byte $55   ; <ナ>
- - - - - - 0x017A7E 0B:9A6E: 55        .byte $55   ; <ナ>
- - - - - - 0x017A7F 0B:9A6F: 55        .byte $55   ; <ナ>
- - - - - - 0x017A80 0B:9A70: 8F        .byte $8F   ; <S>
- - - - - - 0x017A81 0B:9A71: 55        .byte $55   ; <ナ>
- - - - - - 0x017A82 0B:9A72: 55        .byte $55   ; <ナ>
- - - - - - 0x017A83 0B:9A73: 55        .byte $55   ; <ナ>
- - - - - - 0x017A84 0B:9A74: 56        .byte $56   ; <ニ>
- - - - - - 0x017A85 0B:9A75: 56        .byte $56   ; <ニ>
- - - - - - 0x017A86 0B:9A76: 56        .byte $56   ; <ニ>
- - - - - - 0x017A87 0B:9A77: 56        .byte $56   ; <ニ>
- - - - - - 0x017A88 0B:9A78: 56        .byte $56   ; <ニ>
- - - - - - 0x017A89 0B:9A79: 45        .byte $45   ; <オ>
- - - - - - 0x017A8A 0B:9A7A: 46        .byte $46   ; <カ>
- - - - - - 0x017A8B 0B:9A7B: 56        .byte $56   ; <ニ>
- - - - - - 0x017A8C 0B:9A7C: 44        .byte $44   ; <エ>
- - - - - - 0x017A8D 0B:9A7D: 44        .byte $44   ; <エ>
- - - - - - 0x017A8E 0B:9A7E: 44        .byte $44   ; <エ>
- - - - - - 0x017A8F 0B:9A7F: 44        .byte $44   ; <エ>
- - - - - - 0x017A90 0B:9A80: 44        .byte $44   ; <エ>
- - - - - - 0x017A91 0B:9A81: 44        .byte $44   ; <エ>
- - - - - - 0x017A92 0B:9A82: 47        .byte $47   ; <キ>
- - - - - - 0x017A93 0B:9A83: 44        .byte $44   ; <エ>
- - - - - - 0x017A94 0B:9A84: 36        .byte $36   ; <3>
- - - - - - 0x017A95 0B:9A85: 36        .byte $36   ; <3>
- - - - - - 0x017A96 0B:9A86: 36        .byte $36   ; <3>
- - - - - - 0x017A97 0B:9A87: A0        .byte $A0   ; <が>
- - - - - - 0x017A98 0B:9A88: 9F        .byte $9F
- - - - - - 0x017A99 0B:9A89: 36        .byte $36   ; <3>
- - - - - - 0x017A9A 0B:9A8A: 36        .byte $36   ; <3>
- - - - - - 0x017A9B 0B:9A8B: 36        .byte $36   ; <3>
- - - - - - 0x017A9C 0B:9A8C: 55        .byte $55   ; <ナ>
- - - - - - 0x017A9D 0B:9A8D: 55        .byte $55   ; <ナ>
- - - - - - 0x017A9E 0B:9A8E: 55        .byte $55   ; <ナ>
- - - - - - 0x017A9F 0B:9A8F: A3        .byte $A3   ; <げ>
- - - - - - 0x017AA0 0B:9A90: 55        .byte $55   ; <ナ>
- - - - - - 0x017AA1 0B:9A91: 55        .byte $55   ; <ナ>
- - - - - - 0x017AA2 0B:9A92: 55        .byte $55   ; <ナ>
- - - - - - 0x017AA3 0B:9A93: 55        .byte $55   ; <ナ>
- - - - - - 0x017AA4 0B:9A94: 56        .byte $56   ; <ニ>
- - - - - - 0x017AA5 0B:9A95: 71        .byte $71   ; <ュ>
- - - - - - 0x017AA6 0B:9A96: 72        .byte $72   ; <ョ>
- - - - - - 0x017AA7 0B:9A97: 56        .byte $56   ; <ニ>
- - - - - - 0x017AA8 0B:9A98: 56        .byte $56   ; <ニ>
- - - - - - 0x017AA9 0B:9A99: 56        .byte $56   ; <ニ>
- - - - - - 0x017AAA 0B:9A9A: 56        .byte $56   ; <ニ>
- - - - - - 0x017AAB 0B:9A9B: 56        .byte $56   ; <ニ>
- - - - - - 0x017AAC 0B:9A9C: 44        .byte $44   ; <エ>
- - - - - - 0x017AAD 0B:9A9D: 73        .byte $73   ; <ヮ>
- - - - - - 0x017AAE 0B:9A9E: 44        .byte $44   ; <エ>
- - - - - - 0x017AAF 0B:9A9F: 44        .byte $44   ; <エ>
- - - - - - 0x017AB0 0B:9AA0: 44        .byte $44   ; <エ>
- - - - - - 0x017AB1 0B:9AA1: 44        .byte $44   ; <エ>
- - - - - - 0x017AB2 0B:9AA2: 44        .byte $44   ; <エ>
- - - - - - 0x017AB3 0B:9AA3: 44        .byte $44   ; <エ>
- D - I - - 0x017AB4 0B:9AA4: 00        .byte $00
- D - I - - 0x017AB5 0B:9AA5: 08        .byte $08   ; <く>
- D - I - - 0x017AB6 0B:9AA6: 00        .byte $00
- D - I - - 0x017AB7 0B:9AA7: 00        .byte $00
- D - I - - 0x017AB8 0B:9AA8: 06        .byte $06   ; <か>
- D - I - - 0x017AB9 0B:9AA9: 07        .byte $07   ; <き>
- D - I - - 0x017ABA 0B:9AAA: 00        .byte $00
- D - I - - 0x017ABB 0B:9AAB: 0A        .byte $0A   ; <こ>
- D - I - - 0x017ABC 0B:9AAC: 0C        .byte $0C   ; <し>
- D - I - - 0x017ABD 0B:9AAD: 0D        .byte $0D   ; <す>
- D - I - - 0x017ABE 0B:9AAE: F7        .byte $F7
- D - I - - 0x017ABF 0B:9AAF: 0D        .byte $0D   ; <す>
- D - I - - 0x017AC0 0B:9AB0: 0C        .byte $0C   ; <し>
- D - I - - 0x017AC1 0B:9AB1: 0D        .byte $0D   ; <す>
- D - I - - 0x017AC2 0B:9AB2: 0C        .byte $0C   ; <し>
- D - I - - 0x017AC3 0B:9AB3: 0D        .byte $0D   ; <す>
- D - I - - 0x017AC4 0B:9AB4: 14        .byte $14   ; <と>
- D - I - - 0x017AC5 0B:9AB5: 14        .byte $14   ; <と>
- D - I - - 0x017AC6 0B:9AB6: F9        .byte $F9
- D - I - - 0x017AC7 0B:9AB7: FA        .byte $FA
- D - I - - 0x017AC8 0B:9AB8: FA        .byte $FA
- D - I - - 0x017AC9 0B:9AB9: FA        .byte $FA
- D - I - - 0x017ACA 0B:9ABA: FA        .byte $FA
- D - I - - 0x017ACB 0B:9ABB: FA        .byte $FA
- D - I - - 0x017ACC 0B:9ABC: 13        .byte $13   ; <て>
- D - I - - 0x017ACD 0B:9ABD: 13        .byte $13   ; <て>
- D - I - - 0x017ACE 0B:9ABE: F8        .byte $F8
- D - I - - 0x017ACF 0B:9ABF: 13        .byte $13   ; <て>
- D - I - - 0x017AD0 0B:9AC0: 13        .byte $13   ; <て>
- D - I - - 0x017AD1 0B:9AC1: 13        .byte $13   ; <て>
- D - I - - 0x017AD2 0B:9AC2: 13        .byte $13   ; <て>
- D - I - - 0x017AD3 0B:9AC3: 13        .byte $13   ; <て>
- D - I - - 0x017AD4 0B:9AC4: 10        .byte $10   ; <た>
- D - I - - 0x017AD5 0B:9AC5: 1B        .byte $1B   ; <ひ>
- D - I - - 0x017AD6 0B:9AC6: 10        .byte $10   ; <た>
- D - I - - 0x017AD7 0B:9AC7: 29        .byte $29   ; <る>
- D - I - - 0x017AD8 0B:9AC8: 10        .byte $10   ; <た>
- D - I - - 0x017AD9 0B:9AC9: 10        .byte $10   ; <た>
- D - I - - 0x017ADA 0B:9ACA: 10        .byte $10   ; <た>
- D - I - - 0x017ADB 0B:9ACB: 10        .byte $10   ; <た>
- D - I - - 0x017ADC 0B:9ACC: 14        .byte $14   ; <と>
- D - I - - 0x017ADD 0B:9ACD: 13        .byte $13   ; <て>
- D - I - - 0x017ADE 0B:9ACE: 14        .byte $14   ; <と>
- D - I - - 0x017ADF 0B:9ACF: 13        .byte $13   ; <て>
- D - I - - 0x017AE0 0B:9AD0: 14        .byte $14   ; <と>
- D - I - - 0x017AE1 0B:9AD1: 96        .byte $96
- D - I - - 0x017AE2 0B:9AD2: 14        .byte $14   ; <と>
- D - I - - 0x017AE3 0B:9AD3: 13        .byte $13   ; <て>
- D - I - - 0x017AE4 0B:9AD4: 98        .byte $98
- D - I - - 0x017AE5 0B:9AD5: 98        .byte $98
- D - I - - 0x017AE6 0B:9AD6: 98        .byte $98
- D - I - - 0x017AE7 0B:9AD7: 98        .byte $98
- D - I - - 0x017AE8 0B:9AD8: 98        .byte $98
- D - I - - 0x017AE9 0B:9AD9: 95        .byte $95
- D - I - - 0x017AEA 0B:9ADA: C4        .byte $C4   ; <ビ>
- D - I - - 0x017AEB 0B:9ADB: C4        .byte $C4   ; <ビ>
- D - I - - 0x017AEC 0B:9ADC: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AED 0B:9ADD: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AEE 0B:9ADE: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AEF 0B:9ADF: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AF0 0B:9AE0: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AF1 0B:9AE1: 97        .byte $97
- D - I - - 0x017AF2 0B:9AE2: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AF3 0B:9AE3: 1C        .byte $1C   ; <ふ>
- D - I - - 0x017AF4 0B:9AE4: 86        .byte $86   ; <F>
- D - I - - 0x017AF5 0B:9AE5: 85        .byte $85   ; <E>
- D - I - - 0x017AF6 0B:9AE6: 86        .byte $86   ; <F>
- D - I - - 0x017AF7 0B:9AE7: 85        .byte $85   ; <E>
- D - I - - 0x017AF8 0B:9AE8: 86        .byte $86   ; <F>
- D - I - - 0x017AF9 0B:9AE9: 85        .byte $85   ; <E>
- D - I - - 0x017AFA 0B:9AEA: 86        .byte $86   ; <F>
- D - I - - 0x017AFB 0B:9AEB: 85        .byte $85   ; <E>
- D - I - - 0x017AFC 0B:9AEC: 56        .byte $56   ; <ニ>
- D - I - - 0x017AFD 0B:9AED: 88        .byte $88   ; <H>
- D - I - - 0x017AFE 0B:9AEE: 89        .byte $89   ; <I>
- D - I - - 0x017AFF 0B:9AEF: 56        .byte $56   ; <ニ>
- D - I - - 0x017B00 0B:9AF0: 56        .byte $56   ; <ニ>
- D - I - - 0x017B01 0B:9AF1: 45        .byte $45   ; <オ>
- D - I - - 0x017B02 0B:9AF2: 46        .byte $46   ; <カ>
- D - I - - 0x017B03 0B:9AF3: 56        .byte $56   ; <ニ>
- D - I - - 0x017B04 0B:9AF4: 36        .byte $36   ; <3>
- D - I - - 0x017B05 0B:9AF5: 36        .byte $36   ; <3>
- D - I - - 0x017B06 0B:9AF6: 8E        .byte $8E   ; <L>
- D - I - - 0x017B07 0B:9AF7: B2        .byte $B2   ; <べ>
- D - I - - 0x017B08 0B:9AF8: 36        .byte $36   ; <3>
- D - I - - 0x017B09 0B:9AF9: 36        .byte $36   ; <3>
- D - I - - 0x017B0A 0B:9AFA: 36        .byte $36   ; <3>
- D - I - - 0x017B0B 0B:9AFB: A8        .byte $A8   ; <ぜ>
- D - I - - 0x017B0C 0B:9AFC: 44        .byte $44   ; <エ>
- D - I - - 0x017B0D 0B:9AFD: 44        .byte $44   ; <エ>
- D - I - - 0x017B0E 0B:9AFE: 44        .byte $44   ; <エ>
- D - I - - 0x017B0F 0B:9AFF: 47        .byte $47   ; <キ>
- D - I - - 0x017B10 0B:9B00: 44        .byte $44   ; <エ>
- D - I - - 0x017B11 0B:9B01: 44        .byte $44   ; <エ>
- D - I - - 0x017B12 0B:9B02: 44        .byte $44   ; <エ>
- D - I - - 0x017B13 0B:9B03: A9        .byte $A9   ; <ぞ>
- D - I - - 0x017B14 0B:9B04: 55        .byte $55   ; <ナ>
- D - I - - 0x017B15 0B:9B05: 55        .byte $55   ; <ナ>
- D - I - - 0x017B16 0B:9B06: 90        .byte $90   ; <U>
- D - I - - 0x017B17 0B:9B07: 91        .byte $91   ; <V>
- D - I - - 0x017B18 0B:9B08: 55        .byte $55   ; <ナ>
- D - I - - 0x017B19 0B:9B09: 55        .byte $55   ; <ナ>
- D - I - - 0x017B1A 0B:9B0A: 8F        .byte $8F   ; <S>
- D - I - - 0x017B1B 0B:9B0B: 55        .byte $55   ; <ナ>
- D - I - - 0x017B1C 0B:9B0C: 88        .byte $88   ; <H>
- D - I - - 0x017B1D 0B:9B0D: 89        .byte $89   ; <I>
- D - I - - 0x017B1E 0B:9B0E: 56        .byte $56   ; <ニ>
- D - I - - 0x017B1F 0B:9B0F: 56        .byte $56   ; <ニ>
- D - I - - 0x017B20 0B:9B10: 92        .byte $92   ; <W>
- D - I - - 0x017B21 0B:9B11: 87        .byte $87   ; <G>
- D - I - - 0x017B22 0B:9B12: 56        .byte $56   ; <ニ>
- D - I - - 0x017B23 0B:9B13: 56        .byte $56   ; <ニ>
- D - I - - 0x017B24 0B:9B14: 97        .byte $97
- D - I - - 0x017B25 0B:9B15: 97        .byte $97
- D - I - - 0x017B26 0B:9B16: 97        .byte $97
- D - I - - 0x017B27 0B:9B17: 97        .byte $97
- D - I - - 0x017B28 0B:9B18: 97        .byte $97
- D - I - - 0x017B29 0B:9B19: 97        .byte $97
- D - I - - 0x017B2A 0B:9B1A: 97        .byte $97
- D - I - - 0x017B2B 0B:9B1B: 97        .byte $97
- D - I - - 0x017B2C 0B:9B1C: 13        .byte $13   ; <て>
- D - I - - 0x017B2D 0B:9B1D: 13        .byte $13   ; <て>
- D - I - - 0x017B2E 0B:9B1E: 13        .byte $13   ; <て>
- D - I - - 0x017B2F 0B:9B1F: 13        .byte $13   ; <て>
- D - I - - 0x017B30 0B:9B20: 13        .byte $13   ; <て>
- D - I - - 0x017B31 0B:9B21: 13        .byte $13   ; <て>
- D - I - - 0x017B32 0B:9B22: 13        .byte $13   ; <て>
- D - I - - 0x017B33 0B:9B23: 13        .byte $13   ; <て>
- D - I - - 0x017B34 0B:9B24: 85        .byte $85   ; <E>
- D - I - - 0x017B35 0B:9B25: 99        .byte $99
- D - I - - 0x017B36 0B:9B26: 85        .byte $85   ; <E>
- D - I - - 0x017B37 0B:9B27: 99        .byte $99
- D - I - - 0x017B38 0B:9B28: 85        .byte $85   ; <E>
- D - I - - 0x017B39 0B:9B29: 99        .byte $99
- D - I - - 0x017B3A 0B:9B2A: 85        .byte $85   ; <E>
- D - I - - 0x017B3B 0B:9B2B: 99        .byte $99
- D - I - - 0x017B3C 0B:9B2C: 56        .byte $56   ; <ニ>
- D - I - - 0x017B3D 0B:9B2D: 9A        .byte $9A
- D - I - - 0x017B3E 0B:9B2E: 9B        .byte $9B
- D - I - - 0x017B3F 0B:9B2F: 56        .byte $56   ; <ニ>
- D - I - - 0x017B40 0B:9B30: 56        .byte $56   ; <ニ>
- D - I - - 0x017B41 0B:9B31: 56        .byte $56   ; <ニ>
- D - I - - 0x017B42 0B:9B32: 9C        .byte $9C
- D - I - - 0x017B43 0B:9B33: A1        .byte $A1   ; <ぎ>
- D - I - - 0x017B44 0B:9B34: A0        .byte $A0   ; <が>
- D - I - - 0x017B45 0B:9B35: 9F        .byte $9F
- D - I - - 0x017B46 0B:9B36: 36        .byte $36   ; <3>
- D - I - - 0x017B47 0B:9B37: 36        .byte $36   ; <3>
- D - I - - 0x017B48 0B:9B38: AA        .byte $AA   ; <だ>
- D - I - - 0x017B49 0B:9B39: 36        .byte $36   ; <3>
- D - I - - 0x017B4A 0B:9B3A: 36        .byte $36   ; <3>
- D - I - - 0x017B4B 0B:9B3B: 36        .byte $36   ; <3>
- D - I - - 0x017B4C 0B:9B3C: 73        .byte $73   ; <ヮ>
- D - I - - 0x017B4D 0B:9B3D: 44        .byte $44   ; <エ>
- D - I - - 0x017B4E 0B:9B3E: 44        .byte $44   ; <エ>
- D - I - - 0x017B4F 0B:9B3F: 44        .byte $44   ; <エ>
- D - I - - 0x017B50 0B:9B40: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017B51 0B:9B41: 44        .byte $44   ; <エ>
- D - I - - 0x017B52 0B:9B42: 44        .byte $44   ; <エ>
- D - I - - 0x017B53 0B:9B43: 44        .byte $44   ; <エ>
- D - I - - 0x017B54 0B:9B44: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017B55 0B:9B45: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017B56 0B:9B46: B8        .byte $B8   ; <ゴ>
- D - I - - 0x017B57 0B:9B47: BF        .byte $BF   ; <ヂ>
- D - I - - 0x017B58 0B:9B48: C0        .byte $C0   ; <ヅ>
- D - I - - 0x017B59 0B:9B49: C1        .byte $C1   ; <デ>
- D - I - - 0x017B5A 0B:9B4A: ED        .byte $ED
- D - I - - 0x017B5B 0B:9B4B: ED        .byte $ED
- D - I - - 0x017B5C 0B:9B4C: EE        .byte $EE
- D - I - - 0x017B5D 0B:9B4D: EE        .byte $EE
- D - I - - 0x017B5E 0B:9B4E: EE        .byte $EE
- D - I - - 0x017B5F 0B:9B4F: EF        .byte $EF
- D - I - - 0x017B60 0B:9B50: F5        .byte $F5
- D - I - - 0x017B61 0B:9B51: F5        .byte $F5
- D - I - - 0x017B62 0B:9B52: F5        .byte $F5
- D - I - - 0x017B63 0B:9B53: F5        .byte $F5
- D - I - - 0x017B64 0B:9B54: F0        .byte $F0
- D - I - - 0x017B65 0B:9B55: F0        .byte $F0
- D - I - - 0x017B66 0B:9B56: F0        .byte $F0
- D - I - - 0x017B67 0B:9B57: F0        .byte $F0
- D - I - - 0x017B68 0B:9B58: F0        .byte $F0
- D - I - - 0x017B69 0B:9B59: F0        .byte $F0
- D - I - - 0x017B6A 0B:9B5A: F0        .byte $F0
- D - I - - 0x017B6B 0B:9B5B: F0        .byte $F0
- D - I - - 0x017B6C 0B:9B5C: 13        .byte $13   ; <て>
- D - I - - 0x017B6D 0B:9B5D: 13        .byte $13   ; <て>
- D - I - - 0x017B6E 0B:9B5E: 13        .byte $13   ; <て>
- D - I - - 0x017B6F 0B:9B5F: 13        .byte $13   ; <て>
- D - I - - 0x017B70 0B:9B60: 13        .byte $13   ; <て>
- D - I - - 0x017B71 0B:9B61: 13        .byte $13   ; <て>
- D - I - - 0x017B72 0B:9B62: 13        .byte $13   ; <て>
- D - I - - 0x017B73 0B:9B63: 13        .byte $13   ; <て>
- D - I - - 0x017B74 0B:9B64: 00        .byte $00
- D - I - - 0x017B75 0B:9B65: 00        .byte $00
- D - I - - 0x017B76 0B:9B66: 00        .byte $00
- D - I - - 0x017B77 0B:9B67: 00        .byte $00
- D - I - - 0x017B78 0B:9B68: 00        .byte $00
- D - I - - 0x017B79 0B:9B69: 00        .byte $00
- D - I - - 0x017B7A 0B:9B6A: 00        .byte $00
- D - I - - 0x017B7B 0B:9B6B: 00        .byte $00
- D - I - - 0x017B7C 0B:9B6C: 00        .byte $00
- D - I - - 0x017B7D 0B:9B6D: 00        .byte $00
- D - I - - 0x017B7E 0B:9B6E: 00        .byte $00
- D - I - - 0x017B7F 0B:9B6F: 00        .byte $00
- D - I - - 0x017B80 0B:9B70: 00        .byte $00
- D - I - - 0x017B81 0B:9B71: 00        .byte $00
- D - I - - 0x017B82 0B:9B72: 00        .byte $00
- D - I - - 0x017B83 0B:9B73: 00        .byte $00
- D - I - - 0x017B84 0B:9B74: 00        .byte $00
- D - I - - 0x017B85 0B:9B75: 00        .byte $00
- D - I - - 0x017B86 0B:9B76: 00        .byte $00
- D - I - - 0x017B87 0B:9B77: 00        .byte $00
- D - I - - 0x017B88 0B:9B78: 00        .byte $00
- D - I - - 0x017B89 0B:9B79: 00        .byte $00
- D - I - - 0x017B8A 0B:9B7A: 00        .byte $00
- D - I - - 0x017B8B 0B:9B7B: 00        .byte $00
- D - I - - 0x017B8C 0B:9B7C: 00        .byte $00
- D - I - - 0x017B8D 0B:9B7D: 00        .byte $00
- D - I - - 0x017B8E 0B:9B7E: 00        .byte $00
- D - I - - 0x017B8F 0B:9B7F: 00        .byte $00
- D - I - - 0x017B90 0B:9B80: 00        .byte $00
- D - I - - 0x017B91 0B:9B81: 00        .byte $00
- D - I - - 0x017B92 0B:9B82: 00        .byte $00
- D - I - - 0x017B93 0B:9B83: 00        .byte $00
- D - I - - 0x017B94 0B:9B84: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B95 0B:9B85: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B96 0B:9B86: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B97 0B:9B87: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B98 0B:9B88: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B99 0B:9B89: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B9A 0B:9B8A: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B9B 0B:9B8B: C4        .byte $C4   ; <ビ>
- D - I - - 0x017B9C 0B:9B8C: C9        .byte $C9   ; <ぴ>
- D - I - - 0x017B9D 0B:9B8D: CA        .byte $CA   ; <ぷ>
- D - I - - 0x017B9E 0B:9B8E: D2        .byte $D2
- D - I - - 0x017B9F 0B:9B8F: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA0 0B:9B90: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA1 0B:9B91: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA2 0B:9B92: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA3 0B:9B93: D2        .byte $D2
- D - I - - 0x017BA4 0B:9B94: CB        .byte $CB   ; <ぺ>
- D - I - - 0x017BA5 0B:9B95: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017BA6 0B:9B96: C2        .byte $C2   ; <ド>
- D - I - - 0x017BA7 0B:9B97: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA8 0B:9B98: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BA9 0B:9B99: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BAA 0B:9B9A: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BAB 0B:9B9B: CD        .byte $CD   ; <パ>
- D - I - - 0x017BAC 0B:9B9C: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BAD 0B:9B9D: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BAE 0B:9B9E: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BAF 0B:9B9F: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB0 0B:9BA0: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB1 0B:9BA1: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB2 0B:9BA2: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB3 0B:9BA3: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB4 0B:9BA4: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB5 0B:9BA5: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB6 0B:9BA6: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB7 0B:9BA7: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB8 0B:9BA8: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BB9 0B:9BA9: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BBA 0B:9BAA: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BBB 0B:9BAB: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BBC 0B:9BAC: C9        .byte $C9   ; <ぴ>
- D - I - - 0x017BBD 0B:9BAD: FD        .byte $FD
- D - I - - 0x017BBE 0B:9BAE: D2        .byte $D2
- D - I - - 0x017BBF 0B:9BAF: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC0 0B:9BB0: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC1 0B:9BB1: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC2 0B:9BB2: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC3 0B:9BB3: D2        .byte $D2
- D - I - - 0x017BC4 0B:9BB4: FC        .byte $FC
- D - I - - 0x017BC5 0B:9BB5: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017BC6 0B:9BB6: C2        .byte $C2   ; <ド>
- D - I - - 0x017BC7 0B:9BB7: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC8 0B:9BB8: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BC9 0B:9BB9: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BCA 0B:9BBA: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BCB 0B:9BBB: FB        .byte $FB
- D - I - - 0x017BCC 0B:9BBC: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BCD 0B:9BBD: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BCE 0B:9BBE: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BCF 0B:9BBF: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BD0 0B:9BC0: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BD1 0B:9BC1: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BD2 0B:9BC2: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BD3 0B:9BC3: C4        .byte $C4   ; <ビ>
- D - I - - 0x017BD4 0B:9BC4: 51        .byte $51   ; <チ>
- D - I - - 0x017BD5 0B:9BC5: 51        .byte $51   ; <チ>
- D - I - - 0x017BD6 0B:9BC6: 51        .byte $51   ; <チ>
- D - I - - 0x017BD7 0B:9BC7: 51        .byte $51   ; <チ>
- D - I - - 0x017BD8 0B:9BC8: 51        .byte $51   ; <チ>
- D - I - - 0x017BD9 0B:9BC9: 51        .byte $51   ; <チ>
- D - I - - 0x017BDA 0B:9BCA: 51        .byte $51   ; <チ>
- D - I - - 0x017BDB 0B:9BCB: 51        .byte $51   ; <チ>
- D - I - - 0x017BDC 0B:9BCC: 0D        .byte $0D   ; <す>
- D - I - - 0x017BDD 0B:9BCD: 0C        .byte $0C   ; <し>
- D - I - - 0x017BDE 0B:9BCE: 0D        .byte $0D   ; <す>
- D - I - - 0x017BDF 0B:9BCF: 0C        .byte $0C   ; <し>
- D - I - - 0x017BE0 0B:9BD0: 0D        .byte $0D   ; <す>
- D - I - - 0x017BE1 0B:9BD1: 7B        .byte $7B   ; <。>
- D - I - - 0x017BE2 0B:9BD2: 7C        .byte $7C   ; <~>
- D - I - - 0x017BE3 0B:9BD3: 7D        .byte $7D   ; <ー>
- D - I - - 0x017BE4 0B:9BD4: 2D        .byte $2D   ; <を>
- D - I - - 0x017BE5 0B:9BD5: 2D        .byte $2D   ; <を>
- D - I - - 0x017BE6 0B:9BD6: 2D        .byte $2D   ; <を>
- D - I - - 0x017BE7 0B:9BD7: 6E        .byte $6E   ; <ン>
- D - I - - 0x017BE8 0B:9BD8: 2D        .byte $2D   ; <を>
- D - I - - 0x017BE9 0B:9BD9: 79        .byte $79   ; <!>
- D - I - - 0x017BEA 0B:9BDA: 2A        .byte $2A   ; <れ>
- D - I - - 0x017BEB 0B:9BDB: 2A        .byte $2A   ; <れ>
- D - I - - 0x017BEC 0B:9BDC: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BED 0B:9BDD: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BEE 0B:9BDE: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BEF 0B:9BDF: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BF0 0B:9BE0: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BF1 0B:9BE1: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BF2 0B:9BE2: 6F        .byte $6F   ; <ッ>
- D - I - - 0x017BF3 0B:9BE3: 6F        .byte $6F   ; <ッ>

tbl_9BE4:
- D - I - - 0x017BF4 0B:9BE4: AA        .byte $AA   ; <だ>
- D - I - - 0x017BF5 0B:9BE5: EE        .byte $EE
- D - I - - 0x017BF6 0B:9BE6: FF        .byte $FF
- D - I - - 0x017BF7 0B:9BE7: FF        .byte $FF
- D - I - - 0x017BF8 0B:9BE8: BB        .byte $BB   ; <ズ>
- D - I - - 0x017BF9 0B:9BE9: AA        .byte $AA   ; <だ>
- D - I - - 0x017BFA 0B:9BEA: AA        .byte $AA   ; <だ>
- D - I - - 0x017BFB 0B:9BEB: AA        .byte $AA   ; <だ>
- D - I - - 0x017BFC 0B:9BEC: AA        .byte $AA   ; <だ>
- D - I - - 0x017BFD 0B:9BED: EA        .byte $EA
- D - I - - 0x017BFE 0B:9BEE: AA        .byte $AA   ; <だ>
- - - - - - 0x017BFF 0B:9BEF: BA        .byte $BA   ; <ジ>
- D - I - - 0x017C00 0B:9BF0: FF        .byte $FF
- D - I - - 0x017C01 0B:9BF1: FF        .byte $FF
- D - I - - 0x017C02 0B:9BF2: FF        .byte $FF
- D - I - - 0x017C03 0B:9BF3: FF        .byte $FF
- D - I - - 0x017C04 0B:9BF4: FF        .byte $FF
- D - I - - 0x017C05 0B:9BF5: FF        .byte $FF
- D - I - - 0x017C06 0B:9BF6: 00        .byte $00
- D - I - - 0x017C07 0B:9BF7: 00        .byte $00
- D - I - - 0x017C08 0B:9BF8: 00        .byte $00
- D - I - - 0x017C09 0B:9BF9: FA        .byte $FA
- D - I - - 0x017C0A 0B:9BFA: FA        .byte $FA
- D - I - - 0x017C0B 0B:9BFB: FF        .byte $FF
- D - I - - 0x017C0C 0B:9BFC: FF        .byte $FF
- D - I - - 0x017C0D 0B:9BFD: FF        .byte $FF
- D - I - - 0x017C0E 0B:9BFE: FF        .byte $FF
- D - I - - 0x017C0F 0B:9BFF: FF        .byte $FF
- D - I - - 0x017C10 0B:9C00: FF        .byte $FF
- D - I - - 0x017C11 0B:9C01: FF        .byte $FF
- D - I - - 0x017C12 0B:9C02: FF        .byte $FF
- D - I - - 0x017C13 0B:9C03: FF        .byte $FF
- D - I - - 0x017C14 0B:9C04: 00        .byte $00
- D - I - - 0x017C15 0B:9C05: 00        .byte $00
- D - I - - 0x017C16 0B:9C06: 00        .byte $00
- D - I - - 0x017C17 0B:9C07: 00        .byte $00
- - - - - - 0x017C18 0B:9C08: FF        .byte $FF
- D - I - - 0x017C19 0B:9C09: FF        .byte $FF
- D - I - - 0x017C1A 0B:9C0A: FF        .byte $FF
- D - I - - 0x017C1B 0B:9C0B: FF        .byte $FF
- D - I - - 0x017C1C 0B:9C0C: 00        .byte $00
- D - I - - 0x017C1D 0B:9C0D: 00        .byte $00
- D - I - - 0x017C1E 0B:9C0E: 00        .byte $00
- D - I - - 0x017C1F 0B:9C0F: 00        .byte $00
- D - I - - 0x017C20 0B:9C10: 00        .byte $00
- D - I - - 0x017C21 0B:9C11: 00        .byte $00
- D - I - - 0x017C22 0B:9C12: FF        .byte $FF
- D - I - - 0x017C23 0B:9C13: FF        .byte $FF
- D - I - - 0x017C24 0B:9C14: FF        .byte $FF
- D - I - - 0x017C25 0B:9C15: FF        .byte $FF
- D - I - - 0x017C26 0B:9C16: FF        .byte $FF
- D - I - - 0x017C27 0B:9C17: FF        .byte $FF
- D - I - - 0x017C28 0B:9C18: FF        .byte $FF
- D - I - - 0x017C29 0B:9C19: FF        .byte $FF
- D - I - - 0x017C2A 0B:9C1A: FF        .byte $FF
- D - I - - 0x017C2B 0B:9C1B: FF        .byte $FF
- D - I - - 0x017C2C 0B:9C1C: FF        .byte $FF
- D - I - - 0x017C2D 0B:9C1D: FF        .byte $FF
- D - I - - 0x017C2E 0B:9C1E: FF        .byte $FF
- D - I - - 0x017C2F 0B:9C1F: FF        .byte $FF
- D - I - - 0x017C30 0B:9C20: FF        .byte $FF
- D - I - - 0x017C31 0B:9C21: FF        .byte $FF
- D - I - - 0x017C32 0B:9C22: FF        .byte $FF
- - - - - - 0x017C33 0B:9C23: FF        .byte $FF
- - - - - - 0x017C34 0B:9C24: FF        .byte $FF
- - - - - - 0x017C35 0B:9C25: FF        .byte $FF
- - - - - - 0x017C36 0B:9C26: FF        .byte $FF
- D - I - - 0x017C37 0B:9C27: FA        .byte $FA
- D - I - - 0x017C38 0B:9C28: FF        .byte $FF
- D - I - - 0x017C39 0B:9C29: FF        .byte $FF
- D - I - - 0x017C3A 0B:9C2A: FF        .byte $FF
- D - I - - 0x017C3B 0B:9C2B: FF        .byte $FF
- D - I - - 0x017C3C 0B:9C2C: AA        .byte $AA   ; <だ>
- D - I - - 0x017C3D 0B:9C2D: AA        .byte $AA   ; <だ>
- D - I - - 0x017C3E 0B:9C2E: AA        .byte $AA   ; <だ>
- D - I - - 0x017C3F 0B:9C2F: AA        .byte $AA   ; <だ>
- D - I - - 0x017C40 0B:9C30: AA        .byte $AA   ; <だ>
- D - I - - 0x017C41 0B:9C31: 00        .byte $00
- D - I - - 0x017C42 0B:9C32: 00        .byte $00
- D - I - - 0x017C43 0B:9C33: 00        .byte $00
- - - - - - 0x017C44 0B:9C34: 00        .byte $00
- D - I - - 0x017C45 0B:9C35: AA        .byte $AA   ; <だ>
- - - - - - 0x017C46 0B:9C36: 00        .byte $00
- D - I - - 0x017C47 0B:9C37: 00        .byte $00
- D - I - - 0x017C48 0B:9C38: 00        .byte $00
- D - I - - 0x017C49 0B:9C39: FF        .byte $FF
- D - I - - 0x017C4A 0B:9C3A: FF        .byte $FF
- - - - - - 0x017C4B 0B:9C3B: FF        .byte $FF
- - - - - - 0x017C4C 0B:9C3C: FF        .byte $FF
- - - - - - 0x017C4D 0B:9C3D: FF        .byte $FF
- - - - - - 0x017C4E 0B:9C3E: FF        .byte $FF
- - - - - - 0x017C4F 0B:9C3F: FF        .byte $FF
- - - - - - 0x017C50 0B:9C40: FF        .byte $FF
- - - - - - 0x017C51 0B:9C41: FF        .byte $FF
- - - - - - 0x017C52 0B:9C42: FF        .byte $FF
- D - I - - 0x017C53 0B:9C43: FF        .byte $FF
- D - I - - 0x017C54 0B:9C44: FF        .byte $FF
- D - I - - 0x017C55 0B:9C45: FF        .byte $FF
- D - I - - 0x017C56 0B:9C46: FF        .byte $FF
- D - I - - 0x017C57 0B:9C47: FF        .byte $FF
- D - I - - 0x017C58 0B:9C48: FF        .byte $FF
- D - I - - 0x017C59 0B:9C49: FF        .byte $FF
- D - I - - 0x017C5A 0B:9C4A: FF        .byte $FF
- D - I - - 0x017C5B 0B:9C4B: FF        .byte $FF
- D - I - - 0x017C5C 0B:9C4C: FF        .byte $FF
- D - I - - 0x017C5D 0B:9C4D: 00        .byte $00
- D - I - - 0x017C5E 0B:9C4E: 00        .byte $00
- D - I - - 0x017C5F 0B:9C4F: 00        .byte $00
- D - I - - 0x017C60 0B:9C50: 00        .byte $00
- D - I - - 0x017C61 0B:9C51: 00        .byte $00
- D - I - - 0x017C62 0B:9C52: 00        .byte $00
- D - I - - 0x017C63 0B:9C53: 00        .byte $00
- D - I - - 0x017C64 0B:9C54: FA        .byte $FA
- D - I - - 0x017C65 0B:9C55: FF        .byte $FF
- D - I - - 0x017C66 0B:9C56: FF        .byte $FF
- D - I - - 0x017C67 0B:9C57: FF        .byte $FF
- D - I - - 0x017C68 0B:9C58: 00        .byte $00
- D - I - - 0x017C69 0B:9C59: FF        .byte $FF
- D - I - - 0x017C6A 0B:9C5A: FF        .byte $FF
- D - I - - 0x017C6B 0B:9C5B: FF        .byte $FF
- D - I - - 0x017C6C 0B:9C5C: FF        .byte $FF
- D - I - - 0x017C6D 0B:9C5D: 00        .byte $00
- D - I - - 0x017C6E 0B:9C5E: 00        .byte $00
- D - I - - 0x017C6F 0B:9C5F: FF        .byte $FF
- D - I - - 0x017C70 0B:9C60: FF        .byte $FF
- D - I - - 0x017C71 0B:9C61: FF        .byte $FF
- D - I - - 0x017C72 0B:9C62: FF        .byte $FF
- D - I - - 0x017C73 0B:9C63: FA        .byte $FA
- D - I - - 0x017C74 0B:9C64: FA        .byte $FA
- D - I - - 0x017C75 0B:9C65: FF        .byte $FF
- D - I - - 0x017C76 0B:9C66: FF        .byte $FF
- D - I - - 0x017C77 0B:9C67: FF        .byte $FF
- D - I - - 0x017C78 0B:9C68: FF        .byte $FF
- D - I - - 0x017C79 0B:9C69: FA        .byte $FA
- D - I - - 0x017C7A 0B:9C6A: FA        .byte $FA
- D - I - - 0x017C7B 0B:9C6B: FF        .byte $FF
- D - I - - 0x017C7C 0B:9C6C: FF        .byte $FF
- D - I - - 0x017C7D 0B:9C6D: FF        .byte $FF
- - - - - - 0x017C7E 0B:9C6E: FF        .byte $FF
- - - - - - 0x017C7F 0B:9C6F: FF        .byte $FF
- - - - - - 0x017C80 0B:9C70: FF        .byte $FF
- - - - - - 0x017C81 0B:9C71: FF        .byte $FF
- D - I - - 0x017C82 0B:9C72: FF        .byte $FF
- D - I - - 0x017C83 0B:9C73: FF        .byte $FF
- D - I - - 0x017C84 0B:9C74: FF        .byte $FF
- D - I - - 0x017C85 0B:9C75: FF        .byte $FF
- D - I - - 0x017C86 0B:9C76: FF        .byte $FF
- D - I - - 0x017C87 0B:9C77: FF        .byte $FF
- D - I - - 0x017C88 0B:9C78: FF        .byte $FF
- D - I - - 0x017C89 0B:9C79: 0F        .byte $0F   ; <そ>
- D - I - - 0x017C8A 0B:9C7A: 0F        .byte $0F   ; <そ>
- D - I - - 0x017C8B 0B:9C7B: 0F        .byte $0F   ; <そ>
- D - I - - 0x017C8C 0B:9C7C: FF        .byte $FF
- D - I - - 0x017C8D 0B:9C7D: FA        .byte $FA
- D - I - - 0x017C8E 0B:9C7E: FF        .byte $FF
- D - I - - 0x017C8F 0B:9C7F: FF        .byte $FF
- D - I - - 0x017C90 0B:9C80: FF        .byte $FF
- - - - - - 0x017C91 0B:9C81: FF        .byte $FF
- - - - - - 0x017C92 0B:9C82: FF        .byte $FF
- D - I - - 0x017C93 0B:9C83: FF        .byte $FF
- D - I - - 0x017C94 0B:9C84: FF        .byte $FF
- D - I - - 0x017C95 0B:9C85: FF        .byte $FF
- D - I - - 0x017C96 0B:9C86: FF        .byte $FF
- D - I - - 0x017C97 0B:9C87: FF        .byte $FF
- D - I - - 0x017C98 0B:9C88: FF        .byte $FF
- D - I - - 0x017C99 0B:9C89: 0F        .byte $0F   ; <そ>
- - - - - - 0x017C9A 0B:9C8A: FF        .byte $FF
- - - - - - 0x017C9B 0B:9C8B: FF        .byte $FF
- D - I - - 0x017C9C 0B:9C8C: FF        .byte $FF
- D - I - - 0x017C9D 0B:9C8D: FF        .byte $FF
- D - I - - 0x017C9E 0B:9C8E: FF        .byte $FF
- D - I - - 0x017C9F 0B:9C8F: FF        .byte $FF
- D - I - - 0x017CA0 0B:9C90: FF        .byte $FF
- D - I - - 0x017CA1 0B:9C91: FF        .byte $FF
- D - I - - 0x017CA2 0B:9C92: FF        .byte $FF
- D - I - - 0x017CA3 0B:9C93: 00        .byte $00
- D - I - - 0x017CA4 0B:9C94: FF        .byte $FF
- D - I - - 0x017CA5 0B:9C95: FF        .byte $FF
- D - I - - 0x017CA6 0B:9C96: FF        .byte $FF
- D - I - - 0x017CA7 0B:9C97: FF        .byte $FF
- D - I - - 0x017CA8 0B:9C98: 00        .byte $00
- D - I - - 0x017CA9 0B:9C99: 00        .byte $00
- D - I - - 0x017CAA 0B:9C9A: 00        .byte $00
- D - I - - 0x017CAB 0B:9C9B: FF        .byte $FF
- D - I - - 0x017CAC 0B:9C9C: FF        .byte $FF
- - - - - - 0x017CAD 0B:9C9D: FF        .byte $FF
- - - - - - 0x017CAE 0B:9C9E: FF        .byte $FF
- - - - - - 0x017CAF 0B:9C9F: FF        .byte $FF
- D - I - - 0x017CB0 0B:9CA0: FF        .byte $FF
- D - I - - 0x017CB1 0B:9CA1: FF        .byte $FF
- D - I - - 0x017CB2 0B:9CA2: FF        .byte $FF
- D - I - - 0x017CB3 0B:9CA3: FF        .byte $FF
- D - I - - 0x017CB4 0B:9CA4: FF        .byte $FF
- D - I - - 0x017CB5 0B:9CA5: FF        .byte $FF
- - - - - - 0x017CB6 0B:9CA6: AA        .byte $AA   ; <だ>
- D - I - - 0x017CB7 0B:9CA7: AA        .byte $AA   ; <だ>
- D - I - - 0x017CB8 0B:9CA8: AA        .byte $AA   ; <だ>
- D - I - - 0x017CB9 0B:9CA9: FF        .byte $FF
- D - I - - 0x017CBA 0B:9CAA: FF        .byte $FF
- D - I - - 0x017CBB 0B:9CAB: FF        .byte $FF
- D - I - - 0x017CBC 0B:9CAC: FF        .byte $FF
- D - I - - 0x017CBD 0B:9CAD: FF        .byte $FF
- D - I - - 0x017CBE 0B:9CAE: FF        .byte $FF
- D - I - - 0x017CBF 0B:9CAF: FF        .byte $FF
- D - I - - 0x017CC0 0B:9CB0: FF        .byte $FF
- D - I - - 0x017CC1 0B:9CB1: FF        .byte $FF
- D - I - - 0x017CC2 0B:9CB2: FF        .byte $FF
- D - I - - 0x017CC3 0B:9CB3: FF        .byte $FF
- D - I - - 0x017CC4 0B:9CB4: 00        .byte $00
- D - I - - 0x017CC5 0B:9CB5: 00        .byte $00
- D - I - - 0x017CC6 0B:9CB6: 00        .byte $00
- D - I - - 0x017CC7 0B:9CB7: 00        .byte $00
- D - I - - 0x017CC8 0B:9CB8: 00        .byte $00
- D - I - - 0x017CC9 0B:9CB9: 00        .byte $00
- D - I - - 0x017CCA 0B:9CBA: 00        .byte $00
- D - I - - 0x017CCB 0B:9CBB: 00        .byte $00
- D - I - - 0x017CCC 0B:9CBC: 00        .byte $00
- D - I - - 0x017CCD 0B:9CBD: FF        .byte $FF
- D - I - - 0x017CCE 0B:9CBE: FF        .byte $FF
- D - I - - 0x017CCF 0B:9CBF: FF        .byte $FF
- D - I - - 0x017CD0 0B:9CC0: FF        .byte $FF
- D - I - - 0x017CD1 0B:9CC1: FF        .byte $FF
- D - I - - 0x017CD2 0B:9CC2: FF        .byte $FF
- D - I - - 0x017CD3 0B:9CC3: FF        .byte $FF
- D - I - - 0x017CD4 0B:9CC4: FF        .byte $FF
- D - I - - 0x017CD5 0B:9CC5: FF        .byte $FF
- D - I - - 0x017CD6 0B:9CC6: 00        .byte $00
- D - I - - 0x017CD7 0B:9CC7: 00        .byte $00
- D - I - - 0x017CD8 0B:9CC8: 00        .byte $00
- D - I - - 0x017CD9 0B:9CC9: 00        .byte $00
- D - I - - 0x017CDA 0B:9CCA: 00        .byte $00
- D - I - - 0x017CDB 0B:9CCB: 00        .byte $00
- D - I - - 0x017CDC 0B:9CCC: 00        .byte $00
- D - I - - 0x017CDD 0B:9CCD: 00        .byte $00
- D - I - - 0x017CDE 0B:9CCE: 00        .byte $00
- - - - - - 0x017CDF 0B:9CCF: FF        .byte $FF
- - - - - - 0x017CE0 0B:9CD0: FF        .byte $FF
- D - I - - 0x017CE1 0B:9CD1: FF        .byte $FF
- D - I - - 0x017CE2 0B:9CD2: 0F        .byte $0F   ; <そ>
- D - I - - 0x017CE3 0B:9CD3: 0F        .byte $0F   ; <そ>
- D - I - - 0x017CE4 0B:9CD4: 00        .byte $00
- D - I - - 0x017CE5 0B:9CD5: FF        .byte $FF
- D - I - - 0x017CE6 0B:9CD6: FF        .byte $FF
- D - I - - 0x017CE7 0B:9CD7: FF        .byte $FF
- D - I - - 0x017CE8 0B:9CD8: 00        .byte $00
- D - I - - 0x017CE9 0B:9CD9: 0F        .byte $0F   ; <そ>
- D - I - - 0x017CEA 0B:9CDA: AF        .byte $AF   ; <ば>
- D - I - - 0x017CEB 0B:9CDB: FF        .byte $FF
- D - I - - 0x017CEC 0B:9CDC: 00        .byte $00
- D - I - - 0x017CED 0B:9CDD: 00        .byte $00
- D - I - - 0x017CEE 0B:9CDE: 00        .byte $00
- D - I - - 0x017CEF 0B:9CDF: FF        .byte $FF
- D - I - - 0x017CF0 0B:9CE0: 0F        .byte $0F   ; <そ>
- D - I - - 0x017CF1 0B:9CE1: FF        .byte $FF
- - - - - - 0x017CF2 0B:9CE2: 00        .byte $00
- D - I - - 0x017CF3 0B:9CE3: 00        .byte $00

; !!! предположительно продолжение, длинная таблица
- D - I - - 0x017CF4 0B:9CE4: C0        .byte $C0   ; <ヅ>
- D - I - - 0x017CF5 0B:9CE5: F0        .byte $F0
- D - I - - 0x017CF6 0B:9CE6: F0        .byte $F0
- D - I - - 0x017CF7 0B:9CE7: 30        .byte $30   ; <ゃ>
- D - I - - 0x017CF8 0B:9CE8: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017CF9 0B:9CE9: BF        .byte $BF   ; <ヂ>
- D - I - - 0x017CFA 0B:9CEA: 77        .byte $77   ; <:>
- D - I - - 0x017CFB 0B:9CEB: FF        .byte $FF
- D - I - - 0x017CFC 0B:9CEC: FF        .byte $FF
- D - I - - 0x017CFD 0B:9CED: 33        .byte $33   ; <0>
- D - I - - 0x017CFE 0B:9CEE: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017CFF 0B:9CEF: FB        .byte $FB
- D - I - - 0x017D00 0B:9CF0: FE        .byte $FE
- D - I - - 0x017D01 0B:9CF1: FF        .byte $FF
- D - I - - 0x017D02 0B:9CF2: FF        .byte $FF
- D - I - - 0x017D03 0B:9CF3: 33        .byte $33   ; <0>
- D - I - - 0x017D04 0B:9CF4: A0        .byte $A0   ; <が>
- D - I - - 0x017D05 0B:9CF5: E0        .byte $E0
- D - I - - 0x017D06 0B:9CF6: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017D07 0B:9CF7: 7A        .byte $7A   ; <、>
- D - I - - 0x017D08 0B:9CF8: 00        .byte $00
- D - I - - 0x017D09 0B:9CF9: FA        .byte $FA
- D - I - - 0x017D0A 0B:9CFA: FA        .byte $FA
- D - I - - 0x017D0B 0B:9CFB: 0F        .byte $0F   ; <そ>
- D - I - - 0x017D0C 0B:9CFC: 0F        .byte $0F   ; <そ>
- D - I - - 0x017D0D 0B:9CFD: FE        .byte $FE
- D - I - - 0x017D0E 0B:9CFE: FF        .byte $FF
- D - I - - 0x017D0F 0B:9CFF: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017D10 0B:9D00: FF        .byte $FF
- D - I - - 0x017D11 0B:9D01: FF        .byte $FF
- D - I - - 0x017D12 0B:9D02: FF        .byte $FF
- D - I - - 0x017D13 0B:9D03: FF        .byte $FF
- D - I - - 0x017D14 0B:9D04: C0        .byte $C0   ; <ヅ>
- D - I - - 0x017D15 0B:9D05: F0        .byte $F0
- D - I - - 0x017D16 0B:9D06: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017D17 0B:9D07: DF        .byte $DF
- D - I - - 0x017D18 0B:9D08: EF        .byte $EF
- D - I - - 0x017D19 0B:9D09: 00        .byte $00
- D - I - - 0x017D1A 0B:9D0A: 00        .byte $00
- - - - - - 0x017D1B 0B:9D0B: 55        .byte $55   ; <ナ>
- D - I - - 0x017D1C 0B:9D0C: 55        .byte $55   ; <ナ>
- D - I - - 0x017D1D 0B:9D0D: 43        .byte $43   ; <ウ>
- D - I - - 0x017D1E 0B:9D0E: 43        .byte $43   ; <ウ>
- D - I - - 0x017D1F 0B:9D0F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D20 0B:9D10: 55        .byte $55   ; <ナ>
- D - I - - 0x017D21 0B:9D11: AA        .byte $AA   ; <だ>
- D - I - - 0x017D22 0B:9D12: AA        .byte $AA   ; <だ>
- D - I - - 0x017D23 0B:9D13: AA        .byte $AA   ; <だ>
- D - I - - 0x017D24 0B:9D14: FF        .byte $FF
- D - I - - 0x017D25 0B:9D15: FF        .byte $FF
- D - I - - 0x017D26 0B:9D16: AA        .byte $AA   ; <だ>
- D - I - - 0x017D27 0B:9D17: AA        .byte $AA   ; <だ>
- D - I - - 0x017D28 0B:9D18: AA        .byte $AA   ; <だ>
- D - I - - 0x017D29 0B:9D19: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2A 0B:9D1A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2B 0B:9D1B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2C 0B:9D1C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2D 0B:9D1D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2E 0B:9D1E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D2F 0B:9D1F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D30 0B:9D20: AA        .byte $AA   ; <だ>
- D - I - - 0x017D31 0B:9D21: AA        .byte $AA   ; <だ>
- D - I - - 0x017D32 0B:9D22: AA        .byte $AA   ; <だ>
- D - I - - 0x017D33 0B:9D23: AA        .byte $AA   ; <だ>
- D - I - - 0x017D34 0B:9D24: AA        .byte $AA   ; <だ>
- D - I - - 0x017D35 0B:9D25: AA        .byte $AA   ; <だ>
- D - I - - 0x017D36 0B:9D26: AA        .byte $AA   ; <だ>
- D - I - - 0x017D37 0B:9D27: AA        .byte $AA   ; <だ>
- D - I - - 0x017D38 0B:9D28: AA        .byte $AA   ; <だ>
- D - I - - 0x017D39 0B:9D29: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3A 0B:9D2A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3B 0B:9D2B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3C 0B:9D2C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3D 0B:9D2D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3E 0B:9D2E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D3F 0B:9D2F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D40 0B:9D30: AA        .byte $AA   ; <だ>
- D - I - - 0x017D41 0B:9D31: AA        .byte $AA   ; <だ>
- D - I - - 0x017D42 0B:9D32: AA        .byte $AA   ; <だ>
- D - I - - 0x017D43 0B:9D33: AA        .byte $AA   ; <だ>
- D - I - - 0x017D44 0B:9D34: AA        .byte $AA   ; <だ>
- D - I - - 0x017D45 0B:9D35: AA        .byte $AA   ; <だ>
- D - I - - 0x017D46 0B:9D36: AA        .byte $AA   ; <だ>
- D - I - - 0x017D47 0B:9D37: AA        .byte $AA   ; <だ>
- D - I - - 0x017D48 0B:9D38: AA        .byte $AA   ; <だ>
- D - I - - 0x017D49 0B:9D39: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4A 0B:9D3A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4B 0B:9D3B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4C 0B:9D3C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4D 0B:9D3D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4E 0B:9D3E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D4F 0B:9D3F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D50 0B:9D40: AA        .byte $AA   ; <だ>
- D - I - - 0x017D51 0B:9D41: AA        .byte $AA   ; <だ>
- D - I - - 0x017D52 0B:9D42: AA        .byte $AA   ; <だ>
- D - I - - 0x017D53 0B:9D43: AA        .byte $AA   ; <だ>
- D - I - - 0x017D54 0B:9D44: AA        .byte $AA   ; <だ>
- D - I - - 0x017D55 0B:9D45: AA        .byte $AA   ; <だ>
- D - I - - 0x017D56 0B:9D46: AA        .byte $AA   ; <だ>
- D - I - - 0x017D57 0B:9D47: AA        .byte $AA   ; <だ>
- D - I - - 0x017D58 0B:9D48: AA        .byte $AA   ; <だ>
- D - I - - 0x017D59 0B:9D49: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5A 0B:9D4A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5B 0B:9D4B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5C 0B:9D4C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5D 0B:9D4D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5E 0B:9D4E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D5F 0B:9D4F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D60 0B:9D50: AA        .byte $AA   ; <だ>
- D - I - - 0x017D61 0B:9D51: AA        .byte $AA   ; <だ>
- D - I - - 0x017D62 0B:9D52: AA        .byte $AA   ; <だ>
- D - I - - 0x017D63 0B:9D53: AA        .byte $AA   ; <だ>
- D - I - - 0x017D64 0B:9D54: AA        .byte $AA   ; <だ>
- D - I - - 0x017D65 0B:9D55: AA        .byte $AA   ; <だ>
- D - I - - 0x017D66 0B:9D56: AA        .byte $AA   ; <だ>
- D - I - - 0x017D67 0B:9D57: AA        .byte $AA   ; <だ>
- D - I - - 0x017D68 0B:9D58: AA        .byte $AA   ; <だ>
- D - I - - 0x017D69 0B:9D59: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6A 0B:9D5A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6B 0B:9D5B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6C 0B:9D5C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6D 0B:9D5D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6E 0B:9D5E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D6F 0B:9D5F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D70 0B:9D60: AA        .byte $AA   ; <だ>
- D - I - - 0x017D71 0B:9D61: AA        .byte $AA   ; <だ>
- D - I - - 0x017D72 0B:9D62: AA        .byte $AA   ; <だ>
- D - I - - 0x017D73 0B:9D63: AA        .byte $AA   ; <だ>
- D - I - - 0x017D74 0B:9D64: AA        .byte $AA   ; <だ>
- D - I - - 0x017D75 0B:9D65: AA        .byte $AA   ; <だ>
- D - I - - 0x017D76 0B:9D66: AA        .byte $AA   ; <だ>
- D - I - - 0x017D77 0B:9D67: AA        .byte $AA   ; <だ>
- D - I - - 0x017D78 0B:9D68: AA        .byte $AA   ; <だ>
- D - I - - 0x017D79 0B:9D69: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7A 0B:9D6A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7B 0B:9D6B: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7C 0B:9D6C: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7D 0B:9D6D: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7E 0B:9D6E: AA        .byte $AA   ; <だ>
- D - I - - 0x017D7F 0B:9D6F: AA        .byte $AA   ; <だ>
- D - I - - 0x017D80 0B:9D70: AA        .byte $AA   ; <だ>
- D - I - - 0x017D81 0B:9D71: AA        .byte $AA   ; <だ>
- D - I - - 0x017D82 0B:9D72: AA        .byte $AA   ; <だ>
- D - I - - 0x017D83 0B:9D73: AA        .byte $AA   ; <だ>
- D - I - - 0x017D84 0B:9D74: AA        .byte $AA   ; <だ>
- D - I - - 0x017D85 0B:9D75: AA        .byte $AA   ; <だ>
- D - I - - 0x017D86 0B:9D76: AA        .byte $AA   ; <だ>
- D - I - - 0x017D87 0B:9D77: FF        .byte $FF
- D - I - - 0x017D88 0B:9D78: AA        .byte $AA   ; <だ>
- D - I - - 0x017D89 0B:9D79: AA        .byte $AA   ; <だ>
- D - I - - 0x017D8A 0B:9D7A: AA        .byte $AA   ; <だ>
- D - I - - 0x017D8B 0B:9D7B: FF        .byte $FF
- D - I - - 0x017D8C 0B:9D7C: FF        .byte $FF
- D - I - - 0x017D8D 0B:9D7D: FF        .byte $FF
- D - I - - 0x017D8E 0B:9D7E: FF        .byte $FF
- D - I - - 0x017D8F 0B:9D7F: FF        .byte $FF
- D - I - - 0x017D90 0B:9D80: FF        .byte $FF
- D - I - - 0x017D91 0B:9D81: FF        .byte $FF
- D - I - - 0x017D92 0B:9D82: FF        .byte $FF
- D - I - - 0x017D93 0B:9D83: FF        .byte $FF
- D - I - - 0x017D94 0B:9D84: FF        .byte $FF
- D - I - - 0x017D95 0B:9D85: FF        .byte $FF
- D - I - - 0x017D96 0B:9D86: FF        .byte $FF
- D - I - - 0x017D97 0B:9D87: FF        .byte $FF
- D - I - - 0x017D98 0B:9D88: FF        .byte $FF
- D - I - - 0x017D99 0B:9D89: FF        .byte $FF
- D - I - - 0x017D9A 0B:9D8A: FF        .byte $FF
- D - I - - 0x017D9B 0B:9D8B: FF        .byte $FF
- D - I - - 0x017D9C 0B:9D8C: FF        .byte $FF
- D - I - - 0x017D9D 0B:9D8D: FF        .byte $FF
- D - I - - 0x017D9E 0B:9D8E: FF        .byte $FF
- D - I - - 0x017D9F 0B:9D8F: FF        .byte $FF
- D - I - - 0x017DA0 0B:9D90: FF        .byte $FF
- D - I - - 0x017DA1 0B:9D91: FF        .byte $FF
- D - I - - 0x017DA2 0B:9D92: FF        .byte $FF
- D - I - - 0x017DA3 0B:9D93: FF        .byte $FF
- D - I - - 0x017DA4 0B:9D94: FF        .byte $FF
- D - I - - 0x017DA5 0B:9D95: AA        .byte $AA   ; <だ>
- D - I - - 0x017DA6 0B:9D96: AA        .byte $AA   ; <だ>
- - - - - - 0x017DA7 0B:9D97: AA        .byte $AA   ; <だ>
- D - I - - 0x017DA8 0B:9D98: FA        .byte $FA
- D - I - - 0x017DA9 0B:9D99: FA        .byte $FA
- D - I - - 0x017DAA 0B:9D9A: 00        .byte $00
- D - I - - 0x017DAB 0B:9D9B: 00        .byte $00
- D - I - - 0x017DAC 0B:9D9C: 00        .byte $00
- D - I - - 0x017DAD 0B:9D9D: AA        .byte $AA   ; <だ>
- D - I - - 0x017DAE 0B:9D9E: AA        .byte $AA   ; <だ>
- D - I - - 0x017DAF 0B:9D9F: EA        .byte $EA
- D - I - - 0x017DB0 0B:9DA0: AA        .byte $AA   ; <だ>
- D - I - - 0x017DB1 0B:9DA1: AA        .byte $AA   ; <だ>
- D - I - - 0x017DB2 0B:9DA2: 03        .byte $03   ; <う>
- D - I - - 0x017DB3 0B:9DA3: 03        .byte $03   ; <う>
- D - I - - 0x017DB4 0B:9DA4: 03        .byte $03   ; <う>
- - - - - - 0x017DB5 0B:9DA5: AA        .byte $AA   ; <だ>
- D - I - - 0x017DB6 0B:9DA6: EE        .byte $EE
- D - I - - 0x017DB7 0B:9DA7: FE        .byte $FE
- D - I - - 0x017DB8 0B:9DA8: EE        .byte $EE
- D - I - - 0x017DB9 0B:9DA9: 00        .byte $00
- D - I - - 0x017DBA 0B:9DAA: 00        .byte $00
- D - I - - 0x017DBB 0B:9DAB: AA        .byte $AA   ; <だ>
- D - I - - 0x017DBC 0B:9DAC: AE        .byte $AE   ; <ど>
- D - I - - 0x017DBD 0B:9DAD: FE        .byte $FE
- D - I - - 0x017DBE 0B:9DAE: 30        .byte $30   ; <ゃ>
- D - I - - 0x017DBF 0B:9DAF: 30        .byte $30   ; <ゃ>
- D - I - - 0x017DC0 0B:9DB0: 00        .byte $00
- D - I - - 0x017DC1 0B:9DB1: 00        .byte $00
- D - I - - 0x017DC2 0B:9DB2: 00        .byte $00
- D - I - - 0x017DC3 0B:9DB3: F0        .byte $F0
- D - I - - 0x017DC4 0B:9DB4: F0        .byte $F0
- D - I - - 0x017DC5 0B:9DB5: AA        .byte $AA   ; <だ>
- D - I - - 0x017DC6 0B:9DB6: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017DC7 0B:9DB7: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017DC8 0B:9DB8: AB        .byte $AB   ; <ぢ>
- D - I - - 0x017DC9 0B:9DB9: C0        .byte $C0   ; <ヅ>
- D - I - - 0x017DCA 0B:9DBA: 00        .byte $00
- - - - - - 0x017DCB 0B:9DBB: AA        .byte $AA   ; <だ>
- D - I - - 0x017DCC 0B:9DBC: AA        .byte $AA   ; <だ>
- D - I - - 0x017DCD 0B:9DBD: 00        .byte $00
- D - I - - 0x017DCE 0B:9DBE: 00        .byte $00
- D - I - - 0x017DCF 0B:9DBF: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017DD0 0B:9DC0: AA        .byte $AA   ; <だ>
- D - I - - 0x017DD1 0B:9DC1: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017DD2 0B:9DC2: FC        .byte $FC
- D - I - - 0x017DD3 0B:9DC3: AA        .byte $AA   ; <だ>
- - - - - - 0x017DD4 0B:9DC4: AA        .byte $AA   ; <だ>
- D - I - - 0x017DD5 0B:9DC5: AA        .byte $AA   ; <だ>
- D - I - - 0x017DD6 0B:9DC6: BA        .byte $BA   ; <ジ>
- D - I - - 0x017DD7 0B:9DC7: 0C        .byte $0C   ; <し>
- D - I - - 0x017DD8 0B:9DC8: 0C        .byte $0C   ; <し>
- D - I - - 0x017DD9 0B:9DC9: AA        .byte $AA   ; <だ>
- - - - - - 0x017DDA 0B:9DCA: AA        .byte $AA   ; <だ>
- D - I - - 0x017DDB 0B:9DCB: 00        .byte $00
- D - I - - 0x017DDC 0B:9DCC: 00        .byte $00
- D - I - - 0x017DDD 0B:9DCD: 0C        .byte $0C   ; <し>
- D - I - - 0x017DDE 0B:9DCE: FF        .byte $FF
- D - I - - 0x017DDF 0B:9DCF: FF        .byte $FF
- D - I - - 0x017DE0 0B:9DD0: FF        .byte $FF
- D - I - - 0x017DE1 0B:9DD1: FF        .byte $FF
- D - I - - 0x017DE2 0B:9DD2: AA        .byte $AA   ; <だ>
- D - I - - 0x017DE3 0B:9DD3: AA        .byte $AA   ; <だ>
- D - I - - 0x017DE4 0B:9DD4: F0        .byte $F0
- D - I - - 0x017DE5 0B:9DD5: F0        .byte $F0
- D - I - - 0x017DE6 0B:9DD6: FF        .byte $FF
- D - I - - 0x017DE7 0B:9DD7: FF        .byte $FF
- D - I - - 0x017DE8 0B:9DD8: 30        .byte $30   ; <ゃ>
- D - I - - 0x017DE9 0B:9DD9: 33        .byte $33   ; <0>
- D - I - - 0x017DEA 0B:9DDA: DD        .byte $DD
- D - I - - 0x017DEB 0B:9DDB: 33        .byte $33   ; <0>
- D - I - - 0x017DEC 0B:9DDC: CC        .byte $CC   ; <ぽ>
- D - I - - 0x017DED 0B:9DDD: FF        .byte $FF
- D - I - - 0x017DEE 0B:9DDE: FF        .byte $FF
- D - I - - 0x017DEF 0B:9DDF: FA        .byte $FA
- D - I - - 0x017DF0 0B:9DE0: FF        .byte $FF
- D - I - - 0x017DF1 0B:9DE1: 33        .byte $33   ; <0>
- D - I - - 0x017DF2 0B:9DE2: 00        .byte $00
- D - I - - 0x017DF3 0B:9DE3: AA        .byte $AA   ; <だ>

; !!! предположительно продолжение, длинная таблица
- D - I - - 0x017DF4 0B:9DE4: 00        .byte $00
- D - I - - 0x017DF5 0B:9DE5: FF        .byte $FF
- D - I - - 0x017DF6 0B:9DE6: FF        .byte $FF
- D - I - - 0x017DF7 0B:9DE7: FF        .byte $FF
- D - I - - 0x017DF8 0B:9DE8: FF        .byte $FF
- D - I - - 0x017DF9 0B:9DE9: FF        .byte $FF
- D - I - - 0x017DFA 0B:9DEA: AA        .byte $AA   ; <だ>
- D - I - - 0x017DFB 0B:9DEB: AA        .byte $AA   ; <だ>
- D - I - - 0x017DFC 0B:9DEC: AA        .byte $AA   ; <だ>
- D - I - - 0x017DFD 0B:9DED: AA        .byte $AA   ; <だ>
- D - I - - 0x017DFE 0B:9DEE: AA        .byte $AA   ; <だ>
- D - I - - 0x017DFF 0B:9DEF: FF        .byte $FF
- D - I - - 0x017E00 0B:9DF0: FF        .byte $FF
- D - I - - 0x017E01 0B:9DF1: AA        .byte $AA   ; <だ>
- D - I - - 0x017E02 0B:9DF2: AA        .byte $AA   ; <だ>
- D - I - - 0x017E03 0B:9DF3: AA        .byte $AA   ; <だ>
- D - I - - 0x017E04 0B:9DF4: AA        .byte $AA   ; <だ>
- D - I - - 0x017E05 0B:9DF5: FF        .byte $FF
- D - I - - 0x017E06 0B:9DF6: FF        .byte $FF
- D - I - - 0x017E07 0B:9DF7: FF        .byte $FF
- D - I - - 0x017E08 0B:9DF8: FF        .byte $FF
- D - I - - 0x017E09 0B:9DF9: AA        .byte $AA   ; <だ>
- D - I - - 0x017E0A 0B:9DFA: AA        .byte $AA   ; <だ>
- D - I - - 0x017E0B 0B:9DFB: AA        .byte $AA   ; <だ>
- D - I - - 0x017E0C 0B:9DFC: AA        .byte $AA   ; <だ>
- D - I - - 0x017E0D 0B:9DFD: FF        .byte $FF
- D - I - - 0x017E0E 0B:9DFE: AA        .byte $AA   ; <だ>
- D - I - - 0x017E0F 0B:9DFF: AA        .byte $AA   ; <だ>
- D - I - - 0x017E10 0B:9E00: 00        .byte $00
- D - I - - 0x017E11 0B:9E01: AA        .byte $AA   ; <だ>
- D - I - - 0x017E12 0B:9E02: AA        .byte $AA   ; <だ>
- D - I - - 0x017E13 0B:9E03: FF        .byte $FF
- D - I - - 0x017E14 0B:9E04: FF        .byte $FF
- D - I - - 0x017E15 0B:9E05: FF        .byte $FF
- D - I - - 0x017E16 0B:9E06: FF        .byte $FF
- D - I - - 0x017E17 0B:9E07: FF        .byte $FF
- D - I - - 0x017E18 0B:9E08: 00        .byte $00
- D - I - - 0x017E19 0B:9E09: 00        .byte $00
- D - I - - 0x017E1A 0B:9E0A: 00        .byte $00
- D - I - - 0x017E1B 0B:9E0B: 00        .byte $00
- D - I - - 0x017E1C 0B:9E0C: 00        .byte $00
- D - I - - 0x017E1D 0B:9E0D: AA        .byte $AA   ; <だ>
- D - I - - 0x017E1E 0B:9E0E: FF        .byte $FF
- D - I - - 0x017E1F 0B:9E0F: 00        .byte $00
- D - I - - 0x017E20 0B:9E10: 00        .byte $00
- D - I - - 0x017E21 0B:9E11: FF        .byte $FF
- D - I - - 0x017E22 0B:9E12: FF        .byte $FF
- D - I - - 0x017E23 0B:9E13: FF        .byte $FF
- D - I - - 0x017E24 0B:9E14: 00        .byte $00
- D - I - - 0x017E25 0B:9E15: 00        .byte $00
- D - I - - 0x017E26 0B:9E16: AA        .byte $AA   ; <だ>
- D - I - - 0x017E27 0B:9E17: AA        .byte $AA   ; <だ>
- - - - - - 0x017E28 0B:9E18: 00        .byte $00
- - - - - - 0x017E29 0B:9E19: 00        .byte $00
- - - - - - 0x017E2A 0B:9E1A: 00        .byte $00
- - - - - - 0x017E2B 0B:9E1B: FF        .byte $FF
- - - - - - 0x017E2C 0B:9E1C: FF        .byte $FF
- - - - - - 0x017E2D 0B:9E1D: FF        .byte $FF
- - - - - - 0x017E2E 0B:9E1E: FF        .byte $FF
- - - - - - 0x017E2F 0B:9E1F: FF        .byte $FF
- - - - - - 0x017E30 0B:9E20: FF        .byte $FF
- - - - - - 0x017E31 0B:9E21: FF        .byte $FF
- D - I - - 0x017E32 0B:9E22: AA        .byte $AA   ; <だ>
- D - I - - 0x017E33 0B:9E23: FF        .byte $FF
- D - I - - 0x017E34 0B:9E24: FF        .byte $FF
- D - I - - 0x017E35 0B:9E25: FF        .byte $FF
- D - I - - 0x017E36 0B:9E26: FF        .byte $FF
- D - I - - 0x017E37 0B:9E27: FF        .byte $FF
- D - I - - 0x017E38 0B:9E28: FF        .byte $FF
- D - I - - 0x017E39 0B:9E29: FF        .byte $FF
- D - I - - 0x017E3A 0B:9E2A: FF        .byte $FF
- D - I - - 0x017E3B 0B:9E2B: FF        .byte $FF
- D - I - - 0x017E3C 0B:9E2C: FF        .byte $FF
- D - I - - 0x017E3D 0B:9E2D: FF        .byte $FF
- D - I - - 0x017E3E 0B:9E2E: FF        .byte $FF
- D - I - - 0x017E3F 0B:9E2F: FF        .byte $FF
- D - I - - 0x017E40 0B:9E30: FF        .byte $FF
- D - I - - 0x017E41 0B:9E31: AA        .byte $AA   ; <だ>
- D - I - - 0x017E42 0B:9E32: AA        .byte $AA   ; <だ>
- D - I - - 0x017E43 0B:9E33: AA        .byte $AA   ; <だ>
- D - I - - 0x017E44 0B:9E34: FF        .byte $FF
- D - I - - 0x017E45 0B:9E35: AA        .byte $AA   ; <だ>
- D - I - - 0x017E46 0B:9E36: AA        .byte $AA   ; <だ>
- D - I - - 0x017E47 0B:9E37: AA        .byte $AA   ; <だ>
- D - I - - 0x017E48 0B:9E38: AA        .byte $AA   ; <だ>
- D - I - - 0x017E49 0B:9E39: AA        .byte $AA   ; <だ>
- D - I - - 0x017E4A 0B:9E3A: AA        .byte $AA   ; <だ>
- D - I - - 0x017E4B 0B:9E3B: FF        .byte $FF
- D - I - - 0x017E4C 0B:9E3C: AA        .byte $AA   ; <だ>
- D - I - - 0x017E4D 0B:9E3D: AA        .byte $AA   ; <だ>
- D - I - - 0x017E4E 0B:9E3E: AA        .byte $AA   ; <だ>
- D - I - - 0x017E4F 0B:9E3F: AA        .byte $AA   ; <だ>
- D - I - - 0x017E50 0B:9E40: AA        .byte $AA   ; <だ>
- D - I - - 0x017E51 0B:9E41: AA        .byte $AA   ; <だ>
- D - I - - 0x017E52 0B:9E42: AA        .byte $AA   ; <だ>
- D - I - - 0x017E53 0B:9E43: AA        .byte $AA   ; <だ>
- D - I - - 0x017E54 0B:9E44: AA        .byte $AA   ; <だ>
- D - I - - 0x017E55 0B:9E45: 2A        .byte $2A   ; <れ>
- D - I - - 0x017E56 0B:9E46: 0A        .byte $0A   ; <こ>
- D - I - - 0x017E57 0B:9E47: 0A        .byte $0A   ; <こ>
- D - I - - 0x017E58 0B:9E48: 8A        .byte $8A   ; <N>
- D - I - - 0x017E59 0B:9E49: 22        .byte $22   ; <め>
- D - I - - 0x017E5A 0B:9E4A: 00        .byte $00
- D - I - - 0x017E5B 0B:9E4B: 00        .byte $00
- D - I - - 0x017E5C 0B:9E4C: 88        .byte $88   ; <H>
- D - I - - 0x017E5D 0B:9E4D: 2A        .byte $2A   ; <れ>
- D - I - - 0x017E5E 0B:9E4E: 0A        .byte $0A   ; <こ>
- D - I - - 0x017E5F 0B:9E4F: 0A        .byte $0A   ; <こ>
- D - I - - 0x017E60 0B:9E50: 8A        .byte $8A   ; <N>
- D - I - - 0x017E61 0B:9E51: 00        .byte $00
- D - I - - 0x017E62 0B:9E52: 00        .byte $00
- D - I - - 0x017E63 0B:9E53: 88        .byte $88   ; <H>
- D - I - - 0x017E64 0B:9E54: 22        .byte $22   ; <め>
- D - I - - 0x017E65 0B:9E55: 00        .byte $00
- D - I - - 0x017E66 0B:9E56: 00        .byte $00
- D - I - - 0x017E67 0B:9E57: 00        .byte $00
- D - I - - 0x017E68 0B:9E58: 00        .byte $00
- D - I - - 0x017E69 0B:9E59: 00        .byte $00
- D - I - - 0x017E6A 0B:9E5A: 00        .byte $00
- D - I - - 0x017E6B 0B:9E5B: 00        .byte $00
- D - I - - 0x017E6C 0B:9E5C: 00        .byte $00
- D - I - - 0x017E6D 0B:9E5D: 00        .byte $00
- D - I - - 0x017E6E 0B:9E5E: 00        .byte $00
- D - I - - 0x017E6F 0B:9E5F: 00        .byte $00
- D - I - - 0x017E70 0B:9E60: 00        .byte $00
- D - I - - 0x017E71 0B:9E61: 00        .byte $00
- D - I - - 0x017E72 0B:9E62: 00        .byte $00
- D - I - - 0x017E73 0B:9E63: 00        .byte $00
- D - I - - 0x017E74 0B:9E64: 00        .byte $00
- D - I - - 0x017E75 0B:9E65: 00        .byte $00
- D - I - - 0x017E76 0B:9E66: 00        .byte $00
- D - I - - 0x017E77 0B:9E67: 00        .byte $00
- D - I - - 0x017E78 0B:9E68: 00        .byte $00
- D - I - - 0x017E79 0B:9E69: EE        .byte $EE
- D - I - - 0x017E7A 0B:9E6A: FF        .byte $FF
- D - I - - 0x017E7B 0B:9E6B: FF        .byte $FF
- D - I - - 0x017E7C 0B:9E6C: EE        .byte $EE
- D - I - - 0x017E7D 0B:9E6D: FF        .byte $FF
- D - I - - 0x017E7E 0B:9E6E: FF        .byte $FF
- D - I - - 0x017E7F 0B:9E6F: BB        .byte $BB   ; <ズ>
- D - I - - 0x017E80 0B:9E70: BB        .byte $BB   ; <ズ>
- D - I - - 0x017E81 0B:9E71: FF        .byte $FF
- D - I - - 0x017E82 0B:9E72: FF        .byte $FF
- D - I - - 0x017E83 0B:9E73: BB        .byte $BB   ; <ズ>
- D - I - - 0x017E84 0B:9E74: EE        .byte $EE
- D - I - - 0x017E85 0B:9E75: FF        .byte $FF
- D - I - - 0x017E86 0B:9E76: FF        .byte $FF
- D - I - - 0x017E87 0B:9E77: BB        .byte $BB   ; <ズ>
- D - I - - 0x017E88 0B:9E78: EE        .byte $EE
- D - I - - 0x017E89 0B:9E79: 00        .byte $00
- D - I - - 0x017E8A 0B:9E7A: FF        .byte $FF
- D - I - - 0x017E8B 0B:9E7B: 00        .byte $00
- D - I - - 0x017E8C 0B:9E7C: 00        .byte $00
- D - I - - 0x017E8D 0B:9E7D: A6        .byte $A6   ; <じ>
- D - I - - 0x017E8E 0B:9E7E: 55        .byte $55   ; <ナ>
- D - I - - 0x017E8F 0B:9E7F: 55        .byte $55   ; <ナ>
- D - I - - 0x017E90 0B:9E80: 55        .byte $55   ; <ナ>
- D - I - - 0x017E91 0B:9E81: 55        .byte $55   ; <ナ>
- D - I - - 0x017E92 0B:9E82: AA        .byte $AA   ; <だ>
- D - I - - 0x017E93 0B:9E83: AA        .byte $AA   ; <だ>
- D - I - - 0x017E94 0B:9E84: FF        .byte $FF
- D - I - - 0x017E95 0B:9E85: 55        .byte $55   ; <ナ>
- D - I - - 0x017E96 0B:9E86: FF        .byte $FF
- D - I - - 0x017E97 0B:9E87: 55        .byte $55   ; <ナ>
- D - I - - 0x017E98 0B:9E88: AA        .byte $AA   ; <だ>
- D - I - - 0x017E99 0B:9E89: FF        .byte $FF
- D - I - - 0x017E9A 0B:9E8A: FF        .byte $FF
- D - I - - 0x017E9B 0B:9E8B: FF        .byte $FF
- D - I - - 0x017E9C 0B:9E8C: FF        .byte $FF
- D - I - - 0x017E9D 0B:9E8D: FF        .byte $FF
- D - I - - 0x017E9E 0B:9E8E: FF        .byte $FF
- D - I - - 0x017E9F 0B:9E8F: FF        .byte $FF
- D - I - - 0x017EA0 0B:9E90: FF        .byte $FF
- D - I - - 0x017EA1 0B:9E91: AA        .byte $AA   ; <だ>
- D - I - - 0x017EA2 0B:9E92: FF        .byte $FF
- D - I - - 0x017EA3 0B:9E93: FF        .byte $FF
- D - I - - 0x017EA4 0B:9E94: EA        .byte $EA
- D - I - - 0x017EA5 0B:9E95: FA        .byte $FA
- D - I - - 0x017EA6 0B:9E96: FA        .byte $FA
- D - I - - 0x017EA7 0B:9E97: BA        .byte $BA   ; <ジ>
- D - I - - 0x017EA8 0B:9E98: FF        .byte $FF
- D - I - - 0x017EA9 0B:9E99: FF        .byte $FF
- D - I - - 0x017EAA 0B:9E9A: FF        .byte $FF
- D - I - - 0x017EAB 0B:9E9B: FF        .byte $FF
- D - I - - 0x017EAC 0B:9E9C: 00        .byte $00
- - - - - - 0x017EAD 0B:9E9D: 00        .byte $00
- D - I - - 0x017EAE 0B:9E9E: 55        .byte $55   ; <ナ>
- D - I - - 0x017EAF 0B:9E9F: 55        .byte $55   ; <ナ>
- D - I - - 0x017EB0 0B:9EA0: 55        .byte $55   ; <ナ>
- D - I - - 0x017EB1 0B:9EA1: 55        .byte $55   ; <ナ>
- D - I - - 0x017EB2 0B:9EA2: DD        .byte $DD
- D - I - - 0x017EB3 0B:9EA3: AA        .byte $AA   ; <だ>
- D - I - - 0x017EB4 0B:9EA4: FF        .byte $FF
- D - I - - 0x017EB5 0B:9EA5: FF        .byte $FF
- D - I - - 0x017EB6 0B:9EA6: 55        .byte $55   ; <ナ>
- D - I - - 0x017EB7 0B:9EA7: 70        .byte $70   ; <ャ>
- D - I - - 0x017EB8 0B:9EA8: 00        .byte $00
- D - I - - 0x017EB9 0B:9EA9: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017EBA 0B:9EAA: 57        .byte $57   ; <ヌ>
- D - I - - 0x017EBB 0B:9EAB: 55        .byte $55   ; <ナ>
- D - I - - 0x017EBC 0B:9EAC: 90        .byte $90   ; <U>
- D - I - - 0x017EBD 0B:9EAD: D0        .byte $D0   ; <ペ>
- D - I - - 0x017EBE 0B:9EAE: 60        .byte $60   ; <ミ>
- D - I - - 0x017EBF 0B:9EAF: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017EC0 0B:9EB0: 57        .byte $57   ; <ヌ>
- D - I - - 0x017EC1 0B:9EB1: 55        .byte $55   ; <ナ>
- D - I - - 0x017EC2 0B:9EB2: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC3 0B:9EB3: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC4 0B:9EB4: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC5 0B:9EB5: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC6 0B:9EB6: 50        .byte $50   ; <タ>
- D - I - - 0x017EC7 0B:9EB7: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC8 0B:9EB8: AA        .byte $AA   ; <だ>
- D - I - - 0x017EC9 0B:9EB9: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECA 0B:9EBA: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECB 0B:9EBB: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECC 0B:9EBC: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECD 0B:9EBD: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECE 0B:9EBE: AA        .byte $AA   ; <だ>
- D - I - - 0x017ECF 0B:9EBF: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED0 0B:9EC0: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED1 0B:9EC1: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED2 0B:9EC2: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED3 0B:9EC3: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED4 0B:9EC4: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED5 0B:9EC5: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED6 0B:9EC6: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED7 0B:9EC7: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED8 0B:9EC8: AA        .byte $AA   ; <だ>
- D - I - - 0x017ED9 0B:9EC9: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDA 0B:9ECA: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDB 0B:9ECB: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDC 0B:9ECC: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDD 0B:9ECD: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDE 0B:9ECE: AA        .byte $AA   ; <だ>
- D - I - - 0x017EDF 0B:9ECF: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE0 0B:9ED0: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE1 0B:9ED1: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE2 0B:9ED2: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE3 0B:9ED3: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE4 0B:9ED4: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE5 0B:9ED5: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE6 0B:9ED6: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE7 0B:9ED7: AA        .byte $AA   ; <だ>
- D - I - - 0x017EE8 0B:9ED8: AA        .byte $AA   ; <だ>
- - - - - - 0x017EE9 0B:9ED9: FF        .byte $FF
- D - I - - 0x017EEA 0B:9EDA: AA        .byte $AA   ; <だ>
- D - I - - 0x017EEB 0B:9EDB: AA        .byte $AA   ; <だ>
- D - I - - 0x017EEC 0B:9EDC: 90        .byte $90   ; <U>
- D - I - - 0x017EED 0B:9EDD: 57        .byte $57   ; <ヌ>
- D - I - - 0x017EEE 0B:9EDE: 55        .byte $55   ; <ナ>
- D - I - - 0x017EEF 0B:9EDF: 55        .byte $55   ; <ナ>
- D - I - - 0x017EF0 0B:9EE0: 5D        .byte $5D   ; <ヘ>
- D - I - - 0x017EF1 0B:9EE1: 60        .byte $60   ; <ミ>
- D - I - - 0x017EF2 0B:9EE2: AA        .byte $AA   ; <だ>
- - - - - - 0x017EF3 0B:9EE3: CC        .byte $CC   ; <ぽ>
- - - - - - 0x017EF4 0B:9EE4: FF        .byte $FF
