.segment "BANK_18"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
; меню во время игры 0x030861
; тайлы облаков
; фразы облаков



.export ofs_0x03001F_чтение_байтов_облака
.export sub_0x030708
.export sub_0x030789_движущийся_фон
.export sub_0x0307F6
.export sub_0x030861_отрисовка_меню_во_время_матча
.export tbl_B3CF_вид_меню



ofs_0x03001F_чтение_байтов_облака:
C D - - - - 0x03001F 18:800F: 2C 3F 06  BIT ram_063F
C - - - - - 0x030022 18:8012: 10 03     BPL bra_8017_продолжить
C - - - - - 0x030024 18:8014: 4C 12 C5  JMP loc_0x03CB07
bra_8017_продолжить:
                                        LDY ram_облако
                                        LDA tbl_921F_банки_облаков,Y
                                        STA ram_для_5116
                                        STA $5116
C - - - - - 0x030027 18:8017: A9 20     LDA #< tbl_9220_фразы_облаков
C - - - - - 0x030029 18:8019: 85 5F     STA ram_cloud_data
C - - - - - 0x03002B 18:801B: A9 92     LDA #> tbl_9220_фразы_облаков
C - - - - - 0x03002D 18:801D: 85 60     STA ram_cloud_data + 1
C - - - - - 0x03002F 18:801F: AD EA 05  LDA ram_облако
C - - - - - 0x030032 18:8022: 0A        ASL
C - - - - - 0x030033 18:8023: 90 02     BCC bra_8027_меньше_80
C - - - - - 0x030035 18:8025: E6 60     INC ram_cloud_data + 1
bra_8027_меньше_80:
C - - - - - 0x030037 18:8027: A8        TAY
C - - - - - 0x030038 18:8028: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x03003A 18:802A: AA        TAX
C - - - - - 0x03003B 18:802B: C8        INY
C - - - - - 0x03003C 18:802C: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x03003E 18:802E: 85 60     STA ram_cloud_data + 1
C - - - - - 0x030040 18:8030: 86 5F     STX ram_cloud_data
C - - - - - 0x030042 18:8032: A9 00     LDA #$00
C - - - - - 0x030044 18:8034: 8D E9 05  STA ram_таймер_облака_ХЗ
C - - - - - 0x030047 18:8037: 8D E5 05  STA ram_индекс_байтов_облака
C - - - - - 0x03004A 18:803A: 8D E4 05  STA ram_05E4
C - - - - - 0x03004D 18:803D: 8D F4 05  STA ram_05F4
C - - - - - 0x030050 18:8040: A9 01     LDA #$01
C - - - - - 0x030052 18:8042: 8D E3 05  STA ram_05E3
loc_8045_цикл:
C D - - - - 0x030055 18:8045: A9 01     LDA #$01
C - - - - - 0x030057 18:8047: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x03005A 18:804A: 20 53 80  JSR sub_8053
C - - - - - 0x03005D 18:804D: 20 60 C5  JSR sub_0x03CF82_отрисовка_чарли_на_фоне
C - - - - - 0x030060 18:8050: 4C 45 80  JMP loc_8045_цикл

sub_8053:
C - - - - - 0x030063 18:8053: AD E3 05  LDA ram_05E3
C - - - - - 0x030066 18:8056: D0 01     BNE bra_8059
C - - - - - 0x030068 18:8058: 60        RTS
bra_8059:
C - - - - - 0x030069 18:8059: AD E9 05  LDA ram_таймер_облака_ХЗ
C - - - - - 0x03006C 18:805C: F0 04     BEQ bra_8062_таймер_перед_отображением_облака_вышел
C - - - - - 0x03006E 18:805E: CE E9 05  DEC ram_таймер_облака_ХЗ
C - - - - - 0x030071 18:8061: 60        RTS
bra_8062_таймер_перед_отображением_облака_вышел:
C - - - - - 0x030072 18:8062: AD E4 05  LDA ram_05E4
C - - - - - 0x030075 18:8065: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x030078 18:8068: 6E 80     .word ofs_031_806E_00_инициализация_облака
- D - I - - 0x03007A 18:806A: 18 82     .word ofs_031_8218_01_отрисовка_облака
- D - I - - 0x03007C 18:806C: F2 82     .word ofs_031_82F2_02_вывод_текста



ofs_031_806E_00_инициализация_облака:
loc_806E_цикл:
C D J - - - 0x03007E 18:806E: AC E5 05  LDY ram_индекс_байтов_облака
C - - - - - 0x030081 18:8071: EE E5 05  INC ram_индекс_байтов_облака
C - - - - - 0x030084 18:8074: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x030086 18:8076: C9 F0     CMP #$F0
C - - - - - 0x030088 18:8078: 90 06     BCC bra_8080_EF_и_ниже
C - - - - - 0x03008A 18:807A: 20 87 80  JSR sub_8087_управляющие_байты
C - - - - - 0x03008D 18:807D: 4C 6E 80  JMP loc_806E_цикл
bra_8080_EF_и_ниже:
; если это не управляющий байт, значит это таймер задержки облака перед отображением
C - - - - - 0x030090 18:8080: 8D E9 05  STA ram_таймер_облака_ХЗ
C - - - - - 0x030093 18:8083: EE E4 05  INC ram_05E4
C - - - - - 0x030096 18:8086: 60        RTS



sub_8087_управляющие_байты:
; 0x030097
    AND #$0F
    JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
    .word ofs_032_8098_F0_выход
    .word ofs_032_80A0_F1       ; unused
    .word ofs_032_80B5_F2_очистить_облако
    .word ofs_032_80B8_F3_прыжок
    .word ofs_032_80CB_F4_выбор_облака
    .word ofs_032_81FD_F5_очистить_экран_и_прочитать_таймер



ofs_032_8098_F0_выход:
C - J - - - 0x0300A8 18:8098: A9 00     LDA #$00
C - - - - - 0x0300AA 18:809A: 8D E3 05  STA ram_05E3
C - - - - - 0x0300AD 18:809D: 68        PLA
C - - - - - 0x0300AE 18:809E: 68        PLA
C - - - - - 0x0300AF 18:809F: 60        RTS



ofs_032_80A0_F1:
bra_80A0_A_не_нажата:
- - - - - - 0x0300B0 18:80A0: A9 01     LDA #$01
- - - - - - 0x0300B2 18:80A2: 20 15 C5  JSR sub_0x03CB1F_задержка
- - - - - - 0x0300B5 18:80A5: AD 1C 00  LDA ram_btn_hold
; con_btn_A
- - - - - - 0x0300B8 18:80A8: 10 F6     BPL bra_80A0_A_не_нажата
- - - - - - 0x0300BA 18:80AA: A9 00     LDA #$00
- - - - - - 0x0300BC 18:80AC: 8D E9 05  STA ram_таймер_облака_ХЗ
- - - - - - 0x0300BF 18:80AF: EE E4 05  INC ram_05E4
- - - - - - 0x0300C2 18:80B2: 68        PLA
- - - - - - 0x0300C3 18:80B3: 68        PLA
- - - - - - 0x0300C4 18:80B4: 60        RTS



; bzk опт
ofs_032_80B5_F2_очистить_облако:
C - J - - - 0x0300C5 18:80B5: 4C 2D C5  JMP loc_0x03CC56_очистить_нижнюю_половину_экрана



ofs_032_80B8_F3_прыжок:
C - J - - - 0x0300C8 18:80B8: AC E5 05  LDY ram_индекс_байтов_облака
C - - - - - 0x0300CB 18:80BB: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x0300CD 18:80BD: AA        TAX
C - - - - - 0x0300CE 18:80BE: C8        INY
C - - - - - 0x0300CF 18:80BF: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x0300D1 18:80C1: 85 60     STA ram_cloud_data + 1
C - - - - - 0x0300D3 18:80C3: 86 5F     STX ram_cloud_data
C - - - - - 0x0300D5 18:80C5: A9 00     LDA #$00
C - - - - - 0x0300D7 18:80C7: 8D E5 05  STA ram_индекс_байтов_облака
C - - - - - 0x0300DA 18:80CA: 60        RTS



ofs_032_80CB_F4_выбор_облака:
C - J - - - 0x0300DB 18:80CB: AC E5 05  LDY ram_индекс_байтов_облака
C - - - - - 0x0300DE 18:80CE: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x0300E0 18:80D0: 20 EA 80  JSR sub_80EA_подпрограмма
C - - - - - 0x0300E3 18:80D3: 8A        TXA
C - - - - - 0x0300E4 18:80D4: 0A        ASL
C - - - - - 0x0300E5 18:80D5: 38        SEC
C - - - - - 0x0300E6 18:80D6: 6D E5 05  ADC ram_индекс_байтов_облака
C - - - - - 0x0300E9 18:80D9: A8        TAY
C - - - - - 0x0300EA 18:80DA: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x0300EC 18:80DC: AA        TAX
C - - - - - 0x0300ED 18:80DD: C8        INY
C - - - - - 0x0300EE 18:80DE: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x0300F0 18:80E0: 86 5F     STX ram_cloud_data
C - - - - - 0x0300F2 18:80E2: 85 60     STA ram_cloud_data + 1
C - - - - - 0x0300F4 18:80E4: A9 00     LDA #$00
C - - - - - 0x0300F6 18:80E6: 8D E5 05  STA ram_индекс_байтов_облака
C - - - - - 0x0300F9 18:80E9: 60        RTS



sub_80EA_подпрограмма:
C - - - - - 0x0300FA 18:80EA: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- - - - - - 0x0300FD 18:80ED: FD 80     .word $0000   ; unused
- D - I - - 0x0300FF 18:80EF: 06 81     .word ofs_033_8106_01_облако_зависит_от_команды
- D - I - - 0x030101 18:80F1: 0E 81     .word ofs_033_810E_02_количество_защитников
- D - I - - 0x030103 18:80F3: 1E 81     .word ofs_033_811E_03_сообщение_при_разводке
- D - I - - 0x030105 18:80F5: 22 81     .word ofs_033_8122_04_выбрать_диалог_ожидания_в_зависимости_от_команды
- D - I - - 0x030107 18:80F7: 38 81     .word ofs_033_8138_05_сообщение_после_тайма
- D - I - - 0x030109 18:80F9: CE 81     .word ofs_033_81CE_06
- D - I - - 0x03010B 18:80FB: E4 81     .word ofs_033_81E4_07_сообщение_о_дисбалансе_кипера
                                        .word ofs_033_81FD_08_рандомный_выбор_из_64_фраз



ofs_033_8106_01_облако_зависит_от_команды:
; 00 - команда слева
; 01 - команда справа
C - J - - - 0x030116 18:8106: AE FB 05  LDX ram_команда_с_мячом
C - - - - - 0x030119 18:8109: F0 02     BEQ bra_810D_RTS    ; if комада слева
; if комада справа
C - - - - - 0x03011B 18:810B: A2 01     LDX #$01
bra_810D_RTS:   ; X = 00, bzk опт, небезопасно
C - - - - - 0x03011D 18:810D: 60        RTS



ofs_033_810E_02_количество_защитников:
; 4 варианта диалога
C - J - - - 0x03011E 18:810E: AE 00 06  LDX ram_колво_защитников
C - - - - - 0x030121 18:8111: F0 08     BEQ bra_811B
C - - - - - 0x030123 18:8113: CA        DEX
C - - - - - 0x030124 18:8114: E0 03     CPX #$03
C - - - - - 0x030126 18:8116: 90 02     BCC bra_811A_RTS
C - - - - - 0x030128 18:8118: A2 02     LDX #$02
bra_811A_RTS:
C - - - - - 0x03012A 18:811A: 60        RTS
bra_811B:
- - - - - - 0x03012B 18:811B: A2 03     LDX #$03
- - - - - - 0x03012D 18:811D: 60        RTS



ofs_033_811E_03_сообщение_при_разводке:
; 5 вариантов диалога
C - J - - - 0x03012E 18:811E: AE 29 06  LDX ram_флаг_разводки
C - - - - - 0x030131 18:8121: 60        RTS



ofs_033_8122_04_выбрать_диалог_ожидания_в_зависимости_от_команды:
; 7 вариантов диалога
C - J - - - 0x030132 18:8122: A2 00     LDX #$00
C - - - - - 0x030134 18:8124: A5 26     LDA ram_матч
bra_8126_loop:
C - - - - - 0x030136 18:8126: DD 31 81  CMP tbl_8131_номер_команды,X
C - - - - - 0x030139 18:8129: 90 05     BCC bra_8130_RTS
C - - - - - 0x03013B 18:812B: F0 03     BEQ bra_8130_RTS
C - - - - - 0x03013D 18:812D: E8        INX
C - - - - - 0x03013E 18:812E: D0 F6     BNE bra_8126_loop
bra_8130_RTS:
C - - - - - 0x030140 18:8130: 60        RTS

tbl_8131_номер_команды:
    .byte $05
    .byte $0B
    .byte $0F
    .byte $15
    .byte $16
    .byte $1A
    .byte $21



ofs_033_8138_05_сообщение_после_тайма:
; 16 вариантов диалога
C - J - - - 0x030148 18:8138: A5 27     LDA ram_номер_тайма
C - - - - - 0x03014A 18:813A: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x03014D 18:813D: 47 81     .word ofs_034_8147_00_02___1й_тайм
- D - I - - 0x03014F 18:813F: 56 81     .word ofs_034_8156_01_03_04___2й_тайм___овертайм___пенальти
- - - - - - 0x030151 18:8141: 47 81     .word ofs_034_8147_00_02___1й_тайм
- D - I - - 0x030153 18:8143: 56 81     .word ofs_034_8156_01_03_04___2й_тайм___овертайм___пенальти
- D - I - - 0x030155 18:8145: 56 81     .word ofs_034_8156_01_03_04___2й_тайм___овертайм___пенальти



ofs_034_8147_00_02___1й_тайм:
C - J - - - 0x030157 18:8147: A2 02     LDX #$02
C - - - - - 0x030159 18:8149: AD 28 00  LDA ram_голы
C - - - - - 0x03015C 18:814C: CD 29 00  CMP ram_голы + 1
C - - - - - 0x03015F 18:814F: F0 04     BEQ bra_8155_RTS
C - - - - - 0x030161 18:8151: CA        DEX
C - - - - - 0x030162 18:8152: 90 01     BCC bra_8155_RTS
C - - - - - 0x030164 18:8154: CA        DEX
bra_8155_RTS:
C - - - - - 0x030165 18:8155: 60        RTS



ofs_034_8156_01_03_04___2й_тайм___овертайм___пенальти:
; почему-то нигде нету проверки на наш проигрыш (или я туплю)
    ; вероятно это выясняется где-то раньше
C - J - - - 0x030166 18:8156: A4 26     LDY ram_матч
C - - - - - 0x030168 18:8158: B9 AC 81  LDA tbl_81AC_параметры_сообщения_матча,Y
C - - - - - 0x03016B 18:815B: 85 49     STA ram_0049
C - - - - - 0x03016D 18:815D: AD 28 00  LDA ram_голы
C - - - - - 0x030170 18:8160: CD 29 00  CMP ram_голы + 1
C - - - - - 0x030173 18:8163: D0 26     BNE bra_818B_это_не_ничья
C - - - - - 0x030175 18:8165: A2 0D     LDX #$0D      ; это ничья
C - - - - - 0x030177 18:8167: AD 27 00  LDA ram_номер_тайма
C - - - - - 0x03017A 18:816A: C9 01     CMP #$01
C - - - - - 0x03017C 18:816C: F0 10     BEQ bra_817E_только_что_отыгран_2й_тайм
C - - - - - 0x03017E 18:816E: 24 49     BIT ram_0049
C - - - - - 0x030180 18:8170: 50 02     BVC bra_8174_в_матче_не_бывает_пенальти
C - - - - - 0x030182 18:8172: E8        INX
C - - - - - 0x030183 18:8173: 60        RTS
bra_8174_в_матче_не_бывает_пенальти:
- - - - - - 0x030184 18:8174: AD 2B 00  LDA ram_команда_соперника
- - - - - - 0x030187 18:8177: C9 23     CMP #$23
- - - - - - 0x030189 18:8179: D0 02     BNE bra_817D_это_не_бразилия
- - - - - - 0x03018B 18:817B: A2 0F     LDX #$0F      ; это турция
bra_817D_это_не_бразилия:
- - - - - - 0x03018D 18:817D: 60        RTS
bra_817E_только_что_отыгран_2й_тайм:
; + сейчас ничья
C - - - - - 0x03018E 18:817E: A2 0C     LDX #$0C
C - - - - - 0x030190 18:8180: 24 49     BIT ram_0049
C - - - - - 0x030192 18:8182: 30 06     BMI bra_818A_RTS        ; выход если овертайм без пенальти
- - - - - - 0x030194 18:8184: E8        INX
- - - - - - 0x030195 18:8185: 24 49     BIT ram_0049
- - - - - - 0x030197 18:8187: 50 01     BVC bra_818A_RTS        ; выход если овертайм с пенальти
- - - - - - 0x030199 18:8189: E8        INX
bra_818A_RTS:
C - - - - - 0x03019A 18:818A: 60        RTS
bra_818B_это_не_ничья:
C - - - - - 0x03019B 18:818B: B0 0A     BCS bra_8197_мы_победили
C - - - - - 0x03019D 18:818D: A2 0A     LDX #$0A      ; мы проигрываем
C - - - - - 0x03019F 18:818F: A5 27     LDA ram_номер_тайма
C - - - - - 0x0301A1 18:8191: C9 04     CMP #$04
C - - - - - 0x0301A3 18:8193: D0 01     BNE bra_8196_RTS_если_сейчас_были_отыграны_пенальти
C - - - - - 0x0301A5 18:8195: E8        INX
bra_8196_RTS_если_сейчас_были_отыграны_пенальти:
C - - - - - 0x0301A6 18:8196: 60        RTS
bra_8197_мы_победили:
C - - - - - 0x0301A7 18:8197: A5 49     LDA ram_0049
C - - - - - 0x0301A9 18:8199: 29 07     AND #$07
C - - - - - 0x0301AB 18:819B: 18        CLC
C - - - - - 0x0301AC 18:819C: 69 03     ADC #$03
C - - - - - 0x0301AE 18:819E: AA        TAX
C - - - - - 0x0301AF 18:819F: E0 03     CPX #$03
C - - - - - 0x0301B1 18:81A1: D0 08     BNE bra_81AB_RTS
C - - - - - 0x0301B3 18:81A3: A5 27     LDA ram_номер_тайма
C - - - - - 0x0301B5 18:81A5: C9 03     CMP #$03
C - - - - - 0x0301B7 18:81A7: D0 02     BNE bra_81AB_RTS
- - - - - - 0x0301B9 18:81A9: A2 09     LDX #$09
bra_81AB_RTS:
C - - - - - 0x0301BB 18:81AB: 60        RTS

tbl_81AC_параметры_сообщения_матча:
; +00 = без пенальти и без овертайма
; +40 = пенальти без овертайма
; +80 = овертайм без пенальти
; +C0 = овертайм и пенальти
    .byte $C0, $C0, $C0, $C0, $C1, $C2
    .byte $40, $40, $40, $40, $41, $C2
    .byte $C0, $C0, $C1, $C3
    .byte $C0, $C0, $C0, $C0, $C1, $C2, $00
    .byte $C0, $C0, $C0, $C0
    .byte $C0, $C0, $C0, $C4, $C5, $86



ofs_033_81CE_06:
; 4 варианта диалога (использовалось лишь первые 2)
C - J - - - 0x0301DE 18:81CE: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0301E1 18:81D1: 4A        LSR
C - - - - - 0x0301E2 18:81D2: A2 00     LDX #$00
C - - - - - 0x0301E4 18:81D4: C9 01     CMP #$01
C - - - - - 0x0301E6 18:81D6: 90 0B     BCC bra_81E3_RTS
C - - - - - 0x0301E8 18:81D8: E8        INX
C - - - - - 0x0301E9 18:81D9: C9 05     CMP #$05
C - - - - - 0x0301EB 18:81DB: 90 06     BCC bra_81E3_RTS
- - - - - - 0x0301ED 18:81DD: E8        INX
- - - - - - 0x0301EE 18:81DE: C9 06     CMP #$06
- - - - - - 0x0301F0 18:81E0: 90 01     BCC bra_81E3_RTS
- - - - - - 0x0301F2 18:81E2: E8        INX
bra_81E3_RTS:
C - - - - - 0x0301F3 18:81E3: 60        RTS



ofs_033_81E4_07_сообщение_о_дисбалансе_кипера:
; 00 - не дисбалансирован (unused)
; 01 - немного дисбалансирован
; 02 - сильно дисбалансирован
C - J - - - 0x0301F4 18:81E4: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0301F7 18:81E7: 49 0B     EOR #$0B
C - - - - - 0x0301F9 18:81E9: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x0301FC 18:81EC: A2 00     LDX #$00
C - - - - - 0x0301FE 18:81EE: A0 07     LDY #con_величина_наебки
C - - - - - 0x030200 18:81F0: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030202 18:81F2: C9 19     CMP #$19
C - - - - - 0x030204 18:81F4: 90 06     BCC bra_81FC_RTS
C - - - - - 0x030206 18:81F6: E8        INX
C - - - - - 0x030207 18:81F7: C9 36     CMP #$36
C - - - - - 0x030209 18:81F9: 90 01     BCC bra_81FC_RTS
C - - - - - 0x03020B 18:81FB: E8        INX
bra_81FC_RTS:
C - - - - - 0x03020C 18:81FC: 60        RTS



ofs_033_81FD_08_рандомный_выбор_из_64_фраз:
    LDA ram_рандом_1
    AND #$3F
    TAX
    RTS



ofs_032_81FD_F5_очистить_экран_и_прочитать_таймер:
C - J - - - 0x03020D 18:81FD: 20 2D C5  JSR sub_0x03CC56_очистить_нижнюю_половину_экрана
C - - - - - 0x030210 18:8200: A9 0D     LDA #$0D
C - - - - - 0x030212 18:8202: 8D F3 05  STA ram_05F3
C - - - - - 0x030215 18:8205: A9 80     LDA #$80
C - - - - - 0x030217 18:8207: 8D F4 05  STA ram_05F4
C - - - - - 0x03021A 18:820A: AC E5 05  LDY ram_индекс_байтов_облака
C - - - - - 0x03021D 18:820D: B1 5F     LDA (ram_cloud_data),Y
C - - - - - 0x03021F 18:820F: 8D E9 05  STA ram_таймер_облака_ХЗ
C - - - - - 0x030222 18:8212: EE E5 05  INC ram_индекс_байтов_облака
C - - - - - 0x030225 18:8215: 68        PLA
C - - - - - 0x030226 18:8216: 68        PLA
C - - - - - 0x030227 18:8217: 60        RTS



ofs_031_8218_01_отрисовка_облака:
    LDY ram_индекс_байтов_облака
    LDA (ram_cloud_data),Y
    BMI @не_выводить_чарли
    STA ram_05F3
    LDA #$80
    STA ram_05F4
@не_выводить_чарли:
    INY
    LDA (ram_cloud_data),Y
    ASL
    TAX
    INY
    STY ram_индекс_байтов_облака
    LDA tbl_8DC2_тайлы_облаков,X
    STA ram_cloud_tile_data
    LDA tbl_8DC2_тайлы_облаков + 1,X
    STA ram_cloud_tile_data + 1
    LDA #$27        ; начальный адрес ppu lo для записи тайлов
    PHA
    LDA #$22        ; начальный адрес ppu hi для записи тайлов
    PHA
    LDA #$0C        ; всего 12 строк, чтение по 2 строки
    STA ram_05E8
@ожидание_освобождения_буфера:
    LDA #$01
    JSR sub_0x03CB1F_задержка
    LDA ram_0515
    BNE @ожидание_освобождения_буфера
    LDA #$01
    STA ram_0515
    LDX #$00
    LDY #$00
@цикл_чтения_строки:
    LDA #$19            ; прочитать 25 байтов строки
    STA ram_003A
    STA ram_04A5,X
    PLA
    STA ram_04A7,X
    PLA
    STA ram_04A6,X
    CLC
    ADC #$20
    PHA
    LDA ram_04A7,X
    ADC #$00
    PHA
    INX
    INX
    INX
@цикл_чтения_тайлов_строки:
    LDA (ram_cloud_tile_data),Y
    STA ram_04A5,X
    INY
    INX
    DEC ram_003A
    BNE @цикл_чтения_тайлов_строки
    DEC ram_05E8
    LDA ram_05E8
    AND #$01            ; продолжать читать если прочитана лишь 1 строка
    BNE @цикл_чтения_строки
    LDA #$00
    STA ram_04A5,X
    LDA ram_cloud_tile_data
    CLC
    ADC #$32            ; сместить указатель на 50 байтов
    STA ram_cloud_tile_data
    LDA ram_cloud_tile_data + 1
    ADC #$00
    STA ram_cloud_tile_data + 1
    LDA #$80
    STA ram_0515
    LDA ram_05E8
    BNE @ожидание_освобождения_буфера
    PLA
    PLA
    LDY ram_индекс_байтов_облака
    LDA (ram_cloud_data),Y
    STA ram_05E7       ; начальная строка облака
    LDA #$06
    SEC
    SBC ram_05E7
    STA ram_05E8       ; количество строк в облаке
    INY
    STY ram_индекс_байтов_облака
    INC ram_05E4
    RTS



ofs_031_82F2_02_вывод_текста:
@ожидание_освобождения_буфера:
    LDA #$01
    JSR sub_0x03CB1F_задержка
    LDA ram_0515
    BNE @ожидание_освобождения_буфера
    LDA #$01
    STA ram_0515
    LDX #$15
@очистка_буфера:
    LDA #$00
    STA ram_04A8,X
    DEX
    BPL @очистка_буфера
    LDA #$03
    STA ram_003A
    TAX
    LDA #$14
    STA ram_04A5
    LDA ram_05E7
    ASL
    TAY
    LDA tbl_86E8_адрес_ppu_строки_облака,Y
    STA ram_04A6
    LDA tbl_86E8_адрес_ppu_строки_облака + 1,Y
    STA ram_04A7
loc_8346_цикл:
    LDY ram_индекс_байтов_облака
    INC ram_индекс_байтов_облака
    LDA (ram_cloud_data),Y
    CMP #$E0
    BCC @запись_буквы
    JSR sub_835E_управляющие_байты_облака
    JMP loc_8346_цикл
@запись_буквы:
    LDX ram_003A
    STA ram_04A5,X
    INC ram_003A
    JMP loc_8346_цикл



sub_835E_управляющие_байты_облака:
C - - - - - 0x03036E 18:835E: 38        SEC
C - - - - - 0x03036F 18:835F: E9 E0     SBC #$E0
C - - - - - 0x030371 18:8361: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x030374 18:8364: A4 83     .word ofs_035_83A4_E0_название_действия_атаки
- D - I - - 0x030376 18:8366: CA 83     .word ofs_035_83CA_E1_название_действия_защиты
- D - I - - 0x030378 18:8368: E2 83     .word ofs_035_83E2_E2_крит_атаки_ХЗ
- D - I - - 0x03037A 18:836A: 43 84     .word ofs_035_8443_E3_крит_защиты_ХЗ
- D - I - - 0x03037C 18:836C: 67 84     .word ofs_035_8467_E4_имя_игрока_с_мячом
- D - I - - 0x03037E 18:836E: 6D 84     .word ofs_035_846D_E5_имя_команды_без_мяча
- D - I - - 0x030380 18:8370: 75 84     .word ofs_035_8475_E6_имя_команды_с_мячом
- D - I - - 0x030382 18:8372: 8D 84     .word ofs_035_848D_E7_количество_нападающих
- D - I - - 0x030384 18:8374: 93 84     .word ofs_035_8493_E8_имя_нападающего_1
- D - I - - 0x030386 18:8376: 99 84     .word ofs_035_8499_E9_имя_нападающего_2
- D - I - - 0x030388 18:8378: 9F 84     .word ofs_035_849F_EA_имя_нападающего_3
- D - I - - 0x03038A 18:837A: A5 84     .word ofs_035_84A5_EB_имя_принимающего
- D - I - - 0x03038C 18:837C: AB 84     .word ofs_035_84AB_EC_названия_действия_кипера
- D - I - - 0x03038E 18:837E: CE 84     .word ofs_035_84CE_ED_имя_голкипера
- D - I - - 0x030390 18:8380: D6 84     .word ofs_035_84D6_EE_имя_игрока_без_мяча
- - - - - - 0x030392 18:8382: DC 84     .word $0000   ; unused
- D - I - - 0x030394 18:8384: DC 84     .word ofs_035_84DC_F0_порядковый_номер_защитника_ХЗ
- D - I - - 0x030396 18:8386: E6 84     .word ofs_035_84E6_F1_имя_команды_слева
- D - I - - 0x030398 18:8388: EC 84     .word ofs_035_84EC_F2_имя_команды_справа
- D - I - - 0x03039A 18:838A: FB 84     .word ofs_035_84FB_F3_возраст_ХЗ
- D - I - - 0x03039C 18:838C: 07 85     .word ofs_035_8507_F4_возраст_ХЗ
- D - I - - 0x03039E 18:838E: B1 85     .word ofs_035_85B1_F5_слово_ball
- D - I - - 0x0303A0 18:8390: B6 85     .word ofs_035_85B6_F6_слово_goal
- D - I - - 0x0303A2 18:8392: BB 85     .word ofs_035_85BB_F7_вывести_тильду_несколько_раз
- D - I - - 0x0303A4 18:8394: D0 85     .word ofs_035_85D0_F8_слово_okay_джито
- - - - - - 0x0303A6 18:8396: D5 85     .word $0000   ; unused
- - - - - - 0x0303A8 18:8398: D5 85     .word $0000   ; unused
- - - - - - 0x0303AA 18:839A: D5 85     .word $0000   ; unused
- D - I - - 0x0303AC 18:839C: D6 85     .word ofs_035_85D6_FC_новая_строка
- - - - - - 0x0303AE 18:839E: FD 85     .word $0000   ; unused
- - - - - - 0x0303B0 18:83A0: FE 85     .word ofs_035_85FE_FE     ; unused
- - - - - - 0x0303B2 18:83A2: 21 86     .word ofs_035_8621_FF     ; unused



ofs_035_83A4_E0_название_действия_атаки:
C - J - - - 0x0303B4 18:83A4: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x0303B7 18:83A7: C9 01     CMP #$01
C - - - - - 0x0303B9 18:83A9: D0 07     BNE bra_83B2
C - - - - - 0x0303BB 18:83AB: 2C 28 06  BIT ram_индекс_буфера
C - - - - - 0x0303BE 18:83AE: 10 02     BPL bra_83B2
- - - - - - 0x0303C0 18:83B0: A9 0A     LDA #$0A
bra_83B2:
C - - - - - 0x0303C2 18:83B2: AA        TAX
C - - - - - 0x0303C3 18:83B3: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x0303C6 18:83B6: 29 7F     AND #$7F
C - - - - - 0x0303C8 18:83B8: 18        CLC
C - - - - - 0x0303C9 18:83B9: 7D BF 83  ADC tbl_83BF_действия_атаки,X
C - - - - - 0x0303CC 18:83BC: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов

tbl_83BF_действия_атаки:
    .byte $9A       ; shot
    .byte $C4       ; pass
    .byte $BD       ; dribble
    .byte $C8       ; 1-2 pass
    .byte $D9       ; trap
    .byte $DA       ; through
    .byte $DB       ; clearing
    .byte $EC       ; penalty kick
    .byte $EC       ; penalty kick
    .byte $EC       ; penalty kick
    .byte $EB       ; centering



ofs_035_83CA_E1_название_действия_защиты:
C - J - - - 0x0303DA 18:83CA: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x0303DD 18:83CD: 29 1F     AND #$1F
C - - - - - 0x0303DF 18:83CF: AA        TAX
C - - - - - 0x0303E0 18:83D0: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - - 0x0303E3 18:83D3: 29 7F     AND #$7F
C - - - - - 0x0303E5 18:83D5: 18        CLC
C - - - - - 0x0303E6 18:83D6: 7D DC 83  ADC tbl_83DC_действия_защиты,X
C - - - - - 0x0303E9 18:83D9: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов

tbl_83DC_действия_защиты:
    .byte $CD       ; block
    .byte $D1       ; tackle
    .byte $D7       ; pass cut (unused)
    .byte $DB       ; clearing
    .byte $DD       ; interfere (unused)
    .byte $DF       ; mark ? (unused)



ofs_035_83E2_E2_крит_атаки_ХЗ:
C - J - - - 0x0303F2 18:83E2: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x0303F5 18:83E5: 10 2C     BPL bra_8413
C - - - - - 0x0303F7 18:83E7: 29 7F     AND #$7F
C - - - - - 0x0303F9 18:83E9: F0 10     BEQ bra_83FB
C - - - - - 0x0303FB 18:83EB: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x0303FE 18:83EE: D0 0B     BNE bra_83FB
C - - - - - 0x030400 18:83F0: C9 03     CMP #$03
C - - - - - 0x030402 18:83F2: B0 1F     BCS bra_8413
C - - - - - 0x030404 18:83F4: AA        TAX
C - - - - - 0x030405 18:83F5: BD 40 84  LDA tbl_8440_название_крита_2,X
C - - - - - 0x030408 18:83F8: 4C 10 84  JMP loc_8410
bra_83FB:
C - - - - - 0x03040B 18:83FB: AE 3B 04  LDX ram_действие_атаки
C - - - - - 0x03040E 18:83FE: E0 01     CPX #$01
C - - - - - 0x030410 18:8400: D0 07     BNE bra_8409
C - - - - - 0x030412 18:8402: 2C 28 06  BIT ram_индекс_буфера
C - - - - - 0x030415 18:8405: 10 02     BPL bra_8409
C - - - - - 0x030417 18:8407: A2 0A     LDX #$0A
bra_8409:
C - - - - - 0x030419 18:8409: BD 35 84  LDA tbl_8435_название_крита_1,X
C - - - - - 0x03041C 18:840C: C9 FF     CMP #$FF
C - - - - - 0x03041E 18:840E: F0 03     BEQ bra_8413
loc_8410:
C D - - - - 0x030420 18:8410: 20 3C 86  JSR sub_863C_прочитать_таблицу_слов
bra_8413:
C - - - - - 0x030423 18:8413: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x030426 18:8416: C9 01     CMP #$01
C - - - - - 0x030428 18:8418: D0 07     BNE bra_8421
C - - - - - 0x03042A 18:841A: 2C 28 06  BIT ram_индекс_буфера
C - - - - - 0x03042D 18:841D: 10 02     BPL bra_8421
C - - - - - 0x03042F 18:841F: A9 0A     LDA #$0A
bra_8421:
C - - - - - 0x030431 18:8421: AA        TAX
C - - - - - 0x030432 18:8422: 08        PHP
C - - - - - 0x030433 18:8423: BD BF 83  LDA tbl_83BF_действия_атаки,X
C - - - - - 0x030436 18:8426: 28        PLP
C - - - - - 0x030437 18:8427: D0 09     BNE bra_8432
C - - - - - 0x030439 18:8429: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - - 0x03043C 18:842C: 29 03     AND #$03
C - - - - - 0x03043E 18:842E: 18        CLC
C - - - - - 0x03043F 18:842F: 7D BF 83  ADC tbl_83BF_действия_атаки,X
bra_8432:
C - - - - - 0x030442 18:8432: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов

tbl_8435_название_крита_1:
    .byte $E8        ; きょうれつな power ?
    .byte $E6        ; するどい кальмар ?
    .byte $FF        ; (unused)
    .byte $E6        ; するどい кальмар ?(unused)
    .byte $E9        ; うまい good
    .byte $E9        ; うまい good
    .byte $E7        ; すばやく quick ?
    .byte $00        ; (unused)
    .byte $00        ; (unused)
    .byte $00        ; (unused)
    .byte $E9        ; うまい good

tbl_8440_название_крита_2:
    .byte $E8        ; きょうれつな power ? (unused)
    .byte $EA        ; きょうれつな power ? с пробелом
    .byte $E8        ; きょうれつな power ?



ofs_035_8443_E3_крит_защиты_ХЗ:
C - J - - - 0x030453 18:8443: 2C 3E 04  BIT ram_подтип_действия_защиты
C - - - - - 0x030456 18:8446: 10 0D     BPL bra_8455
C - - - - - 0x030458 18:8448: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x03045B 18:844B: BD 61 84  LDA tbl_8461_крит_защиты_ХЗ,X
C - - - - - 0x03045E 18:844E: C9 FF     CMP #$FF
C - - - - - 0x030460 18:8450: F0 03     BEQ bra_8455
C - - - - - 0x030462 18:8452: 20 3C 86  JSR sub_863C_прочитать_таблицу_слов
bra_8455:
C - - - - - 0x030465 18:8455: AD 3D 04  LDA ram_действие_защиты
C - - - - - 0x030468 18:8458: 29 3F     AND #$3F
C - - - - - 0x03046A 18:845A: AA        TAX
C - - - - - 0x03046B 18:845B: BD DC 83  LDA tbl_83DC_действия_защиты,X
C - - - - - 0x03046E 18:845E: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов

tbl_8461_крит_защиты_ХЗ:
    .byte $E6        ; するどい кальмар ? (unused)
    .byte $E6        ; するどい кальмар ?
    .byte $FF        ; (unused)
    .byte $E7        ; すばやく quick ?
    .byte $FF        ; (unused)
    .byte $FF        ; (unused)



ofs_035_8467_E4_имя_игрока_с_мячом:
C - J - - - 0x030477 18:8467: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x03047A 18:846A: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_846D_E5_имя_команды_без_мяча:
C - J - - - 0x03047D 18:846D: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x030480 18:8470: 49 0B     EOR #$0B
C - - - - - 0x030482 18:8472: 4C 78 84  JMP loc_8478_вывести_имя_команды



ofs_035_8475_E6_имя_команды_с_мячом:
C - J - - - 0x030485 18:8475: AD FB 05  LDA ram_команда_с_мячом
loc_8478_вывести_имя_команды:
C D - - - - 0x030488 18:8478: AC 2A 00  LDY ram_твоя_команда
C - - - - - 0x03048B 18:847B: AA        TAX
C - - - - - 0x03048C 18:847C: F0 08     BEQ bra_8486    ; if комада слева
; if комада справа
C - - - - - 0x03048E 18:847E: AC 2B 00  LDY ram_команда_соперника
C - - - - - 0x030491 18:8481: C0 24     CPY #$24
C - - - - - 0x030493 18:8483: D0 01     BNE bra_8486
- - - - - - 0x030495 18:8485: 88        DEY
bra_8486:
C - - - - - 0x030496 18:8486: 98        TYA
C - - - - - 0x030497 18:8487: 18        CLC
C - - - - - 0x030498 18:8488: 69 76     ADC #$76
C - - - - - 0x03049A 18:848A: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов



ofs_035_848D_E7_количество_нападающих:
C - J - - - 0x03049D 18:848D: AD 00 06  LDA ram_колво_защитников
C D - - - - 0x0306C2 18:86B2: 18        CLC
C - - - - - 0x0306C3 18:86B3: 69 33     ADC #$33
C - - - - - 0x0306C5 18:86B5: 4C 29 86  JMP loc_8629_запись_символа_в_буфер



ofs_035_8493_E8_имя_нападающего_1:
C - J - - - 0x0304A3 18:8493: AD 01 06  LDA ram_номер_защитника
C - - - - - 0x0304A6 18:8496: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_8499_E9_имя_нападающего_2:
C - J - - - 0x0304A9 18:8499: AD 02 06  LDA ram_номер_защитника + 1
C - - - - - 0x0304AC 18:849C: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_849F_EA_имя_нападающего_3:
C - J - - - 0x0304AF 18:849F: AD 03 06  LDA ram_номер_защитника + 2
C - - - - - 0x0304B2 18:84A2: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_84A5_EB_имя_принимающего:
C - J - - - 0x0304B5 18:84A5: AD FC 05  LDA ram_принимающий
C - - - - - 0x0304B8 18:84A8: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_84AB_EC_названия_действия_кипера:
C - J - - - 0x0304BB 18:84AB: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x0304BE 18:84AE: BD C7 84  LDA tbl_84C7_действия_кипера,X
C - - - - - 0x0304C1 18:84B1: F0 13     BEQ bra_84C6_RTS
C - - - - - 0x0304C3 18:84B3: 2C 3E 04  BIT ram_подтип_действия_защиты
C - - - - - 0x0304C6 18:84B6: 10 05     BPL bra_84BD
C - - - - - 0x0304C8 18:84B8: A9 E6     LDA #$E6
C - - - - - 0x0304CA 18:84BA: 20 3C 86  JSR sub_863C_прочитать_таблицу_слов
bra_84BD:
C - - - - - 0x0304CD 18:84BD: AE 3D 04  LDX ram_действие_защиты
C - - - - - 0x0304D0 18:84C0: BD C7 84  LDA tbl_84C7_действия_кипера,X
C - - - - - 0x0304D3 18:84C3: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов
bra_84C6_RTS:
- - - - - - 0x0304D6 18:84C6: 60        RTS

tbl_84C7_действия_кипера:
    .byte $E0        ; catch
    .byte $E4        ; punch
    .byte $00        ; (unused)
    .byte $00        ; (unused)
    .byte $00        ; (unused)
    .byte $E0        ; catch
    .byte $E0        ; catch



ofs_035_84CE_ED_имя_голкипера:
C - J - - - 0x0304DE 18:84CE: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x0304E1 18:84D1: 49 0B     EOR #$0B
C - - - - - 0x0304E3 18:84D3: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_84D6_EE_имя_игрока_без_мяча:
C - J - - - 0x0304E6 18:84D6: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x0304E9 18:84D9: 4C 53 86  JMP loc_8653_вывести_имя_игрока



ofs_035_84DC_F0_порядковый_номер_защитника_ХЗ:
C - J - - - 0x0304EC 18:84DC: AD 16 06  LDA ram_индекс_защитника
C - - - - - 0x0304EF 18:84DF: 4A        LSR
C - - - - - 0x0304F0 18:84E0: 18        CLC
C - - - - - 0x0304F1 18:84E1: 69 34     ADC #$34
C - - - - - 0x0304F3 18:84E3: 4C 29 86  JMP loc_8629_запись_символа_в_буфер



ofs_035_84E6_F1_имя_команды_слева:
C - J - - - 0x0304F6 18:84E6: AD 2A 00  LDA ram_твоя_команда
C - - - - - 0x0304F9 18:84E9: 4C EF 84  JMP loc_84EF_вывести_имя_команды



ofs_035_84EC_F2_имя_команды_справа:
C - J - - - 0x0304FC 18:84EC: AD 2B 00  LDA ram_команда_соперника
loc_84EF_вывести_имя_команды:
C D - - - - 0x0304FF 18:84EF: C9 24     CMP #$24
; bzk ненужная проверка, команды 24 не существует
C - - - - - 0x030501 18:84F1: D0 02     BNE bra_84F5
- - - - - - 0x030503 18:84F3: A9 23     LDA #$23
bra_84F5:
C - - - - - 0x030505 18:84F5: 18        CLC
C - - - - - 0x030506 18:84F6: 69 76     ADC #$76
C - - - - - 0x030508 18:84F8: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов



ofs_035_84FB_F3_возраст_ХЗ:
C - J - - - 0x03050B 18:84FB: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x03050E 18:84FE: 20 13 85  JSR sub_8513
C - - - - - 0x030511 18:8501: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x030514 18:8504: 4C 34 85  JMP loc_8534_добавить_окончание_кун



ofs_035_8507_F4_возраст_ХЗ:
C - J - - - 0x030517 18:8507: AD 42 04  LDA ram_игрок_без_мяча
C - - - - - 0x03051A 18:850A: 20 13 85  JSR sub_8513
C - - - - - 0x03051D 18:850D: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x030520 18:8510: 4C 34 85  JMP loc_8534_добавить_окончание_кун



sub_8513:
; вероятно японское общение игроков между собой с назыанием имен собеседника с учетом возраста
C - - - - - 0x030523 18:8513: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030526 18:8516: A0 00     LDY #con_plr_id
C - - - - - 0x030528 18:8518: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x03052A 18:851A: A2 00     LDX #$00
bra_851C_loop:
C - - - - - 0x03052C 18:851C: DD 2C 85  CMP tbl_852C_игроки,X
C - - - - - 0x03052F 18:851F: F0 07     BEQ bra_8528_игрок_найден
C - - - - - 0x030531 18:8521: E8        INX
C - - - - - 0x030532 18:8522: E0 08     CPX #$08
C - - - - - 0x030534 18:8524: D0 F6     BNE bra_851C_loop
C - - - - - 0x030536 18:8526: 18        CLC
C - - - - - 0x030537 18:8527: 60        RTS
bra_8528_игрок_найден:
C - - - - - 0x030538 18:8528: 86 3D     STX ram_003D
C - - - - - 0x03053A 18:852A: 38        SEC
C - - - - - 0x03053B 18:852B: 60        RTS

tbl_852C_игроки:
    .byte $01       ; tsubasa
    .byte $11       ; misaki
    .byte $44       ; misaki
    .byte $34       ; misugi
    .byte $45       ; misugi
    .byte $15       ; nitta
    .byte $42       ; nitta
    .byte $38       ; sawada



loc_8534_добавить_окончание_кун:
C D - - - - 0x030544 18:8534: 08        PHP
C - - - - - 0x030545 18:8535: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030548 18:8538: 28        PLP
C - - - - - 0x030549 18:8539: 90 37     BCC bra_8572      ; если игрок не был найден в таблице выше
C - - - - - 0x03054B 18:853B: A5 3D     LDA ram_003D
C - - - - - 0x03054D 18:853D: 0A        ASL
C - - - - - 0x03054E 18:853E: AA        TAX
C - - - - - 0x03054F 18:853F: BD 89 85  LDA tbl_8589_игроки,X
C - - - - - 0x030552 18:8542: 85 3E     STA ram_003E
C - - - - - 0x030554 18:8544: BD 8A 85  LDA tbl_8589_игроки + 1,X
C - - - - - 0x030557 18:8547: 85 3F     STA ram_003F
C - - - - - 0x030559 18:8549: A0 00     LDY #con_plr_id
C - - - - - 0x03055B 18:854B: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x03055D 18:854D: AA        TAX
bra_8550_loop_поиска_совпадения:
C - - - - - 0x030560 18:8550: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030562 18:8552: F0 1E     BEQ bra_8572
C - - - - - 0x030564 18:8554: 8A        TXA
C - - - - - 0x030565 18:8555: D1 3E     CMP (ram_003E),Y
C - - - - - 0x030567 18:8557: F0 03     BEQ bra_855C_совпадение
C - - - - - 0x030569 18:8559: C8        INY
C - - - - - 0x03056A 18:855A: D0 F4     BNE bra_8550_loop_поиска_совпадения
bra_855C_совпадение:
C - - - - - 0x03056C 18:855C: 8A        TXA
C - - - - - 0x03056D 18:855D: 20 3C 86  JSR sub_863C_прочитать_таблицу_слов
; в оригинале тут была таблица с одинаковыми байтами 08 и 2E, читалась с помощью 003D
C - - - - - 0x030578 18:8568: BD 79 85  LDA #$08      ; 2 байта для окончания "кун"
C - - - - - 0x03057B 18:856B: 20 29 86  JSR sub_8629_запись_символа_в_буфер
C - - - - - 0x030574 18:8564: BD 7A 85  LDA #$2E
C - - - - - 0x03057F 18:856F: 4C 29 86  JMP loc_8629_запись_символа_в_буфер
bra_8572:
C - - - - - 0x030582 18:8572: A0 00     LDY #con_plr_id
C - - - - - 0x030584 18:8574: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030586 18:8576: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов

tbl_8589_игроки:
- D - - - - 0x030599 18:8589: 99 85     .word off_8599_00
- D - - - - 0x03059B 18:858B: 9F 85     .word off_859F_01_02
- - - - - - 0x03059D 18:858D: 9F 85     .word off_859F_01_02
- - - - - - 0x03059F 18:858F: A2 85     .word off_85A2_03_04
- - - - - - 0x0305A1 18:8591: A2 85     .word off_85A2_03_04
- D - - - - 0x0305A3 18:8593: A5 85     .word off_85A5_05_06
- - - - - - 0x0305A5 18:8595: A5 85     .word off_85A5_05_06
- - - - - - 0x0305A7 18:8597: AE 85     .word off_85AE_07

off_8599_00:
; игроки японии когда они твои соперники
- D - I - - 0x0305A9 18:8599: 44        .byte $44    ; мисаки
- D - I - - 0x0305AA 18:859A: 41        .byte $41    ; хюга
- D - I - - 0x0305AB 18:859B: 45        .byte $45    ; мисуги
- D - I - - 0x0305AC 18:859C: 4B        .byte $4B    ; мацуяма
- D - I - - 0x0305AD 18:859D: 49        .byte $49    ; ишизаки
- D - I - - 0x0305AE 18:859E: 00        .byte $00

off_859F_01_02:
- D - I - - 0x0305AF 18:859F: 01        .byte $01    ; цубаса
- D - I - - 0x0305B0 18:85A0: 34        .byte $34    ; мисуги
- D - I - - 0x0305B1 18:85A1: 00        .byte $00

off_85A2_03_04:
- - - - - - 0x0305B2 18:85A2: 01        .byte $01    ; цубаса
- - - - - - 0x0305B3 18:85A3: 11        .byte $11    ; мисаки
- - - - - - 0x0305B4 18:85A4: 00        .byte $00

off_85A5_05_06:
- D - I - - 0x0305B5 18:85A5: 01        .byte $01    ; цубаса
- D - I - - 0x0305B6 18:85A6: 36        .byte $36    ; хюга
- D - I - - 0x0305B7 18:85A7: 34        .byte $34    ; мисуги
- D - I - - 0x0305B8 18:85A8: 35        .byte $35    ; мацуяма
- D - I - - 0x0305B9 18:85A9: 32        .byte $32    ; сода
- D - I - - 0x0305BA 18:85AA: 2E        .byte $2E    ; джито
- - - - - - 0x0305BB 18:85AB: 30        .byte $30    ; масао
- - - - - - 0x0305BC 18:85AC: 31        .byte $31    ; казуо
- - - - - - 0x0305BD 18:85AD: 00        .byte $00

off_85AE_07:
- - - - - - 0x0305BE 18:85AE: 11        .byte $11    ; мисаки
- - - - - - 0x0305BF 18:85AF: 15        .byte $15    ; нитта
- - - - - - 0x0305C0 18:85B0: 00        .byte $00



ofs_035_85B1_F5_слово_ball:
C - J - - - 0x0305C1 18:85B1: A9 ED     LDA #$ED      ; ボール ball
C - - - - - 0x0305C3 18:85B3: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов



ofs_035_85B6_F6_слово_goal:
C - J - - - 0x0305C6 18:85B6: A9 EE     LDA #$EE      ; ゴール goal
C - - - - - 0x0305C8 18:85B8: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов



ofs_035_85BB_F7_вывести_тильду_несколько_раз:
C - J - - - 0x0305CB 18:85BB: AC E5 05  LDY ram_индекс_байтов_облака
C - - - - - 0x0305CE 18:85BE: EE E5 05  INC ram_индекс_байтов_облака
C - - - - - 0x0305D1 18:85C1: B1 5F     LDA (ram_cloud_data),Y
bra_85C3_loop:
C - - - - - 0x0305D3 18:85C3: 48        PHA
C - - - - - 0x0305D4 18:85C4: A9 7C     LDA #$7C
C - - - - - 0x0305D6 18:85C6: 20 29 86  JSR sub_8629_запись_символа_в_буфер
C - - - - - 0x0305D9 18:85C9: 68        PLA
C - - - - - 0x0305DA 18:85CA: 38        SEC
C - - - - - 0x0305DB 18:85CB: E9 01     SBC #$01
C - - - - - 0x0305DD 18:85CD: D0 F4     BNE bra_85C3_loop
C - - - - - 0x0305DF 18:85CF: 60        RTS



ofs_035_85D0_F8_слово_okay_джито:
C - J - - - 0x0305E0 18:85D0: A9 EF     LDA #$EF      ; タイ
C - - - - - 0x0305E2 18:85D2: 4C 3C 86  JMP loc_863C_прочитать_таблицу_слов



ofs_035_85D6_FC_новая_строка:
    LDA #$80
    STA ram_0515
    LDA ram_05E7
    CMP ram_05E8
    BCC bra_85EC_строки_в_облаке_еще_есть
    LDA #$00
    STA ram_05E4
    BEQ bra_85F5
bra_85EC_строки_в_облаке_еще_есть:
    INC ram_05E7
    INC ram_05E7
    LDA ram_индекс_байтов_облака
    CLC
    ADC ram_cloud_data
    STA ram_cloud_data
    LDA ram_cloud_data + 1
    ADC #$00
    STA ram_cloud_data + 1
    LDA #$00
    STA ram_индекс_байтов_облака
bra_85F5:
    LDA #$01
    STA ram_таймер_облака_ХЗ
    PLA
    PLA
    RTS



ofs_035_85FE_FE:
- - - - - - 0x03060E 18:85FE: A9 80     LDA #$80
- - - - - - 0x030610 18:8600: 8D 15 05  STA ram_0515
- - - - - - 0x030613 18:8603: AD E3 05  LDA ram_05E3
- - - - - - 0x030616 18:8606: 29 BF     AND #$BF
- - - - - - 0x030618 18:8608: 8D E3 05  STA ram_05E3
bra_860B_loop:
- - - - - - 0x03061B 18:860B: A9 01     LDA #$01
- - - - - - 0x03061D 18:860D: 20 15 C5  JSR sub_0x03CB1F_задержка
- - - - - - 0x030620 18:8610: 20 60 C5  JSR sub_0x03CF82_отрисовка_чарли_на_фоне
- - - - - - 0x030623 18:8613: 2C E3 05  BIT ram_05E3
- - - - - - 0x030626 18:8616: 50 F3     BVC bra_860B_loop
- - - - - - 0x030628 18:8618: AD E3 05  LDA ram_05E3
- - - - - - 0x03062B 18:861B: 29 BF     AND #$BF
- - - - - - 0x03062D 18:861D: 8D E3 05  STA ram_05E3
- - - - - - 0x030630 18:8620: 60        RTS



ofs_035_8621_FF:
- - - - - - 0x030631 18:8621: A9 00     LDA #$00
- - - - - - 0x030633 18:8623: 8D E3 05  STA ram_05E3
- - - - - - 0x030636 18:8626: 68        PLA
- - - - - - 0x030637 18:8627: 68        PLA
- - - - - - 0x030638 18:8628: 60        RTS



sub_8629_запись_символа_в_буфер:
loc_8629_запись_символа_в_буфер:
    LDX ram_003A
    STA ram_04A5,X
    INC ram_003A
    RTS



loc_863C_прочитать_таблицу_слов:
sub_863C_прочитать_таблицу_слов:
C D - - - - 0x03064C 18:863C: 20 3C C5  JSR sub_0x03F31F_таблица_слов
C - - - - - 0x03064F 18:863F: A9 00     LDA #$00
C - - - - - 0x030651 18:8641: 85 3C     STA ram_003C
bra_8643_loop:
C - - - - - 0x030653 18:8643: A4 3C     LDY ram_003C
C - - - - - 0x030655 18:8645: B1 30     LDA (ram_0030),Y
C - - - - - 0x030657 18:8647: C9 E0     CMP #$E0
C - - - - - 0x030659 18:8649: B0 07     BCS bra_8652_RTS
C - - - - - 0x03065B 18:864B: 20 29 86  JSR sub_8629_запись_символа_в_буфер
C - - - - - 0x03065E 18:864E: E6 3C     INC ram_003C
C - - - - - 0x030660 18:8650: D0 F1     BNE bra_8643_loop
bra_8652_RTS:
C - - - - - 0x030662 18:8652: 60        RTS



loc_8653_вывести_имя_игрока:
; можно использовать 003D
C - - - - - 0x030665 18:8655: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030668 18:8658: A0 00     LDY #con_plr_id
C - - - - - 0x03066A 18:865A: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x03066E 18:865E: 20 3C 86  JMP loc_863C_прочитать_таблицу_слов



tbl_86E8_адрес_ppu_строки_облака:
    .word $228A
    .word $22AA
    .word $22CA
    .word $22EA
    .word $230A
    .word $232A
    .word $234A



sub_0x030708:
C D - - - - 0x030708 18:86F8: AD 32 05  LDA ram_0532
C - - - - - 0x03070B 18:86FB: F0 25     BEQ bra_8722_RTS
C - - - - - 0x03070D 18:86FD: 10 1B     BPL bra_871A
C - - - - - 0x03070F 18:86FF: 29 7F     AND #$7F
C - - - - - 0x030711 18:8701: 8D 32 05  STA ram_0532
C - - - - - 0x030714 18:8704: F0 1C     BEQ bra_8722_RTS
C - - - - - 0x030716 18:8706: 38        SEC
C - - - - - 0x030717 18:8707: E9 01     SBC #$01
C - - - - - 0x030719 18:8709: 0A        ASL
C - - - - - 0x03071A 18:870A: AA        TAX
C - - - - - 0x03071B 18:870B: BD 6E AD  LDA tbl_AD6E,X
C - - - - - 0x03071E 18:870E: 85 79     STA ram_0079
C - - - - - 0x030720 18:8710: BD 6F AD  LDA tbl_AD6E + 1,X
C - - - - - 0x030723 18:8713: 85 7A     STA ram_007A
C - - - - - 0x030725 18:8715: A9 00     LDA #$00
C - - - - - 0x030727 18:8717: 8D 33 05  STA ram_0533
bra_871A:
C - - - - - 0x03072A 18:871A: AD 33 05  LDA ram_0533
C - - - - - 0x03072D 18:871D: F0 04     BEQ bra_8723
C - - - - - 0x03072F 18:871F: CE 33 05  DEC ram_0533
bra_8722_RTS:
C - - - - - 0x030732 18:8722: 60        RTS
bra_8723:
loc_8723:
C D - - - - 0x030733 18:8723: A0 00     LDY #$00
bra_8725_loop:
C - - - - - 0x030735 18:8725: B1 79     LDA (ram_0079),Y
C - - - - - 0x030737 18:8727: 29 07     AND #$07
C - - - - - 0x030739 18:8729: AA        TAX
C - - - - - 0x03073A 18:872A: B1 79     LDA (ram_0079),Y
C - - - - - 0x03073C 18:872C: 4A        LSR
C - - - - - 0x03073D 18:872D: 4A        LSR
C - - - - - 0x03073E 18:872E: 4A        LSR
C - - - - - 0x03073F 18:872F: D0 0B     BNE bra_873C
C - - - - - 0x030741 18:8731: E0 00     CPX #$00
C - - - - - 0x030743 18:8733: F0 30     BEQ bra_8765
C - - - - - 0x030745 18:8735: E0 01     CPX #$01
C - - - - - 0x030747 18:8737: F0 32     BEQ bra_876B
- - - - - - 0x030749 18:8739: C8        INY
- - - - - - 0x03074A 18:873A: D0 E9     BNE bra_8725_loop
bra_873C:
C - - - - - 0x03074C 18:873C: 8D 33 05  STA ram_0533
C - - - - - 0x03074F 18:873F: B1 79     LDA (ram_0079),Y
C - - - - - 0x030751 18:8741: 29 07     AND #$07
C - - - - - 0x030753 18:8743: 85 3A     STA ram_003A
C - - - - - 0x030755 18:8745: C8        INY
bra_8746_loop:
C - - - - - 0x030756 18:8746: B1 79     LDA (ram_0079),Y
C - - - - - 0x030758 18:8748: AA        TAX
C - - - - - 0x030759 18:8749: C8        INY
C - - - - - 0x03075A 18:874A: B1 79     LDA (ram_0079),Y
C - - - - - 0x03075C 18:874C: 9D 6F 04  STA ram_046F,X
C - - - - - 0x03075F 18:874F: C8        INY
C - - - - - 0x030760 18:8750: C6 3A     DEC ram_003A
C - - - - - 0x030762 18:8752: D0 F2     BNE bra_8746_loop
C - - - - - 0x030764 18:8754: 98        TYA
C - - - - - 0x030765 18:8755: 18        CLC
C - - - - - 0x030766 18:8756: 65 79     ADC ram_0079
C - - - - - 0x030768 18:8758: 85 79     STA ram_0079
C - - - - - 0x03076A 18:875A: 90 02     BCC bra_875E_not_overflow
C - - - - - 0x03076C 18:875C: E6 7A     INC ram_007A
bra_875E_not_overflow:
C - - - - - 0x03076E 18:875E: 20 33 C5  JSR sub_0x03CCE3
C - - - - - 0x030774 18:8764: 60        RTS
bra_8765:
C - - - - - 0x030775 18:8765: A9 00     LDA #$00
C - - - - - 0x030777 18:8767: 8D 32 05  STA ram_0532
C - - - - - 0x03077A 18:876A: 60        RTS
bra_876B:
C - - - - - 0x03077B 18:876B: C8        INY
C - - - - - 0x03077C 18:876C: B1 79     LDA (ram_0079),Y
C - - - - - 0x03077E 18:876E: AA        TAX
C - - - - - 0x03077F 18:876F: C8        INY
C - - - - - 0x030780 18:8770: B1 79     LDA (ram_0079),Y
C - - - - - 0x030782 18:8772: 85 7A     STA ram_007A
C - - - - - 0x030784 18:8774: 86 79     STX ram_0079
C - - - - - 0x030786 18:8776: 4C 23 87  JMP loc_8723



sub_0x030789_движущийся_фон:
C D - - - - 0x030789 18:8779: AD 34 05  LDA ram_0534
C - - - - - 0x03078C 18:877C: F0 25     BEQ bra_87A3_RTS
C - - - - - 0x03078E 18:877E: 10 1B     BPL bra_879B
C - - - - - 0x030790 18:8780: 29 7F     AND #$7F
C - - - - - 0x030792 18:8782: 8D 34 05  STA ram_0534
C - - - - - 0x030795 18:8785: F0 1C     BEQ bra_87A3_RTS
C - - - - - 0x030797 18:8787: 38        SEC
C - - - - - 0x030798 18:8788: E9 01     SBC #$01
C - - - - - 0x03079A 18:878A: 0A        ASL
C - - - - - 0x03079B 18:878B: AA        TAX
C - - - - - 0x03079C 18:878C: BD 1C AD  LDA tbl_AD1C_движущийся_фон,X
C - - - - - 0x03079F 18:878F: 85 7B     STA ram_007B
C - - - - - 0x0307A1 18:8791: BD 1D AD  LDA tbl_AD1C_движущийся_фон + 1,X
C - - - - - 0x0307A4 18:8794: 85 7C     STA ram_007C
C - - - - - 0x0307A6 18:8796: A9 00     LDA #$00
C - - - - - 0x0307A8 18:8798: 8D 35 05  STA ram_0535
bra_879B:
C - - - - - 0x0307AB 18:879B: AD 35 05  LDA ram_0535
C - - - - - 0x0307AE 18:879E: F0 04     BEQ bra_87A4_начать_цикл
C - - - - - 0x0307B0 18:87A0: CE 35 05  DEC ram_0535
bra_87A3_RTS:
C - - - - - 0x0307B3 18:87A3: 60        RTS
bra_87A4_начать_цикл:
loc_87A4_цикл:
; bzk схожий код в 0x030825, а этот был оптимизирован 23.10.2020
C D - - - - 0x0307B4 18:87A4: A0 00     LDY #$00
C - - - - - 0x0307B6 18:87A6: B1 7B     LDA (ram_007B),Y
C - - - - - 0x0307B8 18:87A8: C9 F0     CMP #$FF
C - - - - - 0x0307BA 18:87AA: 90 0B     BNE bra_87B7_читать_байты
                                        INY
                                        LDA (ram_007B),Y
                                        TAX
                                        INY
                                        LDA (ram_007B),Y
                                        STA ram_007C
                                        STX ram_007B
                                        JMP loc_87A4_цикл
bra_87B7_читать_байты:
C - - - - - 0x0307C7 18:87B7: 8D 35 05  STA ram_0535
C - - - - - 0x0307CA 18:87BA: C8        INY
C - - - - - 0x0307CB 18:87BB: B1 7B     LDA (ram_007B),Y
C - - - - - 0x0307CD 18:87BD: 8D 90 04  STA ram_chr_bank
C - - - - - 0x0307D0 18:87C0: C8        INY
C - - - - - 0x0307D1 18:87C1: B1 7B     LDA (ram_007B),Y
C - - - - - 0x0307D3 18:87C3: 8D 91 04  STA ram_chr_bank + 1
C - - - - - 0x0307D6 18:87C6: C8        INY
C - - - - - 0x0307D7 18:87C7: 98        TYA
C - - - - - 0x0307D8 18:87C8: 18        CLC
C - - - - - 0x0307D9 18:87C9: 65 7B     ADC ram_007B
C - - - - - 0x0307DB 18:87CB: 85 7B     STA ram_007B
C - - - - - 0x0307DD 18:87CD: 90 02     BCC bra_87D1_RTS    ; if not overflow
; if overflow
- - - - - - 0x0307DF 18:87CF: E6 7C     INC ram_007C
bra_87D1_RTS:
C - - - - - 0x0307E1 18:87D1: 60        RTS



sub_0x0307F6:
C D - - - - 0x0307F6 18:87E6: AD 36 05  LDA ram_0536
C - - - - - 0x0307F9 18:87E9: F0 26     BEQ bra_8811
C - - - - - 0x0307FB 18:87EB: 10 1B     BPL bra_8808
C - - - - - 0x0307FD 18:87ED: 29 7F     AND #$7F
C - - - - - 0x0307FF 18:87EF: 8D 36 05  STA ram_0536
C - - - - - 0x030802 18:87F2: F0 1D     BEQ bra_8811
C - - - - - 0x030804 18:87F4: 38        SEC
C - - - - - 0x030805 18:87F5: E9 01     SBC #$01
C - - - - - 0x030807 18:87F7: 0A        ASL
C - - - - - 0x030808 18:87F8: AA        TAX
C - - - - - 0x030809 18:87F9: BD 54 AD  LDA tbl_AD54,X
C - - - - - 0x03080C 18:87FC: 85 7D     STA ram_007D
C - - - - - 0x03080E 18:87FE: BD 55 AD  LDA tbl_AD54 + 1,X
C - - - - - 0x030811 18:8801: 85 7E     STA ram_007E
C - - - - - 0x030813 18:8803: A9 00     LDA #$00
C - - - - - 0x030815 18:8805: 8D 37 05  STA ram_0537
bra_8808:
C - - - - - 0x030818 18:8808: AD 37 05  LDA ram_0537
C - - - - - 0x03081B 18:880B: F0 08     BEQ bra_8815
C - - - - - 0x03081D 18:880D: CE 37 05  DEC ram_0537
C - - - - - 0x030820 18:8810: 60        RTS
bra_8811:
C - - - - - 0x030821 18:8811: 8D 38 05  STA ram_0538
C - - - - - 0x030824 18:8814: 60        RTS
bra_8815:
loc_8815:
; bzk схожий код в 0x0307B6
C D - - - - 0x030825 18:8815: A0 00     LDY #$00
bra_8817_loop:
C - - - - - 0x030827 18:8817: B1 7D     LDA (ram_007D),Y
C - - - - - 0x030829 18:8819: C9 F0     CMP #$F0
C - - - - - 0x03082B 18:881B: 90 0B     BCC bra_8828_меньше_F0
C - - - - - 0x03082D 18:881D: C9 F0     CMP #$F0
; bzk есть несколько байтов с выходом, но ни один не был считан
C - - - - - 0x03082F 18:881F: F0 1C     BEQ bra_883D_F0_закончить
C - - - - - 0x030831 18:8821: C9 F1     CMP #$F1
C - - - - - 0x030833 18:8823: F0 1E     BEQ bra_8843_F1_прыжок
; bzk в таблице всего 1 байт FE в этом диапазоне
; хоть байт был считан, код почему-то не использовался
- - - - - - 0x030835 18:8825: C8        INY       ; если F2-FF
- - - - - - 0x030836 18:8826: D0 EF     BNE bra_8817_loop
bra_8828_меньше_F0:
C - - - - - 0x030838 18:8828: 8D 37 05  STA ram_0537
C - - - - - 0x03083B 18:882B: C8        INY
C - - - - - 0x03083C 18:882C: B1 7D     LDA (ram_007D),Y
C - - - - - 0x03083E 18:882E: 8D 38 05  STA ram_0538
C - - - - - 0x030841 18:8831: C8        INY
C - - - - - 0x030842 18:8832: 98        TYA
C - - - - - 0x030843 18:8833: 18        CLC
C - - - - - 0x030844 18:8834: 65 7D     ADC ram_007D
C - - - - - 0x030846 18:8836: 85 7D     STA ram_007D
C - - - - - 0x030848 18:8838: 90 02     BCC bra_883C_RTS    ; if not overflow
; if overflow
- - - - - - 0x03084A 18:883A: E6 7E     INC ram_007E
bra_883C_RTS:
C - - - - - 0x03084C 18:883C: 60        RTS
bra_883D_F0_закончить:
- - - - - - 0x03084D 18:883D: A9 00     LDA #$00
- - - - - - 0x03084F 18:883F: 8D 36 05  STA ram_0536
- - - - - - 0x030852 18:8842: 60        RTS
bra_8843_F1_прыжок:
C - - - - - 0x030853 18:8843: C8        INY
C - - - - - 0x030854 18:8844: B1 7D     LDA (ram_007D),Y
C - - - - - 0x030856 18:8846: AA        TAX
C - - - - - 0x030857 18:8847: C8        INY
C - - - - - 0x030858 18:8848: B1 7D     LDA (ram_007D),Y
C - - - - - 0x03085A 18:884A: 85 7E     STA ram_007E
C - - - - - 0x03085C 18:884C: 86 7D     STX ram_007D
C - - - - - 0x03085E 18:884E: 4C 15 88  JMP loc_8815



sub_0x030861_отрисовка_меню_во_время_матча:
C - - - - - 0x030862 18:8852: 0A        ASL
C - - - - - 0x030863 18:8853: AA        TAX
C - - - - - 0x030864 18:8854: BD CF B3  LDA tbl_B3CF_вид_меню,X
C - - - - - 0x030867 18:8857: 85 50     STA ram_0050
C - - - - - 0x030869 18:8859: BD D0 B3  LDA tbl_B3CF_вид_меню + 1,X
C - - - - - 0x03086C 18:885C: 85 51     STA ram_0051
                                        LDY #$00
                                        LDA (ram_0050),Y
C - - - - - 0x03088C 18:887C: 8D C6 05  STA ram_номер_рамки_окна
                                        INC ram_0050
                                        BNE @пропуск
                                        INC ram_0051
@пропуск:
C - - - - - 0x03088F 18:887F: A9 00     LDA #$00
C - - - - - 0x030891 18:8881: 8D C5 05  STA ram_05C5
bra_8884_ожидание_освобождения_буфера:
C - - - - - 0x030894 18:8884: A9 01     LDA #$01
C - - - - - 0x030896 18:8886: 20 15 C5  JSR sub_0x03CB1F_задержка
C - - - - - 0x030899 18:8889: AD 15 05  LDA ram_0515
C - - - - - 0x03089C 18:888C: D0 F6     BNE bra_8884_ожидание_освобождения_буфера
C - - - - - 0x03089E 18:888E: A9 01     LDA #$01
C - - - - - 0x0308A0 18:8890: 8D 15 05  STA ram_0515
C - - - - - 0x0308A3 18:8893: A0 02     LDY #$02
C - - - - - 0x0308A5 18:8895: B1 50     LDA (ram_0050),Y
C - - - - - 0x0308A7 18:8897: 0A        ASL
C - - - - - 0x0308A8 18:8898: 18        CLC
C - - - - - 0x0308A9 18:8899: 69 06     ADC #$06
C - - - - - 0x0308AB 18:889B: AA        TAX
C - - - - - 0x0308AC 18:889C: A9 00     LDA #$00
bra_889E_loop:
C - - - - - 0x0308AE 18:889E: 9D A5 04  STA ram_04A5,X
C - - - - - 0x0308B1 18:88A1: CA        DEX
C - - - - - 0x0308B2 18:88A2: 10 FA     BPL bra_889E_loop
C - - - - - 0x0308B4 18:88A4: A2 00     LDX #$00
C - - - - - 0x0308B6 18:88A6: 20 B9 88  JSR sub_88B9
C - - - - - 0x0308B9 18:88A9: F0 0D     BEQ bra_88B8_RTS
C - - - - - 0x0308BB 18:88AB: A0 02     LDY #$02
C - - - - - 0x0308BD 18:88AD: B1 50     LDA (ram_0050),Y
C - - - - - 0x0308BF 18:88AF: 18        CLC
C - - - - - 0x0308C0 18:88B0: 69 03     ADC #$03
C - - - - - 0x0308C2 18:88B2: AA        TAX
C - - - - - 0x0308C3 18:88B3: 20 B9 88  JSR sub_88B9
C - - - - - 0x0308C6 18:88B6: D0 CC     BNE bra_8884_ожидание_освобождения_буфера
bra_88B8_RTS:
C - - - - - 0x0308C8 18:88B8: 60        RTS



sub_88B9:
C - - - - - 0x0308C9 18:88B9: A9 FF     LDA #$FF
C - - - - - 0x0308CB 18:88BB: 85 45     STA ram_0045
C - - - - - 0x0308CD 18:88BD: A0 02     LDY #$02
C - - - - - 0x0308CF 18:88BF: B1 50     LDA (ram_0050),Y
C - - - - - 0x0308D1 18:88C1: 9D A5 04  STA ram_04A5,X
C - - - - - 0x0308D4 18:88C4: A9 00     LDA #$00
C - - - - - 0x0308D6 18:88C6: 85 3A     STA ram_003A
C - - - - - 0x0308D8 18:88C8: AD C5 05  LDA ram_05C5
C - - - - - 0x0308DB 18:88CB: 4A        LSR
C - - - - - 0x0308DC 18:88CC: 66 3A     ROR ram_003A
C - - - - - 0x0308DE 18:88CE: 4A        LSR
C - - - - - 0x0308DF 18:88CF: 66 3A     ROR ram_003A
C - - - - - 0x0308E1 18:88D1: 4A        LSR
C - - - - - 0x0308E2 18:88D2: 66 3A     ROR ram_003A
C - - - - - 0x0308E4 18:88D4: 85 3B     STA ram_003B
C - - - - - 0x0308E6 18:88D6: A0 00     LDY #$00
C - - - - - 0x0308E8 18:88D8: B1 50     LDA (ram_0050),Y
C - - - - - 0x0308EA 18:88DA: 18        CLC
C - - - - - 0x0308EB 18:88DB: 65 3A     ADC ram_003A
C - - - - - 0x0308ED 18:88DD: 9D A6 04  STA ram_04A6,X
C - - - - - 0x0308F0 18:88E0: C8        INY
C - - - - - 0x0308F1 18:88E1: B1 50     LDA (ram_0050),Y
C - - - - - 0x0308F3 18:88E3: 65 3B     ADC ram_003B
C - - - - - 0x0308F5 18:88E5: 9D A7 04  STA ram_04A7,X
C - - - - - 0x0308F8 18:88E8: C9 22     CMP #$22
C - - - - - 0x0308FA 18:88EA: B0 0D     BCS bra_88F9
C - - - - - 0x0308FC 18:88EC: AD CE 05  LDA ram_05CE
C - - - - - 0x0308FF 18:88EF: 4A        LSR
C - - - - - 0x030900 18:88F0: 4A        LSR
C - - - - - 0x030901 18:88F1: 4A        LSR
C - - - - - 0x030902 18:88F2: 4A        LSR
C - - - - - 0x030903 18:88F3: 1D A7 04  ORA ram_04A7,X
C - - - - - 0x030906 18:88F6: 9D A7 04  STA ram_04A7,X
bra_88F9:
C - - - - - 0x030909 18:88F9: 86 3A     STX ram_003A
C - - - - - 0x03090B 18:88FB: A2 00     LDX #$00
C - - - - - 0x03090D 18:88FD: A0 05     LDY #$05
C - - - - - 0x03090F 18:88FF: B1 50     LDA (ram_0050),Y
C - - - - - 0x030911 18:8901: CD C5 05  CMP ram_05C5
C - - - - - 0x030914 18:8904: F0 12     BEQ bra_8918
C - - - - - 0x030916 18:8906: B0 41     BCS bra_8949
C - - - - - 0x030918 18:8908: A0 07     LDY #$07
C - - - - - 0x03091A 18:890A: 18        CLC
C - - - - - 0x03091B 18:890B: 71 50     ADC (ram_0050),Y
C - - - - - 0x03091D 18:890D: A2 06     LDX #$06
C - - - - - 0x03091F 18:890F: CD C5 05  CMP ram_05C5
C - - - - - 0x030922 18:8912: F0 04     BEQ bra_8918
C - - - - - 0x030924 18:8914: 90 33     BCC bra_8949
C - - - - - 0x030926 18:8916: A2 03     LDX #$03
bra_8918:
C - - - - - 0x030928 18:8918: A0 06     LDY #$06
C - - - - - 0x03092A 18:891A: B1 50     LDA (ram_0050),Y
C - - - - - 0x03092C 18:891C: 38        SEC
C - - - - - 0x03092D 18:891D: E9 02     SBC #$02
C - - - - - 0x03092F 18:891F: 85 3B     STA ram_003B
C - - - - - 0x030931 18:8921: A5 3A     LDA ram_003A
C - - - - - 0x030933 18:8923: A0 04     LDY #$04
C - - - - - 0x030935 18:8925: 18        CLC
C - - - - - 0x030936 18:8926: 71 50     ADC (ram_0050),Y
C - - - - - 0x030938 18:8928: A8        TAY
C - - - - - 0x030939 18:8929: 86 45     STX ram_0045
C - - - - - 0x03093B 18:892B: 8A        TXA
C - - - - - 0x03093C 18:892C: 18        CLC
C - - - - - 0x03093D 18:892D: 6D C6 05  ADC ram_номер_рамки_окна
C - - - - - 0x030940 18:8930: AA        TAX
C - - - - - 0x030941 18:8931: BD 9E 8D  LDA tbl_8D9E_тайлы_окон_меню,X
C - - - - - 0x030944 18:8934: 99 A8 04  STA ram_04A8,Y
C - - - - - 0x030947 18:8937: BD 9F 8D  LDA tbl_8D9E_тайлы_окон_меню + 1,X
C - - - - - 0x03094A 18:893A: C8        INY
bra_893B_loop:
C - - - - - 0x03094B 18:893B: 99 A8 04  STA ram_04A8,Y
C - - - - - 0x03094E 18:893E: C8        INY
C - - - - - 0x03094F 18:893F: C6 3B     DEC ram_003B
C - - - - - 0x030951 18:8941: D0 F8     BNE bra_893B_loop
C - - - - - 0x030953 18:8943: BD A0 8D  LDA tbl_8D9E_тайлы_окон_меню + 2,X
C - - - - - 0x030956 18:8946: 99 A8 04  STA ram_04A8,Y
bra_8949:
C - - - - - 0x030959 18:8949: A0 08     LDY #$08
C - - - - - 0x03095B 18:894B: B1 50     LDA (ram_0050),Y
C - - - - - 0x03095D 18:894D: F0 27     BEQ bra_8976
C - - - - - 0x03095F 18:894F: 85 3B     STA ram_003B
C - - - - - 0x030961 18:8951: C8        INY
bra_8952_loop:
C - - - - - 0x030962 18:8952: A9 00     LDA #$00
C - - - - - 0x030964 18:8954: 85 3C     STA ram_003C
C - - - - - 0x030966 18:8956: B1 50     LDA (ram_0050),Y
C - - - - - 0x030968 18:8958: CD C5 05  CMP ram_05C5
C - - - - - 0x03096B 18:895B: F0 0A     BEQ bra_8967
C - - - - - 0x03096D 18:895D: 38        SEC
C - - - - - 0x03096E 18:895E: E9 01     SBC #$01
C - - - - - 0x030970 18:8960: E6 3C     INC ram_003C
C - - - - - 0x030972 18:8962: CD C5 05  CMP ram_05C5
C - - - - - 0x030975 18:8965: D0 07     BNE bra_896E
bra_8967:
C - - - - - 0x030977 18:8967: 84 48     STY ram_0048
C - - - - - 0x030979 18:8969: 20 86 89  JSR sub_8986_чтение_байтов_меню
C - - - - - 0x03097C 18:896C: A4 48     LDY ram_0048
bra_896E:
C - - - - - 0x03097E 18:896E: C8        INY
C - - - - - 0x03097F 18:896F: C8        INY
C - - - - - 0x030980 18:8970: C8        INY
C - - - - - 0x030981 18:8971: C8        INY
C - - - - - 0x030982 18:8972: C6 3B     DEC ram_003B
C - - - - - 0x030984 18:8974: D0 DC     BNE bra_8952_loop
bra_8976:
C - - - - - 0x030986 18:8976: A9 80     LDA #$80
C - - - - - 0x030988 18:8978: 8D 15 05  STA ram_0515
C - - - - - 0x03098B 18:897B: AD C5 05  LDA ram_05C5
C - - - - - 0x03098E 18:897E: EE C5 05  INC ram_05C5
C - - - - - 0x030991 18:8981: A0 03     LDY #$03
C - - - - - 0x030993 18:8983: D1 50     CMP (ram_0050),Y
C - - - - - 0x030995 18:8985: 60        RTS



sub_8986_чтение_байтов_меню:
C - - - - - 0x030996 18:8986: C8        INY
C - - - - - 0x030997 18:8987: B1 50     LDA (ram_0050),Y
C - - - - - 0x030999 18:8989: 18        CLC
C - - - - - 0x03099A 18:898A: 65 3A     ADC ram_003A
C - - - - - 0x03099C 18:898C: 85 3D     STA ram_003D
C - - - - - 0x03099E 18:898E: C8        INY
C - - - - - 0x03099F 18:898F: B1 50     LDA (ram_0050),Y
C - - - - - 0x0309A1 18:8991: 85 3E     STA ram_003E
C - - - - - 0x0309A3 18:8993: C8        INY
C - - - - - 0x0309A4 18:8994: B1 50     LDA (ram_0050),Y
C - - - - - 0x0309A6 18:8996: 85 3F     STA ram_003F
C - - - - - 0x0309A8 18:8998: A9 00     LDA #$00
C - - - - - 0x0309AA 18:899A: 85 40     STA ram_0040
loc_899C_цикл:
bra_899C_loop:
C D - - - - 0x0309AC 18:899C: A4 40     LDY ram_0040
C - - - - - 0x0309AE 18:899E: E6 40     INC ram_0040
C - - - - - 0x0309B0 18:89A0: B1 3E     LDA (ram_003E),Y
C - - - - - 0x0309B2 18:89A2: C9 E0     CMP #$E0
C - - - - - 0x0309B4 18:89A4: 90 06     BCC bra_89AC_меньше_E0
C - - - - - 0x0309B6 18:89A6: 20 B4 89  JSR sub_89B4_управляющие_байты_меню
C - - - - - 0x0309B9 18:89A9: 4C 9C 89  JMP loc_899C_цикл
bra_89AC_меньше_E0:
C - - - - - 0x0309BF 18:89AF: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x0309C2 18:89B2: D0 E8     BNE bra_899C_loop   ; jmp



sub_89B4_управляющие_байты_меню:
    SEC
    SBC #$E0
    JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
    .word ofs_036_89FA_E0_имя_игрока_и_позиция
    .word ofs_036_8A00_E1_статы_игрока
    .word ofs_036_8A06_E2_имя_принимающего_и_позиция
    .word ofs_036_8A0C_E3_статы_принимающего
    .word ofs_036_8A12_E4_список_спешалов
    .word ofs_036_8A86_E5_действия_нескольких_защитников
    .word ofs_036_8A93_E6
    .word ofs_036_8AAF_E7_имя_защитника_и_позиция
    .word ofs_036_8AB8_E8_статы_защитника
    .word ofs_036_8AC1_E9_принимающий_напарник
    .word ofs_036_8AC1_EA_принимающий_соперник
    .word ofs_036_8AD7_EB_имя_кипера_и_позиция
    .word ofs_036_8ADF_EC_статы_кипера
    .word ofs_036_8AE7_ED_сокращение_имени_команды
    .word ofs_036_8B2F_EE_счет_игры
    .word ofs_036_8B48_EF_номер_тайма
    .word ofs_036_8B8B_F0_время_тайма
    .word ofs_036_8BD5_F1_имена_из_меню
    .word ofs_036_8BDE_F2_имя_управляемого_игрока
    .word ofs_036_8BE4_F3_имя_напавшего_защитника
    .word ofs_036_8BEA_F4_имя_игрока_с_мячом
    .word ofs_036_8BF0_F5
    .word ofs_036_8C04_F6_список_игроков_в_пенальти
    .word ofs_036_8C47_F7_номер_управляемого
    .word ofs_036_8C44_F8_стрелочка_высоты_мяча
    .word ofs_036_8C45_F9_индикатор_если_соперник_не_клон
    .word $0000       ; unused
    .word $0000       ; unused
    .word ofs_036_8C52_FC_закончить



ofs_036_89FA_E0_имя_игрока_и_позиция:
C - J - - - 0x030A0A 18:89FA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x030A0D 18:89FD: 4C DC 8C  JMP loc_8CDC_вывести_имя_игрока_и_позицию



ofs_036_8A00_E1_статы_игрока:
C - J - - - 0x030A10 18:8A00: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x030A13 18:8A03: 4C A5 8C  JMP loc_8CA5_запись_энергии_и_статов



ofs_036_8A06_E2_имя_принимающего_и_позиция:
C - J - - - 0x030A16 18:8A06: AD FC 05  LDA ram_принимающий
C - - - - - 0x030A19 18:8A09: 4C DC 8C  JMP loc_8CDC_вывести_имя_игрока_и_позицию



ofs_036_8A0C_E3_статы_принимающего:
C - J - - - 0x030A1C 18:8A0C: AD FC 05  LDA ram_принимающий
C - - - - - 0x030A1F 18:8A0F: 4C A5 8C  JMP loc_8CA5_запись_энергии_и_статов



ofs_036_8A12_E4_список_спешалов:
C - J - - - 0x030A22 18:8A12: AD 3B 04  LDA ram_действие_атаки
C - - - - - 0x030A25 18:8A15: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - - 0x030A28 18:8A18: 20 8A     .word ofs_037_8A20_00
- D - I - - 0x030A2A 18:8A1A: 34 8A     .word ofs_037_8A34_01
- D - I - - 0x030A2C 18:8A1C: 39 8A     .word ofs_037_8A39_02
- D - I - - 0x030A2E 18:8A1E: 3E 8A     .word ofs_037_8A3E_03



ofs_037_8A20_00:
C - J - - - 0x030A30 18:8A20: A4 40     LDY ram_0040
C - - - - - 0x030A32 18:8A22: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030A34 18:8A24: D0 09     BNE bra_8A2F
C - - - - - 0x030A36 18:8A26: AD 4E 04  LDA ram_высота_мяча
C - - - - - 0x030A39 18:8A29: 18        CLC
C - - - - - 0x030A3A 18:8A2A: 69 9A     ADC #$9A
C - - - - - 0x030A3C 18:8A2C: 4C 56 8A  JMP loc_8A56
bra_8A2F:
C - - - - - 0x030A3F 18:8A2F: A9 9A     LDA #$9A      ; shoot <シュート>
C - - - - - 0x030A41 18:8A31: 4C 43 8A  JMP loc_8A43_запись_слова_в_буфер



ofs_037_8A34_01:
; bzk опт, заменить на BNE, удалить последний прыжок в 03
C - J - - - 0x030A44 18:8A34: A9 C4     LDA #$C4      ; pass <パス>
C - - - - - 0x030A46 18:8A36: 4C 43 8A  JMP loc_8A43_запись_слова_в_буфер



ofs_037_8A39_02:
C - J - - - 0x030A49 18:8A39: A9 BD     LDA #$BD      ; dribble <ドリブル>
C - - - - - 0x030A4B 18:8A3B: 4C 43 8A  JMP loc_8A43_запись_слова_в_буфер



ofs_037_8A3E_03:
C - J - - - 0x030A4E 18:8A3E: A9 C8     LDA #$C8      ; 1-2 pass <ワンツーリターン>
C - - - - - 0x030A50 18:8A40: 4C 43 8A  JMP loc_8A43_запись_слова_в_буфер



loc_8A43_запись_слова_в_буфер:
C D - - - - 0x030A53 18:8A43: AA        TAX
C - - - - - 0x030A54 18:8A44: A4 40     LDY ram_0040
C - - - - - 0x030A56 18:8A46: E6 40     INC ram_0040
C - - - - - 0x030A58 18:8A48: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030A5A 18:8A4A: F0 09     BEQ bra_8A55
C - - - - - 0x030A5C 18:8A4C: A8        TAY
C - - - - - 0x030A5D 18:8A4D: 8A        TXA
C - - - - - 0x030A5E 18:8A4E: 18        CLC
C - - - - - 0x030A5F 18:8A4F: 79 30 04  ADC ram_список_спешалов,Y
C - - - - - 0x030A62 18:8A52: 4C 56 8A  JMP loc_8A56
bra_8A55:
C - - - - - 0x030A65 18:8A55: 8A        TXA
loc_8A56:
C D - - - - 0x030A66 18:8A56: 85 47     STA ram_0047
C - - - - - 0x030A68 18:8A58: 20 3C C5  JSR sub_0x03F31F_таблица_слов
C - - - - - 0x030A6B 18:8A5B: A5 47     LDA ram_0047
C - - - - - 0x030A6D 18:8A5D: A0 09     LDY #$09
; bzk по моим заметкам русского перевода, здесь проверка на удар мисаки для ограничения символов названия
C - - - - - 0x030A6F 18:8A5F: C9 AA     CMP #$AA
C - - - - - 0x030A71 18:8A61: F0 0B     BEQ bra_8A6E_длина_слова_вычислена
C - - - - - 0x030A73 18:8A63: A0 00     LDY #$00
bra_8A65_loop_вычисления_длины_слова:
C - - - - - 0x030A75 18:8A65: B1 30     LDA (ram_0030),Y
C - - - - - 0x030A77 18:8A67: C9 FC     CMP #$FC
C - - - - - 0x030A79 18:8A69: F0 03     BEQ bra_8A6E_длина_слова_вычислена
C - - - - - 0x030A7B 18:8A6B: C8        INY
C - - - - - 0x030A7C 18:8A6C: D0 F7     BNE bra_8A65_loop_вычисления_длины_слова
bra_8A6E_длина_слова_вычислена:
C - - - - - 0x030A7E 18:8A6E: 98        TYA
loc_8A6F_вывести_3_буквы_имени_команды:
loc_8A6F_вывести_стрелочку_высоты_мяча:
C D - - - - 0x030A7F 18:8A6F: 85 49     STA ram_0049        ; количество символов
C - - - - - 0x030A81 18:8A71: A9 00     LDA #$00
C - - - - - 0x030A83 18:8A73: 85 46     STA ram_0046
bra_8A75_loop:
C - - - - - 0x030A85 18:8A75: A4 46     LDY ram_0046
C - - - - - 0x030A87 18:8A77: B1 30     LDA (ram_0030),Y
C - - - - - 0x030A8C 18:8A7C: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030A8F 18:8A7F: E6 46     INC ram_0046
C - - - - - 0x030A91 18:8A81: C6 49     DEC ram_0049
C - - - - - 0x030A93 18:8A83: D0 F0     BNE bra_8A75_loop
C - - - - - 0x030A95 18:8A85: 60        RTS



ofs_036_8A86_E5_действия_нескольких_защитников:
C - J - - - 0x030A96 18:8A86: A4 40     LDY ram_0040
C - - - - - 0x030A98 18:8A88: E6 40     INC ram_0040
C - - - - - 0x030A9A 18:8A8A: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030A9C 18:8A8C: AA        TAX
C - - - - - 0x030A9D 18:8A8D: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x030AA0 18:8A90: 4C 1A 8D  JMP loc_8D1A_вывести_имя



ofs_036_8A93_E6:
C - J - - - 0x030AA3 18:8A93: A4 40     LDY ram_0040
C - - - - - 0x030AA5 18:8A95: E6 40     INC ram_0040
C - - - - - 0x030AA7 18:8A97: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030AA9 18:8A99: F0 04     BEQ bra_8A9F_это_не_спешал
C - - - - - 0x030AAB 18:8A9B: AA        TAX
C - - - - - 0x030AAC 18:8A9C: BD 30 04  LDA ram_список_спешалов,X
bra_8A9F_это_не_спешал:
C - - - - - 0x030AAF 18:8A9F: AE 1E 06  LDX ram_061E
C - - - - - 0x030AB2 18:8AA2: BC 0B 06  LDY ram_действие_защитника,X
C - - - - - 0x030AB5 18:8AA5: 18        CLC
C - - - - - 0x030AB6 18:8AA6: 79 AC 8A  ADC tbl_8AAC_спешал_защиты,Y
C - - - - - 0x030AB9 18:8AA9: 4C 6C 8D  JMP loc_8D6C_вывести_слово

tbl_8AAC_спешал_защиты:
    .byte $CD       ; block <ブロック>
    .byte $D1       ; tackle <タックル>
    .byte $D7       ; passcut <パスカット>



ofs_036_8AAF_E7_имя_защитника_и_позиция:
C - J - - - 0x030ABF 18:8AAF: AE 1E 06  LDX ram_061E
C - - - - - 0x030AC2 18:8AB2: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x030AC5 18:8AB5: 4C DC 8C  JMP loc_8CDC_вывести_имя_игрока_и_позицию



ofs_036_8AB8_E8_статы_защитника:
C - J - - - 0x030AC8 18:8AB8: AE 1E 06  LDX ram_061E
C - - - - - 0x030ACB 18:8ABB: BD 01 06  LDA ram_номер_защитника,X
C - - - - - 0x030ACE 18:8ABE: 4C A5 8C  JMP loc_8CA5_запись_энергии_и_статов



ofs_036_8AC1_E9_принимающий_напарник:
ofs_036_8AC1_EA_принимающий_соперник:
C - J - - - 0x030AD1 18:8AC1: A4 40     LDY ram_0040
C - - - - - 0x030AD3 18:8AC3: E6 40     INC ram_0040
C - - - - - 0x030AD5 18:8AC5: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030AD7 18:8AC7: AA        TAX
C - - - - - 0x030AD8 18:8AC8: BD 31 04  LDA ram_список_спешалов + 1,X
C - - - - - 0x030ADB 18:8ACB: E8        INX
C - - - - - 0x030ADC 18:8ACC: EC 30 04  CPX ram_список_спешалов
C - - - - - 0x030ADF 18:8ACF: 90 03     BCC bra_8AD4
C - - - - - 0x030AE1 18:8AD1: F0 01     BEQ bra_8AD4
C - - - - - 0x030AE3 18:8AD3: 60        RTS
bra_8AD4:
C - - - - - 0x030AE4 18:8AD4: 4C 1A 8D  JMP loc_8D1A_вывести_имя



ofs_036_8AD7_EB_имя_кипера_и_позиция:
C - J - - - 0x030AE7 18:8AD7: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x030AEA 18:8ADA: 49 0B     EOR #$0B
C - - - - - 0x030AEC 18:8ADC: 4C DC 8C  JMP loc_8CDC_вывести_имя_игрока_и_позицию



ofs_036_8ADF_EC_статы_кипера:
C - J - - - 0x030AEF 18:8ADF: AD FB 05  LDA ram_команда_с_мячом
C - - - - - 0x030AF2 18:8AE2: 49 0B     EOR #$0B
C - - - - - 0x030AF4 18:8AE4: 4C A5 8C  JMP loc_8CA5_запись_энергии_и_статов



ofs_036_8AE7_ED_сокращение_имени_команды:
.scope
    LDY ram_0040
    INC ram_0040
    LDX ram_твоя_команда
    LDA (ram_003E),Y
    BEQ @это_твоя_команда
    LDX ram_команда_соперника
@это_твоя_команда:
    TXA
; все слова по 3 буквы, умножение индекса на 3
    STA ram_0031        ; 0031 выступает как временный адрес
    ASL                 ; номер команды не превышает 20, после ASL C = 0
    ADC ram_0031        ; после сложения будет максимум 60, C = 0
    ADC #< tbl_сокращения
    STA ram_0030
    LDA #> tbl_сокращения
    ADC #$00
    STA ram_0031
    LDA #$03
    JMP loc_8A6F_вывести_3_буквы_имени_команды

tbl_сокращения:
    .text "SAO", "NAN", "JPN"
    .text "FLU", "COR", "GRE", "PAL", "SAN", "FLA"
    .text "KUN", "AKI", "TAT", "MUS", "FUR", "TOH"
    .text "ROM", "URU", "HAM", "JPN"
    .text "SYR", "CHN", "IRN", "PRK", "KSA", "KOR", "TUR"
    .text "POL", "ENG", "USR", "FRA"
    .text "MEX", "ITA", "NED", "ARG", "FRG", "BRA"
.endscope



ofs_036_8B2F_EE_счет_игры:
    LDY ram_0040
    INC ram_0040
    LDA (ram_003E),Y
    TAX
    LDY ram_номер_тайма
    CPY #$04
    BEQ @это_пенальти
    LDA ram_голы,X
    CPX #$01
    BNE @вывести_счет       ; это счет команды слева
    CMP #$0A
    BCC @вывести_счет       ; счет не превышает 10 голов
    INC ram_003D            ; сместить указатель записи голов команды справа
@вывести_счет:
    LDX #$00
    JMP loc_8C55_запись_цифер_в_буфер
@это_пенальти:
    LDA ram_пк_голы,X
    LDX #$00
    JMP loc_8C55_запись_цифер_в_буфер



ofs_036_8B48_EF_номер_тайма:
C - J - - - 0x030B58 18:8B48: A9 00     LDA #$00
C - - - - - 0x030B5A 18:8B4A: 85 47     STA ram_0047
bra_8B4C_loop:
C - - - - - 0x030B5C 18:8B4C: AD 27 00  LDA ram_номер_тайма
C - - - - - 0x030B5F 18:8B4F: 0A        ASL
C - - - - - 0x030B60 18:8B50: 0A        ASL
C - - - - - 0x030B61 18:8B51: 6D 27 00  ADC ram_номер_тайма
C - - - - - 0x030B64 18:8B54: 65 47     ADC ram_0047
C - - - - - 0x030B66 18:8B56: AA        TAX
C - - - - - 0x030B67 18:8B57: BD 72 8B  LDA tbl_8B72_текст_периода_матча,X
C - - - - - 0x030B6A 18:8B5A: C9 FF     CMP #$FF
C - - - - - 0x030B6C 18:8B5C: F0 09     BEQ bra_8B67_пропуск_записи
C - - - - - 0x030B71 18:8B61: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030B74 18:8B64: 4C 69 8B  JMP loc_8B69
bra_8B67_пропуск_записи:
C - - - - - 0x030B77 18:8B67: E6 3D     INC ram_003D
loc_8B69:
C D - - - - 0x030B79 18:8B69: E6 47     INC ram_0047
C - - - - - 0x030B7B 18:8B6B: A5 47     LDA ram_0047
C - - - - - 0x030B7D 18:8B6D: C9 05     CMP #$05
C - - - - - 0x030B7F 18:8B6F: D0 DB     BNE bra_8B4C_loop
C - - - - - 0x030B81 18:8B71: 60        RTS



tbl_8B72_текст_периода_матча:
;00
    .byte $FF
    .text "1st"
    .byte $FF
;01
    .byte $FF
    .text "2nd"
    .byte $FF
;02
    .text "E.T.1"
;03
    .text "E.T.2"
;04
    .byte $FF
    .text $90, $91, $92     ; P.K.
    .byte $FF



ofs_036_8B8B_F0_время_тайма:
.scope
; сначала вычисляются минуты тайма, а в конце кода прыжок на секунды
C - J - - - 0x030B9B 18:8B8B: A2 00     LDX #$00
C - - - - - 0x030B9D 18:8B8D: AD F7 05  LDA ram_время_lo
C - - - - - 0x030BA0 18:8B90: AC F8 05  LDY ram_время_hi
@продолжить_вычитание:
C - - - - - 0x030BA3 18:8B93: 38        SEC
C - - - - - 0x030BA4 18:8B94: E9 06     SBC #$06
C - - - - - 0x030BA6 18:8B96: B0 03     BCS @увеличить_счетчик_десяток
C - - - - - 0x030BA8 18:8B98: 88        DEY
C - - - - - 0x030BA9 18:8B99: 30 03     BMI @завершить_вычисление
@увеличить_счетчик_десяток:
C - - - - - 0x030BAB 18:8B9B: E8        INX
C - - - - - 0x030BAC 18:8B9C: D0 F5     BNE @продолжить_вычитание
@завершить_вычисление:
; для корректировки уменьшения на 06, так как в итоге в A получится отрицательное число
C - - - - - 0x030BAE 18:8B9E: 69 06     ADC #$06
C - - - - - 0x030BB0 18:8BA0: 0A        ASL
C - - - - - 0x030BB1 18:8BA1: A8        TAY
C - - - - - 0x030BB2 18:8BA2: 8A        TXA
C - - - - - 0x030BB3 18:8BA3: 48        PHA
C - - - - - 0x030BB4 18:8BA4: B9 C9 8B  LDA tbl_тайл_десятков,Y
C - - - - - 0x030BB7 18:8BA7: 48        PHA
C - - - - - 0x030BB8 18:8BA8: B9 CA 8B  LDA tbl_тайл_единиц,Y
C - - - - - 0x030BBD 18:8BAD: 20 85 8C  JSR sub_8C85_запись_тайла_в_буфер
C - - - - - 0x030BC0 18:8BB0: C6 3D     DEC ram_003D
C - - - - - 0x030BC2 18:8BB2: 68        PLA
C - - - - - 0x030BC5 18:8BB5: 20 85 8C  JSR sub_8C85_запись_тайла_в_буфер
C - - - - - 0x030BC8 18:8BB8: C6 3D     DEC ram_003D
; тайл двоеточия между минутами и секундами
C - - - - - 0x030BCA 18:8BBA: A9 77     LDA #$7D
C - - - - - 0x030BCE 18:8BBE: 20 85 8C  JSR sub_8C85_запись_тайла_в_буфер
C - - - - - 0x030BD1 18:8BC1: C6 3D     DEC ram_003D
C - - - - - 0x030BD3 18:8BC3: 68        PLA
C - - - - - 0x030BD4 18:8BC4: A2 00     LDX #$00
C - - - - - 0x030BD6 18:8BC6: 4C 55 8C  JMP loc_8C55_запись_цифер_в_буфер

tbl_тайл_десятков:
tbl_тайл_единиц = tbl_тайл_десятков + 1
    .text "00"
    .text "10"
    .text "20"
    .text "30"
    .text "40"
    .text "50"
.endscope



ofs_036_8BD5_F1_имена_из_меню:
C - J - - - 0x030BE5 18:8BD5: A4 40     LDY ram_0040
C - - - - - 0x030BE7 18:8BD7: E6 40     INC ram_0040
C - - - - - 0x030BE9 18:8BD9: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030BEB 18:8BDB: 4C 1A 8D  JMP loc_8D1A_вывести_имя



ofs_036_8BDE_F2_имя_управляемого_игрока:
C - J - - - 0x030BEE 18:8BDE: AD FD 05  LDA ram_управляемый
C - - - - - 0x030BF1 18:8BE1: 4C 1A 8D  JMP loc_8D1A_вывести_имя



ofs_036_8BE4_F3_имя_напавшего_защитника:
    LDY ram_0040
    INC ram_0040
    LDA (ram_003E),Y
    TAX
    LDA ram_номер_защитника,X
    JMP loc_8D1A_вывести_имя



ofs_036_8BEA_F4_имя_игрока_с_мячом:
C - J - - - 0x030BFA 18:8BEA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x030BFD 18:8BED: 4C 1A 8D  JMP loc_8D1A_вывести_имя



ofs_036_8BF0_F5:
C - J - - - 0x030C00 18:8BF0: A4 40     LDY ram_0040
C - - - - - 0x030C02 18:8BF2: E6 40     INC ram_0040
C - - - - - 0x030C04 18:8BF4: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030C06 18:8BF6: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030C09 18:8BF9: A0 02     LDY #con_plr_guts_hi
C - - - - - 0x030C0B 18:8BFB: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030C0D 18:8BFD: AA        TAX
C - - - - - 0x030C0E 18:8BFE: 88        DEY
C - - - - - 0x030C0F 18:8BFF: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030C11 18:8C01: 4C 55 8C  JMP loc_8C55_запись_цифер_в_буфер



ofs_036_8C04_F6_список_игроков_в_пенальти:
C - J - - - 0x030C14 18:8C04: AD 41 04  LDA ram_игрок_с_мячом
C - - - - - 0x030C17 18:8C07: 85 49     STA ram_0049
bra_8C09_loop:
C - - - - - 0x030C19 18:8C09: A5 49     LDA ram_0049
C - - - - - 0x030C1B 18:8C0B: C9 0B     CMP #$0B
C - - - - - 0x030C1D 18:8C0D: F0 37     BEQ bra_8C46_RTS
C - - - - - 0x030C1F 18:8C0F: AE 30 04  LDX ram_список_спешалов
C - - - - - 0x030C22 18:8C12: F0 0E     BEQ bra_8C22
bra_8C14_loop:
C - - - - - 0x030C24 18:8C14: DD 30 04  CMP ram_список_спешалов,X
C - - - - - 0x030C27 18:8C17: F0 05     BEQ bra_8C1E
C - - - - - 0x030C29 18:8C19: CA        DEX
C - - - - - 0x030C2A 18:8C1A: D0 F8     BNE bra_8C14_loop
; !!! флаг D, проверить бряком на чтение
C D - - - - 0x030C2C 18:8C1C: F0 04     BEQ bra_8C22
bra_8C1E:
C D - - - - 0x030C2E 18:8C1E: E6 49     INC ram_0049
C D - - - - 0x030C30 18:8C20: D0 E7     BNE bra_8C09_loop
bra_8C22:
C - - - - - 0x030C32 18:8C22: E6 49     INC ram_0049
C - - - - - 0x030C34 18:8C24: 20 1A 8D  JSR sub_8D1A_вывести_имя
C - - - - - 0x030C37 18:8C27: A4 3C     LDY ram_003C
C - - - - - 0x030C39 18:8C29: 88        DEY
C - - - - - 0x030C3A 18:8C2A: F0 1A     BEQ bra_8C46_RTS
C - - - - - 0x030C3C 18:8C2C: A9 17     LDA #$0B      ; смещение ppu для цифры скилла удара
C - - - - - 0x030C3E 18:8C2E: 85 3D     STA ram_003D
C - - - - - 0x030C40 18:8C30: A5 49     LDA ram_0049
C - - - - - 0x030C42 18:8C32: 38        SEC
C - - - - - 0x030C43 18:8C33: E9 01     SBC #$01
C - - - - - 0x030C45 18:8C35: A2 01     LDX #$01
C - - - - - 0x030C47 18:8C37: 20 27 C5  JSR sub_0x03CE18_банксвич_PRG_1C_1D_с_возвратом
C - - - - - 0x030C4A 18:8C3A: A5 32     LDA ram_0032
C - - - - - 0x030C4C 18:8C3C: A6 33     LDX ram_0033
C - - - - - 0x030C4E 18:8C3E: 20 55 8C  JSR sub_8C55_запись_цифер_в_буфер
C - - - - - 0x030C51 18:8C41: A5 49     LDA ram_0049
C - - - - - 0x030C53 18:8C43: 8D 41 04  STA ram_игрок_с_мячом
bra_8C46_RTS:
C - - - - - 0x030C56 18:8C46: 60        RTS



ofs_036_8C47_F7_номер_управляемого:
C - J - - - 0x030C57 18:8C47: AD FD 05  LDA ram_управляемый
C - - - - - 0x030C5A 18:8C4A: 18        CLC
C - - - - - 0x030C5B 18:8C4B: 69 01     ADC #$01
C - - - - - 0x030C5D 18:8C4D: A2 00     LDX #$00
C - - - - - 0x030C5F 18:8C4F: 4C 55 8C  JMP loc_8C55_запись_цифер_в_буфер



ofs_036_8C44_F8_стрелочка_высоты_мяча:
    LDA ram_сценарий
    CMP #$32    ; экран действия кипера словить/отбить (там где рожа кипера)
    BEQ @выход
    LDA ram_высота_мяча
    BEQ @выход
    ASL      ; умножение на 3
    ADC ram_высота_мяча
    ADC #< tbl_8C45_стрелочка
    STA ram_0030
    LDA #> tbl_8C45_стрелочка
    ADC #$00
    STA ram_0031
    LDA #$03
    JMP loc_8A6F_вывести_стрелочку_высоты_мяча
@выход:
    RTS
    
tbl_8C45_стрелочка:
    .byte $A9, $A9, $A9     ; unused
    .byte $20, $94, $20     ; down
    .byte $20, $95, $20     ; up



ofs_036_8C45_F9_индикатор_если_соперник_не_клон:
.scope
    LDY ram_0040
    INC ram_0040
    LDA (ram_003E),Y
    BMI @это_индикатор_защитника
    JSR sub_узнать_индекс_принимающего
    BCS @требуется_вывести_тайл_если_не_клон
    RTS
@это_индикатор_защитника:
    AND #$7F
    TAX
    LDA ram_номер_защитника,X
@требуется_вывести_тайл_если_не_клон:
    JSR sub_0x03CD8C_получить_адрес_игрока
    LDY #con_plr_id
    LDA (ram_plr_data),Y
    BEQ @это_клон
    LDA #$3F        ; тайл *
    JMP loc_8C85_запись_тайла_в_буфер
@это_клон:
    RTS



sub_узнать_индекс_принимающего:
    TAX
    LDA ram_список_спешалов + 1,X
    INX
    CPX ram_список_спешалов
    BCC @принимающий_существует
    BEQ @принимающий_существует
    CLC
    RTS
@принимающий_существует:
    SEC
    RTS
.endscope



ofs_036_8C52_FC_закончить:
C - J - - - 0x030C62 18:8C52: 68        PLA
C - - - - - 0x030C63 18:8C53: 68        PLA
C - - - - - 0x030C64 18:8C54: 60        RTS



loc_8C55_запись_цифер_в_буфер:
sub_8C55_запись_цифер_в_буфер:
C D - - - - 0x030C65 18:8C55: A4 3C     LDY ram_003C
C - - - - - 0x030C67 18:8C57: 88        DEY
C - - - - - 0x030C68 18:8C58: F0 2A     BEQ bra_8C84_RTS
C - - - - - 0x030C6A 18:8C5A: 85 6F     STA ram_006F
C - - - - - 0x030C6C 18:8C5C: 86 70     STX ram_0070
C - - - - - 0x030C6E 18:8C5E: A9 0A     LDA #$0A
C - - - - - 0x030C70 18:8C60: 85 71     STA ram_0071
C - - - - - 0x030C72 18:8C62: A9 00     LDA #$00
C - - - - - 0x030C74 18:8C64: 85 74     STA ram_0074
bra_8C66_loop:
C - - - - - 0x030C76 18:8C66: 20 1E C5  JSR sub_0x03CD4C_получить_младший_разряд_числа
C - - - - - 0x030C79 18:8C69: A5 72     LDA ram_0072
C - - - - - 0x030C7B 18:8C6B: 20 7A 8C  JSR sub_8C7A_запись_числа_в_буфер
C - - - - - 0x030C7E 18:8C6E: A5 70     LDA ram_0070
C - - - - - 0x030C80 18:8C70: D0 F4     BNE bra_8C66_loop
C - - - - - 0x030C82 18:8C72: A5 6F     LDA ram_006F
C - - - - - 0x030C84 18:8C74: F0 0E     BEQ bra_8C84_RTS
C - - - - - 0x030C86 18:8C76: C9 0A     CMP #$0A
C - - - - - 0x030C88 18:8C78: B0 EC     BCS bra_8C66_loop
sub_8C7A_запись_числа_в_буфер:
C - - - - - 0x030C8A 18:8C7A: 18        CLC
C - - - - - 0x030C8B 18:8C7B: 69 33     ADC #$30      ; корректировка номера тайла
C - - - - - 0x030C8D 18:8C7D: A0 00     LDY #$00
C - - - - - 0x030C8F 18:8C7F: 20 85 8C  JSR sub_8C85_запись_тайла_в_буфер
C - - - - - 0x030C92 18:8C82: C6 3D     DEC ram_003D
bra_8C84_RTS:
C - - - - - 0x030C94 18:8C84: 60        RTS



loc_8C85_запись_тайла_в_буфер:
sub_8C85_запись_тайла_в_буфер:
; на вход подается тайл в A
; тут была проверка на Y, который является дополнительным японским тайлом над символом (94 или 95)
C - - - - - 0x030C95 18:8C85: A6 3D     LDX ram_003D
C - - - - - 0x030C97 18:8C87: C6 3C     DEC ram_003C
C - - - - - 0x030C99 18:8C89: D0 0E     BEQ bra_8C9C_пропуск_записи
C - - - - - 0x030CA9 18:8C99: 9D A8 04  STA ram_04A8,X
bra_8C9C_пропуск_записи:
C - - - - - 0x030CAC 18:8C9C: E6 3C     INC ram_003C
C - - - - - 0x030CAE 18:8C9E: 60        RTS



sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс:
C - - - - - 0x030CAF 18:8C9F: 20 85 8C  JSR sub_8C85_запись_тайла_в_буфер
C - - - - - 0x030CB2 18:8CA2: E6 3D     INC ram_003D
C - - - - - 0x030CB4 18:8CA4: 60        RTS



loc_8CA5_запись_энергии_и_статов:
; байт после E1 = ???
C D - - - - 0x030CB5 18:8CA5: 48        PHA
C - - - - - 0x030CB6 18:8CA6: A4 40     LDY ram_0040
C - - - - - 0x030CB8 18:8CA8: E6 40     INC ram_0040
C - - - - - 0x030CBA 18:8CAA: B1 3E     LDA (ram_003E),Y
C - - - - - 0x030CBC 18:8CAC: D0 0F     BNE bra_8CBD
C - - - - - 0x030CBE 18:8CAE: 68        PLA
C - - - - - 0x030CBF 18:8CAF: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030CC2 18:8CB2: A0 02     LDY #con_plr_guts_hi
C - - - - - 0x030CC4 18:8CB4: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030CC6 18:8CB6: AA        TAX
C - - - - - 0x030CC7 18:8CB7: 88        DEY
C - - - - - 0x030CC8 18:8CB8: B1 34     LDA (ram_plr_data),Y
C - - - - - 0x030CCA 18:8CBA: 4C D9 8C  JMP loc_8C55_запись_цифер_в_буфер
bra_8CBD:
C - - - - - 0x030CCD 18:8CBD: 29 7F     AND #$7F
C - - - - - 0x030CCF 18:8CBF: C9 07     CMP #$07
C - - - - - 0x030CD1 18:8CC1: 90 0D     BCC bra_8CD0
C - - - - - 0x030CD3 18:8CC3: C9 18     CMP #$18
C - - - - - 0x030CD5 18:8CC5: B0 09     BCS bra_8CD0
C - - - - - 0x030CD7 18:8CC7: AE 4E 04  LDX ram_высота_мяча
C - - - - - 0x030CDA 18:8CCA: CA        DEX
C - - - - - 0x030CDB 18:8CCB: F0 03     BEQ bra_8CD0
C - - - - - 0x030CDD 18:8CCD: 18        CLC
C - - - - - 0x030CDE 18:8CCE: 69 08     ADC #$08
bra_8CD0:
C - - - - - 0x030CE0 18:8CD0: AA        TAX
C - - - - - 0x030CE1 18:8CD1: 68        PLA
C - - - - - 0x030CE2 18:8CD2: 20 27 C5  JSR sub_0x03CE18_банксвич_PRG_1C_1D_с_возвратом
C - - - - - 0x030CE5 18:8CD5: A5 32     LDA ram_0032
C - - - - - 0x030CE7 18:8CD7: A6 33     LDX ram_0033
C D - - - - 0x030CE9 18:8CD9: 4C 55 8C  JMP loc_8C55_запись_цифер_в_буфер



loc_8CDC_вывести_имя_игрока_и_позицию:
C D - - - - 0x030CEC 18:8CDC: 48        PHA
C - - - - - 0x030CED 18:8CDD: C9 0B     CMP #$0B
C - - - - - 0x030CEF 18:8CDF: 90 02     BCC bra_8CE3
- - - - - - 0x030CF1 18:8CE1: E9 0B     SBC #$0B
bra_8CE3:
C - - - - - 0x030CF3 18:8CE3: 0A        ASL
C - - - - - 0x030CF5 18:8CE5: AA        TAX
C - - - - - 0x030D01 18:8CF1: BD 05 8D  LDA tbl_8D04_сокращения_позиций_игроков + 1,X
                                        PHA
C - - - - - 0x030CF6 18:8CE6: BD 04 8D  LDA tbl_8D04_сокращения_позиций_игроков,X
C - - - - - 0x030CFC 18:8CEC: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030CFF 18:8CEF: 68        PLA
C - - - - - 0x030D07 18:8CF7: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030D0A 18:8CFA: A9 00     LDA #$00
C - - - - - 0x030D0D 18:8CFD: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030D10 18:8D00: 68        PLA
C - - - - - 0x030D11 18:8D01: 4C 1A 8D  JMP loc_8D1A_вывести_имя

tbl_8D04_сокращения_позиций_игроков:
    .text "GK"        ; 1
    .text "DF"        ; 2
    .text "DF"        ; 3
    .text "DF"        ; 4
    .text "DF"        ; 5
    .text "MF"        ; 6
    .text "FW"        ; 7
    .text "MF"        ; 8
    .text "FW"        ; 9
    .text "MF"        ; 10
    .text "FW"        ; 11



loc_8D1A_вывести_имя:
sub_8D1A_вывести_имя:
C - - - - - 0x030D2C 18:8D1C: 20 0C C5  JSR sub_0x03CD8C_получить_адрес_игрока
C - - - - - 0x030D2F 18:8D1F: A0 00     LDY #con_plr_id
C - - - - - 0x030D31 18:8D21: B1 34     LDA (ram_plr_data),Y
loc_8D6C_вывести_слово:
C D - - - - 0x030D7C 18:8D6C: 20 3C C5  JSR sub_0x03F31F_таблица_слов
C - - - - - 0x030D7F 18:8D6F: A0 00     LDY #$00
bra_8D71_loop:
C - - - - - 0x030D81 18:8D71: B1 30     LDA (ram_0030),Y
C - - - - - 0x030D83 18:8D73: C9 E0     CMP #$FC
C - - - - - 0x030D85 18:8D75: B0 0F     BEQ bra_8D86_конец_слова
C - - - - - 0x030D87 18:8D77: 98        TYA
C - - - - - 0x030D88 18:8D78: 48        PHA
C - - - - - 0x030D89 18:8D79: B1 30     LDA (ram_0030),Y
C - - - - - 0x030D8E 18:8D7E: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030D91 18:8D81: 68        PLA
C - - - - - 0x030D92 18:8D82: A8        TAY
C - - - - - 0x030D93 18:8D83: C8        INY
C - - - - - 0x030D94 18:8D84: D0 EB     BNE bra_8D71_loop
bra_8D86_конец_слова:
C - - - - - 0x030D96 18:8D86: 98        TYA
C - - - - - 0x030D97 18:8D87: 38        SEC
C - - - - - 0x030D98 18:8D88: E9 05     SBC #$07      ; добавить пробелов если длина имени меньше байта
C - - - - - 0x030D9A 18:8D8A: 10 11     BPL bra_8D9D_RTS
C - - - - - 0x030D9C 18:8D8C: 49 FF     EOR #$FF
C - - - - - 0x030D9E 18:8D8E: 18        CLC
C - - - - - 0x030D9F 18:8D8F: 69 01     ADC #$01
C - - - - - 0x030DA1 18:8D91: 85 47     STA ram_0047
bra_8D93_loop_добавления_пробелов_после_имени:
C - - - - - 0x030DA3 18:8D93: A9 00     LDA #$00
C - - - - - 0x030DA6 18:8D96: 20 9F 8C  JSR sub_8C9F_записать_символ_в_буфер_и_увеличить_индекс
C - - - - - 0x030DA9 18:8D99: C6 47     DEC ram_0047
C - - - - - 0x030DAB 18:8D9B: D0 F6     BNE bra_8D93_loop_добавления_пробелов_после_имени
bra_8D9D_RTS:
C - - - - - 0x030DAD 18:8D9D: 60        RTS

tbl_8D9E_тайлы_окон_меню:
; основные белые квадратные окна во время игры
    .byte $9C, $A8, $9D     ; левый верхний угол, верхняя горизонтальная линия, правый верхний угол
    .byte $AA, $00, $AB     ; левая вертикальная линия, содержимое окна, правая вертикальна линия
    .byte $9E, $A9, $9F     ; левый нижний угол, нижняя горизонтальная линия, правый нижний угол

; красная рамка списка игроков для пенальти
    .byte $90, $8E, $91
    .byte $8F, $00, $8F
    .byte $92, $8E, $93

; пустое пространство (например когда при смещении курсора паса требуется затереть статы)
    .byte $00, $00, $00
    .byte $00, $00, $00
    .byte $00, $00, $00

; имя игрока и энергия вверху экрана
    .byte $E4, $E5, $F0
    .byte $E6, $00, $F2
    .byte $EC, $ED, $F8



tbl_8DC2_тайлы_облаков:
    .word off_8DE0_00       ; обычное 1
    .word off_8DE1_01       ; обычное 2
    .word off_8DE2_02       ; обычное 3
    .word off_8DE3_03       ; чарли электрическое
    .word off_8DE4_04       ; чарли храпит
    .word off_8DE5_05       ; прямоугольное электрическое
    .word off_8DE6_06___    ; прямоугольное обычное
    .word off_8DE6_06___    ; 07
    .word off_8DE6_06___    ; 08
    .word off_8DE6_06___    ; 09
    .word off_8DE6_06___    ; 0A
    .word off_8DE6_06___    ; 0B
    .word off_8DE6_06___    ; 0C
    .word off_8DE6_06___    ; 0D
    .word off_8DE6_06___    ; 0E

off_8DE0_00:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $00, $9C, $A8, $A8, $A0, $A8, $A8, $A0, $A8, $A0, $A8, $A8, $A0, $A8, $A8, $A8, $A0, $A8, $A0, $A8, $A8, $9D, $00, $00
    .byte $00, $9C, $98, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $99, $9D, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $A4, $A5, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $9E, $9A, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9B, $9F, $00
    .byte $00, $00, $9E, $A9, $A2, $A9, $A9, $A2, $A9, $A9, $A9, $A9, $A2, $A9, $A9, $A9, $A2, $A9, $A9, $A9, $A2, $A9, $9F, $00, $00

off_8DE1_01:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $00, $9C, $A8, $A0, $A0, $A8, $A0, $A8, $A0, $A8, $A8, $A0, $A8, $A8, $A0, $A0, $A8, $A8, $A0, $A8, $A0, $A8, $9D, $00
    .byte $00, $9C, $98, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $A4, $A5, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9B, $9F, $00
    .byte $00, $9E, $A2, $A9, $A9, $A2, $A9, $A9, $A2, $A9, $A9, $A9, $A9, $A2, $A9, $A9, $A2, $A9, $A9, $A2, $A2, $A9, $9F, $00, $00

off_8DE2_02:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $00, $9C, $A0, $A8, $A8, $A0, $A0, $A8, $A8, $A8, $A0, $A0, $A8, $A8, $A0, $A8, $A8, $A0, $A8, $A0, $A0, $A8, $9D, $00
    .byte $00, $9C, $98, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $A4, $A5, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $9E, $9A, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $00, $9E, $9A, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9B, $A9, $9F, $00
    .byte $00, $00, $00, $9E, $A2, $A9, $A9, $A2, $A2, $A9, $A9, $A9, $A2, $A2, $A9, $A9, $A9, $A2, $A9, $A9, $A9, $9F, $00, $00, $00

off_8DE3_03:        ; электрическое
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $00, $9B, $A2, $A9, $A2, $A9, $A2, $A2, $A2, $A9, $A2, $A2, $A9, $A9, $A9, $A2, $A9, $A9, $A2, $A9, $A2, $9A, $00, $00
    .byte $00, $9B, $9F, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9E, $9A, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $99, $9D, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9C, $98, $00
    .byte $00, $00, $99, $A0, $A8, $A8, $A8, $A0, $A8, $A8, $A8, $A0, $A8, $A0, $A8, $A0, $A0, $A8, $A0, $A8, $A0, $A8, $98, $00, $00

off_8DE4_04:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $00, $00, $9C, $A0, $A8, $A0, $A8, $A0, $A8, $A8, $A0, $A8, $A0, $A8, $A8, $A0, $A8, $A0, $A0, $A8, $A0, $9D, $00, $00
    .byte $00, $9C, $A0, $98, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $99, $9D, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $96, $97, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $9E, $9A, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A1, $00
    .byte $00, $00, $A3, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $9B, $9F, $00
    .byte $00, $00, $9E, $A2, $A9, $A2, $A9, $A2, $A9, $A9, $A2, $A9, $A2, $A9, $A9, $A2, $A2, $A9, $A2, $A2, $A9, $A2, $9F, $00, $00

off_8DE5_05:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $9B, $A9, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A2, $A9, $A9, $9A, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $A1, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $A3, $00
    .byte $00, $AB, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA, $00
    .byte $00, $99, $A8, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A0, $A8, $A8, $98, $00

off_8DE6_06___:
    .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00
    .byte $00, $9C, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $A8, $9D, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $AA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AB, $00
    .byte $00, $9E, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $A9, $9F, $00



tbl_921F_банки_облаков:
;          00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 00
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 10
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 20
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 30
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 40
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 50
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 60
    .byte $A7, $A7, $A7, $A8, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 70
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 80
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; 90
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A9, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; A0
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; B0
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; C0
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; D0
    .byte $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7, $A7    ; E0



tbl_9220_фразы_облаков:
- D - I - - 0x031230 18:9220: 00 94     .word _cloud_0x00000_00     ; очистка облака
- D - I - - 0x031232 18:9222: 02 94     .word _cloud_0x00001_01     ; вратаря отпиздили при попытке отобрать мяч у нападающего
- D - I - - 0x031234 18:9224: 11 94     .word _cloud_0x00002_02     ; защитника отпиздили при попытке отобрать мяч у нападающего, или когда он напаривается на мяч
- D - I - - 0x031236 18:9226: 20 94     .word _cloud_0x00003_03     ; игрока отпиздили подкатом и забрали мяч
- D - I - - 0x031238 18:9228: 3B 94     .word _cloud_0x00004_04     ; ней делает удар, и тониньо перебивает/братья делают удар с джедаем
- D - I - - 0x03123A 18:922A: 47 94     .word _cloud_0x00005_05     ; игрок забрал мяч подкатом
- D - I - - 0x03123C 18:922C: 55 94     .word _cloud_0x00006_06     ; кипер нападает на игрока с мячом 1 на 1
- D - I - - 0x03123E 18:922E: 65 94     .word _cloud_0x00007_07     ; игрок не дотянулся до мяча когда тот в полете поверху/понизу
- D - I - - 0x031240 18:9230: 71 94     .word _cloud_0x00008_08     ; игрок напоролся на верхний/нижний летящий мяч, но не смог его остановить, а просто замедлил
- D - I - - 0x031242 18:9232: 8A 94     .word _cloud_0x00009_09     ; игрок напоролся на верхний/нижний летящий мяч и отбил его
- D - I - - 0x031244 18:9234: 95 94     .word _cloud_0x0000A_0A     ; игрок принимает высокий мяч на штрафной
- D - I - - 0x031246 18:9236: AD 94     .word _cloud_0x0000B_0B     ; вратарь сделал выпад и забрал мяч без давания пизды сопернику (убийство в E3)
- D - I - - 0x031248 18:9238: BB 94     .word _cloud_0x0000C_0C     ; вратарь делает выпад когда на него напали, но ему не удается словить
- D - I - - 0x03124A 18:923A: CE 94     .word _cloud_0x0000D_0D     ; чарли без облака и ничего не говорит
- D - I - - 0x03124C 18:923C: D1 94     .word _cloud_0x0000E_0E     ; втарарь пытается словить/отбить мяч, но полюбому отбивает, даже если хреново
- D - I - - 0x03124E 18:923E: D9 94     .word _cloud_0x0000F_0F     ; защитник в воротах отбивает мяч
- D - I - - 0x031250 18:9240: E4 94     .word _cloud_0x00010_10     ; игрок принимает низкий мяч на штрафной
- D - I - - 0x031252 18:9242: FC 94     .word _cloud_0x00011_11     ; защитник в воротах промахивается по мячу
- D - I - - 0x031254 18:9244: 12 95     .word _cloud_0x00012_12     ; жирный кипер rolling save
- D - I - - 0x031256 18:9246: 27 95     .word _cloud_0x00013_13     ; лови мячи, третья фраза (брат)/ фраза мисаки во время синего удара
- D - I - - 0x031258 18:9248: 2E 95     .word _cloud_0x00014_14     ; игрок завладел мячом (после "тут никого")
- D - I - - 0x03125A 18:924A: 48 95     .word _cloud_0x00015_15     ; вратарь пытается отбить удар, и хреново отбивает
- D - I - - 0x03125C 18:924C: 55 95     .word _cloud_0x00016_16     ; игрок отобрал мяч гибридом при нападении на игрока или когда мяч в полете (приклеился к ноге)
- D - I - - 0x03125E 18:924E: 63 95     .word _cloud_0x00017_17     ; защитник на своей зоне победил соперника и сделал clear
- D - I - - 0x031260 18:9250: 6F 95     .word _cloud_0x00018_18     ; попадание в штангу во время удара с 11 метров (матерное)
- D - I - - 0x031262 18:9252: 8B 95     .word _cloud_0x00019_19     ; игрок сделал супер ежики и приклеил к себе удар
- D - I - - 0x031264 18:9254: 9A 95     .word _cloud_0x0001A_1A     ; игрок проиграл борьбу на своей зоне, соперник выбивает мяч поверху
- D - I - - 0x031266 18:9256: A9 95     .word _cloud_0x0001B_1B     ; игрок сам подлез под мяч чтобы попытаться остановить
- D - I - - 0x031268 18:9258: B7 95     .word _cloud_0x0001C_1C     ; вакашимазу оттолкнулся от штанги, но получит пизды
- D - I - - 0x03126A 18:925A: CE 95     .word _cloud_0x0001D_1D     ; игрок затоптал соперника, но сам же замедлился
- D - I - - 0x03126C 18:925C: E6 95     .word _cloud_0x0001E_1E     ; вакашимазу оттолкнулся от штанги
- D - I - - 0x03126E 18:925E: 08 96     .word _cloud_0x0001F_1F     ; гертис кастует темную иллюзию
- D - I - - 0x031270 18:9260: 21 96     .word _cloud_0x00020_20     ; 
- D - I - - 0x031272 18:9262: 2A 96     .word _cloud_0x00021_21     ; 
- D - I - - 0x031274 18:9264: 40 96     .word _cloud_0x00022_22     ; вратаря наебали после пропуска через ноги
- D - I - - 0x031276 18:9266: 77 96     .word $0000        ; 23 unused игрок покалечен после стычки с игроком
- D - I - - 0x031278 18:9268: 86 96     .word _cloud_0x00024_24     ; соперник выбивает мяч на своей штрафной
- D - I - - 0x03127A 18:926A: 92 96     .word _cloud_0x00025_25     ; недостаточно энергии
- D - I - - 0x03127C 18:926C: A7 96     .word _cloud_0x00026_26     ; 
- D - I - - 0x03127E 18:926E: BF 96     .word _cloud_0x00027_27     ; штанга
- D - I - - 0x031280 18:9270: DA 96     .word _cloud_0x00028_28     ; гол!
- D - I - - 0x031282 18:9272: EA 96     .word _cloud_0x00029_29     ; сообщение oops! на мигающем белом фоне
- - - - - - 0x031284 18:9274: F6 96     .word $0000        ; 2A unused
- - - - - - 0x031286 18:9276: 01 97     .word $0000        ; 2B unused
- D - I - - 0x031288 18:9278: 0D 97     .word _cloud_0x0002C_2C     ; игроки столкнулись в воздухе, экран мигает, сообщение oh!
- - - - - - 0x03128A 18:927A: 18 97     .word $0000        ; 2D unused
- D - I - - 0x03128C 18:927C: 31 97     .word _cloud_0x0002E_2E     ; игрок в стеночке перехватил штрафной удар
- D - I - - 0x03128E 18:927E: 3F 97     .word _cloud_0x0002F_2F     ; вакашимазу отталкивается от штанги (анимация ног)
- D - I - - 0x031290 18:9280: 4E 97     .word _cloud_0x00030_30     ; нарушение
- D - I - - 0x031292 18:9282: 5F 97     .word _cloud_0x00031_31     ; игрок добивает отскок от штанги
- D - I - - 0x031294 18:9284: 97 97     .word _cloud_0x00032_32     ; 2 сообщения о рваном мяче
- D - I - - 0x031296 18:9286: C4 97     .word _cloud_0x00033_33     ; вратарь идеально словил/отбил мяч
- D - I - - 0x031298 18:9288: D3 97     .word _cloud_0x00034_34     ; игрок выбил мяч подкатом
- - - - - - 0x03129A 18:928A: E4 97     .word _cloud_0x00035_35     ; игрок отбил штрафной удар, но тот серавно полетел в ворота (задета стенка)
- D - I - - 0x03129C 18:928C: FE 97     .word _cloud_0x00036_36     ; штрафной удар огибает стеночку
- D - I - - 0x03129E 18:928E: 10 98     .word _cloud_0x00037_37     ; соперник прыгает сразу после паса игрока
- D - I - - 0x0312A0 18:9290: 33 98     .word _cloud_0x00038_38     ; игрок нажал перехват паса, соперник сделал пас по низу
- D - I - - 0x0312A2 18:9292: 43 98     .word _cloud_0x00039_39     ; ? крит защиты
- D - I - - 0x0312A4 18:9294: 4C 98     .word _cloud_0x0003A_3A     ; вратарь делает олвэйс нижний/верхний
- D - I - - 0x0312A6 18:9296: 5C 98     .word _cloud_0x0003B_3B     ; первый игрок из списка прыгает для борьбы с нападающим в штрафной
- D - I - - 0x0312A8 18:9298: 6C 98     .word _cloud_0x0003C_3C     ; четвертый игрок из списка прыгает для борьбы с нападающим в штрафной
- D - I - - 0x0312AA 18:929A: 7A 98     .word _cloud_0x0003D_3D     ; второй/пятый игрок из списка прыгает для борьбы с нападающим в штрафной
- D - I - - 0x0312AC 18:929C: 8E 98     .word _cloud_0x0003E_3E     ; третий игрок из списка прыгает для борьбы с нападающим в штрафной
- D - I - - 0x0312AE 18:929E: 9B 98     .word _cloud_0x0003F_3F     ; игрок + "действие" (делает подкат)
- D - I - - 0x0312B0 18:92A0: A4 98     .word _cloud_0x00040_40     ; первый игрок из списка бежит для борьбы с нападающим в штрафной
- D - I - - 0x0312B2 18:92A2: B4 98     .word _cloud_0x00041_41     ; игрок делает перехват паса или блок, но игрок обводит, поэтому нападающий просто бежит
- D - I - - 0x0312B4 18:92A4: C1 98     .word _cloud_0x00042_42     ; второй/пятый игрок из списка бежит для борьбы с нападающим в штрафной
- D - I - - 0x0312B6 18:92A6: CF 98     .word _cloud_0x00043_43     ; четвертый игрок из списка бежит для борьбы с нападающим в штрафной
- D - I - - 0x0312B8 18:92A8: E7 98     .word _cloud_0x00044_44     ; третий игрок из списка бежит для борьбы с нападающим в штрафной
- D - I - - 0x0312BA 18:92AA: F4 98     .word _cloud_0x00045_45     ; игрок с трудом обводит
- D - I - - 0x0312BC 18:92AC: 0B 99     .word _cloud_0x00046_46     ; игрок легко обводит
- D - I - - 0x0312BE 18:92AE: 17 99     .word _cloud_0x00047_47     ; игрок что-то делает (пасует)        !!! где-то тут неправильно прописаны комменты
- D - I - - 0x0312C0 18:92B0: 21 99     .word _cloud_0x00048_48     ; игрок прыгает в штрафной на мяч, перед тем как что-то сделать
- D - I - - 0x0312C2 18:92B2: 2D 99     .word _cloud_0x00049_49     ; игрок что-то делает (делает супер)
- D - I - - 0x0312C4 18:92B4: 38 99     .word _cloud_0x0004A_4A     ; цубаса первый раз делает циклон
- D - I - - 0x0312C6 18:92B6: 4E 99     .word _cloud_0x0004B_4B     ; джедай делает удар (лицо) за японию
- D - I - - 0x0312C8 18:92B8: 63 99     .word _cloud_0x0004C_4C     ; игрок бежит в штрафной на мяч, перед тем как что-то сделать
- D - I - - 0x0312CA 18:92BA: 75 99     .word _cloud_0x0004D_4D     ; игрок в любой штрафной traps мяч
- - - - - - 0x0312CC 18:92BC: 7D 99     .word $0000        ; 4E unused
- D - I - - 0x0312CE 18:92BE: 7D 99     .word _cloud_0x0004F_4F     ; мисуги жалуется на сердце (лицо)
- D - I - - 0x0312D0 18:92C0: 8D 99     .word _cloud_0x00050_50     ; 
- D - I - - 0x0312D2 18:92C2: 9F 99     .word _cloud_0x00051_51     ; нашей команде забили гол
- D - I - - 0x0312D4 18:92C4: BB 99     .word _cloud_0x00052_52     ; сообщение о забитом голе в ворота соперника
- D - I - - 0x0312D6 18:92C6: D9 99     .word _cloud_0x00053_53     ; соперник порвал тебе сетку
- - - - - - 0x0312D8 18:92C8: FA 99     .word _cloud_0x00054_54     ; наш игрок порвал сетку врагу
- D - I - - 0x0312DA 18:92CA: 1C 9A     .word _cloud_0x00055_55     ; наш игрок порвал сетку врагу японцами и чарли машет флагом
- D - I - - 0x0312DC 18:92CC: 3D 9A     .word _cloud_0x00056_56     ; ишизаки в процессе блокирования
- D - I - - 0x0312DE 18:92CE: 48 9A     .word _cloud_0x00057_57     ; 
- D - I - - 0x0312E0 18:92D0: 62 9A     .word _cloud_0x00058_58     ; игрок принимает мяч на грудь или на ногу
- D - I - - 0x0312E2 18:92D2: 70 9A     .word _cloud_0x00059_59     ; перепасовка
- D - I - - 0x0312E4 18:92D4: 80 9A     .word _cloud_0x0005A_5A     ; возврат перепасовки напарником
- D - I - - 0x0312E6 18:92D6: 96 9A     .word _cloud_0x0005B_5B     ; сообщение о том, кто первым пробивает пенальти
- D - I - - 0x0312E8 18:92D8: AF 9A     .word _cloud_0x0005C_5C     ; вяч вылетел в аут
- D - I - - 0x0312EA 18:92DA: C6 9A     .word _cloud_0x0005D_5D     ; команде назначается corner kick
- D - I - - 0x0312EC 18:92DC: D9 9A     .word _cloud_0x0005E_5E     ; команде назначается goal kick
- D - I - - 0x0312EE 18:92DE: E9 9A     .word _cloud_0x0005F_5F     ; команде назначается вбрасывание из аута
- D - I - - 0x0312F0 18:92E0: FA 9A     .word _cloud_0x00060_60     ; вратарь выбивает мяч goal kick
- D - I - - 0x0312F2 18:92E2: 07 9B     .word _cloud_0x00061_61     ; 
- D - I - - 0x0312F4 18:92E4: 17 9B     .word _cloud_0x00062_62     ; игрок вбрасывает мяч из аута
- D - I - - 0x0312F6 18:92E6: 26 9B     .word _cloud_0x00063_63     ; игрок бьет с углового
- D - I - - 0x0312F8 18:92E8: 36 9B     .word _cloud_0x00064_64     ; игрок пасует из углового
- D - I - - 0x0312FA 18:92EA: 47 9B     .word _cloud_0x00065_65     ; сообщение о свободном ударе (freekick)
- D - I - - 0x0312FC 18:92EC: 60 9B     .word _cloud_0x00066_66     ; сообщение о нарушении пенальти (penalty kick)
- D - I - - 0x0312FE 18:92EE: 7A 9B     .word _cloud_0x00067_67     ; сообщение об игроке, пробивающем пенальти с 11м после нарушения
- - - - - - 0x031300 18:92F0: 88 9B     .word $0000        ; 68 unused
- D - I - - 0x031302 18:92F2: 92 9B     .word _cloud_0x00069_69     ; сообщение об игроке, пробивающем серию пенальти
- D - I - - 0x031304 18:92F4: C1 9B     .word _cloud_0x0006A_6A     ; 
- D - I - - 0x031306 18:92F6: CD 9B     .word _cloud_0x0006B_6B     ; звук бананового мяча
- D - I - - 0x031308 18:92F8: D7 9B     .word _cloud_0x0006C_6C     ; звук огненного удара
- D - I - - 0x03130A 18:92FA: E3 9B     .word _cloud_0x0006D_6D     ; на игрока напали ?? соперников
- D - I - - 0x03130C 18:92FC: 71 9C     .word _cloud_0x0006E_6E     ; игрок принял мяч на грудь / мяч потерян после попытки засейвить (когда я это написал?)
- D - I - - 0x03130E 18:92FE: 82 9C     .word _cloud_0x0006F_6F     ; кто-то напал на вратаря
- D - I - - 0x031310 18:9300: 92 9C     .word _cloud_0x00070_70     ; время вышло
- D - I - - 0x031312 18:9302: AA 9C     .word _cloud_0x00071_71     ; сообщение о победе/поражении/ничье
- D - I - - 0x031314 18:9304: 31 9F     .word _cloud_0x00072_72     ; игрок делает удар на пенальти с 11м
- D - I - - 0x031316 18:9306: 42 9F     .word _cloud_0x00073_73     ; ожидание перед разводкой
- D - I - - 0x031318 18:9308: BD A3     .word _cloud_0x00074_74     ; сообщение при разводке
- D - I - - 0x03131A 18:930A: 39 A4     .word _cloud_0x00075_75     ; игрок получил мяч во время разводки
- D - I - - 0x03131C 18:930C: 47 A4     .word _cloud_0x00076_76     ; ? мацуяма приказывает всем
- D - I - - 0x03131E 18:930E: 61 A4     .word _cloud_0x00077_77     ; 
- D - I - - 0x031320 18:9310: 6C A4     .word _cloud_0x00078_78     ; диас выебывается что он гений после гола
- D - I - - 0x031322 18:9312: 8C A4     .word _cloud_0x00079_79     ; меон говорит что драйв бесполезен когда ему бьешь
- D - I - - 0x031324 18:9314: A7 A4     .word _cloud_0x0007A_7A     ; меон злится
- D - I - - 0x031326 18:9316: B4 A4     .word _cloud_0x0007B_7B     ; тсубаса 1й раз злится после отбивания меона
- D - I - - 0x031328 18:9318: C2 A4     .word _cloud_0x0007C_7C     ; фраза озарения
- D - I - - 0x03132A 18:931A: E2 A4     .word _cloud_0x0007D_7D     ; фраза озарения
- D - I - - 0x03132C 18:931C: 05 A5     .word _cloud_0x0007E_7E     ; фраза озарения
- D - I - - 0x03132E 18:931E: 16 A5     .word _cloud_0x0007F_7F     ; фраза озарения
- D - I - - 0x031330 18:9320: 1E A5     .word _cloud_0x00080_80     ; фраза озарения
- D - I - - 0x031332 18:9322: 49 A5     .word _cloud_0x00081_81     ; фраза озарения
- D - I - - 0x031334 18:9324: 5B A5     .word _cloud_0x00082_82     ; фраза озарения
- D - I - - 0x031336 18:9326: 6D A5     .word _cloud_0x00083_83     ; фраза озарения
- D - I - - 0x031338 18:9328: 81 A5     .word _cloud_0x00084_84     ; фраза озарения
- D - I - - 0x03133A 18:932A: 8B A5     .word _cloud_0x00085_85     ; фраза озарения
- D - I - - 0x03133C 18:932C: 97 A5     .word _cloud_0x00086_86     ; фраза озарения
- D - I - - 0x03133E 18:932E: A8 A5     .word _cloud_0x00087_87     ; фраза озарения
- - - - - - 0x031340 18:9330: B4 A5     .word $0000        ; 88 unused
- D - I - - 0x031342 18:9332: B5 A5     .word _cloud_0x00089_89     ; шнайдер злится после гола
- D - I - - 0x031344 18:9334: C8 A5     .word _cloud_0x0008A_8A     ; озарение франции, фраза 1
- D - I - - 0x031346 18:9336: D8 A5     .word _cloud_0x0008B_8B     ; озарение франции, фраза 2
- D - I - - 0x031348 18:9338: 10 A6     .word _cloud_0x0008C_8C     ; озарение франции, фраза 3
- D - I - - 0x03134A 18:933A: 3B A6     .word _cloud_0x0008D_8D     ; озарение франции, фраза 4
- D - I - - 0x03134C 18:933C: 44 A6     .word _cloud_0x0008E_8E     ; у серой забрали мяч\ругательство меона после гола
- D - I - - 0x03134E 18:933E: 51 A6     .word _cloud_0x0008F_8F     ; у пибика забрали мяч (лицо)
- D - I - - 0x031350 18:9340: 5D A6     .word _cloud_0x00090_90     ; у пибика забрали мяч (лицо)
- D - I - - 0x031352 18:9342: 69 A6     .word _cloud_0x00091_91     ; у кого-то забрали мяч (лицо)
- D - I - - 0x031354 18:9344: 78 A6     .word _cloud_0x00092_92     ; у брата забрали мяч (лицо)
- - - - - - 0x031356 18:9346: 87 A6     .word _cloud_0x00093_93     ; у кого-то забрали мяч (лицо)
- D - I - - 0x031358 18:9348: 96 A6     .word _cloud_0x00094_94     ; у кого-то забрали мяч (лицо)
- D - I - - 0x03135A 18:934A: A7 A6     .word _cloud_0x00095_95     ; у кого-то забрали мяч (лицо)
- D - I - - 0x03135C 18:934C: B9 A6     .word _cloud_0x00096_96     ; цубаса злится после отбивания кипером
- D - I - - 0x03135E 18:934E: EB A6     .word _cloud_0x00097_97     ; C'mon, "игрок!" (лицо)
- D - I - - 0x031360 18:9350: F7 A6     .word _cloud_0x00098_98     ; кто-то на кого-то напал (лицо)
- D - I - - 0x031362 18:9352: 01 A7     .word _cloud_0x00099_99     ; кто-то на кого-то напал (лицо)
- D - I - - 0x031364 18:9354: 0A A7     .word _cloud_0x0009A_9A     ; кто-то на кого-то напал (лицо)
- D - I - - 0x031366 18:9356: 16 A7     .word _cloud_0x0009B_9B     ; втарарь удивляется что мяч исчез после удара коимбры
- D - I - - 0x031368 18:9358: 28 A7     .word _cloud_0x0009C_9C     ; комментатор объясняет драйв тигр
- D - I - - 0x03136A 18:935A: 51 A7     .word _cloud_0x0009D_9D     ; хюга в окружении ебашит третьим ударом и злится
- D - I - - 0x03136C 18:935C: 77 A7     .word _cloud_0x0009E_9E     ; джедай выебывается после гола
- D - I - - 0x03136E 18:935E: A0 A7     .word _cloud_0x0009F_9F     ; вакашимазу злится
- D - I - - 0x031370 18:9360: B1 A7     .word _cloud_0x000A0_A0     ; морисаки злится
- D - I - - 0x031372 18:9362: CB A7     .word _cloud_0x000A1_A1     ; вакабаши злится
- D - I - - 0x031374 18:9364: D5 A7     .word _cloud_0x000A2_A2     ; kyrae после подката
- D - I - - 0x031376 18:9366: E0 A7     .word _cloud_0x000A3_A3     ; тсубаса бьет драйв удар\пибик делает свой удар (лицо)
- D - I - - 0x031378 18:9368: ED A7     .word _cloud_0x000A4_A4     ; цубаса делает 3ю свиту (лицо)
- D - I - - 0x03137A 18:936A: F8 A7     .word _cloud_0x000A5_A5     ; нитка бьет с земли (лицо)
- - - - - - 0x03137C 18:936C: 04 A8     .word _cloud_0x000A6_A6     ; ничья в пенальти (sudden death)
                                        .word _cloud_0x000A6_A7 ; рожа нападающего, который отвечает защитнику сразу после его нападения
- D - I - - 0x031380 18:9370: 1B A8     .word _cloud_0x000A8_A8     ; лови мячи, первая фраза (брат)
- D - I - - 0x031382 18:9372: 23 A8     .word _cloud_0x000A9_A9     ; брат делает удар головой, вторая фраза (лицо)
- D - I - - 0x031384 18:9374: 35 A8     .word _cloud_0x000AA_AA     ; удар мисаки и цубасы (лицо цубасы)
- D - I - - 0x031386 18:9376: 43 A8     .word _cloud_0x000AB_AB     ; удар мисаки и цубасы (лицо мисаки)
- D - I - - 0x031388 18:9378: 4E A8     .word _cloud_0x000AC_AC     ; брат1 зовет брата2
- D - I - - 0x03138A 18:937A: 56 A8     .word _cloud_0x000AD_AD     ; брат делает двойной, вторая фраза (лицо)
- D - I - - 0x03138C 18:937C: 65 A8     .word _cloud_0x000AE_AE     ; лови мячи, вторая фраза (джедай)
- D - I - - 0x03138E 18:937E: 6F A8     .word _cloud_0x000AF_AF     ; звук полета драйв удара\лови мячи, четвертая фраза (брат)\цубаса базарит с хюгой
- D - I - - 0x031390 18:9380: 7A A8     .word _cloud_0x000B0_B0     ; лови мячи, пятая фраза (джедай)
- D - I - - 0x031392 18:9382: 80 A8     .word _cloud_0x000B1_B1     ; серая бьет тихим ударом (лицо)
- D - I - - 0x031394 18:9384: 92 A8     .word _cloud_0x000B2_B2     ; хюга делает тигриный удар (лицо)
- D - I - - 0x031396 18:9386: 9E A8     .word _cloud_0x000B3_B3     ; хюга делает нео тигриный удар (лицо)
- D - I - - 0x031398 18:9388: B9 A8     .word _cloud_0x000B4_B4     ; серая делает свиту (лицо)
- D - I - - 0x03139A 18:938A: C1 A8     .word _cloud_0x000B5_B5     ; цубаса ударил циклоном, мяч полетел вверх
- D - I - - 0x03139C 18:938C: C9 A8     .word _cloud_0x000B6_B6     ; цубаса бьет с девяткой (лицо цубасы до удара)
- D - I - - 0x03139E 18:938E: D8 A8     .word _cloud_0x000B7_B7     ; цубаса бьет с девяткой (лицо хюги до удара)
- D - I - - 0x0313A0 18:9390: E0 A8     .word _cloud_0x000B8_B8     ; цубаса бьет с девяткой (лицо хюги после удара)
- D - I - - 0x0313A2 18:9392: E9 A8     .word _cloud_0x000B9_B9     ; джедай делает удар (лицо) за куними
- D - I - - 0x0313A4 18:9394: 09 A9     .word _cloud_0x000BA_BA     ; карлос бьет удар (лицо)
- D - I - - 0x0313A6 18:9396: 13 A9     .word _cloud_0x000BB_BB     ; 
- D - I - - 0x0313A8 18:9398: 1F A9     .word _cloud_0x000BC_BC     ; 
- D - I - - 0x0313AA 18:939A: 27 A9     .word _cloud_0x000BD_BD     ; 
- D - I - - 0x0313AC 18:939C: 39 A9     .word _cloud_0x000BE_BE     ; 
- D - I - - 0x0313AE 18:939E: 49 A9     .word _cloud_0x000BF_BF     ; 
- D - I - - 0x0313B0 18:93A0: 62 A9     .word _cloud_0x000C0_C0     ; 
- D - I - - 0x0313B2 18:93A2: 6B A9     .word _cloud_0x000C1_C1     ; 
- D - I - - 0x0313B4 18:93A4: 75 A9     .word _cloud_0x000C2_C2     ; тсубаса\пибик делает суперпас
- D - I - - 0x0313B6 18:93A6: 7C A9     .word _cloud_0x000C3_C3     ; тсубаса 2й раз злится после отбивания меона
- D - I - - 0x0313B8 18:93A8: 89 A9     .word _cloud_0x000C4_C4     ; хюга злится и делает дриблинг (лицо)
- - - - - - 0x0313BA 18:93AA: 91 A9     .word _cloud_0x000C5_C5     ; джедай злится и делает дриблинг (лицо)
- D - I - - 0x0313BC 18:93AC: 9F A9     .word _cloud_0x000C6_C6     ; 
- D - I - - 0x0313BE 18:93AE: A9 A9     .word _cloud_0x000C7_C7     ; карлос злится и делает дриблинг (лицо)
- D - I - - 0x0313C0 18:93B0: B0 A9     .word _cloud_0x000C8_C8     ; дедок злится и делает дриблинг (лицо) 
- D - I - - 0x0313C2 18:93B2: C9 A9     .word _cloud_0x000C9_C9     ; комментатор описывает дриблинг дедка
- D - I - - 0x0313C4 18:93B4: D1 A9     .word _cloud_0x000CA_CA     ; 
- D - I - - 0x0313C6 18:93B6: DE A9     .word _cloud_0x000CB_CB     ; 
- D - I - - 0x0313C8 18:93B8: E8 A9     .word _cloud_0x000CC_CC     ; золотое комбо в исполнении
- D - I - - 0x0313CA 18:93BA: 0F AA     .word _cloud_0x000CD_CD     ; 
- D - I - - 0x0313CC 18:93BC: 1B AA     .word _cloud_0x000CE_CE     ; 
- - - - - - 0x0313CE 18:93BE: 24 AA     .word _cloud_0x000CF_CF     ; 
- D - I - - 0x0313D0 18:93C0: 5A AA     .word _cloud_0x000D0_D0     ; савада зовет хюгу
- D - I - - 0x0313D2 18:93C2: 68 AA     .word _cloud_0x000D1_D1     ; хюга зовет саваду
- D - I - - 0x0313D4 18:93C4: 70 AA     .word _cloud_0x000D2_D2     ; комментатор описывает перепасовку тохо
- D - I - - 0x0313D6 18:93C6: A5 AA     .word _cloud_0x000D3_D3     ; брат2 зовет брата1
- D - I - - 0x0313D8 18:93C8: B2 AA     .word _cloud_0x000D4_D4     ; наполеон завет пьера
- D - I - - 0x0313DA 18:93CA: BD AA     .word _cloud_0x000D5_D5     ; пьер завет наполеона
- D - I - - 0x0313DC 18:93CC: D5 AA     .word _cloud_0x000D6_D6     ; необычная комбинация (перепасовка братьев)
- D - I - - 0x0313DE 18:93CE: 04 AB     .word _cloud_0x000D7_D7     ; ишизаки прыгает блоком и базарит, но пока не отбил
- D - I - - 0x0313E0 18:93D0: 0E AB     .word _cloud_0x000D8_D8     ; джедай нападает блоком (лицо)
- D - I - - 0x0313E2 18:93D2: 25 AB     .word _cloud_0x000D9_D9     ; джедай нападает подкатом (лицо)
- D - I - - 0x0313E4 18:93D4: 3E AB     .word _cloud_0x000DA_DA     ; пибик нападает подкатом (лицо)
- D - I - - 0x0313E6 18:93D6: 4B AB     .word _cloud_0x000DB_DB     ; хюга нападает подкатом (лицо)
- - - - - - 0x0313E8 18:93D8: 66 AB     .word $0000        ; DC unused
- D - I - - 0x0313EA 18:93DA: 66 AB     .word _cloud_0x000DD_DD     ; вратарь угадывает сторону во время пенальти и отбивает
- D - I - - 0x0313EC 18:93DC: 95 AB     .word _cloud_0x000DE_DE     ; замах французов для удара
- - - - - - 0x0313EE 18:93DE: A0 AB     .word $0000        ; DF unused
- D - I - - 0x0313F0 18:93E0: A0 AB     .word _cloud_0x000E0_E0     ; звук полета мяча после удара нитки
- D - I - - 0x0313F2 18:93E2: AC AB     .word _cloud_0x000E1_E1     ; звук полета мяча после удара карлоса
- - - - - - 0x0313F4 18:93E4: B8 AB     .word $0000        ; E2 unused
- D - I - - 0x0313F6 18:93E6: F0 AB     .word _cloud_0x000E3_E3     ; вратарь дал пизды игроку и забрал мяч (без убийства в 0B)
- D - I - - 0x0313F8 18:93E8: 0B AC     .word _cloud_0x000E4_E4     ; назначено дополнительное время
- D - I - - 0x0313FA 18:93EA: 2D AC     .word _cloud_0x000E5_E5     ; кто-то на кого-то напал (лицо) джито
- D - I - - 0x0313FC 18:93EC: 38 AC     .word _cloud_0x000E6_E6     ; тут никого нет (мяч проебан)
- D - I - - 0x0313FE 18:93EE: 4A AC     .word _cloud_0x000E7_E7     ; вратарь решил не нападать и готовится к удару
- D - I - - 0x031400 18:93F0: 5A AC     .word _cloud_0x000E8_E8     ; 
- D - I - - 0x031402 18:93F2: 6A AC     .word _cloud_0x000E9_E9     ; в воротах нету вратаря
- D - I - - 0x031404 18:93F4: 7D AC     .word _cloud_0x000EA_EA     ; сообщение о наебанном вратаре
- D - I - - 0x031406 18:93F6: A8 AC     .word _cloud_0x000EB_EB     ; супер перепасовка завершилась удачно\ игрок бежит по низу делать последующий подхват мяча (что блять?)
- D - I - - 0x031408 18:93F8: BB AC     .word _cloud_0x000EC_EC     ; игрок применяет супер подкат
- D - I - - 0x03140A 18:93FA: C5 AC     .word _cloud_0x000ED_ED     ; брат полетел после подсадки другого брата
- D - I - - 0x03140C 18:93FC: E0 AC     .word _cloud_0x000EE_EE     ; комментатор во время попытки лови мячи
- D - I - - 0x03140E 18:93FE: 02 AD     .word _cloud_0x000EF_EF     ; 

tbl_AD1C_движущийся_фон:
; везде по 12 байтов, связано с движущимся фоном во время действий игрока
; байты 01-04, код вычитает 01
; смотреть управляющий байт в 0x020863
- D - - - - 0x032D2C 18:AD1C: 24 AD     .word off_AD24_01
- D - - - - 0x032D2E 18:AD1E: 30 AD     .word off_AD30_02_power_tackle___volley
- D - - - - 0x032D30 18:AD20: 3C AD     .word off_AD3C_03_tackle
- D - - - - 0x032D32 18:AD22: 48 AD     .word off_AD48_04_tiger_razor_skylab_tackle

con_loop = $FF

off_AD24_01:
- D - I - - 0x032D34 18:AD24: 02        .byte $02
- D - I - - 0x032D35 18:AD25: 3C        .byte $3C
- D - I - - 0x032D36 18:AD26: 52        .byte $52
- D - I - - 0x032D37 18:AD27: 02        .byte $02
- D - I - - 0x032D38 18:AD28: 3C        .byte $3C
- D - I - - 0x032D39 18:AD29: 20        .byte $20
- D - I - - 0x032D3A 18:AD2A: 02        .byte $02
- D - I - - 0x032D3B 18:AD2B: 3C        .byte $3C
- D - I - - 0x032D3C 18:AD2C: 26        .byte $26
- D - I - - 0x032D3D 18:AD2D: F1        .byte con_loop
- D - I - - 0x032D3E 18:AD2E: 24 AD     .word off_AD24_01

off_AD30_02_power_tackle___volley:
- D - I - - 0x032D40 18:AD30: 06        .byte $06
- D - I - - 0x032D41 18:AD31: 40        .byte $40
- D - I - - 0x032D42 18:AD32: 42        .byte $42
- D - I - - 0x032D43 18:AD33: 06        .byte $06
- D - I - - 0x032D44 18:AD34: 42        .byte $42
- D - I - - 0x032D45 18:AD35: 44        .byte $44
- D - I - - 0x032D46 18:AD36: 06        .byte $06
- D - I - - 0x032D47 18:AD37: 44        .byte $44
- D - I - - 0x032D48 18:AD38: 40        .byte $40
- D - I - - 0x032D49 18:AD39: F1        .byte con_loop
- D - I - - 0x032D4A 18:AD3A: 30 AD     .word off_AD30_02_power_tackle___volley

off_AD3C_03_tackle:
- D - I - - 0x032D4C 18:AD3C: 04        .byte $04
- D - I - - 0x032D4D 18:AD3D: 40        .byte $40
- D - I - - 0x032D4E 18:AD3E: 42        .byte $42
- D - I - - 0x032D4F 18:AD3F: 04        .byte $04
- D - I - - 0x032D50 18:AD40: 42        .byte $42
- D - I - - 0x032D51 18:AD41: 44        .byte $44
- D - I - - 0x032D52 18:AD42: 04        .byte $04
- D - I - - 0x032D53 18:AD43: 44        .byte $44
- D - I - - 0x032D54 18:AD44: 40        .byte $40
- D - I - - 0x032D55 18:AD45: F1        .byte con_loop
- D - I - - 0x032D56 18:AD46: 3C AD     .word off_AD3C_03_tackle

off_AD48_04_tiger_razor_skylab_tackle:
- D - I - - 0x032D58 18:AD48: 02        .byte $02
- D - I - - 0x032D59 18:AD49: 40        .byte $40
- D - I - - 0x032D5A 18:AD4A: 42        .byte $42
- D - I - - 0x032D5B 18:AD4B: 02        .byte $02
- D - I - - 0x032D5C 18:AD4C: 42        .byte $42
- D - I - - 0x032D5D 18:AD4D: 44        .byte $44
- D - I - - 0x032D5E 18:AD4E: 02        .byte $02
- D - I - - 0x032D5F 18:AD4F: 44        .byte $44
- D - I - - 0x032D60 18:AD50: 40        .byte $40
- D - I - - 0x032D61 18:AD51: F1        .byte con_loop
- D - I - - 0x032D62 18:AD52: 48 AD     .word off_AD48_04_tiger_razor_skylab_tackle



tbl_AD54:
; что-то связанное с тряской экрана когда игрок блокирует пас/удар
.scope
con_stop = $F0
con_goto = $F1
- D - - - - 0x032D64 18:AD54: 5E AD     .word off_AD5E_00
- D - - - - 0x032D66 18:AD56: 61 AD     .word off_AD61_01
- D - - - - 0x032D68 18:AD58: 68 AD     .word off_AD68_02
- D - - - - 0x032D6A 18:AD5A: 6B AD     .word off_AD6B_03

off_AD5E_00:
- D - I - - 0x032D6E 18:AD5E: 78        .byte $78   ; <?>
- D - I - - 0x032D6F 18:AD5F: B8        .byte $B8   ; <ゴ>
- - - - - - 0x032D70 18:AD60: F0        .byte con_stop

off_AD61_01:
off_AD61:
- D - I - - 0x032D71 18:AD61: 01        .byte $01   ; <あ>
- D - I - - 0x032D72 18:AD62: 02        .byte $02   ; <い>
- D - I - - 0x032D73 18:AD63: 01        .byte $01   ; <あ>
- D - I - - 0x032D74 18:AD64: FE        .byte $FE    ; комменты в 0x030833
- D - I - - 0x032D75 18:AD65: F1        .byte con_goto
- D - I - - 0x032D76 18:AD66: 61 AD     .word off_AD61

off_AD68_02:
- D - I - - 0x032D78 18:AD68: 78        .byte $78   ; <?>
- D - I - - 0x032D79 18:AD69: 30        .byte $30   ; <ゃ>
- - - - - - 0x032D7A 18:AD6A: F0        .byte con_stop

off_AD6B_03:
- D - I - - 0x032D7B 18:AD6B: 78        .byte $78   ; <?>
- D - I - - 0x032D7C 18:AD6C: D0        .byte $D0   ; <ペ>
- - - - - - 0x032D7D 18:AD6D: F0        .byte con_stop
.endscope



tbl_AD6E:
; некоторые байты являются палитрой
- D - - - - 0x032D7E 18:AD6E: F6 AD     .word _off004_ADF6_00
- D - - - - 0x032D80 18:AD70: FC AD     .word _off004_ADFC_01
- D - - - - 0x032D82 18:AD72: 10 AE     .word _off004_AE10_02
- D - - - - 0x032D84 18:AD74: 31 AE     .word _off004_AE31_03
- D - - - - 0x032D86 18:AD76: 43 AE     .word _off004_AE43_04
- D - - - - 0x032D88 18:AD78: 5E AE     .word _off004_AE5E_05
- D - - - - 0x032D8A 18:AD7A: 71 AE     .word _off004_AE71_06
- - - - - - 0x032D8C 18:AD7C: 86 AE     .word _off004_AE86_07
- D - - - - 0x032D8E 18:AD7E: 87 AE     .word _off004_AE87_08
- D - - - - 0x032D90 18:AD80: 9B AE     .word _off004_AE9B_09
- D - - - - 0x032D92 18:AD82: F8 AE     .word _off004_AEF8_0A
- D - - - - 0x032D94 18:AD84: 06 AF     .word _off004_AF06_0B
- D - - - - 0x032D96 18:AD86: 28 AF     .word _off004_AF28_0C
- D - - - - 0x032D98 18:AD88: 30 AF     .word _off004_AF30_0D
- D - - - - 0x032D9A 18:AD8A: 39 AF     .word _off004_AF39_0E
- D - - - - 0x032D9C 18:AD8C: 42 AF     .word _off004_AF42_0F
- D - - - - 0x032D9E 18:AD8E: 61 AF     .word _off004_AF61_10
- D - - - - 0x032DA0 18:AD90: 71 AF     .word _off004_AF71_11
- D - - - - 0x032DA2 18:AD92: 89 AF     .word _off004_AF89_12
- D - - - - 0x032DA4 18:AD94: A1 AF     .word _off004_AFA1_13
- D - - - - 0x032DA6 18:AD96: B5 AF     .word _off004_AFB5_14
- D - - - - 0x032DA8 18:AD98: D3 AF     .word _off004_AFD3_15
- D - - - - 0x032DAA 18:AD9A: E6 AF     .word _off004_AFE6_16
- D - - - - 0x032DAC 18:AD9C: F7 AF     .word _off004_AFF7_17
- D - - - - 0x032DAE 18:AD9E: 2D B0     .word _off004_B02D_18
- D - - - - 0x032DB0 18:ADA0: 35 B0     .word _off004_B035_19
- D - - - - 0x032DB2 18:ADA2: 39 B0     .word _off004_B039_1A
- D - - - - 0x032DB4 18:ADA4: 4C B0     .word _off004_B04C_1B
- D - - - - 0x032DB6 18:ADA6: 5B B0     .word _off004_B05B_1C
- D - - - - 0x032DB8 18:ADA8: 72 B0     .word _off004_B072_1D
- D - - - - 0x032DBA 18:ADAA: 87 B0     .word _off004_B087_1E
- D - - - - 0x032DBC 18:ADAC: 90 B0     .word _off004_B090_1F
- D - - - - 0x032DBE 18:ADAE: A7 B0     .word _off004_B0A7_20
- D - - - - 0x032DC0 18:ADB0: BC B0     .word _off004_B0BC_21
- D - - - - 0x032DC2 18:ADB2: CA B0     .word _off004_B0CA_22
- D - - - - 0x032DC4 18:ADB4: 1B B1     .word _off004_B11B_23
- D - - - - 0x032DC6 18:ADB6: 2B B1     .word _off004_B12B_24
- D - - - - 0x032DC8 18:ADB8: 39 B1     .word _off004_B139_25
- - - - - - 0x032DCA 18:ADBA: 4A B1     .word _off004_B14A_26
- D - - - - 0x032DCC 18:ADBC: 50 B1     .word _off004_B150_27
- D - - - - 0x032DCE 18:ADBE: 5F B1     .word _off004_B15F_28
- D - - - - 0x032DD0 18:ADC0: 72 B1     .word _off004_B172_29
- D - - - - 0x032DD2 18:ADC2: 89 B1     .word _off004_B189_2A
- - - - - - 0x032DD4 18:ADC4: 9B B1     .word _off004_B19B_2B_2C_2D
- - - - - - 0x032DD6 18:ADC6: 9B B1     .word _off004_B19B_2B_2C_2D
- D - - - - 0x032DD8 18:ADC8: 9B B1     .word _off004_B19B_2B_2C_2D
- D - - - - 0x032DDA 18:ADCA: AA B1     .word _off004_B1AA_2E
- D - - - - 0x032DDC 18:ADCC: C6 B1     .word _off004_B1C6_2F
- D - - - - 0x032DDE 18:ADCE: D9 B1     .word _off004_B1D9_30
- - - - - - 0x032DE0 18:ADD0: EB B1     .word _off004_B1EB_31
- D - - - - 0x032DE2 18:ADD2: 30 B2     .word _off004_B230_32
- - - - - - 0x032DE4 18:ADD4: 40 B2     .word _off004_B240_33_34
- D - - - - 0x032DE6 18:ADD6: 40 B2     .word _off004_B240_33_34
- D - - - - 0x032DE8 18:ADD8: 56 B2     .word _off004_B256_35
- - - - - - 0x032DEA 18:ADDA: 65 B2     .word _off004_B265_36_37_38
- - - - - - 0x032DEC 18:ADDC: 65 B2     .word _off004_B265_36_37_38
- D - - - - 0x032DEE 18:ADDE: 65 B2     .word _off004_B265_36_37_38
- D - - - - 0x032DF0 18:ADE0: 89 B2     .word _off004_B289_39
- D - - - - 0x032DF2 18:ADE2: A1 B2     .word _off004_B2A1_3A
- D - - - - 0x032DF4 18:ADE4: C2 B2     .word _off004_B2C2_3B
- D - - - - 0x032DF6 18:ADE6: D2 B2     .word _off004_B2D2_3C
- D - - - - 0x032DF8 18:ADE8: D9 B2     .word _off004_B2D9_3D
- D - - - - 0x032DFA 18:ADEA: E6 B2     .word _off004_B2E6_3E
- D - - - - 0x032DFC 18:ADEC: EE B2     .word _off004_B2EE_3F
- D - - - - 0x032DFE 18:ADEE: FC B2     .word _off004_B2FC_40
- D - - - - 0x032E00 18:ADF0: 5A B3     .word _off004_B35A_41
- D - - - - 0x032E02 18:ADF2: 8A B3     .word _off004_B38A_42
- D - - - - 0x032E04 18:ADF4: B0 B3     .word _off004_B3B0_43



_off004_ADF6_00:
- D - I - - 0x032E06 18:ADF6: 21        .byte $21
- D - I - - 0x032E07 18:ADF7: 10        .byte $10
- D - I - - 0x032E08 18:ADF8: 0F        .byte $0F
- D - I - - 0x032E09 18:ADF9: 09        .byte $09
- D - I - - 0x032E0A 18:ADFA: 1F        .byte $1F
- D - I - - 0x032E0B 18:ADFB: 11        .byte $11

_off004_ADFC_01:
off_ADFC:
- D - I - - 0x032E0C 18:ADFC: 33        .byte $33
- D - I - - 0x032E0D 18:ADFD: 0D        .byte $0D
- D - I - - 0x032E0E 18:ADFE: 1A        .byte $1A
- D - I - - 0x032E0F 18:ADFF: 0E        .byte $0E
- D - I - - 0x032E10 18:AE00: 1A        .byte $1A
- D - I - - 0x032E11 18:AE01: 0F        .byte $0F
- D - I - - 0x032E12 18:AE02: 3A        .byte $3A
- D - I - - 0x032E13 18:AE03: 32        .byte $32
- D - I - - 0x032E14 18:AE04: 0E        .byte $0E
- D - I - - 0x032E15 18:AE05: 3A        .byte $3A
- D - I - - 0x032E16 18:AE06: 0F        .byte $0F
- D - I - - 0x032E17 18:AE07: 1A        .byte $1A
- D - I - - 0x032E18 18:AE08: 32        .byte $32
- D - I - - 0x032E19 18:AE09: 0D        .byte $0D
- D - I - - 0x032E1A 18:AE0A: 3A        .byte $3A
- D - I - - 0x032E1B 18:AE0B: 0E        .byte $0E
- D - I - - 0x032E1C 18:AE0C: 1A        .byte $1A
- D - I - - 0x032E1D 18:AE0D: 01        .byte $01
- D - I - - 0x032E1E 18:AE0E: FC AD     .word off_ADFC

_off004_AE10_02:
off_AE10:
- D - I - - 0x032E20 18:AE10: 21        .byte $21
- D - I - - 0x032E21 18:AE11: 09        .byte $09
- D - I - - 0x032E22 18:AE12: 11        .byte $11
- D - I - - 0x032E23 18:AE13: 09        .byte $09
- D - I - - 0x032E24 18:AE14: 09        .byte $09
- D - I - - 0x032E25 18:AE15: 0F        .byte $0F
- D - I - - 0x032E26 18:AE16: 21        .byte $21
- D - I - - 0x032E27 18:AE17: 09        .byte $09
- D - I - - 0x032E28 18:AE18: 23        .byte $23
- D - I - - 0x032E29 18:AE19: 09        .byte $09
- D - I - - 0x032E2A 18:AE1A: 09        .byte $09
- D - I - - 0x032E2B 18:AE1B: 0F        .byte $0F
- D - I - - 0x032E2C 18:AE1C: 21        .byte $21
- D - I - - 0x032E2D 18:AE1D: 09        .byte $09
- D - I - - 0x032E2E 18:AE1E: 25        .byte $25
- D - I - - 0x032E2F 18:AE1F: 09        .byte $09
- D - I - - 0x032E30 18:AE20: 09        .byte $09
- D - I - - 0x032E31 18:AE21: 0F        .byte $0F
- D - I - - 0x032E32 18:AE22: 21        .byte $21
- D - I - - 0x032E33 18:AE23: 09        .byte $09
- D - I - - 0x032E34 18:AE24: 27        .byte $27
- D - I - - 0x032E35 18:AE25: 09        .byte $09
- D - I - - 0x032E36 18:AE26: 09        .byte $09
- D - I - - 0x032E37 18:AE27: 0F        .byte $0F
- D - I - - 0x032E38 18:AE28: 21        .byte $21
- D - I - - 0x032E39 18:AE29: 09        .byte $09
- D - I - - 0x032E3A 18:AE2A: 29        .byte $29
- D - I - - 0x032E3B 18:AE2B: 09        .byte $09
- D - I - - 0x032E3C 18:AE2C: 09        .byte $09
- D - I - - 0x032E3D 18:AE2D: 0F        .byte $0F
- D - I - - 0x032E3E 18:AE2E: 01        .byte $01
- D - I - - 0x032E3F 18:AE2F: 10 AE     .word off_AE10

_off004_AE31_03:
- D - I - - 0x032E41 18:AE31: 09        .byte $09
- D - I - - 0x032E42 18:AE32: 09        .byte $09
- D - I - - 0x032E43 18:AE33: 1A        .byte $1A
off_AE34:
- D - I - - 0x032E44 18:AE34: 11        .byte $11
- D - I - - 0x032E45 18:AE35: 0D        .byte $0D
- D - I - - 0x032E46 18:AE36: 30        .byte $30
- D - I - - 0x032E47 18:AE37: 09        .byte $09
- D - I - - 0x032E48 18:AE38: 0D        .byte $0D
- D - I - - 0x032E49 18:AE39: 0F        .byte $0F
- D - I - - 0x032E4A 18:AE3A: 11        .byte $11
- D - I - - 0x032E4B 18:AE3B: 0D        .byte $0D
- D - I - - 0x032E4C 18:AE3C: 25        .byte $25
- D - I - - 0x032E4D 18:AE3D: 09        .byte $09
- D - I - - 0x032E4E 18:AE3E: 0D        .byte $0D
- D - I - - 0x032E4F 18:AE3F: 0F        .byte $0F
- D - I - - 0x032E50 18:AE40: 01        .byte $01
- D - I - - 0x032E51 18:AE41: 34 AE     .word off_AE34

_off004_AE43_04:
off_AE43:
- D - I - - 0x032E53 18:AE43: 09        .byte $09
- D - I - - 0x032E54 18:AE44: 09        .byte $09
- D - I - - 0x032E55 18:AE45: 30        .byte $30
- D - I - - 0x032E56 18:AE46: 09        .byte $09
- D - I - - 0x032E57 18:AE47: 09        .byte $09
- D - I - - 0x032E58 18:AE48: 0F        .byte $0F
- D - I - - 0x032E59 18:AE49: 21        .byte $21
- D - I - - 0x032E5A 18:AE4A: 09        .byte $09
- D - I - - 0x032E5B 18:AE4B: 25        .byte $25
- D - I - - 0x032E5C 18:AE4C: 09        .byte $09
- D - I - - 0x032E5D 18:AE4D: 09        .byte $09
- D - I - - 0x032E5E 18:AE4E: 30        .byte $30
- D - I - - 0x032E5F 18:AE4F: 09        .byte $09
- D - I - - 0x032E60 18:AE50: 09        .byte $09
- D - I - - 0x032E61 18:AE51: 0F        .byte $0F
- D - I - - 0x032E62 18:AE52: 21        .byte $21
- D - I - - 0x032E63 18:AE53: 09        .byte $09
- D - I - - 0x032E64 18:AE54: 38        .byte $38
- D - I - - 0x032E65 18:AE55: 09        .byte $09
- D - I - - 0x032E66 18:AE56: 09        .byte $09
- D - I - - 0x032E67 18:AE57: 30        .byte $30
- D - I - - 0x032E68 18:AE58: 09        .byte $09
- D - I - - 0x032E69 18:AE59: 09        .byte $09
- D - I - - 0x032E6A 18:AE5A: 0F        .byte $0F
- D - I - - 0x032E6B 18:AE5B: 01        .byte $01
- D - I - - 0x032E6C 18:AE5C: 43 AE     .word off_AE43

_off004_AE5E_05:
- D - I - - 0x032E6E 18:AE5E: 09        .byte $09
- D - I - - 0x032E6F 18:AE5F: 09        .byte $09
- D - I - - 0x032E70 18:AE60: 38        .byte $38
- D - I - - 0x032E71 18:AE61: 09        .byte $09
- D - I - - 0x032E72 18:AE62: 09        .byte $09
- D - I - - 0x032E73 18:AE63: 21        .byte $21
- D - I - - 0x032E74 18:AE64: 09        .byte $09
- D - I - - 0x032E75 18:AE65: 09        .byte $09
- D - I - - 0x032E76 18:AE66: 38        .byte $38
- D - I - - 0x032E77 18:AE67: 09        .byte $09
- D - I - - 0x032E78 18:AE68: 09        .byte $09
- D - I - - 0x032E79 18:AE69: 21        .byte $21
- D - I - - 0x032E7A 18:AE6A: 09        .byte $09
- D - I - - 0x032E7B 18:AE6B: 09        .byte $09
- D - I - - 0x032E7C 18:AE6C: 38        .byte $38
- D - I - - 0x032E7D 18:AE6D: 09        .byte $09
- D - I - - 0x032E7E 18:AE6E: 09        .byte $09
- D - I - - 0x032E7F 18:AE6F: 21        .byte $21
- D - I - - 0x032E80 18:AE70: 00        .byte $00

_off004_AE71_06:
- D - I - - 0x032E81 18:AE71: 1C        .byte $1C
- D - I - - 0x032E82 18:AE72: 09        .byte $09
- D - I - - 0x032E83 18:AE73: 1A        .byte $1A
- D - I - - 0x032E84 18:AE74: 0A        .byte $0A
- D - I - - 0x032E85 18:AE75: 31        .byte $31
- D - I - - 0x032E86 18:AE76: 0B        .byte $0B
- D - I - - 0x032E87 18:AE77: 30        .byte $30
- D - I - - 0x032E88 18:AE78: 0D        .byte $0D
- D - I - - 0x032E89 18:AE79: 1A        .byte $1A
- D - I - - 0x032E8A 18:AE7A: 42        .byte $42
- D - I - - 0x032E8B 18:AE7B: 0E        .byte $0E
- D - I - - 0x032E8C 18:AE7C: 0F        .byte $0F
- D - I - - 0x032E8D 18:AE7D: 0F        .byte $0F
- D - I - - 0x032E8E 18:AE7E: 0F        .byte $0F
- D - I - - 0x032E8F 18:AE7F: 31        .byte $31
- D - I - - 0x032E90 18:AE80: 0E        .byte $0E
- D - I - - 0x032E91 18:AE81: 1A        .byte $1A
- D - I - - 0x032E92 18:AE82: 19        .byte $19
- D - I - - 0x032E93 18:AE83: 0F        .byte $0F
- D - I - - 0x032E94 18:AE84: 1A        .byte $1A
- D - I - - 0x032E95 18:AE85: 00        .byte $00

_off004_AE86_07:
- - - - - - 0x032E96 18:AE86: 00        .byte $00

_off004_AE87_08:
off_AE87:
- D - I - - 0x032E97 18:AE87: 23        .byte $23
- D - I - - 0x032E98 18:AE88: 0D        .byte $0D
- D - I - - 0x032E99 18:AE89: 1A        .byte $1A
- D - I - - 0x032E9A 18:AE8A: 0E        .byte $0E
- D - I - - 0x032E9B 18:AE8B: 1A        .byte $1A
- D - I - - 0x032E9C 18:AE8C: 0F        .byte $0F
- D - I - - 0x032E9D 18:AE8D: 3A        .byte $3A
- D - I - - 0x032E9E 18:AE8E: 22        .byte $22
- D - I - - 0x032E9F 18:AE8F: 0E        .byte $0E
- D - I - - 0x032EA0 18:AE90: 3A        .byte $3A
- D - I - - 0x032EA1 18:AE91: 0F        .byte $0F
- D - I - - 0x032EA2 18:AE92: 1A        .byte $1A
- D - I - - 0x032EA3 18:AE93: 22        .byte $22
- D - I - - 0x032EA4 18:AE94: 0D        .byte $0D
- D - I - - 0x032EA5 18:AE95: 3A        .byte $3A
- D - I - - 0x032EA6 18:AE96: 0E        .byte $0E
- D - I - - 0x032EA7 18:AE97: 1A        .byte $1A
- D - I - - 0x032EA8 18:AE98: 01        .byte $01
- D - I - - 0x032EA9 18:AE99: 87 AE     .word off_AE87

_off004_AE9B_09:
- D - I - - 0x032EAB 18:AE9B: 27        .byte $27
- D - I - - 0x032EAC 18:AE9C: 0D        .byte $0D
- D - I - - 0x032EAD 18:AE9D: 0F        .byte $0F
- D - I - - 0x032EAE 18:AE9E: 11        .byte $11
- D - I - - 0x032EAF 18:AE9F: 02        .byte $02
- D - I - - 0x032EB0 18:AEA0: 12        .byte $12
- D - I - - 0x032EB1 18:AEA1: 38        .byte $38
- D - I - - 0x032EB2 18:AEA2: 15        .byte $15
- D - I - - 0x032EB3 18:AEA3: 02        .byte $02
- D - I - - 0x032EB4 18:AEA4: 16        .byte $16
- D - I - - 0x032EB5 18:AEA5: 27        .byte $27
- D - I - - 0x032EB6 18:AEA6: 19        .byte $19
- D - I - - 0x032EB7 18:AEA7: 02        .byte $02
- D - I - - 0x032EB8 18:AEA8: 1A        .byte $1A
- D - I - - 0x032EB9 18:AEA9: 16        .byte $16
- D - I - - 0x032EBA 18:AEAA: 21        .byte $21
- D - I - - 0x032EBB 18:AEAB: 1E        .byte $1E
- D - I - - 0x032EBC 18:AEAC: 3C        .byte $3C
- D - I - - 0x032EBD 18:AEAD: 21        .byte $21
- D - I - - 0x032EBE 18:AEAE: 1E        .byte $1E
- D - I - - 0x032EBF 18:AEAF: 21        .byte $21
- D - I - - 0x032EC0 18:AEB0: 25        .byte $25
- D - I - - 0x032EC1 18:AEB1: 1E        .byte $1E
- D - I - - 0x032EC2 18:AEB2: 22        .byte $22
- D - I - - 0x032EC3 18:AEB3: 12        .byte $12
- D - I - - 0x032EC4 18:AEB4: 27        .byte $27
- D - I - - 0x032EC5 18:AEB5: 16        .byte $16
- D - I - - 0x032EC6 18:AEB6: 16        .byte $16
- D - I - - 0x032EC7 18:AEB7: 19        .byte $19
- D - I - - 0x032EC8 18:AEB8: 12        .byte $12
- D - I - - 0x032EC9 18:AEB9: 1A        .byte $1A
- D - I - - 0x032ECA 18:AEBA: 0F        .byte $0F
- D - I - - 0x032ECB 18:AEBB: 22        .byte $22
- D - I - - 0x032ECC 18:AEBC: 1E        .byte $1E
- D - I - - 0x032ECD 18:AEBD: 3C        .byte $3C
- D - I - - 0x032ECE 18:AEBE: 19        .byte $19
- D - I - - 0x032ECF 18:AEBF: 02        .byte $02
- D - I - - 0x032ED0 18:AEC0: 25        .byte $25
- D - I - - 0x032ED1 18:AEC1: 1E        .byte $1E
- D - I - - 0x032ED2 18:AEC2: 22        .byte $22
- D - I - - 0x032ED3 18:AEC3: 12        .byte $12
- D - I - - 0x032ED4 18:AEC4: 16        .byte $16
- D - I - - 0x032ED5 18:AEC5: 15        .byte $15
- D - I - - 0x032ED6 18:AEC6: 12        .byte $12
- D - I - - 0x032ED7 18:AEC7: 16        .byte $16
- D - I - - 0x032ED8 18:AEC8: 0F        .byte $0F
- D - I - - 0x032ED9 18:AEC9: 19        .byte $19
- D - I - - 0x032EDA 18:AECA: 12        .byte $12
- D - I - - 0x032EDB 18:AECB: 23        .byte $23
- D - I - - 0x032EDC 18:AECC: 1E        .byte $1E
- D - I - - 0x032EDD 18:AECD: 21        .byte $21
- D - I - - 0x032EDE 18:AECE: 15        .byte $15
- D - I - - 0x032EDF 18:AECF: 02        .byte $02
- D - I - - 0x032EE0 18:AED0: 19        .byte $19
- D - I - - 0x032EE1 18:AED1: 02        .byte $02
- D - I - - 0x032EE2 18:AED2: 25        .byte $25
- D - I - - 0x032EE3 18:AED3: 1E        .byte $1E
- D - I - - 0x032EE4 18:AED4: 3C        .byte $3C
- D - I - - 0x032EE5 18:AED5: 11        .byte $11
- D - I - - 0x032EE6 18:AED6: 12        .byte $12
- D - I - - 0x032EE7 18:AED7: 12        .byte $12
- D - I - - 0x032EE8 18:AED8: 0F        .byte $0F
- D - I - - 0x032EE9 18:AED9: 15        .byte $15
- D - I - - 0x032EEA 18:AEDA: 12        .byte $12
- D - I - - 0x032EEB 18:AEDB: 19        .byte $19
- D - I - - 0x032EEC 18:AEDC: 12        .byte $12
- D - I - - 0x032EED 18:AEDD: 24        .byte $24
- D - I - - 0x032EEE 18:AEDE: 1E        .byte $1E
- D - I - - 0x032EEF 18:AEDF: 38        .byte $38
- D - I - - 0x032EF0 18:AEE0: 11        .byte $11
- D - I - - 0x032EF1 18:AEE1: 02        .byte $02
- D - I - - 0x032EF2 18:AEE2: 15        .byte $15
- D - I - - 0x032EF3 18:AEE3: 02        .byte $02
- D - I - - 0x032EF4 18:AEE4: 19        .byte $19
- D - I - - 0x032EF5 18:AEE5: 02        .byte $02
- D - I - - 0x032EF6 18:AEE6: 23        .byte $23
- D - I - - 0x032EF7 18:AEE7: 11        .byte $11
- D - I - - 0x032EF8 18:AEE8: 12        .byte $12
- D - I - - 0x032EF9 18:AEE9: 15        .byte $15
- D - I - - 0x032EFA 18:AEEA: 12        .byte $12
- D - I - - 0x032EFB 18:AEEB: 19        .byte $19
- D - I - - 0x032EFC 18:AEEC: 0F        .byte $0F
- D - I - - 0x032EFD 18:AEED: 22        .byte $22
- D - I - - 0x032EFE 18:AEEE: 11        .byte $11
- D - I - - 0x032EFF 18:AEEF: 02        .byte $02
- D - I - - 0x032F00 18:AEF0: 15        .byte $15
- D - I - - 0x032F01 18:AEF1: 0F        .byte $0F
- D - I - - 0x032F02 18:AEF2: 22        .byte $22
- D - I - - 0x032F03 18:AEF3: 1E        .byte $1E
- D - I - - 0x032F04 18:AEF4: 30        .byte $30
- D - I - - 0x032F05 18:AEF5: 11        .byte $11
- D - I - - 0x032F06 18:AEF6: 0F        .byte $0F
- D - I - - 0x032F07 18:AEF7: 00        .byte $00

_off004_AEF8_0A:
- D - I - - 0x032F08 18:AEF8: 0A        .byte $0A
- D - I - - 0x032F09 18:AEF9: 0D        .byte $0D
- D - I - - 0x032F0A 18:AEFA: 1A        .byte $1A
- D - I - - 0x032F0B 18:AEFB: 0E        .byte $0E
- D - I - - 0x032F0C 18:AEFC: 10        .byte $10
off_AEFD:
- D - I - - 0x032F0D 18:AEFD: 11        .byte $11
- D - I - - 0x032F0E 18:AEFE: 01        .byte $01
- D - I - - 0x032F0F 18:AEFF: 0F        .byte $0F
- D - I - - 0x032F10 18:AF00: 11        .byte $11
- D - I - - 0x032F11 18:AF01: 01        .byte $01
- D - I - - 0x032F12 18:AF02: 24        .byte $24
- D - I - - 0x032F13 18:AF03: 01        .byte $01
- D - I - - 0x032F14 18:AF04: FD AE     .word off_AEFD

_off004_AF06_0B:
- D - I - - 0x032F16 18:AF06: 0B        .byte $0B
- D - I - - 0x032F17 18:AF07: 09        .byte $09
- D - I - - 0x032F18 18:AF08: 11        .byte $11
- D - I - - 0x032F19 18:AF09: 0A        .byte $0A
- D - I - - 0x032F1A 18:AF0A: 21        .byte $21
- D - I - - 0x032F1B 18:AF0B: 0B        .byte $0B
- D - I - - 0x032F1C 18:AF0C: 31        .byte $31
off_AF0D:
- D - I - - 0x032F1D 18:AF0D: 24        .byte $24
- D - I - - 0x032F1E 18:AF0E: 0D        .byte $0D
- D - I - - 0x032F1F 18:AF0F: 1A        .byte $1A
- D - I - - 0x032F20 18:AF10: 0E        .byte $0E
- D - I - - 0x032F21 18:AF11: 1A        .byte $1A
- D - I - - 0x032F22 18:AF12: 0F        .byte $0F
- D - I - - 0x032F23 18:AF13: 3A        .byte $3A
- D - I - - 0x032F24 18:AF14: 1E        .byte $1E
- D - I - - 0x032F25 18:AF15: 26        .byte $26
- D - I - - 0x032F26 18:AF16: 22        .byte $22
- D - I - - 0x032F27 18:AF17: 0E        .byte $0E
- D - I - - 0x032F28 18:AF18: 3A        .byte $3A
- D - I - - 0x032F29 18:AF19: 0F        .byte $0F
- D - I - - 0x032F2A 18:AF1A: 1A        .byte $1A
- D - I - - 0x032F2B 18:AF1B: 13        .byte $13
- D - I - - 0x032F2C 18:AF1C: 0D        .byte $0D
- D - I - - 0x032F2D 18:AF1D: 3A        .byte $3A
- D - I - - 0x032F2E 18:AF1E: 0E        .byte $0E
- D - I - - 0x032F2F 18:AF1F: 1A        .byte $1A
- D - I - - 0x032F30 18:AF20: 1E        .byte $1E
- D - I - - 0x032F31 18:AF21: 30        .byte $30
- D - I - - 0x032F32 18:AF22: 11        .byte $11
- D - I - - 0x032F33 18:AF23: 1E        .byte $1E
- D - I - - 0x032F34 18:AF24: 37        .byte $37
- D - I - - 0x032F35 18:AF25: 01        .byte $01
- D - I - - 0x032F36 18:AF26: 0D AF     .word off_AF0D

_off004_AF28_0C:
- D - I - - 0x032F38 18:AF28: 0B        .byte $0B
- D - I - - 0x032F39 18:AF29: 09        .byte $09
- D - I - - 0x032F3A 18:AF2A: 15        .byte $15
- D - I - - 0x032F3B 18:AF2B: 0A        .byte $0A
- D - I - - 0x032F3C 18:AF2C: 25        .byte $25
- D - I - - 0x032F3D 18:AF2D: 0B        .byte $0B
- D - I - - 0x032F3E 18:AF2E: 34        .byte $34
- D - I - - 0x032F3F 18:AF2F: 00        .byte $00

_off004_AF30_0D:
off_AF30:
- D - I - - 0x032F40 18:AF30: 19        .byte $19
- D - I - - 0x032F41 18:AF31: 0D        .byte $0D
- D - I - - 0x032F42 18:AF32: 0F        .byte $0F
- D - I - - 0x032F43 18:AF33: 19        .byte $19
- D - I - - 0x032F44 18:AF34: 0D        .byte $0D
- D - I - - 0x032F45 18:AF35: 25        .byte $25
- D - I - - 0x032F46 18:AF36: 01        .byte $01
- D - I - - 0x032F47 18:AF37: 30 AF     .word off_AF30

_off004_AF39_0E:
off_AF39:
- D - I - - 0x032F49 18:AF39: 21        .byte $21
- D - I - - 0x032F4A 18:AF3A: 0D        .byte $0D
- D - I - - 0x032F4B 18:AF3B: 25        .byte $25
- D - I - - 0x032F4C 18:AF3C: 21        .byte $21
- D - I - - 0x032F4D 18:AF3D: 0D        .byte $0D
- D - I - - 0x032F4E 18:AF3E: 30        .byte $30
- D - I - - 0x032F4F 18:AF3F: 01        .byte $01
- D - I - - 0x032F50 18:AF40: 39 AF     .word off_AF39

_off004_AF42_0F:
off_AF42:
- D - I - - 0x032F52 18:AF42: 12        .byte $12
- D - I - - 0x032F53 18:AF43: 0D        .byte $0D
- D - I - - 0x032F54 18:AF44: 0F        .byte $0F
- D - I - - 0x032F55 18:AF45: 01        .byte $01
- D - I - - 0x032F56 18:AF46: 30        .byte $30
- D - I - - 0x032F57 18:AF47: 09        .byte $09
- D - I - - 0x032F58 18:AF48: 0D        .byte $0D
- D - I - - 0x032F59 18:AF49: 30        .byte $30
- D - I - - 0x032F5A 18:AF4A: 09        .byte $09
- D - I - - 0x032F5B 18:AF4B: 01        .byte $01
- D - I - - 0x032F5C 18:AF4C: 25        .byte $25
- D - I - - 0x032F5D 18:AF4D: 11        .byte $11
- D - I - - 0x032F5E 18:AF4E: 0D        .byte $0D
- D - I - - 0x032F5F 18:AF4F: 0F        .byte $0F
- D - I - - 0x032F60 18:AF50: 12        .byte $12
- D - I - - 0x032F61 18:AF51: 01        .byte $01
- D - I - - 0x032F62 18:AF52: 30        .byte $30
- D - I - - 0x032F63 18:AF53: 0D        .byte $0D
- D - I - - 0x032F64 18:AF54: 30        .byte $30
- D - I - - 0x032F65 18:AF55: 09        .byte $09
- D - I - - 0x032F66 18:AF56: 0D        .byte $0D
- D - I - - 0x032F67 18:AF57: 0F        .byte $0F
- D - I - - 0x032F68 18:AF58: 09        .byte $09
- D - I - - 0x032F69 18:AF59: 01        .byte $01
- D - I - - 0x032F6A 18:AF5A: 25        .byte $25
- D - I - - 0x032F6B 18:AF5B: 11        .byte $11
- D - I - - 0x032F6C 18:AF5C: 0D        .byte $0D
- D - I - - 0x032F6D 18:AF5D: 30        .byte $30
- D - I - - 0x032F6E 18:AF5E: 01        .byte $01
- D - I - - 0x032F6F 18:AF5F: 42 AF     .word off_AF42

_off004_AF61_10:
- D - I - - 0x032F71 18:AF61: 0F        .byte $0F
- D - I - - 0x032F72 18:AF62: 0D        .byte $0D
- D - I - - 0x032F73 18:AF63: 10        .byte $10
- D - I - - 0x032F74 18:AF64: 12        .byte $12
- D - I - - 0x032F75 18:AF65: 0F        .byte $0F
- D - I - - 0x032F76 18:AF66: 13        .byte $13
- D - I - - 0x032F77 18:AF67: 30        .byte $30
- D - I - - 0x032F78 18:AF68: 16        .byte $16
- D - I - - 0x032F79 18:AF69: 32        .byte $32
- D - I - - 0x032F7A 18:AF6A: 17        .byte $17
- D - I - - 0x032F7B 18:AF6B: 30        .byte $30
- D - I - - 0x032F7C 18:AF6C: 1A        .byte $1A
- D - I - - 0x032F7D 18:AF6D: 31        .byte $31
- D - I - - 0x032F7E 18:AF6E: 1B        .byte $1B
- D - I - - 0x032F7F 18:AF6F: 30        .byte $30
- D - I - - 0x032F80 18:AF70: 00        .byte $00

_off004_AF71_11:
off_AF71:
- D - I - - 0x032F81 18:AF71: 0A        .byte $0A
- D - I - - 0x032F82 18:AF72: 1D        .byte $1D
- D - I - - 0x032F83 18:AF73: 00        .byte $00
- D - I - - 0x032F84 18:AF74: 1E        .byte $1E
- D - I - - 0x032F85 18:AF75: 0F        .byte $0F
- D - I - - 0x032F86 18:AF76: 4A        .byte $4A
- D - I - - 0x032F87 18:AF77: 1D        .byte $1D
- D - I - - 0x032F88 18:AF78: 01        .byte $01
- D - I - - 0x032F89 18:AF79: 1E        .byte $1E
- D - I - - 0x032F8A 18:AF7A: 00        .byte $00
- D - I - - 0x032F8B 18:AF7B: 4A        .byte $4A
- D - I - - 0x032F8C 18:AF7C: 1D        .byte $1D
- D - I - - 0x032F8D 18:AF7D: 00        .byte $00
- D - I - - 0x032F8E 18:AF7E: 1E        .byte $1E
- D - I - - 0x032F8F 18:AF7F: 01        .byte $01
- D - I - - 0x032F90 18:AF80: 49        .byte $49
- D - I - - 0x032F91 18:AF81: 1E        .byte $1E
- D - I - - 0x032F92 18:AF82: 31        .byte $31
- D - I - - 0x032F93 18:AF83: 4A        .byte $4A
- D - I - - 0x032F94 18:AF84: 1D        .byte $1D
- D - I - - 0x032F95 18:AF85: 0F        .byte $0F
- D - I - - 0x032F96 18:AF86: 1E        .byte $1E
- D - I - - 0x032F97 18:AF87: 30        .byte $30
- D - I - - 0x032F98 18:AF88: 00        .byte $00

_off004_AF89_12:
off_AF89:
- D - I - - 0x032F99 18:AF89: 31        .byte $31
- D - I - - 0x032F9A 18:AF8A: 01        .byte $01
- D - I - - 0x032F9B 18:AF8B: 11        .byte $11
- D - I - - 0x032F9C 18:AF8C: 31        .byte $31
- D - I - - 0x032F9D 18:AF8D: 01        .byte $01
- D - I - - 0x032F9E 18:AF8E: 23        .byte $23
- D - I - - 0x032F9F 18:AF8F: 31        .byte $31
- D - I - - 0x032FA0 18:AF90: 01        .byte $01
- D - I - - 0x032FA1 18:AF91: 25        .byte $25
- D - I - - 0x032FA2 18:AF92: 31        .byte $31
- D - I - - 0x032FA3 18:AF93: 01        .byte $01
- D - I - - 0x032FA4 18:AF94: 37        .byte $37
- D - I - - 0x032FA5 18:AF95: 31        .byte $31
- D - I - - 0x032FA6 18:AF96: 01        .byte $01
- D - I - - 0x032FA7 18:AF97: 2B        .byte $2B
- D - I - - 0x032FA8 18:AF98: 31        .byte $31
- D - I - - 0x032FA9 18:AF99: 01        .byte $01
- D - I - - 0x032FAA 18:AF9A: 2C        .byte $2C
- D - I - - 0x032FAB 18:AF9B: 31        .byte $31
- D - I - - 0x032FAC 18:AF9C: 01        .byte $01
- D - I - - 0x032FAD 18:AF9D: 22        .byte $22
- D - I - - 0x032FAE 18:AF9E: 01        .byte $01
- D - I - - 0x032FAF 18:AF9F: 89 AF     .word off_AF89

_off004_AFA1_13:
off_AFA1:
- D - I - - 0x032FB1 18:AFA1: 23        .byte $23
- D - I - - 0x032FB2 18:AFA2: 0D        .byte $0D
- D - I - - 0x032FB3 18:AFA3: 1A        .byte $1A
- D - I - - 0x032FB4 18:AFA4: 0E        .byte $0E
- D - I - - 0x032FB5 18:AFA5: 1A        .byte $1A
- D - I - - 0x032FB6 18:AFA6: 0F        .byte $0F
- D - I - - 0x032FB7 18:AFA7: 3A        .byte $3A
- D - I - - 0x032FB8 18:AFA8: 22        .byte $22
- D - I - - 0x032FB9 18:AFA9: 0E        .byte $0E
- D - I - - 0x032FBA 18:AFAA: 3A        .byte $3A
- D - I - - 0x032FBB 18:AFAB: 0F        .byte $0F
- D - I - - 0x032FBC 18:AFAC: 1A        .byte $1A
- D - I - - 0x032FBD 18:AFAD: 22        .byte $22
- D - I - - 0x032FBE 18:AFAE: 0D        .byte $0D
- D - I - - 0x032FBF 18:AFAF: 3A        .byte $3A
- D - I - - 0x032FC0 18:AFB0: 0E        .byte $0E
- D - I - - 0x032FC1 18:AFB1: 1A        .byte $1A
- D - I - - 0x032FC2 18:AFB2: 01        .byte $01
- D - I - - 0x032FC3 18:AFB3: A1 AF     .word off_AFA1

_off004_AFB5_14:
- D - I - - 0x032FC5 18:AFB5: 44        .byte $44
- D - I - - 0x032FC6 18:AFB6: 0D        .byte $0D
- D - I - - 0x032FC7 18:AFB7: 0F        .byte $0F
- D - I - - 0x032FC8 18:AFB8: 1B        .byte $1B
- D - I - - 0x032FC9 18:AFB9: 30        .byte $30
- D - I - - 0x032FCA 18:AFBA: 1A        .byte $1A
- D - I - - 0x032FCB 18:AFBB: 36        .byte $36
- D - I - - 0x032FCC 18:AFBC: 19        .byte $19
- D - I - - 0x032FCD 18:AFBD: 21        .byte $21
- D - I - - 0x032FCE 18:AFBE: 23        .byte $23
- D - I - - 0x032FCF 18:AFBF: 1B        .byte $1B
- D - I - - 0x032FD0 18:AFC0: 36        .byte $36
- D - I - - 0x032FD1 18:AFC1: 1A        .byte $1A
- D - I - - 0x032FD2 18:AFC2: 21        .byte $21
- D - I - - 0x032FD3 18:AFC3: 19        .byte $19
- D - I - - 0x032FD4 18:AFC4: 11        .byte $11
- D - I - - 0x032FD5 18:AFC5: 1B        .byte $1B
- D - I - - 0x032FD6 18:AFC6: 1B        .byte $1B
- D - I - - 0x032FD7 18:AFC7: 21        .byte $21
- D - I - - 0x032FD8 18:AFC8: 1A        .byte $1A
- D - I - - 0x032FD9 18:AFC9: 11        .byte $11
- D - I - - 0x032FDA 18:AFCA: 19        .byte $19
- D - I - - 0x032FDB 18:AFCB: 0F        .byte $0F
- D - I - - 0x032FDC 18:AFCC: 11        .byte $11
- D - I - - 0x032FDD 18:AFCD: 1A        .byte $1A
- D - I - - 0x032FDE 18:AFCE: 0F        .byte $0F
- D - I - - 0x032FDF 18:AFCF: 09        .byte $09
- D - I - - 0x032FE0 18:AFD0: 1B        .byte $1B
- D - I - - 0x032FE1 18:AFD1: 0F        .byte $0F
- D - I - - 0x032FE2 18:AFD2: 00        .byte $00

_off004_AFD3_15:
- D - I - - 0x032FE3 18:AFD3: 0B        .byte $0B
- D - I - - 0x032FE4 18:AFD4: 09        .byte $09
- D - I - - 0x032FE5 18:AFD5: 15        .byte $15
- D - I - - 0x032FE6 18:AFD6: 0A        .byte $0A
- D - I - - 0x032FE7 18:AFD7: 25        .byte $25
- D - I - - 0x032FE8 18:AFD8: 0B        .byte $0B
- D - I - - 0x032FE9 18:AFD9: 38        .byte $38
off_AFDA:
- D - I - - 0x032FEA 18:AFDA: 41        .byte $41
- D - I - - 0x032FEB 18:AFDB: 1E        .byte $1E
- D - I - - 0x032FEC 18:AFDC: 15        .byte $15
- D - I - - 0x032FED 18:AFDD: 21        .byte $21
- D - I - - 0x032FEE 18:AFDE: 1E        .byte $1E
- D - I - - 0x032FEF 18:AFDF: 30        .byte $30
- D - I - - 0x032FF0 18:AFE0: 21        .byte $21
- D - I - - 0x032FF1 18:AFE1: 1E        .byte $1E
- D - I - - 0x032FF2 18:AFE2: 27        .byte $27
- D - I - - 0x032FF3 18:AFE3: 01        .byte $01
- D - I - - 0x032FF4 18:AFE4: DA AF     .word off_AFDA

_off004_AFE6_16:
- D - I - - 0x032FF6 18:AFE6: 21        .byte $21
- D - I - - 0x032FF7 18:AFE7: 10        .byte $10
- D - I - - 0x032FF8 18:AFE8: 0F        .byte $0F
- D - I - - 0x032FF9 18:AFE9: 0A        .byte $0A
- D - I - - 0x032FFA 18:AFEA: 1F        .byte $1F
- D - I - - 0x032FFB 18:AFEB: 11        .byte $11
- D - I - - 0x032FFC 18:AFEC: 16        .byte $16
- D - I - - 0x032FFD 18:AFED: 30        .byte $30
off_AFEE:
- D - I - - 0x032FFE 18:AFEE: 39        .byte $39
- D - I - - 0x032FFF 18:AFEF: 16        .byte $16
- D - I - - 0x033000 18:AFF0: 30        .byte $30
- D - I - - 0x033001 18:AFF1: 19        .byte $19
- D - I - - 0x033002 18:AFF2: 16        .byte $16
- D - I - - 0x033003 18:AFF3: 0F        .byte $0F
- D - I - - 0x033004 18:AFF4: 01        .byte $01
- D - I - - 0x033005 18:AFF5: EE AF     .word off_AFEE

_off004_AFF7_17:
- D - I - - 0x033007 18:AFF7: 0B        .byte $0B
- D - I - - 0x033008 18:AFF8: 09        .byte $09
- D - I - - 0x033009 18:AFF9: 11        .byte $11
- D - I - - 0x03300A 18:AFFA: 0A        .byte $0A
- D - I - - 0x03300B 18:AFFB: 21        .byte $21
- D - I - - 0x03300C 18:AFFC: 0B        .byte $0B
- D - I - - 0x03300D 18:AFFD: 31        .byte $31
off_AFFE:
- D - I - - 0x03300E 18:AFFE: 34        .byte $34
- D - I - - 0x03300F 18:AFFF: 0D        .byte $0D
- D - I - - 0x033010 18:B000: 1A        .byte $1A
- D - I - - 0x033011 18:B001: 0E        .byte $0E
- D - I - - 0x033012 18:B002: 1A        .byte $1A
- D - I - - 0x033013 18:B003: 0F        .byte $0F
- D - I - - 0x033014 18:B004: 3A        .byte $3A
- D - I - - 0x033015 18:B005: 1D        .byte $1D
- D - I - - 0x033016 18:B006: 31        .byte $31
- D - I - - 0x033017 18:B007: 33        .byte $33
- D - I - - 0x033018 18:B008: 0E        .byte $0E
- D - I - - 0x033019 18:B009: 3A        .byte $3A
- D - I - - 0x03301A 18:B00A: 0F        .byte $0F
- D - I - - 0x03301B 18:B00B: 1A        .byte $1A
- D - I - - 0x03301C 18:B00C: 1D        .byte $1D
- D - I - - 0x03301D 18:B00D: 0F        .byte $0F
- D - I - - 0x03301E 18:B00E: 33        .byte $33
- D - I - - 0x03301F 18:B00F: 0D        .byte $0D
- D - I - - 0x033020 18:B010: 3A        .byte $3A
- D - I - - 0x033021 18:B011: 0E        .byte $0E
- D - I - - 0x033022 18:B012: 1A        .byte $1A
- D - I - - 0x033023 18:B013: 1E        .byte $1E
- D - I - - 0x033024 18:B014: 10        .byte $10
- D - I - - 0x033025 18:B015: 33        .byte $33
- D - I - - 0x033026 18:B016: 0D        .byte $0D
- D - I - - 0x033027 18:B017: 1A        .byte $1A
- D - I - - 0x033028 18:B018: 0F        .byte $0F
- D - I - - 0x033029 18:B019: 3A        .byte $3A
- D - I - - 0x03302A 18:B01A: 1E        .byte $1E
- D - I - - 0x03302B 18:B01B: 0F        .byte $0F
- D - I - - 0x03302C 18:B01C: 33        .byte $33
- D - I - - 0x03302D 18:B01D: 0E        .byte $0E
- D - I - - 0x03302E 18:B01E: 3A        .byte $3A
- D - I - - 0x03302F 18:B01F: 0F        .byte $0F
- D - I - - 0x033030 18:B020: 1A        .byte $1A
- D - I - - 0x033031 18:B021: 1D        .byte $1D
- D - I - - 0x033032 18:B022: 10        .byte $10
- D - I - - 0x033033 18:B023: 33        .byte $33
- D - I - - 0x033034 18:B024: 0D        .byte $0D
- D - I - - 0x033035 18:B025: 3A        .byte $3A
- D - I - - 0x033036 18:B026: 0E        .byte $0E
- D - I - - 0x033037 18:B027: 1A        .byte $1A
- D - I - - 0x033038 18:B028: 1D        .byte $1D
- D - I - - 0x033039 18:B029: 0F        .byte $0F
- D - I - - 0x03303A 18:B02A: 01        .byte $01
- D - I - - 0x03303B 18:B02B: FE AF     .word off_AFFE

_off004_B02D_18:
- D - I - - 0x03303D 18:B02D: 0B        .byte $0B
- D - I - - 0x03303E 18:B02E: 09        .byte $09
- D - I - - 0x03303F 18:B02F: 11        .byte $11
- D - I - - 0x033040 18:B030: 0A        .byte $0A
- D - I - - 0x033041 18:B031: 2B        .byte $2B
- D - I - - 0x033042 18:B032: 0B        .byte $0B
- D - I - - 0x033043 18:B033: 31        .byte $31
- D - I - - 0x033044 18:B034: 00        .byte $00

_off004_B035_19:
- D - I - - 0x033045 18:B035: 09        .byte $09
- D - I - - 0x033046 18:B036: 05        .byte $05
- D - I - - 0x033047 18:B037: 1A        .byte $1A
- D - I - - 0x033048 18:B038: 00        .byte $00

_off004_B039_1A:
off_B039:
- D - I - - 0x033049 18:B039: 23        .byte $23
- D - I - - 0x03304A 18:B03A: 09        .byte $09
- D - I - - 0x03304B 18:B03B: 25        .byte $25
- D - I - - 0x03304C 18:B03C: 0A        .byte $0A
- D - I - - 0x03304D 18:B03D: 28        .byte $28
- D - I - - 0x03304E 18:B03E: 0B        .byte $0B
- D - I - - 0x03304F 18:B03F: 35        .byte $35
- D - I - - 0x033050 18:B040: 21        .byte $21
- D - I - - 0x033051 18:B041: 09        .byte $09
- D - I - - 0x033052 18:B042: 15        .byte $15
- D - I - - 0x033053 18:B043: 11        .byte $11
- D - I - - 0x033054 18:B044: 09        .byte $09
- D - I - - 0x033055 18:B045: 05        .byte $05
- D - I - - 0x033056 18:B046: 21        .byte $21
- D - I - - 0x033057 18:B047: 09        .byte $09
- D - I - - 0x033058 18:B048: 15        .byte $15
- D - I - - 0x033059 18:B049: 01        .byte $01
- D - I - - 0x03305A 18:B04A: 39 B0     .word off_B039

_off004_B04C_1B:
- D - I - - 0x03305C 18:B04C: 21        .byte $21
- D - I - - 0x03305D 18:B04D: 10        .byte $10
- D - I - - 0x03305E 18:B04E: 0F        .byte $0F
- D - I - - 0x03305F 18:B04F: 0D        .byte $0D
- D - I - - 0x033060 18:B050: 11        .byte $11
- D - I - - 0x033061 18:B051: 0F        .byte $0F
- D - I - - 0x033062 18:B052: 13        .byte $13
- D - I - - 0x033063 18:B053: 30        .byte $30
- D - I - - 0x033064 18:B054: 15        .byte $15
- D - I - - 0x033065 18:B055: 0F        .byte $0F
- D - I - - 0x033066 18:B056: 17        .byte $17
- D - I - - 0x033067 18:B057: 25        .byte $25
- D - I - - 0x033068 18:B058: 1F        .byte $1F
- D - I - - 0x033069 18:B059: 30        .byte $30
- D - I - - 0x03306A 18:B05A: 00        .byte $00

_off004_B05B_1C:
off_B05B:
- D - I - - 0x03306B 18:B05B: 22        .byte $22
- D - I - - 0x03306C 18:B05C: 09        .byte $09
- D - I - - 0x03306D 18:B05D: 15        .byte $15
- D - I - - 0x03306E 18:B05E: 0A        .byte $0A
- D - I - - 0x03306F 18:B05F: 25        .byte $25
- D - I - - 0x033070 18:B060: 22        .byte $22
- D - I - - 0x033071 18:B061: 09        .byte $09
- D - I - - 0x033072 18:B062: 16        .byte $16
- D - I - - 0x033073 18:B063: 0A        .byte $0A
- D - I - - 0x033074 18:B064: 27        .byte $27
- D - I - - 0x033075 18:B065: 22        .byte $22
- D - I - - 0x033076 18:B066: 09        .byte $09
- D - I - - 0x033077 18:B067: 27        .byte $27
- D - I - - 0x033078 18:B068: 0A        .byte $0A
- D - I - - 0x033079 18:B069: 38        .byte $38
- D - I - - 0x03307A 18:B06A: 22        .byte $22
- D - I - - 0x03307B 18:B06B: 09        .byte $09
- D - I - - 0x03307C 18:B06C: 16        .byte $16
- D - I - - 0x03307D 18:B06D: 0A        .byte $0A
- D - I - - 0x03307E 18:B06E: 27        .byte $27
- D - I - - 0x03307F 18:B06F: 01        .byte $01
- D - I - - 0x033080 18:B070: 5B B0     .word off_B05B

_off004_B072_1D:
off_B072:
- D - I - - 0x033082 18:B072: 19        .byte $19
- D - I - - 0x033083 18:B073: 0D        .byte $0D
- D - I - - 0x033084 18:B074: 15        .byte $15
- D - I - - 0x033085 18:B075: 09        .byte $09
- D - I - - 0x033086 18:B076: 0D        .byte $0D
- D - I - - 0x033087 18:B077: 30        .byte $30
- D - I - - 0x033088 18:B078: 19        .byte $19
- D - I - - 0x033089 18:B079: 0D        .byte $0D
- D - I - - 0x03308A 18:B07A: 28        .byte $28
- D - I - - 0x03308B 18:B07B: 09        .byte $09
- D - I - - 0x03308C 18:B07C: 0D        .byte $0D
- D - I - - 0x03308D 18:B07D: 30        .byte $30
- D - I - - 0x03308E 18:B07E: 19        .byte $19
- D - I - - 0x03308F 18:B07F: 0D        .byte $0D
- D - I - - 0x033090 18:B080: 26        .byte $26
- D - I - - 0x033091 18:B081: 09        .byte $09
- D - I - - 0x033092 18:B082: 0D        .byte $0D
- D - I - - 0x033093 18:B083: 30        .byte $30
- D - I - - 0x033094 18:B084: 01        .byte $01
- D - I - - 0x033095 18:B085: 72 B0     .word off_B072

_off004_B087_1E:
off_B087:
- D - I - - 0x033097 18:B087: 21        .byte $21
- D - I - - 0x033098 18:B088: 01        .byte $01
- D - I - - 0x033099 18:B089: 30        .byte $30
- D - I - - 0x03309A 18:B08A: 21        .byte $21
- D - I - - 0x03309B 18:B08B: 01        .byte $01
- D - I - - 0x03309C 18:B08C: 0F        .byte $0F
- D - I - - 0x03309D 18:B08D: 01        .byte $01
- D - I - - 0x03309E 18:B08E: 87 B0     .word off_B087

_off004_B090_1F:
off_B090:
- D - I - - 0x0330A0 18:B090: 42        .byte $42
- D - I - - 0x0330A1 18:B091: 09        .byte $09
- D - I - - 0x0330A2 18:B092: 15        .byte $15
- D - I - - 0x0330A3 18:B093: 0A        .byte $0A
- D - I - - 0x0330A4 18:B094: 26        .byte $26
- D - I - - 0x0330A5 18:B095: 32        .byte $32
- D - I - - 0x0330A6 18:B096: 09        .byte $09
- D - I - - 0x0330A7 18:B097: 27        .byte $27
- D - I - - 0x0330A8 18:B098: 0A        .byte $0A
- D - I - - 0x0330A9 18:B099: 30        .byte $30
- D - I - - 0x0330AA 18:B09A: 42        .byte $42
- D - I - - 0x0330AB 18:B09B: 09        .byte $09
- D - I - - 0x0330AC 18:B09C: 11        .byte $11
- D - I - - 0x0330AD 18:B09D: 0A        .byte $0A
- D - I - - 0x0330AE 18:B09E: 22        .byte $22
- D - I - - 0x0330AF 18:B09F: 32        .byte $32
- D - I - - 0x0330B0 18:B0A0: 09        .byte $09
- D - I - - 0x0330B1 18:B0A1: 27        .byte $27
- D - I - - 0x0330B2 18:B0A2: 0A        .byte $0A
- D - I - - 0x0330B3 18:B0A3: 30        .byte $30
- D - I - - 0x0330B4 18:B0A4: 01        .byte $01
- D - I - - 0x0330B5 18:B0A5: 90 B0     .word off_B090

_off004_B0A7_20:
off_B0A7:
- D - I - - 0x0330B7 18:B0A7: 11        .byte $11
- D - I - - 0x0330B8 18:B0A8: 0D        .byte $0D
- D - I - - 0x0330B9 18:B0A9: 30        .byte $30
- D - I - - 0x0330BA 18:B0AA: 11        .byte $11
- D - I - - 0x0330BB 18:B0AB: 0D        .byte $0D
- D - I - - 0x0330BC 18:B0AC: 25        .byte $25
- D - I - - 0x0330BD 18:B0AD: 11        .byte $11
- D - I - - 0x0330BE 18:B0AE: 0D        .byte $0D
- D - I - - 0x0330BF 18:B0AF: 30        .byte $30
- D - I - - 0x0330C0 18:B0B0: 11        .byte $11
- D - I - - 0x0330C1 18:B0B1: 0D        .byte $0D
- D - I - - 0x0330C2 18:B0B2: 38        .byte $38
- D - I - - 0x0330C3 18:B0B3: 11        .byte $11
- D - I - - 0x0330C4 18:B0B4: 0D        .byte $0D
- D - I - - 0x0330C5 18:B0B5: 30        .byte $30
- D - I - - 0x0330C6 18:B0B6: 11        .byte $11
- D - I - - 0x0330C7 18:B0B7: 0D        .byte $0D
- D - I - - 0x0330C8 18:B0B8: 15        .byte $15
- D - I - - 0x0330C9 18:B0B9: 01        .byte $01
- D - I - - 0x0330CA 18:B0BA: A7 B0     .word off_B0A7

_off004_B0BC_21:
- D - I - - 0x0330CC 18:B0BC: 0E        .byte $0E
- D - I - - 0x0330CD 18:B0BD: 12        .byte $12
- D - I - - 0x0330CE 18:B0BE: 0F        .byte $0F
- D - I - - 0x0330CF 18:B0BF: 16        .byte $16
- D - I - - 0x0330D0 18:B0C0: 00        .byte $00
- D - I - - 0x0330D1 18:B0C1: 1A        .byte $1A
- D - I - - 0x0330D2 18:B0C2: 0F        .byte $0F
- D - I - - 0x0330D3 18:B0C3: 17        .byte $17
- D - I - - 0x0330D4 18:B0C4: 36        .byte $36
- D - I - - 0x0330D5 18:B0C5: 1B        .byte $1B
- D - I - - 0x0330D6 18:B0C6: 36        .byte $36
- D - I - - 0x0330D7 18:B0C7: 13        .byte $13
- D - I - - 0x0330D8 18:B0C8: 36        .byte $36
- D - I - - 0x0330D9 18:B0C9: 00        .byte $00

_off004_B0CA_22:
off_B0CA:
- D - I - - 0x0330DA 18:B0CA: 26        .byte $26
- D - I - - 0x0330DB 18:B0CB: 0D        .byte $0D
- D - I - - 0x0330DC 18:B0CC: 22        .byte $22
- D - I - - 0x0330DD 18:B0CD: 0E        .byte $0E
- D - I - - 0x0330DE 18:B0CE: 22        .byte $22
- D - I - - 0x0330DF 18:B0CF: 0F        .byte $0F
- D - I - - 0x0330E0 18:B0D0: 32        .byte $32
- D - I - - 0x0330E1 18:B0D1: 09        .byte $09
- D - I - - 0x0330E2 18:B0D2: 11        .byte $11
- D - I - - 0x0330E3 18:B0D3: 0A        .byte $0A
- D - I - - 0x0330E4 18:B0D4: 21        .byte $21
- D - I - - 0x0330E5 18:B0D5: 0B        .byte $0B
- D - I - - 0x0330E6 18:B0D6: 31        .byte $31
- D - I - - 0x0330E7 18:B0D7: 26        .byte $26
- D - I - - 0x0330E8 18:B0D8: 0D        .byte $0D
- D - I - - 0x0330E9 18:B0D9: 16        .byte $16
- D - I - - 0x0330EA 18:B0DA: 0E        .byte $0E
- D - I - - 0x0330EB 18:B0DB: 26        .byte $26
- D - I - - 0x0330EC 18:B0DC: 0F        .byte $0F
- D - I - - 0x0330ED 18:B0DD: 16        .byte $16
- D - I - - 0x0330EE 18:B0DE: 09        .byte $09
- D - I - - 0x0330EF 18:B0DF: 05        .byte $05
- D - I - - 0x0330F0 18:B0E0: 0A        .byte $0A
- D - I - - 0x0330F1 18:B0E1: 15        .byte $15
- D - I - - 0x0330F2 18:B0E2: 0B        .byte $0B
- D - I - - 0x0330F3 18:B0E3: 25        .byte $25
- D - I - - 0x0330F4 18:B0E4: 26        .byte $26
- D - I - - 0x0330F5 18:B0E5: 0D        .byte $0D
- D - I - - 0x0330F6 18:B0E6: 32        .byte $32
- D - I - - 0x0330F7 18:B0E7: 0E        .byte $0E
- D - I - - 0x0330F8 18:B0E8: 22        .byte $22
- D - I - - 0x0330F9 18:B0E9: 0F        .byte $0F
- D - I - - 0x0330FA 18:B0EA: 22        .byte $22
- D - I - - 0x0330FB 18:B0EB: 09        .byte $09
- D - I - - 0x0330FC 18:B0EC: 11        .byte $11
- D - I - - 0x0330FD 18:B0ED: 0A        .byte $0A
- D - I - - 0x0330FE 18:B0EE: 21        .byte $21
- D - I - - 0x0330FF 18:B0EF: 0B        .byte $0B
- D - I - - 0x033100 18:B0F0: 31        .byte $31
- D - I - - 0x033101 18:B0F1: 26        .byte $26
- D - I - - 0x033102 18:B0F2: 0D        .byte $0D
- D - I - - 0x033103 18:B0F3: 16        .byte $16
- D - I - - 0x033104 18:B0F4: 0E        .byte $0E
- D - I - - 0x033105 18:B0F5: 16        .byte $16
- D - I - - 0x033106 18:B0F6: 0F        .byte $0F
- D - I - - 0x033107 18:B0F7: 26        .byte $26
- D - I - - 0x033108 18:B0F8: 09        .byte $09
- D - I - - 0x033109 18:B0F9: 05        .byte $05
- D - I - - 0x03310A 18:B0FA: 0A        .byte $0A
- D - I - - 0x03310B 18:B0FB: 15        .byte $15
- D - I - - 0x03310C 18:B0FC: 0B        .byte $0B
- D - I - - 0x03310D 18:B0FD: 25        .byte $25
- D - I - - 0x03310E 18:B0FE: 26        .byte $26
- D - I - - 0x03310F 18:B0FF: 0D        .byte $0D
- D - I - - 0x033110 18:B100: 22        .byte $22
- D - I - - 0x033111 18:B101: 0E        .byte $0E
- D - I - - 0x033112 18:B102: 32        .byte $32
- D - I - - 0x033113 18:B103: 0F        .byte $0F
- D - I - - 0x033114 18:B104: 22        .byte $22
- D - I - - 0x033115 18:B105: 09        .byte $09
- D - I - - 0x033116 18:B106: 11        .byte $11
- D - I - - 0x033117 18:B107: 0A        .byte $0A
- D - I - - 0x033118 18:B108: 21        .byte $21
- D - I - - 0x033119 18:B109: 0B        .byte $0B
- D - I - - 0x03311A 18:B10A: 31        .byte $31
- D - I - - 0x03311B 18:B10B: 26        .byte $26
- D - I - - 0x03311C 18:B10C: 0D        .byte $0D
- D - I - - 0x03311D 18:B10D: 26        .byte $26
- D - I - - 0x03311E 18:B10E: 0F        .byte $0F
- D - I - - 0x03311F 18:B10F: 16        .byte $16
- D - I - - 0x033120 18:B110: 0E        .byte $0E
- D - I - - 0x033121 18:B111: 16        .byte $16
- D - I - - 0x033122 18:B112: 09        .byte $09
- D - I - - 0x033123 18:B113: 05        .byte $05
- D - I - - 0x033124 18:B114: 0A        .byte $0A
- D - I - - 0x033125 18:B115: 15        .byte $15
- D - I - - 0x033126 18:B116: 0B        .byte $0B
- D - I - - 0x033127 18:B117: 25        .byte $25
- D - I - - 0x033128 18:B118: 01        .byte $01
- D - I - - 0x033129 18:B119: CA B0     .word off_B0CA

_off004_B11B_23:
- D - I - - 0x03312B 18:B11B: 26        .byte $26
- D - I - - 0x03312C 18:B11C: 09        .byte $09
- D - I - - 0x03312D 18:B11D: 11        .byte $11
- D - I - - 0x03312E 18:B11E: 0A        .byte $0A
- D - I - - 0x03312F 18:B11F: 21        .byte $21
- D - I - - 0x033130 18:B120: 0B        .byte $0B
- D - I - - 0x033131 18:B121: 31        .byte $31
- D - I - - 0x033132 18:B122: 0D        .byte $0D
- D - I - - 0x033133 18:B123: 3A        .byte $3A
- D - I - - 0x033134 18:B124: 0E        .byte $0E
- D - I - - 0x033135 18:B125: 1A        .byte $1A
- D - I - - 0x033136 18:B126: 0F        .byte $0F
- D - I - - 0x033137 18:B127: 1A        .byte $1A
- D - I - - 0x033138 18:B128: 01        .byte $01
- D - I - - 0x033139 18:B129: A1 AF     .word off_AFA1

_off004_B12B_24:
- D - I - - 0x03313B 18:B12B: 0E        .byte $0E
- D - I - - 0x03313C 18:B12C: 12        .byte $12
- D - I - - 0x03313D 18:B12D: 37        .byte $37
- D - I - - 0x03313E 18:B12E: 16        .byte $16
- D - I - - 0x03313F 18:B12F: 11        .byte $11
- D - I - - 0x033140 18:B130: 1A        .byte $1A
- D - I - - 0x033141 18:B131: 30        .byte $30
- D - I - - 0x033142 18:B132: 17        .byte $17
- D - I - - 0x033143 18:B133: 35        .byte $35
- D - I - - 0x033144 18:B134: 1B        .byte $1B
- D - I - - 0x033145 18:B135: 35        .byte $35
- D - I - - 0x033146 18:B136: 13        .byte $13
- D - I - - 0x033147 18:B137: 35        .byte $35
- D - I - - 0x033148 18:B138: 00        .byte $00

_off004_B139_25:
off_B139:
- D - I - - 0x033149 18:B139: 1B        .byte $1B
- D - I - - 0x03314A 18:B13A: 09        .byte $09
- D - I - - 0x03314B 18:B13B: 11        .byte $11
- D - I - - 0x03314C 18:B13C: 0A        .byte $0A
- D - I - - 0x03314D 18:B13D: 21        .byte $21
- D - I - - 0x03314E 18:B13E: 0B        .byte $0B
- D - I - - 0x03314F 18:B13F: 31        .byte $31
- D - I - - 0x033150 18:B140: 1B        .byte $1B
- D - I - - 0x033151 18:B141: 09        .byte $09
- D - I - - 0x033152 18:B142: 1A        .byte $1A
- D - I - - 0x033153 18:B143: 0A        .byte $0A
- D - I - - 0x033154 18:B144: 2A        .byte $2A
- D - I - - 0x033155 18:B145: 0B        .byte $0B
- D - I - - 0x033156 18:B146: 3B        .byte $3B
- D - I - - 0x033157 18:B147: 01        .byte $01
- D - I - - 0x033158 18:B148: 39 B1     .word off_B139

_off004_B14A_26:
- - - - - - 0x03315A 18:B14A: 09        .byte $09
- - - - - - 0x03315B 18:B14B: 05        .byte $05
- - - - - - 0x03315C 18:B14C: 1A        .byte $1A
- - - - - - 0x03315D 18:B14D: 01        .byte $01
- - - - - - 0x03315E 18:B14E: 71 AF     .word off_AF71

_off004_B150_27:
off_B150:
- D - I - - 0x033160 18:B150: 11        .byte $11
- D - I - - 0x033161 18:B151: 0D        .byte $0D
- D - I - - 0x033162 18:B152: 30        .byte $30
- D - I - - 0x033163 18:B153: 11        .byte $11
- D - I - - 0x033164 18:B154: 0D        .byte $0D
- D - I - - 0x033165 18:B155: 3A        .byte $3A
- D - I - - 0x033166 18:B156: 11        .byte $11
- D - I - - 0x033167 18:B157: 0D        .byte $0D
- D - I - - 0x033168 18:B158: 11        .byte $11
- D - I - - 0x033169 18:B159: 11        .byte $11
- D - I - - 0x03316A 18:B15A: 0D        .byte $0D
- D - I - - 0x03316B 18:B15B: 28        .byte $28
- D - I - - 0x03316C 18:B15C: 01        .byte $01
- D - I - - 0x03316D 18:B15D: 50 B1     .word off_B150

_off004_B15F_28:
- D - I - - 0x03316F 18:B15F: 14        .byte $14
- D - I - - 0x033170 18:B160: 09        .byte $09
- D - I - - 0x033171 18:B161: 15        .byte $15
- D - I - - 0x033172 18:B162: 0A        .byte $0A
- D - I - - 0x033173 18:B163: 25        .byte $25
- D - I - - 0x033174 18:B164: 0B        .byte $0B
- D - I - - 0x033175 18:B165: 34        .byte $34
- D - I - - 0x033176 18:B166: 10        .byte $10
- D - I - - 0x033177 18:B167: 0F        .byte $0F
- D - I - - 0x033178 18:B168: 0C        .byte $0C
- D - I - - 0x033179 18:B169: 13        .byte $13
- D - I - - 0x03317A 18:B16A: 35        .byte $35
- D - I - - 0x03317B 18:B16B: 17        .byte $17
- D - I - - 0x03317C 18:B16C: 35        .byte $35
- D - I - - 0x03317D 18:B16D: 1B        .byte $1B
- D - I - - 0x03317E 18:B16E: 35        .byte $35
- D - I - - 0x03317F 18:B16F: 1F        .byte $1F
- D - I - - 0x033180 18:B170: 35        .byte $35
- D - I - - 0x033181 18:B171: 00        .byte $00

_off004_B172_29:
off_B172:
- D - I - - 0x033182 18:B172: 32        .byte $32
- D - I - - 0x033183 18:B173: 09        .byte $09
- D - I - - 0x033184 18:B174: 25        .byte $25
- D - I - - 0x033185 18:B175: 0A        .byte $0A
- D - I - - 0x033186 18:B176: 38        .byte $38
- D - I - - 0x033187 18:B177: 32        .byte $32
- D - I - - 0x033188 18:B178: 09        .byte $09
- D - I - - 0x033189 18:B179: 15        .byte $15
- D - I - - 0x03318A 18:B17A: 0A        .byte $0A
- D - I - - 0x03318B 18:B17B: 37        .byte $37
- D - I - - 0x03318C 18:B17C: 1A        .byte $1A
- D - I - - 0x03318D 18:B17D: 09        .byte $09
- D - I - - 0x03318E 18:B17E: 27        .byte $27
- D - I - - 0x03318F 18:B17F: 0A        .byte $0A
- D - I - - 0x033190 18:B180: 38        .byte $38
- D - I - - 0x033191 18:B181: 32        .byte $32
- D - I - - 0x033192 18:B182: 09        .byte $09
- D - I - - 0x033193 18:B183: 15        .byte $15
- D - I - - 0x033194 18:B184: 0A        .byte $0A
- D - I - - 0x033195 18:B185: 37        .byte $37
- D - I - - 0x033196 18:B186: 01        .byte $01
- D - I - - 0x033197 18:B187: 72 B1     .word off_B172

_off004_B189_2A:
- D - I - - 0x033199 18:B189: 22        .byte $22
- D - I - - 0x03319A 18:B18A: 09        .byte $09
- D - I - - 0x03319B 18:B18B: 11        .byte $11
- D - I - - 0x03319C 18:B18C: 0A        .byte $0A
- D - I - - 0x03319D 18:B18D: 21        .byte $21
- D - I - - 0x03319E 18:B18E: 22        .byte $22
- D - I - - 0x03319F 18:B18F: 09        .byte $09
- D - I - - 0x0331A0 18:B190: 21        .byte $21
- D - I - - 0x0331A1 18:B191: 0A        .byte $0A
- D - I - - 0x0331A2 18:B192: 38        .byte $38
- D - I - - 0x0331A3 18:B193: 22        .byte $22
- D - I - - 0x0331A4 18:B194: 09        .byte $09
- D - I - - 0x0331A5 18:B195: 1A        .byte $1A
- D - I - - 0x0331A6 18:B196: 0A        .byte $0A
- D - I - - 0x0331A7 18:B197: 29        .byte $29
- D - I - - 0x0331A8 18:B198: 01        .byte $01
- D - I - - 0x0331A9 18:B199: 65 B2     .word off_B265

_off004_B19B_2B_2C_2D:
off_B19B:
- D - I - - 0x0331AB 18:B19B: 31        .byte $31
- D - I - - 0x0331AC 18:B19C: 1D        .byte $1D
- D - I - - 0x0331AD 18:B19D: 31        .byte $31
- D - I - - 0x0331AE 18:B19E: 31        .byte $31
- D - I - - 0x0331AF 18:B19F: 1D        .byte $1D
- D - I - - 0x0331B0 18:B1A0: 0F        .byte $0F
- D - I - - 0x0331B1 18:B1A1: 31        .byte $31
- D - I - - 0x0331B2 18:B1A2: 1E        .byte $1E
- D - I - - 0x0331B3 18:B1A3: 10        .byte $10
- D - I - - 0x0331B4 18:B1A4: 31        .byte $31
- D - I - - 0x0331B5 18:B1A5: 1E        .byte $1E
- D - I - - 0x0331B6 18:B1A6: 0F        .byte $0F
- D - I - - 0x0331B7 18:B1A7: 01        .byte $01
- D - I - - 0x0331B8 18:B1A8: 9B B1     .word off_B19B

_off004_B1AA_2E:
off_B1AA:
- D - I - - 0x0331BA 18:B1AA: 32        .byte $32
- D - I - - 0x0331BB 18:B1AB: 09        .byte $09
- D - I - - 0x0331BC 18:B1AC: 12        .byte $12
- D - I - - 0x0331BD 18:B1AD: 0A        .byte $0A
- D - I - - 0x0331BE 18:B1AE: 1C        .byte $1C
- D - I - - 0x0331BF 18:B1AF: 12        .byte $12
- D - I - - 0x0331C0 18:B1B0: 09        .byte $09
- D - I - - 0x0331C1 18:B1B1: 21        .byte $21
- D - I - - 0x0331C2 18:B1B2: 0A        .byte $0A
- D - I - - 0x0331C3 18:B1B3: 3C        .byte $3C
- D - I - - 0x0331C4 18:B1B4: 22        .byte $22
- D - I - - 0x0331C5 18:B1B5: 09        .byte $09
- D - I - - 0x0331C6 18:B1B6: 16        .byte $16
- D - I - - 0x0331C7 18:B1B7: 0A        .byte $0A
- D - I - - 0x0331C8 18:B1B8: 26        .byte $26
- D - I - - 0x0331C9 18:B1B9: 12        .byte $12
- D - I - - 0x0331CA 18:B1BA: 09        .byte $09
- D - I - - 0x0331CB 18:B1BB: 27        .byte $27
- D - I - - 0x0331CC 18:B1BC: 0A        .byte $0A
- D - I - - 0x0331CD 18:B1BD: 38        .byte $38
- D - I - - 0x0331CE 18:B1BE: 12        .byte $12
- D - I - - 0x0331CF 18:B1BF: 09        .byte $09
- D - I - - 0x0331D0 18:B1C0: 21        .byte $21
- D - I - - 0x0331D1 18:B1C1: 0A        .byte $0A
- D - I - - 0x0331D2 18:B1C2: 31        .byte $31
- D - I - - 0x0331D3 18:B1C3: 01        .byte $01
- D - I - - 0x0331D4 18:B1C4: AA B1     .word off_B1AA

_off004_B1C6_2F:
off_B1C6:
- D - I - - 0x0331D6 18:B1C6: 1B        .byte $1B
- D - I - - 0x0331D7 18:B1C7: 09        .byte $09
- D - I - - 0x0331D8 18:B1C8: 17        .byte $17
- D - I - - 0x0331D9 18:B1C9: 0A        .byte $0A
- D - I - - 0x0331DA 18:B1CA: 27        .byte $27
- D - I - - 0x0331DB 18:B1CB: 0B        .byte $0B
- D - I - - 0x0331DC 18:B1CC: 30        .byte $30
- D - I - - 0x0331DD 18:B1CD: 19        .byte $19
- D - I - - 0x0331DE 18:B1CE: 09        .byte $09
- D - I - - 0x0331DF 18:B1CF: 27        .byte $27
- D - I - - 0x0331E0 18:B1D0: 19        .byte $19
- D - I - - 0x0331E1 18:B1D1: 0A        .byte $0A
- D - I - - 0x0331E2 18:B1D2: 38        .byte $38
- D - I - - 0x0331E3 18:B1D3: 19        .byte $19
- D - I - - 0x0331E4 18:B1D4: 0B        .byte $0B
- D - I - - 0x0331E5 18:B1D5: 38        .byte $38
- D - I - - 0x0331E6 18:B1D6: 01        .byte $01
- D - I - - 0x0331E7 18:B1D7: C6 B1     .word off_B1C6

_off004_B1D9_30:
off_B1D9:
- D - I - - 0x0331E9 18:B1D9: 32        .byte $32
- D - I - - 0x0331EA 18:B1DA: 09        .byte $09
- D - I - - 0x0331EB 18:B1DB: 12        .byte $12
- D - I - - 0x0331EC 18:B1DC: 0A        .byte $0A
- D - I - - 0x0331ED 18:B1DD: 21        .byte $21
- D - I - - 0x0331EE 18:B1DE: 12        .byte $12
- D - I - - 0x0331EF 18:B1DF: 09        .byte $09
- D - I - - 0x0331F0 18:B1E0: 21        .byte $21
- D - I - - 0x0331F1 18:B1E1: 0A        .byte $0A
- D - I - - 0x0331F2 18:B1E2: 3C        .byte $3C
- D - I - - 0x0331F3 18:B1E3: 12        .byte $12
- D - I - - 0x0331F4 18:B1E4: 09        .byte $09
- D - I - - 0x0331F5 18:B1E5: 31        .byte $31
- D - I - - 0x0331F6 18:B1E6: 0A        .byte $0A
- D - I - - 0x0331F7 18:B1E7: 30        .byte $30
- D - I - - 0x0331F8 18:B1E8: 01        .byte $01
- D - I - - 0x0331F9 18:B1E9: D9 B1     .word off_B1D9

_off004_B1EB_31:
- - - - - - 0x0331FB 18:B1EB: 35        .byte $35
- - - - - - 0x0331FC 18:B1EC: 09        .byte $09
- - - - - - 0x0331FD 18:B1ED: 11        .byte $11
- - - - - - 0x0331FE 18:B1EE: 0A        .byte $0A
- - - - - - 0x0331FF 18:B1EF: 21        .byte $21
- - - - - - 0x033200 18:B1F0: 0B        .byte $0B
- - - - - - 0x033201 18:B1F1: 31        .byte $31
- - - - - - 0x033202 18:B1F2: 1D        .byte $1D
- - - - - - 0x033203 18:B1F3: 07        .byte $07
- - - - - - 0x033204 18:B1F4: 1E        .byte $1E
- - - - - - 0x033205 18:B1F5: 38        .byte $38
- - - - - - 0x033206 18:B1F6: 12        .byte $12
- - - - - - 0x033207 18:B1F7: 1D        .byte $1D
- - - - - - 0x033208 18:B1F8: 06        .byte $06
- - - - - - 0x033209 18:B1F9: 1E        .byte $1E
- - - - - - 0x03320A 18:B1FA: 27        .byte $27
- - - - - - 0x03320B 18:B1FB: 23        .byte $23
- - - - - - 0x03320C 18:B1FC: 09        .byte $09
- - - - - - 0x03320D 18:B1FD: 12        .byte $12
- - - - - - 0x03320E 18:B1FE: 0A        .byte $0A
- - - - - - 0x03320F 18:B1FF: 22        .byte $22
- - - - - - 0x033210 18:B200: 0B        .byte $0B
- - - - - - 0x033211 18:B201: 37        .byte $37
- - - - - - 0x033212 18:B202: 22        .byte $22
- - - - - - 0x033213 18:B203: 1D        .byte $1D
- - - - - - 0x033214 18:B204: 07        .byte $07
- - - - - - 0x033215 18:B205: 1E        .byte $1E
- - - - - - 0x033216 18:B206: 38        .byte $38
- - - - - - 0x033217 18:B207: 13        .byte $13
- - - - - - 0x033218 18:B208: 09        .byte $09
- - - - - - 0x033219 18:B209: 03        .byte $03
- - - - - - 0x03321A 18:B20A: 0A        .byte $0A
- - - - - - 0x03321B 18:B20B: 04        .byte $04
- - - - - - 0x03321C 18:B20C: 0B        .byte $0B
- - - - - - 0x03321D 18:B20D: 13        .byte $13
- - - - - - 0x03321E 18:B20E: 32        .byte $32
- - - - - - 0x03321F 18:B20F: 1D        .byte $1D
- - - - - - 0x033220 18:B210: 06        .byte $06
- - - - - - 0x033221 18:B211: 1E        .byte $1E
- - - - - - 0x033222 18:B212: 27        .byte $27
- - - - - - 0x033223 18:B213: 35        .byte $35
- - - - - - 0x033224 18:B214: 09        .byte $09
- - - - - - 0x033225 18:B215: 04        .byte $04
- - - - - - 0x033226 18:B216: 0A        .byte $0A
- - - - - - 0x033227 18:B217: 05        .byte $05
- - - - - - 0x033228 18:B218: 0B        .byte $0B
- - - - - - 0x033229 18:B219: 17        .byte $17
- - - - - - 0x03322A 18:B21A: 1D        .byte $1D
- - - - - - 0x03322B 18:B21B: 07        .byte $07
- - - - - - 0x03322C 18:B21C: 1E        .byte $1E
- - - - - - 0x03322D 18:B21D: 38        .byte $38
- - - - - - 0x03322E 18:B21E: 12        .byte $12
- - - - - - 0x03322F 18:B21F: 1D        .byte $1D
- - - - - - 0x033230 18:B220: 06        .byte $06
- - - - - - 0x033231 18:B221: 1E        .byte $1E
- - - - - - 0x033232 18:B222: 27        .byte $27
- - - - - - 0x033233 18:B223: 33        .byte $33
- - - - - - 0x033234 18:B224: 09        .byte $09
- - - - - - 0x033235 18:B225: 05        .byte $05
- - - - - - 0x033236 18:B226: 0A        .byte $0A
- - - - - - 0x033237 18:B227: 15        .byte $15
- - - - - - 0x033238 18:B228: 0B        .byte $0B
- - - - - - 0x033239 18:B229: 37        .byte $37
- - - - - - 0x03323A 18:B22A: 0A        .byte $0A
- - - - - - 0x03323B 18:B22B: 1D        .byte $1D
- - - - - - 0x03323C 18:B22C: 07        .byte $07
- - - - - - 0x03323D 18:B22D: 1E        .byte $1E
- - - - - - 0x03323E 18:B22E: 38        .byte $38
- - - - - - 0x03323F 18:B22F: 00        .byte $00

_off004_B230_32:
- D - I - - 0x033240 18:B230: 16        .byte $16
- D - I - - 0x033241 18:B231: 09        .byte $09
- D - I - - 0x033242 18:B232: 11        .byte $11
- D - I - - 0x033243 18:B233: 0A        .byte $0A
- D - I - - 0x033244 18:B234: 21        .byte $21
- D - I - - 0x033245 18:B235: 0B        .byte $0B
- D - I - - 0x033246 18:B236: 31        .byte $31
- D - I - - 0x033247 18:B237: 0D        .byte $0D
- D - I - - 0x033248 18:B238: 3A        .byte $3A
- D - I - - 0x033249 18:B239: 0E        .byte $0E
- D - I - - 0x03324A 18:B23A: 1A        .byte $1A
- D - I - - 0x03324B 18:B23B: 0F        .byte $0F
- D - I - - 0x03324C 18:B23C: 1A        .byte $1A
- D - I - - 0x03324D 18:B23D: 01        .byte $01
- D - I - - 0x03324E 18:B23E: 89 B2     .word off_B289

_off004_B240_33_34:
- D - I - - 0x033250 18:B240: F1        .byte $F1
- D - I - - 0x033251 18:B241: 10        .byte $10
- D - I - - 0x033252 18:B242: 0F        .byte $0F
- D - I - - 0x033253 18:B243: 0D        .byte $0D
- D - I - - 0x033254 18:B244: 13        .byte $13
- D - I - - 0x033255 18:B245: 11        .byte $11
- D - I - - 0x033256 18:B246: 17        .byte $17
- D - I - - 0x033257 18:B247: 11        .byte $11
- D - I - - 0x033258 18:B248: 12        .byte $12
- D - I - - 0x033259 18:B249: 21        .byte $21
- D - I - - 0x03325A 18:B24A: 1A        .byte $1A
- D - I - - 0x03325B 18:B24B: 21        .byte $21
- D - I - - 0x03325C 18:B24C: 16        .byte $16
- D - I - - 0x03325D 18:B24D: 01        .byte $01
- D - I - - 0x03325E 18:B24E: 0B        .byte $0B
- D - I - - 0x03325F 18:B24F: 05        .byte $05
- D - I - - 0x033260 18:B250: 30        .byte $30
- D - I - - 0x033261 18:B251: 06        .byte $06
- D - I - - 0x033262 18:B252: 12        .byte $12
- D - I - - 0x033263 18:B253: 07        .byte $07
- D - I - - 0x033264 18:B254: 01        .byte $01
- D - I - - 0x033265 18:B255: 00        .byte $00

_off004_B256_35:
off_B256:
- D - I - - 0x033266 18:B256: 19        .byte $19
- D - I - - 0x033267 18:B257: 0D        .byte $0D
- D - I - - 0x033268 18:B258: 25        .byte $25
- D - I - - 0x033269 18:B259: 19        .byte $19
- D - I - - 0x03326A 18:B25A: 0D        .byte $0D
- D - I - - 0x03326B 18:B25B: 30        .byte $30
- D - I - - 0x03326C 18:B25C: 19        .byte $19
- D - I - - 0x03326D 18:B25D: 0D        .byte $0D
- D - I - - 0x03326E 18:B25E: 2A        .byte $2A
- D - I - - 0x03326F 18:B25F: 19        .byte $19
- D - I - - 0x033270 18:B260: 0D        .byte $0D
- D - I - - 0x033271 18:B261: 38        .byte $38
- D - I - - 0x033272 18:B262: 01        .byte $01
- D - I - - 0x033273 18:B263: 56 B2     .word off_B256

_off004_B265_36_37_38:
off_B265:
- D - I - - 0x033275 18:B265: 0E        .byte $0E
- D - I - - 0x033276 18:B266: 09        .byte $09
- D - I - - 0x033277 18:B267: 06        .byte $06
- D - I - - 0x033278 18:B268: 0A        .byte $0A
- D - I - - 0x033279 18:B269: 16        .byte $16
- D - I - - 0x03327A 18:B26A: 0B        .byte $0B
- D - I - - 0x03327B 18:B26B: 26        .byte $26
- D - I - - 0x03327C 18:B26C: 0D        .byte $0D
- D - I - - 0x03327D 18:B26D: 06        .byte $06
- D - I - - 0x03327E 18:B26E: 0E        .byte $0E
- D - I - - 0x03327F 18:B26F: 16        .byte $16
- D - I - - 0x033280 18:B270: 0F        .byte $0F
- D - I - - 0x033281 18:B271: 26        .byte $26
off_B272:
- D - I - - 0x033282 18:B272: 32        .byte $32
- D - I - - 0x033283 18:B273: 1D        .byte $1D
- D - I - - 0x033284 18:B274: 03        .byte $03
- D - I - - 0x033285 18:B275: 1E        .byte $1E
- D - I - - 0x033286 18:B276: 30        .byte $30
- D - I - - 0x033287 18:B277: 32        .byte $32
- D - I - - 0x033288 18:B278: 1D        .byte $1D
- D - I - - 0x033289 18:B279: 07        .byte $07
- D - I - - 0x03328A 18:B27A: 1E        .byte $1E
- D - I - - 0x03328B 18:B27B: 38        .byte $38
- D - I - - 0x03328C 18:B27C: 32        .byte $32
- D - I - - 0x03328D 18:B27D: 1D        .byte $1D
- D - I - - 0x03328E 18:B27E: 03        .byte $03
- D - I - - 0x03328F 18:B27F: 1E        .byte $1E
- D - I - - 0x033290 18:B280: 30        .byte $30
- D - I - - 0x033291 18:B281: 32        .byte $32
- D - I - - 0x033292 18:B282: 1D        .byte $1D
- D - I - - 0x033293 18:B283: 04        .byte $04
- D - I - - 0x033294 18:B284: 1E        .byte $1E
- D - I - - 0x033295 18:B285: 25        .byte $25
- D - I - - 0x033296 18:B286: 01        .byte $01
- D - I - - 0x033297 18:B287: 72 B2     .word off_B272

_off004_B289_39:
off_B289:
- D - I - - 0x033299 18:B289: 13        .byte $13
- D - I - - 0x03329A 18:B28A: 0D        .byte $0D
- D - I - - 0x03329B 18:B28B: 1A        .byte $1A
- D - I - - 0x03329C 18:B28C: 0E        .byte $0E
- D - I - - 0x03329D 18:B28D: 1A        .byte $1A
- D - I - - 0x03329E 18:B28E: 0F        .byte $0F
- D - I - - 0x03329F 18:B28F: 3A        .byte $3A
- D - I - - 0x0332A0 18:B290: 13        .byte $13
- D - I - - 0x0332A1 18:B291: 0D        .byte $0D
- D - I - - 0x0332A2 18:B292: 1A        .byte $1A
- D - I - - 0x0332A3 18:B293: 0E        .byte $0E
- D - I - - 0x0332A4 18:B294: 3A        .byte $3A
- D - I - - 0x0332A5 18:B295: 0F        .byte $0F
- D - I - - 0x0332A6 18:B296: 1A        .byte $1A
- D - I - - 0x0332A7 18:B297: 13        .byte $13
- D - I - - 0x0332A8 18:B298: 0D        .byte $0D
- D - I - - 0x0332A9 18:B299: 3A        .byte $3A
- D - I - - 0x0332AA 18:B29A: 0E        .byte $0E
- D - I - - 0x0332AB 18:B29B: 1A        .byte $1A
- D - I - - 0x0332AC 18:B29C: 0F        .byte $0F
- D - I - - 0x0332AD 18:B29D: 1A        .byte $1A
- D - I - - 0x0332AE 18:B29E: 01        .byte $01
- D - I - - 0x0332AF 18:B29F: 89 B2     .word off_B289

_off004_B2A1_3A:
off_B2A1:
- D - I - - 0x0332B1 18:B2A1: 22        .byte $22
- D - I - - 0x0332B2 18:B2A2: 1D        .byte $1D
- D - I - - 0x0332B3 18:B2A3: 25        .byte $25
- D - I - - 0x0332B4 18:B2A4: 1E        .byte $1E
- D - I - - 0x0332B5 18:B2A5: 31        .byte $31
- D - I - - 0x0332B6 18:B2A6: 22        .byte $22
- D - I - - 0x0332B7 18:B2A7: 1D        .byte $1D
- D - I - - 0x0332B8 18:B2A8: 2A        .byte $2A
- D - I - - 0x0332B9 18:B2A9: 1E        .byte $1E
- D - I - - 0x0332BA 18:B2AA: 30        .byte $30
- D - I - - 0x0332BB 18:B2AB: 22        .byte $22
- D - I - - 0x0332BC 18:B2AC: 1D        .byte $1D
- D - I - - 0x0332BD 18:B2AD: 23        .byte $23
- D - I - - 0x0332BE 18:B2AE: 1E        .byte $1E
- D - I - - 0x0332BF 18:B2AF: 24        .byte $24
- D - I - - 0x0332C0 18:B2B0: 22        .byte $22
- D - I - - 0x0332C1 18:B2B1: 1D        .byte $1D
- D - I - - 0x0332C2 18:B2B2: 1A        .byte $1A
- D - I - - 0x0332C3 18:B2B3: 1E        .byte $1E
- D - I - - 0x0332C4 18:B2B4: 2A        .byte $2A
- D - I - - 0x0332C5 18:B2B5: 22        .byte $22
- D - I - - 0x0332C6 18:B2B6: 1D        .byte $1D
- D - I - - 0x0332C7 18:B2B7: 11        .byte $11
- D - I - - 0x0332C8 18:B2B8: 1E        .byte $1E
- D - I - - 0x0332C9 18:B2B9: 21        .byte $21
- D - I - - 0x0332CA 18:B2BA: 22        .byte $22
- D - I - - 0x0332CB 18:B2BB: 1D        .byte $1D
- D - I - - 0x0332CC 18:B2BC: 08        .byte $08
- D - I - - 0x0332CD 18:B2BD: 1E        .byte $1E
- D - I - - 0x0332CE 18:B2BE: 2B        .byte $2B
- D - I - - 0x0332CF 18:B2BF: 01        .byte $01
- D - I - - 0x0332D0 18:B2C0: A1 B2     .word off_B2A1

_off004_B2C2_3B:
- D - I - - 0x0332D2 18:B2C2: 0F        .byte $0F
- D - I - - 0x0332D3 18:B2C3: 01        .byte $01
- D - I - - 0x0332D4 18:B2C4: 05        .byte $05
- D - I - - 0x0332D5 18:B2C5: 09        .byte $09
- D - I - - 0x0332D6 18:B2C6: 06        .byte $06
- D - I - - 0x0332D7 18:B2C7: 0A        .byte $0A
- D - I - - 0x0332D8 18:B2C8: 16        .byte $16
- D - I - - 0x0332D9 18:B2C9: 0B        .byte $0B
- D - I - - 0x0332DA 18:B2CA: 26        .byte $26
- D - I - - 0x0332DB 18:B2CB: 0D        .byte $0D
- D - I - - 0x0332DC 18:B2CC: 06        .byte $06
- D - I - - 0x0332DD 18:B2CD: 0E        .byte $0E
- D - I - - 0x0332DE 18:B2CE: 16        .byte $16
- D - I - - 0x0332DF 18:B2CF: 0F        .byte $0F
- D - I - - 0x0332E0 18:B2D0: 26        .byte $26
- D - I - - 0x0332E1 18:B2D1: 00        .byte $00

_off004_B2D2_3C:
- D - I - - 0x0332E2 18:B2D2: 21        .byte $21
- D - I - - 0x0332E3 18:B2D3: 10        .byte $10
- D - I - - 0x0332E4 18:B2D4: 0F        .byte $0F
- D - I - - 0x0332E5 18:B2D5: 09        .byte $09
- D - I - - 0x0332E6 18:B2D6: 12        .byte $12
- D - I - - 0x0332E7 18:B2D7: 07        .byte $07
- D - I - - 0x0332E8 18:B2D8: 00        .byte $00

_off004_B2D9_3D:
- D - I - - 0x0332E9 18:B2D9: 21        .byte $21
- D - I - - 0x0332EA 18:B2DA: 10        .byte $10
- D - I - - 0x0332EB 18:B2DB: 0F        .byte $0F
- D - I - - 0x0332EC 18:B2DC: 0C        .byte $0C
- D - I - - 0x0332ED 18:B2DD: 13        .byte $13
- D - I - - 0x0332EE 18:B2DE: 35        .byte $35
- D - I - - 0x0332EF 18:B2DF: 17        .byte $17
- D - I - - 0x0332F0 18:B2E0: 35        .byte $35
- D - I - - 0x0332F1 18:B2E1: 1B        .byte $1B
- D - I - - 0x0332F2 18:B2E2: 35        .byte $35
- D - I - - 0x0332F3 18:B2E3: 1F        .byte $1F
- D - I - - 0x0332F4 18:B2E4: 35        .byte $35
- D - I - - 0x0332F5 18:B2E5: 00        .byte $00

_off004_B2E6_3E:
- D - I - - 0x0332F6 18:B2E6: 0B        .byte $0B
- D - I - - 0x0332F7 18:B2E7: 12        .byte $12
- D - I - - 0x0332F8 18:B2E8: 0F        .byte $0F
- D - I - - 0x0332F9 18:B2E9: 16        .byte $16
- D - I - - 0x0332FA 18:B2EA: 19        .byte $19
- D - I - - 0x0332FB 18:B2EB: 1A        .byte $1A
- D - I - - 0x0332FC 18:B2EC: 30        .byte $30
- D - I - - 0x0332FD 18:B2ED: 00        .byte $00

_off004_B2EE_3F:
- D - I - - 0x0332FE 18:B2EE: 0E        .byte $0E
- D - I - - 0x0332FF 18:B2EF: 12        .byte $12
- D - I - - 0x033300 18:B2F0: 0F        .byte $0F
- D - I - - 0x033301 18:B2F1: 16        .byte $16
- D - I - - 0x033302 18:B2F2: 16        .byte $16
- D - I - - 0x033303 18:B2F3: 1A        .byte $1A
- D - I - - 0x033304 18:B2F4: 30        .byte $30
- D - I - - 0x033305 18:B2F5: 17        .byte $17
- D - I - - 0x033306 18:B2F6: 36        .byte $36
- D - I - - 0x033307 18:B2F7: 1B        .byte $1B
- D - I - - 0x033308 18:B2F8: 36        .byte $36
- D - I - - 0x033309 18:B2F9: 13        .byte $13
- D - I - - 0x03330A 18:B2FA: 36        .byte $36
- D - I - - 0x03330B 18:B2FB: 00        .byte $00

_off004_B2FC_40:
- D - I - - 0x03330C 18:B2FC: 24        .byte $24
- D - I - - 0x03330D 18:B2FD: 11        .byte $11
- D - I - - 0x03330E 18:B2FE: 01        .byte $01
- D - I - - 0x03330F 18:B2FF: 15        .byte $15
- D - I - - 0x033310 18:B300: 01        .byte $01
- D - I - - 0x033311 18:B301: 19        .byte $19
- D - I - - 0x033312 18:B302: 01        .byte $01
- D - I - - 0x033313 18:B303: 1D        .byte $1D
- D - I - - 0x033314 18:B304: 01        .byte $01
- D - I - - 0x033315 18:B305: 24        .byte $24
- D - I - - 0x033316 18:B306: 11        .byte $11
- D - I - - 0x033317 18:B307: 13        .byte $13
- D - I - - 0x033318 18:B308: 15        .byte $15
- D - I - - 0x033319 18:B309: 13        .byte $13
- D - I - - 0x03331A 18:B30A: 19        .byte $19
- D - I - - 0x03331B 18:B30B: 13        .byte $13
- D - I - - 0x03331C 18:B30C: 1D        .byte $1D
- D - I - - 0x03331D 18:B30D: 13        .byte $13
- D - I - - 0x03331E 18:B30E: 14        .byte $14
- D - I - - 0x03331F 18:B30F: 11        .byte $11
- D - I - - 0x033320 18:B310: 25        .byte $25
- D - I - - 0x033321 18:B311: 15        .byte $15
- D - I - - 0x033322 18:B312: 25        .byte $25
- D - I - - 0x033323 18:B313: 19        .byte $19
- D - I - - 0x033324 18:B314: 25        .byte $25
- D - I - - 0x033325 18:B315: 1D        .byte $1D
- D - I - - 0x033326 18:B316: 25        .byte $25
- D - I - - 0x033327 18:B317: 13        .byte $13
- D - I - - 0x033328 18:B318: 09        .byte $09
- D - I - - 0x033329 18:B319: 11        .byte $11
- D - I - - 0x03332A 18:B31A: 09        .byte $09
- D - I - - 0x03332B 18:B31B: 11        .byte $11
- D - I - - 0x03332C 18:B31C: 09        .byte $09
- D - I - - 0x03332D 18:B31D: 11        .byte $11
- D - I - - 0x03332E 18:B31E: 14        .byte $14
- D - I - - 0x03332F 18:B31F: 11        .byte $11
- D - I - - 0x033330 18:B320: 37        .byte $37
- D - I - - 0x033331 18:B321: 15        .byte $15
- D - I - - 0x033332 18:B322: 37        .byte $37
- D - I - - 0x033333 18:B323: 19        .byte $19
- D - I - - 0x033334 18:B324: 37        .byte $37
- D - I - - 0x033335 18:B325: 1D        .byte $1D
- D - I - - 0x033336 18:B326: 37        .byte $37
- D - I - - 0x033337 18:B327: 0C        .byte $0C
- D - I - - 0x033338 18:B328: 13        .byte $13
- D - I - - 0x033339 18:B329: 10        .byte $10
- D - I - - 0x03333A 18:B32A: 17        .byte $17
- D - I - - 0x03333B 18:B32B: 10        .byte $10
- D - I - - 0x03333C 18:B32C: 1B        .byte $1B
- D - I - - 0x03333D 18:B32D: 10        .byte $10
- D - I - - 0x03333E 18:B32E: 1F        .byte $1F
- D - I - - 0x03333F 18:B32F: 10        .byte $10
- D - I - - 0x033340 18:B330: 0C        .byte $0C
- D - I - - 0x033341 18:B331: 16        .byte $16
- D - I - - 0x033342 18:B332: 10        .byte $10
- D - I - - 0x033343 18:B333: 09        .byte $09
- D - I - - 0x033344 18:B334: 0F        .byte $0F
- D - I - - 0x033345 18:B335: 09        .byte $09
- D - I - - 0x033346 18:B336: 0F        .byte $0F
- D - I - - 0x033347 18:B337: 09        .byte $09
- D - I - - 0x033348 18:B338: 0F        .byte $0F
- D - I - - 0x033349 18:B339: 14        .byte $14
- D - I - - 0x03334A 18:B33A: 11        .byte $11
- D - I - - 0x03334B 18:B33B: 3A        .byte $3A
- D - I - - 0x03334C 18:B33C: 15        .byte $15
- D - I - - 0x03334D 18:B33D: 3A        .byte $3A
- D - I - - 0x03334E 18:B33E: 19        .byte $19
- D - I - - 0x03334F 18:B33F: 3A        .byte $3A
- D - I - - 0x033350 18:B340: 1D        .byte $1D
- D - I - - 0x033351 18:B341: 3A        .byte $3A
- D - I - - 0x033352 18:B342: 16        .byte $16
- D - I - - 0x033353 18:B343: 13        .byte $13
- D - I - - 0x033354 18:B344: 0F        .byte $0F
- D - I - - 0x033355 18:B345: 17        .byte $17
- D - I - - 0x033356 18:B346: 0F        .byte $0F
- D - I - - 0x033357 18:B347: 1B        .byte $1B
- D - I - - 0x033358 18:B348: 0F        .byte $0F
- D - I - - 0x033359 18:B349: 1F        .byte $1F
- D - I - - 0x03335A 18:B34A: 0F        .byte $0F
- D - I - - 0x03335B 18:B34B: 16        .byte $16
- D - I - - 0x03335C 18:B34C: 0F        .byte $0F
- D - I - - 0x03335D 18:B34D: 1A        .byte $1A
- D - I - - 0x03335E 18:B34E: 10        .byte $10
- D - I - - 0x03335F 18:B34F: 25        .byte $25
- D - I - - 0x033360 18:B350: 11        .byte $11
- D - I - - 0x033361 18:B351: 21        .byte $21
- D - I - - 0x033362 18:B352: 15        .byte $15
- D - I - - 0x033363 18:B353: 21        .byte $21
- D - I - - 0x033364 18:B354: 19        .byte $19
- D - I - - 0x033365 18:B355: 21        .byte $21
- D - I - - 0x033366 18:B356: 1D        .byte $1D
- D - I - - 0x033367 18:B357: 21        .byte $21
- D - I - - 0x033368 18:B358: 1A        .byte $1A
- D - I - - 0x033369 18:B359: 0F        .byte $0F

_off004_B35A_41:
off_B35A:
- D - I - - 0x03336A 18:B35A: 24        .byte $24
- D - I - - 0x03336B 18:B35B: 11        .byte $11
- D - I - - 0x03336C 18:B35C: 13        .byte $13
- D - I - - 0x03336D 18:B35D: 15        .byte $15
- D - I - - 0x03336E 18:B35E: 13        .byte $13
- D - I - - 0x03336F 18:B35F: 19        .byte $19
- D - I - - 0x033370 18:B360: 13        .byte $13
- D - I - - 0x033371 18:B361: 1D        .byte $1D
- D - I - - 0x033372 18:B362: 13        .byte $13
- D - I - - 0x033373 18:B363: 24        .byte $24
- D - I - - 0x033374 18:B364: 11        .byte $11
- D - I - - 0x033375 18:B365: 25        .byte $25
- D - I - - 0x033376 18:B366: 15        .byte $15
- D - I - - 0x033377 18:B367: 25        .byte $25
- D - I - - 0x033378 18:B368: 19        .byte $19
- D - I - - 0x033379 18:B369: 25        .byte $25
- D - I - - 0x03337A 18:B36A: 1D        .byte $1D
- D - I - - 0x03337B 18:B36B: 25        .byte $25
- D - I - - 0x03337C 18:B36C: 24        .byte $24
- D - I - - 0x03337D 18:B36D: 11        .byte $11
- D - I - - 0x03337E 18:B36E: 37        .byte $37
- D - I - - 0x03337F 18:B36F: 15        .byte $15
- D - I - - 0x033380 18:B370: 37        .byte $37
- D - I - - 0x033381 18:B371: 19        .byte $19
- D - I - - 0x033382 18:B372: 37        .byte $37
- D - I - - 0x033383 18:B373: 1D        .byte $1D
- D - I - - 0x033384 18:B374: 37        .byte $37
- D - I - - 0x033385 18:B375: 24        .byte $24
- D - I - - 0x033386 18:B376: 11        .byte $11
- D - I - - 0x033387 18:B377: 3A        .byte $3A
- D - I - - 0x033388 18:B378: 15        .byte $15
- D - I - - 0x033389 18:B379: 3A        .byte $3A
- D - I - - 0x03338A 18:B37A: 19        .byte $19
- D - I - - 0x03338B 18:B37B: 3A        .byte $3A
- D - I - - 0x03338C 18:B37C: 1D        .byte $1D
- D - I - - 0x03338D 18:B37D: 3A        .byte $3A
- D - I - - 0x03338E 18:B37E: 24        .byte $24
- D - I - - 0x03338F 18:B37F: 11        .byte $11
- D - I - - 0x033390 18:B380: 21        .byte $21
- D - I - - 0x033391 18:B381: 15        .byte $15
- D - I - - 0x033392 18:B382: 21        .byte $21
- D - I - - 0x033393 18:B383: 19        .byte $19
- D - I - - 0x033394 18:B384: 21        .byte $21
- D - I - - 0x033395 18:B385: 1D        .byte $1D
- D - I - - 0x033396 18:B386: 21        .byte $21
- D - I - - 0x033397 18:B387: 01        .byte $01
- D - I - - 0x033398 18:B388: 5A B3     .word off_B35A

_off004_B38A_42:
- D - I - - 0x03339A 18:B38A: 0E        .byte $0E
- D - I - - 0x03339B 18:B38B: 16        .byte $16
- D - I - - 0x03339C 18:B38C: 30        .byte $30
- D - I - - 0x03339D 18:B38D: 1A        .byte $1A
- D - I - - 0x03339E 18:B38E: 30        .byte $30
- D - I - - 0x03339F 18:B38F: 13        .byte $13
- D - I - - 0x0333A0 18:B390: 30        .byte $30
- D - I - - 0x0333A1 18:B391: 17        .byte $17
- D - I - - 0x0333A2 18:B392: 30        .byte $30
- D - I - - 0x0333A3 18:B393: 1B        .byte $1B
- D - I - - 0x0333A4 18:B394: 30        .byte $30
- D - I - - 0x0333A5 18:B395: 1F        .byte $1F
- D - I - - 0x0333A6 18:B396: 30        .byte $30
off_B397:
- D - I - - 0x0333A7 18:B397: 1D        .byte $1D
- D - I - - 0x0333A8 18:B398: 0D        .byte $0D
- D - I - - 0x0333A9 18:B399: 30        .byte $30
- D - I - - 0x0333AA 18:B39A: 11        .byte $11
- D - I - - 0x0333AB 18:B39B: 0F        .byte $0F
- D - I - - 0x0333AC 18:B39C: 15        .byte $15
- D - I - - 0x0333AD 18:B39D: 0F        .byte $0F
- D - I - - 0x0333AE 18:B39E: 19        .byte $19
- D - I - - 0x0333AF 18:B39F: 0F        .byte $0F
- D - I - - 0x0333B0 18:B3A0: 1D        .byte $1D
- D - I - - 0x0333B1 18:B3A1: 0F        .byte $0F
- D - I - - 0x0333B2 18:B3A2: 1D        .byte $1D
- D - I - - 0x0333B3 18:B3A3: 0D        .byte $0D
- D - I - - 0x0333B4 18:B3A4: 0F        .byte $0F
- D - I - - 0x0333B5 18:B3A5: 11        .byte $11
- D - I - - 0x0333B6 18:B3A6: 30        .byte $30
- D - I - - 0x0333B7 18:B3A7: 15        .byte $15
- D - I - - 0x0333B8 18:B3A8: 30        .byte $30
- D - I - - 0x0333B9 18:B3A9: 19        .byte $19
- D - I - - 0x0333BA 18:B3AA: 30        .byte $30
- D - I - - 0x0333BB 18:B3AB: 1D        .byte $1D
- D - I - - 0x0333BC 18:B3AC: 30        .byte $30
- D - I - - 0x0333BD 18:B3AD: 01        .byte $01
- D - I - - 0x0333BE 18:B3AE: 97 B3     .word off_B397

_off004_B3B0_43:
off_B3B0:
- D - I - - 0x0333C0 18:B3B0: 1A        .byte $1A
- D - I - - 0x0333C1 18:B3B1: 05        .byte $05
- D - I - - 0x0333C2 18:B3B2: 30        .byte $30
- D - I - - 0x0333C3 18:B3B3: 0D        .byte $0D
- D - I - - 0x0333C4 18:B3B4: 30        .byte $30
- D - I - - 0x0333C5 18:B3B5: 22        .byte $22
- D - I - - 0x0333C6 18:B3B6: 05        .byte $05
- D - I - - 0x0333C7 18:B3B7: 25        .byte $25
- D - I - - 0x0333C8 18:B3B8: 0D        .byte $0D
- D - I - - 0x0333C9 18:B3B9: 25        .byte $25
- D - I - - 0x0333CA 18:B3BA: 01        .byte $01
- D - I - - 0x0333CB 18:B3BB: B0 B3     .word off_B3B0



tbl_B3CF_вид_меню:
    .word off_B453_00_period_number_and_time                    ; номер тайма и время
    .word off_B464_01_team_names_and_score                      ; сокращения команд и счет
    .word off_B47D_02_player_action_window                      ; обычный набор действий для полевого и кипера
    .word off_B48A_03_player_dribble_pass_shoot
    .word off_B4A7_04_player_trap_pass_shot
    .word off_B4C4_05_player_trap_pass_clearing
    .word off_B4E1_06_gk_punch_catch
    .word off_B4FA_07_gk_action_window_vs_player                ; действие когда ты на штрафной соперника и нападаешь на него
    .word off_B507_08_gk_counter_drib_shot
    .word off_B528_09_2_specials
    .word off_B539_0A_3_specials
    .word off_B54E_0B_4_specials
    .word off_B567_0C_2_defensive_specials
    .word off_B578_0D_gk_dive
    .word $0000      ; unused, тут была копия 0F
    .word off_B58D_0F_pass_select_a_teammate
    .word off_B5A2_10_1_2_pass_choose_a_partner
    .word off_B5B7_11_no_players_nearby                         ; не с кем перепасоваться, напарники далеко
    .word off_B5C8_12_1_player_action_window
    .word off_B5D9_13_2_players_action_window                   ; действие нескольких игроков при нападении на соперника
    .word off_B5EE_14_3_players_action_window
    .word off_B607_15_4_players_action_window
    .word off_B624_16_defender_tackle_block_passcut
    .word off_B641_17_player_interfere_passcut
    .word off_B65A_18_player_clearing_passcut
    .word off_B673_19_show_2_teammates                          ; показать напарников при перемещении курсора паса
    .word off_B688_1A_show_3_teammates
    .word off_B6A1_1B_show_4_teammates
    .word off_B6BE_1C_clear_receiver_stats_window               ; очистить окно статов принимаюшего
    .word off_B6C7_1D_receiver_dribble_pass_shoot               ; отобразить статы принимающего
    .word off_B6E4_1E_opponent_trap_clearing_pass           ; unused
    .word off_B701_1F_opponent_trap_shot_pass               ; unused
    .word off_B71E_20_show_1_opponent                           ; показать соперников при перемещении курсора паса
    .word off_B72F_21_show_2_opponents
    .word off_B744_22_show_3_opponents
    .word off_B75D_23_show_4_opponents
    .word off_B77A_24_select_1_of_2_teammates_for_pass          ; выбрать одного из напарников для паса
    .word off_B78F_25_select_1_of_3_teammates_for_pass
    .word off_B7A8_26_select_1_of_4_teammates_for_pass
    .word off_B7C5_27_free_kick_taker
    .word off_B7FE_28_rearrange_players_no_yes
    .word off_B813_29_rearrange_select_done
    .word off_B828_2A_aim_left_right
    .word off_B83D_2B_wall_left_right
    .word off_B852_2C_pk_aim
    .word off_B85F_2D_pk_dive
    .word off_B86C_2E_corner_kick_taker
    .word off_B8A5_2F_select_penalty_taker
    .word off_B8DE_30_display_name_stamina_at_the_top
    .word off_B8EF_31_display_name_number_at_the_top
    .word off_B900_32_display_name_opponent_at_the_top          ; когда мяч у соперника и тот бежит по полю
    .word off_B90D_33_resume_play_edit_team_data
    .word off_B922_34_formation_defense_swap_status_done
    .word off_B93F_35_formation
    .word off_B95C_36_defense
    .word off_B975_37_swap
    .word off_B98A_38_no_subs_left
    .word off_B99B_39_swap_main_players
    .word off_B9F8_3A_swap_sub_players
    .word off_BA39_3B_whom_to_sub
    .word off_BAA2_3C_stamina_fielded_players
    .word off_BB03_3D_stamina_substitutes_bench
    .word off_BB5C_3E_pk_shootout_select_taker
    .word off_BB69_3F_pk_players_list
    .word off_BB9E_40_pk_order
    .word off_BBBF_41_pk_score
    .word off_BC02_42_booth_for_charlie_time_score_period_number
    .word off_BC03_43_booth_for_charlie_pk_period_number
    .word off_BC04_44_show_1_defender
    .word off_BC05_45_show_2_defenders
    .word off_BC06_46_show_3_defenders
    .word off_BC07_47_show_4_defenders



con_plr_name_pos                        = $E0           ; позиция и имя игрока
con_stats_attack                        = $E1           ; статы нападающего при владении мячом у тебя + числовая величина параметра
    con_atk_stamina                         = $00
    con_atk_shoot                           = $01           ; на поле
    con_atk_pass                            = $02           ; на поле
    con_atk_dribble                         = $03
    con_atk_air_shoot                       = $07           ; на штрафной
    con_atk_air_pass                        = $08           ; на штрафной
    con_atk_trap                            = $09
    con_atk_clearing                        = $0B
con_rec_name_pos                        = $E2           ; позиция и имя принимающего
con_stats_receiver                      = $E3
    con_rec_stamina                         = $00
    con_rec_shoot                           = $01
    con_rec_pass                            = $02
    con_rec_dribble                         = $03
    con_rec_trap                            = $09           ; unused
    con_rec_clearing                        = $0B           ; unused
con_specials_list                       = $E4           ; список спешалов (00-03)
con_defender_actions                    = $E5           ; действия игроков защиты (00-03)
con_defender_special                    = $E6           ; + 00 (обычная защита) или 01 (спешал)
con_def_name_pos                        = $E7           ; позиция и имя защитника
con_stats_defense                       = $E8           ; статы защитника при владении мячом у компьютера + числовая величина параметра
    con_def_stamina                         = $00
    con_def_block                           = $04
    con_def_tackle                          = $05
    con_def_passcut_1                       = $06           ; на поле
    con_def_clearing                        = $0C
    con_def_interfere                       = $0D
    con_def_passcut_2                       = $0E           ; на штрафной
con_rec_name_teammate                   = $E9           ; + номер 00-04, имя принимающего пас напарника (для списка из нескольких игроков)
con_rec_name_opponent                   = $EA           ; + номер 00-04, имя принимающего пас соперника (для списка из нескольких игроков)
con_gk_name_pos                         = $EB
con_stats_gk                            = $EC
    con_gk_stamina                         = $00
    con_gk_pass                            = $18            ; unused
    con_gk_catch                           = $19
    con_gk_punch                           = $1A
    con_gk_stop_dribble                    = $1B
    con_gk_stop_shot                       = $1C
    con_gk_dive_lo                         = $1D
    con_gk_dive_hi                         = $1E            ; unused
con_team_name                           = $ED           ; + 00 (имя команды слева) или 01 (имя команды справа)
con_score                               = $EE           ; + 00 (счет команды слева) или 01 (счет команды справа)
con_period_number                       = $EF           ; номер тайма, овертайма, пк
con_time                                = $F0           ; время тайма
con_menu_name                           = $F1           ; имена из меню, 00-0A основные, 16-1F запасные
con_control_plr_name                    = $F2           ; имя управляемого игрока
con_opp_def_name                        = $F3           ; имя защитника из списка напавших соперников
con_plr_with_ball_name                  = $F4           ; имя игрока с мячом
con_plr_stamina                         = $F5           ; 00-0A основные, 16-1F запасные
con_pk_players_list                     = $F6
con_control_plr_number                  = $F7           ; номер игрока с мячом
con_ball_height_arrow                   = $F8           ; стрелочка с указанием высоты мяча
con_not_a_clone_indicator               = $F9           ; 00-03, +00 = индикатор принимающего, +80 = индикатор защитника
; unused                                = $FA
; unused                                = $FB
con_закончить                           = $FC
; unused                                = $FD
; unused                                = $FE
; unused                                = $FF



off_B453_00_period_number_and_time:
; номер набора контура окна
; id of the window outline
    .byte $02 * $09
; адрес ppu
    .word $2281
; X * Y зачищаемой области (вне этой области текст не запишется)
; size of cleared space
    ; beyond this area nothing will be drawn later
    ; it's like allotting a fixed area for a window
    .byte $05
    .byte $00
; смещение окна X, Y        (window offset)
    ; окно по X должно быть минимум на 01 меньше очистки чтобы увидеть нижнюю границу
    ; а также X предположительно не может быть < 03
    .byte $00
    .byte $00
; размер окна X, Y          (window size)
    .byte $05
    .byte $00
; количество поинтеров      (number of following pointers)
    .byte $01
; смещение текста Y, X + поинтеры на текст      (text offset + pointers)
    .byte $00
    .byte $04
    .word @time

@time:
    .byte con_time
    .byte con_закончить






off_B464_01_team_names_and_score:
; номер набора контура окна
    .byte $02 * $09
; адрес ppu
    .word $22C1
; X * Y зачищаемой области
    .byte $05
    .byte $00
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $05
    .byte $00
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @score_left
    .byte $00
    .byte $02
    .word @dash
    .byte $00
    .byte $03
    .word @score_right

@score_left:
    .byte con_score, $00
    .byte con_закончить

@dash:
    .text "-"
    .byte con_закончить

@score_right:
    .byte con_score, $01
    .byte con_закончить






off_B47D_02_player_action_window:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $04
; количество поинтеров
    .byte $02
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $04
    .byte $04
    .word @arrow

@txt:
    .byte $80, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить

@arrow:
    .byte con_ball_height_arrow
    .byte con_закончить





off_B48A_03_player_dribble_pass_shoot:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество текста
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @dribble
    .byte $06
    .byte $01
    .word @pass
    .byte $08
    .byte $01
    .word @shoot

@name_pos:
    .byte con_plr_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_attack, con_atk_stamina
    .byte con_закончить

@dribble:
    .text "Dribble    "
    .byte con_stats_attack, con_atk_dribble
    .byte con_закончить

@pass:
    .text "Pass       "
    .byte con_stats_attack, con_atk_pass
    .byte con_закончить

@shoot:
    .text "Shoot      "
    .byte con_stats_attack, con_atk_shoot
    .byte con_закончить






off_B4A7_04_player_trap_pass_shot:
; не зависит от низкого и высокого мяча, видимо статы вычисляются отдельно
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @trap
    .byte $06
    .byte $01
    .word @pass
    .byte $08
    .byte $01
    .word @shot

@name_pos:
    .byte con_plr_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_attack, con_atk_stamina
    .byte con_закончить

@trap:
    .text "Trap       "
    .byte con_stats_attack, con_atk_trap
    .byte con_закончить

@pass:
    .text "Pass       "
    .byte con_stats_attack, con_atk_air_pass
    .byte con_закончить

@shot:
    .text "Shoot      "
    .byte con_stats_attack, con_atk_air_shoot
    .byte con_закончить






off_B4C4_05_player_trap_pass_clearing:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @trap
    .byte $06
    .byte $01
    .word @pass
    .byte $08
    .byte $01
    .word @clearing

@name_pos:
    .byte con_plr_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_attack, con_atk_stamina
    .byte con_закончить

@trap:
    .text "Trap       "
    .byte con_stats_attack, con_atk_trap
    .byte con_закончить

@pass:
    .text "Pass       "
    .byte con_stats_attack, con_atk_air_pass
    .byte con_закончить

@clearing:
    .text "Clearing   "
    .byte con_stats_attack, con_atk_clearing
    .byte con_закончить






off_B4E1_06_gk_punch_catch:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @punch
    .byte $06
    .byte $01
    .word @catch

@name_pos:
    .byte con_gk_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_gk, con_gk_stamina
    .byte con_закончить

@punch:
    .text "Punch      "
    .byte con_stats_gk, con_gk_punch
    .byte con_закончить

@catch:
    .text "Catch      "
    .byte con_stats_gk, con_gk_catch
    .byte con_закончить






off_B4FA_07_gk_action_window_vs_player:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $04
; количество поинтеров
    .byte $01
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt

@txt:
    .byte $86, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить






off_B507_08_gk_counter_drib_shot:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $06
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @stop_dribble_1
    .byte $05
    .byte $01
    .word @stop_dribble_2
    .byte $07
    .byte $01
    .word @stop_shot_1
    .byte $08
    .byte $01
    .word @stop_shot_2

@name_pos:
    .byte con_gk_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_gk, con_gk_stamina
    .byte con_закончить

@stop_dribble_1:
    .text "Stop"
    .byte con_закончить

@stop_dribble_2:
    .text " dribble   "
    .byte con_stats_gk, con_gk_stop_dribble
    .byte con_закончить

@stop_shot_1:
    .text "Stop"
    .byte con_закончить

@stop_shot_2:
    .text " shot      "
    .byte con_stats_gk, con_gk_stop_shot
    .byte con_закончить






off_B528_09_2_specials:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2268
; X * Y зачищаемой области
    .byte $13
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $13
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @special_1
    .byte $04
    .byte $02
    .word @special_2

@txt:
    .text " Specials "
    .byte con_закончить

@special_1:
    .byte con_specials_list, $00
    .byte con_закончить

@special_2:
    .byte con_specials_list, $01
    .byte con_закончить






off_B539_0A_3_specials:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2268
; X * Y зачищаемой области
    .byte $13
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $13
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @special_1
    .byte $04
    .byte $02
    .word @special_2
    .byte $06
    .byte $02
    .word @special_3

@txt:
    .text " Specials "
    .byte con_закончить

@special_1:
    .byte con_specials_list, $00
    .byte con_закончить

@special_2:
    .byte con_specials_list, $01
    .byte con_закончить

@special_3:
    .byte con_specials_list, $02
    .byte con_закончить






off_B54E_0B_4_specials:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2268
; X * Y зачищаемой области
    .byte $13
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $13
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @special_1
    .byte $04
    .byte $02
    .word @special_2
    .byte $06
    .byte $02
    .word @special_3
    .byte $08
    .byte $02
    .word @special_4

@txt:
    .text " Specials "
    .byte con_закончить

@special_1:
    .byte con_specials_list, $00
    .byte con_закончить

@special_2:
    .byte con_specials_list, $01
    .byte con_закончить

@special_3:
    .byte con_specials_list, $02
    .byte con_закончить

@special_4:
    .byte con_specials_list, $03
    .byte con_закончить






off_B567_0C_2_defensive_specials:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
; подкат, перехват, блок
    .word $2268
; X * Y зачищаемой области
    .byte $13
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $13
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @special_1
    .byte $04
    .byte $02
    .word @special_2

@txt:
    .text " Specials "
    .byte con_закончить

@special_1:
    .byte con_defender_special, $00
    .byte con_закончить

@special_2:
    .byte con_defender_special, $01
    .byte con_закончить





off_B578_0D_gk_dive:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @dive

@name_pos:
    .byte con_gk_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_gk, con_gk_stamina
    .byte con_закончить

@dive:
    .text "Dive       "
    .byte con_stats_gk, con_gk_dive_lo
    .byte con_закончить






off_B58D_0F_pass_select_a_teammate:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $19
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt_1
    .byte $02
    .byte $01
    .word @txt_2
    .byte $04
    .byte $01
    .word @txt_3

@txt_1:
    .text " Pass "
    .byte con_закончить

@txt_2:
    .text "Select a"
    .byte con_закончить

@txt_3:
    .text "teammate"
    .byte con_закончить






off_B5A2_10_1_2_pass_choose_a_partner:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $01
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3

@txt_1:
    .text "1-2 Pass"
    .byte con_закончить

@txt_2:
    .text "Choose a"
    .byte con_закончить

@txt_3:
    .text "partner"
    .byte con_закончить






off_B5B7_11_no_players_nearby:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $04
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3
    .byte $06
    .byte $02
    .word @txt_4

@txt_1:
    .text "1-2 Pass"
    .byte con_закончить

@txt_2:
    .text "No"
    .byte con_закончить
    
@txt_3:
    .text "players"
    .byte con_закончить
    
@txt_4:
    .text "nearby!"
    .byte con_закончить






off_B5C8_12_1_player_action_window:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $03
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $03
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $01
    .byte $01
    .word @name_1
    .byte $03
    .byte $04
    .word @arrow

@txt:
    .byte $80, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить

@name_1:
    .byte con_defender_actions, $00
    .byte con_закончить

@arrow:
    .byte con_ball_height_arrow
    .byte con_закончить






off_B5D9_13_2_players_action_window:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $01
    .byte $01
    .word @name_1
    .byte $03
    .byte $01
    .word @name_2
    .byte $05
    .byte $04
    .word @arrow

@txt:
    .byte $80, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить

@name_1:
    .byte con_defender_actions, $00
    .byte con_закончить

@name_2:
    .byte con_defender_actions, $01
    .byte con_закончить

@arrow:
    .byte con_ball_height_arrow
    .byte con_закончить






off_B5EE_14_3_players_action_window:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $07
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $01
    .byte $01
    .word @name_1
    .byte $03
    .byte $01
    .word @name_2
    .byte $05
    .byte $01
    .word @name_3
    .byte $07
    .byte $04
    .word @arrow

@txt:
    .byte $80, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить

@name_1:
    .byte con_defender_actions, $00
    .byte con_закончить

@name_2:
    .byte con_defender_actions, $01
    .byte con_закончить

@name_3:
    .byte con_defender_actions, $02
    .byte con_закончить

@arrow:
    .byte con_ball_height_arrow
    .byte con_закончить






off_B607_15_4_players_action_window:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $09
; количество поинтеров
    .byte $06
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $01
    .byte $01
    .word @name_1
    .byte $03
    .byte $01
    .word @name_2
    .byte $05
    .byte $01
    .word @name_3
    .byte $07
    .byte $01
    .word @name_4
    .byte $09
    .byte $04
    .word @arrow

@txt:
    .byte $80, $81, $82, $83, $84, $85, $86     ; Action
    .byte con_закончить

@name_1:
    .byte con_defender_actions, $00
    .byte con_закончить

@name_2:
    .byte con_defender_actions, $01
    .byte con_закончить

@name_3:
    .byte con_defender_actions, $02
    .byte con_закончить

@name_4:
    .byte con_defender_actions, $03
    .byte con_закончить

@arrow:
    .byte con_ball_height_arrow
    .byte con_закончить






off_B624_16_defender_tackle_block_passcut:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @tackle
    .byte $06
    .byte $01
    .word @block
    .byte $08
    .byte $01
    .word @passcut

@name:
    .byte con_def_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_defense, con_def_stamina
    .byte con_закончить

@tackle:
    .text "Tackle     "
    .byte con_stats_defense, con_def_tackle
    .byte con_закончить

@block:
    .text "Block      "
    .byte con_stats_defense, con_def_block
    .byte con_закончить

@passcut:
    .text "Pass cut   "
    .byte con_stats_defense, con_def_passcut_1
    .byte con_закончить






off_B641_17_player_interfere_passcut:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @interfere
    .byte $06
    .byte $01
    .word @passcut

@name:
    .byte con_def_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_defense, con_def_stamina
    .byte con_закончить

@interfere:
    .text "Interfere  "
    .byte con_stats_defense, con_def_interfere
    .byte con_закончить

@passcut:
    .text "Pass cut   "
    .byte con_stats_defense, con_def_passcut_2
    .byte con_закончить






off_B65A_18_player_clearing_passcut:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @clearing
    .byte $06
    .byte $01
    .word @passcut

@name:
    .byte con_def_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_defense, con_def_stamina
    .byte con_закончить

@clearing:
    .text "Clearing   "
    .byte con_stats_defense, con_def_clearing
    .byte con_закончить

@passcut:
    .text "Pass cut   "
    .byte con_stats_defense, con_def_passcut_2
    .byte con_закончить






off_B673_19_show_2_teammates:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $03
    .word @receiver_1
    .byte $04
    .byte $03
    .word @receiver_2

@txt:
    .text "Teammates"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить






off_B688_1A_show_3_teammates:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $03
    .word @receiver_1
    .byte $04
    .byte $03
    .word @receiver_2
    .byte $06
    .byte $03
    .word @receiver_3

@txt:
    .text "Teammates"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить

@receiver_3:
    .byte con_rec_name_teammate, $02
    .byte con_закончить






off_B6A1_1B_show_4_teammates:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $03
    .word @receiver_1
    .byte $04
    .byte $03
    .word @receiver_2
    .byte $06
    .byte $03
    .word @receiver_3
    .byte $08
    .byte $03
    .word @receiver_4

@txt:
    .text "Teammates"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить

@receiver_3:
    .byte con_rec_name_teammate, $02
    .byte con_закончить

@receiver_4:
    .byte con_rec_name_teammate, $03
    .byte con_закончить






off_B6BE_1C_clear_receiver_stats_window:
; номер набора контура окна
    .byte $02 * $09
; адрес ppu
; требуется когда перемещаешь курсор паса по полю и в курсоре никого нету
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $00






off_B6C7_1D_receiver_dribble_pass_shoot:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @name_pos
    .byte $02
    .byte $01
    .word @stamina
    .byte $04
    .byte $01
    .word @dribble
    .byte $06
    .byte $01
    .word @pass
    .byte $08
    .byte $01
    .word @shoot

@name_pos:
    .byte con_rec_name_pos
    .byte con_закончить

@stamina:
    .text "Stamina    "
    .byte con_stats_receiver, con_rec_stamina
    .byte con_закончить

@dribble:
    .text "Dribble    "
    .byte con_stats_receiver, con_rec_dribble
    .byte con_закончить

@pass:
    .text "Pass       "
    .byte con_stats_receiver, con_rec_pass
    .byte con_закончить

@shoot:
    .text "Shoot      "
    .byte con_stats_receiver, con_rec_shoot
    .byte con_закончить






off_B6E4_1E_opponent_trap_clearing_pass:
                                        .byte $00
- - - - - - 0x0336F4 18:B6E4: 32 22     .word $2232

- - - - - - 0x0336F6 18:B6E6: 0C        .byte $0C
- - - - - - 0x0336F7 18:B6E7: 0A        .byte $0A

- - - - - - 0x0336F8 18:B6E8: 00        .byte $00
- - - - - - 0x0336F9 18:B6E9: 01        .byte $01

- - - - - - 0x0336FA 18:B6EA: 0C        .byte $0C
- - - - - - 0x0336FB 18:B6EB: 09        .byte $09

- - - - - - 0x0336FC 18:B6EC: 05        .byte $05

- - - - - - 0x0336FD 18:B6ED: 01        .byte $01
- - - - - - 0x0336FE 18:B6EE: 02        .byte $02
- - - - - - 0x0336FF 18:B6EF: F9 BC     .word off_BCF9_позиция_и_имя_принимающего
- - - - - - 0x033701 18:B6F1: 03        .byte $03
- - - - - - 0x033702 18:B6F2: 01        .byte $01
- - - - - - 0x033703 18:B6F3: FB BC     .word off_BCFB_энергия_принимающего
- - - - - - 0x033705 18:B6F5: 05        .byte $05
- - - - - - 0x033706 18:B6F6: 01        .byte $01
- - - - - - 0x033707 18:B6F7: 27 BD     .word off_BD27
- - - - - - 0x033709 18:B6F9: 07        .byte $07
- - - - - - 0x03370A 18:B6FA: 01        .byte $01
- - - - - - 0x03370B 18:B6FB: 32 BD     .word off_BD32
- - - - - - 0x03370D 18:B6FD: 09        .byte $09
- - - - - - 0x03370E 18:B6FE: 01        .byte $01
- - - - - - 0x03370F 18:B6FF: 1C BD     .word off_BD1C_pass_принимающего






off_B701_1F_opponent_trap_shot_pass:
                                        .byte $00
- - - - - - 0x033711 18:B701: 32 22     .word $2232

- - - - - - 0x033713 18:B703: 0C        .byte $0C
- - - - - - 0x033714 18:B704: 0A        .byte $0A

- - - - - - 0x033715 18:B705: 00        .byte $00
- - - - - - 0x033716 18:B706: 01        .byte $01

- - - - - - 0x033717 18:B707: 0C        .byte $0C
- - - - - - 0x033718 18:B708: 09        .byte $09

- - - - - - 0x033719 18:B709: 05        .byte $05

- - - - - - 0x03371A 18:B70A: 01        .byte $01
- - - - - - 0x03371B 18:B70B: 02        .byte $02
- - - - - - 0x03371C 18:B70C: F9 BC     .word off_BCF9_позиция_и_имя_принимающего
- - - - - - 0x03371E 18:B70E: 03        .byte $03
- - - - - - 0x03371F 18:B70F: 01        .byte $01
- - - - - - 0x033720 18:B710: FB BC     .word off_BCFB_энергия_принимающего
- - - - - - 0x033722 18:B712: 05        .byte $05
- - - - - - 0x033723 18:B713: 01        .byte $01
- - - - - - 0x033724 18:B714: 27 BD     .word off_BD27
- - - - - - 0x033726 18:B716: 07        .byte $07
- - - - - - 0x033727 18:B717: 01        .byte $01
- - - - - - 0x033728 18:B718: 06 BD     .word off_BD06_shoot_принимающего
- - - - - - 0x03372A 18:B71A: 09        .byte $09
- - - - - - 0x03372B 18:B71B: 01        .byte $01
- - - - - - 0x03372C 18:B71C: 1C BD     .word off_BD1C_pass_принимающего






off_B71E_20_show_1_opponent:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $03
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @opponent_1

@txt:
    .text "Opponent"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $00
    .byte con_закончить

@opponent_1:
    .byte con_rec_name_opponent, $00
    .byte con_закончить






off_B72F_21_show_2_opponents:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $05
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @opponent_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @opponent_2

@txt:
    .text "Opponents"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $00
    .byte con_закончить

@opponent_1:
    .byte con_rec_name_opponent, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $01
    .byte con_закончить

@opponent_2:
    .byte con_rec_name_opponent, $01
    .byte con_закончить






off_B744_22_show_3_opponents:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $07
; количество поинтеров
    .byte $07
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @opponent_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @opponent_2
    .byte $06
    .byte $01
    .word @indicator_3
    .byte $06
    .byte $03
    .word @opponent_3

@txt:
    .text "Opponents"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $00
    .byte con_закончить

@opponent_1:
    .byte con_rec_name_opponent, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $01
    .byte con_закончить

@opponent_2:
    .byte con_rec_name_opponent, $01
    .byte con_закончить

@indicator_3:
    .byte con_not_a_clone_indicator, $02
    .byte con_закончить

@opponent_3:
    .byte con_rec_name_opponent, $02
    .byte con_закончить






off_B75D_23_show_4_opponents:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $09
; количество поинтеров
    .byte $09
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @opponent_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @opponent_2
    .byte $06
    .byte $01
    .word @indicator_3
    .byte $06
    .byte $03
    .word @opponent_3
    .byte $08
    .byte $01
    .word @indicator_4
    .byte $08
    .byte $03
    .word @opponent_4

@txt:
    .text "Opponents"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $00
    .byte con_закончить

@opponent_1:
    .byte con_rec_name_opponent, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $01
    .byte con_закончить

@opponent_2:
    .byte con_rec_name_opponent, $01
    .byte con_закончить

@indicator_3:
    .byte con_not_a_clone_indicator, $02
    .byte con_закончить

@opponent_3:
    .byte con_rec_name_opponent, $02
    .byte con_закончить

@indicator_4:
    .byte con_not_a_clone_indicator, $03
    .byte con_закончить

@opponent_4:
    .byte con_rec_name_opponent, $03
    .byte con_закончить






off_B77A_24_select_1_of_2_teammates_for_pass:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @receiver_1
    .byte $04
    .byte $02
    .word @receiver_2

@txt:
    .text "To whom?"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить






off_B78F_25_select_1_of_3_teammates_for_pass:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $07
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @receiver_1
    .byte $04
    .byte $02
    .word @receiver_2
    .byte $06
    .byte $02
    .word @receiver_3

@txt:
    .text "To whom?"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить

@receiver_3:
    .byte con_rec_name_teammate, $02
    .byte con_закончить






off_B7A8_26_select_1_of_4_teammates_for_pass:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $09
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $02
    .word @receiver_1
    .byte $04
    .byte $02
    .word @receiver_2
    .byte $06
    .byte $02
    .word @receiver_3
    .byte $08
    .byte $02
    .word @receiver_4

@txt:
    .text "To whom?"
    .byte con_закончить

@receiver_1:
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@receiver_2:
    .byte con_rec_name_teammate, $01
    .byte con_закончить

@receiver_3:
    .byte con_rec_name_teammate, $02
    .byte con_закончить

@receiver_4:
    .byte con_rec_name_teammate, $03
    .byte con_закончить






off_B7C5_27_free_kick_taker:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2228
; X * Y зачищаемой области
    .byte $17
    .byte $0B
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $17
    .byte $0B
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $03
    .word @txt
    .byte $02
    .byte $03
    .word @name_2
    .byte $04
    .byte $03
    .word @name_3
    .byte $06
    .byte $03
    .word @name_4
    .byte $08
    .byte $03
    .word @name_5
    .byte $0A
    .byte $03
    .word @name_6
    .byte $02
    .byte $0D
    .word @name_7
    .byte $04
    .byte $0D
    .word @name_8
    .byte $06
    .byte $0D
    .word @name_9
    .byte $08
    .byte $0D
    .word @name_10
    .byte $0A
    .byte $0D
    .word @name_11

@txt:
    .text " Free Kick taker "
    .byte con_закончить

@name_2:
    .byte con_menu_name, $01
    .byte con_закончить

@name_3:
    .byte con_menu_name, $02
    .byte con_закончить

@name_4:
    .byte con_menu_name, $03
    .byte con_закончить

@name_5:
    .byte con_menu_name, $04
    .byte con_закончить

@name_6:
    .byte con_menu_name, $05
    .byte con_закончить

@name_7:
    .byte con_menu_name, $06
    .byte con_закончить

@name_8:
    .byte con_menu_name, $07
    .byte con_закончить

@name_9:
    .byte con_menu_name, $08
    .byte con_закончить

@name_10:
    .byte con_menu_name, $09
    .byte con_закончить

@name_11:
    .byte con_menu_name, $0A
    .byte con_закончить






off_B7FE_28_rearrange_players_no_yes:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2228
; X * Y зачищаемой области
    .byte $18
    .byte $0C
; смещение окна X, Y
    .byte $03
    .byte $05
; размер окна X, Y
    .byte $09
    .byte $04
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $03
    .word @txt_1
    .byte $03
    .byte $01
    .word @txt_2
    .byte $06
    .byte $07
    .word @txt_3
    .byte $08
    .byte $07
    .word @txt_4

@txt_1:
    .text "Rearrange"
    .byte con_закончить

@txt_2:
    .text "your players?"
    .byte con_закончить

@txt_3:
    .text "No"
    .byte con_закончить

@txt_4:
    .text "Yes"
    .byte con_закончить






off_B813_29_rearrange_select_done:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $0F
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $03
    .word @txt_2
    .byte $04
    .byte $03
    .word @txt_3

@txt_1:
    .text "Rearrange"
    .byte con_закончить

@txt_2:
    .text "Select"
    .byte con_закончить

@txt_3:
    .text "Done"
    .byte con_закончить






off_B828_2A_aim_left_right:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $18
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $03
    .word @txt_1
    .byte $02
    .byte $03
    .word @txt_2
    .byte $04
    .byte $03
    .word @txt_3

@txt_1:
    .text " Aim "
    .byte con_закончить

@txt_2:
    .text "Left"
    .byte con_закончить

@txt_3:
    .text "Right"
    .byte con_закончить






off_B83D_2B_wall_left_right:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2247
; X * Y зачищаемой области
    .byte $19
    .byte $09
; смещение окна X, Y
    .byte $02
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $04
    .word @txt_1
    .byte $02
    .byte $05
    .word @txt_2
    .byte $04
    .byte $05
    .word @txt_3

@txt_1:
    .text " Wall "
    .byte con_закончить

@txt_2:
    .text "Left"
    .byte con_закончить

@txt_3:
    .text "Right"
    .byte con_закончить






off_B852_2C_pk_aim:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
; также используется при нарушении во время игры
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $04
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $04
; количество поинтеров
    .byte $01
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $03
    .word @txt

@txt:
    .text " Aim "
    .byte con_закончить






off_B85F_2D_pk_dive:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
; также используется при нарушении во время игры
    .word $2247
; X * Y зачищаемой области
    .byte $0B
    .byte $04
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0B
    .byte $04
; количество поинтеров
    .byte $02
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $03
    .word @txt

@txt:
    .text $87, $88, $89, $8A, $8B       ; Dive
    .byte con_закончить






off_B86C_2E_corner_kick_taker:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2228
; X * Y зачищаемой области
    .byte $17
    .byte $0B
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $17
    .byte $0B
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $03
    .word @name_2
    .byte $04
    .byte $03
    .word @name_3
    .byte $06
    .byte $03
    .word @name_4
    .byte $08
    .byte $03
    .word @name_5
    .byte $0A
    .byte $03
    .word @name_6
    .byte $02
    .byte $0D
    .word @name_7
    .byte $04
    .byte $0D
    .word @name_8
    .byte $06
    .byte $0D
    .word @name_9
    .byte $08
    .byte $0D
    .word @name_10
    .byte $0A
    .byte $0D
    .word @name_11

@txt:
    .text " Corner Kick taker "
    .byte con_закончить

@name_2:
    .byte con_menu_name, $01
    .byte con_закончить

@name_3:
    .byte con_menu_name, $02
    .byte con_закончить

@name_4:
    .byte con_menu_name, $03
    .byte con_закончить

@name_5:
    .byte con_menu_name, $04
    .byte con_закончить

@name_6:
    .byte con_menu_name, $05
    .byte con_закончить

@name_7:
    .byte con_menu_name, $06
    .byte con_закончить

@name_8:
    .byte con_menu_name, $07
    .byte con_закончить

@name_9:
    .byte con_menu_name, $08
    .byte con_закончить

@name_10:
    .byte con_menu_name, $09
    .byte con_закончить

@name_11:
    .byte con_menu_name, $0A
    .byte con_закончить






off_B8A5_2F_select_penalty_taker:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2228
; X * Y зачищаемой области
    .byte $17
    .byte $0B
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $17
    .byte $0B
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $03
    .word @name_2
    .byte $04
    .byte $03
    .word @name_3
    .byte $06
    .byte $03
    .word @name_4
    .byte $08
    .byte $03
    .word @name_5
    .byte $0A
    .byte $03
    .word @name_6
    .byte $02
    .byte $0D
    .word @name_7
    .byte $04
    .byte $0D
    .word @name_8
    .byte $06
    .byte $0D
    .word @name_9
    .byte $08
    .byte $0D
    .word @name_10
    .byte $0A
    .byte $0D
    .word @name_11

@txt:
    .text "Select Penalty taker"
    .byte con_закончить

@name_2:
    .byte con_menu_name, $01
    .byte con_закончить

@name_3:
    .byte con_menu_name, $02
    .byte con_закончить

@name_4:
    .byte con_menu_name, $03
    .byte con_закончить

@name_5:
    .byte con_menu_name, $04
    .byte con_закончить

@name_6:
    .byte con_menu_name, $05
    .byte con_закончить

@name_7:
    .byte con_menu_name, $06
    .byte con_закончить

@name_8:
    .byte con_menu_name, $07
    .byte con_закончить

@name_9:
    .byte con_menu_name, $08
    .byte con_закончить

@name_10:
    .byte con_menu_name, $09
    .byte con_закончить

@name_11:
    .byte con_menu_name, $0A
    .byte con_закончить






off_B8DE_30_display_name_stamina_at_the_top:
; номер набора контура окна
    .byte $03 * $09
; адрес ppu
    .word $2001
; X * Y зачищаемой области
    .byte $0F
    .byte $02
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0F
    .byte $02
; количество текста
    .byte $02
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $01
    .word @имя_игрока_с_мячом
    .byte $01
    .byte $0D
    .word @энергия

@имя_игрока_с_мячом:
    .byte con_plr_with_ball_name
    .byte con_закончить

@энергия:
    .byte con_stats_attack, con_atk_stamina
    .byte con_закончить






off_B8EF_31_display_name_number_at_the_top:
; номер набора контура окна
    .byte $03 * $09
; адрес ppu
; когда мяч у соперника и тот бежит по полю
    .word $2001
; X * Y зачищаемой области
    .byte $0F
    .byte $02
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0F
    .byte $02
; количество текста
    .byte $02
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $02
    .word @номер_управляемого_игрока
    .byte $01
    .byte $05
    .word @имя_управляемого_игрока

@номер_управляемого_игрока:
    .byte con_control_plr_number
    .byte con_закончить

@имя_управляемого_игрока:
    .byte con_control_plr_name
    .byte con_закончить






off_B900_32_display_name_opponent_at_the_top:
; номер набора контура окна
    .byte $03 * $09
; адрес ppu
    .word $2011
; X * Y зачищаемой области
    .byte $0E
    .byte $02
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $02
; количество текста
    .byte $01
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $03
    .word @имя_игрока_с_мячом

@имя_игрока_с_мячом:
    .byte con_plr_with_ball_name
    .byte con_закончить






off_B90D_33_resume_play_edit_team_data:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2248
; X * Y зачищаемой области
    .byte $18
    .byte $0B
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $13
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $05
    .word @txt_1
    .byte $02
    .byte $03
    .word @txt_2
    .byte $04
    .byte $03
    .word @txt_3

@txt_1:
    .text " Action "
    .byte con_закончить

@txt_2:
    .text "Resume Play"
    .byte con_закончить

@txt_3:
    .text "Edit Team Data"
    .byte con_закончить






off_B922_34_formation_defense_swap_status_done:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2227
; X * Y зачищаемой области
    .byte $0D
    .byte $0C
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0C
    .byte $0B
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $02
    .byte $02
    .word @txt_1
    .byte $04
    .byte $02
    .word @txt_2
    .byte $06
    .byte $02
    .word @txt_3
    .byte $08
    .byte $02
    .word @txt_4
    .byte $0A
    .byte $02
    .word @txt_5

@txt_1:
    .text "Formation"
    .byte con_закончить

@txt_2:
    .text "Defense"
    .byte con_закончить

@txt_3:
    .text "Swap"
    .byte con_закончить

@txt_4:
    .text "Status"
    .byte con_закончить

@txt_5:
    .text "Done"
    .byte con_закончить






off_B93F_35_formation:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2268
; X * Y зачищаемой области
    .byte $0C
    .byte $0A
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0C
    .byte $0A
; количество поинтеров
    .byte $06
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $02
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3
    .byte $06
    .byte $02
    .word @txt_4
    .byte $08
    .byte $02
    .word @txt_5
    .byte $09
    .byte $03
    .word @txt_6

@txt_1:
    .text "Formation"
    .byte con_закончить

@txt_2:
    .text "4:3:3"
    .byte con_закончить

@txt_3:
    .text "4:4:2"
    .byte con_закончить

@txt_4:
    .text "3:5:2"
    .byte con_закончить

@txt_5:
    .text "Brazil"
    .byte con_закончить

@txt_6:
    .text "tactics"
    .byte con_закончить






off_B95C_36_defense:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $22A8
; X * Y зачищаемой области
    .byte $0C
    .byte $08
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0C
    .byte $07
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $02
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3
    .byte $06
    .byte $02
    .word @txt_4

@txt_1:
    .text "Defense"
    .byte con_закончить

@txt_2:
    .text "Normal"
    .byte con_закончить

@txt_3:
    .text "Press"
    .byte con_закончить

@txt_4:
    .text "Counter"
    .byte con_закончить






off_B975_37_swap:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $22E8
; X * Y зачищаемой области
    .byte $0C
    .byte $06
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0C
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $01
    .word @txt_1
    .byte $02
    .byte $02
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3

@txt_1:
    .text "Swap"
    .byte con_закончить

@txt_2:
    .text "Players"
    .byte con_закончить

@txt_3:
    .text "Positions"
    .byte con_закончить






off_B98A_38_no_subs_left:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $22E7
; X * Y зачищаемой области
    .byte $0D
    .byte $05
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $05
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt_1
    .byte $02
    .byte $01
    .word @txt_2
    .byte $04
    .byte $02
    .word @txt_3

@txt_1:
    .text "Swap"
    .byte con_закончить

@txt_2:
    .text "Only 3 subs"
    .byte con_закончить

@txt_3:
    .text "per match!"
    .byte con_закончить






off_B99B_39_swap_main_players:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $20
    .byte $0B
; смещение окна X, Y
    .byte $01
    .byte $00
; размер окна X, Y
    .byte $1E
    .byte $0B
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $07
    .word @txt
    .byte $02
    .byte $03
    .word @name_2
    .byte $04
    .byte $03
    .word @name_3
    .byte $06
    .byte $03
    .word @name_4
    .byte $08
    .byte $03
    .word @name_5
    .byte $0A
    .byte $03
    .word @name_6
    .byte $02
    .byte $13
    .word @name_7
    .byte $04
    .byte $13
    .word @name_8
    .byte $06
    .byte $13
    .word @name_9
    .byte $08
    .byte $12
    .word @name_10
    .byte $0A
    .byte $12
    .word @name_11

@txt:
    .text " Swap Positions "
    .byte con_закончить

@name_2:
    .text "2 "
    .byte con_menu_name, $01
    .byte con_закончить

@name_3:
    .text "3 "
    .byte con_menu_name, $02
    .byte con_закончить

@name_4:
    .text "4 "
    .byte con_menu_name, $03
    .byte con_закончить

@name_5:
    .text "5 "
    .byte con_menu_name, $04
    .byte con_закончить

@name_6:
    .text "6 "
    .byte con_menu_name, $05
    .byte con_закончить

@name_7:
    .text "7 "
    .byte con_menu_name, $06
    .byte con_закончить

@name_8:
    .text "8 "
    .byte con_menu_name, $07
    .byte con_закончить

@name_9:
    .text "9 "
    .byte con_menu_name, $08
    .byte con_закончить

@name_10:
    .text "10 "
    .byte con_menu_name, $09
    .byte con_закончить

@name_11:
    .text "11 "
    .byte con_menu_name, $0A
    .byte con_закончить






off_B9F8_3A_swap_sub_players:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $20
    .byte $0B
; смещение окна X, Y
    .byte $01
    .byte $00
; размер окна X, Y
    .byte $1E
    .byte $0B
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $06
    .word @txt
    .byte $02
    .byte $03
    .word @sub_plr_1_name
    .byte $04
    .byte $03
    .word @sub_plr_2_name
    .byte $06
    .byte $03
    .word @sub_plr_3_name
    .byte $08
    .byte $03
    .word @sub_plr_4_name
    .byte $0A
    .byte $03
    .word @sub_plr_5_name
    .byte $02
    .byte $0D
    .word @sub_plr_6_name
    .byte $04
    .byte $0D
    .word @sub_plr_7_name
    .byte $06
    .byte $0D
    .word @sub_plr_8_name
    .byte $08
    .byte $15
    .word @sub_plr_gk1_name
    .byte $0A
    .byte $15
    .word @sub_plr_gk2_name

@txt:
    .text " Who will you use? "
    .byte con_закончить

@sub_plr_1_name:
    .byte con_menu_name, $16
    .byte con_закончить

@sub_plr_2_name:
    .byte con_menu_name, $17
    .byte con_закончить

@sub_plr_3_name:
    .byte con_menu_name, $18
    .byte con_закончить

@sub_plr_4_name:
    .byte con_menu_name, $19
    .byte con_закончить

@sub_plr_5_name:
    .byte con_menu_name, $1A
    .byte con_закончить

@sub_plr_6_name:
    .byte con_menu_name, $1B
    .byte con_закончить

@sub_plr_7_name:
    .byte con_menu_name, $1C
    .byte con_закончить

@sub_plr_8_name:
    .byte con_menu_name, $1D
    .byte con_закончить

@sub_plr_gk1_name:
    .byte con_menu_name, $1E
    .byte con_закончить

@sub_plr_gk2_name:
    .byte con_menu_name, $1F
    .byte con_закончить






off_BA39_3B_whom_to_sub:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $20
    .byte $0C
; смещение окна X, Y
    .byte $01
    .byte $00
; размер окна X, Y
    .byte $1E
    .byte $0C
; количество поинтеров
    .byte $0C
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $09
    .word @txt
    .byte $02
    .byte $03
    .word @name_2
    .byte $04
    .byte $03
    .word @name_3
    .byte $06
    .byte $03
    .word @name_4
    .byte $08
    .byte $03
    .word @name_5
    .byte $0A
    .byte $03
    .word @name_6
    .byte $02
    .byte $13
    .word @name_7
    .byte $04
    .byte $13
    .word @name_8
    .byte $06
    .byte $13
    .word @name_9
    .byte $08
    .byte $12
    .word @name_10
    .byte $0A
    .byte $12
    .word @name_11
    .byte $0B
    .byte $0B
    .word @name_gk

@txt:
    .text " Whom to sub? "
    .byte con_закончить

@name_2:
    .text "2 "
    .byte con_menu_name, $01
    .byte con_закончить

@name_3:
    .text "3 "
    .byte con_menu_name, $02
    .byte con_закончить

@name_4:
    .text "4 "
    .byte con_menu_name, $03
    .byte con_закончить

@name_5:
    .text "5 "
    .byte con_menu_name, $04
    .byte con_закончить

@name_6:
    .text "6 "
    .byte con_menu_name, $05
    .byte con_закончить

@name_7:
    .text "7 "
    .byte con_menu_name, $06
    .byte con_закончить

@name_8:
    .text "8 "
    .byte con_menu_name, $07
    .byte con_закончить

@name_9:
    .text "9 "
    .byte con_menu_name, $08
    .byte con_закончить

@name_10:
    .text "10 "
    .byte con_menu_name, $09
    .byte con_закончить

@name_11:
    .text "11 "
    .byte con_menu_name, $0A
    .byte con_закончить

@name_gk:
    .text "GK "
    .byte con_menu_name, $00
    .byte con_закончить






off_BAA2_3C_stamina_fielded_players:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $20
    .byte $0D
; смещение окна X, Y
    .byte $01
    .byte $00
; размер окна X, Y
    .byte $1E
    .byte $0C
; количество поинтеров
    .byte $17
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $07
    .word @txt
    .byte $01
    .byte $03
    .word @main_plr_2_name
    .byte $02
    .byte $06
    .word @main_plr_2_stamina
    .byte $04
    .byte $03
    .word @main_plr_3_name
    .byte $05
    .byte $06
    .word @main_plr_3_stamina
    .byte $07
    .byte $03
    .word @main_plr_4_name
    .byte $08
    .byte $06
    .word @main_plr_4_stamina
    .byte $0A
    .byte $03
    .word @main_plr_5_name
    .byte $0B
    .byte $06
    .word @main_plr_5_stamina
    .byte $01
    .byte $0C
    .word @main_plr_6_name
    .byte $02
    .byte $0F
    .word @main_plr_6_stamina
    .byte $04
    .byte $0C
    .word @main_plr_7_name
    .byte $05
    .byte $0F
    .word @main_plr_7_stamina
    .byte $07
    .byte $0C
    .word @main_plr_8_name
    .byte $08
    .byte $0F
    .word @main_plr_8_stamina
    .byte $0A
    .byte $0C
    .word @main_plr_9_name
    .byte $0B
    .byte $0F
    .word @main_plr_9_stamina
    .byte $01
    .byte $15
    .word @main_plr_10_name
    .byte $02
    .byte $18
    .word @main_plr_10_stamina
    .byte $04
    .byte $15
    .word @main_plr_11_name
    .byte $05
    .byte $18
    .word @main_plr_11_stamina
    .byte $0A
    .byte $15
    .word @main_plr_gk_name
    .byte $0B
    .byte $18
    .word @main_plr_gk_stamina

@txt:
    .text " Fielded Players "
    .byte con_закончить

@main_plr_2_name:
    .byte con_menu_name, $01
    .byte con_закончить

@main_plr_2_stamina:
    .byte con_plr_stamina, $01
    .byte con_закончить

@main_plr_3_name:
    .byte con_menu_name, $02
    .byte con_закончить

@main_plr_3_stamina:
    .byte con_plr_stamina, $02
    .byte con_закончить

@main_plr_4_name:
    .byte con_menu_name, $03
    .byte con_закончить

@main_plr_4_stamina:
    .byte con_plr_stamina, $03
    .byte con_закончить

@main_plr_5_name:
    .byte con_menu_name, $04
    .byte con_закончить

@main_plr_5_stamina:
    .byte con_plr_stamina, $04
    .byte con_закончить

@main_plr_6_name:
    .byte con_menu_name, $05
    .byte con_закончить

@main_plr_6_stamina:
    .byte con_plr_stamina, $05
    .byte con_закончить

@main_plr_7_name:
    .byte con_menu_name, $06
    .byte con_закончить

@main_plr_7_stamina:
    .byte con_plr_stamina, $06
    .byte con_закончить

@main_plr_8_name:
    .byte con_menu_name, $07
    .byte con_закончить

@main_plr_8_stamina:
    .byte con_plr_stamina, $07
    .byte con_закончить

@main_plr_9_name:
    .byte con_menu_name, $08
    .byte con_закончить

@main_plr_9_stamina:
    .byte con_plr_stamina, $08
    .byte con_закончить

@main_plr_10_name:
    .byte con_menu_name, $09
    .byte con_закончить

@main_plr_10_stamina:
    .byte con_plr_stamina, $09
    .byte con_закончить

@main_plr_11_name:
    .byte con_menu_name, $0A
    .byte con_закончить

@main_plr_11_stamina:
    .byte con_plr_stamina, $0A
    .byte con_закончить

@main_plr_gk_name:
    .byte con_menu_name, $00
    .byte con_закончить

@main_plr_gk_stamina:
    .byte con_plr_stamina, $00
    .byte con_закончить





off_BB03_3D_stamina_substitutes_bench:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $20
    .byte $0D
; смещение окна X, Y
    .byte $01
    .byte $00
; размер окна X, Y
    .byte $1E
    .byte $0C
; количество поинтеров
    .byte $15
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $06
    .word @txt
    .byte $01
    .byte $03
    .word @sub_plr_1_name
    .byte $02
    .byte $06
    .word @sub_plr_1_stamina
    .byte $04
    .byte $03
    .word @sub_plr_2_name
    .byte $05
    .byte $06
    .word @sub_plr_2_stamina
    .byte $07
    .byte $03
    .word @sub_plr_3_name
    .byte $08
    .byte $06
    .word @sub_plr_3_stamina
    .byte $0A
    .byte $03
    .word @sub_plr_4_name
    .byte $0B
    .byte $06
    .word @sub_plr_4_stamina
    .byte $01
    .byte $0C
    .word @sub_plr_5_name
    .byte $02
    .byte $0F
    .word @sub_plr_5_stamina
    .byte $04
    .byte $0C
    .word @sub_plr_6_name
    .byte $05
    .byte $0F
    .word @sub_plr_6_stamina
    .byte $07
    .byte $0C
    .word @sub_plr_7_name
    .byte $08
    .byte $0F
    .word @sub_plr_7_stamina
    .byte $0A
    .byte $0C
    .word @sub_plr_8_name
    .byte $0B
    .byte $0F
    .word @sub_plr_8_stamina
    .byte $07
    .byte $15
    .word @sub_plr_gk1_name
    .byte $08
    .byte $18
    .word @sub_plr_gk1_stamina
    .byte $0A
    .byte $15
    .word @sub_plr_gk2_name
    .byte $0B
    .byte $18
    .word @sub_plr_gk2_stamina

@txt:
    .text " Substitute's Bench "
    .byte con_закончить

@sub_plr_1_name:
    .byte con_menu_name, $16
    .byte con_закончить

@sub_plr_1_stamina:
    .byte con_plr_stamina, $16
    .byte con_закончить

@sub_plr_2_name:
    .byte con_menu_name, $17
    .byte con_закончить

@sub_plr_2_stamina:
    .byte con_plr_stamina, $17
    .byte con_закончить

@sub_plr_3_name:
    .byte con_menu_name, $18
    .byte con_закончить

@sub_plr_3_stamina:
    .byte con_plr_stamina, $18
    .byte con_закончить

@sub_plr_4_name:
    .byte con_menu_name, $19
    .byte con_закончить

@sub_plr_4_stamina:
    .byte con_plr_stamina, $19
    .byte con_закончить

@sub_plr_5_name:
    .byte con_menu_name, $1A
    .byte con_закончить

@sub_plr_5_stamina:
    .byte con_plr_stamina, $1A
    .byte con_закончить

@sub_plr_6_name:
    .byte con_menu_name, $1B
    .byte con_закончить

@sub_plr_6_stamina:
    .byte con_plr_stamina, $1B
    .byte con_закончить

@sub_plr_7_name:
    .byte con_menu_name, $1C
    .byte con_закончить

@sub_plr_7_stamina:
    .byte con_plr_stamina, $1C
    .byte con_закончить

@sub_plr_8_name:
    .byte con_menu_name, $1D
    .byte con_закончить

@sub_plr_8_stamina:
    .byte con_plr_stamina, $1D
    .byte con_закончить

@sub_plr_gk1_name:
    .byte con_menu_name, $1E
    .byte con_закончить

@sub_plr_gk1_stamina:
    .byte con_plr_stamina, $1E
    .byte con_закончить

@sub_plr_gk2_name:
    .byte con_menu_name, $1F
    .byte con_закончить

@sub_plr_gk2_stamina:
    .byte con_plr_stamina, $1F
    .byte con_закончить






off_BB5C_3E_pk_shootout_select_taker:
; номер набора контура окна
    .byte $02 * $09
; адрес ppu
    .word $2060
; X * Y зачищаемой области
    .byte $20
    .byte $01
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $20
    .byte $01
; количество поинтеров
    .byte $01
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $03
    .word @txt

@txt:
    .text "PK Shootout - Select Taker"
    .byte con_закончить






off_BB69_3F_pk_players_list:
; номер набора контура окна
    .byte $02 * $09
; адрес ppu
; 0x030C3C смещение для цифры
    .word $20C3
; X * Y зачищаемой области
    .byte $0C
    .byte $14
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0C
    .byte $14
; количество поинтеров
    .byte $0B
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $07
    .word @txt
    .byte $02
    .byte $00
    .word @list
    .byte $04
    .byte $00
    .word @list
    .byte $06
    .byte $00
    .word @list
    .byte $08
    .byte $00
    .word @list
    .byte $0A
    .byte $00
    .word @list
    .byte $0C
    .byte $00
    .word @list
    .byte $0E
    .byte $00
    .word @list
    .byte $10
    .byte $00
    .word @list
    .byte $12
    .byte $00
    .word @list
    .byte $14
    .byte $00
    .word @list

@txt:
    .text "Skill"
    .byte con_закончить

@list:
    .byte con_pk_players_list
    .byte con_закончить






off_BB9E_40_pk_order:
; номер набора контура окна
    .byte $01 * $09
; адрес ppu
    .word $2111
; X * Y зачищаемой области
    .byte $0E
    .byte $0E
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0E
    .byte $0E
; количество поинтеров
    .byte $06
; смещение текста Y, X + поинтеры на текст
    .byte $02
    .byte $03
    .word @txt
    .byte $04
    .byte $02
    .word @shooter_1
    .byte $06
    .byte $02
    .word @shooter_2
    .byte $08
    .byte $02
    .word @shooter_3
    .byte $0A
    .byte $02
    .word @shooter_4
    .byte $0C
    .byte $02
    .word @shooter_5

@txt:
    .text "PK Order"
    .byte con_закончить

@shooter_1:
    .text "1 "
    .byte con_rec_name_teammate, $00
    .byte con_закончить

@shooter_2:
    .text "2 "
    .byte con_rec_name_teammate, $01
    .byte con_закончить

@shooter_3:
    .text "3 "
    .byte con_rec_name_teammate, $02
    .byte con_закончить

@shooter_4:
    .text "4 "
    .byte con_rec_name_teammate, $03
    .byte con_закончить

@shooter_5:
    .text "5 "
    .byte con_rec_name_teammate, $04
    .byte con_закончить






off_BBBF_41_pk_score:
; номер набора контура окна
    .byte $02 * $09
; адрес ppu
    .word $2281
; X * Y зачищаемой области
    .byte $05
    .byte $02
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $05
    .byte $02
; количество поинтеров
    .byte $04
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $00
    .word @team_left
    .byte $00
    .byte $04
    .word @score_left
    .byte $02
    .byte $00
    .word @team_right
    .byte $02
    .byte $04
    .word @score_right

@team_left:
    .byte con_team_name, $00
    .byte con_закончить

@score_left:
    .byte con_score, $00
    .byte con_закончить

@team_right:
    .byte con_team_name, $01
    .byte con_закончить

@score_right:
    .byte con_score, $01
    .byte con_закончить






off_BC02_42_booth_for_charlie_time_score_period_number:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $07
    .byte $0C
; смещение окна X, Y
    .byte $00
    .byte $01
; размер окна X, Y
    .byte $07
    .byte $0A
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $01
    .word @period
    .byte $03
    .byte $05
    .word @time
    .byte $05
    .byte $02
    .word @score_left
    .byte $05
    .byte $03
    .word @dash
    .byte $05
    .byte $04
    .word @score_right

@period:
    .byte con_period_number
    .byte con_закончить

@time:
    .byte con_time
    .byte con_закончить

@score_left:
    .byte con_score, $00
    .byte con_закончить

@dash:
    .text "-"
    .byte con_закончить

@score_right:
    .byte con_score, $01
    .byte con_закончить






off_BC03_43_booth_for_charlie_pk_period_number:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2220
; X * Y зачищаемой области
    .byte $07
    .byte $0C
; смещение окна X, Y
    .byte $00
    .byte $01
; размер окна X, Y
    .byte $07
    .byte $0A
; количество поинтеров
    .byte $01
; смещение текста Y, X + поинтеры на текст
    .byte $01
    .byte $01
    .word @period

@period:
    .byte con_period_number
    .byte con_закончить






off_BC04_44_show_1_defender:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $03
; количество поинтеров
    .byte $03
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @defender_1

@txt:
    .text "Defender"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $80
    .byte con_закончить

@defender_1:
    .byte con_opp_def_name, $00
    .byte con_закончить






off_BC05_45_show_2_defenders:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $05
; количество поинтеров
    .byte $05
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @defender_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @defender_2

@txt:
    .text "Defenders"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $80
    .byte con_закончить

@defender_1:
    .byte con_opp_def_name, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $81
    .byte con_закончить

@defender_2:
    .byte con_opp_def_name, $01
    .byte con_закончить






off_BC06_46_show_3_defenders:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $07
; количество поинтеров
    .byte $07
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @defender_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @defender_2
    .byte $06
    .byte $01
    .word @indicator_3
    .byte $06
    .byte $03
    .word @defender_3

@txt:
    .text "Defenders"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $80
    .byte con_закончить

@defender_1:
    .byte con_opp_def_name, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $81
    .byte con_закончить

@defender_2:
    .byte con_opp_def_name, $01
    .byte con_закончить

@indicator_3:
    .byte con_not_a_clone_indicator, $82
    .byte con_закончить

@defender_3:
    .byte con_opp_def_name, $02
    .byte con_закончить






off_BC07_47_show_4_defenders:
; номер набора контура окна
    .byte $00 * $09
; адрес ppu
    .word $2252
; X * Y зачищаемой области
    .byte $0E
    .byte $09
; смещение окна X, Y
    .byte $00
    .byte $00
; размер окна X, Y
    .byte $0D
    .byte $09
; количество поинтеров
    .byte $09
; смещение текста Y, X + поинтеры на текст
    .byte $00
    .byte $02
    .word @txt
    .byte $02
    .byte $01
    .word @indicator_1
    .byte $02
    .byte $03
    .word @defender_1
    .byte $04
    .byte $01
    .word @indicator_2
    .byte $04
    .byte $03
    .word @defender_2
    .byte $06
    .byte $01
    .word @indicator_3
    .byte $06
    .byte $03
    .word @defender_3
    .byte $08
    .byte $01
    .word @indicator_4
    .byte $08
    .byte $03
    .word @defender_4

@txt:
    .text "Defenders"
    .byte con_закончить

@indicator_1:
    .byte con_not_a_clone_indicator, $80
    .byte con_закончить

@defender_1:
    .byte con_opp_def_name, $00
    .byte con_закончить

@indicator_2:
    .byte con_not_a_clone_indicator, $81
    .byte con_закончить

@defender_2:
    .byte con_opp_def_name, $01
    .byte con_закончить

@indicator_3:
    .byte con_not_a_clone_indicator, $82
    .byte con_закончить

@defender_3:
    .byte con_opp_def_name, $02
    .byte con_закончить

@indicator_4:
    .byte con_not_a_clone_indicator, $83
    .byte con_закончить

@defender_4:
    .byte con_opp_def_name, $03
    .byte con_закончить





off_BCF9_позиция_и_имя_принимающего:
    .byte con_rec_name_pos
    .byte con_закончить

off_BCFB_энергия_принимающего:
    .text "Stamina    "
    .byte con_stats_receiver, con_rec_stamina
    .byte con_закончить

off_BD06_shoot_принимающего:
    .text "Shoot      "
    .byte con_stats_receiver, con_rec_shoot
    .byte con_закончить

off_BD1C_pass_принимающего:
    .text "Pass       "
    .byte con_stats_receiver, con_rec_pass
    .byte con_закончить

off_BD27:       ; unused <トラップ>
- - - - - - 0x033D37 18:BD27: 54        .byte $54
- - - - - - 0x033D38 18:BD28: 67        .byte $67
- - - - - - 0x033D39 18:BD29: 6F        .byte $6F
- - - - - - 0x033D3A 18:BD2A: CF        .byte $CF
- - - - - - 0x033D3B 18:BD2B: 00        .byte $00
- - - - - - 0x033D3C 18:BD2C: 00        .byte $00
- - - - - - 0x033D3D 18:BD2D: 00        .byte $00
- - - - - - 0x033D3E 18:BD2E: 00        .byte $00
- - - - - - 0x033D3F 18:BD2F: E3        .byte con_stats_receiver, con_rec_trap
- - - - - - 0x033D41 18:BD31: FC        .byte con_закончить

off_BD32:       ; unused <クリアー>
- - - - - - 0x033D42 18:BD32: 48        .byte $48
- - - - - - 0x033D43 18:BD33: 68        .byte $68
- - - - - - 0x033D44 18:BD34: 41        .byte $41
- - - - - - 0x033D45 18:BD35: 7D        .byte $7D
- - - - - - 0x033D46 18:BD36: 00        .byte $00
- - - - - - 0x033D47 18:BD37: 00        .byte $00
- - - - - - 0x033D48 18:BD38: 00        .byte $00
- - - - - - 0x033D49 18:BD39: 00        .byte $00
- - - - - - 0x033D4A 18:BD3A: E3        .byte con_stats_receiver, con_rec_clearing
- - - - - - 0x033D4C 18:BD3C: FC        .byte con_закончить
