.segment "BANK_17"
.include "copy_bank_ram.inc"

.export sub_0x020016_прочитать_поинтеры_сценария
sub_0x020016_прочитать_поинтеры_сценария:
C D - - - 0x020016 17:8006: A2 89     LDX #> tbl_89BF_сценарии
C - - - - 0x020018 17:8008: AD 18 05  LDA ram_сценарий
C - - - - 0x02001B 17:800B: 0A        ASL
C - - - - 0x02001C 17:800C: A8        TAY
C - - - - 0x02001D 17:800D: 90 01     BCC bra_8010
; bzk проверка на overflow, но никогда не корректировалась, видимо потому что 0518 никогда не превышает 7F
- - - - - 0x02001F 17:800F: E8        INX
bra_8010:
C - - - - 0x020020 17:8010: A9 BF     LDA #< tbl_89BF_сценарии
C - - - - 0x020022 17:8012: 85 5D     STA ram_сценарий_data
C - - - - 0x020024 17:8014: 86 5E     STX ram_сценарий_data + 1
C - - - - 0x020026 17:8016: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020028 17:8018: AA        TAX
C - - - - 0x020029 17:8019: C8        INY
C - - - - 0x02002A 17:801A: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x02002C 17:801C: 85 5E     STA ram_сценарий_data + 1
C - - - - 0x02002E 17:801E: 86 5D     STX ram_сценарий_data
C - - - - 0x020030 17:8020: 60        RTS

.export sub_0x020031_обработка_байтов_сценария
sub_0x020031_обработка_байтов_сценария:
C D - - - 0x020031 17:8021: AD 17 05  LDA $0517
C - - - - 0x020034 17:8024: 8D 2A 05  STA ram_флаг_зеркала_анимации
C - - - - 0x020037 17:8027: AD 16 05  LDA ram_флаг_сценария_ХЗ
C - - - - 0x02003A 17:802A: 29 FB     AND #$FB
C - - - - 0x02003C 17:802C: 8D 16 05  STA ram_флаг_сценария_ХЗ
C - - - - 0x02003F 17:802F: A9 00     LDA #$00
C - - - - 0x020041 17:8031: 8D 2B 05  STA $052B
C - - - - 0x020044 17:8034: 8D 2D 05  STA $052D
C - - - - 0x020047 17:8037: 8D 2C 05  STA $052C
C - - - - 0x02004A 17:803A: 8D 30 05  STA ram_для_052E_задержка_звука_анимации
C - - - - 0x02004D 17:803D: 85 3A     STA ram_003A
loc_803F_цикл:
C D - - - 0x02004F 17:803F: A4 3A     LDY ram_003A
C - - - - 0x020051 17:8041: E6 3A     INC ram_003A
C - - - - 0x020053 17:8043: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020055 17:8045: C9 F0     CMP #$F0
C - - - - 0x020057 17:8047: 90 06     BCC bra_804F_EF_и_ниже
C - - - - 0x020059 17:8049: 20 A9 80  JSR sub_80A9_управляющие_байты
C - - - - 0x02005C 17:804C: 4C 3F 80  JMP loc_803F_цикл
bra_804F_EF_и_ниже:
C - - - - 0x02005F 17:804F: 8D 23 05  STA ram_для_0519_задержка_следующей_анимации
C - - - - 0x020062 17:8052: AD 16 05  LDA ram_флаг_сценария_ХЗ
C - - - - 0x020065 17:8055: 09 40     ORA #$40
C - - - - 0x020067 17:8057: 29 EF     AND #$EF
C - - - - 0x020069 17:8059: 8D 16 05  STA ram_флаг_сценария_ХЗ
C - - - - 0x02006C 17:805C: A4 3A     LDY ram_003A
C - - - - 0x02006E 17:805E: E6 3A     INC ram_003A
C - - - - 0x020070 17:8060: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020079 17:8069: 8D 24 05  STA ram_фон_анимации
C - - - - 0x02007C 17:806C: A4 3A     LDY ram_003A
C - - - - 0x02007E 17:806E: E6 3A     INC ram_003A
C - - - - 0x020080 17:8070: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020089 17:8079: 8D 28 05  STA ram_для_053C_номер_анимации
C - - - - 0x02008C 17:807C: A4 3A     LDY ram_003A
C - - - - 0x02008E 17:807E: E6 3A     INC ram_003A
C - - - - 0x020090 17:8080: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020099 17:8089: 8D 29 05  STA ram_для_05EA_облако
C - - - - 0x02009C 17:808C: A5 3A     LDA ram_003A
C - - - - 0x02009E 17:808E: 18        CLC
C - - - - 0x02009F 17:808F: 65 5D     ADC ram_сценарий_data
C - - - - 0x0200A1 17:8091: 85 5D     STA ram_сценарий_data
C - - - - 0x0200A3 17:8093: 90 02     BCC bra_8097
C - - - - 0x0200A5 17:8095: E6 5E     INC ram_сценарий_data + 1
bra_8097:
C - - - - 0x0200A7 17:8097: A2 15     LDX #$15
C - - - - 0x0200A9 17:8099: A9 F0     LDA #$F0
C - - - - 0x0200AB 17:809B: 95 01     STA ram_0001,X
C - - - - 0x0200AD 17:809D: A9 0B     LDA #$0B
C - - - - 0x0200AF 17:809F: 95 02     STA ram_0002,X
C - - - - 0x0200B1 17:80A1: A9 80     LDA #> ofs_0x01615C
C - - - - 0x0200B3 17:80A3: A0 08     LDY #< ofs_0x01615C
C - - - - 0x0200B5 17:80A5: 20 0F C5  JSR sub_0x03CAF7_подготовить_подпрограмму_в_стеке
C - - - - 0x0200B8 17:80A8: 60        RTS

sub_80A9_управляющие_байты:
C - - - - 0x0200B9 17:80A9: 38        SEC
C - - - - 0x0200BA 17:80AA: E9 F0     SBC #$F0
C - - - - 0x0200BC 17:80AC: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0200BF 17:80AF: CF 80     .word ofs_80CF_F0_quit
- D - I - 0x0200C1 17:80B1: D4 80     .word ofs_80D4_F1__quit
- D - I - 0x0200C3 17:80B3: F4 80     .word ofs_80F4_F2_jmp
- D - I - 0x0200C5 17:80B5: 05 81     .word ofs_8105_F3_branch
- D - I - 0x0200C7 17:80B7: E0 87     .word ofs_87E0_F4_mirror_on
- D - I - 0x0200C9 17:80B9: E6 87     .word ofs_87E6_F5_mirror_off
- D - I - 0x0200CB 17:80BB: EC 87     .word ofs_87EC_F6_mirror_toggle
- D - I - 0x0200CD 17:80BD: F5 87     .word ofs_87F5_F7
- D - I - 0x0200CF 17:80BF: FF 87     .word ofs_87FF_F8
- D - I - 0x0200D1 17:80C1: 09 88     .word ofs_8809_F9_soundID_delay
- D - I - 0x0200D3 17:80C3: 1A 88     .word ofs_881A_FA_jsr
- D - I - 0x0200D5 17:80C5: 37 88     .word ofs_8837_FB_rts
- D - I - 0x0200D7 17:80C7: 53 88     .word ofs_8853_FC_moving_bg
- D - I - 0x0200D9 17:80C9: 5D 88     .word ofs_885D_FD_mirror_condition
- D - I - 0x0200DB 17:80CB: E3 88     .word ofs_88E3_FE
- D - I - 0x0200DD 17:80CD: ED 88     .word ofs_88ED_FF_drive_overhead_tiger

loc_80CF_возврат_из_стека_сценария:
ofs_80CF_F0_quit:
; без чтения следующих байтов
C D - - - 0x0200DF 17:80CF: A9 00     LDA #$00
C - - - - 0x0200E1 17:80D1: 8D 2A 05  STA ram_флаг_зеркала_анимации
ofs_80D4_F1__quit:
; без чтения следующих байтов
C - - - - 0x0200E4 17:80D4: A9 08     LDA #$08
C - - - - 0x0200E6 17:80D6: 2C 16 05  BIT ram_флаг_сценария_ХЗ
C - - - - 0x0200E9 17:80D9: D0 0B     BNE bra_80E6
C - - - - 0x0200EB 17:80DB: 0D 16 05  ORA ram_флаг_сценария_ХЗ
C - - - - 0x0200EE 17:80DE: 8D 16 05  STA ram_флаг_сценария_ХЗ
C - - - - 0x0200F1 17:80E1: A2 05     LDX #$05
C - - - - 0x0200F3 17:80E3: 20 1B C5  JSR sub_0x03CB12
bra_80E6:
C - - - - 0x0200F6 17:80E6: A9 00     LDA #$00
C - - - - 0x0200F8 17:80E8: 8D 22 05  STA ram_указатель_стека_сценария
C - - - - 0x0200FB 17:80EB: A5 21     LDA ram_для_2001
C - - - - 0x0200FD 17:80ED: 29 1E     AND #$1E
C - - - - 0x0200FF 17:80EF: 85 21     STA ram_для_2001
C - - - - 0x020101 17:80F1: 68        PLA
C - - - - 0x020102 17:80F2: 68        PLA
C - - - - 0x020103 17:80F3: 60        RTS

ofs_80F4_F2_jmp:
; читает 2 следующих байта
; переместиться на адрес поинтеров после F2
C - J - - 0x020104 17:80F4: A4 3A     LDY ram_003A
loc_80F6_подпрограмма_сценария:
C D - - - 0x020106 17:80F6: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020108 17:80F8: AA        TAX
C - - - - 0x020109 17:80F9: C8        INY
C - - - - 0x02010A 17:80FA: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x02010C 17:80FC: 85 5E     STA ram_сценарий_data + 1
C - - - - 0x02010E 17:80FE: 86 5D     STX ram_сценарий_data
C - - - - 0x020110 17:8100: A9 00     LDA #$00
C - - - - 0x020112 17:8102: 85 3A     STA ram_003A
C - - - - 0x020114 17:8104: 60        RTS

ofs_8105_F3_branch:
; читает 1 следующий байт
; код считывает байт после F3 и прыгает на одну из соответствующих подпрограмм, откуда получает нужный результат в X
    ; если байт после F3 отрицательный, то меняется косвенный адрес сценария в зависимости от результата
    ; если байт после F3 положительный, то косвенный адрес сценария смещается на велечину результата
C - J - - 0x020115 17:8105: A4 3A     LDY ram_003A
C - - - - 0x020117 17:8107: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020119 17:8109: 48        PHA
C - - - - 0x02011A 17:810A: 20 6E 81  JSR sub_816E_выбор_подпрограммы
C - - - - 0x02011D 17:810D: 68        PLA
C - - - - 0x02011E 17:810E: 10 1F     BPL bra_812F
C - - - - 0x020120 17:8110: 8A        TXA
C - - - - 0x020121 17:8111: 38        SEC
C - - - - 0x020122 17:8112: 65 3A     ADC ram_003A
C - - - - 0x020124 17:8114: 18        CLC
C - - - - 0x020125 17:8115: 65 5D     ADC ram_сценарий_data
C - - - - 0x020127 17:8117: 85 5D     STA ram_сценарий_data
C - - - - 0x020129 17:8119: 90 02     BCC bra_811D
C - - - - 0x02012B 17:811B: E6 5E     INC ram_сценарий_data + 1
bra_811D:
C - - - - 0x02012D 17:811D: A0 00     LDY #$00
C - - - - 0x02012F 17:811F: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020131 17:8121: 18        CLC
C - - - - 0x020132 17:8122: 65 5D     ADC ram_сценарий_data
C - - - - 0x020134 17:8124: 85 5D     STA ram_сценарий_data
C - - - - 0x020136 17:8126: 90 02     BCC bra_812A
C - - - - 0x020138 17:8128: E6 5E     INC ram_сценарий_data + 1
bra_812A:
C - - - - 0x02013A 17:812A: A9 00     LDA #$00
C - - - - 0x02013C 17:812C: 85 3A     STA ram_003A
C - - - - 0x02013E 17:812E: 60        RTS
bra_812F:
loc_812F_выбрать_подпрограмму:
C D - - - 0x02013F 17:812F: 8A        TXA
C - - - - 0x020140 17:8130: 0A        ASL
C - - - - 0x020141 17:8131: 38        SEC
C - - - - 0x020142 17:8132: 65 3A     ADC ram_003A
C - - - - 0x020144 17:8134: A8        TAY
C - - - - 0x020145 17:8135: 4C F6 80  JMP loc_80F6_подпрограмма_сценария

sub_8138_рандом_убийства_игрока___X_00:
C - - - - 0x020148 17:8138: 29 FC     AND #$FC
C - - - - 0x02014A 17:813A: F0 11     BEQ bra_814D_данное_действие_не_убивает
C - - - - 0x02014C 17:813C: 4A        LSR
C - - - - 0x02014D 17:813D: 85 3B     STA ram_003B
C - - - - 0x02014F 17:813F: AD E2 00  LDA ram_рандом_2
loc_8142_цикл:
C D - - - 0x020152 17:8142: C5 3B     CMP ram_003B
C - - - - 0x020154 17:8144: 90 05     BCC bra_814B_закончить_цикл
C - - - - 0x020156 17:8146: E5 3B     SBC ram_003B
C - - - - 0x020158 17:8148: 4C 42 81  JMP loc_8142_цикл
bra_814B_закончить_цикл:
C - - - - 0x02015B 17:814B: 65 3B     ADC ram_003B
bra_814D_данное_действие_не_убивает:
C - - - - 0x02015D 17:814D: A2 00     LDX #$00
C - - - - 0x02015F 17:814F: 60        RTS

sub_8150_отнять_хп_за_смерть_игрока___X_01:
C - - - - 0x020160 17:8150: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x020163 17:8153: A0 01     LDY #con_игрок_энергия_lo
C - - - - 0x020165 17:8155: B1 34     LDA (ram_plr_data),Y
C - - - - 0x020167 17:8157: 38        SEC
C - - - - 0x020168 17:8158: E9 40     SBC #$40
C - - - - 0x02016A 17:815A: AA        TAX
C - - - - 0x02016B 17:815B: C8        INY
C - - - - 0x02016C 17:815C: B1 34     LDA (ram_plr_data),Y
C - - - - 0x02016E 17:815E: E9 00     SBC #$00
C - - - - 0x020170 17:8160: 10 03     BPL bra_8165_эренгия_еще_есть
C - - - - 0x020172 17:8162: A2 00     LDX #$00
C - - - - 0x020174 17:8164: 8A        TXA
bra_8165_эренгия_еще_есть:
C - - - - 0x020175 17:8165: 91 34     STA (ram_plr_data),Y
C - - - - 0x020177 17:8167: 88        DEY
C - - - - 0x020178 17:8168: 8A        TXA
C - - - - 0x020179 17:8169: 91 34     STA (ram_plr_data),Y
C - - - - 0x02017B 17:816B: A2 01     LDX #$01
C - - - - 0x02017D 17:816D: 60        RTS

sub_816E_выбор_подпрограммы:
C - - - - 0x02017E 17:816E: 29 7F     AND #$7F
C - - - - 0x020180 17:8170: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x020183 17:8173: 1C 82     .word $0000       ; unused ofs_821C_00_80_защитник_клон_или_нет
- D - I - 0x020185 17:8175: 2C 82     .word ofs_822C_01_81_выживет_ли_защитник
- D - I - 0x020187 17:8177: 51 82     .word ofs_8251_02_82_номер_действия_защитника
- D - I - 0x020189 17:8179: 55 82     .word ofs_8255_03_83_результат_действия_защитника
- D - I - 0x02018B 17:817B: 59 82     .word ofs_8259_04_84_мяч_у_атакующего_низкий___или_же_высокий
- D - I - 0x02018D 17:817D: 60 82     .word ofs_8260_05_85_порядковый_номер_защитника
- D - I - 0x02018F 17:817F: 64 82     .word ofs_8264_06_86_защитник_это_кипер_или_нет
- D - I - 0x020191 17:8181: 71 82     .word $0000       ; unused, было аналогично 03_83
- D - I - 0x020193 17:8183: 75 82     .word ofs_8275_08_88
- D - I - 0x020195 17:8185: 8A 82     .word ofs_828A_09_89_действие_атаки_на_штрафной
- D - I - 0x020197 17:8187: 97 82     .word $0000       ; unused, было аналогично 02_8A для киперов
- D - I - 0x020199 17:8189: 9B 82     .word $0000       ; unused, было аналогично 03_83
- D - I - 0x02019B 17:818B: 9F 82     .word ofs_829F_0C_8C
- D - I - 0x02019D 17:818D: BA 82     .word ofs_82BA_0D_8D
- D - I - 0x02019F 17:818F: 66 83     .word ofs_8366_0E_8E_действие_атаки_на_земле
- D - I - 0x0201A1 17:8191: 6A 83     .word ofs_836A_0F_8F
- D - I - 0x0201A3 17:8193: 6E 83     .word ofs_836E_10_90
- D - I - 0x0201A5 17:8195: 7C 83     .word $0000       ; unused, было аналогично 0F_8F
- D - I - 0x0201A7 17:8197: 80 83     .word $0000       ; unused, было аналогично 0F_8F
- D - I - 0x0201A9 17:8199: 84 83     .word ofs_8384_13_93_спасет_ли_защитник_ворота
- D - I - 0x0201AB 17:819B: A4 83     .word $0000       ; unused, было аналогично 0F_8F
- D - I - 0x0201AD 17:819D: A8 83     .word ofs_83A8_15_95
- D - I - 0x0201AF 17:819F: B4 83     .word ofs_83B4_16_96
- D - I - 0x0201B1 17:81A1: C2 83     .word $0000       ; unused, было аналогично 0F_8F
- D - I - 0x0201B3 17:81A3: C6 83     .word ofs_83C6_18_98_проверка_на_jitou_из_японии
- - - - - 0x0201B5 17:81A5: D6 83     .word $0000       ; unused, байты не найдены
- - - - - 0x0201B7 17:81A7: DD 83     .word $0000       ; unused, байты не найдены
- D - I - 0x0201B9 17:81A9: E4 83     .word ofs_83E4_1B_9B_спешал_блок
- D - I - 0x0201BB 17:81AB: EB 83     .word ofs_83EB_1C_9C_спешал_дриблинг
- D - I - 0x0201BD 17:81AD: F5 83     .word ofs_83F5_1D_9D_спешал_удар
- D - I - 0x0201BF 17:81AF: 01 84     .word ofs_8401_1E_9E
- D - I - 0x0201C1 17:81B1: 0A 84     .word $0000       ; unused, было аналогично 0E_8E
- D - I - 0x0201C3 17:81B3: 0E 84     .word ofs_840E_20_A0
- D - I - 0x0201C5 17:81B5: 2B 84     .word ofs_842B_21_A1_порвана_ли_сетка
- D - I - 0x0201C7 17:81B7: 36 84     .word ofs_8436_22_A2_у_чьей_команды_мяч
- D - I - 0x0201C9 17:81B9: 3E 84     .word ofs_843E_23_A3_за_какую_команду_играешь
- - - - - 0x0201CB 17:81BB: 42 84     .word $0000       ; unused, байты не найдены, была проверка на diazа
- D - I - 0x0201CD 17:81BD: 4E 84     .word ofs_844E_25_A5_coimbra_france_уже_били_или_нет
- D - I - 0x0201CF 17:81BF: 57 84     .word ofs_8457_26_A6_проигрывает_ли_германия
- D - I - 0x0201D1 17:81C1: 4E 84     .word $0000       ; unused, было аналогично 25_A5
- D - I - 0x0201D3 17:81C3: 7E 84     .word ofs_847E_28_A8_оба_игрока_с_рожами
- D - I - 0x0201D5 17:81C5: 98 84     .word ofs_8498_29_A9_оба_игрока_с_рожами
- D - I - 0x0201D7 17:81C7: B2 84     .word ofs_84B2_2A_AA_игрок_с_рожей
- D - I - 0x0201D9 17:81C9: C7 84     .word ofs_84C7_2B_AB_проверка_на_100_хп
- D - I - 0x0201DB 17:81CB: E7 84     .word ofs_84E7_2C_AC
- D - I - 0x0201DD 17:81CD: EF 84     .word ofs_84EF_2D_AD_забил_ли_jitou_гол_с_сано
- D - I - 0x0201DF 17:81CF: FC 84     .word ofs_84FC_2E_AE
- D - I - 0x0201E1 17:81D1: 0B 85     .word ofs_850B_2F_AF_киперы_с_критами
- D - I - 0x0201E3 17:81D3: 27 85     .word ofs_8527_30_B0_diaz_tsubasa
- D - I - 0x0201E5 17:81D5: 3A 85     .word ofs_853A_31_B1_nitta
- D - I - 0x0201E7 17:81D7: 46 85     .word ofs_8546_32_B2_souda
- D - I - 0x0201E9 17:81D9: 56 85     .word ofs_8556_33_B3_игроки_с_защитным_спешалом
- D - I - 0x0201EB 17:81DB: 6C 85     .word ofs_856C_34_B4_узнать_высоту_мяча
- D - I - 0x0201ED 17:81DD: 70 85     .word ofs_8570_35_B5
- D - I - 0x0201EF 17:81DF: 80 85     .word ofs_8580_36_B6_спешал_catch
- D - I - 0x0201F1 17:81E1: 87 85     .word ofs_8587_37_B7
- D - I - 0x0201F3 17:81E3: 92 85     .word ofs_8592_38_B8_hyuga
- D - I - 0x0201F5 17:81E5: A2 85     .word ofs_85A2_39_B9_matsuyama
- D - I - 0x0201F7 17:81E7: B2 85     .word ofs_85B2_3A_BA_kaltz
- D - I - 0x0201F9 17:81E9: BE 85     .word ofs_85BE_3B_BB_carlos
- D - I - 0x0201FB 17:81EB: CA 85     .word ofs_85CA_3C_BC_misugi
- D - I - 0x0201FD 17:81ED: DA 85     .word ofs_85DA_3D_BD_misaki
- D - I - 0x0201FF 17:81EF: E6 85     .word ofs_85E6_3E_BE
- D - I - 0x020201 17:81F1: FE 85     .word $0000       ; unused, было аналогично 0F_8F
- D - I - 0x020203 17:81F3: 02 86     .word ofs_8602_40_C0_игрок_с_рожей
- D - I - 0x020205 17:81F5: 10 86     .word ofs_8610_41_C1_какая_у_кипера_рожа
- D - I - 0x020207 17:81F7: 27 86     .word ofs_8627_42_C2_2_варианта_рандома
- D - I - 0x020209 17:81F9: 2E 86     .word ofs_862E_43_C3
- D - I - 0x02020B 17:81FB: 3B 86     .word ofs_863B_44_C4_делает_ли_кипер_dive
- D - I - 0x02020D 17:81FD: 4A 86     .word ofs_864A_45_C5
- D - I - 0x02020F 17:81FF: 77 86     .word ofs_8677_46_C6
- D - I - 0x020211 17:8201: 8A 86     .word ofs_868A_47_C7_кто_делает_силовой_дриблинг
- D - I - 0x020213 17:8203: B6 86     .word ofs_86B6_48_C8
- D - I - 0x020215 17:8205: CC 86     .word ofs_86CC_49_C9_спешал_перепасовка

sub_8207_узнать_номер_игрока___X_00:
C - - - - 0x020217 17:8207: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x02021A 17:820A: A0 00     LDY #con_игрок_номер
C - - - - 0x02021C 17:820C: B1 34     LDA (ram_plr_data),Y
C - - - - 0x02021E 17:820E: A2 00     LDX #$00
C - - - - 0x020220 17:8210: 60        RTS

sub_8211:
loc_8211:
C D - - - 0x020221 17:8211: F0 08     BEQ bra_821B_выход
C - - - - 0x020223 17:8213: AD 16 05  LDA ram_флаг_сценария_ХЗ
C - - - - 0x020226 17:8216: 09 04     ORA #$04
C - - - - 0x020228 17:8218: 8D 16 05  STA ram_флаг_сценария_ХЗ
bra_821B_выход:
C - - - - 0x02022B 17:821B: 60        RTS

; ofs_821C_00_80_защитник_клон_или_нет:
; 00 - не клон
; 01 - клон
; C - J - - 0x02022C 17:821C: AD 42 04  LDA ram_игрок_без_мяча
; C - - - - 0x02022F 17:821F: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
; C - - - - 0x020232 17:8222: A0 00     LDY #con_игрок_номер
; C - - - - 0x020234 17:8224: A2 00     LDX #$00
; C - - - - 0x020236 17:8226: B1 34     LDA (ram_plr_data),Y
; C - - - - 0x020238 17:8228: D0 01     BNE bra_822B_выход
; C - - - - 0x02023A 17:822A: E8        INX
; bra_822B_выход:
; C - - - - 0x02023B 17:822B: 60        RTS

ofs_822C_01_81_выживет_ли_защитник:
; 00 - защитник выживет
; 01 - защитник убьется
C - J - - 0x02023C 17:822C: AD 44 04  LDA ram_спешал_атакующего
C - - - - 0x02023F 17:822F: AC 12 06  LDY ram_результат_защитника
C - - - - 0x020242 17:8232: C0 02     CPY #$02
C - - - - 0x020244 17:8234: 90 03     BCC bra_8239_защитник_не_отберет_мяч
C - - - - 0x020246 17:8236: AD 45 04  LDA ram_спешал_защитника
bra_8239_защитник_не_отберет_мяч:
C - - - - 0x020249 17:8239: 20 38 81  JSR sub_8138_рандом_убийства_игрока___X_00
C - - - - 0x02024C 17:823C: C9 80     CMP #$80
C - - - - 0x02024E 17:823E: 90 10     BCC bra_8250_выход
C - - - - 0x020250 17:8240: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020253 17:8243: AE 12 06  LDX ram_результат_защитника
C - - - - 0x020256 17:8246: E0 02     CPX #$02
C - - - - 0x020258 17:8248: 90 03     BCC bra_824D_защитник_не_отберет_мяч
C - - - - 0x02025A 17:824A: AD 41 04  LDA ram_игрок_с_мячом
bra_824D_защитник_не_отберет_мяч:
C - - - - 0x02025D 17:824D: 20 50 81  JSR sub_8150_отнять_хп_за_смерть_игрока___X_01
bra_8250_выход:
C - - - - 0x020260 17:8250: 60        RTS

ofs_8251_02_82_номер_действия_защитника:
; 00 - block / catch
; 01 - tackle / punch
; 02 - pass cut / triangle jump
C - J - - 0x020261 17:8251: AE 3D 04  LDX ram_действие_защиты
C - - - - 0x020264 17:8254: 60        RTS

ofs_8255_03_83_результат_действия_защитника:
; 00 - атакующий легко обведет/защитник не напорется на летящий мяч/кипер пропустит
; 01 - атакующий с трудом обведет/защитник коснется летящего мяча/кипер пропустит но мяч порвется если супер
; 02 - защитник выбьет мяч у атакующего/отобьет мяч в воздухе/кипер еле отобьет ? либо пропустит и штанга
; 03 - защитник отберет мяч/кипер словит или легко отобьет
; 04 - нарушение по вине защитника
C - J - - 0x020265 17:8255: AE 12 06  LDX ram_результат_защитника
C - - - - 0x020268 17:8258: 60        RTS

ofs_8259_04_84_мяч_у_атакующего_низкий___или_же_высокий:
; 00 - мяч у атакующего/низний мяч
; 01 - высокий мяч
C - J - - 0x020269 17:8259: AE 4E 04  LDX ram_высота_мяча
C - - - - 0x02026C 17:825C: F0 01     BEQ bra_825F_выход
C - - - - 0x02026E 17:825E: CA        DEX
bra_825F_выход:
C - - - - 0x02026F 17:825F: 60        RTS

ofs_8260_05_85_порядковый_номер_защитника:
; 00 - защитник 1
; 01 - защитник 2
; 02 - защитник 3
; 03 - защитник 4
; 04 - защитник 5
C - J - - 0x020270 17:8260: AE 16 06  LDX ram_номер_защитника
C - - - - 0x020273 17:8263: 60        RTS

ofs_8264_06_86_защитник_это_кипер_или_нет:
; 00 - защитник не кипер
; 01 - защитник кипер
C - J - - 0x020274 17:8264: A2 00     LDX #$00
C - - - - 0x020276 17:8266: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020279 17:8269: F0 04     BEQ bra_826F_это_кипер
C - - - - 0x02027B 17:826B: C9 0B     CMP #$0B
C - - - - 0x02027D 17:826D: D0 01     BNE bra_8270_выход
bra_826F_это_кипер:
C - - - - 0x02027F 17:826F: E8        INX
bra_8270_выход:
C - - - - 0x020280 17:8270: 60        RTS

ofs_8275_08_88:
; 00 - 
; 01 - 
; 02 - это кипер
C - J - - 0x020285 17:8275: A2 02     LDX #$02
C - - - - 0x020287 17:8277: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x02028A 17:827A: F0 0D     BEQ bra_8289_выход
C - - - - 0x02028C 17:827C: C9 0B     CMP #$0B
C - - - - 0x02028E 17:827E: F0 09     BEQ bra_8289_выход
C - - - - 0x020290 17:8280: CA        DEX
C - - - - 0x020291 17:8281: AD 3D 04  LDA ram_действие_защиты
C - - - - 0x020294 17:8284: C9 03     CMP #$03
C - - - - 0x020296 17:8286: F0 01     BEQ bra_8289_выход
C - - - - 0x020298 17:8288: CA        DEX
bra_8289_выход:
C - - - - 0x020299 17:8289: 60        RTS

ofs_828A_09_89_действие_атаки_на_штрафной:
; 00 - shoot
; 01 - pass
; 02 - trap
; 03 - through
C - J - - 0x02029A 17:828A: AC 3B 04  LDY ram_действие_атаки
C - - - - 0x02029D 17:828D: BE 91 82  LDX tbl_8291,Y
C - - - - 0x0202A0 17:8290: 60        RTS

tbl_8291:
    .byte $00   ; shoot
    .byte $01   ; pass
    .byte $FF   ; unused
    .byte $FF   ; unused
    .byte $02   ; trap
    .byte $03   ; through

ofs_829F_0C_8C:
; 00 - 
; 01 - 
C - J - - 0x0202AF 17:829F: A2 00     LDX #$00
C - - - - 0x0202B1 17:82A1: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0202B4 17:82A4: D0 0B     BNE bra_82B8_это_не_удар
C - - - - 0x0202B6 17:82A6: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x0202B9 17:82A9: 29 7F     AND #$7F
C - - - - 0x0202BB 17:82AB: C9 03     CMP #$03
C - - - - 0x0202BD 17:82AD: 90 0A     BCC bra_82B9_выход        ; это не спешал
C - - - - 0x0202BF 17:82AF: B0 07     BCS bra_82B8_это_спешал
bra_82B8_это_не_удар:
; bzk хз зачем эта дальнейшая проверка, разве можно забить не ударом, но каким-то другим спешалом?
C - - - - 0x0202C1 17:82B1: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x0202C4 17:82B4: 29 7F     AND #$7F
C - - - - 0x0202C6 17:82B6: F0 01     BEQ bra_82B9_выход
bra_82B8_это_спешал:
C - - - - 0x0202C8 17:82B8: E8        INX
bra_82B9_выход:
C - - - - 0x0202C9 17:82B9: 60        RTS

ofs_82BA_0D_8D:
; 00 - 
; 01 - 
; 02 - 
; 03 - 
; 04 - 
C - J - - 0x0202CA 17:82BA: AD 43 04  LDA $0443
C - - - - 0x0202CD 17:82BD: C9 06     CMP #$06
C - - - - 0x0202CF 17:82BF: F0 19     BEQ bra_82DA
C - - - - 0x0202D1 17:82C1: AD 2C 06  LDA $062C
C - - - - 0x0202D4 17:82C4: 10 05     BPL bra_82CB
C - - - - 0x0202D6 17:82C6: 49 FF     EOR #$FF
C - - - - 0x0202D8 17:82C8: 18        CLC
C - - - - 0x0202D9 17:82C9: 69 01     ADC #$01
bra_82CB:
C - - - - 0x0202DB 17:82CB: C9 40     CMP #$40
C - - - - 0x0202DD 17:82CD: 90 04     BCC bra_82D3
C - - - - 0x0202DF 17:82CF: 49 FF     EOR #$FF
C - - - - 0x0202E1 17:82D1: 29 3F     AND #$3F
bra_82D3:
C - - - - 0x0202E3 17:82D3: C9 20     CMP #$20
C - - - - 0x0202E5 17:82D5: 90 03     BCC bra_82DA
C - - - - 0x0202E7 17:82D7: EE 43 04  INC $0443
bra_82DA:
C - - - - 0x0202EA 17:82DA: AD 43 04  LDA $0443
C - - - - 0x0202ED 17:82DD: 0A        ASL
C - - - - 0x0202EE 17:82DE: 0A        ASL
C - - - - 0x0202EF 17:82DF: 6D 43 04  ADC $0443
C - - - - 0x0202F2 17:82E2: A8        TAY
C - - - - 0x0202F3 17:82E3: A2 00     LDX #$00
C - - - - 0x0202F5 17:82E5: AD E3 00  LDA ram_рандом_3
bra_82E8_цикл:
C - - - - 0x0202F8 17:82E8: D9 08 83  CMP tbl_8308,Y
C - - - - 0x0202FB 17:82EB: B0 06     BCS bra_82F3_больше_или_равно
C - - - - 0x0202FD 17:82ED: F0 04     BEQ bra_82F3_больше_или_равно
C - - - - 0x0202FF 17:82EF: E8        INX
C - - - - 0x020300 17:82F0: C8        INY
C - - - - 0x020301 17:82F1: D0 F5     BNE bra_82E8_цикл
bra_82F3_больше_или_равно:
C - - - - 0x020303 17:82F3: 8A        TXA
C - - - - 0x020304 17:82F4: 48        PHA
C - - - - 0x020305 17:82F5: 20 FB 82  JSR sub_82FB_подпрограмма
C - - - - 0x020308 17:82F8: 68        PLA
C - - - - 0x020309 17:82F9: AA        TAX
C - - - - 0x02030A 17:82FA: 60        RTS

sub_82FB_подпрограмма:
C - - - - 0x02030B 17:82FB: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02030E 17:82FE: 36 83     .word _общий_RTS
- D - I - 0x020310 17:8300: 37 83     .word ofs_8337_01
- D - I - 0x020312 17:8302: 2D 83     .word ofs_832D_02
- D - I - 0x020314 17:8304: 40 83     .word ofs_8340_03
- D - I - 0x020316 17:8306: 4C 83     .word ofs_834C_04

tbl_8308:
- D - - - 0x020318 17:8308: 4D        .byte $4D
- D - - - 0x020319 17:8309: 39        .byte $39
- D - - - 0x02031A 17:830A: 21        .byte $21
- D - - - 0x02031B 17:830B: 0F        .byte $0F
- D - - - 0x02031C 17:830C: 00        .byte $00
- D - - - 0x02031D 17:830D: 81        .byte $81
- D - - - 0x02031E 17:830E: 53        .byte $53
- D - - - 0x02031F 17:830F: 2D        .byte $2D
- D - - - 0x020320 17:8310: 19        .byte $19
- D - - - 0x020321 17:8311: 00        .byte $00
- D - - - 0x020322 17:8312: 57        .byte $57
- D - - - 0x020323 17:8313: 1F        .byte $1F
- D - - - 0x020324 17:8314: 17        .byte $17
- - - - - 0x020325 17:8315: 0D        .byte $0D
- - - - - 0x020326 17:8316: 00        .byte $00
- D - - - 0x020327 17:8317: 64        .byte $64
- D - - - 0x020328 17:8318: 1F        .byte $1F
- - - - - 0x020329 17:8319: 17        .byte $17
- - - - - 0x02032A 17:831A: 0D        .byte $0D
- - - - - 0x02032B 17:831B: 00        .byte $00
- D - - - 0x02032C 17:831C: 2C        .byte $2C
- D - - - 0x02032D 17:831D: 13        .byte $13
- D - - - 0x02032E 17:831E: FF        .byte $FF
- D - - - 0x02032F 17:831F: 0F        .byte $0F
- D - - - 0x020330 17:8320: 00        .byte $00
- D - - - 0x020331 17:8321: 42        .byte $42
- D - - - 0x020332 17:8322: 1E        .byte $1E
- D - - - 0x020333 17:8323: FF        .byte $FF
- D - - - 0x020334 17:8324: 15        .byte $15
- D - - - 0x020335 17:8325: 00        .byte $00
- D - - - 0x020336 17:8326: 1F        .byte $1F
- - - - - 0x020337 17:8327: 13        .byte $13
- - - - - 0x020338 17:8328: FF        .byte $FF
- - - - - 0x020339 17:8329: 0F        .byte $0F
- - - - - 0x02033A 17:832A: 00        .byte $00
- - - - - 0x02033B 17:832B: 00        .byte $00
- - - - - 0x02033C 17:832C: 00        .byte $00

ofs_832D_02:
C - J - - 0x02033D 17:832D: 20 50 83  JSR sub_8350
C - - - - 0x020340 17:8330: A9 02     LDA #$02
C - - - - 0x020342 17:8332: 8D 12 06  STA ram_результат_защитника
C - - - - 0x020345 17:8335: 60        RTS

ofs_8337_01:
C - J - - 0x020347 17:8337: A9 02     LDA #$02
C - - - - 0x020349 17:8339: 8D 12 06  STA ram_результат_защитника
C - - - - 0x02034C 17:833C: EE 16 06  INC ram_номер_защитника
C - - - - 0x02034F 17:833F: 60        RTS

ofs_8340_03:
C - J - - 0x020350 17:8340: 20 50 83  JSR sub_8350
C - - - - 0x020353 17:8343: 20 5C 83  JSR sub_835C
C - - - - 0x020356 17:8346: A9 02     LDA #$02
C - - - - 0x020358 17:8348: 8D 3C 04  STA ram_подтип_действия_атаки
C - - - - 0x02035B 17:834B: 60        RTS

ofs_834C_04:
sub_8350:
C - - - - 0x020360 17:8350: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020363 17:8353: 49 0B     EOR #$0B
C - - - - 0x020365 17:8355: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - 0x020368 17:8358: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x02036B 17:835B: 60        RTS

sub_835C:
C - - - - 0x02036C 17:835C: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x02036F 17:835F: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - 0x020372 17:8362: 8D 41 04  STA ram_игрок_с_мячом
C - - - - 0x020375 17:8365: 60        RTS

ofs_8366_0E_8E_действие_атаки_на_земле:
; 00 - shoot
; 01 - pass
; 02 - dribble
; 03 - 1-2 pass
C - J - - 0x020376 17:8366: AE 3B 04  LDX ram_действие_атаки
C - - - - 0x020379 17:8369: 60        RTS

ofs_836E_10_90:
; 00 - 
; 01 - 
; 02 - 
; 03 - ? unused
; 04 - ? unused
C - J - - 0x02037E 17:836E: A2 00     LDX #$00
C - - - - 0x020380 17:8370: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x020383 17:8373: C9 01     CMP #$01      ; pass
C - - - - 0x020385 17:8375: F0 04     BEQ bra_837B_выход
C - - - - 0x020387 17:8377: 20 77 86  JSR sub_8677
C - - - - 0x02038A 17:837A: E8        INX
bra_837B_выход:
C - - - - 0x02038B 17:837B: 60        RTS

ofs_8384_13_93_спасет_ли_защитник_ворота:
; 00 - защитник не появится
; 01 - защитник промахнется
; 02 - защитник отобьет
C - J - - 0x020394 17:8384: 20 8B 83  JSR sub_838B_действие_защитника_при_спасении_ворот
ofs_836A_0F_8F:
; 00 - 
; 01 - 
; 02 - ? штанга
; 03 - 
; 04 - 
C - - - - 0x020397 17:8387: AE 12 06  LDX ram_результат_защитника
C - - - - 0x02039A 17:838A: 60        RTS

sub_838B_действие_защитника_при_спасении_ворот:
C - - - - 0x02039B 17:838B: AD 12 06  LDA ram_результат_защитника
C - - - - 0x02039E 17:838E: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x0203A1 17:8391: 97 83     .word _общий_RTS      ; защитник не появляется
- D - I - 0x0203A3 17:8393: 98 83     .word ofs_8398_01_02_защитник_появляется
- D - I - 0x0203A5 17:8395: 98 83     .word ofs_8398_01_02_защитник_появляется

ofs_8398_01_02_защитник_появляется:
C - J - - 0x0203A8 17:8398: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0203AB 17:839B: 49 0B     EOR #$0B
C - - - - 0x0203AD 17:839D: 20 48 C5  JSR sub_0x03CEA9_вычислить_управляемого
C - - - - 0x0203B0 17:83A0: 8D 42 04  STA ram_игрок_без_мяча
C - - - - 0x0203B3 17:83A3: 60        RTS

ofs_83A8_15_95:
; 00 - 
; 01 - 
C - J - - 0x0203B8 17:83A8: AC 3D 04  LDY ram_действие_защиты
C - - - - 0x0203BB 17:83AB: BE AF 83  LDX tbl_83AF,Y
C - - - - 0x0203BE 17:83AE: 60        RTS

tbl_83AF:
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $00
    .byte $FF       ; unused
    .byte $01

ofs_83B4_16_96:
; 00 - 
; 01 - 
; 02 - 
C - J - - 0x0203C4 17:83B4: AC 3B 04  LDY ram_действие_атаки
C - - - - 0x0203C7 17:83B7: BE BB 83  LDX tbl_83BB,Y
C - - - - 0x0203CA 17:83BA: 60        RTS

tbl_83BB:
    .byte $FF       ; unused
    .byte $00
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $01
    .byte $FF       ; unused
    .byte $02

ofs_83C6_18_98_проверка_на_jitou_из_японии:
; 00 - это jitou из японии
; 01 - это jitou из куними
C - J - - 0x0203D6 17:83C6: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0203D9 17:83C9: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0203DC 17:83CC: C9 1C     CMP #$1C      ; jitou из японии
C - - - - 0x0203DE 17:83CE: F0 05     BEQ bra_83D5_выход
C - - - - 0x0203E0 17:83D0: C9 48     CMP #$48      ; jitou соперник из японии
C - - - - 0x0203E2 17:83D2: F0 01     BEQ bra_83D5_выход
C - - - - 0x0203E4 17:83D4: E8        INX
bra_83D5_выход:
C - - - - 0x0203E5 17:83D5: 60        RTS

ofs_83E4_1B_9B_спешал_блок:
; 00 - block
; 01 - face block
; 02 - skylab block
; 03 - power block
C - J - - 0x0203F4 17:83E4: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - 0x0203F7 17:83E7: 29 7F     AND #$7F
C - - - - 0x0203F9 17:83E9: AA        TAX
C - - - - 0x0203FA 17:83EA: 60        RTS

ofs_83EB_1C_9C_спешал_дриблинг:
; 00 - dribble
; 01 - heel lift
; 02 - forcible dribble
; 03 - vanishing feint
; 04 - clone dribble
; 05 - high speed dribble
; 06 - hedgehog dribble
C - J - - 0x0203FB 17:83EB: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x0203FE 17:83EE: 29 7F     AND #$7F
C - - - - 0x020400 17:83F0: AA        TAX
C - - - - 0x020401 17:83F1: 20 11 82  JSR sub_8211
C - - - - 0x020404 17:83F4: 60        RTS

ofs_83F5_1D_9D_спешал_удар:
; 00 - shot
; 01 - volley
; 02 - header
; 03 - drive shot
; 04 - drive overhead
; 05 - falcon shot
; 06 - falcon volley
; 07 - razor shot
; 08 - skylab hurricane
; 09 - twin shot
; 0A - skylab twin shot
; 0B - eagle shot
; 0C - tiger shot
; 0D - neo-tiger shot
; 0E - overhead
; 0F - hyper overhead
; 10 - jumping volley
; 11 - drive tiger
; 12 - cyclone
; 13 - sano combo
; 14 - banana shot
; 15 - booster shot
; 16 - mirage shot
; 17 - mach shot
; 18 - sidewinder shot
; 19 - slider shot
; 1A - cannon shot
; 1B - fire shot
; 1C - dynamite header
; 1D - cannon header
; 1E - rocket header
; 1F - rising dragon kick
; 20 - foward somersault
; 21 - slider cannon
; 22 - double eel
C - J - - 0x020405 17:83F5: A9 01     LDA #$01
C - - - - 0x020407 17:83F7: 20 11 82  JSR sub_8211
C - - - - 0x02040A 17:83FA: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x02040D 17:83FD: 29 7F     AND #$7F
C - - - - 0x02040F 17:83FF: AA        TAX
C - - - - 0x020410 17:8400: 60        RTS

ofs_8401_1E_9E:
; 00 - 
; 01 - 
; 02 - 
; 03 - 
C - J - - 0x020411 17:8401: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x020414 17:8404: 29 7F     AND #$7F
C - - - - 0x020416 17:8406: AA        TAX
C - - - - 0x020417 17:8407: 4C 11 82  JMP loc_8211

ofs_840E_20_A0:
; 00 - 
; 01 - 
; 02 - 
C - J - - 0x02041E 17:840E: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020421 17:8411: 49 0B     EOR #$0B
C - - - - 0x020423 17:8413: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020426 17:8416: A2 02     LDX #$02
C - - - - 0x020428 17:8418: C9 74     CMP #$74      ; гертис
C - - - - 0x02042A 17:841A: F0 0E     BEQ bra_842A_выход
C - - - - 0x02042C 17:841C: CA        DEX
C - - - - 0x02042D 17:841D: C9 22     CMP #$22      ; вакашимазу
C - - - - 0x02042F 17:841F: F0 09     BEQ bra_842A_выход
C - - - - 0x020431 17:8421: C9 39     CMP #$39      ; вакашимазу
C - - - - 0x020433 17:8423: F0 05     BEQ bra_842A_выход
C - - - - 0x020435 17:8425: C9 4C     CMP #$4C      ; вакашимазу
C - - - - 0x020437 17:8427: F0 01     BEQ bra_842A_выход
C - - - - 0x020439 17:8429: CA        DEX
bra_842A_выход:
C - - - - 0x02043A 17:842A: 60        RTS

ofs_842B_21_A1_порвана_ли_сетка:
; 00 - не порвана
; 01 - порвана
C - J - - 0x02043B 17:842B: A2 00     LDX #$00
                                      LDA ram_сила_действия_hi
                                      BNE bra_8434
C - - - - 0x02043D 17:842D: AD 1C 06  LDA ram_сила_действия_lo
C - - - - 0x020440 17:8430: C9 60     CMP #$60
C - - - - 0x020442 17:8432: 90 01     BCC bra_8435_выход
bra_8434:
C - - - - 0x020444 17:8434: E8        INX
bra_8435_выход:
C - - - - 0x020445 17:8435: 60        RTS

ofs_8436_22_A2_у_чьей_команды_мяч:
; 00 - у команды слева
; 01 - у команды справа
C - J - - 0x020446 17:8436: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x020449 17:8439: F0 02     BEQ bra_843D_выход
C - - - - 0x02044B 17:843B: A2 01     LDX #$01
bra_843D_выход:
C - - - - 0x02044D 17:843D: 60        RTS

ofs_843E_23_A3_за_какую_команду_играешь:
; 00 - за sao paulo
; 01 - за nankatsu
; 02 - за japan
C - J - - 0x02044E 17:843E: AE 2A 00  LDX ram_твоя_команда
C - - - - 0x020451 17:8441: 60        RTS

ofs_844E_25_A5_coimbra_france_уже_били_или_нет:
; 00 - удар уже бы
; 01 - удара еще не было
C - J - - 0x02045E 17:844E: AE 47 04  LDX ram_флаг_удара_франции_коимбры
C - - - - 0x020461 17:8451: D0 03     BNE bra_8456_выход
C - - - - 0x020463 17:8453: EE 47 04  INC ram_флаг_удара_франции_коимбры
bra_8456_выход:
C - - - - 0x020466 17:8456: 60        RTS

ofs_8457_26_A6_проигрывает_ли_германия:
; 00 - германия не проигрывает
; 01 - германия проигрывает
C - J - - 0x020467 17:8457: A2 00     LDX #$00
C - - - - 0x020469 17:8459: AD 2B 00  LDA ram_команда_соперника
C - - - - 0x02046C 17:845C: C9 22     CMP #$22          ; это не германия
C - - - - 0x02046E 17:845E: D0 1D     BNE bra_847D_выход
C - - - - 0x020470 17:8460: A0 00     LDY #$00
C - - - - 0x020472 17:8462: AD 28 00  LDA ram_голы
C - - - - 0x020475 17:8465: 38        SEC
C - - - - 0x020476 17:8466: ED 29 00  SBC ram_голы + 1
C - - - - 0x020479 17:8469: 90 0F     BCC bra_847A      ; japan проигрывает
C - - - - 0x02047B 17:846B: F0 0D     BEQ bra_847A      ; ничья
C - - - - 0x02047D 17:846D: A0 80     LDY #$80
C - - - - 0x02047F 17:846F: A9 CA     LDA #$CA
C - - - - 0x020481 17:8471: 8D FE 03  STA $03FE
C - - - - 0x020484 17:8474: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020487 17:8477: D0 01     BNE bra_847A      ; гол забили соперники
C - - - - 0x020489 17:8479: E8        INX
bra_847A:
C - - - - 0x02048A 17:847A: 8C FD 03  STY $03FD
bra_847D_выход:
C - - - - 0x02048D 17:847D: 60        RTS

ofs_847E_28_A8_оба_игрока_с_рожами:
; 00 - игрок без рожи
; 01 - tsubasa
; 02 - misaki
; 03 - misaki
; 04 - hyuga
; 05 - hyuga
; 06 - misugi
; 07 - misugi
; 08 - matsuyama
; 09 - matsuyama
; 0A - ishizaki
; 0B - ishizaki
; 0C - souda
; 0D - souda
; 0E - jitou
; 0F - jitou
; 10 - masao/kazuo
; 11 - masao/kazuo
; 12 - nitta
; 13 - nitta
; 14 - sawada
; 15 - sawada
; 16 - coimbra
; 17 - carlos
; 18 - carlos
; 19 - schneider
; 1A - kaltz
; 1B - schester
; 1C - diaz
; 1D - pascal
; 1E - pierre
; 1F - napoleon
; 20 - victorino
; 21 - kaltz
C - J - - 0x02048E 17:847E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020491 17:8481: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020494 17:8484: A8        TAY
C - - - - 0x020495 17:8485: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x020498 17:8488: F0 0D     BEQ bra_8497_выход
C - - - - 0x02049A 17:848A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x02049D 17:848D: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0204A0 17:8490: A8        TAY
C - - - - 0x0204A1 17:8491: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x0204A4 17:8494: 20 11 82  JSR sub_8211
bra_8497_выход:
C - - - - 0x0204A7 17:8497: 60        RTS

ofs_8498_29_A9_оба_игрока_с_рожами:
; 00 - игрок без рожи
; 01 - tsubasa
; 02 - misaki
; 03 - misaki
; 04 - hyuga
; 05 - hyuga
; 06 - misugi
; 07 - misugi
; 08 - matsuyama
; 09 - matsuyama
; 0A - ishizaki
; 0B - ishizaki
; 0C - souda
; 0D - souda
; 0E - jitou
; 0F - jitou
; 10 - masao/kazuo
; 11 - masao/kazuo
; 12 - nitta
; 13 - nitta
; 14 - sawada
; 15 - sawada
; 16 - coimbra
; 17 - carlos
; 18 - carlos
; 19 - schneider
; 1A - kaltz
; 1B - schester
; 1C - diaz
; 1D - pascal
; 1E - pierre
; 1F - napoleon
; 20 - victorino
; 21 - kaltz
C - J - - 0x0204A8 17:8498: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0204AB 17:849B: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0204AE 17:849E: A8        TAY
C - - - - 0x0204AF 17:849F: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x0204B2 17:84A2: F0 0D     BEQ bra_84B1_выход
C - - - - 0x0204B4 17:84A4: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0204B7 17:84A7: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0204BA 17:84AA: A8        TAY
C - - - - 0x0204BB 17:84AB: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x0204BE 17:84AE: 20 11 82  JSR sub_8211
bra_84B1_выход:
C - - - - 0x0204C1 17:84B1: 60        RTS

ofs_84B2_2A_AA_игрок_с_рожей:
; 00 - игрок без рожи
; 01 - tsubasa
; 02 - misaki
; 03 - misaki
; 04 - hyuga
; 05 - hyuga
; 06 - misugi
; 07 - misugi
; 08 - matsuyama
; 09 - matsuyama
; 0A - ishizaki
; 0B - ishizaki
; 0C - souda
; 0D - souda
; 0E - jitou
; 0F - jitou
; 10 - masao/kazuo
; 11 - masao/kazuo
; 12 - nitta
; 13 - nitta
; 14 - sawada
; 15 - sawada
; 16 - coimbra
; 17 - carlos
; 18 - carlos
; 19 - schneider
; 1A - kaltz
; 1B - schester
; 1C - diaz
; 1D - pascal
; 1E - pierre
; 1F - napoleon
; 20 - victorino
; 21 - kaltz
C - J - - 0x0204C2 17:84B2: A2 00     LDX #$00
C - - - - 0x0204C4 17:84B4: 2C 3E 04  BIT ram_подтип_действия_защиты
C - - - - 0x0204C7 17:84B7: 10 0D     BPL bra_84C6_выход
C - - - - 0x0204C9 17:84B9: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x0204CC 17:84BC: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0204CF 17:84BF: A8        TAY
C - - - - 0x0204D0 17:84C0: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x0204D3 17:84C3: 20 11 82  JSR sub_8211
bra_84C6_выход:
C - - - - 0x0204D6 17:84C6: 60        RTS

ofs_84C7_2B_AB_проверка_на_100_хп:
; 00 - есть 100 хп
; 01 - меньше 100 хп
C - J - - 0x0204D7 17:84C7: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0204DA 17:84CA: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x0204DD 17:84CD: F0 03     BEQ bra_84D2_это_наша_команда
C - - - - 0x0204DF 17:84CF: AD 42 04  LDA ram_игрок_без_мяча
bra_84D2_это_наша_команда:
C - - - - 0x0204E2 17:84D2: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0204E5 17:84D5: A2 00     LDX #$00
C - - - - 0x0204E7 17:84D7: A0 01     LDY #con_игрок_энергия_lo
C - - - - 0x0204E9 17:84D9: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0204EB 17:84DB: 38        SEC
C - - - - 0x0204EC 17:84DC: E9 64     SBC #$64
C - - - - 0x0204EE 17:84DE: C8        INY
C - - - - 0x0204EF 17:84DF: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0204F1 17:84E1: E9 00     SBC #$00
C - - - - 0x0204F3 17:84E3: B0 01     BCS bra_84E6_выход
C - - - - 0x0204F5 17:84E5: E8        INX
bra_84E6_выход:
C - - - - 0x0204F6 17:84E6: 60        RTS

ofs_84E7_2C_AC:
; 00 - 
; 01 - 
C - J - - 0x0204F7 17:84E7: AE 00 06  LDX ram_колво_нападающих
C - - - - 0x0204FA 17:84EA: F0 02     BEQ bra_84EE_выход
C - - - - 0x0204FC 17:84EC: A2 01     LDX #$01
bra_84EE_выход:
C - - - - 0x0204FE 17:84EE: 60        RTS

ofs_84EF_2D_AD_забил_ли_jitou_гол_с_сано:
; 00 - гол забит другим ударом
; 01 - гол забили jitou с сано
C - J - - 0x0204FF 17:84EF: A2 00     LDX #$00
C - - - - 0x020501 17:84F1: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x020504 17:84F4: 29 7F     AND #$7F
C - - - - 0x020506 17:84F6: C9 13     CMP #$13      ; sano combo
C - - - - 0x020508 17:84F8: D0 01     BNE bra_84FB_выход
C - - - - 0x02050A 17:84FA: E8        INX
bra_84FB_выход:
C - - - - 0x02050B 17:84FB: 60        RTS

ofs_84FC_2E_AE:
; 00 - кипер не дисбалансирован
; 01 - кипер дисбалансирован
C - J - - 0x02050C 17:84FC: 20 51 C5  JSR sub_0x03CD87_адрес_игрока_команды_без_мяча
C - - - - 0x02050F 17:84FF: A2 00     LDX #$00
C - - - - 0x020511 17:8501: A0 07     LDY #con_величина_дисбаланса
C - - - - 0x020513 17:8503: B1 34     LDA (ram_plr_data),Y
C - - - - 0x020515 17:8505: C9 18     CMP #$18
C - - - - 0x020517 17:8507: 90 01     BCC bra_850A_выход
C - - - - 0x020519 17:8509: E8        INX
bra_850A_выход:
C - - - - 0x02051A 17:850A: 60        RTS

ofs_850B_2F_AF_киперы_с_критами:
; 00 - кипер без крита
; 01 - морисаки
; 02 - вакабаяши
C - J - - 0x02051B 17:850B: A2 00     LDX #$00
C - - - - 0x02051D 17:850D: 2C 3E 04  BIT ram_подтип_действия_защиты
C - - - - 0x020520 17:8510: 10 14     BPL bra_8526_выход
C - - - - 0x020522 17:8512: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020525 17:8515: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020528 17:8518: C9 0F     CMP #$0F      ; морисаки
C - - - - 0x02052A 17:851A: F0 09     BEQ bra_8525
C - - - - 0x02052C 17:851C: C9 21     CMP #$21      ; вакабаяши из японии
C - - - - 0x02052E 17:851E: F0 04     BEQ bra_8524
C - - - - 0x020530 17:8520: C9 40     CMP #$40      ; вакабаяши из гамбурга
C - - - - 0x020532 17:8522: D0 02     BNE bra_8526_выход
bra_8524:
C - - - - 0x020534 17:8524: E8        INX
bra_8525:
C - - - - 0x020535 17:8525: E8        INX
bra_8526_выход:
C - - - - 0x020536 17:8526: 60        RTS

ofs_8527_30_B0_diaz_tsubasa:
; 00 - это не diaz и не tsubasa
; 01 - это tsubasa
; 02 - это diaz
C - J - - 0x020537 17:8527: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x02053A 17:852A: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x02053D 17:852D: A2 02     LDX #$02
C - - - - 0x02053F 17:852F: C9 60     CMP #$60      ; diaz
C - - - - 0x020541 17:8531: F0 06     BEQ bra_8539_выход
C - - - - 0x020543 17:8533: CA        DEX
C - - - - 0x020544 17:8534: C9 01     CMP #$01      ; tsubasa
C - - - - 0x020546 17:8536: F0 01     BEQ bra_8539_выход
C - - - - 0x020548 17:8538: CA        DEX
bra_8539_выход:
C - - - - 0x020549 17:8539: 60        RTS

ofs_853A_31_B1_nitta:
; 00 - это nitta
; 01 - это не nitta
C - J - - 0x02054A 17:853A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x02054D 17:853D: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020550 17:8540: C9 15     CMP #$15      ; nitta
C - - - - 0x020552 17:8542: F0 01     BEQ bra_8545_выход
- - - - - 0x020554 17:8544: E8        INX
bra_8545_выход:
C - - - - 0x020555 17:8545: 60        RTS

ofs_8546_32_B2_souda:
; 00 - это souda
; 01 - это не souda
C - J - - 0x020556 17:8546: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x020559 17:8549: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x02055C 17:854C: C9 1B     CMP #$1B      ; souda
C - - - - 0x02055E 17:854E: F0 05     BEQ bra_8555_выход
C - - - - 0x020560 17:8550: C9 4A     CMP #$4A      ; souda
C - - - - 0x020562 17:8552: F0 01     BEQ bra_8555_выход
C - - - - 0x020564 17:8554: E8        INX
bra_8555_выход:
C - - - - 0x020565 17:8555: 60        RTS

ofs_8556_33_B3_игроки_с_защитным_спешалом:
; 00 - игрок без защитного спешала
; 01 - masao/kazuo
; 02 - masao/kazuo
; 03 - souda
; 04 - souda
; 05 - jitou
; 06 - jitou
; 07 - dirceu
; 08 - dirceu
; 09 - robson
; 0A - libuta
; 0B - galvan
; 0C - hyuga
; 0D - hyuga
; 0E - ishizaki
; 0F - ishizaki
C - J - - 0x020566 17:8556: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - 0x020569 17:8559: 29 7F     AND #$7F
C - - - - 0x02056B 17:855B: AA        TAX
C - - - - 0x02056C 17:855C: F0 0D     BEQ bra_856B_выход
C - - - - 0x02056E 17:855E: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020571 17:8561: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020574 17:8564: A8        TAY
C - - - - 0x020575 17:8565: BE 6A 87  LDX tbl_876A_игроки_с_защитным_спешалом,Y
C - - - - 0x020578 17:8568: 20 11 82  JSR sub_8211
bra_856B_выход:
C - - - - 0x02057B 17:856B: 60        RTS

ofs_856C_34_B4_узнать_высоту_мяча:
; 00 - мяч у атакующего на земле
; 01 - летит низкий мяч
; 02 - летит высокий мяч
C - J - - 0x02057C 17:856C: AE 4E 04  LDX ram_высота_мяча
C - - - - 0x02057F 17:856F: 60        RTS

ofs_8570_35_B5:
; 00 - 
; 01 - 
; 02 - 
C - J - - 0x020580 17:8570: AD 3D 04  LDA ram_действие_защиты
C - - - - 0x020583 17:8573: 29 0F     AND #$0F
C - - - - 0x020585 17:8575: A8        TAY
C - - - - 0x020586 17:8576: BE 7A 85  LDX tbl_857A,Y
C - - - - 0x020589 17:8579: 60        RTS

tbl_857A:
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $00
    .byte $01
    .byte $FF       ; unused
    .byte $02

ofs_8580_36_B6_спешал_catch:
; 00 - catch
; 01 - rolling save
; 02 - clone save
; 03 - dark illusion
C - J - - 0x020590 17:8580: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - 0x020593 17:8583: 29 7F     AND #$7F
C - - - - 0x020595 17:8585: AA        TAX
C - - - - 0x020596 17:8586: 60        RTS

ofs_8587_37_B7:
; 00 - ?
; 01 - ?
C - J - - 0x020597 17:8587: AD 3E 04  LDA ram_подтип_действия_защиты
C - - - - 0x02059A 17:858A: 29 7F     AND #$7F
C - - - - 0x02059C 17:858C: AA        TAX
C - - - - 0x02059D 17:858D: F0 02     BEQ bra_8591_выход
C - - - - 0x02059F 17:858F: A2 01     LDX #$01
bra_8591_выход:
C - - - - 0x0205A1 17:8591: 60        RTS

ofs_8592_38_B8_hyuga:
; 00 - это hyuga
; 01 - это не hyuga
C - J - - 0x0205A2 17:8592: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205A5 17:8595: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205A8 17:8598: C9 1A     CMP #$1A      ; hyuga из японии
C - - - - 0x0205AA 17:859A: F0 05     BEQ bra_85A1_выход
C - - - - 0x0205AC 17:859C: C9 41     CMP #$41      ; hyuga
C - - - - 0x0205AE 17:859E: F0 01     BEQ bra_85A1_выход
C - - - - 0x0205B0 17:85A0: E8        INX
bra_85A1_выход:
C - - - - 0x0205B1 17:85A1: 60        RTS

ofs_85A2_39_B9_matsuyama:
; 00 - это matsuyama
; 01 - это не matsuyama
C - J - - 0x0205B2 17:85A2: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205B5 17:85A5: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205B8 17:85A8: C9 1D     CMP #$1D      ; matsuyama из японии
C - - - - 0x0205BA 17:85AA: F0 05     BEQ bra_85B1_выход
C - - - - 0x0205BC 17:85AC: C9 4B     CMP #$4B      ; matsuyama соперник
C - - - - 0x0205BE 17:85AE: F0 01     BEQ bra_85B1_выход
C - - - - 0x0205C0 17:85B0: E8        INX
bra_85B1_выход:
C - - - - 0x0205C1 17:85B1: 60        RTS

ofs_85B2_3A_BA_kaltz:
; 00 - это kaltz
; 01 - это не kaltz
C - J - - 0x0205C2 17:85B2: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205C5 17:85B5: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205C8 17:85B8: C9 3E     CMP #$3E      ; kaltz из гамбурга
C - - - - 0x0205CA 17:85BA: F0 01     BEQ bra_85BD_выход
- - - - - 0x0205CC 17:85BC: E8        INX
bra_85BD_выход:
C - - - - 0x0205CD 17:85BD: 60        RTS

ofs_85BE_3B_BB_carlos:
; 00 - это carlos
; 01 - это не carlos
C - J - - 0x0205CE 17:85BE: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205D1 17:85C1: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205D4 17:85C4: C9 2B     CMP #$2B      ; carlos из фламенго
C - - - - 0x0205D6 17:85C6: F0 01     BEQ bra_85C9_выход
C - - - - 0x0205D8 17:85C8: E8        INX
bra_85C9_выход:
C - - - - 0x0205D9 17:85C9: 60        RTS

ofs_85CA_3C_BC_misugi:
; 00 - это misugi
; 01 - это не misugi
C - J - - 0x0205DA 17:85CA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205DD 17:85CD: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205E0 17:85D0: C9 20     CMP #$20      ; misugi из японии (наша команда)
C - - - - 0x0205E2 17:85D2: F0 05     BEQ bra_85D9_выход
C - - - - 0x0205E4 17:85D4: C9 45     CMP #$45      ; misugi из японии (соперник)
C - - - - 0x0205E6 17:85D6: F0 01     BEQ bra_85D9_выход
C - - - - 0x0205E8 17:85D8: E8        INX
bra_85D9_выход:
C - - - - 0x0205E9 17:85D9: 60        RTS

ofs_85DA_3D_BD_misaki:
; 00 - это misaki:
; 01 - это не misaki:
C - J - - 0x0205EA 17:85DA: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0205ED 17:85DD: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0205F0 17:85E0: C9 11     CMP #$11      ; misaki из nankatsu
C - - - - 0x0205F2 17:85E2: F0 01     BEQ bra_85E5_выход
- - - - - 0x0205F4 17:85E4: E8        INX
bra_85E5_выход:
C - - - - 0x0205F5 17:85E5: 60        RTS

ofs_85E6_3E_BE:
; 00 - 
; 01 - 
; 02 - 
; 03 - 
; 04 - 
; 05 - 
; 06 - 
; 07 - 
; 08 - 
C - J - - 0x0205F6 17:85E6: AD 3B 04  LDA ram_действие_атаки
C - - - - 0x0205F9 17:85E9: 38        SEC
C - - - - 0x0205FA 17:85EA: E9 07     SBC #$07
C - - - - 0x0205FC 17:85EC: 85 3B     STA ram_003B
C - - - - 0x0205FE 17:85EE: 0A        ASL
C - - - - 0x0205FF 17:85EF: 65 3B     ADC ram_003B
C - - - - 0x020601 17:85F1: 85 3B     STA ram_003B
C - - - - 0x020603 17:85F3: AD 3D 04  LDA ram_действие_защиты
C - - - - 0x020606 17:85F6: 38        SEC
C - - - - 0x020607 17:85F7: E9 07     SBC #$07
C - - - - 0x020609 17:85F9: 18        CLC
C - - - - 0x02060A 17:85FA: 65 3B     ADC ram_003B
C - - - - 0x02060C 17:85FC: AA        TAX
C - - - - 0x02060D 17:85FD: 60        RTS

ofs_8602_40_C0_игрок_с_рожей:
; 00 - игрок без рожи
; 01 - tsubasa
; 02 - misaki
; 03 - misaki
; 04 - hyuga
; 05 - hyuga
; 06 - misugi
; 07 - misugi
; 08 - matsuyama
; 09 - matsuyama
; 0A - ishizaki
; 0B - ishizaki
; 0C - souda
; 0D - souda
; 0E - jitou
; 0F - jitou
; 10 - masao/kazuo
; 11 - masao/kazuo
; 12 - nitta
; 13 - nitta
; 14 - sawada
; 15 - sawada
; 16 - coimbra
; 17 - carlos
; 18 - carlos
; 19 - schneider
; 1A - kaltz
; 1B - schester
; 1C - diaz
; 1D - pascal
; 1E - pierre
; 1F - napoleon
; 20 - victorino
; 21 - kaltz
C - J - - 0x020612 17:8602: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x020615 17:8605: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020618 17:8608: A8        TAY
C - - - - 0x020619 17:8609: BE F4 86  LDX tbl_86F4_игроки_с_рожами,Y
C - - - - 0x02061C 17:860C: 20 11 82  JSR sub_8211
C - - - - 0x02061F 17:860F: 60        RTS

ofs_8610_41_C1_какая_у_кипера_рожа:
; 00 - кипер без рожи
; 01 - ренато
; 02 - морисаки
; 03 - вакабаяши
; 04 - вакашимазу
C - J - - 0x020620 17:8610: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020623 17:8613: 49 0B     EOR #$0B
C - - - - 0x020625 17:8615: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x020628 17:8618: A2 04     LDX #$04
bra_861A_цикл_поиска_кипера:
C - - - - 0x02062A 17:861A: DD 22 86  CMP tbl_8623_наши_киперы - 1,X
C - - - - 0x02062D 17:861D: F0 03     BEQ bra_8622_выход
C - - - - 0x02062F 17:861F: CA        DEX
C - - - - 0x020630 17:8620: D0 F8     BNE bra_861A_цикл_поиска_кипера
bra_8622_выход:
C - - - - 0x020632 17:8622: 60        RTS

tbl_8623_наши_киперы:
    .byte $02       ; ренато
    .byte $0F       ; морисаки
    .byte $21       ; вакабаяши
    .byte $22       ; вакашимазу

ofs_8627_42_C2_2_варианта_рандома:
; 00 - рандом 1
; 01 - рандом 2
C - J - - 0x020637 17:8627: AD E2 00  LDA ram_рандом_2
C - - - - 0x02063A 17:862A: 29 01     AND #$01
C - - - - 0x02063C 17:862C: AA        TAX
C - - - - 0x02063D 17:862D: 60        RTS

ofs_862E_43_C3:
; 00 - 
; 01 - 
; 02 - 
C - J - - 0x02063E 17:862E: AC 3D 04  LDY ram_действие_защиты
C - - - - 0x020641 17:8631: BE 35 86  LDX tbl_8635,Y
C - - - - 0x020644 17:8634: 60        RTS

tbl_8635:
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $00
    .byte $FF       ; unused
    .byte $01
    .byte $02

ofs_863B_44_C4_делает_ли_кипер_dive:
; 00 - кипер делает dive
; 01 - кипер ждет в воротах
C - J - - 0x02064B 17:863B: AD 3D 04  LDA ram_действие_защиты
C - - - - 0x02064E 17:863E: 29 0F     AND #$0F
C - - - - 0x020650 17:8640: A8        TAY
C - - - - 0x020651 17:8641: BE 45 86  LDX tbl_8645,Y
C - - - - 0x020654 17:8644: 60        RTS

tbl_8645:
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $FF       ; unused
    .byte $00
    .byte $01

ofs_864A_45_C5:
; 00 - 
; 01 - 
C - J - - 0x02065A 17:864A: A2 00     LDX #$00
C - - - - 0x02065C 17:864C: AD 12 06  LDA ram_результат_защитника
C - - - - 0x02065F 17:864F: C9 03     CMP #$03
C - - - - 0x020661 17:8651: B0 23     BCS bra_8676_выход
C - - - - 0x020663 17:8653: AD 44 04  LDA ram_спешал_атакующего
C - - - - 0x020666 17:8656: 20 38 81  JSR sub_8138_рандом_убийства_игрока___X_00
C - - - - 0x020669 17:8659: C9 80     CMP #$80
C - - - - 0x02066B 17:865B: 90 19     BCC bra_8676_выход
C - - - - 0x02066D 17:865D: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020670 17:8660: 49 0B     EOR #$0B
C - - - - 0x020672 17:8662: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x020675 17:8665: A0 05     LDY #con_игрок_координата_X_lo
C - - - - 0x020677 17:8667: B1 34     LDA (ram_plr_data),Y
C - - - - 0x020679 17:8669: 18        CLC
C - - - - 0x02067A 17:866A: 69 00     ADC #$00
C - - - - 0x02067C 17:866C: C9 80     CMP #$80
C - - - - 0x02067E 17:866E: 90 02     BCC bra_8672
- - - - - 0x020680 17:8670: A9 7F     LDA #$7F
bra_8672:
C - - - - 0x020682 17:8672: 91 34     STA (ram_plr_data),Y
C - - - - 0x020684 17:8674: A2 01     LDX #$01
bra_8676_выход:
C - - - - 0x020686 17:8676: 60        RTS

ofs_8677_46_C6:
sub_8677:
; 00 - ?
; 01 - ?
C - J - - 0x020687 17:8677: A2 00     LDX #$00      ; bzk можно не загружать X, раз он уже есть в подпрограмме
C - - - - 0x020689 17:8679: AD 44 04  LDA ram_спешал_атакующего
C - - - - 0x02068C 17:867C: 20 38 81  JSR sub_8138_рандом_убийства_игрока___X_00
C - - - - 0x02068F 17:867F: C9 80     CMP #$80
C - - - - 0x020691 17:8681: 90 06     BCC bra_8689_выход
C - - - - 0x020693 17:8683: AD 42 04  LDA ram_игрок_без_мяча
C - - - - 0x020696 17:8686: 20 50 81  JSR sub_8150_отнять_хп_за_смерть_игрока___X_01
bra_8689_выход:
C - - - - 0x020699 17:8689: 60        RTS

ofs_868A_47_C7_кто_делает_силовой_дриблинг:
; 00 - hyuga из японии
; 01 - hyuga из тохо
; 02 - jitou из японии
; 03 - jitou из куними
; 04 - napoleon
; 05 - игрок без рожи
C - J - - 0x02069A 17:868A: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x02069D 17:868D: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0206A0 17:8690: A0 00     LDY #$00
bra_8692_цикл:
C - - - - 0x0206A2 17:8692: D9 A6 86  CMP tbl_86A6_игрок,Y
C - - - - 0x0206A5 17:8695: F0 06     BEQ bra_869D
C - - - - 0x0206A7 17:8697: C8        INY
C - - - - 0x0206A8 17:8698: C8        INY
C - - - - 0x0206A9 17:8699: C0 0E     CPY #$0E
C - - - - 0x0206AB 17:869B: D0 F5     BNE bra_8692_цикл
bra_869D:
C - - - - 0x0206AD 17:869D: BE A7 86  LDX tbl_86A6_игрок + 1,Y
C - - - - 0x0206B0 17:86A0: A9 01     LDA #$01
C - - - - 0x0206B2 17:86A2: 20 11 82  JSR sub_8211
C - - - - 0x0206B5 17:86A5: 60        RTS

tbl_86A6_игрок:
    .byte $1A       ; hyuga из нашей японии
    .byte $00       ; X     
    
    .byte $41       ; hyuga соперник из японии
    .byte $00       ; X
    
    .byte $36       ; hyuga из тохо
    .byte $01       ; X
    
    .byte $1C       ; jitou из нашей японии
    .byte $02       ; X
    
    .byte $48       ; jitou соперник из японии
    .byte $02       ; X
    
    .byte $2E       ; jitou из куними
    .byte $03       ; X
    
    .byte $57       ; napoleon
    .byte $04       ; X
    
    .byte $00       ; игрок без рожи, unused так как не читается в цикле
    .byte $05       ; X



ofs_86B6_48_C8:
; 00 - 
; 01 - 
; 02 - 
; 03 - 
; 04 - 
C - J - - 0x0206C6 17:86B6: A2 00     LDX #$00
C - - - - 0x0206C8 17:86B8: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x0206CB 17:86BB: 29 7F     AND #$7F
bra_86BD:
C - - - - 0x0206CD 17:86BD: DD C8 86  CMP tbl_86C8,X
C - - - - 0x0206D0 17:86C0: F0 05     BEQ bra_86C7_выход
C - - - - 0x0206D2 17:86C2: E8        INX
C - - - - 0x0206D3 17:86C3: E0 04     CPX #$04
C - - - - 0x0206D5 17:86C5: D0 F6     BNE bra_86BD
bra_86C7_выход:
C - - - - 0x0206D7 17:86C7: 60        RTS

tbl_86C8:
    .byte $08
    .byte $0A
    .byte $10
    .byte $1F

ofs_86CC_49_C9_спешал_перепасовка:
C - J - - 0x0206DC 17:86CC: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0206DF 17:86CF: 20 07 82  JSR sub_8207_узнать_номер_игрока___X_00
C - - - - 0x0206E2 17:86D2: A2 00     LDX #$00
bra_86D4_цикл_поиска:
C - - - - 0x0206E4 17:86D4: DD E3 86  CMP tbl_86E3_игроки_со_спешал_перепасовкой,X
C - - - - 0x0206E7 17:86D7: F0 05     BEQ bra_86DE_игрок_найден
C - - - - 0x0206E9 17:86D9: E8        INX
C - - - - 0x0206EA 17:86DA: E0 11     CPX #$11
C - - - - 0x0206EC 17:86DC: D0 F6     BNE bra_86D4_цикл_поиска
bra_86DE_игрок_найден:
C - - - - 0x0206EE 17:86DE: E0 11     CPX #$11
C - - - - 0x0206F0 17:86E0: 4C 11 82  JMP loc_8211

tbl_86E3_игроки_со_спешал_перепасовкой:
- D - - - 0x0206F3 17:86E3: 01        .byte $01        ; tsubasa
- D - - - 0x0206F4 17:86E4: 11        .byte $11        ; misaki
- D - - - 0x0206F5 17:86E5: 1A        .byte $1A        ; hyuga
- D - - - 0x0206F6 17:86E6: 41        .byte $41        ; hyuga
- D - - - 0x0206F7 17:86E7: 36        .byte $36        ; hyuga
- D - - - 0x0206F8 17:86E8: 1F        .byte $1F        ; sawada
- D - - - 0x0206F9 17:86E9: 38        .byte $38        ; sawada
- D - - - 0x0206FA 17:86EA: 17        .byte $17        ; masao
- D - - - 0x0206FB 17:86EB: 18        .byte $18        ; kazuo
- D - - - 0x0206FC 17:86EC: 46        .byte $46        ; masao
- D - - - 0x0206FD 17:86ED: 47        .byte $47        ; kazuo
- D - - - 0x0206FE 17:86EE: 30        .byte $30        ; masao
- D - - - 0x0206FF 17:86EF: 31        .byte $31        ; kazuo
- D - - - 0x020700 17:86F0: 60        .byte $60        ; diaz
- D - - - 0x020701 17:86F1: 5E        .byte $5E        ; pascal
- D - - - 0x020702 17:86F2: 58        .byte $58        ; pierre
- D - - - 0x020703 17:86F3: 57        .byte $57        ; napoleon

tbl_86F4_игроки_с_рожами:
- D - - - 0x020704 17:86F4: 00        .byte $00        ; 00
- D - - - 0x020705 17:86F5: 01        .byte $01        ; tsubasa
- D - - - 0x020706 17:86F6: 00        .byte $00        ; 02
- D - - - 0x020707 17:86F7: 00        .byte $00        ; 03
- D - - - 0x020708 17:86F8: 00        .byte $00        ; 04
- D - - - 0x020709 17:86F9: 00        .byte $00        ; 05
- D - - - 0x02070A 17:86FA: 00        .byte $00        ; 06
- D - - - 0x02070B 17:86FB: 00        .byte $00        ; 07
- D - - - 0x02070C 17:86FC: 00        .byte $00        ; 08
- D - - - 0x02070D 17:86FD: 00        .byte $00        ; 09
- D - - - 0x02070E 17:86FE: 00        .byte $00        ; 0A
- D - - - 0x02070F 17:86FF: 00        .byte $00        ; 0B
- D - - - 0x020710 17:8700: 00        .byte $00        ; 0C
- D - - - 0x020711 17:8701: 00        .byte $00        ; 0D
- D - - - 0x020712 17:8702: 00        .byte $00        ; 0E
- D - - - 0x020713 17:8703: 00        .byte $00        ; 0F
- D - - - 0x020714 17:8704: 00        .byte $00        ; 10
- D - - - 0x020715 17:8705: 02        .byte $02        ; misaki
- D - - - 0x020716 17:8706: 00        .byte $00        ; 12
- D - - - 0x020717 17:8707: 00        .byte $00        ; 13
- D - - - 0x020718 17:8708: 0A        .byte $0A        ; ishizaki
- D - - - 0x020719 17:8709: 12        .byte $12        ; nitta
- D - - - 0x02071A 17:870A: 00        .byte $00        ; 16
- D - - - 0x02071B 17:870B: 10        .byte $10        ; masao
- D - - - 0x02071C 17:870C: 10        .byte $10        ; kazuo
- D - - - 0x02071D 17:870D: 00        .byte $00        ; 19
- D - - - 0x02071E 17:870E: 04        .byte $04        ; hyuga
- D - - - 0x02071F 17:870F: 0C        .byte $0C        ; souda
- D - - - 0x020720 17:8710: 0E        .byte $0E        ; jitou
- D - - - 0x020721 17:8711: 08        .byte $08        ; matsuyama
- - - - - 0x020722 17:8712: 00        .byte $00        ; 1E
- - - - - 0x020723 17:8713: 14        .byte $14        ; sawada
- D - - - 0x020724 17:8714: 06        .byte $06        ; misugi
- D - - - 0x020725 17:8715: 00        .byte $00        ; 21
- D - - - 0x020726 17:8716: 00        .byte $00        ; 22
- D - - - 0x020727 17:8717: 00        .byte $00        ; 23
- D - - - 0x020728 17:8718: 00        .byte $00        ; 24
- D - - - 0x020729 17:8719: 00        .byte $00        ; 25
- D - - - 0x02072A 17:871A: 00        .byte $00        ; 26
- D - - - 0x02072B 17:871B: 00        .byte $00        ; 27
- D - - - 0x02072C 17:871C: 00        .byte $00        ; 28
- D - - - 0x02072D 17:871D: 00        .byte $00        ; 29
- D - - - 0x02072E 17:871E: 00        .byte $00        ; 2A
- D - - - 0x02072F 17:871F: 17        .byte $17        ; carlos
- D - - - 0x020730 17:8720: 00        .byte $00        ; 2C
- - - - - 0x020731 17:8721: 00        .byte $00        ; 2D
- D - - - 0x020732 17:8722: 0F        .byte $0F        ; jitou
- D - - - 0x020733 17:8723: 00        .byte $00        ; 2F
- D - - - 0x020734 17:8724: 11        .byte $11        ; masao
- D - - - 0x020735 17:8725: 11        .byte $11        ; kazuo
- D - - - 0x020736 17:8726: 0D        .byte $0D        ; souda
- - - - - 0x020737 17:8727: 00        .byte $00        ; 33
- D - - - 0x020738 17:8728: 07        .byte $07        ; misugi
- D - - - 0x020739 17:8729: 09        .byte $09        ; matsuyama
- D - - - 0x02073A 17:872A: 05        .byte $05        ; hyuga
- - - - - 0x02073B 17:872B: 00        .byte $00        ; 37
- - - - - 0x02073C 17:872C: 15        .byte $15        ; sawada
- - - - - 0x02073D 17:872D: 00        .byte $00        ; 39
- D - - - 0x02073E 17:872E: 00        .byte $00        ; 3A
- D - - - 0x02073F 17:872F: 20        .byte $20        ; victorino
- D - - - 0x020740 17:8730: 00        .byte $00        ; 3C
- D - - - 0x020741 17:8731: 00        .byte $00        ; 3D
- D - - - 0x020742 17:8732: 1A        .byte $1A        ; kaltz
- D - - - 0x020743 17:8733: 00        .byte $00        ; 3F
- - - - - 0x020744 17:8734: 00        .byte $00        ; 40
- D - - - 0x020745 17:8735: 04        .byte $04        ; hyuga
- - - - - 0x020746 17:8736: 13        .byte $13        ; nitta
- - - - - 0x020747 17:8737: 00        .byte $00        ; 43
- D - - - 0x020748 17:8738: 03        .byte $03        ; misaki
- - - - - 0x020749 17:8739: 06        .byte $06        ; misugi
- D - - - 0x02074A 17:873A: 10        .byte $10        ; masao
- D - - - 0x02074B 17:873B: 10        .byte $10        ; kazuo
- D - - - 0x02074C 17:873C: 0E        .byte $0E        ; jitou
- D - - - 0x02074D 17:873D: 0B        .byte $0B        ; ishizaki
- - - - - 0x02074E 17:873E: 0C        .byte $0C        ; souda
- D - - - 0x02074F 17:873F: 08        .byte $08        ; matsuyama
- - - - - 0x020750 17:8740: 00        .byte $00        ; 4C
- D - - - 0x020751 17:8741: 00        .byte $00        ; 4D
- D - - - 0x020752 17:8742: 00        .byte $00        ; 4E
- D - - - 0x020753 17:8743: 00        .byte $00        ; 4F
- D - - - 0x020754 17:8744: 00        .byte $00        ; 50
- D - - - 0x020755 17:8745: 00        .byte $00        ; 51
- - - - - 0x020756 17:8746: 00        .byte $00        ; 52
- D - - - 0x020757 17:8747: 00        .byte $00        ; 53
- D - - - 0x020758 17:8748: 00        .byte $00        ; 54
- D - - - 0x020759 17:8749: 00        .byte $00        ; 55
- - - - - 0x02075A 17:874A: 00        .byte $00        ; 56
- D - - - 0x02075B 17:874B: 1F        .byte $1F        ; napoleon
- D - - - 0x02075C 17:874C: 1E        .byte $1E        ; pierre
- D - - - 0x02075D 17:874D: 00        .byte $00        ; 59
- D - - - 0x02075E 17:874E: 00        .byte $00        ; 5A
- D - - - 0x02075F 17:874F: 00        .byte $00        ; 5B
- D - - - 0x020760 17:8750: 00        .byte $00        ; 5C
- D - - - 0x020761 17:8751: 00        .byte $00        ; 5D
- D - - - 0x020762 17:8752: 1D        .byte $1D        ; pascal
- D - - - 0x020763 17:8753: 00        .byte $00        ; 5F
- D - - - 0x020764 17:8754: 1C        .byte $1C        ; diaz
- D - - - 0x020765 17:8755: 00        .byte $00        ; 61
- D - - - 0x020766 17:8756: 00        .byte $00        ; 62
- D - - - 0x020767 17:8757: 19        .byte $19        ; schneider
- D - - - 0x020768 17:8758: 00        .byte $00        ; 64
- D - - - 0x020769 17:8759: 21        .byte $21        ; kaltz
- - - - - 0x02076A 17:875A: 00        .byte $00        ; 66
- D - - - 0x02076B 17:875B: 1B        .byte $1B        ; schester
- D - - - 0x02076C 17:875C: 00        .byte $00        ; 68
- - - - - 0x02076D 17:875D: 00        .byte $00        ; 69
- D - - - 0x02076E 17:875E: 18        .byte $18        ; carlos
- D - - - 0x02076F 17:875F: 00        .byte $00        ; 6B
- - - - - 0x020770 17:8760: 00        .byte $00        ; 6C
- D - - - 0x020771 17:8761: 00        .byte $00        ; 6D
- D - - - 0x020772 17:8762: 00        .byte $00        ; 6E
- - - - - 0x020773 17:8763: 00        .byte $00        ; 6F
- - - - - 0x020774 17:8764: 00        .byte $00        ; 70
- D - - - 0x020775 17:8765: 00        .byte $00        ; 71
- - - - - 0x020776 17:8766: 00        .byte $00        ; 72
- - - - - 0x020777 17:8767: 00        .byte $00        ; 73
- - - - - 0x020778 17:8768: 00        .byte $00        ; 74
- D - - - 0x020779 17:8769: 16        .byte $16        ; coimbra

tbl_876A_игроки_с_защитным_спешалом:
- D - - - 0x02077A 17:876A: 00        .byte $00        ; 00
- - - - - 0x02077B 17:876B: 00        .byte $00        ; 01
- - - - - 0x02077C 17:876C: 00        .byte $00        ; 02
- - - - - 0x02077D 17:876D: 00        .byte $00        ; 03
- - - - - 0x02077E 17:876E: 00        .byte $00        ; 04
- - - - - 0x02077F 17:876F: 00        .byte $00        ; 05
- - - - - 0x020780 17:8770: 00        .byte $00        ; 06
- - - - - 0x020781 17:8771: 00        .byte $00        ; 07
- - - - - 0x020782 17:8772: 00        .byte $00        ; 08
- - - - - 0x020783 17:8773: 00        .byte $00        ; 09
- - - - - 0x020784 17:8774: 00        .byte $00        ; 0A
- - - - - 0x020785 17:8775: 00        .byte $00        ; 0B
- - - - - 0x020786 17:8776: 00        .byte $00        ; 0C
- - - - - 0x020787 17:8777: 00        .byte $00        ; 0D
- - - - - 0x020788 17:8778: 00        .byte $00        ; 0E
- - - - - 0x020789 17:8779: 00        .byte $00        ; 0F
- - - - - 0x02078A 17:877A: 00        .byte $00        ; 10
- - - - - 0x02078B 17:877B: 00        .byte $00        ; 11
- - - - - 0x02078C 17:877C: 00        .byte $00        ; 12
- - - - - 0x02078D 17:877D: 00        .byte $00        ; 13
- D - - - 0x02078E 17:877E: 0E        .byte $0E        ; ishizaki
- - - - - 0x02078F 17:877F: 00        .byte $00        ; 15
- - - - - 0x020790 17:8780: 00        .byte $00        ; 16
- D - - - 0x020791 17:8781: 01        .byte $01        ; masao
- D - - - 0x020792 17:8782: 01        .byte $01        ; kazuo
- - - - - 0x020793 17:8783: 00        .byte $00        ; 19
- D - - - 0x020794 17:8784: 0C        .byte $0C        ; hyuga
- D - - - 0x020795 17:8785: 03        .byte $03        ; souda
- D - - - 0x020796 17:8786: 05        .byte $05        ; jitou
- - - - - 0x020797 17:8787: 00        .byte $00        ; 1D
- - - - - 0x020798 17:8788: 00        .byte $00        ; 1E
- - - - - 0x020799 17:8789: 00        .byte $00        ; 1F
- - - - - 0x02079A 17:878A: 00        .byte $00        ; 20
- - - - - 0x02079B 17:878B: 00        .byte $00        ; 21
- - - - - 0x02079C 17:878C: 00        .byte $00        ; 22
- - - - - 0x02079D 17:878D: 00        .byte $00        ; 23
- - - - - 0x02079E 17:878E: 00        .byte $00        ; 24
- - - - - 0x02079F 17:878F: 00        .byte $00        ; 25
- - - - - 0x0207A0 17:8790: 00        .byte $00        ; 26
- - - - - 0x0207A1 17:8791: 00        .byte $00        ; 27
- - - - - 0x0207A2 17:8792: 00        .byte $00        ; 28
- - - - - 0x0207A3 17:8793: 00        .byte $00        ; 29
- D - - - 0x0207A4 17:8794: 07        .byte $07        ; dirceu
- - - - - 0x0207A5 17:8795: 00        .byte $00        ; 2B
- - - - - 0x0207A6 17:8796: 00        .byte $00        ; 2C
- - - - - 0x0207A7 17:8797: 00        .byte $00        ; 2D
- D - - - 0x0207A8 17:8798: 06        .byte $06        ; jitou
- - - - - 0x0207A9 17:8799: 00        .byte $00        ; 2F
- D - - - 0x0207AA 17:879A: 02        .byte $02        ; masao
- - - - - 0x0207AB 17:879B: 02        .byte $02        ; kazuo
- D - - - 0x0207AC 17:879C: 04        .byte $04        ; souda
- - - - - 0x0207AD 17:879D: 00        .byte $00        ; 33
- - - - - 0x0207AE 17:879E: 00        .byte $00        ; 34
- - - - - 0x0207AF 17:879F: 00        .byte $00        ; 35
- D - - - 0x0207B0 17:87A0: 0D        .byte $0D        ; hyuga
- - - - - 0x0207B1 17:87A1: 00        .byte $00        ; 37
- - - - - 0x0207B2 17:87A2: 00        .byte $00        ; 38
- - - - - 0x0207B3 17:87A3: 00        .byte $00        ; 39
- - - - - 0x0207B4 17:87A4: 00        .byte $00        ; 3A
- - - - - 0x0207B5 17:87A5: 00        .byte $00        ; 3B
- - - - - 0x0207B6 17:87A6: 00        .byte $00        ; 3C
- - - - - 0x0207B7 17:87A7: 00        .byte $00        ; 3D
- - - - - 0x0207B8 17:87A8: 00        .byte $00        ; 3E
- - - - - 0x0207B9 17:87A9: 00        .byte $00        ; 3F
- - - - - 0x0207BA 17:87AA: 00        .byte $00        ; 40
- D - - - 0x0207BB 17:87AB: 0C        .byte $0C        ; hyuga
- - - - - 0x0207BC 17:87AC: 00        .byte $00        ; 42
- - - - - 0x0207BD 17:87AD: 00        .byte $00        ; 43
- - - - - 0x0207BE 17:87AE: 00        .byte $00        ; 44
- - - - - 0x0207BF 17:87AF: 00        .byte $00        ; 45
- - - - - 0x0207C0 17:87B0: 01        .byte $01        ; masao
- - - - - 0x0207C1 17:87B1: 01        .byte $01        ; kazuo
- D - - - 0x0207C2 17:87B2: 05        .byte $05        ; jitou
- D - - - 0x0207C3 17:87B3: 0F        .byte $0F        ; ishizaki
- D - - - 0x0207C4 17:87B4: 03        .byte $03        ; souda
- - - - - 0x0207C5 17:87B5: 00        .byte $00        ; 4B
- - - - - 0x0207C6 17:87B6: 00        .byte $00        ; 4C
- - - - - 0x0207C7 17:87B7: 00        .byte $00        ; 4D
- - - - - 0x0207C8 17:87B8: 00        .byte $00        ; 4E
- D - - - 0x0207C9 17:87B9: 00        .byte $00        ; 4F
- D - - - 0x0207CA 17:87BA: 00        .byte $00        ; 50
- - - - - 0x0207CB 17:87BB: 00        .byte $00        ; 51
- - - - - 0x0207CC 17:87BC: 00        .byte $00        ; 52
- - - - - 0x0207CD 17:87BD: 00        .byte $00        ; 53
- - - - - 0x0207CE 17:87BE: 09        .byte $09        ; robson
- - - - - 0x0207CF 17:87BF: 00        .byte $00        ; 55
- - - - - 0x0207D0 17:87C0: 00        .byte $00        ; 56
- - - - - 0x0207D1 17:87C1: 00        .byte $00        ; 57
- - - - - 0x0207D2 17:87C2: 00        .byte $00        ; 58
- - - - - 0x0207D3 17:87C3: 00        .byte $00        ; 59
- - - - - 0x0207D4 17:87C4: 00        .byte $00        ; 5A
- - - - - 0x0207D5 17:87C5: 00        .byte $00        ; 5B
- - - - - 0x0207D6 17:87C6: 00        .byte $00        ; 5C
- D - - - 0x0207D7 17:87C7: 0A        .byte $0A        ; libuta
- - - - - 0x0207D8 17:87C8: 00        .byte $00        ; 5E
- - - - - 0x0207D9 17:87C9: 00        .byte $00        ; 5F
- - - - - 0x0207DA 17:87CA: 00        .byte $00        ; 60
- - - - - 0x0207DB 17:87CB: 00        .byte $00        ; 61
- D - - - 0x0207DC 17:87CC: 0B        .byte $0B        ; galvan
- - - - - 0x0207DD 17:87CD: 00        .byte $00        ; 63
- - - - - 0x0207DE 17:87CE: 00        .byte $00        ; 64
- - - - - 0x0207DF 17:87CF: 00        .byte $00        ; 65
- - - - - 0x0207E0 17:87D0: 00        .byte $00        ; 66
- - - - - 0x0207E1 17:87D1: 00        .byte $00        ; 67
- - - - - 0x0207E2 17:87D2: 00        .byte $00        ; 68
- - - - - 0x0207E3 17:87D3: 00        .byte $00        ; 69
- - - - - 0x0207E4 17:87D4: 00        .byte $00        ; 6A
- - - - - 0x0207E5 17:87D5: 00        .byte $00        ; 6B
- - - - - 0x0207E6 17:87D6: 00        .byte $00        ; 6C
- - - - - 0x0207E7 17:87D7: 00        .byte $00        ; 6D
- - - - - 0x0207E8 17:87D8: 00        .byte $00        ; 6E
- - - - - 0x0207E9 17:87D9: 00        .byte $00        ; 6F
- - - - - 0x0207EA 17:87DA: 00        .byte $00        ; 70
- - - - - 0x0207EB 17:87DB: 00        .byte $00        ; 71
- D - - - 0x0207EC 17:87DC: 08        .byte $08        ; dirceu
- - - - - 0x0207ED 17:87DD: 00        .byte $00        ; 73
- - - - - 0x0207EE 17:87DE: 00        .byte $00        ; 74
- - - - - 0x0207EF 17:87DF: 00        .byte $00        ; 75

ofs_87E0_F4_mirror_on:
; без чтения следующих байтов
C - J - - 0x0207F0 17:87E0: A9 40     LDA #$40
C - - - - 0x0207F2 17:87E2: 8D 2A 05  STA ram_флаг_зеркала_анимации
C - - - - 0x0207F5 17:87E5: 60        RTS

ofs_87E6_F5_mirror_off:
; без чтения следующих байтов
C - J - - 0x0207F6 17:87E6: A9 00     LDA #$00
C - - - - 0x0207F8 17:87E8: 8D 2A 05  STA ram_флаг_зеркала_анимации
C - - - - 0x0207FB 17:87EB: 60        RTS

ofs_87EC_F6_mirror_toggle:
; без чтения следующих байтов
C - J - - 0x0207FC 17:87EC: A9 40     LDA #$40
C - - - - 0x0207FE 17:87EE: 4D 2A 05  EOR ram_флаг_зеркала_анимации
C - - - - 0x020801 17:87F1: 8D 2A 05  STA ram_флаг_зеркала_анимации
C - - - - 0x020804 17:87F4: 60        RTS

ofs_87F5_F7:
; читает 1 следующий байт
C - J - - 0x020805 17:87F5: A4 3A     LDY ram_003A
C - - - - 0x020807 17:87F7: E6 3A     INC ram_003A
C - - - - 0x020809 17:87F9: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x02080B 17:87FB: 8D 2B 05  STA $052B
C - - - - 0x02080E 17:87FE: 60        RTS

ofs_87FF_F8:
; читает 1 следующий байт
C - J - - 0x02080F 17:87FF: A4 3A     LDY ram_003A
C - - - - 0x020811 17:8801: E6 3A     INC ram_003A
C - - - - 0x020813 17:8803: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020815 17:8805: 8D 2C 05  STA $052C
C - - - - 0x020818 17:8808: 60        RTS

ofs_8809_F9_soundID_delay:
; читает 2 следующих байта
C - J - - 0x020819 17:8809: A4 3A     LDY ram_003A
C - - - - 0x02081B 17:880B: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x02081D 17:880D: 8D 30 05  STA ram_для_052F_звук_анимации
C - - - - 0x020820 17:8810: C8        INY
C - - - - 0x020821 17:8811: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020823 17:8813: 8D 31 05  STA ram_для_052E_задержка_звука_анимации
C - - - - 0x020826 17:8816: C8        INY
C - - - - 0x020827 17:8817: 84 3A     STY ram_003A
C - - - - 0x020829 17:8819: 60        RTS

ofs_881A_FA_jsr:
; читает 2 следующих байта
; прыжок с возвратом во внутренний сценарий
C - J - - 0x02082A 17:881A: AE 22 05  LDX ram_указатель_стека_сценария
C - - - - 0x02082D 17:881D: A5 3A     LDA ram_003A
C - - - - 0x02082F 17:881F: A8        TAY
C - - - - 0x020830 17:8820: 18        CLC
C - - - - 0x020831 17:8821: 69 02     ADC #$02
C - - - - 0x020833 17:8823: 65 5D     ADC ram_сценарий_data
C - - - - 0x020835 17:8825: 9D 1A 05  STA ram_стек_сценария_lo,X
C - - - - 0x020838 17:8828: A5 5E     LDA ram_сценарий_data + 1
C - - - - 0x02083A 17:882A: 69 00     ADC #$00
C - - - - 0x02083C 17:882C: 9D 1B 05  STA ram_стек_сценария_hi,X
C - - - - 0x02083F 17:882F: E8        INX
C - - - - 0x020840 17:8830: E8        INX
C - - - - 0x020841 17:8831: 8E 22 05  STX ram_указатель_стека_сценария
C - - - - 0x020844 17:8834: 4C F6 80  JMP loc_80F6_подпрограмма_сценария

ofs_8837_FB_rts:
; возврат из sub сценария
; без чтения следующих байтов
C - J - - 0x020847 17:8837: AE 22 05  LDX ram_указатель_стека_сценария
C - - - - 0x02084A 17:883A: CA        DEX
C - - - - 0x02084B 17:883B: CA        DEX
C - - - - 0x02084C 17:883C: 8E 22 05  STX ram_указатель_стека_сценария
C - - - - 0x02084F 17:883F: 10 03     BPL bra_8844
C - - - - 0x020851 17:8841: 4C CF 80  JMP loc_80CF_возврат_из_стека_сценария
bra_8844:
C - - - - 0x020854 17:8844: BD 1A 05  LDA ram_стек_сценария_lo,X
C - - - - 0x020857 17:8847: 85 5D     STA ram_сценарий_data
C - - - - 0x020859 17:8849: BD 1B 05  LDA ram_стек_сценария_hi,X
C - - - - 0x02085C 17:884C: 85 5E     STA ram_сценарий_data + 1
C - - - - 0x02085E 17:884E: A9 00     LDA #$00
C - - - - 0x020860 17:8850: 85 3A     STA ram_003A
C - - - - 0x020862 17:8852: 60        RTS

ofs_8853_FC_moving_bg:
; читает 1 следующий байт
; что-то связанное с движущимся фоном во время подката
C - J - - 0x020863 17:8853: A4 3A     LDY ram_003A
C - - - - 0x020865 17:8855: E6 3A     INC ram_003A
C - - - - 0x020867 17:8857: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020869 17:8859: 8D 2D 05  STA $052D
C - - - - 0x02086C 17:885C: 60        RTS

ofs_885D_FD_mirror_condition:
; читает 1 следующий байт
C - J - - 0x02086D 17:885D: A4 3A     LDY ram_003A
C - - - - 0x02086F 17:885F: E6 3A     INC ram_003A
C - - - - 0x020871 17:8861: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020873 17:8863: 20 6A 88  JSR sub_886A_подпрограмма
C - - - - 0x020876 17:8866: 8E 2A 05  STX ram_флаг_зеркала_анимации
C - - - - 0x020879 17:8869: 60        RTS

sub_886A_подпрограмма:
C - - - - 0x02087A 17:886A: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x02087D 17:886D: 77 88     .word ofs_8877_00_координаты_игрока
- D - I - 0x02087F 17:886F: AA 88     .word ofs_88AA_01_номер_защитника
- D - I - 0x020881 17:8871: B5 88     .word ofs_88B5_02_команда
- D - I - 0x020883 17:8873: BF 88     .word ofs_88BF_03_сторона_полета_мяча
- D - I - 0x020885 17:8875: D9 88     .word ofs_88D9_04

ofs_8877_00_координаты_игрока:
C - J - - 0x020887 17:8877: A9 00     LDA #$00
C - - - - 0x020889 17:8879: 85 3B     STA ram_003B
C - - - - 0x02088B 17:887B: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x02088E 17:887E: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x020891 17:8881: AD 38 06  LDA $0638
C - - - - 0x020894 17:8884: 20 36 C5  JSR sub_0x03CDD9_проверить_координаты_игрока
C - - - - 0x020897 17:8887: 98        TYA
C - - - - 0x020898 17:8888: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x02089A 17:888A: 38        SEC
C - - - - 0x02089B 17:888B: F1 34     SBC (ram_plr_data),Y
C - - - - 0x02089D 17:888D: B0 02     BCS bra_8891
C - - - - 0x02089F 17:888F: E6 3B     INC ram_003B
bra_8891:
C - - - - 0x0208A1 17:8891: 8A        TXA
C - - - - 0x0208A2 17:8892: A0 06     LDY #con_игрок_координата_X_hi
C - - - - 0x0208A4 17:8894: 38        SEC
C - - - - 0x0208A5 17:8895: F1 34     SBC (ram_plr_data),Y
C - - - - 0x0208A7 17:8897: B0 04     BCS bra_889D
C - - - - 0x0208A9 17:8899: E6 3B     INC ram_003B
C - - - - 0x0208AB 17:889B: E6 3B     INC ram_003B
bra_889D:
C - - - - 0x0208AD 17:889D: A2 40     LDX #$40
C - - - - 0x0208AF 17:889F: A5 3B     LDA ram_003B
C - - - - 0x0208B1 17:88A1: F0 06     BEQ bra_88A9_выход
C - - - - 0x0208B3 17:88A3: C9 03     CMP #$03
C - - - - 0x0208B5 17:88A5: F0 02     BEQ bra_88A9_выход
C - - - - 0x0208B7 17:88A7: A2 00     LDX #$00
bra_88A9_выход:
C - - - - 0x0208B9 17:88A9: 60        RTS

ofs_88AA_01_номер_защитника:
C - J - - 0x0208BA 17:88AA: A2 00     LDX #$00
C - - - - 0x0208BC 17:88AC: AD 16 06  LDA ram_номер_защитника
C - - - - 0x0208BF 17:88AF: 4A        LSR
C - - - - 0x0208C0 17:88B0: 90 02     BCC bra_88B4_выход
C - - - - 0x0208C2 17:88B2: A2 40     LDX #$40
bra_88B4_выход:
C - - - - 0x0208C4 17:88B4: 60        RTS

ofs_88B5_02_команда:
C - J - - 0x0208C5 17:88B5: A2 00     LDX #$00
C - - - - 0x0208C7 17:88B7: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x0208CA 17:88BA: F0 02     BEQ bra_88BE_выход
C - - - - 0x0208CC 17:88BC: A2 40     LDX #$40
bra_88BE_выход:
C - - - - 0x0208CE 17:88BE: 60        RTS

ofs_88BF_03_сторона_полета_мяча:
C - J - - 0x0208CF 17:88BF: AD 41 04  LDA ram_игрок_с_мячом
C - - - - 0x0208D2 17:88C2: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x0208D5 17:88C5: A0 08     LDY #con_игрок_координата_Y_hi
C - - - - 0x0208D7 17:88C7: B1 34     LDA (ram_plr_data),Y
C - - - - 0x0208D9 17:88C9: AE FB 05  LDX ram_команда_с_мячом
C - - - - 0x0208DC 17:88CC: F0 02     BEQ bra_88D0
C - - - - 0x0208DE 17:88CE: 49 FF     EOR #$FF
bra_88D0:
C - - - - 0x0208E0 17:88D0: A2 00     LDX #$00
C - - - - 0x0208E2 17:88D2: C9 80     CMP #$80
C - - - - 0x0208E4 17:88D4: B0 02     BCS bra_88D8_выход
C - - - - 0x0208E6 17:88D6: A2 40     LDX #$40
bra_88D8_выход:
C - - - - 0x0208E8 17:88D8: 60        RTS

ofs_88D9_04:
C - J - - 0x0208E9 17:88D9: A2 00     LDX #$00
C - - - - 0x0208EB 17:88DB: 2C 2C 06  BIT $062C
C - - - - 0x0208EE 17:88DE: 10 02     BPL bra_88E2_выход
C - - - - 0x0208F0 17:88E0: A2 40     LDX #$40
bra_88E2_выход:
C - - - - 0x0208F2 17:88E2: 60        RTS

ofs_88E3_FE:
; без чтения следующих байтов
                                      LDA #$01
C - - - - 0x0208F9 17:88E9: 8D 39 05  STA $0539
C - - - - 0x0208FC 17:88EC: 60        RTS

ofs_88ED_FF_drive_overhead_tiger:
; читает 1 следующий байт
C - J - - 0x0208FD 17:88ED: A4 3A     LDY ram_003A
C - - - - 0x0208FF 17:88EF: B1 5D     LDA (ram_сценарий_data),Y
C - - - - 0x020901 17:88F1: 20 09 C5  JSR sub_0x03CBA9_байты_после_JSR_для_непрямого_прыжка
- D - I - 0x020906 17:88F6: 0D 89     .word ofs_890D_00_драйв_оверхед
- D - I - 0x02090A 17:88FA: 42 89     .word ofs_8942_01_активация_драйв_тигра

ofs_890D_00_драйв_оверхед:
; X 00-03
C - J - - 0x02091D 17:890D: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020920 17:8910: D0 26     BNE bra_8938
C - - - - 0x020922 17:8912: AD 2B 00  LDA ram_команда_соперника
C - - - - 0x020925 17:8915: C9 05     CMP #$05
C - - - - 0x020927 17:8917: D0 1F     BNE bra_8938
C - - - - 0x020929 17:8919: AE 46 04  LDX ram_флаг_драйв_оверхеда
C - - - - 0x02092C 17:891C: F0 1C     BEQ bra_893A
C - - - - 0x02092E 17:891E: A2 01     LDX #$01
C - - - - 0x020930 17:8920: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x020933 17:8923: C9 03     CMP #$03
C - - - - 0x020935 17:8925: F0 13     BEQ bra_893A
C - - - - 0x020937 17:8927: AE 46 04  LDX ram_флаг_драйв_оверхеда
C - - - - 0x02093A 17:892A: E0 04     CPX #$04
C - - - - 0x02093C 17:892C: B0 0A     BCS bra_8938
C - - - - 0x02093E 17:892E: AD 3C 04  LDA ram_подтип_действия_атаки
C - - - - 0x020941 17:8931: F0 05     BEQ bra_8938
C - - - - 0x020943 17:8933: EE 46 04  INC ram_флаг_драйв_оверхеда
C - - - - 0x020946 17:8936: D0 02     BNE bra_893A
bra_8938:
C - - - - 0x020948 17:8938: A2 00     LDX #$00
bra_893A:
C - - - - 0x02094A 17:893A: 4C 2F 81  JMP loc_812F_выбрать_подпрограмму

ofs_8942_01_активация_драйв_тигра:
; X 00-01, встречается всего 1 раз
C - J - - 0x020952 17:8942: A2 00     LDX #$00
C - - - - 0x020954 17:8944: AD FB 05  LDA ram_команда_с_мячом
C - - - - 0x020957 17:8947: D0 45     BNE bra_898E_выход
C - - - - 0x020959 17:8949: A9 01     LDA #$01
bra_894B_поиск_хюги_в_команде:
C - - - - 0x02095B 17:894B: 48        PHA
C - - - - 0x02095C 17:894C: 20 0C C5  JSR sub_0x03CD8C_адрес_игрока
C - - - - 0x02095F 17:894F: A0 00     LDY #con_игрок_номер
C - - - - 0x020961 17:8951: B1 34     LDA (ram_plr_data),Y
C - - - - 0x020963 17:8953: A8        TAY
C - - - - 0x020964 17:8954: A2 00     LDX #$00
C - - - - 0x020966 17:8956: 68        PLA
C - - - - 0x020967 17:8957: C0 1A     CPY #$1A      ; проверка на хюгу
C - - - - 0x020969 17:8959: F0 09     BEQ bra_8964_hyuga_найден
C - - - - 0x02096B 17:895B: 18        CLC
C - - - - 0x02096C 17:895C: 69 01     ADC #$01
C - - - - 0x02096E 17:895E: C9 0B     CMP #$0B
C - - - - 0x020970 17:8960: D0 E9     BNE bra_894B_поиск_хюги_в_команде
C - - - - 0x020972 17:8962: F0 2A     BEQ bra_898E_выход
bra_8964_hyuga_найден:
C - - - - 0x020974 17:8964: AD 3C 04  LDA ram_подтип_действия_атаки
; проверка на то, что удар яляется спешалом, а не обычным
C - - - - 0x020977 17:8967: C9 03     CMP #$03
C - - - - 0x020979 17:8969: 90 23     BCC bra_898E_выход
C - - - - 0x02097B 17:896B: 2C 49 04  BIT ram_флаг_драйв_тигра
C - - - - 0x02097E 17:896E: 30 1E     BMI bra_898E_выход
C - - - - 0x020980 17:8970: EE 49 04  INC ram_флаг_драйв_тигра
C - - - - 0x020983 17:8973: AD 49 04  LDA ram_флаг_драйв_тигра
; нужно как минимум 2 спешала для активации
C - - - - 0x020986 17:8976: C9 02     CMP #$02
C - - - - 0x020988 17:8978: D0 14     BNE bra_898E_выход
C - - - - 0x02098A 17:897A: A9 00     LDA #$00
C - - - - 0x02098C 17:897C: AC E2 00  LDY ram_рандом_2
; шанс злого цубасы
C - - - - 0x02098F 17:897F: C0 20     CPY #$20
C - - - - 0x020991 17:8981: B0 08     BCS bra_898B_не_активировать_спешал
C - - - - 0x020993 17:8983: A9 1E     LDA #$1E
C - - - - 0x020995 17:8985: 8D 4A 04  STA ram_таймер_драйв_тигра
C - - - - 0x020998 17:8988: A9 80     LDA #$80
C - - - - 0x02099A 17:898A: E8        INX
bra_898B_не_активировать_спешал:
C - - - - 0x02099B 17:898B: 8D 49 04  STA ram_флаг_драйв_тигра
bra_898E_выход:
C - - - - 0x02099E 17:898E: 4C 2F 81  JMP loc_812F_выбрать_подпрограмму

tbl_89BF_сценарии:
- D - I - 0x0209CF 17:89BF: B1 8A     .word _scenario_8AB1_00       ; сценарий дриблинга или когда игрок прыгает чтоб перехватить мяч
- D - I - 0x0209D1 17:89C1: F2 91     .word _scenario_91F2_01       ; 
- D - I - 0x0209D3 17:89C3: FF 91     .word _scenario_91FF_02       ; 
- - - - - 0x0209D5 17:89C5: 8E B4     .word _scenario_B48E_03       ; 
- D - I - 0x0209D7 17:89C7: CB 9B     .word _scenario_9BCB_04       ; 
- D - I - 0x0209D9 17:89C9: 59 92     .word _scenario_9259_05_10    ; 
- D - I - 0x0209DB 17:89CB: 63 92     .word _scenario_9263_06       ; 
- D - I - 0x0209DD 17:89CD: 85 92     .word _scenario_9285_07       ; 
- D - I - 0x0209DF 17:89CF: 2C 93     .word _scenario_932C_08       ; действие игрока на чужой штрафной
- D - I - 0x0209E1 17:89D1: 69 93     .word _scenario_9369_09       ; конечный полет удара и действие кипера, возможный гол
- D - I - 0x0209E3 17:89D3: 11 98     .word _scenario_9811_0A       ; кипер против игрока на земле
- D - I - 0x0209E5 17:89D5: ED 98     .word _scenario_98ED_0B       ; 
- D - I - 0x0209E7 17:89D7: E3 96     .word _scenario_96E3_0C       ; конечный полет удара в пустые ворота
- D - I - 0x0209E9 17:89D9: F7 96     .word _scenario_96F7_0D       ; игрок автоматически бьет когда обвел кипера
- D - I - 0x0209EB 17:89DB: EA 91     .word _scenario_91EA_0E       ; игрок бежит/прыгает к мячу на штрафной и что-то делает
- D - I - 0x0209ED 17:89DD: 05 92     .word _scenario_9205_0F       ; 
- D - I - 0x0209EF 17:89DF: 59 92     .word _scenario_9259_05_10    ; 
- D - I - 0x0209F1 17:89E1: 69 92     .word _scenario_9269_11       ; 
- D - I - 0x0209F3 17:89E3: 7F 92     .word _scenario_927F_12       ; 
- D - I - 0x0209F5 17:89E5: D3 91     .word _scenario_91D3_13       ; игрок дает пас со своей штрафной
- D - I - 0x0209F7 17:89E7: 82 9B     .word _scenario_9B82_14       ; 
- D - I - 0x0209F9 17:89E9: 0A B8     .word _scenario_B80A_15       ; 
- D - I - 0x0209FB 17:89EB: 17 B8     .word _scenario_B817_16       ; 
- D - I - 0x0209FD 17:89ED: A1 B8     .word _scenario_B8A1_17       ; drive overhead озарение
- D - I - 0x0209FF 17:89EF: 3E 9E     .word _scenario_9E3E_18       ; игрок дает пас с земли
- D - I - 0x020A01 17:89F1: D4 BB     .word _scenario_BBD4_19       ; игрок делает перепасовку
- D - I - 0x020A03 17:89F3: 6D BC     .word _scenario_BC6D_1A       ; мяч летит, прилетел к напарнику и он возвращает перепасовку
- D - I - 0x020A05 17:89F5: 86 B4     .word _scenario_B486_1B       ; мяч летит, и прилетает к основному игроку после перепасовки
- D - I - 0x020A07 17:89F7: E3 9B     .word _scenario_9BE3_1C       ; мяч летит и прилетает к игроку, которому дали пас пас с земли
- D - I - 0x020A09 17:89F9: EE 9C     .word _scenario_9CEE_1D       ; удар с земли (спешал тоже)
- D - I - 0x020A0B 17:89FB: DA B7     .word _scenario_B7DA_1E       ; игрок бежит по полю
- D - I - 0x020A0D 17:89FD: 33 B7     .word _scenario_B733_1F       ; 
- D - I - 0x020A0F 17:89FF: 38 B7     .word _scenario_B738_20       ; ? предположительно штрафной удар с 11м во время матча
- D - I - 0x020A11 17:8A01: 3B BA     .word _scenario_BA3B_21       ; 
- D - I - 0x020A13 17:8A03: 49 B7     .word _scenario_B749_22       ; в пенальти сообщение о бьющем игроке, затем выбор действия игроку/киперу
- D - I - 0x020A15 17:8A05: 3F BB     .word _scenario_BB3F_23       ; в пенальти игрок бьет, затем результат удара и действия кипера
- D - I - 0x020A17 17:8A07: F2 9B     .word _scenario_9BF2_24       ; сообщение corner kick
- D - I - 0x020A19 17:8A09: DD 9C     .word _scenario_9CDD_25       ; сообщение goal kick
- D - I - 0x020A1B 17:8A0B: 2D 9E     .word _scenario_9E2D_26       ; сообщение throw in
- D - I - 0x020A1D 17:8A0D: F8 9B     .word _scenario_9BF8_27       ; 
- D - I - 0x020A1F 17:8A0F: CC B4     .word _scenario_B4CC_28       ; 
- D - I - 0x020A21 17:8A11: FE 9B     .word _scenario_9BFE_29       ; 
- D - I - 0x020A23 17:8A13: E0 B4     .word _scenario_B4E0_2A       ; 
- D - I - 0x020A25 17:8A15: 2C B7     .word _scenario_B72C_2B       ; 
- D - I - 0x020A27 17:8A17: 54 9F     .word _scenario_9F54_2C       ; 
- D - I - 0x020A29 17:8A19: D6 B4     .word _scenario_B4D6_2D       ; 
- D - I - 0x020A2B 17:8A1B: 4E B7     .word _scenario_B74E_2E       ; на игрока напали когда он находится на земле
- D - I - 0x020A2D 17:8A1D: 73 B7     .word _scenario_B773_2F       ; на игрока напали когда он находится на штрафной
- D - I - 0x020A2F 17:8A1F: 30 9C     .word _scenario_9C30_30       ; сообщение после гола
- D - I - 0x020A31 17:8A21: 8C B7     .word _scenario_B78C_31       ; 
- D - I - 0x020A33 17:8A23: 57 9E     .word _scenario_9E57_32       ; 
- D - I - 0x020A35 17:8A25: 04 9C     .word _scenario_9C04_33       ; сообщение о завершении тайма/матча/пк
- D - I - 0x020A37 17:8A27: CC BB     .word _scenario_BBCC_34       ; мяч ударяется об землю когда некому его поднять
- D - I - 0x020A39 17:8A29: CD B7     .word _scenario_B7CD_35       ; ожидание разводки
- D - I - 0x020A3B 17:8A2B: E4 B7     .word _scenario_B7E4_36       ; разводка
- D - I - 0x020A3D 17:8A2D: BF B7     .word _scenario_B7BF_37       ; 
- D - I - 0x020A3F 17:8A2F: C6 B7     .word _scenario_B7C6_38       ; выбор кому дать пас или с кем перепасоваться
- D - I - 0x020A41 17:8A31: B3 BD     .word _scenario_BDB3_39       ; сообщение о том что начались пенальти
- D - I - 0x020A43 17:8A33: 7C B4     .word _scenario_B47C_3A       ; 
- - - - - 0x020A45 17:8A35: A1 BD     .word _scenario_BDA1_3B       ; 
- - - - - 0x020A47 17:8A37: 3E 9F     .word _scenario_9F3E_3C       ; 
- D - I - 0x020A49 17:8A39: BA 9F     .word _scenario_9FBA_3D       ; недостаточно энергии
- D - I - 0x020A4B 17:8A3B: 0A 9C     .word _scenario_9C0A_3E       ; 
- D - I - 0x020A4D 17:8A3D: 54 B7     .word _scenario_B754_3F       ; мяч прилетел к игроку на чью-то штрафную
- D - I - 0x020A4F 17:8A3F: 95 BD     .word _scenario_BD95_40       ; 
- D - I - 0x020A51 17:8A41: 9A BD     .word _scenario_BD9A_41       ; аналогично 44, но предварительно отображается сообщение о балансе кипера
- D - I - 0x020A53 17:8A43: A6 BD     .word _scenario_BDA6_42       ; 
- D - I - 0x020A55 17:8A45: AD BD     .word _scenario_BDAD_43       ; 
- D - I - 0x020A57 17:8A47: D5 B7     .word _scenario_B7D5_44       ; игрок в меню выбора действия, находясь с мячом на земле
- - - - - 0x020A59 17:8A49: B8 BD     .word _scenario_BDB8_45       ; sudden death в пенальти
- D - I - 0x020A5B 17:8A4B: BD BD     .word _scenario_BDBD_46       ; 
- D - I - 0x020A5D 17:8A4D: 19 9C     .word _scenario_9C19_47       ; diaz выебывается после гола
- - - - - 0x020A5F 17:8A4F: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A61 17:8A51: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A63 17:8A53: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A65 17:8A55: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A67 17:8A57: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A69 17:8A59: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A6B 17:8A5B: 01 BE     .word _scenario_BE01_50___
- - - - - 0x020A6D 17:8A5D: 01 BE     .word _scenario_BE01_50___
- D - I - 0x020A6F 17:8A5F: 01 BE     .word _scenario_BE01_50___    ; 
- D - I - 0x020A71 17:8A61: 0D BE     .word _scenario_BE0D_51       ; ХЗ лицо misaki
- D - I - 0x020A73 17:8A63: 18 BE     .word _scenario_BE18_52       ; ХЗ лицо hyuga
- D - I - 0x020A75 17:8A65: 20 BE     .word _scenario_BE20_53       ; 
- D - I - 0x020A77 17:8A67: 2A BE     .word _scenario_BE2A_54       ; 
- D - I - 0x020A79 17:8A69: 32 BE     .word _scenario_BE32_55       ; 
- D - I - 0x020A7B 17:8A6B: 3A BE     .word _scenario_BE3A_56       ; 
- D - I - 0x020A7D 17:8A6D: 42 BE     .word _scenario_BE42_57       ; 
- D - I - 0x020A7F 17:8A6F: 4A BE     .word _scenario_BE4A_58       ; 
- D - I - 0x020A81 17:8A71: 52 BE     .word _scenario_BE52_59       ; 
- D - I - 0x020A83 17:8A73: 5A BE     .word _scenario_BE5A_5A       ; 
- D - I - 0x020A85 17:8A75: 69 BE     .word _scenario_BE69_5B       ; 
- D - I - 0x020A87 17:8A77: 73 BE     .word _scenario_BE73_5C       ; 
- D - I - 0x020A89 17:8A79: 7C BE     .word _scenario_BE7C_5D       ; 
- D - I - 0x020A8B 17:8A7B: 86 BE     .word _scenario_BE86_5E       ; 
- D - I - 0x020A8D 17:8A7D: 8E BE     .word _scenario_BE8E_5F       ; 
- D - I - 0x020A8F 17:8A7F: 96 BE     .word _scenario_BE96_60       ; 
- D - I - 0x020A91 17:8A81: 9E BE     .word _scenario_BE9E_61       ; 
- D - I - 0x020A93 17:8A83: A6 BE     .word _scenario_BEA6_62       ; 
- D - I - 0x020A95 17:8A85: AE BE     .word _scenario_BEAE_63       ; 
- D - I - 0x020A97 17:8A87: B6 BE     .word _scenario_BEB6_64       ; 
- D - I - 0x020A99 17:8A89: BE BE     .word _scenario_BEBE_65       ; 
- D - I - 0x020A9B 17:8A8B: C6 BE     .word _scenario_BEC6_66       ; 
- - - - - 0x020A9D 17:8A8D: D8 BE     .word _scenario_BED8_67       ; 
- - - - - 0x020A9F 17:8A8F: F7 BE     .word _scenario_BEF7_68       ; 
- D - I - 0x020AA1 17:8A91: 05 BF     .word _scenario_BF05_69       ; 
- D - I - 0x020AA3 17:8A93: 62 AA     .word _scenario_AA62_6A       ; 
- D - I - 0x020AA5 17:8A95: 0D BF     .word _scenario_BF0D_6B       ; 
- D - I - 0x020AA7 17:8A97: 13 BF     .word _scenario_BF13_6C       ; 
- D - I - 0x020AA9 17:8A99: 23 BF     .word _scenario_BF23_6D       ; 
- D - I - 0x020AAB 17:8A9B: 2C BF     .word _scenario_BF2C_6E       ; 
- D - I - 0x020AAD 17:8A9D: 54 BF     .word _scenario_BF54_6F       ; 
- D - I - 0x020AAF 17:8A9F: 61 BF     .word _scenario_BF61_70       ; 
- D - I - 0x020AB1 17:8AA1: 73 BF     .word _scenario_BF73_71       ; 
- D - I - 0x020AB3 17:8AA3: 7F BF     .word _scenario_BF7F_72       ; 
- D - I - 0x020AB5 17:8AA5: 94 BF     .word _scenario_BF94_73       ; 
- D - I - 0x020AB7 17:8AA7: 9C BF     .word _scenario_BF9C_74       ; 
- D - I - 0x020AB9 17:8AA9: D2 BF     .word _scenario_BFD2_75       ; 
- D - I - 0x020ABB 17:8AAB: 1B B0     .word _scenario_B01B_76       ; 
- D - I - 0x020ABD 17:8AAD: D8 BF     .word _scenario_BFD8_77       ; 
- D - I - 0x020ABF 17:8AAF: 97 A1     .word _scenario_A197_78       ; 



con_quit                    = $F0   ; 
con__quit                   = $F1   ; аналогично F0, но выход без очистки флага зеркала
con_jmp                     = $F2   ; 
con_branch                  = $F3   ; 
con_mirror_on               = $F4   ; 
con_mirror_off              = $F5   ; 
con_mirror_toggle           = $F6   ; 
con_F7                      = $F7   ; 
con_F8                      = $F8   ; байты 01-04
con_soundID_delay           = $F9   ; 
con_jsr                     = $FA   ; 
con_rts                     = $FB   ; 
con_moving_bg               = $FC   ; байты 01-04
con_mirror_condition        = $FD   ; байты 00-04
con_FE                      = $FE   ; 
con_drive                   = $FF   ; 
    con_overhead                = $00   ;
    con_tiger                   = $01   ;
    
con_pause                   = $00   ; задержка следующей анимации
con_bg                      = $00   ; фоны в банке 12
con_animation               = $00   ; анимации в банке 20
con_cloud                   = $00   ; облака в банке 22
    con_clear                   = $00   ; очистить облако
    con_skip                    = $FF   ; не записывать параметр (общее для фона, анимации и облака)




_scenario_8AB1_00:
- D - I - 0x020AC1 17:8AB1: F3        .byte con_branch, $34     ; узнать высоту мяча
- D - I - 0x020AC3 17:8AB3: B9 8A     .word bra_long_case_8AB9_00_мяч_у_атакующего_на_земле
- D - I - 0x020AC5 17:8AB5: 09 8F     .word bra_long_case_8F09_01_летит_низкий_мяч
- D - I - 0x020AC7 17:8AB7: 4B 8C     .word bra_long_case_8C4B_02_летит_высокий_мяч

bra_long_case_8AB9_00_мяч_у_атакующего_на_земле:
- D - I - 0x020AC9 17:8AB9: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x020ACF 17:8ABF: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x020AD1 17:8AC1: 06        .byte bra_case_8AC7_00_защитник_выживет - *
- D - I - 0x020AD2 17:8AC2: CC        .byte bra_case_8B8E_01_защитник_убьется - *

bra_case_8AC7_00_защитник_выживет:
- D - I - 0x020AD7 17:8AC7: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020AD9 17:8AC9: 08        .byte bra_case_8AD1_00_block - *
- D - I - 0x020ADA 17:8ACA: 15        .byte bra_case_8ADF_01_tackle - *
- D - I - 0x020ADB 17:8ACB: 0D        .byte bra_case_8AD8_02_pass_cut - *

bra_case_8AD1_00_block:
- D - I - 0x020AE1 17:8AD1: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020AE3 17:8AD3: 28        .byte bra_case_8AFB_00_атакующий_легко_обводит - *
- D - I - 0x020AE4 17:8AD4: 30        .byte bra_case_8B04_01_атакующий_с_трудом_обводит - *
- D - I - 0x020AE5 17:8AD5: 38        .byte bra_case_8B0D_02_защитник_выбьет_мяч - *
- D - I - 0x020AE6 17:8AD6: 49        .byte bra_case_8B1F_03_защитник_заберет_мяч - *
- D - I - 0x020AE7 17:8AD7: 5A        .byte bra_case_8B31_04_нарушение - *

bra_case_8AD8_02_pass_cut:
- D - I - 0x020AE8 17:8AD8: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020AEA 17:8ADA: 21        .byte bra_case_8AFB_00_атакующий_легко_обводит - *
- D - I - 0x020AEB 17:8ADB: 29        .byte bra_case_8B04_01_атакующий_с_трудом_обводит - *
- D - I - 0x020AEC 17:8ADC: 31        .byte bra_case_8B0D_02_защитник_выбьет_мяч - *
- D - I - 0x020AED 17:8ADD: 42        .byte bra_case_8B1F_03_защитник_заберет_мяч - *
- D - I - 0x020AEE 17:8ADE: 53        .byte bra_case_8B31_04_нарушение - *

bra_case_8ADF_01_tackle:
- D - I - 0x020AEF 17:8ADF: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020AF1 17:8AE1: 5C        .byte bra_case_8B3D_00_атакующий_легко_обводит - *
- D - I - 0x020AF2 17:8AE2: 67        .byte bra_case_8B49_01_атакующий_с_трудом_обводит - *
- D - I - 0x020AF3 17:8AE3: 72        .byte bra_case_8B55_02_защитник_выбьет_мяч - *
- D - I - 0x020AF4 17:8AE4: 86        .byte bra_case_8B6A_03_защитник_заберет_мяч - *
- D - I - 0x020AF5 17:8AE5: 9A        .byte bra_case_8B7F_04_нарушение - *

bra_case_8AFB_00_атакующий_легко_обводит:
- D - I - 0x020B0B 17:8AFB: FA        .byte con_jsr
- D - I - 0x020B0C 17:8AFC: 8B 9C     .word sub_9C8B
- D - I - 0x020B0E 17:8AFE: FA        .byte con_jsr
- D - I - 0x020B0F 17:8AFF: C0 9C     .word sub_9CC0_выбор_анимации_дриблинга_легкой_обводки
- D - I - 0x020B11 17:8B01: F2        .byte con_jmp
- D - I - 0x020B12 17:8B02: AA 9E     .word loc_9EAA

bra_case_8B04_01_атакующий_с_трудом_обводит:
- D - I - 0x020B14 17:8B04: FA        .byte con_jsr
- D - I - 0x020B15 17:8B05: 8B 9C     .word sub_9C8B
- D - I - 0x020B17 17:8B07: FA        .byte con_jsr
- D - I - 0x020B18 17:8B08: A3 9C     .word sub_9CA3_выбор_анимации_дриблинга_трудной_обводки
- D - I - 0x020B1A 17:8B0A: F2        .byte con_jmp
- D - I - 0x020B1B 17:8B0B: AA 9E     .word loc_9EAA

bra_case_8B0D_02_защитник_выбьет_мяч:
- D - I - 0x020B1D 17:8B0D: FA        .byte con_jsr
- D - I - 0x020B1E 17:8B0E: 8B 9C     .word sub_9C8B
- D - I - 0x020B20 17:8B10: FA        .byte con_jsr
- D - I - 0x020B21 17:8B11: FE 9D     .word sub_9DFE
- D - I - 0x020B23 17:8B13: FA        .byte con_jsr
- D - I - 0x020B24 17:8B14: 08 A3     .word sub_A308
- D - I - 0x020B26 17:8B16: F6        .byte con_mirror_toggle
- D - I - 0x020B27 17:8B17: FA        .byte con_jsr
- D - I - 0x020B28 17:8B18: 73 A3     .word sub_A373_мяч_улетает_в_сторону
- D - I - 0x020B2A 17:8B1A: FA        .byte con_jsr
- D - I - 0x020B2B 17:8B1B: 64 9E     .word sub_9E64
- D - I - 0x020B2D 17:8B1D: F6        .byte con_mirror_toggle
- D - I - 0x020B2E 17:8B1E: F0        .byte con_quit

bra_case_8B1F_03_защитник_заберет_мяч:
- D - I - 0x020B2F 17:8B1F: FA        .byte con_jsr
- D - I - 0x020B30 17:8B20: 8B 9C     .word sub_9C8B
- D - I - 0x020B32 17:8B22: FA        .byte con_jsr
- D - I - 0x020B33 17:8B23: FE 9D     .word sub_9DFE
- D - I - 0x020B35 17:8B25: FA        .byte con_jsr
- D - I - 0x020B36 17:8B26: EF A2     .word sub_A2EF
- D - I - 0x020B38 17:8B28: FA        .byte con_jsr
- D - I - 0x020B39 17:8B29: 5A A1     .word sub_A15A
- D - I - 0x020B3B 17:8B2B: F6        .byte con_mirror_toggle
- D - I - 0x020B3C 17:8B2C: FA        .byte con_jsr
- D - I - 0x020B3D 17:8B2D: 64 9E     .word sub_9E64
- D - I - 0x020B3F 17:8B2F: F6        .byte con_mirror_toggle
- D - I - 0x020B40 17:8B30: F0        .byte con_quit

bra_case_8B31_04_нарушение:
- D - I - 0x020B41 17:8B31: FA        .byte con_jsr
- D - I - 0x020B42 17:8B32: 8B 9C     .word sub_9C8B
- D - I - 0x020B44 17:8B34: FA        .byte con_jsr
- D - I - 0x020B45 17:8B35: FE 9D     .word sub_9DFE
- D - I - 0x020B47 17:8B37: FA        .byte con_jsr
- D - I - 0x020B48 17:8B38: DD A2     .word sub_A2DD
- D - I - 0x020B4A 17:8B3A: F2        .byte con_jmp
- D - I - 0x020B4B 17:8B3B: 5B A3     .word loc_A35B_нарушение

bra_case_8B3D_00_атакующий_легко_обводит:
- D - I - 0x020B4D 17:8B3D: FA        .byte con_jsr
- D - I - 0x020B4E 17:8B3E: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020B50 17:8B40: FA        .byte con_jsr
- D - I - 0x020B51 17:8B41: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020B53 17:8B43: FA        .byte con_jsr
- D - I - 0x020B54 17:8B44: C0 9C     .word sub_9CC0_выбор_анимации_дриблинга_легкой_обводки
- D - I - 0x020B56 17:8B46: F2        .byte con_jmp
- D - I - 0x020B57 17:8B47: AA 9E     .word loc_9EAA

bra_case_8B49_01_атакующий_с_трудом_обводит:
- D - I - 0x020B59 17:8B49: FA        .byte con_jsr
- D - I - 0x020B5A 17:8B4A: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020B5C 17:8B4C: FA        .byte con_jsr
- D - I - 0x020B5D 17:8B4D: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020B5F 17:8B4F: FA        .byte con_jsr
- D - I - 0x020B60 17:8B50: A3 9C     .word sub_9CA3_выбор_анимации_дриблинга_трудной_обводки
- D - I - 0x020B62 17:8B52: F2        .byte con_jmp
- D - I - 0x020B63 17:8B53: AA 9E     .word loc_9EAA

bra_case_8B55_02_защитник_выбьет_мяч:
- D - I - 0x020B65 17:8B55: FA        .byte con_jsr
- D - I - 0x020B66 17:8B56: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020B68 17:8B58: FA        .byte con_jsr
- D - I - 0x020B69 17:8B59: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020B6B 17:8B5B: FA        .byte con_jsr
- D - I - 0x020B6C 17:8B5C: FE 9D     .word sub_9DFE
- D - I - 0x020B6E 17:8B5E: FA        .byte con_jsr
- D - I - 0x020B6F 17:8B5F: 08 A3     .word sub_A308
- D - I - 0x020B71 17:8B61: F6        .byte con_mirror_toggle
- D - I - 0x020B72 17:8B62: FA        .byte con_jsr
- D - I - 0x020B73 17:8B63: 73 A3     .word sub_A373_мяч_улетает_в_сторону
- D - I - 0x020B75 17:8B65: FA        .byte con_jsr
- D - I - 0x020B76 17:8B66: 64 9E     .word sub_9E64
- D - I - 0x020B78 17:8B68: F6        .byte con_mirror_toggle
- D - I - 0x020B79 17:8B69: F0        .byte con_quit

bra_case_8B6A_03_защитник_заберет_мяч:
- D - I - 0x020B7A 17:8B6A: FA        .byte con_jsr
- D - I - 0x020B7B 17:8B6B: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020B7D 17:8B6D: FA        .byte con_jsr
- D - I - 0x020B7E 17:8B6E: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020B80 17:8B70: FA        .byte con_jsr
- D - I - 0x020B81 17:8B71: FE 9D     .word sub_9DFE
- D - I - 0x020B83 17:8B73: FA        .byte con_jsr
- D - I - 0x020B84 17:8B74: 28 B4     .word sub_B428
- D - I - 0x020B86 17:8B76: FA        .byte con_jsr
- D - I - 0x020B87 17:8B77: C3 A0     .word sub_A0C3
- D - I - 0x020B89 17:8B79: F6        .byte con_mirror_toggle
- D - I - 0x020B8A 17:8B7A: FA        .byte con_jsr
- D - I - 0x020B8B 17:8B7B: 64 9E     .word sub_9E64
- D - I - 0x020B8D 17:8B7D: F6        .byte con_mirror_toggle
- D - I - 0x020B8E 17:8B7E: F0        .byte con_quit

bra_case_8B7F_04_нарушение:
- D - I - 0x020B8F 17:8B7F: FA        .byte con_jsr
- D - I - 0x020B90 17:8B80: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020B92 17:8B82: FA        .byte con_jsr
- D - I - 0x020B93 17:8B83: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020B95 17:8B85: FA        .byte con_jsr
- D - I - 0x020B96 17:8B86: FE 9D     .word sub_9DFE
- D - I - 0x020B98 17:8B88: FA        .byte con_jsr
- D - I - 0x020B99 17:8B89: DD A2     .word sub_A2DD
- D - I - 0x020B9B 17:8B8B: F2        .byte con_jmp
- D - I - 0x020B9C 17:8B8C: 5B A3     .word loc_A35B_нарушение

bra_case_8B8E_01_защитник_убьется:
- D - I - 0x020B9E 17:8B8E: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020BA0 17:8B90: 08        .byte bra_case_8B98_00_block - *
- D - I - 0x020BA1 17:8B91: 15        .byte bra_case_8BA6_01_tackle - *
- D - I - 0x020BA2 17:8B92: 0D        .byte bra_case_8B9F_02_pass_cut - *

bra_case_8B98_00_block:
- D - I - 0x020BA8 17:8B98: F3        .byte con_branch, $83     ; результат действия защитника
- - - - - 0x020BAA 17:8B9A: 28        .byte bra_case_8BC2_00_атакующий_легко_обводит - *
- D - I - 0x020BAB 17:8B9B: 37        .byte bra_case_8BD2_01_атакующий_с_трудом_обводит - *
- - - - - 0x020BAC 17:8B9C: 35        .byte bra_case_8BD1_02_защитник_выбьет_мяч - *
- - - - - 0x020BAD 17:8B9D: 34        .byte bra_case_8BD1_03_защитник_заберет_мяч - *
- - - - - 0x020BAE 17:8B9E: 33        .byte bra_case_8BD1_04_нарушение - *

bra_case_8B9F_02_pass_cut:
- D - I - 0x020BAF 17:8B9F: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020BB1 17:8BA1: 21        .byte bra_case_8BC2_00_атакующий_легко_обводит - *
- D - I - 0x020BB2 17:8BA2: 30        .byte bra_case_8BD2_01_атакующий_с_трудом_обводит - *
- - - - - 0x020BB3 17:8BA3: 2E        .byte bra_case_8BD1_02_защитник_выбьет_мяч - *
- - - - - 0x020BB4 17:8BA4: 2D        .byte bra_case_8BD1_03_защитник_заберет_мяч - *
- - - - - 0x020BB5 17:8BA5: 2C        .byte bra_case_8BD1_04_нарушение - *

bra_case_8BA6_01_tackle:
- D - I - 0x020BB6 17:8BA6: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020BB8 17:8BA8: 3C        .byte bra_case_8BE4_00_атакующий_легко_обводит - *
- D - I - 0x020BB9 17:8BA9: 4D        .byte bra_case_8BF6_01_атакующий_с_трудом_обводит - *
- D - I - 0x020BBA 17:8BAA: 61        .byte bra_case_8C0B_02_защитник_выбьет_мяч - *
- D - I - 0x020BBB 17:8BAB: 77        .byte bra_case_8C22_03_защитник_заберет_мяч - *
- D - I - 0x020BBC 17:8BAC: 8D        .byte bra_case_8C39_04_нарушение - *

bra_case_8BC2_00_атакующий_легко_обводит:
- D - I - 0x020BD2 17:8BC2: FA        .byte con_jsr
- D - I - 0x020BD3 17:8BC3: 8B 9C     .word sub_9C8B
- D - I - 0x020BD5 17:8BC5: FA        .byte con_jsr
- D - I - 0x020BD6 17:8BC6: FE 9D     .word sub_9DFE
- D - I - 0x020BD8 17:8BC8: FA        .byte con_jsr
- D - I - 0x020BD9 17:8BC9: DD A2     .word sub_A2DD
- D - I - 0x020BDB 17:8BCB: FA        .byte con_jsr
- D - I - 0x020BDC 17:8BCC: AA 9E     .word sub_9EAA
- D - I - 0x020BDE 17:8BCE: FA        .byte con_jsr
- D - I - 0x020BDF 17:8BCF: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_8BD1_02_защитник_выбьет_мяч:
bra_case_8BD1_03_защитник_заберет_мяч:
bra_case_8BD1_04_нарушение:
- D - I - 0x020BE1 17:8BD1: F0        .byte con_quit

bra_case_8BD2_01_атакующий_с_трудом_обводит:
- D - I - 0x020BE2 17:8BD2: FA        .byte con_jsr
- D - I - 0x020BE3 17:8BD3: 8B 9C     .word sub_9C8B
- D - I - 0x020BE5 17:8BD5: FA        .byte con_jsr
- D - I - 0x020BE6 17:8BD6: FE 9D     .word sub_9DFE
- D - I - 0x020BE8 17:8BD8: FA        .byte con_jsr
- D - I - 0x020BE9 17:8BD9: DD A2     .word sub_A2DD
- D - I - 0x020BEB 17:8BDB: FA        .byte con_jsr
- D - I - 0x020BEC 17:8BDC: AA 9E     .word sub_9EAA
- D - I - 0x020BEE 17:8BDE: FA        .byte con_jsr
- D - I - 0x020BEF 17:8BDF: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x020BF1 17:8BE1: F2        .byte con_jmp
- D - I - 0x020BF2 17:8BE2: 47 A2     .word loc_A247

bra_case_8BE4_00_атакующий_легко_обводит:
- D - I - 0x020BF4 17:8BE4: FA        .byte con_jsr
- D - I - 0x020BF5 17:8BE5: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020BF7 17:8BE7: FA        .byte con_jsr
- D - I - 0x020BF8 17:8BE8: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020BFA 17:8BEA: FA        .byte con_jsr
- D - I - 0x020BFB 17:8BEB: FE 9D     .word sub_9DFE
- D - I - 0x020BFD 17:8BED: FA        .byte con_jsr
- D - I - 0x020BFE 17:8BEE: DD A2     .word sub_A2DD
- D - I - 0x020C00 17:8BF0: FA        .byte con_jsr
- D - I - 0x020C01 17:8BF1: AA 9E     .word sub_9EAA
- D - I - 0x020C03 17:8BF3: F2        .byte con_jmp
- D - I - 0x020C04 17:8BF4: 62 9F     .word loc_9F62_рандом_анимации_отпизженного_игрока_с_сообщением

bra_case_8BF6_01_атакующий_с_трудом_обводит:
- D - I - 0x020C06 17:8BF6: FA        .byte con_jsr
- D - I - 0x020C07 17:8BF7: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020C09 17:8BF9: FA        .byte con_jsr
- D - I - 0x020C0A 17:8BFA: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020C0C 17:8BFC: FA        .byte con_jsr
- D - I - 0x020C0D 17:8BFD: FE 9D     .word sub_9DFE
- D - I - 0x020C0F 17:8BFF: FA        .byte con_jsr
- D - I - 0x020C10 17:8C00: DD A2     .word sub_A2DD
- D - I - 0x020C12 17:8C02: FA        .byte con_jsr
- D - I - 0x020C13 17:8C03: AA 9E     .word sub_9EAA
- D - I - 0x020C15 17:8C05: FA        .byte con_jsr
- D - I - 0x020C16 17:8C06: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x020C18 17:8C08: F2        .byte con_jmp
- D - I - 0x020C19 17:8C09: 47 A2     .word loc_A247

bra_case_8C0B_02_защитник_выбьет_мяч:
- D - I - 0x020C1B 17:8C0B: FA        .byte con_jsr
- D - I - 0x020C1C 17:8C0C: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020C1E 17:8C0E: FA        .byte con_jsr
- D - I - 0x020C1F 17:8C0F: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020C21 17:8C11: FA        .byte con_jsr
- D - I - 0x020C22 17:8C12: FE 9D     .word sub_9DFE
- D - I - 0x020C24 17:8C14: FA        .byte con_jsr
- D - I - 0x020C25 17:8C15: DD A2     .word sub_A2DD
- D - I - 0x020C27 17:8C17: F6        .byte con_mirror_toggle
- D - I - 0x020C28 17:8C18: FA        .byte con_jsr
- D - I - 0x020C29 17:8C19: 64 9E     .word sub_9E64
- D - I - 0x020C2B 17:8C1B: F6        .byte con_mirror_toggle
- D - I - 0x020C2C 17:8C1C: FA        .byte con_jsr
- D - I - 0x020C2D 17:8C1D: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x020C2F 17:8C1F: F2        .byte con_jmp
- D - I - 0x020C30 17:8C20: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8C22_03_защитник_заберет_мяч:
- D - I - 0x020C32 17:8C22: FA        .byte con_jsr
- D - I - 0x020C33 17:8C23: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020C35 17:8C25: FA        .byte con_jsr
- D - I - 0x020C36 17:8C26: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020C38 17:8C28: FA        .byte con_jsr
- D - I - 0x020C39 17:8C29: FE 9D     .word sub_9DFE
- D - I - 0x020C3B 17:8C2B: FA        .byte con_jsr
- D - I - 0x020C3C 17:8C2C: DD A2     .word sub_A2DD
- D - I - 0x020C3E 17:8C2E: F6        .byte con_mirror_toggle
- D - I - 0x020C3F 17:8C2F: FA        .byte con_jsr
- D - I - 0x020C40 17:8C30: 64 9E     .word sub_9E64
- D - I - 0x020C42 17:8C32: F6        .byte con_mirror_toggle
- D - I - 0x020C43 17:8C33: FA        .byte con_jsr
- D - I - 0x020C44 17:8C34: 74 9F     .word sub_9F74_рандом_анимации_отпизженного_игрока_без_сообщения
- D - I - 0x020C46 17:8C36: F2        .byte con_jmp
- D - I - 0x020C47 17:8C37: 6F A0     .word loc_A06F

bra_case_8C39_04_нарушение:
- D - I - 0x020C49 17:8C39: FA        .byte con_jsr
- D - I - 0x020C4A 17:8C3A: 36 A9     .word sub_A936_сообщение_игрока_при_нападении
- D - I - 0x020C4C 17:8C3C: FA        .byte con_jsr
- D - I - 0x020C4D 17:8C3D: CF A3     .word sub_A3CF_kurae_если_не_спешал
- D - I - 0x020C4F 17:8C3F: FA        .byte con_jsr
- D - I - 0x020C50 17:8C40: FE 9D     .word sub_9DFE
- D - I - 0x020C52 17:8C42: FA        .byte con_jsr
- D - I - 0x020C53 17:8C43: DD A2     .word sub_A2DD
- D - I - 0x020C55 17:8C45: FA        .byte con_jsr
- D - I - 0x020C56 17:8C46: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x020C58 17:8C48: F2        .byte con_jmp
- D - I - 0x020C59 17:8C49: 5B A3     .word loc_A35B_нарушение

bra_long_case_8C4B_02_летит_высокий_мяч:
- D - I - 0x020C5B 17:8C4B: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x020C63 17:8C53: F3        .byte con_branch, $C6
- D - I - 0x020C65 17:8C55: 02        .byte bra_case_8C57_00 - *
- D - I - 0x020C66 17:8C56: B7        .byte bra_case_8D0D_01 - *

bra_case_8C57_00:
- D - I - 0x020C67 17:8C57: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020C69 17:8C59: 03        .byte bra_case_8C5C_00_block - *
- D - I - 0x020C6A 17:8C5A: 43        .byte bra_case_8C9D_01_tackle - *
- D - I - 0x020C6B 17:8C5B: 7A        .byte bra_case_8CD5_02_pass_cut - *

bra_case_8C5C_00_block:
- D - I - 0x020C6C 17:8C5C: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020C6E 17:8C5E: 11        .byte bra_case_8C6F_00 - *
- D - I - 0x020C6F 17:8C5F: 1A        .byte bra_case_8C79_01 - *
- D - I - 0x020C70 17:8C60: 03        .byte bra_case_8C63_02 - *
- D - I - 0x020C71 17:8C61: 08        .byte bra_case_8C69_03 - *
- - - - - 0x020C72 17:8C62: 16        .byte bra_case_8C78_04_нарушение - *

bra_case_8C63_02:
- D - I - 0x020C73 17:8C63: F3        .byte con_branch, $9B
- D - I - 0x020C75 17:8C65: 23        .byte bra_case_8C88_00_block - *
- - - - - 0x020C76 17:8C66: 31        .byte bra_case_8C97_01_face_block - *
- - - - - 0x020C77 17:8C67: 21        .byte bra_case_8C88_02_skylab_block - *
- D - I - 0x020C78 17:8C68: 20        .byte bra_case_8C88_03_power_block - *

bra_case_8C69_03:
- D - I - 0x020C79 17:8C69: F3        .byte con_branch, $9B
- - - - - 0x020C7B 17:8C6B: CD        .byte bra_case_8D38_00_block - *
- D - I - 0x020C7C 17:8C6C: 2B        .byte bra_case_8C97_01_face_block - *
- - - - - 0x020C7D 17:8C6D: CB        .byte bra_case_8D38_02_skylab_block - *
- - - - - 0x020C7E 17:8C6E: CA        .byte bra_case_8D38_03_power_block - *

bra_case_8C6F_00:
- D - I - 0x020C7F 17:8C6F: FA        .byte con_jsr
- D - I - 0x020C80 17:8C70: 79 9C     .word sub_9C79
- D - I - 0x020C82 17:8C72: FA        .byte con_jsr
- D - I - 0x020C83 17:8C73: 47 B3     .word sub_B347
- D - I - 0x020C85 17:8C75: FA        .byte con_jsr
- D - I - 0x020C86 17:8C76: 76 A1     .word sub_A176
bra_case_8C78_04_нарушение:
- D - I - 0x020C88 17:8C78: F0        .byte con_quit

bra_case_8C79_01:
- D - I - 0x020C89 17:8C79: FA        .byte con_jsr
- D - I - 0x020C8A 17:8C7A: 79 9C     .word sub_9C79
- D - I - 0x020C8C 17:8C7C: FA        .byte con_jsr
- D - I - 0x020C8D 17:8C7D: 47 B3     .word sub_B347
- D - I - 0x020C8F 17:8C7F: FA        .byte con_jsr
- D - I - 0x020C90 17:8C80: 42 A0     .word sub_A042
- D - I - 0x020C92 17:8C82: FA        .byte con_jsr
- D - I - 0x020C93 17:8C83: 25 A0     .word sub_A025
- D - I - 0x020C95 17:8C85: F2        .byte con_jmp
- D - I - 0x020C96 17:8C86: 17 A0     .word loc_A017

loc_8C88:
bra_case_8C88_00_block:
bra_case_8C88_02_skylab_block:
bra_case_8C88_03_power_block:
- D - I - 0x020C98 17:8C88: FA        .byte con_jsr
- D - I - 0x020C99 17:8C89: 79 9C     .word sub_9C79
- D - I - 0x020C9B 17:8C8B: FA        .byte con_jsr
- D - I - 0x020C9C 17:8C8C: 47 B3     .word sub_B347
- D - I - 0x020C9E 17:8C8E: FA        .byte con_jsr
- D - I - 0x020C9F 17:8C8F: 47 A0     .word sub_A047
- D - I - 0x020CA1 17:8C91: FA        .byte con_jsr
- D - I - 0x020CA2 17:8C92: 23 A0     .word sub_A023
- D - I - 0x020CA4 17:8C94: F2        .byte con_jmp
- D - I - 0x020CA5 17:8C95: 71 A3     .word loc_A371_мяч_улетает_в_сторону

loc_8C97:
bra_case_8C97_01_face_block:
- D - I - 0x020CA7 17:8C97: FA        .byte con_jsr
- D - I - 0x020CA8 17:8C98: 47 B3     .word sub_B347
- D - I - 0x020CAA 17:8C9A: F2        .byte con_jmp
- D - I - 0x020CAB 17:8C9B: 67 8F     .word loc_8F67

bra_case_8C9D_01_tackle:
- D - I - 0x020CAD 17:8C9D: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020CAF 17:8C9F: 05        .byte bra_case_8CA4_00 - *
- D - I - 0x020CB0 17:8CA0: 0E        .byte bra_case_8CAE_01 - *
- D - I - 0x020CB1 17:8CA1: 1C        .byte bra_case_8CBD_02 - *
- D - I - 0x020CB2 17:8CA2: 2A        .byte bra_case_8CCC_03 - *
- - - - - 0x020CB3 17:8CA3: 0A        .byte bra_case_8CAD_04_нарушение - *

bra_case_8CA4_00:
- D - I - 0x020CB4 17:8CA4: FA        .byte con_jsr
- D - I - 0x020CB5 17:8CA5: 79 9C     .word sub_9C79
- D - I - 0x020CB7 17:8CA7: FA        .byte con_jsr
- D - I - 0x020CB8 17:8CA8: DC B2     .word sub_B2DC
- D - I - 0x020CBA 17:8CAA: FA        .byte con_jsr
- D - I - 0x020CBB 17:8CAB: 76 A1     .word sub_A176
bra_case_8CAD_04_нарушение:
- D - I - 0x020CBD 17:8CAD: F0        .byte con_quit

bra_case_8CAE_01:
- D - I - 0x020CBE 17:8CAE: FA        .byte con_jsr
- D - I - 0x020CBF 17:8CAF: 79 9C     .word sub_9C79
- D - I - 0x020CC1 17:8CB1: FA        .byte con_jsr
- D - I - 0x020CC2 17:8CB2: DC B2     .word sub_B2DC
- D - I - 0x020CC4 17:8CB4: FA        .byte con_jsr
- D - I - 0x020CC5 17:8CB5: 42 A0     .word sub_A042
- D - I - 0x020CC7 17:8CB7: FA        .byte con_jsr
- D - I - 0x020CC8 17:8CB8: 25 A0     .word sub_A025
- D - I - 0x020CCA 17:8CBA: F2        .byte con_jmp
- D - I - 0x020CCB 17:8CBB: 17 A0     .word loc_A017

bra_case_8CBD_02:
- D - I - 0x020CCD 17:8CBD: FA        .byte con_jsr
- D - I - 0x020CCE 17:8CBE: 79 9C     .word sub_9C79
- D - I - 0x020CD0 17:8CC0: FA        .byte con_jsr
- D - I - 0x020CD1 17:8CC1: DC B2     .word sub_B2DC
- D - I - 0x020CD3 17:8CC3: FA        .byte con_jsr
- D - I - 0x020CD4 17:8CC4: 47 A0     .word sub_A047
- D - I - 0x020CD6 17:8CC6: FA        .byte con_jsr
- D - I - 0x020CD7 17:8CC7: 23 A0     .word sub_A023
- D - I - 0x020CD9 17:8CC9: F2        .byte con_jmp
- D - I - 0x020CDA 17:8CCA: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8CCC_03:
- D - I - 0x020CDC 17:8CCC: FA        .byte con_jsr
- D - I - 0x020CDD 17:8CCD: 79 9C     .word sub_9C79
- D - I - 0x020CDF 17:8CCF: FA        .byte con_jsr
- D - I - 0x020CE0 17:8CD0: DC B2     .word sub_B2DC
- D - I - 0x020CE2 17:8CD2: F2        .byte con_jmp
- D - I - 0x020CE3 17:8CD3: 85 A1     .word loc_A185

bra_case_8CD5_02_pass_cut:
- D - I - 0x020CE5 17:8CD5: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020CE7 17:8CD7: 05        .byte bra_case_8CDC_00 - *
- D - I - 0x020CE8 17:8CD8: 0E        .byte bra_case_8CE6_01 - *
- D - I - 0x020CE9 17:8CD9: 1C        .byte bra_case_8CF5_02 - *
- D - I - 0x020CEA 17:8CDA: 2A        .byte bra_case_8D04_03 - *
- - - - - 0x020CEB 17:8CDB: 0A        .byte bra_case_8CE5_04_нарушение - *

bra_case_8CDC_00:
- D - I - 0x020CEC 17:8CDC: FA        .byte con_jsr
- D - I - 0x020CED 17:8CDD: 79 9C     .word sub_9C79
- D - I - 0x020CEF 17:8CDF: FA        .byte con_jsr
- D - I - 0x020CF0 17:8CE0: F8 9D     .word sub_9DF8
- D - I - 0x020CF2 17:8CE2: FA        .byte con_jsr
- D - I - 0x020CF3 17:8CE3: E5 9F     .word sub_9FE5
bra_case_8CE5_04_нарушение:
- D - I - 0x020CF5 17:8CE5: F0        .byte con_quit

bra_case_8CE6_01:
- D - I - 0x020CF6 17:8CE6: FA        .byte con_jsr
- D - I - 0x020CF7 17:8CE7: 79 9C     .word sub_9C79
- D - I - 0x020CF9 17:8CE9: FA        .byte con_jsr
- D - I - 0x020CFA 17:8CEA: F8 9D     .word sub_9DF8
- D - I - 0x020CFC 17:8CEC: FA        .byte con_jsr
- D - I - 0x020CFD 17:8CED: 0B A0     .word sub_A00B
- D - I - 0x020CFF 17:8CEF: FA        .byte con_jsr
- D - I - 0x020D00 17:8CF0: F3 9F     .word sub_9FF3
- D - I - 0x020D02 17:8CF2: F2        .byte con_jmp
- D - I - 0x020D03 17:8CF3: E0 9F     .word loc_9FE0

bra_case_8CF5_02:
- D - I - 0x020D05 17:8CF5: FA        .byte con_jsr
- D - I - 0x020D06 17:8CF6: 79 9C     .word sub_9C79
- D - I - 0x020D08 17:8CF8: FA        .byte con_jsr
- D - I - 0x020D09 17:8CF9: F8 9D     .word sub_9DF8
- D - I - 0x020D0B 17:8CFB: FA        .byte con_jsr
- D - I - 0x020D0C 17:8CFC: 10 A0     .word sub_A010
- D - I - 0x020D0E 17:8CFE: FA        .byte con_jsr
- D - I - 0x020D0F 17:8CFF: F1 9F     .word sub_9FF1
- D - I - 0x020D11 17:8D01: F2        .byte con_jmp
- D - I - 0x020D12 17:8D02: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8D04_03:
- D - I - 0x020D14 17:8D04: FA        .byte con_jsr
- D - I - 0x020D15 17:8D05: 79 9C     .word sub_9C79
- D - I - 0x020D17 17:8D07: FA        .byte con_jsr
- D - I - 0x020D18 17:8D08: F8 9D     .word sub_9DF8
- D - I - 0x020D1A 17:8D0A: F2        .byte con_jmp
- D - I - 0x020D1B 17:8D0B: 6E A1     .word loc_A16E

bra_case_8D0D_01:
- D - I - 0x020D1D 17:8D0D: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020D1F 17:8D0F: 03        .byte bra_case_8D12_00_block - *
- D - I - 0x020D20 17:8D10: 61        .byte bra_case_8D71_01_tackle - *
- D - I - 0x020D21 17:8D11: 9B        .byte bra_case_8DAC_02_pass_cut - *

bra_case_8D12_00_block:
- D - I - 0x020D22 17:8D12: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020D24 17:8D14: 14        .byte bra_case_8D28_00 - *
- - - - - 0x020D25 17:8D15: 2C        .byte bra_case_8D41_01 - *
- - - - - 0x020D26 17:8D16: 03        .byte bra_case_8D19_02 - *
- D - I - 0x020D27 17:8D17: 08        .byte bra_case_8D1F_03 - *
- - - - - 0x020D28 17:8D18: 1F        .byte bra_case_8D37_04_нарушение - *

bra_case_8D19_02:
- - - - - 0x020D29 17:8D19: F3        .byte con_branch, $9B
- - - - - 0x020D2B 17:8D1B: 38        .byte bra_case_8D53_00_block - *
- - - - - 0x020D2C 17:8D1C: 09        .byte bra_case_8D25_01_face_block - *
- - - - - 0x020D2D 17:8D1D: 36        .byte bra_case_8D53_02_skylab_block - *
- - - - - 0x020D2E 17:8D1E: 35        .byte bra_case_8D53_03_power_block - *

bra_case_8D1F_03:
- D - I - 0x020D2F 17:8D1F: F3        .byte con_branch, $9B
- - - - - 0x020D31 17:8D21: 44        .byte bra_case_8D65_00_block - *
- - - - - 0x020D32 17:8D22: 03        .byte bra_case_8D25_01_face_block - *
- - - - - 0x020D33 17:8D23: 42        .byte bra_case_8D65_02_skylab_block - *
- D - I - 0x020D34 17:8D24: 41        .byte bra_case_8D65_03_power_block - *

bra_case_8D25_01_face_block:
- - - - - 0x020D35 17:8D25: F2        .byte con_jmp
- - - - - 0x020D36 17:8D26: 97 8C     .word loc_8C97

bra_case_8D28_00:
- D - I - 0x020D38 17:8D28: FA        .byte con_jsr
- D - I - 0x020D39 17:8D29: 79 9C     .word sub_9C79
- D - I - 0x020D3B 17:8D2B: FA        .byte con_jsr
- D - I - 0x020D3C 17:8D2C: 47 B3     .word sub_B347
- D - I - 0x020D3E 17:8D2E: FA        .byte con_jsr
- D - I - 0x020D3F 17:8D2F: 47 A0     .word sub_A047
- D - I - 0x020D41 17:8D31: FA        .byte con_jsr
- D - I - 0x020D42 17:8D32: DD A2     .word sub_A2DD
- D - I - 0x020D44 17:8D34: FA        .byte con_jsr
- D - I - 0x020D45 17:8D35: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_8D37_04_нарушение:
- D - I - 0x020D47 17:8D37: F0        .byte con_quit

loc_8D38:
bra_case_8D38_00_block:
bra_case_8D38_02_skylab_block:
bra_case_8D38_03_power_block:
- - - - - 0x020D48 17:8D38: FA        .byte con_jsr
- - - - - 0x020D49 17:8D39: 79 9C     .word sub_9C79
- - - - - 0x020D4B 17:8D3B: FA        .byte con_jsr
- - - - - 0x020D4C 17:8D3C: 47 B3     .word sub_B347
- - - - - 0x020D4E 17:8D3E: F2        .byte con_jmp
- - - - - 0x020D4F 17:8D3F: A9 A1     .word loc_A1A9

bra_case_8D41_01:
- - - - - 0x020D51 17:8D41: FA        .byte con_jsr
- - - - - 0x020D52 17:8D42: 79 9C     .word sub_9C79
- - - - - 0x020D54 17:8D44: FA        .byte con_jsr
- - - - - 0x020D55 17:8D45: 47 B3     .word sub_B347
- - - - - 0x020D57 17:8D47: FA        .byte con_jsr
- - - - - 0x020D58 17:8D48: 47 A0     .word sub_A047
- - - - - 0x020D5A 17:8D4A: FA        .byte con_jsr
- - - - - 0x020D5B 17:8D4B: DD A2     .word sub_A2DD
- - - - - 0x020D5D 17:8D4D: FA        .byte con_jsr
- - - - - 0x020D5E 17:8D4E: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x020D60 17:8D50: F2        .byte con_jmp
- - - - - 0x020D61 17:8D51: 40 A2     .word loc_A240

bra_case_8D53_00_block:
bra_case_8D53_02_skylab_block:
bra_case_8D53_03_power_block:
- - - - - 0x020D63 17:8D53: FA        .byte con_jsr
- - - - - 0x020D64 17:8D54: 79 9C     .word sub_9C79
- - - - - 0x020D66 17:8D56: FA        .byte con_jsr
- - - - - 0x020D67 17:8D57: 47 B3     .word sub_B347
- - - - - 0x020D69 17:8D59: FA        .byte con_jsr
- - - - - 0x020D6A 17:8D5A: 47 A0     .word sub_A047
- - - - - 0x020D6C 17:8D5C: FA        .byte con_jsr
- - - - - 0x020D6D 17:8D5D: DD A2     .word sub_A2DD
- - - - - 0x020D6F 17:8D5F: FA        .byte con_jsr
- - - - - 0x020D70 17:8D60: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x020D72 17:8D62: F2        .byte con_jmp
- - - - - 0x020D73 17:8D63: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8D65_00_block:
bra_case_8D65_02_skylab_block:
bra_case_8D65_03_power_block:
- D - I - 0x020D75 17:8D65: FA        .byte con_jsr
- D - I - 0x020D76 17:8D66: 79 9C     .word sub_9C79
- D - I - 0x020D78 17:8D68: FA        .byte con_jsr
- D - I - 0x020D79 17:8D69: 47 B3     .word sub_B347
- D - I - 0x020D7B 17:8D6B: FA        .byte con_jsr
- D - I - 0x020D7C 17:8D6C: DD A2     .word sub_A2DD
- D - I - 0x020D7E 17:8D6E: F2        .byte con_jmp
- D - I - 0x020D7F 17:8D6F: A9 A1     .word loc_A1A9

bra_case_8D71_01_tackle:
- D - I - 0x020D81 17:8D71: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020D83 17:8D73: 05        .byte bra_case_8D78_00 - *
- D - I - 0x020D84 17:8D74: 14        .byte bra_case_8D88_01 - *
- - - - - 0x020D85 17:8D75: 25        .byte bra_case_8D9A_02 - *
- - - - - 0x020D86 17:8D76: 11        .byte bra_case_8D87_03 - *
- - - - - 0x020D87 17:8D77: 10        .byte bra_case_8D87_04_нарушение - *

bra_case_8D78_00:
- D - I - 0x020D88 17:8D78: FA        .byte con_jsr
- D - I - 0x020D89 17:8D79: 79 9C     .word sub_9C79
- D - I - 0x020D8B 17:8D7B: FA        .byte con_jsr
- D - I - 0x020D8C 17:8D7C: DC B2     .word sub_B2DC
- D - I - 0x020D8E 17:8D7E: FA        .byte con_jsr
- D - I - 0x020D8F 17:8D7F: 47 A0     .word sub_A047
- D - I - 0x020D91 17:8D81: FA        .byte con_jsr
- D - I - 0x020D92 17:8D82: DD A2     .word sub_A2DD
- D - I - 0x020D94 17:8D84: FA        .byte con_jsr
- D - I - 0x020D95 17:8D85: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_8D87_03:
bra_case_8D87_04_нарушение:
- D - I - 0x020D97 17:8D87: F0        .byte con_quit

bra_case_8D88_01:
- D - I - 0x020D98 17:8D88: FA        .byte con_jsr
- D - I - 0x020D99 17:8D89: 79 9C     .word sub_9C79
- D - I - 0x020D9B 17:8D8B: FA        .byte con_jsr
- D - I - 0x020D9C 17:8D8C: DC B2     .word sub_B2DC
- D - I - 0x020D9E 17:8D8E: FA        .byte con_jsr
- D - I - 0x020D9F 17:8D8F: 47 A0     .word sub_A047
- D - I - 0x020DA1 17:8D91: FA        .byte con_jsr
- D - I - 0x020DA2 17:8D92: DD A2     .word sub_A2DD
- D - I - 0x020DA4 17:8D94: FA        .byte con_jsr
- D - I - 0x020DA5 17:8D95: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x020DA7 17:8D97: F2        .byte con_jmp
- D - I - 0x020DA8 17:8D98: 40 A2     .word loc_A240

bra_case_8D9A_02:
- - - - - 0x020DAA 17:8D9A: FA        .byte con_jsr
- - - - - 0x020DAB 17:8D9B: 79 9C     .word sub_9C79
- - - - - 0x020DAD 17:8D9D: FA        .byte con_jsr
- - - - - 0x020DAE 17:8D9E: DC B2     .word sub_B2DC
- - - - - 0x020DB0 17:8DA0: FA        .byte con_jsr
- - - - - 0x020DB1 17:8DA1: 47 A0     .word sub_A047
- - - - - 0x020DB3 17:8DA3: FA        .byte con_jsr
- - - - - 0x020DB4 17:8DA4: DD A2     .word sub_A2DD
- - - - - 0x020DB6 17:8DA6: FA        .byte con_jsr
- - - - - 0x020DB7 17:8DA7: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x020DB9 17:8DA9: F2        .byte con_jmp
- - - - - 0x020DBA 17:8DAA: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8DAC_02_pass_cut:
- D - I - 0x020DBC 17:8DAC: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020DBE 17:8DAE: 05        .byte bra_case_8DB3_00 - *
- - - - - 0x020DBF 17:8DAF: 14        .byte bra_case_8DC3_01 - *
- - - - - 0x020DC0 17:8DB0: 25        .byte bra_case_8DD5_02 - *
- - - - - 0x020DC1 17:8DB1: 36        .byte bra_case_8DE7_03 - *
- - - - - 0x020DC2 17:8DB2: 10        .byte bra_case_8DC2_04_нарушение - *
bra_case_8DB3_00:
- D - I - 0x020DC3 17:8DB3: FA        .byte con_jsr
- D - I - 0x020DC4 17:8DB4: 79 9C     .word sub_9C79
- D - I - 0x020DC6 17:8DB6: FA        .byte con_jsr
- D - I - 0x020DC7 17:8DB7: F8 9D     .word sub_9DF8
- D - I - 0x020DC9 17:8DB9: FA        .byte con_jsr
- D - I - 0x020DCA 17:8DBA: 10 A0     .word sub_A010
- D - I - 0x020DCC 17:8DBC: FA        .byte con_jsr
- D - I - 0x020DCD 17:8DBD: DD A2     .word sub_A2DD
- D - I - 0x020DCF 17:8DBF: FA        .byte con_jsr
- D - I - 0x020DD0 17:8DC0: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_8DC2_04_нарушение:
- D - I - 0x020DD2 17:8DC2: F0        .byte con_quit

bra_case_8DC3_01:
- - - - - 0x020DD3 17:8DC3: FA        .byte con_jsr
- - - - - 0x020DD4 17:8DC4: 79 9C     .word sub_9C79
- - - - - 0x020DD6 17:8DC6: FA        .byte con_jsr
- - - - - 0x020DD7 17:8DC7: F8 9D     .word sub_9DF8
- - - - - 0x020DD9 17:8DC9: FA        .byte con_jsr
- - - - - 0x020DDA 17:8DCA: 10 A0     .word sub_A010
- - - - - 0x020DDC 17:8DCC: FA        .byte con_jsr
- - - - - 0x020DDD 17:8DCD: DD A2     .word sub_A2DD
- - - - - 0x020DDF 17:8DCF: FA        .byte con_jsr
- - - - - 0x020DE0 17:8DD0: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x020DE2 17:8DD2: F2        .byte con_jmp
- - - - - 0x020DE3 17:8DD3: 40 A2     .word loc_A240

bra_case_8DD5_02:
- - - - - 0x020DE5 17:8DD5: FA        .byte con_jsr
- - - - - 0x020DE6 17:8DD6: 79 9C     .word sub_9C79
- - - - - 0x020DE8 17:8DD8: FA        .byte con_jsr
- - - - - 0x020DE9 17:8DD9: F8 9D     .word sub_9DF8
- - - - - 0x020DEB 17:8DDB: FA        .byte con_jsr
- - - - - 0x020DEC 17:8DDC: 10 A0     .word sub_A010
- - - - - 0x020DEE 17:8DDE: FA        .byte con_jsr
- - - - - 0x020DEF 17:8DDF: DD A2     .word sub_A2DD
- - - - - 0x020DF1 17:8DE1: FA        .byte con_jsr
- - - - - 0x020DF2 17:8DE2: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x020DF4 17:8DE4: F2        .byte con_jmp
- - - - - 0x020DF5 17:8DE5: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8DE7_03:
- - - - - 0x020DF7 17:8DE7: FA        .byte con_jsr
- - - - - 0x020DF8 17:8DE8: 79 9C     .word sub_9C79
- - - - - 0x020DFA 17:8DEA: FA        .byte con_jsr
- - - - - 0x020DFB 17:8DEB: F8 9D     .word sub_9DF8
- - - - - 0x020DFD 17:8DED: FA        .byte con_jsr
- - - - - 0x020DFE 17:8DEE: DD A2     .word sub_A2DD
- - - - - 0x020E00 17:8DF0: F2        .byte con_jmp
- - - - - 0x020E01 17:8DF1: 6E A1     .word loc_A16E

bra_long_case_8F09_01_летит_низкий_мяч:
- D - I - 0x020F19 17:8F09: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x020F21 17:8F11: F3        .byte con_branch, $C6
- D - I - 0x020F23 17:8F13: 02        .byte bra_case_8F15_00 - *
- D - I - 0x020F24 17:8F14: CC        .byte bra_case_8FE0_01 - *

bra_case_8F15_00:
- D - I - 0x020F25 17:8F15: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020F27 17:8F17: 03        .byte bra_case_8F1A_00_block - *
- D - I - 0x020F28 17:8F18: 55        .byte bra_case_8F6D_01_tackle - *
- D - I - 0x020F29 17:8F19: 8F        .byte bra_case_8FA8_02_pass_cut - *

bra_case_8F1A_00_block:
- D - I - 0x020F2A 17:8F1A: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020F2C 17:8F1C: 17        .byte bra_case_8F33_00 - *
- D - I - 0x020F2D 17:8F1D: 20        .byte bra_case_8F3D_01 - *
- D - I - 0x020F2E 17:8F1E: 03        .byte bra_case_8F21_02 - *
- - - - - 0x020F2F 17:8F1F: 0B        .byte bra_case_8F2A_03 - *
- - - - - 0x020F30 17:8F20: 1C        .byte bra_case_8F3C_04_нарушение - *

bra_case_8F21_02:
- D - I - 0x020F31 17:8F21: F3        .byte con_branch, $9B
- D - I - 0x020F33 17:8F23: 29        .byte bra_case_8F4C_00_block - *
- - - - - 0x020F34 17:8F24: 40        .byte bra_case_8F64_01_face_block - *
- - - - - 0x020F35 17:8F25: 02        .byte bra_case_8F27_02_skylab_block - *
- D - I - 0x020F36 17:8F26: 01        .byte bra_case_8F27_03_power_block - *

bra_case_8F27_02_skylab_block:
bra_case_8F27_03_power_block:
- D - I - 0x020F37 17:8F27: F2        .byte con_jmp
- D - I - 0x020F38 17:8F28: 88 8C     .word loc_8C88

bra_case_8F2A_03:
- - - - - 0x020F3A 17:8F2A: F3        .byte con_branch, $9B
- - - - - 0x020F3C 17:8F2C: 2F        .byte bra_case_8F5B_00_block - *
- - - - - 0x020F3D 17:8F2D: 37        .byte bra_case_8F64_01_face_block - *
- - - - - 0x020F3E 17:8F2E: 02        .byte bra_case_8F30_02_skylab_block - *
- - - - - 0x020F3F 17:8F2F: 01        .byte bra_case_8F30_03_power_block - *

bra_case_8F30_02_skylab_block:
bra_case_8F30_03_power_block:
- - - - - 0x020F40 17:8F30: F2        .byte con_jmp
- - - - - 0x020F41 17:8F31: 38 8D     .word loc_8D38

bra_case_8F33_00:
- D - I - 0x020F43 17:8F33: FA        .byte con_jsr
- D - I - 0x020F44 17:8F34: 7A 9F     .word sub_9F7A_спешал_блок
- D - I - 0x020F46 17:8F36: FA        .byte con_jsr
- D - I - 0x020F47 17:8F37: 8F A3     .word sub_A38F
- D - I - 0x020F49 17:8F39: FA        .byte con_jsr
- D - I - 0x020F4A 17:8F3A: 1C A0     .word sub_A01C
bra_case_8F3C_04_нарушение:
- D - I - 0x020F4C 17:8F3C: F0        .byte con_quit

bra_case_8F3D_01:
- D - I - 0x020F4D 17:8F3D: FA        .byte con_jsr
- D - I - 0x020F4E 17:8F3E: 7A 9F     .word sub_9F7A_спешал_блок
- D - I - 0x020F50 17:8F40: FA        .byte con_jsr
- D - I - 0x020F51 17:8F41: 8F A3     .word sub_A38F
- D - I - 0x020F53 17:8F43: FA        .byte con_jsr
- D - I - 0x020F54 17:8F44: 34 A0     .word sub_A034
- D - I - 0x020F56 17:8F46: FA        .byte con_jsr
- D - I - 0x020F57 17:8F47: 25 A0     .word sub_A025
- D - I - 0x020F59 17:8F49: F2        .byte con_jmp
- D - I - 0x020F5A 17:8F4A: 15 A0     .word loc_A015

bra_case_8F4C_00_block:
- D - I - 0x020F5C 17:8F4C: FA        .byte con_jsr
- D - I - 0x020F5D 17:8F4D: 7A 9F     .word sub_9F7A_спешал_блок
- D - I - 0x020F5F 17:8F4F: FA        .byte con_jsr
- D - I - 0x020F60 17:8F50: 8F A3     .word sub_A38F
- D - I - 0x020F62 17:8F52: FA        .byte con_jsr
- D - I - 0x020F63 17:8F53: 3B A0     .word sub_A03B
- D - I - 0x020F65 17:8F55: FA        .byte con_jsr
- D - I - 0x020F66 17:8F56: 23 A0     .word sub_A023
- D - I - 0x020F68 17:8F58: F2        .byte con_jmp
- D - I - 0x020F69 17:8F59: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8F5B_00_block:
- - - - - 0x020F6B 17:8F5B: FA        .byte con_jsr
- - - - - 0x020F6C 17:8F5C: 7A 9F     .word sub_9F7A_спешал_блок
- - - - - 0x020F6E 17:8F5E: FA        .byte con_jsr
- - - - - 0x020F6F 17:8F5F: 8F A3     .word sub_A38F
- - - - - 0x020F71 17:8F61: F2        .byte con_jmp
- - - - - 0x020F72 17:8F62: 9F A1     .word loc_A19F

bra_case_8F64_01_face_block:
- - - - - 0x020F74 17:8F64: FA        .byte con_jsr
- - - - - 0x020F75 17:8F65: 7A 9F     .word sub_9F7A_спешал_блок
loc_8F67:
- D - I - 0x020F77 17:8F67: FA        .byte con_jsr
- D - I - 0x020F78 17:8F68: 65 B4     .word sub_B465
- D - I - 0x020F7A 17:8F6A: F2        .byte con_jmp
- D - I - 0x020F7B 17:8F6B: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8F6D_01_tackle:
- D - I - 0x020F7D 17:8F6D: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020F7F 17:8F6F: 08        .byte bra_case_8F77_00 - *
- D - I - 0x020F80 17:8F70: 11        .byte bra_case_8F81_01 - *
- D - I - 0x020F81 17:8F71: 1F        .byte bra_case_8F90_02 - *
- D - I - 0x020F82 17:8F72: 2D        .byte bra_case_8F9F_03 - *
- - - - - 0x020F83 17:8F73: 0D        .byte bra_case_8F80_04_нарушение - *

bra_case_8F77_00:
- D - I - 0x020F87 17:8F77: FA        .byte con_jsr
- D - I - 0x020F88 17:8F78: E0 A6     .word sub_A6E0
- D - I - 0x020F8A 17:8F7A: FA        .byte con_jsr
- D - I - 0x020F8B 17:8F7B: 8F A3     .word sub_A38F
- D - I - 0x020F8D 17:8F7D: FA        .byte con_jsr
- D - I - 0x020F8E 17:8F7E: 1C A0     .word sub_A01C
bra_case_8F80_04_нарушение:
- D - I - 0x020F90 17:8F80: F0        .byte con_quit

bra_case_8F81_01:
- D - I - 0x020F91 17:8F81: FA        .byte con_jsr
- D - I - 0x020F92 17:8F82: E0 A6     .word sub_A6E0
- D - I - 0x020F94 17:8F84: FA        .byte con_jsr
- D - I - 0x020F95 17:8F85: 8F A3     .word sub_A38F
- D - I - 0x020F97 17:8F87: FA        .byte con_jsr
- D - I - 0x020F98 17:8F88: 34 A0     .word sub_A034
- D - I - 0x020F9A 17:8F8A: FA        .byte con_jsr
- D - I - 0x020F9B 17:8F8B: 25 A0     .word sub_A025
- D - I - 0x020F9D 17:8F8D: F2        .byte con_jmp
- D - I - 0x020F9E 17:8F8E: 15 A0     .word loc_A015

bra_case_8F90_02:
- D - I - 0x020FA0 17:8F90: FA        .byte con_jsr
- D - I - 0x020FA1 17:8F91: E0 A6     .word sub_A6E0
- D - I - 0x020FA3 17:8F93: FA        .byte con_jsr
- D - I - 0x020FA4 17:8F94: 8F A3     .word sub_A38F
- D - I - 0x020FA6 17:8F96: FA        .byte con_jsr
- D - I - 0x020FA7 17:8F97: 3B A0     .word sub_A03B
- D - I - 0x020FA9 17:8F99: FA        .byte con_jsr
- D - I - 0x020FAA 17:8F9A: 23 A0     .word sub_A023
- D - I - 0x020FAC 17:8F9C: F2        .byte con_jmp
- D - I - 0x020FAD 17:8F9D: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8F9F_03:
- D - I - 0x020FAF 17:8F9F: FA        .byte con_jsr
- D - I - 0x020FB0 17:8FA0: E0 A6     .word sub_A6E0
- D - I - 0x020FB2 17:8FA2: FA        .byte con_jsr
- D - I - 0x020FB3 17:8FA3: 8F A3     .word sub_A38F
- D - I - 0x020FB5 17:8FA5: F2        .byte con_jmp
- D - I - 0x020FB6 17:8FA6: 7B A1     .word loc_A17B

bra_case_8FA8_02_pass_cut:
- D - I - 0x020FB8 17:8FA8: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020FBA 17:8FAA: 05        .byte bra_case_8FAF_00 - *
- D - I - 0x020FBB 17:8FAB: 0E        .byte bra_case_8FB9_01 - *
- D - I - 0x020FBC 17:8FAC: 1C        .byte bra_case_8FC8_02 - *
- D - I - 0x020FBD 17:8FAD: 2A        .byte bra_case_8FD7_03 - *
- - - - - 0x020FBE 17:8FAE: 0A        .byte bra_case_8FB8_04_нарушение - *

bra_case_8FAF_00:
- D - I - 0x020FBF 17:8FAF: FA        .byte con_jsr
- D - I - 0x020FC0 17:8FB0: 7F 9C     .word sub_9C7F
- D - I - 0x020FC2 17:8FB2: FA        .byte con_jsr
- D - I - 0x020FC3 17:8FB3: 8F A3     .word sub_A38F
- D - I - 0x020FC5 17:8FB5: FA        .byte con_jsr
- D - I - 0x020FC6 17:8FB6: EA 9F     .word sub_9FEA
bra_case_8FB8_04_нарушение:
- D - I - 0x020FC8 17:8FB8: F0        .byte con_quit

bra_case_8FB9_01:
- D - I - 0x020FC9 17:8FB9: FA        .byte con_jsr
- D - I - 0x020FCA 17:8FBA: 7F 9C     .word sub_9C7F
- D - I - 0x020FCC 17:8FBC: FA        .byte con_jsr
- D - I - 0x020FCD 17:8FBD: 8F A3     .word sub_A38F
- D - I - 0x020FCF 17:8FBF: FA        .byte con_jsr
- D - I - 0x020FD0 17:8FC0: FD 9F     .word sub_9FFD
- D - I - 0x020FD2 17:8FC2: FA        .byte con_jsr
- D - I - 0x020FD3 17:8FC3: F3 9F     .word sub_9FF3
- D - I - 0x020FD5 17:8FC5: F2        .byte con_jmp
- D - I - 0x020FD6 17:8FC6: DE 9F     .word loc_9FDE

bra_case_8FC8_02:
- D - I - 0x020FD8 17:8FC8: FA        .byte con_jsr
- D - I - 0x020FD9 17:8FC9: 7F 9C     .word sub_9C7F
- D - I - 0x020FDB 17:8FCB: FA        .byte con_jsr
- D - I - 0x020FDC 17:8FCC: 8F A3     .word sub_A38F
- D - I - 0x020FDE 17:8FCE: FA        .byte con_jsr
- D - I - 0x020FDF 17:8FCF: 04 A0     .word sub_A004
- D - I - 0x020FE1 17:8FD1: FA        .byte con_jsr
- D - I - 0x020FE2 17:8FD2: F1 9F     .word sub_9FF1
- D - I - 0x020FE4 17:8FD4: F2        .byte con_jmp
- D - I - 0x020FE5 17:8FD5: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_8FD7_03:
- D - I - 0x020FE7 17:8FD7: FA        .byte con_jsr
- D - I - 0x020FE8 17:8FD8: 7F 9C     .word sub_9C7F
- D - I - 0x020FEA 17:8FDA: FA        .byte con_jsr
- D - I - 0x020FEB 17:8FDB: 8F A3     .word sub_A38F
- D - I - 0x020FED 17:8FDD: F2        .byte con_jmp
- D - I - 0x020FEE 17:8FDE: 64 A1     .word loc_A164

bra_case_8FE0_01:
- D - I - 0x020FF0 17:8FE0: F3        .byte con_branch, $82     ; действие защитника
- D - I - 0x020FF2 17:8FE2: 03        .byte bra_case_8FE5_00_block - *
- D - I - 0x020FF3 17:8FE3: 58        .byte bra_case_903B_01_tackle - *
- D - I - 0x020FF4 17:8FE4: 96        .byte bra_case_907A_02_pass_cut - *

bra_case_8FE5_00_block:
- D - I - 0x020FF5 17:8FE5: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x020FF7 17:8FE7: 14        .byte bra_case_8FFB_00 - *
- D - I - 0x020FF8 17:8FE8: 23        .byte bra_case_900B_01 - *
- - - - - 0x020FF9 17:8FE9: 03        .byte bra_case_8FEC_02 - *
- - - - - 0x020FFA 17:8FEA: 08        .byte bra_case_8FF2_03 - *
- - - - - 0x020FFB 17:8FEB: 1F        .byte bra_case_900A_04_нарушение - *

bra_case_8FEC_02:
- - - - - 0x020FFC 17:8FEC: F3        .byte con_branch, $9B
- - - - - 0x020FFE 17:8FEE: 2F        .byte bra_case_901D_00_block - *
- - - - - 0x020FFF 17:8FEF: 09        .byte bra_case_8FF8_01_face_block - *
- - - - - 0x021000 17:8FF0: 2D        .byte bra_case_901D_02_skylab_block - *
- - - - - 0x021001 17:8FF1: 2C        .byte bra_case_901D_03_power_block - *

bra_case_8FF2_03:
- - - - - 0x021002 17:8FF2: F3        .byte con_branch, $9B
- - - - - 0x021004 17:8FF4: 3B        .byte bra_case_902F_00_block - *
- - - - - 0x021005 17:8FF5: 03        .byte bra_case_8FF8_01_face_block - *
- - - - - 0x021006 17:8FF6: 39        .byte bra_case_902F_02_skylab_block - *
- - - - - 0x021007 17:8FF7: 38        .byte bra_case_902F_03_power_block - *

bra_case_8FF8_01_face_block:
- - - - - 0x021008 17:8FF8: F2        .byte con_jmp
- - - - - 0x021009 17:8FF9: 97 8C     .word loc_8C97

bra_case_8FFB_00:
- D - I - 0x02100B 17:8FFB: FA        .byte con_jsr
- D - I - 0x02100C 17:8FFC: 7A 9F     .word sub_9F7A_спешал_блок
- D - I - 0x02100E 17:8FFE: FA        .byte con_jsr
- D - I - 0x02100F 17:8FFF: 8F A3     .word sub_A38F
- D - I - 0x021011 17:9001: FA        .byte con_jsr
- D - I - 0x021012 17:9002: 3B A0     .word sub_A03B
- D - I - 0x021014 17:9004: FA        .byte con_jsr
- D - I - 0x021015 17:9005: DD A2     .word sub_A2DD
- D - I - 0x021017 17:9007: FA        .byte con_jsr
- D - I - 0x021018 17:9008: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_900A_04_нарушение:
- D - I - 0x02101A 17:900A: F0        .byte con_quit

bra_case_900B_01:
- D - I - 0x02101B 17:900B: FA        .byte con_jsr
- D - I - 0x02101C 17:900C: 7A 9F     .word sub_9F7A_спешал_блок
- D - I - 0x02101E 17:900E: FA        .byte con_jsr
- D - I - 0x02101F 17:900F: 8F A3     .word sub_A38F
- D - I - 0x021021 17:9011: FA        .byte con_jsr
- D - I - 0x021022 17:9012: 3B A0     .word sub_A03B
- D - I - 0x021024 17:9014: FA        .byte con_jsr
- D - I - 0x021025 17:9015: DD A2     .word sub_A2DD
- D - I - 0x021027 17:9017: FA        .byte con_jsr
- D - I - 0x021028 17:9018: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x02102A 17:901A: F2        .byte con_jmp
- D - I - 0x02102B 17:901B: 40 A2     .word loc_A240

bra_case_901D_00_block:
bra_case_901D_02_skylab_block:
bra_case_901D_03_power_block:
- - - - - 0x02102D 17:901D: FA        .byte con_jsr
- - - - - 0x02102E 17:901E: 7A 9F     .word sub_9F7A_спешал_блок
- - - - - 0x021030 17:9020: FA        .byte con_jsr
- - - - - 0x021031 17:9021: 8F A3     .word sub_A38F
- - - - - 0x021033 17:9023: FA        .byte con_jsr
- - - - - 0x021034 17:9024: 3B A0     .word sub_A03B
- - - - - 0x021036 17:9026: FA        .byte con_jsr
- - - - - 0x021037 17:9027: DD A2     .word sub_A2DD
- - - - - 0x021039 17:9029: FA        .byte con_jsr
- - - - - 0x02103A 17:902A: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x02103C 17:902C: F2        .byte con_jmp
- - - - - 0x02103D 17:902D: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_902F_00_block:
bra_case_902F_02_skylab_block:
bra_case_902F_03_power_block:
- - - - - 0x02103F 17:902F: FA        .byte con_jsr
- - - - - 0x021040 17:9030: 7A 9F     .word sub_9F7A_спешал_блок
- - - - - 0x021042 17:9032: FA        .byte con_jsr
- - - - - 0x021043 17:9033: 8F A3     .word sub_A38F
- - - - - 0x021045 17:9035: FA        .byte con_jsr
- - - - - 0x021046 17:9036: DD A2     .word sub_A2DD
- - - - - 0x021048 17:9038: F2        .byte con_jmp
- - - - - 0x021049 17:9039: 9F A1     .word loc_A19F

bra_case_903B_01_tackle:
- D - I - 0x02104B 17:903B: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x02104D 17:903D: 05        .byte bra_case_9042_00 - *
- D - I - 0x02104E 17:903E: 14        .byte bra_case_9052_01 - *
- - - - - 0x02104F 17:903F: 25        .byte bra_case_9064_02 - *
- - - - - 0x021050 17:9040: 11        .byte bra_case_9051_03 - *
- - - - - 0x021051 17:9041: 10        .byte bra_case_9051_04_нарушение - *

bra_case_9042_00:
- D - I - 0x021052 17:9042: FA        .byte con_jsr
- D - I - 0x021053 17:9043: E0 A6     .word sub_A6E0
- D - I - 0x021055 17:9045: FA        .byte con_jsr
- D - I - 0x021056 17:9046: 8F A3     .word sub_A38F
- D - I - 0x021058 17:9048: FA        .byte con_jsr
- D - I - 0x021059 17:9049: 3B A0     .word sub_A03B
- D - I - 0x02105B 17:904B: FA        .byte con_jsr
- D - I - 0x02105C 17:904C: DD A2     .word sub_A2DD
- D - I - 0x02105E 17:904E: FA        .byte con_jsr
- D - I - 0x02105F 17:904F: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9051_03:
bra_case_9051_04_нарушение:
- D - I - 0x021061 17:9051: F0        .byte con_quit

bra_case_9052_01:
- D - I - 0x021062 17:9052: FA        .byte con_jsr
- D - I - 0x021063 17:9053: E0 A6     .word sub_A6E0
- D - I - 0x021065 17:9055: FA        .byte con_jsr
- D - I - 0x021066 17:9056: 8F A3     .word sub_A38F
- D - I - 0x021068 17:9058: FA        .byte con_jsr
- D - I - 0x021069 17:9059: 3B A0     .word sub_A03B
- D - I - 0x02106B 17:905B: FA        .byte con_jsr
- D - I - 0x02106C 17:905C: DD A2     .word sub_A2DD
- D - I - 0x02106E 17:905E: FA        .byte con_jsr
- D - I - 0x02106F 17:905F: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x021071 17:9061: F2        .byte con_jmp
- D - I - 0x021072 17:9062: 40 A2     .word loc_A240

bra_case_9064_02:
- - - - - 0x021074 17:9064: FA        .byte con_jsr
- - - - - 0x021075 17:9065: E0 A6     .word sub_A6E0
- - - - - 0x021077 17:9067: FA        .byte con_jsr
- - - - - 0x021078 17:9068: 8F A3     .word sub_A38F
- - - - - 0x02107A 17:906A: FA        .byte con_jsr
- - - - - 0x02107B 17:906B: 3B A0     .word sub_A03B
- - - - - 0x02107D 17:906D: FA        .byte con_jsr
- - - - - 0x02107E 17:906E: DD A2     .word sub_A2DD
- - - - - 0x021080 17:9070: FA        .byte con_jsr
- - - - - 0x021081 17:9071: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021083 17:9073: F2        .byte con_jmp
- - - - - 0x021084 17:9074: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_907A_02_pass_cut:
- D - I - 0x02108A 17:907A: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x02108C 17:907C: 05        .byte bra_case_9081_00 - *
- - - - - 0x02108D 17:907D: 14        .byte bra_case_9091_01 - *
- - - - - 0x02108E 17:907E: 25        .byte bra_case_90A3_02 - *
- - - - - 0x02108F 17:907F: 36        .byte bra_case_90B5_03 - *
- - - - - 0x021090 17:9080: 10        .byte bra_case_9090_04_нарушение - *

bra_case_9081_00:
- D - I - 0x021091 17:9081: FA        .byte con_jsr
- D - I - 0x021092 17:9082: 7F 9C     .word sub_9C7F
- D - I - 0x021094 17:9084: FA        .byte con_jsr
- D - I - 0x021095 17:9085: 8F A3     .word sub_A38F
- D - I - 0x021097 17:9087: FA        .byte con_jsr
- D - I - 0x021098 17:9088: 04 A0     .word sub_A004
- D - I - 0x02109A 17:908A: FA        .byte con_jsr
- D - I - 0x02109B 17:908B: DD A2     .word sub_A2DD
- D - I - 0x02109D 17:908D: FA        .byte con_jsr
- D - I - 0x02109E 17:908E: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9090_04_нарушение:
- D - I - 0x0210A0 17:9090: F0        .byte con_quit

bra_case_9091_01:
- - - - - 0x0210A1 17:9091: FA        .byte con_jsr
- - - - - 0x0210A2 17:9092: 7F 9C     .word sub_9C7F
- - - - - 0x0210A4 17:9094: FA        .byte con_jsr
- - - - - 0x0210A5 17:9095: 8F A3     .word sub_A38F
- - - - - 0x0210A7 17:9097: FA        .byte con_jsr
- - - - - 0x0210A8 17:9098: 04 A0     .word sub_A004
- - - - - 0x0210AA 17:909A: FA        .byte con_jsr
- - - - - 0x0210AB 17:909B: DD A2     .word sub_A2DD
- - - - - 0x0210AD 17:909D: FA        .byte con_jsr
- - - - - 0x0210AE 17:909E: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x0210B0 17:90A0: F2        .byte con_jmp
- - - - - 0x0210B1 17:90A1: 40 A2     .word loc_A240

bra_case_90A3_02:
- - - - - 0x0210B3 17:90A3: FA        .byte con_jsr
- - - - - 0x0210B4 17:90A4: 7F 9C     .word sub_9C7F
- - - - - 0x0210B6 17:90A6: FA        .byte con_jsr
- - - - - 0x0210B7 17:90A7: 8F A3     .word sub_A38F
- - - - - 0x0210B9 17:90A9: FA        .byte con_jsr
- - - - - 0x0210BA 17:90AA: 04 A0     .word sub_A004
- - - - - 0x0210BC 17:90AC: FA        .byte con_jsr
- - - - - 0x0210BD 17:90AD: DD A2     .word sub_A2DD
- - - - - 0x0210BF 17:90AF: FA        .byte con_jsr
- - - - - 0x0210C0 17:90B0: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x0210C2 17:90B2: F2        .byte con_jmp
- - - - - 0x0210C3 17:90B3: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_90B5_03:
- - - - - 0x0210C5 17:90B5: FA        .byte con_jsr
- - - - - 0x0210C6 17:90B6: 7F 9C     .word sub_9C7F
- - - - - 0x0210C8 17:90B8: FA        .byte con_jsr
- - - - - 0x0210C9 17:90B9: 8F A3     .word sub_A38F
- - - - - 0x0210CB 17:90BB: FA        .byte con_jsr
- - - - - 0x0210CC 17:90BC: DD A2     .word sub_A2DD
- - - - - 0x0210CE 17:90BE: F2        .byte con_jmp
- - - - - 0x0210CF 17:90BF: 64 A1     .word loc_A164



_scenario_91D3_13:
- D - I - 0x0211E3 17:91D3: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x0211E5 17:91D5: 0A        .byte bra_case_91DF_00 - *
- D - I - 0x0211E6 17:91D6: 01        .byte bra_case_91D7_01 - *

bra_case_91D7_01:
- D - I - 0x0211E7 17:91D7: F3        .byte con_branch, $16
- D - I - 0x0211E9 17:91D9: 50 93     .word bra_long_case_9350_00
- D - I - 0x0211EB 17:91DB: 5A 93     .word bra_long_case_935A_01
- D - I - 0x0211ED 17:91DD: DB 9B     .word bra_long_case_9BDB_02

bra_case_91DF_00:
- D - I - 0x0211EF 17:91DF: F3        .byte con_branch, $16
- D - I - 0x0211F1 17:91E1: 3C 93     .word bra_long_case_933C_00
- D - I - 0x0211F3 17:91E3: 41 93     .word bra_long_case_9341_01
- D - I - 0x0211F5 17:91E5: DF 9B     .word bra_long_case_9BDF_02



_scenario_91EA_0E:
- D - I - 0x0211FA 17:91EA: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x0211FC 17:91EC: F3        .byte con_branch, $04     ; мяч у атакующего/низкий, или высокий
- D - I - 0x0211FE 17:91EE: 9B B2     .word bra_long_case_B29B_00
- D - I - 0x021200 17:91F0: 64 AE     .word bra_long_case_AE64_01_pass



_scenario_91F2_01:
- D - I - 0x021202 17:91F2: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x021204 17:91F4: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021206 17:91F6: 02        .byte bra_case_91F8_00 - *
- D - I - 0x021207 17:91F7: 05        .byte bra_case_91FC_01 - *

bra_case_91F8_00:
- D - I - 0x021208 17:91F8: FA        .byte con_jmp
- D - I - 0x021209 17:91F9: E2 9D     .word loc_9DE2

bra_case_91FC_01:
- D - I - 0x02120C 17:91FC: F2        .byte con_jmp
- D - I - 0x02120D 17:91FD: 3C 9D     .word loc_9D3C



_scenario_91FF_02:
- D - I - 0x02120F 17:91FF: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x021211 17:9201: F3        .byte con_branch, $86     ; защитник кипер или нет
- D - I - 0x021213 17:9203: 0C        .byte bra_case_920F_00_это_не_кипер - *
- D - I - 0x021214 17:9204: 43        .byte bra_case_9247_01_это_кипер - *



_scenario_9205_0F:
- D - I - 0x021215 17:9205: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x021217 17:9207: F3        .byte con_branch, $43
- D - I - 0x021219 17:9209: 17 92     .word bra_long_case_9217_00
- D - I - 0x02121B 17:920B: 17 92     .word bra_long_case_9217_01
- D - I - 0x02121D 17:920D: 87 BD     .word bra_long_case_BD87_02

bra_case_920F_00_это_не_кипер:
- D - I - 0x02121F 17:920F: F3        .byte con_branch, $35
- D - I - 0x021221 17:9211: 17 92     .word bra_long_case_9217_00
- D - I - 0x021223 17:9213: 17 92     .word bra_long_case_9217_01
- D - I - 0x021225 17:9215: 87 BD     .word bra_long_case_BD87_02

bra_long_case_9217_00:
bra_long_case_9217_01:
- D - I - 0x021227 17:9217: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021229 17:9219: 02        .byte bra_case_921B_00 - *
- D - I - 0x02122A 17:921A: 17        .byte bra_case_9231_01 - *

bra_case_921B_00:
- D - I - 0x02122B 17:921B: F3        .byte con_branch, $85     ; порядковый номер защитника
- D - I - 0x02122D 17:921D: 05        .byte bra_case_9222_00_защитник_1 - *
- D - I - 0x02122E 17:921E: 07        .byte bra_case_9225_01_защитник_2 - *
- D - I - 0x02122F 17:921F: 09        .byte bra_case_9228_02_защитник_3 - *
- D - I - 0x021230 17:9220: 0B        .byte bra_case_922B_03_защитник_4 - *
- - - - - 0x021231 17:9221: 0D        .byte bra_case_922E_04_защитник_5 - *

bra_case_9222_00_защитник_1:
- D - I - 0x021232 17:9222: F2        .byte con_jmp
- D - I - 0x021233 17:9223: 85 9C     .word loc_9C85

bra_case_9225_01_защитник_2:
- D - I - 0x021235 17:9225: F2        .byte con_jmp
- D - I - 0x021236 17:9226: 91 9C     .word loc_9C91

bra_case_9228_02_защитник_3:
- D - I - 0x021238 17:9228: F2        .byte con_jmp
- D - I - 0x021239 17:9229: 9D 9C     .word loc_9C9D

bra_case_922B_03_защитник_4:
- D - I - 0x02123B 17:922B: F2        .byte con_jmp
- D - I - 0x02123C 17:922C: 97 9C     .word loc_9C97

bra_case_922E_04_защитник_5:
- - - - - 0x02123E 17:922E: F2        .byte con_jmp
- - - - - 0x02123F 17:922F: 91 9C     .word loc_9C91

bra_case_9231_01:
- D - I - 0x021241 17:9231: F3        .byte con_branch, $85     ; порядковый номер защитника
- D - I - 0x021243 17:9233: 05        .byte bra_case_9238_00_защитник_1 - *
- D - I - 0x021244 17:9234: 07        .byte bra_case_923B_01_защитник_2 - *
- D - I - 0x021245 17:9235: 09        .byte bra_case_923E_02_защитник_3 - *
- D - I - 0x021246 17:9236: 0B        .byte bra_case_9241_03_защитник_4 - *
- - - - - 0x021247 17:9237: 0D        .byte bra_case_9244_04_защитник_5 - *

bra_case_9238_00_защитник_1:
- D - I - 0x021248 17:9238: F2        .byte con_jmp
- D - I - 0x021249 17:9239: 61 9C     .word loc_9C61

bra_case_923B_01_защитник_2:
- D - I - 0x02124B 17:923B: F2        .byte con_jmp
- D - I - 0x02124C 17:923C: 6D 9C     .word loc_9C6D

bra_case_923E_02_защитник_3:
- D - I - 0x02124E 17:923E: F2        .byte con_jmp
- D - I - 0x02124F 17:923F: 73 9C     .word loc_9C73

bra_case_9241_03_защитник_4:
- D - I - 0x021251 17:9241: F2        .byte con_jmp
- D - I - 0x021252 17:9242: 67 9C     .word loc_9C67

bra_case_9244_04_защитник_5:
- - - - - 0x021254 17:9244: F2        .byte con_jmp
- - - - - 0x021255 17:9245: 6D 9C     .word loc_9C6D

bra_case_9247_01_это_кипер:
- D - I - 0x021257 17:9247: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021259 17:9249: F3        .byte con_branch, $44     ; делает ли кипер dive
- D - I - 0x02125B 17:924B: 4F 92     .word bra_long_case_924F_00_кипер_делает_dive
- D - I - 0x02125D 17:924D: 90 BD     .word bra_long_case_BD90_01_кипер_ждет_в_воротах

bra_long_case_924F_00_кипер_делает_dive:
- D - I - 0x02125F 17:924F: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021261 17:9251: 02        .byte bra_case_9253_00_нижний_dive - *
- D - I - 0x021262 17:9252: 04        .byte bra_case_9256_01_верхний_dive - *

bra_case_9253_00_нижний_dive:
- D - I - 0x0223BB 11:A3AB: F5        .byte con_mirror_off
- D - I - 0x0223BC 11:A3AC: FC        .byte con_moving_bg, $04
- D - I - 0x0223BE 11:A3AE: 2D        .byte con_pause + $2D
- D - I - 0x0223BF 11:A3AF: 58        .byte con_bg + $58
- D - I - 0x0223C0 11:A3B0: 04        .byte con_animation + $04
- D - I - 0x0223C1 11:A3B1: 3A        .byte con_cloud + $3A
- D - I - 0x0223C2 11:A3B2: FB        .byte con_rts

bra_case_9256_01_верхний_dive:
- D - I - 0x0223B3 11:A3A3: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0223B6 11:A3A6: 3C        .byte con_pause + $3C
- D - I - 0x0223B7 11:A3A7: 2F        .byte con_bg + $2F
- D - I - 0x0223B8 11:A3A8: 57        .byte con_animation + $57
- D - I - 0x0223B9 11:A3A9: 3A        .byte con_cloud + $3A
- D - I - 0x0223BA 11:A3AA: FB        .byte con_rts



_scenario_9259_05_10:
- D - I - 0x021269 17:9259: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x02126B 17:925B: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x02126D 17:925D: 05        .byte bra_case_9262_00_защитник_выживет - *
- D - I - 0x02126E 17:925E: 01        .byte bra_case_925F_01_защитник_убьется - *

bra_case_925F_01_защитник_убьется:
- D - I - 0x02126F 17:925F: FA        .byte con_jsr
- D - I - 0x021270 17:9260: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9262_00_защитник_выживет:
- D - I - 0x021272 17:9262: F0        .byte con_quit



_scenario_9263_06:
- D - I - 0x021273 17:9263: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x021275 17:9265: F3        .byte con_branch, $86     ; защитник кипер или нет
- D - I - 0x021277 17:9267: 02        .byte bra_case_9269_00_это_не_кипер - *
- D - I - 0x021278 17:9268: 0D        .byte bra_case_9275_01_это_кипер - *



_scenario_9269_11:
bra_case_9269_00_это_не_кипер:
- D - I - 0x021279 17:9269: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x02127B 17:926B: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x02127D 17:926D: 07        .byte bra_case_9274_00_защитник_выживет - *
- D - I - 0x02127E 17:926E: 01        .byte bra_case_926F_01_защитник_убьется - *

bra_case_926F_01_защитник_убьется:
- D - I - 0x02127F 17:926F: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x021281 17:9271: FA        .byte con_jsr
- D - I - 0x021282 17:9272: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9274_00_защитник_выживет:
- D - I - 0x021284 17:9274: F0        .byte con_quit

bra_case_9275_01_это_кипер:
- D - I - 0x021285 17:9275: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x021287 17:9277: 07        .byte bra_case_927E_00_защитник_выживет - *
- D - I - 0x021288 17:9278: 01        .byte bra_case_9279_01_защитник_убьется - *

bra_case_9279_01_защитник_убьется:
- D - I - 0x021289 17:9279: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x02128B 17:927B: FA        .byte con_jsr
- D - I - 0x02128C 17:927C: B5 9F     .word sub_9FB5_убийство_кипера
bra_case_927E_00_защитник_выживет:
- D - I - 0x02128E 17:927E: F0        .byte con_quit



_scenario_927F_12:
- D - I - 0x02128F 17:927F: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021291 17:9281: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021293 17:9283: 08        .byte bra_case_928B_00 - *
- D - I - 0x021294 17:9284: 0F        .byte bra_case_9293_01 - *



_scenario_9285_07:
- D - I - 0x021295 17:9285: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021297 17:9287: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021299 17:9289: 06        .byte bra_case_928F_00 - *
- D - I - 0x02129A 17:928A: 0D        .byte bra_case_9297_01 - *

bra_case_928B_00:
- D - I - 0x02129B 17:928B: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x02129D 17:928D: 0E        .byte bra_case_929B_00_защитник_выживет - *
- - - - - 0x02129E 17:928E: 17        .byte bra_case_92A5_01_защитник_убьется - *

bra_case_928F_00:
- D - I - 0x02129F 17:928F: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x0212A1 17:9291: 4A        .byte bra_case_92DB_00_защитник_выживет - *
- D - I - 0x0212A2 17:9292: 50        .byte bra_case_92E2_01_защитник_убьется - *

bra_case_9293_01:
- D - I - 0x0212A3 17:9293: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x0212A5 17:9295: 1A        .byte bra_case_92AF_00_защитник_выживет - *
- D - I - 0x0212A6 17:9296: 23        .byte bra_case_92B9_01_защитник_убьется - *

bra_case_9297_01:
- D - I - 0x0212A7 17:9297: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x0212A9 17:9299: 50        .byte bra_case_92E9_00_защитник_выживет - *
- D - I - 0x0212AA 17:929A: 56        .byte bra_case_92F0_01_защитник_убьется - *

bra_case_929B_00_защитник_выживет:
- D - I - 0x0212AB 17:929B: F3        .byte con_branch, $0F
- D - I - 0x0212AD 17:929D: CE 9B     .word bra_long_case_9BCE_00
- D - I - 0x0212AF 17:929F: CE 9B     .word bra_long_case_9BCE_01
- D - I - 0x0212B1 17:92A1: 0B 93     .word bra_long_case_930B_02
- D - I - 0x0212B3 17:92A3: C3 92     .word bra_long_case_92C3_03

bra_case_92A5_01_защитник_убьется:
- - - - - 0x0212B5 17:92A5: F3        .byte con_branch, $0F
- - - - - 0x0212B7 17:92A7: CE 9B     .word bra_long_case_9BCE_00
- - - - - 0x0212B9 17:92A9: CE 9B     .word bra_long_case_9BCE_01
- - - - - 0x0212BB 17:92AB: 0B 93     .word bra_long_case_930B_02
- - - - - 0x0212BD 17:92AD: C9 92     .word bra_long_case_92C9_03

bra_case_92AF_00_защитник_выживет:
- D - I - 0x0212BF 17:92AF: F3        .byte con_branch, $0F
- D - I - 0x0212C1 17:92B1: CE 9B     .word bra_long_case_9BCE_00
- D - I - 0x0212C3 17:92B3: CE 9B     .word bra_long_case_9BCE_01
- D - I - 0x0212C5 17:92B5: 0B 93     .word bra_long_case_930B_02
- D - I - 0x0212C7 17:92B7: CF 92     .word bra_long_case_92CF_03

bra_case_92B9_01_защитник_убьется:
- D - I - 0x0212C9 17:92B9: F3        .byte con_branch, $0F
- - - - - 0x0212CB 17:92BB: CE 9B     .word bra_long_case_9BCE_00
- - - - - 0x0212CD 17:92BD: CE 9B     .word bra_long_case_9BCE_01
- D - I - 0x0212CF 17:92BF: 0B 93     .word bra_long_case_930B_02
- D - I - 0x0212D1 17:92C1: D5 92     .word bra_long_case_92D5_03

bra_long_case_92C3_03:
- D - I - 0x0212D3 17:92C3: F3        .byte con_branch, $15
- - - - - 0x0212D5 17:92C5: 1F 93     .word bra_long_case_931F_00
- D - I - 0x0212D7 17:92C7: D5 9B     .word bra_long_case_9BD5_01

bra_long_case_92C9_03:
- - - - - 0x0212D9 17:92C9: F3        .byte con_branch, $15
- - - - - 0x0212DB 17:92CB: 1F 93     .word bra_long_case_931F_00
- - - - - 0x0212DD 17:92CD: D5 9B     .word bra_long_case_9BD5_01

bra_long_case_92CF_03:
- D - I - 0x0212DF 17:92CF: F3        .byte con_branch, $15
- D - I - 0x0212E1 17:92D1: 0F 93     .word bra_long_case_930F_00
- D - I - 0x0212E3 17:92D3: CF 9B     .word bra_long_case_9BCF_01

bra_long_case_92D5_03:
- D - I - 0x0212E5 17:92D5: F3        .byte con_branch, $15
- - - - - 0x0212E7 17:92D7: 0F 93     .word bra_long_case_930F_00
- D - I - 0x0212E9 17:92D9: CF 9B     .word bra_long_case_9BCF_01

bra_case_92DB_00_защитник_выживет:
- D - I - 0x0212EB 17:92DB: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x0212ED 17:92DD: 31        .byte bra_case_930E_00 - *
- D - I - 0x0212EE 17:92DE: 30        .byte bra_case_930E_01 - *
- D - I - 0x0212EF 17:92DF: 2C        .byte bra_case_930B_02 - *
- D - I - 0x0212F0 17:92E0: 17        .byte bra_case_92F7_03 - *
- D - I - 0x0212F1 17:92E1: 37        .byte bra_case_9318_04_нарушение - *

bra_case_92E2_01_защитник_убьется:
- D - I - 0x0212F2 17:92E2: F3        .byte con_branch, $83     ; результат действия защитника
- - - - - 0x0212F4 17:92E4: 2A        .byte bra_case_930E_00 - *
- - - - - 0x0212F5 17:92E5: 29        .byte bra_case_930E_01 - *
- D - I - 0x0212F6 17:92E6: 25        .byte bra_case_930B_02 - *
- - - - - 0x0212F7 17:92E7: 15        .byte bra_case_92FC_03 - *
- - - - - 0x0212F8 17:92E8: 30        .byte bra_case_9318_04_нарушение - *

bra_case_92E9_00_защитник_выживет:
- D - I - 0x0212F9 17:92E9: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x0212FB 17:92EB: 23        .byte bra_case_930E_00 - *
- D - I - 0x0212FC 17:92EC: 22        .byte bra_case_930E_01 - *
- D - I - 0x0212FD 17:92ED: 1E        .byte bra_case_930B_02 - *
- D - I - 0x0212FE 17:92EE: 13        .byte bra_case_9301_03 - *
- D - I - 0x0212FF 17:92EF: 29        .byte bra_case_9318_04_нарушение - *

bra_case_92F0_01_защитник_убьется:
- D - I - 0x021300 17:92F0: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x021302 17:92F2: 1C        .byte bra_case_930E_00 - *
- D - I - 0x021303 17:92F3: 1B        .byte bra_case_930E_01 - *
- - - - - 0x021304 17:92F4: 17        .byte bra_case_930B_02 - *
- D - I - 0x021305 17:92F5: 11        .byte bra_case_9306_03 - *
- - - - - 0x021306 17:92F6: 22        .byte bra_case_9318_04_нарушение - *

bra_case_92F7_03:
- D - I - 0x021307 17:92F7: F3        .byte con_branch, $88
- - - - - 0x021309 17:92F9: 26        .byte bra_case_931F_00 - *
- D - I - 0x02130A 17:92FA: 28        .byte bra_case_9322_01 - *
- D - I - 0x02130B 17:92FB: 2A        .byte bra_case_9325_02 - *

bra_case_92FC_03:
- - - - - 0x02130C 17:92FC: F3        .byte con_branch, $88
- - - - - 0x02130E 17:92FE: 11        .byte bra_case_930F_00 - *
- - - - - 0x02130F 17:92FF: 29        .byte bra_case_9328_01 - *
- - - - - 0x021310 17:9300: 15        .byte bra_case_9315_02 - *

bra_case_9301_03:
- D - I - 0x021311 17:9301: F3        .byte con_branch, $88
- D - I - 0x021313 17:9303: 0C        .byte bra_case_930F_00 - *
- D - I - 0x021314 17:9304: 0E        .byte bra_case_9312_01 - *
- D - I - 0x021315 17:9305: 10        .byte bra_case_9315_02 - *

bra_case_9306_03:
- D - I - 0x021316 17:9306: F3        .byte con_branch, $88
- - - - - 0x021318 17:9308: 07        .byte bra_case_930F_00 - *
- - - - - 0x021319 17:9309: 12        .byte bra_case_931B_01 - *
- D - I - 0x02131A 17:930A: 0B        .byte bra_case_9315_02 - *

bra_long_case_930B_02:
bra_case_930B_02:
- D - I - 0x02131B 17:930B: FA        .byte con_jsr
- D - I - 0x02131C 17:930C: 71 A3     .word sub_A371_мяч_улетает_в_сторону
bra_case_930E_00:
bra_case_930E_01:
- D - I - 0x02131E 17:930E: F0        .byte con_quit

bra_long_case_930F_00:
bra_case_930F_00:
- D - I - 0x02131F 17:930F: F2        .byte con_jmp
- D - I - 0x021320 17:9310: 6E A1     .word loc_A16E

bra_case_9312_01:
- D - I - 0x021322 17:9312: F2        .byte con_jmp
- D - I - 0x021323 17:9313: 97 A1     .word loc_A197

bra_case_9315_02:
- D - I - 0x021325 17:9315: F2        .byte con_jmp
- D - I - 0x021326 17:9316: 83 A0     .word loc_A083

bra_case_9318_04_нарушение:
- D - I - 0x021328 17:9318: F2        .byte con_jmp
- D - I - 0x021329 17:9319: 5B A3     .word loc_A35B_нарушение

bra_case_931B_01:
- - - - - 0x02132B 17:931B: FA        .byte con_jsr
- - - - - 0x02132C 17:931C: 97 A1     .word sub_A197
- - - - - 0x02132E 17:931E: F0        .byte con_quit

bra_long_case_931F_00:
bra_case_931F_00:
- - - - - 0x02132F 17:931F: F2        .byte con_jmp
- - - - - 0x021330 17:9320: 64 A1     .word loc_A164

bra_case_9322_01:
- D - I - 0x021332 17:9322: F2        .byte con_jmp
- D - I - 0x021333 17:9323: 8D A1     .word loc_A18D

bra_case_9325_02:
- D - I - 0x021335 17:9325: F2        .byte con_jmp
- D - I - 0x021336 17:9326: 79 A0     .word loc_A079

bra_case_9328_01:
- - - - - 0x021338 17:9328: FA        .byte con_jsr
- - - - - 0x021339 17:9329: 8D A1     .word sub_A18D
- - - - - 0x02133B 17:932B: F0        .byte con_quit



_scenario_932C_08:
- D - I - 0x02133C 17:932C: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x02133E 17:932E: 02        .byte bra_case_9330_00 - *
- D - I - 0x02133F 17:932F: 07        .byte bra_case_9336_01 - *

bra_case_9330_00:
- D - I - 0x021340 17:9330: F3        .byte con_branch, $89     ; действие атаки на штрафной
- D - I - 0x021342 17:9332: 14        .byte bra_case_9346_00_shoot - *
- D - I - 0x021343 17:9333: 09        .byte bra_case_933C_01_pass - *
- D - I - 0x021344 17:9334: 0D        .byte bra_case_9341_02_trap - *
- D - I - 0x021345 17:9335: 16        .byte bra_case_934B_03_through - *

bra_case_9336_01:
- D - I - 0x021346 17:9336: F3        .byte con_branch, $89     ; действие атаки на штрафной
- D - I - 0x021348 17:9338: 27        .byte bra_case_935F_00_shoot - *
- D - I - 0x021349 17:9339: 17        .byte bra_case_9350_01_pass - *
- D - I - 0x02134A 17:933A: 1B        .byte bra_case_9355_02_dribble - *
- D - I - 0x02134B 17:933B: 29        .byte bra_case_9364_03_1_2_pass - *

bra_long_case_933C_00:
bra_case_933C_01_pass:
- D - I - 0x02134C 17:933C: FD        .byte con_mirror_condition, $00
- D - I - 0x02134E 17:933E: F2        .byte con_jmp
- D - I - 0x02134F 17:933F: 45 9E     .word loc_9E45

bra_long_case_9341_01:
bra_case_9341_02_trap:
- D - I - 0x021351 17:9341: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021353 17:9343: F2        .byte con_jmp
- D - I - 0x021354 17:9344: C2 B2     .word loc_B2C2

bra_case_9346_00_shoot:
- D - I - 0x021356 17:9346: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021358 17:9348: F2        .byte con_jmp
- D - I - 0x021359 17:9349: 9A 9D     .word loc_9D9A_выбор_анимации_удара_по_низкому_мячу

bra_case_934B_03_through:
- D - I - 0x02135B 17:934B: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02135D 17:934D: F2        .byte con_jmp
- D - I - 0x02135E 17:934E: 42 B4     .word loc_B442

bra_long_case_9350_00:
bra_case_9350_01_pass:
- D - I - 0x021360 17:9350: FD        .byte con_mirror_condition, $00
- D - I - 0x021362 17:9352: F2        .byte con_jmp
- D - I - 0x021363 17:9353: 4F 9E     .word loc_9E4F

bra_case_9355_02_dribble:
- D - I - 0x021365 17:9355: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021367 17:9357: F2        .byte con_jmp
- D - I - 0x021368 17:9358: CC B2     .word loc_B2CC

bra_long_case_935A_01:
- D - I - 0x02136A 17:935A: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02136C 17:935C: F2        .byte con_jmp
- D - I - 0x02136D 17:935D: D4 B2     .word loc_B2D4

bra_case_935F_00_shoot:
- D - I - 0x02136F 17:935F: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021371 17:9361: F2        .byte con_jmp
- D - I - 0x021372 17:9362: 52 9D     .word loc_9D52_выбор_анимации_удара_по_высокому_мячу

bra_case_9364_03_1_2_pass:
- D - I - 0x021374 17:9364: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021376 17:9366: F2        .byte con_jmp
- D - I - 0x021377 17:9367: 3D B4     .word loc_B43D



_scenario_9369_09:
- D - I - 0x021379 17:9369: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02137B 17:936B: FA        .byte con_jsr
- D - I - 0x02137C 17:936C: F6 9E     .word sub_9EF6_выбор_анимации_полета_удара
- D - I - 0x02137E 17:936E: F3        .byte con_branch, $02     ; действие защитника (кипера)
- D - I - 0x021380 17:9370: 29 95     .word bra_long_case_9529_00_словить
- D - I - 0x021382 17:9372: 76 93     .word bra_long_case_9376_01_отбить
- D - I - 0x021384 17:9374: 70 94     .word bra_long_case_9470_02_от_штанги

bra_long_case_9376_01_отбить:
- D - I - 0x021386 17:9376: FA        .byte con_jsr
- D - I - 0x021387 17:9377: 9C 9F     .word sub_9F9C_крит_кипера
- D - I - 0x021389 17:9379: F3        .byte con_branch, $45
- D - I - 0x02138B 17:937B: 7F 93     .word bra_long_case_937F_00
- D - I - 0x02138D 17:937D: 28 94     .word bra_long_case_9428_01

bra_long_case_937F_00:
- D - I - 0x02138F 17:937F: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x021391 17:9381: 08        .byte bra_case_9389_00 - *
- D - I - 0x021392 17:9382: 03        .byte bra_case_9385_01 - *
- D - I - 0x021393 17:9383: 31        .byte bra_case_93B4_02 - *
- D - I - 0x021394 17:9384: 6D        .byte bra_case_93F1_03 - *

bra_case_9385_01:
- D - I - 0x021395 17:9385: F3        .byte con_branch, $8C
- D - I - 0x021397 17:9387: 02        .byte bra_case_9389_00 - *
- D - I - 0x021398 17:9388: 26        .byte bra_case_93AE_01 - *

bra_case_9389_00:
- D - I - 0x021399 17:9389: F3        .byte con_branch, $8D
- D - I - 0x02139B 17:938B: 05        .byte bra_case_9390_00 - *
- D - I - 0x02139C 17:938C: 0A        .byte bra_case_9396_01 - *
- D - I - 0x02139D 17:938D: 0F        .byte bra_case_939C_02 - *
- D - I - 0x02139E 17:938E: 14        .byte bra_case_93A2_03 - *
- D - I - 0x02139F 17:938F: 19        .byte bra_case_93A8_04 - *

bra_case_9390_00:
- D - I - 0x0213A0 17:9390: FA        .byte con_jsr
- D - I - 0x0213A1 17:9391: 0E A1     .word sub_A10E
- D - I - 0x0213A3 17:9393: F2        .byte con_jmp
- D - I - 0x0213A4 17:9394: 0D 97     .word loc_970D

bra_case_9396_01:
- D - I - 0x0213A6 17:9396: FA        .byte con_jsr
- D - I - 0x0213A7 17:9397: 0E A1     .word sub_A10E
- D - I - 0x0213A9 17:9399: F2        .byte con_jmp
- D - I - 0x0213AA 17:939A: 16 97     .word loc_9716

bra_case_939C_02:
- D - I - 0x0213AC 17:939C: FA        .byte con_jsr
- D - I - 0x0213AD 17:939D: 0E A1     .word sub_A10E
- D - I - 0x0213AF 17:939F: F2        .byte con_jmp
- D - I - 0x0213B0 17:93A0: 22 97     .word loc_9722

bra_case_93A2_03:
- D - I - 0x0213B2 17:93A2: FA        .byte con_jsr
- D - I - 0x0213B3 17:93A3: 0E A1     .word sub_A10E
- D - I - 0x0213B5 17:93A5: F2        .byte con_jmp
- D - I - 0x0213B6 17:93A6: 31 97     .word loc_9731

bra_case_93A8_04:
- D - I - 0x0213B8 17:93A8: FA        .byte con_jsr
- D - I - 0x0213B9 17:93A9: 0E A1     .word sub_A10E
- D - I - 0x0213BB 17:93AB: F2        .byte con_jmp
- D - I - 0x0213BC 17:93AC: 43 97     .word loc_9743

bra_case_93AE_01:
- D - I - 0x0213BE 17:93AE: FA        .byte con_jsr
- D - I - 0x0213BF 17:93AF: 0E A1     .word sub_A10E
- D - I - 0x0213C1 17:93B1: F2        .byte con_jmp
- D - I - 0x0213C2 17:93B2: 55 97     .word loc_9755

bra_case_93B4_02:
- D - I - 0x0213C4 17:93B4: FF        .byte con_drive, con_overhead
- D - I - 0x0213C6 17:93B6: BE 93     .word ofs_93BE_00
- D - I - 0x0213C8 17:93B8: C4 93     .word ofs_93C4_01
- D - I - 0x0213CA 17:93BA: D0 93     .word ofs_93D0_02
- - - - - 0x0213CC 17:93BC: DF 93     .word ofs_93DF_03

ofs_93BE_00:
- D - I - 0x0213CE 17:93BE: FA        .byte con_jsr
- D - I - 0x0213CF 17:93BF: 4B A1     .word sub_A14B
- D - I - 0x0213D1 17:93C1: F2        .byte con_jmp
- D - I - 0x0213D2 17:93C2: 72 95     .word loc_9572

ofs_93C4_01:
- D - I - 0x0213D4 17:93C4: FA        .byte con_jsr
- D - I - 0x0213D5 17:93C5: 4B A1     .word sub_A14B
- D - I - 0x0213D7 17:93C7: FA        .byte con_jsr
- D - I - 0x0213D8 17:93C8: 08 A3     .word sub_A308
- D - I - 0x0213DA 17:93CA: FA        .byte con_jsr
- D - I - 0x0213DB 17:93CB: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- D - I - 0x0213DD 17:93CD: F2        .byte con_jmp
- D - I - 0x0213DE 17:93CE: 22 B8     .word loc_B822

ofs_93D0_02:
- D - I - 0x0213E0 17:93D0: FA        .byte con_jsr
- D - I - 0x0213E1 17:93D1: 2E B8     .word sub_B82E
- D - I - 0x0213E3 17:93D3: FA        .byte con_jsr
- D - I - 0x0213E4 17:93D4: 4B A1     .word sub_A14B
- D - I - 0x0213E6 17:93D6: FA        .byte con_jsr
- D - I - 0x0213E7 17:93D7: 08 A3     .word sub_A308
- D - I - 0x0213E9 17:93D9: FA        .byte con_jsr
- D - I - 0x0213EA 17:93DA: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- D - I - 0x0213EC 17:93DC: F2        .byte con_jmp
- D - I - 0x0213ED 17:93DD: 3A B8     .word loc_B83A

ofs_93DF_03:
; bzk мусор драйв оверхеда
- - - - - 0x0213EF 17:93DF: FA        .byte con_jsr
- - - - - 0x0213F0 17:93E0: 2E B8     .word sub_B82E
- - - - - 0x0213F2 17:93E2: FA        .byte con_jsr
- - - - - 0x0213F3 17:93E3: 4B A1     .word sub_A14B
- - - - - 0x0213F5 17:93E5: FA        .byte con_jsr
- - - - - 0x0213F6 17:93E6: 08 A3     .word sub_A308
- - - - - 0x0213F8 17:93E8: FA        .byte con_jsr
- - - - - 0x0213F9 17:93E9: 48 B8     .word sub_B848
- - - - - 0x0213FB 17:93EB: FA        .byte con_jsr
- - - - - 0x0213FC 17:93EC: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- - - - - 0x0213FE 17:93EE: F2        .byte con_jmp
- - - - - 0x0213FF 17:93EF: 59 B8     .word loc_B859_катсцена_озарения

loc_93F1:
bra_case_93F1_03:
- D - I - 0x021401 17:93F1: FF        .byte con_drive, con_overhead
- D - I - 0x021403 17:93F3: FB 93     .word ofs_93FB_00
- - - - - 0x021405 17:93F5: 04 94     .word ofs_9404_01
- - - - - 0x021407 17:93F7: 0D 94     .word ofs_940D_02
- D - I - 0x021409 17:93F9: 19 94     .word ofs_9419_03

ofs_93FB_00:
- D - I - 0x02140B 17:93FB: FA        .byte con_jsr
- D - I - 0x02140C 17:93FC: 31 A1     .word sub_A131
- D - I - 0x02140E 17:93FE: FA        .byte con_jsr
- D - I - 0x02140F 17:93FF: 6A A3     .word sub_A36A_кипер_идеально_засейвил
- D - I - 0x021411 17:9401: F2        .byte con_jmp
- D - I - 0x021412 17:9402: F0 9E     .word loc_9EF0

ofs_9404_01:
- - - - - 0x021414 17:9404: FA        .byte con_jsr
- - - - - 0x021415 17:9405: 22 B8     .word sub_B822
- - - - - 0x021417 17:9407: FA        .byte con_jsr
- - - - - 0x021418 17:9408: 31 A1     .word sub_A131
- - - - - 0x02141A 17:940A: F2        .byte con_jmp
- - - - - 0x02141B 17:940B: 6A A3     .word loc_A36A_кипер_идеально_засейвил

ofs_940D_02:
- - - - - 0x02141D 17:940D: FA        .byte con_jsr
- - - - - 0x02141E 17:940E: 2E B8     .word sub_B82E
- - - - - 0x021420 17:9410: FA        .byte con_jsr
- - - - - 0x021421 17:9411: 31 A1     .word sub_A131
- - - - - 0x021423 17:9413: FA        .byte con_jsr
- - - - - 0x021424 17:9414: 6A A3     .word sub_A36A_кипер_идеально_засейвил
- - - - - 0x021426 17:9416: F2        .byte con_jmp
- - - - - 0x021427 17:9417: 3A B8     .word loc_B83A

ofs_9419_03:
- D - I - 0x021429 17:9419: FA        .byte con_jsr
- D - I - 0x02142A 17:941A: 2E B8     .word sub_B82E
- D - I - 0x02142C 17:941C: FA        .byte con_jsr
- D - I - 0x02142D 17:941D: 31 A1     .word sub_A131
- D - I - 0x02142F 17:941F: FA        .byte con_jsr
- D - I - 0x021430 17:9420: 48 B8     .word sub_B848
- D - I - 0x021432 17:9422: FA        .byte con_jsr
- D - I - 0x021433 17:9423: 6A A3     .word sub_A36A_кипер_идеально_засейвил
- D - I - 0x021435 17:9425: F2        .byte con_jmp
- D - I - 0x021436 17:9426: 59 B8     .word loc_B859_катсцена_озарения

bra_long_case_9428_01:
- D - I - 0x021438 17:9428: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x02143A 17:942A: 0B        .byte bra_case_9435_00 - *
- - - - - 0x02143B 17:942B: 06        .byte bra_case_9431_01 - *
- D - I - 0x02143C 17:942C: 34        .byte bra_case_9460_02 - *
- - - - - 0x02143D 17:942D: 01        .byte bra_case_942E_03 - *

bra_case_942E_03:
- - - - - 0x02143E 17:942E: F2        .byte con_jmp
- - - - - 0x02143F 17:942F: F1 93     .word loc_93F1

bra_case_9431_01:
- - - - - 0x021441 17:9431: F3        .byte con_branch, $8C
- - - - - 0x021443 17:9433: 02        .byte bra_case_9435_00 - *
- - - - - 0x021444 17:9434: 26        .byte bra_case_945A_01 - *

bra_case_9435_00:
- D - I - 0x021445 17:9435: F3        .byte con_branch, $8D
- D - I - 0x021447 17:9437: 05        .byte bra_case_943C_00 - *
- D - I - 0x021448 17:9438: 0A        .byte bra_case_9442_01 - *
- - - - - 0x021449 17:9439: 0F        .byte bra_case_9448_02 - *
- - - - - 0x02144A 17:943A: 14        .byte bra_case_944E_03 - *
- D - I - 0x02144B 17:943B: 19        .byte bra_case_9454_04 - *

bra_case_943C_00:
- D - I - 0x02144C 17:943C: FA        .byte con_jsr
- D - I - 0x02144D 17:943D: 22 A1     .word sub_A122
- D - I - 0x02144F 17:943F: F2        .byte con_jmp
- D - I - 0x021450 17:9440: 8A 97     .word loc_978A

bra_case_9442_01:
- D - I - 0x021452 17:9442: FA        .byte con_jsr
- D - I - 0x021453 17:9443: 22 A1     .word sub_A122
- D - I - 0x021455 17:9445: F2        .byte con_jmp
- D - I - 0x021456 17:9446: 99 97     .word loc_9799

bra_case_9448_02:
- - - - - 0x021458 17:9448: FA        .byte con_jsr
- - - - - 0x021459 17:9449: 22 A1     .word sub_A122
- - - - - 0x02145B 17:944B: F2        .byte con_jmp
- - - - - 0x02145C 17:944C: AB 97     .word loc_97AB

bra_case_944E_03:
- - - - - 0x02145E 17:944E: FA        .byte con_jsr
- - - - - 0x02145F 17:944F: 22 A1     .word sub_A122
- - - - - 0x021461 17:9451: F2        .byte con_jmp
- - - - - 0x021462 17:9452: C3 97     .word loc_97C3

bra_case_9454_04:
- D - I - 0x021464 17:9454: FA        .byte con_jsr
- D - I - 0x021465 17:9455: 22 A1     .word sub_A122
- D - I - 0x021467 17:9457: F2        .byte con_jmp
- D - I - 0x021468 17:9458: DB 97     .word loc_97DB

bra_case_945A_01:
- - - - - 0x02146A 17:945A: FA        .byte con_jsr
- - - - - 0x02146B 17:945B: 22 A1     .word sub_A122
- - - - - 0x02146D 17:945D: F2        .byte con_jmp
- - - - - 0x02146E 17:945E: F3 97     .word loc_97F3

bra_case_9460_02:
- D - I - 0x021470 17:9460: FF        .byte con_drive, con_overhead
- D - I - 0x021472 17:9462: 6A 94     .word ofs_946A_00
- - - - - 0x021474 17:9464: C4 93     .word ofs_93C4_01
- - - - - 0x021476 17:9466: D0 93     .word ofs_93D0_02
- - - - - 0x021478 17:9468: DF 93     .word ofs_93DF_03

ofs_946A_00:
- D - I - 0x02147A 17:946A: FA        .byte con_jsr
- D - I - 0x02147B 17:946B: 22 A1     .word sub_A122
- D - I - 0x02147D 17:946D: F2        .byte con_jmp
- D - I - 0x02147E 17:946E: BC 95     .word loc_95BC

bra_long_case_9470_02_от_штанги:
- D - I - 0x021480 17:9470: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x021482 17:9472: 02        .byte bra_case_9474_00_защитник_выживет - *
- D - I - 0x021483 17:9473: 5D        .byte bra_case_94D0_01_защитник_убьется - *

bra_case_9474_00_защитник_выживет:
- D - I - 0x021484 17:9474: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x021486 17:9476: 08        .byte bra_case_947E_00 - *
- D - I - 0x021487 17:9477: 03        .byte bra_case_947A_01 - *
- D - I - 0x021488 17:9478: 43        .byte bra_case_94BB_02 - *
- D - I - 0x021489 17:9479: 4E        .byte bra_case_94C7_03 - *

bra_case_947A_01:
- D - I - 0x02148A 17:947A: F3        .byte con_branch, $8C
- D - I - 0x02148C 17:947C: 02        .byte bra_case_947E_00 - *
- - - - - 0x02148D 17:947D: 35        .byte bra_case_94B2_01 - *

bra_case_947E_00:
- D - I - 0x02148E 17:947E: F3        .byte con_branch, $8D
- D - I - 0x021490 17:9480: 05        .byte bra_case_9485_00 - *
- D - I - 0x021491 17:9481: 0D        .byte bra_case_948E_01 - *
- D - I - 0x021492 17:9482: 15        .byte bra_case_9497_02 - *
- D - I - 0x021493 17:9483: 1D        .byte bra_case_94A0_03 - *
- D - I - 0x021494 17:9484: 25        .byte bra_case_94A9_04 - *

bra_case_9485_00:
- D - I - 0x021495 17:9485: FA        .byte con_jsr
- D - I - 0x021496 17:9486: 5B 9C     .word sub_9C5B
- D - I - 0x021498 17:9488: FA        .byte con_jsr
- D - I - 0x021499 17:9489: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- D - I - 0x02149B 17:948B: F2        .byte con_jmp
- D - I - 0x02149C 17:948C: 0D 97     .word loc_970D

bra_case_948E_01:
- D - I - 0x02149E 17:948E: FA        .byte con_jsr
- D - I - 0x02149F 17:948F: 5B 9C     .word sub_9C5B
- D - I - 0x0214A1 17:9491: FA        .byte con_jsr
- D - I - 0x0214A2 17:9492: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- D - I - 0x0214A4 17:9494: F2        .byte con_jmp
- D - I - 0x0214A5 17:9495: 16 97     .word loc_9716

bra_case_9497_02:
- D - I - 0x0214A7 17:9497: FA        .byte con_jsr
- D - I - 0x0214A8 17:9498: 5B 9C     .word sub_9C5B
- D - I - 0x0214AA 17:949A: FA        .byte con_jsr
- D - I - 0x0214AB 17:949B: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- D - I - 0x0214AD 17:949D: F2        .byte con_jmp
- D - I - 0x0214AE 17:949E: 22 97     .word loc_9722

bra_case_94A0_03:
- D - I - 0x0214B0 17:94A0: FA        .byte con_jsr
- D - I - 0x0214B1 17:94A1: 5B 9C     .word sub_9C5B
- D - I - 0x0214B3 17:94A3: FA        .byte con_jsr
- D - I - 0x0214B4 17:94A4: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- D - I - 0x0214B6 17:94A6: F2        .byte con_jmp
- D - I - 0x0214B7 17:94A7: 31 97     .word loc_9731

bra_case_94A9_04:
- D - I - 0x0214B9 17:94A9: FA        .byte con_jsr
- D - I - 0x0214BA 17:94AA: 5B 9C     .word sub_9C5B
- D - I - 0x0214BC 17:94AC: FA        .byte con_jsr
- D - I - 0x0214BD 17:94AD: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- D - I - 0x0214BF 17:94AF: F2        .byte con_jmp
- D - I - 0x0214C0 17:94B0: 43 97     .word loc_9743

bra_case_94B2_01:
- - - - - 0x0214C2 17:94B2: FA        .byte con_jsr
- - - - - 0x0214C3 17:94B3: 5B 9C     .word sub_9C5B
- - - - - 0x0214C5 17:94B5: FA        .byte con_jsr
- - - - - 0x0214C6 17:94B6: DD A1     .word sub_A1DD_triangle_jump_не_достает_до_мяча
- - - - - 0x0214C8 17:94B8: F2        .byte con_jmp
- - - - - 0x0214C9 17:94B9: 55 97     .word loc_9755

bra_case_94BB_02:
- D - I - 0x0214CB 17:94BB: FA        .byte con_jsr
- D - I - 0x0214CC 17:94BC: 5B 9C     .word sub_9C5B
- D - I - 0x0214CE 17:94BE: FA        .byte con_jsr
- D - I - 0x0214CF 17:94BF: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- D - I - 0x0214D1 17:94C1: FA        .byte con_jsr
- D - I - 0x0214D2 17:94C2: 08 A3     .word sub_A308
- D - I - 0x0214D4 17:94C4: F2        .byte con_jmp
- D - I - 0x0214D5 17:94C5: 71 A3     .word loc_A371_мяч_улетает_в_сторону

loc_94C7:
bra_case_94C7_03:
- D - I - 0x0214D7 17:94C7: FA        .byte con_jsr
- D - I - 0x0214D8 17:94C8: 5B 9C     .word sub_9C5B
- D - I - 0x0214DA 17:94CA: FA        .byte con_jsr
- D - I - 0x0214DB 17:94CB: D1 A1     .word sub_A1D1_triangle_jump_ловит_мяч
- D - I - 0x0214DD 17:94CD: F2        .byte con_jmp
- D - I - 0x0214DE 17:94CE: 4E B4     .word loc_B44E_кипер_идеально_засейвил

bra_case_94D0_01_защитник_убьется:
- D - I - 0x0214E0 17:94D0: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x0214E2 17:94D2: 0B        .byte bra_case_94DD_00 - *
- - - - - 0x0214E3 17:94D3: 06        .byte bra_case_94D9_01 - *
- - - - - 0x0214E4 17:94D4: 46        .byte bra_case_951A_02 - *
- - - - - 0x0214E5 17:94D5: 01        .byte bra_case_94D6_03 - *

bra_case_94D6_03:
- - - - - 0x0214E6 17:94D6: F2        .byte con_jmp
- - - - - 0x0214E7 17:94D7: C7 94     .word loc_94C7

bra_case_94D9_01:
- - - - - 0x0214E9 17:94D9: F3        .byte con_branch, $8C
- - - - - 0x0214EB 17:94DB: 02        .byte bra_case_94DD_00 - *
- - - - - 0x0214EC 17:94DC: 35        .byte bra_case_9511_01 - *

bra_case_94DD_00:
- D - I - 0x0214ED 17:94DD: F3        .byte con_branch, $8D
- D - I - 0x0214EF 17:94DF: 05        .byte bra_case_94E4_00 - *
- - - - - 0x0214F0 17:94E0: 0D        .byte bra_case_94ED_01 - *
- - - - - 0x0214F1 17:94E1: 15        .byte bra_case_94F6_02 - *
- - - - - 0x0214F2 17:94E2: 1D        .byte bra_case_94FF_03 - *
- - - - - 0x0214F3 17:94E3: 25        .byte bra_case_9508_04 - *

bra_case_94E4_00:
- D - I - 0x0214F4 17:94E4: FA        .byte con_jsr
- D - I - 0x0214F5 17:94E5: 5B 9C     .word sub_9C5B
- D - I - 0x0214F7 17:94E7: FA        .byte con_jsr
- D - I - 0x0214F8 17:94E8: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- D - I - 0x0214FA 17:94EA: F2        .byte con_jmp
- D - I - 0x0214FB 17:94EB: 8A 97     .word loc_978A

bra_case_94ED_01:
- - - - - 0x0214FD 17:94ED: FA        .byte con_jsr
- - - - - 0x0214FE 17:94EE: 5B 9C     .word sub_9C5B
- - - - - 0x021500 17:94F0: FA        .byte con_jsr
- - - - - 0x021501 17:94F1: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x021503 17:94F3: F2        .byte con_jmp
- - - - - 0x021504 17:94F4: 99 97     .word loc_9799

bra_case_94F6_02:
- - - - - 0x021506 17:94F6: FA        .byte con_jsr
- - - - - 0x021507 17:94F7: 5B 9C     .word sub_9C5B
- - - - - 0x021509 17:94F9: FA        .byte con_jsr
- - - - - 0x02150A 17:94FA: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x02150C 17:94FC: F2        .byte con_jmp
- - - - - 0x02150D 17:94FD: AB 97     .word loc_97AB

bra_case_94FF_03:
- - - - - 0x02150F 17:94FF: FA        .byte con_jsr
- - - - - 0x021510 17:9500: 5B 9C     .word sub_9C5B
- - - - - 0x021512 17:9502: FA        .byte con_jsr
- - - - - 0x021513 17:9503: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x021515 17:9505: F2        .byte con_jmp
- - - - - 0x021516 17:9506: C3 97     .word loc_97C3

bra_case_9508_04:
- - - - - 0x021518 17:9508: FA        .byte con_jsr
- - - - - 0x021519 17:9509: 5B 9C     .word sub_9C5B
- - - - - 0x02151B 17:950B: FA        .byte con_jsr
- - - - - 0x02151C 17:950C: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x02151E 17:950E: F2        .byte con_jmp
- - - - - 0x02151F 17:950F: DB 97     .word loc_97DB

bra_case_9511_01:
- - - - - 0x021521 17:9511: FA        .byte con_jsr
- - - - - 0x021522 17:9512: 5B 9C     .word sub_9C5B
- - - - - 0x021524 17:9514: FA        .byte con_jsr
- - - - - 0x021525 17:9515: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x021527 17:9517: F2        .byte con_jmp
- - - - - 0x021528 17:9518: F3 97     .word loc_97F3

bra_case_951A_02:
- - - - - 0x02152A 17:951A: FA        .byte con_jsr
- - - - - 0x02152B 17:951B: 5B 9C     .word sub_9C5B
- - - - - 0x02152D 17:951D: FA        .byte con_jsr
- - - - - 0x02152E 17:951E: CA A1     .word sub_A1CA_triangle_jump_ловит_мяч
- - - - - 0x021530 17:9520: FA        .byte con_jsr
- - - - - 0x021531 17:9521: DD A2     .word sub_A2DD
- - - - - 0x021533 17:9523: FA        .byte con_jsr
- - - - - 0x021534 17:9524: B5 9F     .word sub_9FB5_убийство_кипера
- - - - - 0x021536 17:9526: F2        .byte con_jmp
- - - - - 0x021537 17:9527: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_long_case_9529_00_словить:
- D - I - 0x021539 17:9529: F3        .byte con_branch, $36
- D - I - 0x02153B 17:952B: 33 95     .word bra_long_case_9533_00_catch
- D - I - 0x02153D 17:952D: C8 95     .word bra_long_case_95C8_01_rolling_save
- D - I - 0x02153F 17:952F: 4B 96     .word bra_long_case_964B_02_clone_save
- D - I - 0x021541 17:9531: CE 96     .word bra_long_case_96CE_03_dark_illusion

bra_long_case_9533_00_catch:
- D - I - 0x021543 17:9533: FA        .byte con_jsr
- D - I - 0x021544 17:9534: 9C 9F     .word sub_9F9C_крит_кипера
- D - I - 0x021546 17:9536: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x021548 17:9538: 02        .byte bra_case_953A_00_защитник_выживет - *
- D - I - 0x021549 17:9539: 48        .byte bra_case_9581_01_защитник_убьется - *

bra_case_953A_00_защитник_выживет:
- D - I - 0x02154A 17:953A: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x02154C 17:953C: 08        .byte bra_case_9544_00 - *
- D - I - 0x02154D 17:953D: 03        .byte bra_case_9540_01 - *
- D - I - 0x02154E 17:953E: 31        .byte bra_case_956F_02 - *
- D - I - 0x02154F 17:953F: 3C        .byte bra_case_957B_03 - *

bra_case_9540_01:
- D - I - 0x021550 17:9540: F3        .byte con_branch, $8C
- D - I - 0x021552 17:9542: 02        .byte bra_case_9544_00 - *
- D - I - 0x021553 17:9543: 26        .byte bra_case_9569_01 - *

bra_case_9544_00:
- D - I - 0x021554 17:9544: F3        .byte con_branch, $8D
- D - I - 0x021556 17:9546: 05        .byte bra_case_954B_00 - *
- D - I - 0x021557 17:9547: 0A        .byte bra_case_9551_01 - *
- D - I - 0x021558 17:9548: 0F        .byte bra_case_9557_02 - *
- D - I - 0x021559 17:9549: 14        .byte bra_case_955D_03 - *
- D - I - 0x02155A 17:954A: 19        .byte bra_case_9563_04 - *

bra_case_954B_00:
- D - I - 0x02155B 17:954B: FA        .byte con_jsr
- D - I - 0x02155C 17:954C: 94 A0     .word sub_A094
- D - I - 0x02155E 17:954E: F2        .byte con_jmp
- D - I - 0x02155F 17:954F: 0D 97     .word loc_970D

bra_case_9551_01:
- D - I - 0x021561 17:9551: FA        .byte con_jsr
- D - I - 0x021562 17:9552: 94 A0     .word sub_A094
- D - I - 0x021564 17:9554: F2        .byte con_jmp
- D - I - 0x021565 17:9555: 16 97     .word loc_9716

bra_case_9557_02:
- D - I - 0x021567 17:9557: FA        .byte con_jsr
- D - I - 0x021568 17:9558: 94 A0     .word sub_A094
- D - I - 0x02156A 17:955A: F2        .byte con_jmp
- D - I - 0x02156B 17:955B: 22 97     .word loc_9722

bra_case_955D_03:
- D - I - 0x02156D 17:955D: FA        .byte con_jsr
- D - I - 0x02156E 17:955E: 94 A0     .word sub_A094
- D - I - 0x021570 17:9560: F2        .byte con_jmp
- D - I - 0x021571 17:9561: 31 97     .word loc_9731

bra_case_9563_04:
- D - I - 0x021573 17:9563: FA        .byte con_jsr
- D - I - 0x021574 17:9564: 94 A0     .word sub_A094
- D - I - 0x021576 17:9566: F2        .byte con_jmp
- D - I - 0x021577 17:9567: 43 97     .word loc_9743

bra_case_9569_01:
- D - I - 0x021579 17:9569: FA        .byte con_jsr
- D - I - 0x02157A 17:956A: 94 A0     .word sub_A094
- D - I - 0x02157C 17:956C: F2        .byte con_jmp
- D - I - 0x02157D 17:956D: 55 97     .word loc_9755

bra_case_956F_02:
- D - I - 0x02157F 17:956F: FA        .byte con_jsr
- D - I - 0x021580 17:9570: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
loc_9572:
- D - I - 0x021582 17:9572: FA        .byte con_jsr
- D - I - 0x021583 17:9573: 08 A3     .word sub_A308
- D - I - 0x021585 17:9575: FA        .byte con_jsr
- D - I - 0x021586 17:9576: 5D B4     .word sub_B45D
- D - I - 0x021588 17:9578: F2        .byte con_jmp
- D - I - 0x021589 17:9579: F0 9E     .word loc_9EF0

loc_957B:
bra_case_957B_03:
- D - I - 0x02158B 17:957B: FA        .byte con_jsr
- D - I - 0x02158C 17:957C: A6 A0     .word sub_A0A6_кипер_ловит_мяч_со_звуком
- D - I - 0x02158E 17:957E: F2        .byte con_jmp
- D - I - 0x02158F 17:957F: 70 97     .word loc_9770_сообщение_об_идеальном_сейве

bra_case_9581_01_защитник_убьется:
- D - I - 0x021591 17:9581: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x021593 17:9583: 0B        .byte bra_case_958E_00 - *
- D - I - 0x021594 17:9584: 06        .byte bra_case_958A_01 - *
- - - - - 0x021595 17:9585: 34        .byte bra_case_95B9_02 - *
- - - - - 0x021596 17:9586: 01        .byte bra_case_9587_03 - *

bra_case_9587_03:
- - - - - 0x021597 17:9587: F2        .byte con_jmp
- - - - - 0x021598 17:9588: 7B 95     .word loc_957B

bra_case_958A_01:
- D - I - 0x02159A 17:958A: F3        .byte con_branch, $8C
- - - - - 0x02159C 17:958C: 02        .byte bra_case_958E_00 - *
- D - I - 0x02159D 17:958D: 26        .byte bra_case_95B3_01 - *

bra_case_958E_00:
- D - I - 0x02159E 17:958E: F3        .byte con_branch, $8D
- D - I - 0x0215A0 17:9590: 05        .byte bra_case_9595_00 - *
- D - I - 0x0215A1 17:9591: 0A        .byte bra_case_959B_01 - *
- - - - - 0x0215A2 17:9592: 0F        .byte bra_case_95A1_02 - *
- - - - - 0x0215A3 17:9593: 14        .byte bra_case_95A7_03 - *
- - - - - 0x0215A4 17:9594: 19        .byte bra_case_95AD_04 - *

bra_case_9595_00:
- D - I - 0x0215A5 17:9595: FA        .byte con_jsr
- D - I - 0x0215A6 17:9596: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- D - I - 0x0215A8 17:9598: F2        .byte con_jmp
- D - I - 0x0215A9 17:9599: 8A 97     .word loc_978A

bra_case_959B_01:
- D - I - 0x0215AB 17:959B: FA        .byte con_jsr
- D - I - 0x0215AC 17:959C: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- D - I - 0x0215AE 17:959E: F2        .byte con_jmp
- D - I - 0x0215AF 17:959F: 99 97     .word loc_9799

bra_case_95A1_02:
- - - - - 0x0215B1 17:95A1: FA        .byte con_jsr
- - - - - 0x0215B2 17:95A2: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- - - - - 0x0215B4 17:95A4: F2        .byte con_jmp
- - - - - 0x0215B5 17:95A5: AB 97     .word loc_97AB

bra_case_95A7_03:
- - - - - 0x0215B7 17:95A7: FA        .byte con_jsr
- - - - - 0x0215B8 17:95A8: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- - - - - 0x0215BA 17:95AA: F2        .byte con_jmp
- - - - - 0x0215BB 17:95AB: C3 97     .word loc_97C3

bra_case_95AD_04:
- - - - - 0x0215BD 17:95AD: FA        .byte con_jsr
- - - - - 0x0215BE 17:95AE: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- - - - - 0x0215C0 17:95B0: F2        .byte con_jmp
- - - - - 0x0215C1 17:95B1: DB 97     .word loc_97DB

bra_case_95B3_01:
- D - I - 0x0215C3 17:95B3: FA        .byte con_jsr
- D - I - 0x0215C4 17:95B4: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- D - I - 0x0215C6 17:95B6: F2        .byte con_jmp
- D - I - 0x0215C7 17:95B7: F3 97     .word loc_97F3

bra_case_95B9_02:
- - - - - 0x0215C9 17:95B9: FA        .byte con_jsr
- - - - - 0x0215CA 17:95BA: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
loc_95BC:
- D - I - 0x0215CC 17:95BC: FA        .byte con_jsr
- D - I - 0x0215CD 17:95BD: DD A2     .word sub_A2DD
- D - I - 0x0215CF 17:95BF: FA        .byte con_jsr
- D - I - 0x0215D0 17:95C0: B5 9F     .word sub_9FB5_убийство_кипера
- D - I - 0x0215D2 17:95C2: FA        .byte con_jsr
- D - I - 0x0215D3 17:95C3: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- D - I - 0x0215D5 17:95C5: F2        .byte con_jmp
- D - I - 0x0215D6 17:95C6: F0 9E     .word loc_9EF0

bra_long_case_95C8_01_rolling_save:
- D - I - 0x0215D8 17:95C8: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x0215DA 17:95CA: 02        .byte bra_case_95CC_00_защитник_выживет - *
- - - - - 0x0215DB 17:95CB: 42        .byte bra_case_960D_01_защитник_убьется - *

bra_case_95CC_00_защитник_выживет:
- D - I - 0x0215DC 17:95CC: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x0215DE 17:95CE: 08        .byte bra_case_95D6_00 - *
- - - - - 0x0215DF 17:95CF: 03        .byte bra_case_95D2_01 - *
- D - I - 0x0215E0 17:95D0: 31        .byte bra_case_9601_02 - *
- D - I - 0x0215E1 17:95D1: 36        .byte bra_case_9607_03 - *

bra_case_95D2_01:
- - - - - 0x0215E2 17:95D2: F3        .byte con_branch, $8C
- - - - - 0x0215E4 17:95D4: 02        .byte bra_case_95D6_00 - *
- - - - - 0x0215E5 17:95D5: 26        .byte bra_case_95FB_01 - *

bra_case_95D6_00:
- D - I - 0x0215E6 17:95D6: F3        .byte con_branch, $8D
- D - I - 0x0215E8 17:95D8: 05        .byte bra_case_95DD_00 - *
- - - - - 0x0215E9 17:95D9: 0A        .byte bra_case_95E3_01 - *
- - - - - 0x0215EA 17:95DA: 0F        .byte bra_case_95E9_02 - *
- - - - - 0x0215EB 17:95DB: 14        .byte bra_case_95EF_03 - *
- - - - - 0x0215EC 17:95DC: 19        .byte bra_case_95F5_04 - *

bra_case_95DD_00:
- D - I - 0x0215ED 17:95DD: FA        .byte con_jsr
- D - I - 0x0215EE 17:95DE: CD A0     .word sub_A0CD_rolling_save
- D - I - 0x0215F0 17:95E0: F2        .byte con_jmp
- D - I - 0x0215F1 17:95E1: 0A 97     .word loc_970A

bra_case_95E3_01:
- - - - - 0x0215F3 17:95E3: FA        .byte con_jsr
- - - - - 0x0215F4 17:95E4: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x0215F6 17:95E6: F2        .byte con_jmp
- - - - - 0x0215F7 17:95E7: 13 97     .word loc_9713

bra_case_95E9_02:
- - - - - 0x0215F9 17:95E9: FA        .byte con_jsr
- - - - - 0x0215FA 17:95EA: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x0215FC 17:95EC: F2        .byte con_jmp
- - - - - 0x0215FD 17:95ED: 1F 97     .word loc_971F

bra_case_95EF_03:
- - - - - 0x0215FF 17:95EF: FA        .byte con_jsr
- - - - - 0x021600 17:95F0: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021602 17:95F2: F2        .byte con_jmp
- - - - - 0x021603 17:95F3: 2E 97     .word loc_972E

bra_case_95F5_04:
- - - - - 0x021605 17:95F5: FA        .byte con_jsr
- - - - - 0x021606 17:95F6: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021608 17:95F8: F2        .byte con_jmp
- - - - - 0x021609 17:95F9: 40 97     .word loc_9740

bra_case_95FB_01:
- - - - - 0x02160B 17:95FB: FA        .byte con_jsr
- - - - - 0x02160C 17:95FC: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x02160E 17:95FE: F2        .byte con_jmp
- - - - - 0x02160F 17:95FF: 52 97     .word loc_9752

bra_case_9601_02:
- D - I - 0x021611 17:9601: FA        .byte con_jsr
- D - I - 0x021612 17:9602: CD A0     .word sub_A0CD_rolling_save
- D - I - 0x021614 17:9604: F2        .byte con_jmp
- D - I - 0x021615 17:9605: 5E 97     .word loc_975E

loc_9607:
bra_case_9607_03:
- D - I - 0x021617 17:9607: FA        .byte con_jsr
- D - I - 0x021618 17:9608: CD A0     .word sub_A0CD_rolling_save
- D - I - 0x02161A 17:960A: F2        .byte con_jmp
- D - I - 0x02161B 17:960B: 6D 97     .word loc_976D_кипер_ловит_мяч

bra_case_960D_01_защитник_убьется:
- - - - - 0x02161D 17:960D: F3        .byte con_branch, $83     ; результат действия защитника
- - - - - 0x02161F 17:960F: 0B        .byte bra_case_961A_00 - *
- - - - - 0x021620 17:9610: 06        .byte bra_case_9616_01 - *
- - - - - 0x021621 17:9611: 34        .byte bra_case_9645_02 - *
- - - - - 0x021622 17:9612: 01        .byte bra_case_9613_03 - *

bra_case_9613_03:
- - - - - 0x021623 17:9613: F2        .byte con_jmp
- - - - - 0x021624 17:9614: 07 96     .word loc_9607

bra_case_9616_01:
- - - - - 0x021626 17:9616: F3        .byte con_branch, $8C
- - - - - 0x021628 17:9618: 02        .byte bra_case_961A_00 - *
- - - - - 0x021629 17:9619: 26        .byte bra_case_963F_01 - *

bra_case_961A_00:
- - - - - 0x02162A 17:961A: F3        .byte con_branch, $8D
- - - - - 0x02162C 17:961C: 05        .byte bra_case_9621_00 - *
- - - - - 0x02162D 17:961D: 0A        .byte bra_case_9627_01 - *
- - - - - 0x02162E 17:961E: 0F        .byte bra_case_962D_02 - *
- - - - - 0x02162F 17:961F: 14        .byte bra_case_9633_03 - *
- - - - - 0x021630 17:9620: 19        .byte bra_case_9639_04 - *

bra_case_9621_00:
- - - - - 0x021631 17:9621: FA        .byte con_jsr
- - - - - 0x021632 17:9622: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021634 17:9624: F2        .byte con_jmp
- - - - - 0x021635 17:9625: 87 97     .word loc_9787

bra_case_9627_01:
- - - - - 0x021637 17:9627: FA        .byte con_jsr
- - - - - 0x021638 17:9628: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x02163A 17:962A: F2        .byte con_jmp
- - - - - 0x02163B 17:962B: 96 97     .word loc_9796

bra_case_962D_02:
- - - - - 0x02163D 17:962D: FA        .byte con_jsr
- - - - - 0x02163E 17:962E: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021640 17:9630: F2        .byte con_jmp
- - - - - 0x021641 17:9631: A8 97     .word loc_97A8

bra_case_9633_03:
- - - - - 0x021643 17:9633: FA        .byte con_jsr
- - - - - 0x021644 17:9634: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021646 17:9636: F2        .byte con_jmp
- - - - - 0x021647 17:9637: C0 97     .word loc_97C0

bra_case_9639_04:
- - - - - 0x021649 17:9639: FA        .byte con_jsr
- - - - - 0x02164A 17:963A: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x02164C 17:963C: F2        .byte con_jmp
- - - - - 0x02164D 17:963D: D8 97     .word loc_97D8

bra_case_963F_01:
- - - - - 0x02164F 17:963F: FA        .byte con_jsr
- - - - - 0x021650 17:9640: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021652 17:9642: F2        .byte con_jmp
- - - - - 0x021653 17:9643: F0 97     .word loc_97F0

bra_case_9645_02:
- - - - - 0x021655 17:9645: FA        .byte con_jsr
- - - - - 0x021656 17:9646: CD A0     .word sub_A0CD_rolling_save
- - - - - 0x021658 17:9648: F2        .byte con_jmp
- - - - - 0x021659 17:9649: 02 98     .word loc_9802

bra_long_case_964B_02_clone_save:
- D - I - 0x02165B 17:964B: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x02165D 17:964D: 02        .byte bra_case_964F_00_защитник_выживет - *
- - - - - 0x02165E 17:964E: 42        .byte bra_case_9690_01_защитник_убьется - *

bra_case_964F_00_защитник_выживет:
- D - I - 0x02165F 17:964F: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x021661 17:9651: 08        .byte bra_case_9659_00 - *
- - - - - 0x021662 17:9652: 03        .byte bra_case_9655_01 - *
- D - I - 0x021663 17:9653: 31        .byte bra_case_9684_02 - *
- D - I - 0x021664 17:9654: 36        .byte bra_case_968A_03 - *

bra_case_9655_01:
- - - - - 0x021665 17:9655: F3        .byte con_branch, $8C
- - - - - 0x021667 17:9657: 02        .byte bra_case_9659_00 - *
- - - - - 0x021668 17:9658: 26        .byte bra_case_967E_01 - *

bra_case_9659_00:
- D - I - 0x021669 17:9659: F3        .byte con_branch, $8D
- D - I - 0x02166B 17:965B: 05        .byte bra_case_9660_00 - *
- - - - - 0x02166C 17:965C: 0A        .byte bra_case_9666_01 - *
- - - - - 0x02166D 17:965D: 0F        .byte bra_case_966C_02 - *
- - - - - 0x02166E 17:965E: 14        .byte bra_case_9672_03 - *
- - - - - 0x02166F 17:965F: 19        .byte bra_case_9678_04 - *

bra_case_9660_00:
- D - I - 0x021670 17:9660: FA        .byte con_jsr
- D - I - 0x021671 17:9661: FF A1     .word sub_A1FF
- D - I - 0x021673 17:9663: F2        .byte con_jmp
- D - I - 0x021674 17:9664: 0A 97     .word loc_970A

bra_case_9666_01:
- - - - - 0x021676 17:9666: FA        .byte con_jsr
- - - - - 0x021677 17:9667: FF A1     .word sub_A1FF
- - - - - 0x021679 17:9669: F2        .byte con_jmp
- - - - - 0x02167A 17:966A: 13 97     .word loc_9713

bra_case_966C_02:
- - - - - 0x02167C 17:966C: FA        .byte con_jsr
- - - - - 0x02167D 17:966D: FF A1     .word sub_A1FF
- - - - - 0x02167F 17:966F: F2        .byte con_jmp
- - - - - 0x021680 17:9670: 1F 97     .word loc_971F

bra_case_9672_03:
- - - - - 0x021682 17:9672: FA        .byte con_jsr
- - - - - 0x021683 17:9673: FF A1     .word sub_A1FF
- - - - - 0x021685 17:9675: F2        .byte con_jmp
- - - - - 0x021686 17:9676: 2E 97     .word loc_972E

bra_case_9678_04:
- - - - - 0x021688 17:9678: FA        .byte con_jsr
- - - - - 0x021689 17:9679: FF A1     .word sub_A1FF
- - - - - 0x02168B 17:967B: F2        .byte con_jmp
- - - - - 0x02168C 17:967C: 40 97     .word loc_9740

bra_case_967E_01:
- - - - - 0x02168E 17:967E: FA        .byte con_jsr
- - - - - 0x02168F 17:967F: FF A1     .word sub_A1FF
- - - - - 0x021691 17:9681: F2        .byte con_jmp
- - - - - 0x021692 17:9682: 52 97     .word loc_9752

bra_case_9684_02:
- D - I - 0x021694 17:9684: FA        .byte con_jsr
- D - I - 0x021695 17:9685: FF A1     .word sub_A1FF
- D - I - 0x021697 17:9687: F2        .byte con_jmp
- D - I - 0x021698 17:9688: 5E 97     .word loc_975E

loc_968A:
bra_case_968A_03:
- D - I - 0x02169A 17:968A: FA        .byte con_jsr
- D - I - 0x02169B 17:968B: FF A1     .word sub_A1FF
- D - I - 0x02169D 17:968D: F2        .byte con_jmp
- D - I - 0x02169E 17:968E: 6D 97     .word loc_976D_кипер_ловит_мяч

bra_case_9690_01_защитник_убьется:
- - - - - 0x0216A0 17:9690: F3        .byte con_branch, $83     ; результат действия защитника
- - - - - 0x0216A2 17:9692: 0B        .byte bra_case_969D_00 - *
- - - - - 0x0216A3 17:9693: 06        .byte bra_case_9699_01 - *
- - - - - 0x0216A4 17:9694: 34        .byte bra_case_96C8_02 - *
- - - - - 0x0216A5 17:9695: 01        .byte bra_case_9696_03 - *

bra_case_9696_03:
- - - - - 0x0216A6 17:9696: F2        .byte con_jmp
- - - - - 0x0216A7 17:9697: 8A 96     .word loc_968A

bra_case_9699_01:
- - - - - 0x0216A9 17:9699: F3        .byte con_branch, $8C
- - - - - 0x0216AB 17:969B: 02        .byte bra_case_969D_00 - *
- - - - - 0x0216AC 17:969C: 26        .byte bra_case_96C2_01 - *

bra_case_969D_00:
- - - - - 0x0216AD 17:969D: F3        .byte con_branch, $8D
- - - - - 0x0216AF 17:969F: 05        .byte bra_case_96A4_00 - *
- - - - - 0x0216B0 17:96A0: 0A        .byte bra_case_96AA_01 - *
- - - - - 0x0216B1 17:96A1: 0F        .byte bra_case_96B0_02 - *
- - - - - 0x0216B2 17:96A2: 14        .byte bra_case_96B6_03 - *
- - - - - 0x0216B3 17:96A3: 19        .byte bra_case_96BC_04 - *

bra_case_96A4_00:
- - - - - 0x0216B4 17:96A4: FA        .byte con_jsr
- - - - - 0x0216B5 17:96A5: FF A1     .word sub_A1FF
- - - - - 0x0216B7 17:96A7: F2        .byte con_jmp
- - - - - 0x0216B8 17:96A8: 87 97     .word loc_9787

bra_case_96AA_01:
- - - - - 0x0216BA 17:96AA: FA        .byte con_jsr
- - - - - 0x0216BB 17:96AB: FF A1     .word sub_A1FF
- - - - - 0x0216BD 17:96AD: F2        .byte con_jmp
- - - - - 0x0216BE 17:96AE: 96 97     .word loc_9796

bra_case_96B0_02:
- - - - - 0x0216C0 17:96B0: FA        .byte con_jsr
- - - - - 0x0216C1 17:96B1: FF A1     .word sub_A1FF
- - - - - 0x0216C3 17:96B3: F2        .byte con_jmp
- - - - - 0x0216C4 17:96B4: A8 97     .word loc_97A8

bra_case_96B6_03:
- - - - - 0x0216C6 17:96B6: FA        .byte con_jsr
- - - - - 0x0216C7 17:96B7: FF A1     .word sub_A1FF
- - - - - 0x0216C9 17:96B9: F2        .byte con_jmp
- - - - - 0x0216CA 17:96BA: C0 97     .word loc_97C0

bra_case_96BC_04:
- - - - - 0x0216CC 17:96BC: FA        .byte con_jsr
- - - - - 0x0216CD 17:96BD: FF A1     .word sub_A1FF
- - - - - 0x0216CF 17:96BF: F2        .byte con_jmp
- - - - - 0x0216D0 17:96C0: D8 97     .word loc_97D8

bra_case_96C2_01:
- - - - - 0x0216D2 17:96C2: FA        .byte con_jsr
- - - - - 0x0216D3 17:96C3: FF A1     .word sub_A1FF
- - - - - 0x0216D5 17:96C5: F2        .byte con_jmp
- - - - - 0x0216D6 17:96C6: F0 97     .word loc_97F0

bra_case_96C8_02:
- - - - - 0x0216D8 17:96C8: FA        .byte con_jsr
- - - - - 0x0216D9 17:96C9: FF A1     .word sub_A1FF
- - - - - 0x0216DB 17:96CB: F2        .byte con_jmp
- - - - - 0x0216DC 17:96CC: 02 98     .word loc_9802

bra_long_case_96CE_03_dark_illusion:
- D - I - 0x0216DE 17:96CE: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x0216E0 17:96D0: 02        .byte bra_case_96D2_00_защитник_выживет - *
- D - I - 0x0216E1 17:96D1: 78        .byte bra_case_9749_01_защитник_убьется - *

bra_case_96D2_00_защитник_выживет:
- D - I - 0x0216E2 17:96D2: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x0216E4 17:96D4: 08        .byte bra_case_96DC_00 - *
- - - - - 0x0216E5 17:96D5: 03        .byte bra_case_96D8_01 - *
- D - I - 0x0216E6 17:96D6: 85        .byte bra_case_975B_02 - *
- D - I - 0x0216E7 17:96D7: 93        .byte bra_case_976A_03 - *

bra_case_96D8_01:
- - - - - 0x0216E8 17:96D8: F3        .byte con_branch, $8C
- - - - - 0x0216EA 17:96DA: 02        .byte bra_case_96DC_00 - *
- - - - - 0x0216EB 17:96DB: 74        .byte bra_case_974F_01 - *

bra_case_96DC_00:
- D - I - 0x0216EC 17:96DC: F3        .byte con_branch, $8D
- D - I - 0x0216EE 17:96DE: 29        .byte bra_case_9707_00 - *
- - - - - 0x0216EF 17:96DF: 31        .byte bra_case_9710_01 - *
- - - - - 0x0216F0 17:96E0: 3C        .byte bra_case_971C_02 - *
- - - - - 0x0216F1 17:96E1: 4A        .byte bra_case_972B_03 - *
- - - - - 0x0216F2 17:96E2: 5B        .byte bra_case_973D_04 - *



_scenario_96E3_0C:
- D - I - 0x0216F3 17:96E3: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x0216F5 17:96E5: FA        .byte con_jsr
- D - I - 0x0216F6 17:96E6: F6 9E     .word sub_9EF6_выбор_анимации_полета_удара
- D - I - 0x0216F8 17:96E8: F3        .byte con_branch, $8F     ; ? порвется ли мяч
- D - I - 0x0216FA 17:96EA: 06        .byte bra_case_96F0_00_мяч_не_порвется - *
- - - - - 0x0216FB 17:96EB: 01        .byte bra_case_96EC_01_мяч_порвется - *

bra_case_96EC_01_мяч_порвется:
- - - - - 0x0216FC 17:96EC: F3        .byte con_branch, $8C     ; ? порвется ли мяч
- - - - - 0x0216FE 17:96EE: 02        .byte bra_case_96F0_00_мяч_не_порвется - *
- - - - - 0x0216FF 17:96EF: 66        .byte bra_case_9755_01_мяч_порвется - *

bra_case_96F0_00_мяч_не_порвется:
- D - I - 0x021700 17:96F0: F3        .byte con_branch, $8D
- D - I - 0x021702 17:96F2: 1B        .byte bra_case_970D_00_гол - *
- D - I - 0x021703 17:96F3: 23        .byte bra_case_9716_01_штанга - *
- D - I - 0x021704 17:96F4: 2E        .byte bra_case_9722_02_защитник_отобьет - *
- D - I - 0x021705 17:96F5: 3C        .byte bra_case_9731_03_штанга_и_добивание - *
- D - I - 0x021706 17:96F6: 4D        .byte bra_case_9743_04_защитник_промахнется - *



_scenario_96F7_0D:
- D - I - 0x021707 17:96F7: FA        .byte con_jsr
- D - I - 0x021708 17:96F8: 31 AB     .word sub_AB31
- D - I - 0x02170A 17:96FA: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02170C 17:96FC: FA        .byte con_jsr
- D - I - 0x02170D 17:96FD: E7 B4     .word sub_B4E7
- D - I - 0x02170F 17:96FF: F3        .byte con_branch, $93     ; появится ли спасающий ворота защитник
- D - I - 0x021711 17:9701: 03        .byte bra_case_9704_00_защитник_не_появится - *
- D - I - 0x021712 17:9702: 41        .byte bra_case_9743_01_защитник_промахнется - *
- D - I - 0x021713 17:9703: 1F        .byte bra_case_9722_02_защитник_отобьет - *

bra_case_9704_00_защитник_не_появится:
- D - I - 0x021714 17:9704: F2        .byte con_jmp
- D - I - 0x021715 17:9705: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_9707_00:
- D - I - 0x021717 17:9707: FA        .byte con_jsr
- D - I - 0x021718 17:9708: E4 A1     .word sub_A1E4_dark_illusion
loc_970A:
- D - I - 0x02171A 17:970A: FA        .byte con_jsr
- D - I - 0x02171B 17:970B: 09 A1     .word sub_A109
loc_970D:
bra_case_970D_00_гол:
- D - I - 0x02171D 17:970D: F2        .byte con_jmp
- D - I - 0x02171E 17:970E: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_9710_01:
- - - - - 0x021720 17:9710: FA        .byte con_jsr
- - - - - 0x021721 17:9711: E4 A1     .word sub_A1E4_dark_illusion
loc_9713:
- - - - - 0x021723 17:9713: FA        .byte con_jsr
- - - - - 0x021724 17:9714: 09 A1     .word sub_A109
loc_9716:
bra_case_9716_01_штанга:
- D - I - 0x021726 17:9716: FA        .byte con_jsr
- D - I - 0x021727 17:9717: 4E A2     .word sub_A24E_штанга
- D - I - 0x021729 17:9719: F2        .byte con_jmp
- D - I - 0x02172A 17:971A: 58 A2     .word loc_A258

bra_case_971C_02:
- - - - - 0x02172C 17:971C: FA        .byte con_jsr
- - - - - 0x02172D 17:971D: E4 A1     .word sub_A1E4_dark_illusion
loc_971F:
- - - - - 0x02172F 17:971F: FA        .byte con_jsr
- - - - - 0x021730 17:9720: 09 A1     .word sub_A109
loc_9722:
bra_case_9722_02_защитник_отобьет:
- D - I - 0x021732 17:9722: FA        .byte con_jsr
- D - I - 0x021733 17:9723: B6 A0     .word sub_A0B6_защитник_спасает_ворота
- D - I - 0x021735 17:9725: FA        .byte con_jsr
- D - I - 0x021736 17:9726: 12 A3     .word sub_A312
- D - I - 0x021738 17:9728: F2        .byte con_jmp
- D - I - 0x021739 17:9729: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_972B_03:
- - - - - 0x02173B 17:972B: FA        .byte con_jsr
- - - - - 0x02173C 17:972C: E4 A1     .word sub_A1E4_dark_illusion
loc_972E:
- - - - - 0x02173E 17:972E: FA        .byte con_jsr
- - - - - 0x02173F 17:972F: 09 A1     .word sub_A109
loc_9731:
bra_case_9731_03_штанга_и_добивание:
- D - I - 0x021741 17:9731: FA        .byte con_jsr
- D - I - 0x021742 17:9732: 4E A2     .word sub_A24E_штанга
- D - I - 0x021744 17:9734: FA        .byte con_jsr
- D - I - 0x021745 17:9735: 58 A2     .word sub_A258
- D - I - 0x021747 17:9737: FA        .byte con_jsr
- D - I - 0x021748 17:9738: 12 A2     .word sub_A212
- D - I - 0x02174A 17:973A: F2        .byte con_jmp
- D - I - 0x02174B 17:973B: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_973D_04:
- - - - - 0x02174D 17:973D: FA        .byte con_jsr
- - - - - 0x02174E 17:973E: E4 A1     .word sub_A1E4_dark_illusion
loc_9740:
- - - - - 0x021750 17:9740: FA        .byte con_jsr
- - - - - 0x021751 17:9741: 09 A1     .word sub_A109
loc_9743:
bra_case_9743_04_защитник_промахнется:
bra_case_9743_01_защитник_промахнется:
- D - I - 0x021753 17:9743: FA        .byte con_jsr
- D - I - 0x021754 17:9744: BE A0     .word sub_A0BE
- D - I - 0x021756 17:9746: F2        .byte con_jmp
- D - I - 0x021757 17:9747: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_9749_01_защитник_убьется:
- D - I - 0x021759 17:9749: F3        .byte con_branch, $83     ; результат действия защитника
- D - I - 0x02175B 17:974B: 32        .byte bra_case_977D_00 - *
- - - - - 0x02175C 17:974C: 2D        .byte bra_case_9779_01 - *
- - - - - 0x02175D 17:974D: B2        .byte bra_case_97FF_02 - *
- - - - - 0x02175E 17:974E: 28        .byte bra_case_9776_03 - *

bra_case_974F_01:
- - - - - 0x02175F 17:974F: FA        .byte con_jsr
- - - - - 0x021760 17:9750: E4 A1     .word sub_A1E4_dark_illusion
loc_9752:
- - - - - 0x021762 17:9752: FA        .byte con_jsr
- - - - - 0x021763 17:9753: 09 A1     .word sub_A109
loc_9755:
bra_case_9755_01_мяч_порвется:
- D - I - 0x021765 17:9755: FA        .byte con_jsr
- D - I - 0x021766 17:9756: F4 A2     .word sub_A2F4_сообщение_oops_на_мигающем_белом_фоне
- D - I - 0x021768 17:9758: F2        .byte con_jmp
- D - I - 0x021769 17:9759: 64 A3     .word loc_A364_рваный_мяч

bra_case_975B_02:
- D - I - 0x02176B 17:975B: FA        .byte con_jsr
- D - I - 0x02176C 17:975C: E4 A1     .word sub_A1E4_dark_illusion
loc_975E:
- D - I - 0x02176E 17:975E: FA        .byte con_jsr
- D - I - 0x02176F 17:975F: 46 A1     .word sub_A146
- D - I - 0x021771 17:9761: FA        .byte con_jsr
- D - I - 0x021772 17:9762: 08 A3     .word sub_A308
- D - I - 0x021774 17:9764: FA        .byte con_jsr
- D - I - 0x021775 17:9765: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- D - I - 0x021777 17:9767: F2        .byte con_jmp
- D - I - 0x021778 17:9768: F0 9E     .word loc_9EF0

loc_976A:
bra_case_976A_03:
- D - I - 0x02177A 17:976A: FA        .byte con_jsr
- D - I - 0x02177B 17:976B: E4 A1     .word sub_A1E4_dark_illusion
loc_976D_кипер_ловит_мяч:
- D - I - 0x02177D 17:976D: FA        .byte con_jsr
- D - I - 0x02177E 17:976E: 99 A0     .word sub_A099_анимация_кипер_ловит_мяч
loc_9770_сообщение_об_идеальном_сейве:
- D - I - 0x021780 17:9770: FA        .byte con_jsr
- D - I - 0x021781 17:9771: 4E B4     .word sub_B44E_кипер_идеально_засейвил
- D - I - 0x021783 17:9773: F2        .byte con_jmp
- D - I - 0x021784 17:9774: F0 9E     .word loc_9EF0

bra_case_9776_03:
- - - - - 0x021786 17:9776: F2        .byte con_jmp
- - - - - 0x021787 17:9777: 6A 97     .word loc_976A

bra_case_9779_01:
- - - - - 0x021789 17:9779: F3        .byte con_branch, $8C
- - - - - 0x02178B 17:977B: 02        .byte bra_case_977D_00 - *
- - - - - 0x02178C 17:977C: 71        .byte bra_case_97ED_01 - *

bra_case_977D_00:
- D - I - 0x02178D 17:977D: F3        .byte con_branch, $8D
- D - I - 0x02178F 17:977F: 05        .byte bra_case_9784_00 - *
- - - - - 0x021790 17:9780: 13        .byte bra_case_9793_01 - *
- - - - - 0x021791 17:9781: 24        .byte bra_case_97A5_02 - *
- - - - - 0x021792 17:9782: 3B        .byte bra_case_97BD_03 - *
- - - - - 0x021793 17:9783: 52        .byte bra_case_97D5_04 - *

bra_case_9784_00:
- D - I - 0x021794 17:9784: FA        .byte con_jsr
- D - I - 0x021795 17:9785: E4 A1     .word sub_A1E4_dark_illusion
loc_9787:
- D - I - 0x021797 17:9787: FA        .byte con_jsr
- D - I - 0x021798 17:9788: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_978A:
- D - I - 0x02179A 17:978A: FA        .byte con_jsr
- D - I - 0x02179B 17:978B: DD A2     .word sub_A2DD
- D - I - 0x02179D 17:978D: FA        .byte con_jsr
- D - I - 0x02179E 17:978E: B5 9F     .word sub_9FB5_убийство_кипера
- D - I - 0x0217A0 17:9790: F2        .byte con_jmp
- D - I - 0x0217A1 17:9791: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_9793_01:
- - - - - 0x0217A3 17:9793: FA        .byte con_jsr
- - - - - 0x0217A4 17:9794: E4 A1     .word sub_A1E4_dark_illusion
loc_9796:
- - - - - 0x0217A6 17:9796: FA        .byte con_jsr
- - - - - 0x0217A7 17:9797: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_9799:
- D - I - 0x0217A9 17:9799: FA        .byte con_jsr
- D - I - 0x0217AA 17:979A: DD A2     .word sub_A2DD
- D - I - 0x0217AC 17:979C: FA        .byte con_jsr
- D - I - 0x0217AD 17:979D: B5 9F     .word sub_9FB5_убийство_кипера
- D - I - 0x0217AF 17:979F: FA        .byte con_jsr
- D - I - 0x0217B0 17:97A0: 4E A2     .word sub_A24E_штанга
- D - I - 0x0217B2 17:97A2: F2        .byte con_jmp
- D - I - 0x0217B3 17:97A3: 58 A2     .word loc_A258

bra_case_97A5_02:
- - - - - 0x0217B5 17:97A5: FA        .byte con_jsr
- - - - - 0x0217B6 17:97A6: E4 A1     .word sub_A1E4_dark_illusion
loc_97A8:
- - - - - 0x0217B8 17:97A8: FA        .byte con_jsr
- - - - - 0x0217B9 17:97A9: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_97AB:
- - - - - 0x0217BB 17:97AB: FA        .byte con_jsr
- - - - - 0x0217BC 17:97AC: DD A2     .word sub_A2DD
- - - - - 0x0217BE 17:97AE: FA        .byte con_jsr
- - - - - 0x0217BF 17:97AF: B5 9F     .word sub_9FB5_убийство_кипера
- - - - - 0x0217C1 17:97B1: FA        .byte con_jsr
- - - - - 0x0217C2 17:97B2: B6 A0     .word sub_A0B6_защитник_спасает_ворота
- - - - - 0x0217C4 17:97B4: FA        .byte con_jsr
- - - - - 0x0217C5 17:97B5: E7 A2     .word sub_A2E7
- - - - - 0x0217C7 17:97B7: FA        .byte con_jsr
- - - - - 0x0217C8 17:97B8: 1B 9E     .word sub_9E1B_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x0217CA 17:97BA: F2        .byte con_jmp
- - - - - 0x0217CB 17:97BB: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_97BD_03:
- - - - - 0x0217CD 17:97BD: FA        .byte con_jsr
- - - - - 0x0217CE 17:97BE: E4 A1     .word sub_A1E4_dark_illusion
loc_97C0:
- - - - - 0x0217D0 17:97C0: FA        .byte con_jsr
- - - - - 0x0217D1 17:97C1: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_97C3:
- - - - - 0x0217D3 17:97C3: FA        .byte con_jsr
- - - - - 0x0217D4 17:97C4: DD A2     .word sub_A2DD
- - - - - 0x0217D6 17:97C6: FA        .byte con_jsr
- - - - - 0x0217D7 17:97C7: B5 9F     .word sub_9FB5_убийство_кипера
- - - - - 0x0217D9 17:97C9: FA        .byte con_jsr
- - - - - 0x0217DA 17:97CA: 4E A2     .word sub_A24E_штанга
- - - - - 0x0217DC 17:97CC: FA        .byte con_jsr
- - - - - 0x0217DD 17:97CD: 58 A2     .word sub_A258
- - - - - 0x0217DF 17:97CF: FA        .byte con_jsr
- - - - - 0x0217E0 17:97D0: 12 A2     .word sub_A212
- - - - - 0x0217E2 17:97D2: F2        .byte con_jmp
- - - - - 0x0217E3 17:97D3: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_97D5_04:
- - - - - 0x0217E5 17:97D5: FA        .byte con_jsr
- - - - - 0x0217E6 17:97D6: E4 A1     .word sub_A1E4_dark_illusion
loc_97D8:
- - - - - 0x0217E8 17:97D8: FA        .byte con_jsr
- - - - - 0x0217E9 17:97D9: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_97DB:
- D - I - 0x0217EB 17:97DB: FA        .byte con_jsr
- D - I - 0x0217EC 17:97DC: DD A2     .word sub_A2DD
- D - I - 0x0217EE 17:97DE: FA        .byte con_jsr
- D - I - 0x0217EF 17:97DF: B5 9F     .word sub_9FB5_убийство_кипера
- D - I - 0x0217F1 17:97E1: FA        .byte con_jsr
- D - I - 0x0217F2 17:97E2: B6 A0     .word sub_A0B6_защитник_спасает_ворота
- D - I - 0x0217F4 17:97E4: FA        .byte con_jsr
- D - I - 0x0217F5 17:97E5: E7 A2     .word sub_A2E7
- D - I - 0x0217F7 17:97E7: FA        .byte con_jsr
- D - I - 0x0217F8 17:97E8: 1B 9E     .word sub_9E1B_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x0217FA 17:97EA: F2        .byte con_jmp
- D - I - 0x0217FB 17:97EB: 28 9C     .word loc_9C28_проверка_на_рваную_сетку

bra_case_97ED_01:
- - - - - 0x0217FD 17:97ED: FA        .byte con_jsr
- - - - - 0x0217FE 17:97EE: E4 A1     .word sub_A1E4_dark_illusion
loc_97F0:
- - - - - 0x021800 17:97F0: FA        .byte con_jsr
- - - - - 0x021801 17:97F1: 1D A1     .word sub_A11D_анимация_лови_мячи
loc_97F3:
- D - I - 0x021803 17:97F3: FA        .byte con_jsr
- D - I - 0x021804 17:97F4: DD A2     .word sub_A2DD
- D - I - 0x021806 17:97F6: FA        .byte con_jsr
- D - I - 0x021807 17:97F7: B5 9F     .word sub_9FB5_убийство_кипера
- D - I - 0x021809 17:97F9: FA        .byte con_jsr
- D - I - 0x02180A 17:97FA: F4 A2     .word sub_A2F4_сообщение_oops_на_мигающем_белом_фоне
- D - I - 0x02180C 17:97FC: F2        .byte con_jmp
- D - I - 0x02180D 17:97FD: 64 A3     .word loc_A364_рваный_мяч

bra_case_97FF_02:
- - - - - 0x02180F 17:97FF: FA        .byte con_jsr
- - - - - 0x021810 17:9800: E4 A1     .word sub_A1E4_dark_illusion
loc_9802:
- - - - - 0x021812 17:9802: FA        .byte con_jsr
- - - - - 0x021813 17:9803: 1D A1     .word sub_A11D_анимация_лови_мячи
- - - - - 0x021815 17:9805: FA        .byte con_jsr
- - - - - 0x021816 17:9806: DD A2     .word sub_A2DD
- - - - - 0x021818 17:9808: FA        .byte con_jsr
- - - - - 0x021819 17:9809: B5 9F     .word sub_9FB5_убийство_кипера
- - - - - 0x02181B 17:980B: FA        .byte con_jsr
- - - - - 0x02181C 17:980C: 71 A3     .word sub_A371_мяч_улетает_в_сторону
- - - - - 0x02181E 17:980E: F2        .byte con_jmp
- - - - - 0x02181F 17:980F: F0 9E     .word loc_9EF0



_scenario_9811_0A:
- D - I - 0x021821 17:9811: F3        .byte con_branch, $8E     ; действие атаки на земле
- D - I - 0x021823 17:9813: 03        .byte bra_case_9816_00_shoot - *
- - - - - 0x021824 17:9814: 21        .byte bra_case_9835_01_pass - *
- D - I - 0x021825 17:9815: 08        .byte bra_case_981D_02_dribble - *

bra_case_9816_00_shoot:
- D - I - 0x021826 17:9816: FA        .byte con_jsr
- D - I - 0x021827 17:9817: D6 9F     .word sub_9FD6
- D - I - 0x021829 17:9819: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x02182B 17:981B: 0B        .byte bra_case_9826_00_защитник_выживет - *
- D - I - 0x02182C 17:981C: 44        .byte bra_case_9860_01_защитник_убьется - *

bra_case_981D_02_dribble:
- D - I - 0x02182D 17:981D: FA        .byte con_jsr
- D - I - 0x02182E 17:981E: D6 9F     .word sub_9FD6
- D - I - 0x021830 17:9820: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021832 17:9822: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x021834 17:9824: 70        .byte bra_case_9894_00_защитник_выживет - *
- D - I - 0x021835 17:9825: 94        .byte bra_case_98B9_01_защитник_убьется - *

bra_case_9826_00_защитник_выживет:
- D - I - 0x021836 17:9826: F3        .byte con_branch, $8F
- D - I - 0x021838 17:9828: 05        .byte bra_case_982D_00 - *
- D - I - 0x021839 17:9829: 0D        .byte bra_case_9836_01 - *
- D - I - 0x02183A 17:982A: 1A        .byte bra_case_9844_02 - *
- D - I - 0x02183B 17:982B: 27        .byte bra_case_9852_03 - *
- - - - - 0x02183C 17:982C: 2E        .byte bra_case_985A_04 - *

bra_case_982D_00:
- D - I - 0x02183D 17:982D: FA        .byte con_jsr
- D - I - 0x02183E 17:982E: F3 9C     .word sub_9CF3
- D - I - 0x021840 17:9830: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021842 17:9832: FA        .byte con_jsr
- D - I - 0x021843 17:9833: 8D A0     .word sub_A08D
bra_case_9835_01_pass:
- D - I - 0x021845 17:9835: F0        .byte con_quit

bra_case_9836_01:
- D - I - 0x021846 17:9836: FA        .byte con_jsr
- D - I - 0x021847 17:9837: F3 9C     .word sub_9CF3
- D - I - 0x021849 17:9839: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02184B 17:983B: FA        .byte con_jsr
- D - I - 0x02184C 17:983C: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- D - I - 0x02184E 17:983E: FA        .byte con_jsr
- D - I - 0x02184F 17:983F: 08 A3     .word sub_A308
- D - I - 0x021851 17:9841: F2        .byte con_jmp
- D - I - 0x021852 17:9842: 5D B4     .word loc_B45D

bra_case_9844_02:
- D - I - 0x021854 17:9844: FA        .byte con_jsr
- D - I - 0x021855 17:9845: F3 9C     .word sub_9CF3
- D - I - 0x021857 17:9847: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021859 17:9849: FA        .byte con_jsr
- D - I - 0x02185A 17:984A: 4B A1     .word sub_A14B
- D - I - 0x02185C 17:984C: FA        .byte con_jsr
- D - I - 0x02185D 17:984D: 08 A3     .word sub_A308
- D - I - 0x02185F 17:984F: F2        .byte con_jmp
- D - I - 0x021860 17:9850: 5D B4     .word loc_B45D

bra_case_9852_03:
- D - I - 0x021862 17:9852: FA        .byte con_jsr
- D - I - 0x021863 17:9853: F3 9C     .word sub_9CF3
- D - I - 0x021865 17:9855: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021867 17:9857: F2        .byte con_jmp
- D - I - 0x021868 17:9858: A6 A0     .word loc_A0A6_кипер_ловит_мяч_со_звуком

bra_case_985A_04:
- - - - - 0x02186A 17:985A: FA        .byte con_jsr
- - - - - 0x02186B 17:985B: DD A2     .word sub_A2DD
- - - - - 0x02186D 17:985D: F2        .byte con_jmp
- - - - - 0x02186E 17:985E: 5B A3     .word loc_A35B_нарушение

bra_case_9860_01_защитник_убьется:
- D - I - 0x021870 17:9860: F3        .byte con_branch, $8F
- D - I - 0x021872 17:9862: 05        .byte bra_case_9867_00 - *
- - - - - 0x021873 17:9863: 12        .byte bra_case_9875_01 - *
- - - - - 0x021874 17:9864: 11        .byte bra_case_9875_02 - *
- D - I - 0x021875 17:9865: 1B        .byte bra_case_9880_03 - *
- - - - - 0x021876 17:9866: 25        .byte bra_case_988B_04 - *

bra_case_9867_00:
- D - I - 0x021877 17:9867: FA        .byte con_jsr
- D - I - 0x021878 17:9868: F3 9C     .word sub_9CF3
- D - I - 0x02187A 17:986A: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02187C 17:986C: FA        .byte con_jsr
- D - I - 0x02187D 17:986D: A1 A0     .word sub_A0A1_кипер_ловит_мяч_без_звука
- D - I - 0x02187F 17:986F: FA        .byte con_jsr
- D - I - 0x021880 17:9870: DD A2     .word sub_A2DD
- D - I - 0x021882 17:9872: F2        .byte con_jmp
- D - I - 0x021883 17:9873: B5 9F     .word loc_9FB5_убийство_кипера

bra_case_9875_01:
bra_case_9875_02:
- - - - - 0x021885 17:9875: FA        .byte con_jsr
- - - - - 0x021886 17:9876: DD A2     .word sub_A2DD
- - - - - 0x021888 17:9878: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- - - - - 0x02188A 17:987A: FA        .byte con_jsr
- - - - - 0x02188B 17:987B: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x02188D 17:987D: F2        .byte con_jmp

- - - - - 0x02188E 17:987E: 71 A3     .word loc_A371_мяч_улетает_в_сторону
bra_case_9880_03:
- D - I - 0x021890 17:9880: FA        .byte con_jsr
- D - I - 0x021891 17:9881: DD A2     .word sub_A2DD
- D - I - 0x021893 17:9883: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021895 17:9885: FA        .byte con_jsr
- D - I - 0x021896 17:9886: 68 9F     .word sub_9F68_рандом_анимации_отпизженного_игрока_без_сообщения
- D - I - 0x021898 17:9888: F2        .byte con_jmp
- D - I - 0x021899 17:9889: BF 9F     .word loc_9FBF

bra_case_988B_04:
- - - - - 0x02189B 17:988B: FA        .byte con_jsr
- - - - - 0x02189C 17:988C: DD A2     .word sub_A2DD
- - - - - 0x02189E 17:988E: FA        .byte con_jsr
- - - - - 0x02189F 17:988F: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x0218A1 17:9891: F2        .byte con_jmp
- - - - - 0x0218A2 17:9892: 5B A3     .word loc_A35B_нарушение

bra_case_9894_00_защитник_выживет:
- D - I - 0x0218A4 17:9894: F3        .byte con_branch, $8F
- D - I - 0x0218A6 17:9896: 05        .byte bra_case_989B_00 - *
- D - I - 0x0218A7 17:9897: 07        .byte bra_case_989E_01 - *
- D - I - 0x0218A8 17:9898: 06        .byte bra_case_989E_02 - *
- D - I - 0x0218A9 17:9899: 0E        .byte bra_case_98A7_03 - *
- D - I - 0x0218AA 17:989A: 16        .byte bra_case_98B0_04 - *

bra_case_989B_00:
- D - I - 0x0218AB 17:989B: F2        .byte con_jmp
- D - I - 0x0218AC 17:989C: C0 9C     .word loc_9CC0_выбор_анимации_дриблинга_легкой_обводки

bra_case_989E_01:
bra_case_989E_02:
- D - I - 0x0218AE 17:989E: FA        .byte con_jsr
- D - I - 0x0218AF 17:989F: FE 9D     .word sub_9DFE
- D - I - 0x0218B1 17:98A1: FA        .byte con_jsr
- D - I - 0x0218B2 17:98A2: 08 A3     .word sub_A308
- D - I - 0x0218B4 17:98A4: F2        .byte con_jmp
- D - I - 0x0218B5 17:98A5: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_98A7_03:
- D - I - 0x0218B7 17:98A7: FA        .byte con_jsr
- D - I - 0x0218B8 17:98A8: FE 9D     .word sub_9DFE
- D - I - 0x0218BA 17:98AA: FA        .byte con_jsr
- D - I - 0x0218BB 17:98AB: EF A2     .word sub_A2EF
- D - I - 0x0218BD 17:98AD: F2        .byte con_jmp
- D - I - 0x0218BE 17:98AE: CE 9F     .word loc_9FCE

bra_case_98B0_04:
- D - I - 0x0218C0 17:98B0: FA        .byte con_jsr
- D - I - 0x0218C1 17:98B1: FE 9D     .word sub_9DFE
- D - I - 0x0218C3 17:98B3: FA        .byte con_jsr
- D - I - 0x0218C4 17:98B4: DD A2     .word sub_A2DD
- D - I - 0x0218C6 17:98B6: F2        .byte con_jmp
- D - I - 0x0218C7 17:98B7: 5B A3     .word loc_A35B_нарушение

bra_case_98B9_01_защитник_убьется:
- D - I - 0x0218C9 17:98B9: F3        .byte con_branch, $8F
- - - - - 0x0218CB 17:98BB: 05        .byte bra_case_98C0_00 - *
- D - I - 0x0218CC 17:98BC: 0D        .byte bra_case_98C9_01 - *
- D - I - 0x0218CD 17:98BD: 0C        .byte bra_case_98C9_02 - *
- D - I - 0x0218CE 17:98BE: 17        .byte bra_case_98D5_03 - *
- - - - - 0x0218CF 17:98BF: 22        .byte bra_case_98E1_04 - *

bra_case_98C0_00:
- - - - - 0x0218D0 17:98C0: FA        .byte con_jsr
- - - - - 0x0218D1 17:98C1: FE 9D     .word sub_9DFE
- - - - - 0x0218D3 17:98C3: FA        .byte con_jsr
- - - - - 0x0218D4 17:98C4: DD A2     .word sub_A2DD
- - - - - 0x0218D6 17:98C6: F2        .byte con_jmp
- - - - - 0x0218D7 17:98C7: B5 9F     .word loc_9FB5_убийство_кипера

bra_case_98C9_01:
bra_case_98C9_02:
- D - I - 0x0218D9 17:98C9: FA        .byte con_jsr
- D - I - 0x0218DA 17:98CA: FE 9D     .word sub_9DFE
- D - I - 0x0218DC 17:98CC: FA        .byte con_jsr
- D - I - 0x0218DD 17:98CD: DD A2     .word sub_A2DD
- D - I - 0x0218DF 17:98CF: FA        .byte con_jsr
- D - I - 0x0218E0 17:98D0: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x0218E2 17:98D2: F2        .byte con_jmp
- D - I - 0x0218E3 17:98D3: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_98D5_03:
- D - I - 0x0218E5 17:98D5: FA        .byte con_jsr
- D - I - 0x0218E6 17:98D6: FE 9D     .word sub_9DFE
- D - I - 0x0218E8 17:98D8: FA        .byte con_jsr
- D - I - 0x0218E9 17:98D9: DD A2     .word sub_A2DD
- D - I - 0x0218EB 17:98DB: FA        .byte con_jsr
- D - I - 0x0218EC 17:98DC: 68 9F     .word sub_9F68_рандом_анимации_отпизженного_игрока_без_сообщения
- D - I - 0x0218EE 17:98DE: F2        .byte con_jmp
- D - I - 0x0218EF 17:98DF: BF 9F     .word loc_9FBF

bra_case_98E1_04:
- - - - - 0x0218F1 17:98E1: FA        .byte con_jsr
- - - - - 0x0218F2 17:98E2: FE 9D     .word sub_9DFE
- - - - - 0x0218F4 17:98E4: FA        .byte con_jsr
- - - - - 0x0218F5 17:98E5: DD A2     .word sub_A2DD
- - - - - 0x0218F7 17:98E7: FA        .byte con_jsr
- - - - - 0x0218F8 17:98E8: 6E 9F     .word sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x0218FA 17:98EA: F2        .byte con_jmp
- - - - - 0x0218FB 17:98EB: 5B A3     .word loc_A35B_нарушение



_scenario_98ED_0B:
- D - I - 0x0218FD 17:98ED: F3        .byte con_branch, $04     ; мяч у атакующего/низкий, или высокий
- D - I - 0x0218FF 17:98EF: F3 98     .word bra_long_case_98F3_00
- D - I - 0x021901 17:98F1: 24 9A     .word bra_long_case_9A24_01

bra_long_case_98F3_00:
- D - I - 0x021903 17:98F3: F3        .byte con_branch, $90
- D - I - 0x021905 17:98F5: 05        .byte bra_case_98FA_00 - *
- D - I - 0x021906 17:98F6: 3D        .byte bra_case_9933_01 - *
- D - I - 0x021907 17:98F7: 74        .byte bra_case_996B_02 - *
- - - - - 0x021908 17:98F8: B8        .byte bra_case_99B0_03 - *
- - - - - 0x021909 17:98F9: EF        .byte bra_case_99E8_04 - *

bra_case_98FA_00:
- D - I - 0x02190A 17:98FA: FD        .byte con_mirror_condition, $00
- D - I - 0x02190C 17:98FC: F3        .byte con_branch, $8F
- D - I - 0x02190E 17:98FE: 04        .byte bra_case_9902_00 - *
- D - I - 0x02190F 17:98FF: 0D        .byte bra_case_990C_01 - *
- D - I - 0x021910 17:9900: 1B        .byte bra_case_991B_02 - *
- D - I - 0x021911 17:9901: 29        .byte bra_case_992A_03 - *

bra_case_9902_00:
- D - I - 0x021912 17:9902: FA        .byte con_jsr
- D - I - 0x021913 17:9903: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x021915 17:9905: FA        .byte con_jsr
- D - I - 0x021916 17:9906: C3 A1     .word sub_A1C3
- D - I - 0x021918 17:9908: F2        .byte con_jmp
- D - I - 0x021919 17:9909: EA 9F     .word loc_9FEA

- - - - - 0x02191B 17:990B: F0        .byte con_quit

bra_case_990C_01:
- D - I - 0x02191C 17:990C: FA        .byte con_jsr
- D - I - 0x02191D 17:990D: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x02191F 17:990F: FA        .byte con_jsr
- D - I - 0x021920 17:9910: C3 A1     .word sub_A1C3
- D - I - 0x021922 17:9912: FA        .byte con_jsr
- D - I - 0x021923 17:9913: FD 9F     .word sub_9FFD
- D - I - 0x021925 17:9915: FA        .byte con_jsr
- D - I - 0x021926 17:9916: F3 9F     .word sub_9FF3
- D - I - 0x021928 17:9918: F2        .byte con_jmp
- D - I - 0x021929 17:9919: DE 9F     .word loc_9FDE

bra_case_991B_02:
- D - I - 0x02192B 17:991B: FA        .byte con_jsr
- D - I - 0x02192C 17:991C: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x02192E 17:991E: FA        .byte con_jsr
- D - I - 0x02192F 17:991F: C3 A1     .word sub_A1C3
- D - I - 0x021931 17:9921: FA        .byte con_jsr
- D - I - 0x021932 17:9922: 04 A0     .word sub_A004
- D - I - 0x021934 17:9924: FA        .byte con_jsr
- D - I - 0x021935 17:9925: F1 9F     .word sub_9FF1
- D - I - 0x021937 17:9927: F2        .byte con_jmp
- D - I - 0x021938 17:9928: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_992A_03:
- D - I - 0x02193A 17:992A: FA        .byte con_jsr
- D - I - 0x02193B 17:992B: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x02193D 17:992D: FA        .byte con_jsr
- D - I - 0x02193E 17:992E: C3 A1     .word sub_A1C3
- D - I - 0x021940 17:9930: F2        .byte con_jmp
- D - I - 0x021941 17:9931: 64 A1     .word loc_A164

bra_case_9933_01:
- D - I - 0x021943 17:9933: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021945 17:9935: F3        .byte con_branch, $8F
- D - I - 0x021947 17:9937: 04        .byte bra_case_993B_00 - *
- D - I - 0x021948 17:9938: 0C        .byte bra_case_9944_01 - *
- D - I - 0x021949 17:9939: 1A        .byte bra_case_9953_02 - *
- D - I - 0x02194A 17:993A: 28        .byte bra_case_9962_03 - *

bra_case_993B_00:
- D - I - 0x02194B 17:993B: FA        .byte con_jsr
- D - I - 0x02194C 17:993C: 2D A3     .word sub_A32D
- D - I - 0x02194E 17:993E: FA        .byte con_jsr
- D - I - 0x02194F 17:993F: C3 A1     .word sub_A1C3
- D - I - 0x021951 17:9941: F2        .byte con_jmp
- D - I - 0x021952 17:9942: EA 9F     .word loc_9FEA

bra_case_9944_01:
- D - I - 0x021954 17:9944: FA        .byte con_jsr
- D - I - 0x021955 17:9945: 2D A3     .word sub_A32D
- D - I - 0x021957 17:9947: FA        .byte con_jsr
- D - I - 0x021958 17:9948: C3 A1     .word sub_A1C3
- D - I - 0x02195A 17:994A: FA        .byte con_jsr
- D - I - 0x02195B 17:994B: FD 9F     .word sub_9FFD
- D - I - 0x02195D 17:994D: FA        .byte con_jsr
- D - I - 0x02195E 17:994E: F3 9F     .word sub_9FF3
- D - I - 0x021960 17:9950: F2        .byte con_jmp
- D - I - 0x021961 17:9951: DE 9F     .word loc_9FDE

bra_case_9953_02:
- D - I - 0x021963 17:9953: FA        .byte con_jsr
- D - I - 0x021964 17:9954: 2D A3     .word sub_A32D
- D - I - 0x021966 17:9956: FA        .byte con_jsr
- D - I - 0x021967 17:9957: C3 A1     .word sub_A1C3
- D - I - 0x021969 17:9959: FA        .byte con_jsr
- D - I - 0x02196A 17:995A: 04 A0     .word sub_A004
- D - I - 0x02196C 17:995C: FA        .byte con_jsr
- D - I - 0x02196D 17:995D: F1 9F     .word sub_9FF1
- D - I - 0x02196F 17:995F: F2        .byte con_jmp
- D - I - 0x021970 17:9960: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9962_03:
- D - I - 0x021972 17:9962: FA        .byte con_jsr
- D - I - 0x021973 17:9963: 2D A3     .word sub_A32D
- D - I - 0x021975 17:9965: FA        .byte con_jsr
- D - I - 0x021976 17:9966: C3 A1     .word sub_A1C3
- D - I - 0x021978 17:9968: F2        .byte con_jmp
- D - I - 0x021979 17:9969: 64 A1     .word loc_A164

bra_case_996B_02:
- D - I - 0x02197B 17:996B: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02197D 17:996D: F3        .byte con_branch, $8F
- D - I - 0x02197F 17:996F: 04        .byte bra_case_9973_00 - *
- D - I - 0x021980 17:9970: 13        .byte bra_case_9983_01 - *
- D - I - 0x021981 17:9971: 24        .byte bra_case_9995_02 - *
- D - I - 0x021982 17:9972: 35        .byte bra_case_99A7_03 - *

bra_case_9973_00:
- D - I - 0x021983 17:9973: FA        .byte con_jsr
- D - I - 0x021984 17:9974: 2D A3     .word sub_A32D
- D - I - 0x021986 17:9976: FA        .byte con_jsr
- D - I - 0x021987 17:9977: C3 A1     .word sub_A1C3
- D - I - 0x021989 17:9979: FA        .byte con_jsr
- D - I - 0x02198A 17:997A: 04 A0     .word sub_A004
- D - I - 0x02198C 17:997C: FA        .byte con_jsr
- D - I - 0x02198D 17:997D: DD A2     .word sub_A2DD
- D - I - 0x02198F 17:997F: FA        .byte con_jsr
- D - I - 0x021990 17:9980: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x021992 17:9982: F0        .byte con_quit

bra_case_9983_01:
- D - I - 0x021993 17:9983: FA        .byte con_jsr
- D - I - 0x021994 17:9984: 2D A3     .word sub_A32D
- D - I - 0x021996 17:9986: FA        .byte con_jsr
- D - I - 0x021997 17:9987: C3 A1     .word sub_A1C3
- D - I - 0x021999 17:9989: FA        .byte con_jsr
- D - I - 0x02199A 17:998A: 04 A0     .word sub_A004
- D - I - 0x02199C 17:998C: FA        .byte con_jsr
- D - I - 0x02199D 17:998D: DD A2     .word sub_A2DD
- D - I - 0x02199F 17:998F: FA        .byte con_jsr
- D - I - 0x0219A0 17:9990: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x0219A2 17:9992: F2        .byte con_jmp
- D - I - 0x0219A3 17:9993: 40 A2     .word loc_A240

bra_case_9995_02:
- D - I - 0x0219A5 17:9995: FA        .byte con_jsr
- D - I - 0x0219A6 17:9996: 2D A3     .word sub_A32D
- D - I - 0x0219A8 17:9998: FA        .byte con_jsr
- D - I - 0x0219A9 17:9999: C3 A1     .word sub_A1C3
- D - I - 0x0219AB 17:999B: FA        .byte con_jsr
- D - I - 0x0219AC 17:999C: 04 A0     .word sub_A004
- D - I - 0x0219AE 17:999E: FA        .byte con_jsr
- D - I - 0x0219AF 17:999F: E7 A2     .word sub_A2E7
- D - I - 0x0219B1 17:99A1: FA        .byte con_jsr
- D - I - 0x0219B2 17:99A2: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x0219B4 17:99A4: F2        .byte con_jmp
- D - I - 0x0219B5 17:99A5: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_99A7_03:
- D - I - 0x0219B7 17:99A7: FA        .byte con_jsr
- D - I - 0x0219B8 17:99A8: 2D A3     .word sub_A32D
- D - I - 0x0219BA 17:99AA: FA        .byte con_jsr
- D - I - 0x0219BB 17:99AB: C3 A1     .word sub_A1C3
- D - I - 0x0219BD 17:99AD: F2        .byte con_jmp
- D - I - 0x0219BE 17:99AE: 64 A1     .word loc_A164

bra_case_99B0_03:
- - - - - 0x0219C0 17:99B0: FD        .byte con_mirror_condition, $00
- - - - - 0x0219C2 17:99B2: F3        .byte con_branch, $8F
- - - - - 0x0219C4 17:99B4: 04        .byte bra_case_99B8_00 - *
- - - - - 0x0219C5 17:99B5: 0C        .byte bra_case_99C1_01 - *
- - - - - 0x0219C6 17:99B6: 1A        .byte bra_case_99D0_02 - *
- - - - - 0x0219C7 17:99B7: 28        .byte bra_case_99DF_03 - *
bra_case_99B8_00:
- - - - - 0x0219C8 17:99B8: FA        .byte con_jsr
- - - - - 0x0219C9 17:99B9: 49 B4     .word sub_B449
- - - - - 0x0219CB 17:99BB: FA        .byte con_jsr
- - - - - 0x0219CC 17:99BC: C3 A1     .word sub_A1C3
- - - - - 0x0219CE 17:99BE: F2        .byte con_jmp
- - - - - 0x0219CF 17:99BF: EA 9F     .word loc_9FEA

bra_case_99C1_01:
- - - - - 0x0219D1 17:99C1: FA        .byte con_jsr
- - - - - 0x0219D2 17:99C2: 49 B4     .word sub_B449
- - - - - 0x0219D4 17:99C4: FA        .byte con_jsr
- - - - - 0x0219D5 17:99C5: C3 A1     .word sub_A1C3
- - - - - 0x0219D7 17:99C7: FA        .byte con_jsr
- - - - - 0x0219D8 17:99C8: FD 9F     .word sub_9FFD
- - - - - 0x0219DA 17:99CA: FA        .byte con_jsr
- - - - - 0x0219DB 17:99CB: F3 9F     .word sub_9FF3
- - - - - 0x0219DD 17:99CD: F2        .byte con_jmp
- - - - - 0x0219DE 17:99CE: DE 9F     .word loc_9FDE

bra_case_99D0_02:
- - - - - 0x0219E0 17:99D0: FA        .byte con_jsr
- - - - - 0x0219E1 17:99D1: 49 B4     .word sub_B449
- - - - - 0x0219E3 17:99D3: FA        .byte con_jsr
- - - - - 0x0219E4 17:99D4: C3 A1     .word sub_A1C3
- - - - - 0x0219E6 17:99D6: FA        .byte con_jsr
- - - - - 0x0219E7 17:99D7: 04 A0     .word sub_A004
- - - - - 0x0219E9 17:99D9: FA        .byte con_jsr
- - - - - 0x0219EA 17:99DA: F1 9F     .word sub_9FF1
- - - - - 0x0219EC 17:99DC: F2        .byte con_jmp
- - - - - 0x0219ED 17:99DD: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_99DF_03:
- - - - - 0x0219EF 17:99DF: FA        .byte con_jsr
- - - - - 0x0219F0 17:99E0: 49 B4     .word sub_B449
- - - - - 0x0219F2 17:99E2: FA        .byte con_jsr
- - - - - 0x0219F3 17:99E3: C3 A1     .word sub_A1C3
- - - - - 0x0219F5 17:99E5: F2        .byte con_jmp
- - - - - 0x0219F6 17:99E6: 64 A1     .word loc_A164

bra_case_99E8_04:
- - - - - 0x0219F8 17:99E8: FD        .byte con_mirror_condition, $00
- - - - - 0x0219FA 17:99EA: F3        .byte con_branch, $8F
- - - - - 0x0219FC 17:99EC: 04        .byte bra_case_99F0_00 - *
- - - - - 0x0219FD 17:99ED: 13        .byte bra_case_9A00_01 - *
- - - - - 0x0219FE 17:99EE: 24        .byte bra_case_9A12_02 - *
- - - - - 0x0219FF 17:99EF: 10        .byte bra_case_99FF_03 - *

bra_case_99F0_00:
- - - - - 0x021A00 17:99F0: FA        .byte con_jsr
- - - - - 0x021A01 17:99F1: 49 B4     .word sub_B449
- - - - - 0x021A03 17:99F3: FA        .byte con_jsr
- - - - - 0x021A04 17:99F4: C3 A1     .word sub_A1C3
- - - - - 0x021A06 17:99F6: FA        .byte con_jsr
- - - - - 0x021A07 17:99F7: 04 A0     .word sub_A004
- - - - - 0x021A09 17:99F9: FA        .byte con_jsr
- - - - - 0x021A0A 17:99FA: E7 A2     .word sub_A2E7
- - - - - 0x021A0C 17:99FC: FA        .byte con_jsr
- - - - - 0x021A0D 17:99FD: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_99FF_03:
- - - - - 0x021A0F 17:99FF: F0        .byte con_quit

bra_case_9A00_01:
- - - - - 0x021A10 17:9A00: FA        .byte con_jsr
- - - - - 0x021A11 17:9A01: 49 B4     .word sub_B449
- - - - - 0x021A13 17:9A03: FA        .byte con_jsr
- - - - - 0x021A14 17:9A04: C3 A1     .word sub_A1C3
- - - - - 0x021A16 17:9A06: FA        .byte con_jsr
- - - - - 0x021A17 17:9A07: 04 A0     .word sub_A004
- - - - - 0x021A19 17:9A09: FA        .byte con_jsr
- - - - - 0x021A1A 17:9A0A: E7 A2     .word sub_A2E7
- - - - - 0x021A1C 17:9A0C: FA        .byte con_jsr
- - - - - 0x021A1D 17:9A0D: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021A1F 17:9A0F: F2        .byte con_jmp
- - - - - 0x021A20 17:9A10: 40 A2     .word loc_A240

bra_case_9A12_02:
- - - - - 0x021A22 17:9A12: FA        .byte con_jsr
- - - - - 0x021A23 17:9A13: 49 B4     .word sub_B449
- - - - - 0x021A25 17:9A15: FA        .byte con_jsr
- - - - - 0x021A26 17:9A16: C3 A1     .word sub_A1C3
- - - - - 0x021A28 17:9A18: FA        .byte con_jsr
- - - - - 0x021A29 17:9A19: 04 A0     .word sub_A004
- - - - - 0x021A2B 17:9A1B: FA        .byte con_jsr
- - - - - 0x021A2C 17:9A1C: E7 A2     .word sub_A2E7
- - - - - 0x021A2E 17:9A1E: FA        .byte con_jsr
- - - - - 0x021A2F 17:9A1F: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021A31 17:9A21: F2        .byte con_jmp
- - - - - 0x021A32 17:9A22: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_long_case_9A24_01:
- D - I - 0x021A34 17:9A24: F3        .byte con_branch, $90
- D - I - 0x021A36 17:9A26: 05        .byte bra_case_9A2B_00 - *
- D - I - 0x021A37 17:9A27: 49        .byte bra_case_9A70_01 - *
- D - I - 0x021A38 17:9A28: 50        .byte bra_case_9A78_02 - *
- - - - - 0x021A39 17:9A29: D0        .byte bra_case_9AF9_03 - *
- - - - - 0x021A3A 17:9A2A: F5        .byte bra_case_9B1F_04 - *

bra_case_9A2B_00:
- D - I - 0x021A3B 17:9A2B: FD        .byte con_mirror_condition, $00
- D - I - 0x021A3D 17:9A2D: F3        .byte con_branch, $8F
- D - I - 0x021A3F 17:9A2F: 04        .byte bra_case_9A33_00 - *
- D - I - 0x021A40 17:9A30: 10        .byte bra_case_9A40_01 - *
- D - I - 0x021A41 17:9A31: 21        .byte bra_case_9A52_02 - *
- D - I - 0x021A42 17:9A32: 32        .byte bra_case_9A64_03 - *

bra_case_9A33_00:
- D - I - 0x021A43 17:9A33: FA        .byte con_jsr
- D - I - 0x021A44 17:9A34: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x021A46 17:9A36: FA        .byte con_jsr
- D - I - 0x021A47 17:9A37: AE A0     .word sub_A0AE
- D - I - 0x021A49 17:9A39: FA        .byte con_jsr
- D - I - 0x021A4A 17:9A3A: D8 A2     .word sub_A2D8
- D - I - 0x021A4C 17:9A3C: F2        .byte con_jmp
- D - I - 0x021A4D 17:9A3D: 76 A1     .word loc_A176

bra_case_9A40_01:
- D - I - 0x021A50 17:9A40: FA        .byte con_jsr
- D - I - 0x021A51 17:9A41: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x021A53 17:9A43: FA        .byte con_jsr
- D - I - 0x021A54 17:9A44: AE A0     .word sub_A0AE
- D - I - 0x021A56 17:9A46: FA        .byte con_jsr
- D - I - 0x021A57 17:9A47: D8 A2     .word sub_A2D8
- D - I - 0x021A59 17:9A49: FA        .byte con_jsr
- D - I - 0x021A5A 17:9A4A: 2F A0     .word sub_A02F
- D - I - 0x021A5C 17:9A4C: FA        .byte con_jsr
- D - I - 0x021A5D 17:9A4D: 51 A0     .word sub_A051
- D - I - 0x021A5F 17:9A4F: F2        .byte con_jmp
- D - I - 0x021A60 17:9A50: 4C A0     .word loc_A04C

bra_case_9A52_02:
- D - I - 0x021A62 17:9A52: FA        .byte con_jsr
- D - I - 0x021A63 17:9A53: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x021A65 17:9A55: FA        .byte con_jsr
- D - I - 0x021A66 17:9A56: AE A0     .word sub_A0AE
- D - I - 0x021A68 17:9A58: FA        .byte con_jsr
- D - I - 0x021A69 17:9A59: D8 A2     .word sub_A2D8
- D - I - 0x021A6B 17:9A5B: FA        .byte con_jsr
- D - I - 0x021A6C 17:9A5C: 47 A0     .word sub_A047
- D - I - 0x021A6E 17:9A5E: FA        .byte con_jsr
- D - I - 0x021A6F 17:9A5F: 23 A0     .word sub_A023
- D - I - 0x021A71 17:9A61: F2        .byte con_jmp
- D - I - 0x021A72 17:9A62: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9A64_03:
- D - I - 0x021A74 17:9A64: FA        .byte con_jsr
- D - I - 0x021A75 17:9A65: 35 A3     .word sub_A335_полет_нижнего_мяча
- D - I - 0x021A77 17:9A67: FA        .byte con_jsr
- D - I - 0x021A78 17:9A68: AE A0     .word sub_A0AE
- D - I - 0x021A7A 17:9A6A: FA        .byte con_jsr
- D - I - 0x021A7B 17:9A6B: D8 A2     .word sub_A2D8
- D - I - 0x021A7D 17:9A6D: F2        .byte con_jmp
- D - I - 0x021A7E 17:9A6E: 85 A1     .word loc_A185

bra_case_9A70_01:
- D - I - 0x021A80 17:9A70: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021A82 17:9A72: F3        .byte con_branch, $8F
- D - I - 0x021A84 17:9A74: 0C        .byte bra_case_9A80_00 - *
- D - I - 0x021A85 17:9A75: 17        .byte bra_case_9A8C_01 - *
- D - I - 0x021A86 17:9A76: 28        .byte bra_case_9A9E_02 - *
- D - I - 0x021A87 17:9A77: 39        .byte bra_case_9AB0_03 - *

bra_case_9A78_02:
- D - I - 0x021A88 17:9A78: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021A8A 17:9A7A: F3        .byte con_branch, $8F
- D - I - 0x021A8C 17:9A7C: 40        .byte bra_case_9ABC_00 - *
- D - I - 0x021A8D 17:9A7D: 52        .byte bra_case_9ACF_01 - *
- D - I - 0x021A8E 17:9A7E: 66        .byte bra_case_9AE4_02 - *
- - - - - 0x021A8F 17:9A7F: 31        .byte bra_case_9AB0_03 - *

bra_case_9A80_00:
- D - I - 0x021A90 17:9A80: FA        .byte con_jsr
- D - I - 0x021A91 17:9A81: 2D A3     .word sub_A32D
- D - I - 0x021A93 17:9A83: FA        .byte con_jsr
- D - I - 0x021A94 17:9A84: AE A0     .word sub_A0AE
- D - I - 0x021A96 17:9A86: FA        .byte con_jsr
- D - I - 0x021A97 17:9A87: D8 A2     .word sub_A2D8
- D - I - 0x021A99 17:9A89: F2        .byte con_jmp
- D - I - 0x021A9A 17:9A8A: 76 A1     .word loc_A176

bra_case_9A8C_01:
- D - I - 0x021A9C 17:9A8C: FA        .byte con_jsr
- D - I - 0x021A9D 17:9A8D: 2D A3     .word sub_A32D
- D - I - 0x021A9F 17:9A8F: FA        .byte con_jsr
- D - I - 0x021AA0 17:9A90: AE A0     .word sub_A0AE
- D - I - 0x021AA2 17:9A92: FA        .byte con_jsr
- D - I - 0x021AA3 17:9A93: D8 A2     .word sub_A2D8
- D - I - 0x021AA5 17:9A95: FA        .byte con_jsr
- D - I - 0x021AA6 17:9A96: 2F A0     .word sub_A02F
- D - I - 0x021AA8 17:9A98: FA        .byte con_jsr
- D - I - 0x021AA9 17:9A99: 51 A0     .word sub_A051
- D - I - 0x021AAB 17:9A9B: F2        .byte con_jmp
- D - I - 0x021AAC 17:9A9C: 4C A0     .word loc_A04C

bra_case_9A9E_02:
- D - I - 0x021AAE 17:9A9E: FA        .byte con_jsr
- D - I - 0x021AAF 17:9A9F: 2D A3     .word sub_A32D
- D - I - 0x021AB1 17:9AA1: FA        .byte con_jsr
- D - I - 0x021AB2 17:9AA2: AE A0     .word sub_A0AE
- D - I - 0x021AB4 17:9AA4: FA        .byte con_jsr
- D - I - 0x021AB5 17:9AA5: D8 A2     .word sub_A2D8
- D - I - 0x021AB7 17:9AA7: FA        .byte con_jsr
- D - I - 0x021AB8 17:9AA8: 47 A0     .word sub_A047
- D - I - 0x021ABA 17:9AAA: FA        .byte con_jsr
- D - I - 0x021ABB 17:9AAB: 23 A0     .word sub_A023
- D - I - 0x021ABD 17:9AAD: F2        .byte con_jmp
- D - I - 0x021ABE 17:9AAE: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9AB0_03:
- D - I - 0x021AC0 17:9AB0: FA        .byte con_jsr
- D - I - 0x021AC1 17:9AB1: 2D A3     .word sub_A32D
- D - I - 0x021AC3 17:9AB3: FA        .byte con_jsr
- D - I - 0x021AC4 17:9AB4: AE A0     .word sub_A0AE
- D - I - 0x021AC6 17:9AB6: FA        .byte con_jsr
- D - I - 0x021AC7 17:9AB7: D8 A2     .word sub_A2D8
- D - I - 0x021AC9 17:9AB9: F2        .byte con_jmp
- D - I - 0x021ACA 17:9ABA: 85 A1     .word loc_A185

bra_case_9ABC_00:
- D - I - 0x021ACC 17:9ABC: FA        .byte con_jsr
- D - I - 0x021ACD 17:9ABD: 2D A3     .word sub_A32D
- D - I - 0x021ACF 17:9ABF: FA        .byte con_jsr
- D - I - 0x021AD0 17:9AC0: AE A0     .word sub_A0AE
- D - I - 0x021AD2 17:9AC2: FA        .byte con_jsr
- D - I - 0x021AD3 17:9AC3: D8 A2     .word sub_A2D8
- D - I - 0x021AD5 17:9AC5: FA        .byte con_jsr
- D - I - 0x021AD6 17:9AC6: 47 A0     .word sub_A047
- D - I - 0x021AD8 17:9AC8: FA        .byte con_jsr
- D - I - 0x021AD9 17:9AC9: DD A2     .word sub_A2DD
- D - I - 0x021ADB 17:9ACB: FA        .byte con_jsr
- D - I - 0x021ADC 17:9ACC: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x021ADE 17:9ACE: F0        .byte con_quit

bra_case_9ACF_01:
- D - I - 0x021ADF 17:9ACF: FA        .byte con_jsr
- D - I - 0x021AE0 17:9AD0: 2D A3     .word sub_A32D
- D - I - 0x021AE2 17:9AD2: FA        .byte con_jsr
- D - I - 0x021AE3 17:9AD3: AE A0     .word sub_A0AE
- D - I - 0x021AE5 17:9AD5: FA        .byte con_jsr
- D - I - 0x021AE6 17:9AD6: D8 A2     .word sub_A2D8
- D - I - 0x021AE8 17:9AD8: FA        .byte con_jsr
- D - I - 0x021AE9 17:9AD9: 47 A0     .word sub_A047
- D - I - 0x021AEB 17:9ADB: FA        .byte con_jsr
- D - I - 0x021AEC 17:9ADC: DD A2     .word sub_A2DD
- D - I - 0x021AEE 17:9ADE: FA        .byte con_jsr
- D - I - 0x021AEF 17:9ADF: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x021AF1 17:9AE1: F2        .byte con_jmp
- D - I - 0x021AF2 17:9AE2: 40 A2     .word loc_A240

bra_case_9AE4_02:
- D - I - 0x021AF4 17:9AE4: FA        .byte con_jsr
- D - I - 0x021AF5 17:9AE5: 2D A3     .word sub_A32D
- D - I - 0x021AF7 17:9AE7: FA        .byte con_jsr
- D - I - 0x021AF8 17:9AE8: AE A0     .word sub_A0AE
- D - I - 0x021AFA 17:9AEA: FA        .byte con_jsr
- D - I - 0x021AFB 17:9AEB: D8 A2     .word sub_A2D8
- D - I - 0x021AFD 17:9AED: FA        .byte con_jsr
- D - I - 0x021AFE 17:9AEE: 47 A0     .word sub_A047
- D - I - 0x021B00 17:9AF0: FA        .byte con_jsr
- D - I - 0x021B01 17:9AF1: E7 A2     .word sub_A2E7
- D - I - 0x021B03 17:9AF3: FA        .byte con_jsr
- D - I - 0x021B04 17:9AF4: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- D - I - 0x021B06 17:9AF6: F2        .byte con_jmp
- D - I - 0x021B07 17:9AF7: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9AF9_03:
- - - - - 0x021B09 17:9AF9: FD        .byte con_mirror_condition, $00
- - - - - 0x021B0B 17:9AFB: F3        .byte con_branch, $8F
- - - - - 0x021B0D 17:9AFD: 04        .byte bra_case_9B01_00 - *
- - - - - 0x021B0E 17:9AFE: 0F        .byte bra_case_9B0D_01 - *
- - - - - 0x021B0F 17:9AFF: 28        .byte bra_case_9B27_02 - *
- - - - - 0x021B10 17:9B00: 39        .byte bra_case_9B39_03 - *

bra_case_9B01_00:
- - - - - 0x021B11 17:9B01: FA        .byte con_jsr
- - - - - 0x021B12 17:9B02: 49 B4     .word sub_B449
- - - - - 0x021B14 17:9B04: FA        .byte con_jsr
- - - - - 0x021B15 17:9B05: AE A0     .word sub_A0AE
- - - - - 0x021B17 17:9B07: FA        .byte con_jsr
- - - - - 0x021B18 17:9B08: D8 A2     .word sub_A2D8
- - - - - 0x021B1A 17:9B0A: F2        .byte con_jmp
- - - - - 0x021B1B 17:9B0B: 76 A1     .word loc_A176

bra_case_9B0D_01:
- - - - - 0x021B1D 17:9B0D: FA        .byte con_jsr
- - - - - 0x021B1E 17:9B0E: 49 B4     .word sub_B449
- - - - - 0x021B20 17:9B10: FA        .byte con_jsr
- - - - - 0x021B21 17:9B11: AE A0     .word sub_A0AE
- - - - - 0x021B23 17:9B13: FA        .byte con_jsr
- - - - - 0x021B24 17:9B14: D8 A2     .word sub_A2D8
- - - - - 0x021B26 17:9B16: FA        .byte con_jsr
- - - - - 0x021B27 17:9B17: 2F A0     .word sub_A02F
- - - - - 0x021B29 17:9B19: FA        .byte con_jsr
- - - - - 0x021B2A 17:9B1A: 51 A0     .word sub_A051
- - - - - 0x021B2C 17:9B1C: F2        .byte con_jmp
- - - - - 0x021B2D 17:9B1D: 4C A0     .word loc_A04C

bra_case_9B1F_04:
- - - - - 0x021B2F 17:9B1F: FD        .byte con_mirror_condition, $00
- - - - - 0x021B31 17:9B21: F3        .byte con_branch, $8F
- - - - - 0x021B33 17:9B23: 22        .byte bra_case_9B45_00 - *
- - - - - 0x021B34 17:9B24: 34        .byte bra_case_9B58_01 - *
- - - - - 0x021B35 17:9B25: 48        .byte bra_case_9B6D_02 - *
- - - - - 0x021B36 17:9B26: 31        .byte bra_case_9B57_03 - *

bra_case_9B27_02:
- - - - - 0x021B37 17:9B27: FA        .byte con_jsr
- - - - - 0x021B38 17:9B28: 49 B4     .word sub_B449
- - - - - 0x021B3A 17:9B2A: FA        .byte con_jsr
- - - - - 0x021B3B 17:9B2B: AE A0     .word sub_A0AE
- - - - - 0x021B3D 17:9B2D: FA        .byte con_jsr
- - - - - 0x021B3E 17:9B2E: D8 A2     .word sub_A2D8
- - - - - 0x021B40 17:9B30: FA        .byte con_jsr
- - - - - 0x021B41 17:9B31: 47 A0     .word sub_A047
- - - - - 0x021B43 17:9B33: FA        .byte con_jsr
- - - - - 0x021B44 17:9B34: 23 A0     .word sub_A023
- - - - - 0x021B46 17:9B36: F2        .byte con_jmp
- - - - - 0x021B47 17:9B37: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9B39_03:
- - - - - 0x021B49 17:9B39: FA        .byte con_jsr
- - - - - 0x021B4A 17:9B3A: 49 B4     .word sub_B449
- - - - - 0x021B4C 17:9B3C: FA        .byte con_jsr
- - - - - 0x021B4D 17:9B3D: AE A0     .word sub_A0AE
- - - - - 0x021B4F 17:9B3F: FA        .byte con_jsr
- - - - - 0x021B50 17:9B40: D8 A2     .word sub_A2D8
- - - - - 0x021B52 17:9B42: F2        .byte con_jmp
- - - - - 0x021B53 17:9B43: 85 A1     .word loc_A185

bra_case_9B45_00:
- - - - - 0x021B55 17:9B45: FA        .byte con_jsr
- - - - - 0x021B56 17:9B46: 49 B4     .word sub_B449
- - - - - 0x021B58 17:9B48: FA        .byte con_jsr
- - - - - 0x021B59 17:9B49: AE A0     .word sub_A0AE
- - - - - 0x021B5B 17:9B4B: FA        .byte con_jsr
- - - - - 0x021B5C 17:9B4C: D8 A2     .word sub_A2D8
- - - - - 0x021B5E 17:9B4E: FA        .byte con_jsr
- - - - - 0x021B5F 17:9B4F: 47 A0     .word sub_A047
- - - - - 0x021B61 17:9B51: FA        .byte con_jsr
- - - - - 0x021B62 17:9B52: E7 A2     .word sub_A2E7
- - - - - 0x021B64 17:9B54: FA        .byte con_jsr
- - - - - 0x021B65 17:9B55: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9B57_03:
- - - - - 0x021B67 17:9B57: F0        .byte con_quit

bra_case_9B58_01:
- - - - - 0x021B68 17:9B58: FA        .byte con_jsr
- - - - - 0x021B69 17:9B59: 49 B4     .word sub_B449
- - - - - 0x021B6B 17:9B5B: FA        .byte con_jsr
- - - - - 0x021B6C 17:9B5C: AE A0     .word sub_A0AE
- - - - - 0x021B6E 17:9B5E: FA        .byte con_jsr
- - - - - 0x021B6F 17:9B5F: D8 A2     .word sub_A2D8
- - - - - 0x021B71 17:9B61: FA        .byte con_jsr
- - - - - 0x021B72 17:9B62: 47 A0     .word sub_A047
- - - - - 0x021B74 17:9B64: FA        .byte con_jsr
- - - - - 0x021B75 17:9B65: E7 A2     .word sub_A2E7
- - - - - 0x021B77 17:9B67: FA        .byte con_jsr
- - - - - 0x021B78 17:9B68: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021B7A 17:9B6A: F2        .byte con_jmp
- - - - - 0x021B7B 17:9B6B: 40 A2     .word loc_A240

bra_case_9B6D_02:
- - - - - 0x021B7D 17:9B6D: FA        .byte con_jsr
- - - - - 0x021B7E 17:9B6E: 49 B4     .word sub_B449
- - - - - 0x021B80 17:9B70: FA        .byte con_jsr
- - - - - 0x021B81 17:9B71: AE A0     .word sub_A0AE
- - - - - 0x021B83 17:9B73: FA        .byte con_jsr
- - - - - 0x021B84 17:9B74: D8 A2     .word sub_A2D8
- - - - - 0x021B86 17:9B76: FA        .byte con_jsr
- - - - - 0x021B87 17:9B77: 47 A0     .word sub_A047
- - - - - 0x021B89 17:9B79: FA        .byte con_jsr
- - - - - 0x021B8A 17:9B7A: E7 A2     .word sub_A2E7
- - - - - 0x021B8C 17:9B7C: FA        .byte con_jsr
- - - - - 0x021B8D 17:9B7D: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021B8F 17:9B7F: F2        .byte con_jmp
- - - - - 0x021B90 17:9B80: 71 A3     .word loc_A371_мяч_улетает_в_сторону



_scenario_9B82_14:
- D - I - 0x021B92 17:9B82: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021B94 17:9B84: F3        .byte con_branch, $81     ; выживет ли защитник
- D - I - 0x021B96 17:9B86: 02        .byte bra_case_9B88_00_защитник_выживет - *
- - - - - 0x021B97 17:9B87: 28        .byte bra_case_9BAF_01_защитник_убьется - *

bra_case_9B88_00_защитник_выживет:
- D - I - 0x021B98 17:9B88: F3        .byte con_branch, $8F
- D - I - 0x021B9A 17:9B8A: 04        .byte bra_case_9B8E_00 - *
- - - - - 0x021B9B 17:9B8B: 09        .byte bra_case_9B94_01 - *
- D - I - 0x021B9C 17:9B8C: 11        .byte bra_case_9B9D_02 - *
- D - I - 0x021B9D 17:9B8D: 19        .byte bra_case_9BA6_03 - *

bra_case_9B8E_00:
- D - I - 0x021B9E 17:9B8E: FA        .byte con_jsr
- D - I - 0x021B9F 17:9B8F: 2D A3     .word sub_A32D
- D - I - 0x021BA1 17:9B91: F2        .byte con_jmp
- D - I - 0x021BA2 17:9B92: 83 A3     .word loc_A383_удар_огибает_стеночку

bra_case_9B94_01:
- - - - - 0x021BA4 17:9B94: FA        .byte con_jsr
- - - - - 0x021BA5 17:9B95: 2D A3     .word sub_A32D
- - - - - 0x021BA7 17:9B97: FA        .byte con_jsr
- - - - - 0x021BA8 17:9B98: 21 A3     .word sub_A321_стенка_была_задета
- - - - - 0x021BAA 17:9B9A: F2        .byte con_jmp
- - - - - 0x021BAB 17:9B9B: 7E A3     .word loc_A37E

bra_case_9B9D_02:
- D - I - 0x021BAD 17:9B9D: FA        .byte con_jsr
- D - I - 0x021BAE 17:9B9E: 2D A3     .word sub_A32D
- D - I - 0x021BB0 17:9BA0: FA        .byte con_jsr
- D - I - 0x021BB1 17:9BA1: 08 A3     .word sub_A308
- D - I - 0x021BB3 17:9BA3: F2        .byte con_jmp
- D - I - 0x021BB4 17:9BA4: 71 A3     .word loc_A371_мяч_улетает_в_сторону

bra_case_9BA6_03:
- D - I - 0x021BB6 17:9BA6: FA        .byte con_jsr
- D - I - 0x021BB7 17:9BA7: 2D A3     .word sub_A32D
- D - I - 0x021BB9 17:9BA9: FA        .byte con_jsr
- D - I - 0x021BBA 17:9BAA: EF A2     .word sub_A2EF
- D - I - 0x021BBC 17:9BAC: F2        .byte con_jmp
- D - I - 0x021BBD 17:9BAD: 19 A3     .word loc_A319_стенка_заблокировала_удар

bra_case_9BAF_01_защитник_убьется:
- - - - - 0x021BBF 17:9BAF: F3        .byte con_branch, $8F
- - - - - 0x021BC1 17:9BB1: 04        .byte bra_case_9BB5_00 - *
- - - - - 0x021BC2 17:9BB2: 0D        .byte bra_case_9BBF_01 - *
- - - - - 0x021BC3 17:9BB3: 18        .byte bra_case_9BCB_02 - *
- - - - - 0x021BC4 17:9BB4: 0A        .byte bra_case_9BBE_03 - *

bra_case_9BB5_00:
- - - - - 0x021BC5 17:9BB5: FA        .byte con_jsr
- - - - - 0x021BC6 17:9BB6: 2D A3     .word sub_A32D
- - - - - 0x021BC8 17:9BB8: FA        .byte con_jsr
- - - - - 0x021BC9 17:9BB9: DD A2     .word sub_A2DD
- - - - - 0x021BCB 17:9BBB: FA        .byte con_jsr
- - - - - 0x021BCC 17:9BBC: 62 9F     .word sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением
bra_case_9BBE_03:
- - - - - 0x021BCE 17:9BBE: F0        .byte con_quit

bra_case_9BBF_01:
- - - - - 0x021BCF 17:9BBF: FA        .byte con_jsr
- - - - - 0x021BD0 17:9BC0: 2D A3     .word sub_A32D
- - - - - 0x021BD2 17:9BC2: FA        .byte con_jsr
- - - - - 0x021BD3 17:9BC3: DD A2     .word sub_A2DD
- - - - - 0x021BD5 17:9BC5: FA        .byte con_jsr
- - - - - 0x021BD6 17:9BC6: 5C 9F     .word sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением
- - - - - 0x021BD8 17:9BC8: F2        .byte con_jmp
- - - - - 0x021BD9 17:9BC9: 40 A2     .word loc_A240



_scenario_9BCB_04:
bra_case_9BCB_02:
- D - I - 0x021BDB 17:9BCB: FA        .byte con_jsr
- D - I - 0x021BDC 17:9BCC: FE A2     .word sub_A2FE_сообщение_oh_на_мигающем_белом_фоне
bra_long_case_9BCE_00:
bra_long_case_9BCE_01:
- D - I - 0x021BDE 17:9BCE: F0        .byte con_quit

bra_long_case_9BCF_01:
- D - I - 0x021BDF 17:9BCF: FA        .byte con_jsr
- D - I - 0x021BE0 17:9BD0: BB A1     .word sub_A1BB
- D - I - 0x021BE2 17:9BD2: F2        .byte con_jmp
- D - I - 0x021BE3 17:9BD3: 88 A3     .word loc_A388

bra_long_case_9BD5_01:
- D - I - 0x021BE5 17:9BD5: FA        .byte con_jsr
- D - I - 0x021BE6 17:9BD6: B1 A1     .word sub_A1B1
- D - I - 0x021BE8 17:9BD8: F2        .byte con_jmp
- D - I - 0x021BE9 17:9BD9: 88 A3     .word loc_A388

bra_long_case_9BDB_02:
- D - I - 0x021BEB 17:9BDB: F6        .byte con_mirror_toggle
- D - I - 0x021BEC 17:9BDC: F2        .byte con_jmp
- D - I - 0x021BED 17:9BDD: 38 A2     .word loc_A238

bra_long_case_9BDF_02:
- D - I - 0x021BEF 17:9BDF: F6        .byte con_mirror_toggle
- D - I - 0x021BF0 17:9BE0: F2        .byte con_jmp
- D - I - 0x021BF1 17:9BE1: 2E A2     .word loc_A22E



_scenario_9BE3_1C:
- D - I - 0x021BF3 17:9BE3: FD        .byte con_mirror_condition, $00
- D - I - 0x021BF5 17:9BE5: FA        .byte con_jsr
- D - I - 0x021BF6 17:9BE6: 3E 9F     .word sub_9F3E
- D - I - 0x021BF8 17:9BE8: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021BFA 17:9BEA: 02        .byte bra_case_9BEC_00 - *
- D - I - 0x021BFB 17:9BEB: 04        .byte bra_case_9BEF_01 - *

bra_case_9BEC_00:
- D - I - 0x021BFC 17:9BEC: F2        .byte con_jmp
- D - I - 0x021BFD 17:9BED: 9E B4     .word loc_B49E

bra_case_9BEF_01:
- D - I - 0x021BFF 17:9BEF: F2        .byte con_jmp
- D - I - 0x021C00 17:9BF0: B6 B4     .word loc_B4B6



_scenario_9BF2_24:
- D - I - 0x021C02 17:9BF2: FA        .byte con_jsr
- D - I - 0x021C03 17:9BF3: BF B4     .word sub_B4BF_мяч_улетает_в_аут
- D - I - 0x0234D7 11:B4C7: 46        .byte con_pause + $46
- D - I - 0x0234D8 11:B4C8: F0        .byte con_bg + con_skip
- D - I - 0x0234D9 11:B4C9: F0        .byte con_animation + con_skip
- D - I - 0x0234DA 11:B4CA: 5D        .byte con_cloud + $5D
- D - I - 0x0234DB 11:B4CB: FB        .byte con_rts



_scenario_9BF8_27:
- D - I - 0x021C08 17:9BF8: FA        .byte con_jsr
- D - I - 0x021C09 17:9BF9: BF B4     .word sub_B4BF_мяч_улетает_в_аут
- D - I - 0x023A22 11:BA12: 46        .byte con_pause + $46
- D - I - 0x023A23 11:BA13: F0        .byte con_bg + con_skip
- D - I - 0x023A24 11:BA14: F0        .byte con_animation + con_skip
- D - I - 0x023A25 11:BA15: 5E        .byte con_cloud + $5E
- D - I - 0x023A26 11:BA16: FB        .byte con_rts



_scenario_9BFE_29:
- D - I - 0x021C0E 17:9BFE: FA        .byte con_jsr
- D - I - 0x021C0F 17:9BFF: BF B4     .word sub_B4BF_мяч_улетает_в_аут
- D - I - 0x023A27 11:BA17: 46        .byte con_pause + $46
- D - I - 0x023A28 11:BA18: F0        .byte con_bg + con_skip
- D - I - 0x023A29 11:BA19: F0        .byte con_animation + con_skip
- D - I - 0x023A2A 11:BA1A: 5F        .byte con_cloud + $5F
- D - I - 0x023A2B 11:BA1B: FB        .byte con_rts

sub_B4BF_мяч_улетает_в_аут:
- D - I - 0x0234CF 11:B4BF: F9        .byte con_soundID_delay, $64, $0B
- D - I - 0x0234D2 11:B4C2: 1E        .byte con_pause + $1E
- D - I - 0x0234D3 11:B4C3: 39        .byte con_bg + $39
- D - I - 0x0234D4 11:B4C4: 7E        .byte con_animation + $7E
- D - I - 0x0234D5 11:B4C5: 5C        .byte con_cloud + $5C
- D - I - 0x0234D6 11:B4C6: FB        .byte con_rts



_scenario_9C04_33:
- D - I - 0x0237B6 11:B7A6: F5        .byte con_mirror_off
- D - I - 0x0237B7 11:B7A7: F9        .byte con_soundID_delay, $66, $02
- D - I - 0x0237BA 11:B7AA: 32        .byte con_pause + $32
- D - I - 0x0237BB 11:B7AB: 0C        .byte con_bg + $0C
- D - I - 0x0237BC 11:B7AC: 4E        .byte con_animation + $4E
- D - I - 0x0237BD 11:B7AD: 70        .byte con_cloud + $70
- D - I - 0x0237BF 11:B7AF: 60        .byte con_pause + $60
- D - I - 0x0237C0 11:B7B0: F0        .byte con_bg + con_skip
- D - I - 0x0237C1 11:B7B1: F0        .byte con_animation + con_skip
- D - I - 0x0237C2 11:B7B2: 71        .byte con_cloud + $71
- D - I - 0x0237C3 11:B7B3: F9        .byte con_soundID_delay, $31, $02
- D - I - 0x0237C6 11:B7B6: C0        .byte con_pause + $C0
- D - I - 0x0237C7 11:B7B7: F0        .byte con_bg + con_skip
- D - I - 0x0237C8 11:B7B8: F0        .byte con_animation + con_skip
- D - I - 0x0237C9 11:B7B9: F0        .byte con_cloud + con_skip
- D - I - 0x0237CA 11:B7BA: 01        .byte con_pause + $01
- D - I - 0x0237CB 11:B7BB: 71        .byte con_bg + $71
- D - I - 0x0237CC 11:B7BC: 00        .byte con_animation + $00
- D - I - 0x0237CD 11:B7BD: 00        .byte con_cloud + con_clear
- D - I - 0x0237CE 11:B7BE: FB        .byte con_rts



_scenario_9C0A_3E:
- D - I - 0x021C1A 17:9C0A: FD        .byte con_mirror_condition, $00
- D - I - 0x021C1C 17:9C0C: FA        .byte con_jsr
- D - I - 0x021C1D 17:9C0D: 3E 9F     .word sub_9F3E
- D - I - 0x021C1F 17:9C0F: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021C21 17:9C11: 05        .byte bra_case_9C16_00 - *
- D - I - 0x021C22 17:9C12: 01        .byte bra_case_9C13_01 - *

bra_case_9C13_01:
- D - I - 0x021C23 17:9C13: F2        .byte con_jmp
- D - I - 0x021C24 17:9C14: AE B4     .word loc_B4AE

bra_case_9C16_00:
- D - I - 0x021C26 17:9C16: F2        .byte con_jmp
- D - I - 0x021C27 17:9C17: A6 B4     .word loc_B4A6



_scenario_9C19_47:
- D - I - 0x021C29 17:9C19: FA        .byte con_jsr
- D - I - 0x021C2A 17:9C1A: 36 9C     .word sub_9C36
- D - I - 0x021C2C 17:9C1C: FA        .byte con_jsr
- D - I - 0x021C2D 17:9C1D: 23 9C     .word sub_BBC7_очистка
- D - I - 0x021C2F 17:9C1F: 5A        .byte con_pause + $5A
- D - I - 0x021C30 17:9C20: 30        .byte con_bg + $30
- D - I - 0x021C31 17:9C21: B7        .byte con_animation + $B7
- D - I - 0x021C32 17:9C22: 78        .byte con_cloud + $78
                                      .byte con_jmp
                                      .word loc_BBC7_очистка

loc_9C28_проверка_на_рваную_сетку:
- D - I - 0x021C38 17:9C28: F7        .byte con_F7, $03
- D - I - 0x021C3A 17:9C2A: F3        .byte con_branch, $21     ; порвана ли сетка
- D - I - 0x021C3C 17:9C2C: 5D A2     .word bra_long_case_A25D_00_сетка_не_порвана
- D - I - 0x021C3E 17:9C2E: 67 A2     .word bra_long_case_A267_01_сетка_порвана



_scenario_9C30_30:
- D - I - 0x021C40 17:9C30: F3        .byte con_branch, $22     ; у чьей команды мяч
- D - I - 0x021C42 17:9C32: 3F 9C     .word bra_long_case_9C3F_00_мяч_у_команды_слева
- D - I - 0x021C44 17:9C34: 36 9C     .word bra_long_case_9C36_01_мяч_у_команды_справа

sub_9C36:
bra_long_case_9C36_01_мяч_у_команды_справа:
- D - I - 0x021C46 17:9C36: F9        .byte con_soundID_delay, $42, $02     ; гол в ворота нашей команды
- D - I - 0x021C49 17:9C39: F3        .byte con_branch, $21     ; порвана ли сетка
- D - I - 0x021C4B 17:9C3B: B5 A2     .word bra_long_case_A2B5_00_сетка_не_порвана
- D - I - 0x021C4D 17:9C3D: BC A2     .word bra_long_case_A2BC_01_сетка_порвана

bra_long_case_9C3F_00_мяч_у_команды_слева:
- D - I - 0x021C4F 17:9C3F: F5        .byte con_mirror_off
- D - I - 0x021C50 17:9C40: F7        .byte con_F7, $13
- D - I - 0x021C52 17:9C42: F9        .byte con_soundID_delay, $41, $02     ; гол в ворота соперника
- D - I - 0x021C55 17:9C45: F3        .byte con_branch, $21     ; порвана ли сетка
- D - I - 0x021C57 17:9C47: 4B 9C     .word bra_long_case_9C4B_00_сетка_не_порвана
- D - I - 0x021C59 17:9C49: 53 9C     .word bra_long_case_9C53_01_сетка_порвана

bra_long_case_9C4B_00_сетка_не_порвана:
- D - I - 0x021C5B 17:9C4B: F3        .byte con_branch, $23     ; за какую команду играешь
- D - I - 0x021C5D 17:9C4D: A7 A2     .word bra_long_case_A2A7_00_за_sao_paulo
- D - I - 0x021C5F 17:9C4F: AE A2     .word bra_long_case_A2AE_01_за_nankatsu
- D - I - 0x021C61 17:9C51: 71 A2     .word bra_long_case_A271_02_за_japan

bra_long_case_9C53_01_сетка_порвана:
- D - I - 0x021C63 17:9C53: F3        .byte con_branch, $23     ; за какую команду играешь
- - - - - 0x021C65 17:9C55: C3 A2     .word bra_long_case_A2C3_00_за_sao_paulo
- - - - - 0x021C67 17:9C57: CA A2     .word bra_long_case_A2CA_01_за_nankatsu
- D - I - 0x021C69 17:9C59: D1 A2     .word bra_long_case_A2D1_02_за_japan

sub_9C5B:
- D - I - 0x021C6B 17:9C5B: F3        .byte con_branch, $2E
- D - I - 0x021C6D 17:9C5D: 4D A3     .word bra_long_case_A34D_00
- D - I - 0x021C6F 17:9C5F: 3A A3     .word bra_long_case_A33A_01

loc_9C61:
- D - I - 0x021C71 17:9C61: F3        .byte con_branch, $37
- D - I - 0x021C73 17:9C63: 10 B3     .word bra_long_case_B310_00
- D - I - 0x021C75 17:9C65: FE B2     .word bra_long_case_B2FE_01

loc_9C67:
- D - I - 0x021C77 17:9C67: F3        .byte con_branch, $37
- D - I - 0x021C79 17:9C69: B3 A3     .word bra_long_case_A3B3_00
- - - - - 0x021C7B 17:9C6B: FE B2     .word bra_long_case_B2FE_01

loc_9C6D:
- D - I - 0x021C7D 17:9C6D: F3        .byte con_branch, $37
- D - I - 0x021C7F 17:9C6F: BD A3     .word bra_long_case_A3BD_00
- - - - - 0x021C81 17:9C71: FE B2     .word bra_long_case_B2FE_01

loc_9C73:
- D - I - 0x021C83 17:9C73: F3        .byte con_branch, $37
- D - I - 0x021C85 17:9C75: C5 A3     .word bra_long_case_A3C5_00
- - - - - 0x021C87 17:9C77: FE B2     .word bra_long_case_B2FE_01

sub_9C79:
- D - I - 0x021C89 17:9C79: F3        .byte con_branch, $37
- D - I - 0x021C8B 17:9C7B: B5 A6     .word bra_long_case_A6B5_00
- D - I - 0x021C8D 17:9C7D: BB A6     .word bra_long_case_A6BB_01

sub_9C7F:
- D - I - 0x021C8F 17:9C7F: F3        .byte con_branch, $37
- D - I - 0x021C91 17:9C81: 0C A7     .word bra_long_case_A70C_00
- D - I - 0x021C93 17:9C83: BC A6     .word bra_long_case_A6BC_01

loc_9C85:
- D - I - 0x021C95 17:9C85: F3        .byte con_branch, $37
- D - I - 0x021C97 17:9C87: CE A7     .word bra_long_case_A7CE_00
- - - - - 0x021C99 17:9C89: CE A6     .word bra_long_case_A6CE_01

sub_9C8B:
- D - I - 0x021C9B 17:9C8B: F3        .byte con_branch, $37
- D - I - 0x021C9D 17:9C8D: FF A6     .word bra_long_case_A6FF_00
- D - I - 0x021C9F 17:9C8F: E4 A6     .word bra_long_case_A6E4_01

loc_9C91:
- D - I - 0x021CA1 17:9C91: F3        .byte con_branch, $37
- D - I - 0x021CA3 17:9C93: D5 A7     .word bra_long_case_A7D5_00
- D - I - 0x021CA5 17:9C95: CE A6     .word bra_long_case_A6CE_01

loc_9C97:
- D - I - 0x021CA7 17:9C97: F3        .byte con_branch, $37
- D - I - 0x021CA9 17:9C99: DE A7     .word bra_long_case_A7DE_00
- - - - - 0x021CAB 17:9C9B: CE A6     .word bra_long_case_A6CE_01

loc_9C9D:
- D - I - 0x021CAD 17:9C9D: F3        .byte con_branch, $37
- D - I - 0x021CAF 17:9C9F: E7 A7     .word bra_long_case_A7E7_00
- D - I - 0x021CB1 17:9CA1: CE A6     .word bra_long_case_A6CE_01

sub_9CA3_выбор_анимации_дриблинга_трудной_обводки:
- D - I - 0x021CB3 17:9CA3: FA        .byte con_jsr
- D - I - 0x021CB4 17:9CA4: 95 A4     .word sub_A495_сообщение_игрока_при_ответе_на_нападение
- D - I - 0x021CB6 17:9CA6: F3        .byte con_branch, $0E     ; действие атаки на земле
- D - I - 0x021CB8 17:9CA8: EE A7     .word bra_long_case_A7EE_00_shoot
- D - I - 0x021CBA 17:9CAA: EE A7     .word bra_long_case_A7EE_01_pass
- D - I - 0x021CBC 17:9CAC: B0 9C     .word bra_long_case_9CB0_02_dribble
- D - I - 0x021CBE 17:9CAE: EE A7     .word bra_long_case_A7EE_03_1_2_pass

bra_long_case_9CB0_02_dribble:
- D - I - 0x021CC0 17:9CB0: F3        .byte con_branch, $1C     ; спешал дриблинг
- D - I - 0x021CC2 17:9CB2: EE A7     .word bra_long_case_A7EE_00_dribble
- D - I - 0x021CC4 17:9CB4: 05 A8     .word bra_long_case_A805_01_heel_lift
- - - - - 0x021CC6 17:9CB6: 20 A8     .word bra_long_case_A820_02_forcible_dribble
- D - I - 0x021CC8 17:9CB8: 58 A8     .word bra_long_case_A858_03_vanishing_feint
- D - I - 0x021CCA 17:9CBA: 99 A8     .word bra_long_case_A899_04_clone_dribble
- D - I - 0x021CCC 17:9CBC: C1 A8     .word bra_long_case_A8C1_05_high_speed_dribble
- - - - - 0x021CCE 17:9CBE: 11 A9     .word bra_long_case_A911_06_hedgehog_dribble

loc_9CC0_выбор_анимации_дриблинга_легкой_обводки:
sub_9CC0_выбор_анимации_дриблинга_легкой_обводки:
- D - I - 0x021CD0 17:9CC0: FA        .byte con_jsr
- D - I - 0x021CD1 17:9CC1: 95 A4     .word sub_A495_сообщение_игрока_при_ответе_на_нападение
- D - I - 0x021CD3 17:9CC3: F3        .byte con_branch, $0E     ; действие атаки на земле
- D - I - 0x021CD5 17:9CC5: 4F AA     .word bra_long_case_AA4F_00_shoot
- D - I - 0x021CD7 17:9CC7: 4F AA     .word bra_long_case_AA4F_01_pass
- D - I - 0x021CD9 17:9CC9: CD 9C     .word bra_long_case_9CCD_02_dribble
- D - I - 0x021CDB 17:9CCB: 4F AA     .word bra_long_case_AA4F_03_1_2_pass

bra_long_case_9CCD_02_dribble:
- D - I - 0x021CDD 17:9CCD: F3        .byte con_branch, $1C     ; спешал дриблинг
- D - I - 0x021CDF 17:9CCF: 4F AA     .word bra_long_case_AA4F_00_dribble
- D - I - 0x021CE1 17:9CD1: 62 AA     .word bra_long_case_AA62_01_heel_lift
- - - - - 0x021CE3 17:9CD3: 6D AA     .word bra_long_case_AA6D_02_forcible_dribble
- D - I - 0x021CE5 17:9CD5: B7 AA     .word bra_long_case_AAB7_03_vanishing_feint
- D - I - 0x021CE7 17:9CD7: CB AA     .word bra_long_case_AACB_04_clone_dribble
- D - I - 0x021CE9 17:9CD9: E3 AA     .word bra_long_case_AAE3_05_high_speed_dribble
- - - - - 0x021CEB 17:9CDB: FF AA     .word bra_long_case_AAFF_06_hedgehog_dribble



_scenario_9CDD_25:
- D - I - 0x021CED 17:9CDD: FA        .byte con_jsr
- D - I - 0x021CEE 17:9CDE: 23 9C     .word sub_BBC7_очистка
- D - I - 0x021CF0 17:9CE0: F3        .byte con_branch, $8C
- D - I - 0x021CF2 17:9CE2: 02        .byte bra_case_9CE4_00 - *
- D - I - 0x021CF3 17:9CE3: 10        .byte bra_case_9CF3_01 - *

bra_case_9CE4_00:
- D - I - 0x021CF4 17:9CE4: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021CF6 17:9CE6: F9        .byte con_soundID_delay, $12, $02     ; обычный удар с земли
- D - I - 0x021CF9 17:9CE9: 30        .byte con_pause + $30
- D - I - 0x021CFA 17:9CEA: 42        .byte con_bg + $42
- D - I - 0x021CFB 17:9CEB: 82        .byte con_animation + $82
- D - I - 0x021CFC 17:9CEC: 63        .byte con_cloud + $63
- D - I - 0x021CFD 17:9CED: F0        .byte con_quit



_scenario_9CEE_1D:
- D - I - 0x021CFE 17:9CEE: F3        .byte con_branch, $B4     ; узнать высоту мяча
- D - I - 0x021D00 17:9CF0: 03        .byte bra_case_9CF3_00_мяч_у_атакующего_на_земле - *
- - - - - 0x021D01 17:9CF1: A9        .byte bra_case_9D9A_01_летит_низкий_мяч - *
- - - - - 0x021D02 17:9CF2: 60        .byte bra_case_9D52_02_летит_высокий_мяч - *

sub_9CF3:
bra_case_9CF3_01:
bra_case_9CF3_00_мяч_у_атакующего_на_земле:
- D - I - 0x021D03 17:9CF3: F5        .byte con_mirror_off
- D - I - 0x021D04 17:9CF4: F3        .byte con_branch, $1D     ; спешал удар
- D - I - 0x021D06 17:9CF6: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D08 17:9CF8: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D0A 17:9CFA: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D0C 17:9CFC: 4C AB     .word bra_long_case_AB4C_03_drive_shot
- - - - - 0x021D0E 17:9CFE: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D10 17:9D00: CC AB     .word bra_long_case_ABCC_05_falcon_shot
- - - - - 0x021D12 17:9D02: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D14 17:9D04: F0 AB     .word bra_long_case_ABF0_07_razor_shot
- - - - - 0x021D16 17:9D06: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D18 17:9D08: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D1A 17:9D0A: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D1C 17:9D0C: 23 AC     .word bra_long_case_AC23_0B_eagle_shot
- D - I - 0x021D1E 17:9D0E: 4D AC     .word bra_long_case_AC4D_0C_tiger_shot
- D - I - 0x021D20 17:9D10: 6E AC     .word bra_long_case_AC6E_0D_neo_tiger_shot
- - - - - 0x021D22 17:9D12: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D24 17:9D14: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D26 17:9D16: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D28 17:9D18: B9 AC     .word bra_long_case_ACB9_11_drive_tiger
- D - I - 0x021D2A 17:9D1A: 0C AD     .word bra_long_case_AD0C_12_cyclone
- D - I - 0x021D2C 17:9D1C: 1D AD     .word bra_long_case_AD1D_13_sano_combo
- D - I - 0x021D2E 17:9D1E: 4C AD     .word bra_long_case_AD4C_14_banana_shot
- D - I - 0x021D30 17:9D20: 5E AD     .word bra_long_case_AD5E_15_booster_shot
- D - I - 0x021D32 17:9D22: 81 AD     .word bra_long_case_AD81_16_mirage_shot
- D - I - 0x021D34 17:9D24: AB AD     .word bra_long_case_ADAB_17_mach_shot
- D - I - 0x021D36 17:9D26: CA AD     .word bra_long_case_ADCA_18_sidewinder_shot
- D - I - 0x021D38 17:9D28: DC AD     .word bra_long_case_ADDC_19_slider_shot
- D - I - 0x021D3A 17:9D2A: F9 AD     .word bra_long_case_ADF9_1A_cannon_shot
- D - I - 0x021D3C 17:9D2C: 0F AE     .word bra_long_case_AE0F_1B_fire_shot
- - - - - 0x021D3E 17:9D2E: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D40 17:9D30: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D42 17:9D32: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D44 17:9D34: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D46 17:9D36: 31 AB     .word bra_long_case_AB31_00___shot
- - - - - 0x021D48 17:9D38: 31 AB     .word bra_long_case_AB31_00___shot
- D - I - 0x021D4A 17:9D3A: 34 AE     .word bra_long_case_AE34_22_double_eel

loc_9D3C:
- D - I - 0x021D4C 17:9D3C: F3        .byte con_branch, $09     ; действие атаки на штрафной
- D - I - 0x021D4E 17:9D3E: 46 9D     .word bra_long_case_9D46_00_shoot
- D - I - 0x021D50 17:9D40: 64 AE     .word bra_long_case_AE64_01_pass
- D - I - 0x021D52 17:9D42: 64 AE     .word bra_long_case_AE64_02_trap
- D - I - 0x021D54 17:9D44: 64 AE     .word bra_long_case_AE64_03_though

bra_long_case_9D46_00_shoot:
- D - I - 0x021D56 17:9D46: F3        .byte con_branch, $48
- D - I - 0x021D58 17:9D48: 4C AE     .word bra_long_case_AE4C_00
- D - I - 0x021D5A 17:9D4A: D4 AE     .word bra_long_case_AED4_01_skylab_twin_shot
- - - - - 0x021D5C 17:9D4C: 64 AE     .word bra_long_case_AE64_02_trap
- D - I - 0x021D5E 17:9D4E: 31 AF     .word bra_long_case_AF31_03
- D - I - 0x021D60 17:9D50: 64 AE     .word bra_long_case_AE64_04

loc_9D52_выбор_анимации_удара_по_высокому_мячу:
bra_case_9D52_02_летит_высокий_мяч:
- D - I - 0x021D62 17:9D52: F3        .byte con_branch, $1D     ; спешал удар
- - - - - 0x021D64 17:9D54: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D66 17:9D56: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D68 17:9D58: BE AF     .word bra_long_case_AFBE_02_header
- - - - - 0x021D6A 17:9D5A: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D6C 17:9D5C: C6 AF     .word bra_long_case_AFC6_04_drive_overhead
- - - - - 0x021D6E 17:9D5E: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D70 17:9D60: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D72 17:9D62: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D74 17:9D64: E5 AF     .word bra_long_case_AFE5_08_skylab_hurricane
- - - - - 0x021D76 17:9D66: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D78 17:9D68: ED AF     .word bra_long_case_AFED_0A_skylab_twin_shot
- - - - - 0x021D7A 17:9D6A: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D7C 17:9D6C: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D7E 17:9D6E: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D80 17:9D70: F0 AF     .word bra_long_case_AFF0_0E_overhead
- D - I - 0x021D82 17:9D72: 79 B0     .word bra_long_case_B079_0F_hyper_overhead
- - - - - 0x021D84 17:9D74: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D86 17:9D76: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D88 17:9D78: 9F B0     .word bra_long_case_B09F_12_cyclone
- - - - - 0x021D8A 17:9D7A: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D8C 17:9D7C: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D8E 17:9D7E: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D90 17:9D80: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D92 17:9D82: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D94 17:9D84: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D96 17:9D86: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D98 17:9D88: C5 AF     .word bra_long_case_AFC5_00___
- - - - - 0x021D9A 17:9D8A: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021D9C 17:9D8C: C8 B0     .word bra_long_case_B0C8_1C_dynamite_header
- - - - - 0x021D9E 17:9D8E: D4 B0     .word bra_long_case_B0D4_1D_cannon_header
- D - I - 0x021DA0 17:9D90: DE B0     .word bra_long_case_B0DE_1E_rocker_header
- D - I - 0x021DA2 17:9D92: E8 B0     .word bra_long_case_B0E8_1F_rising_dragon_kick
- - - - - 0x021DA4 17:9D94: C5 AF     .word bra_long_case_AFC5_00___
- D - I - 0x021DA6 17:9D96: FB B0     .word bra_long_case_B0FB_21_slider_cannon
- - - - - 0x021DA8 17:9D98: C5 AF     .word bra_long_case_AFC5_00___

loc_9D9A_выбор_анимации_удара_по_низкому_мячу:
bra_case_9D9A_01_летит_низкий_мяч:
- D - I - 0x021DAA 17:9D9A: F3        .byte con_branch, $1D     ; спешал удар
- - - - - 0x021DAC 17:9D9C: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DAE 17:9D9E: 82 B1     .word bra_long_case_B182_01_volley
- - - - - 0x021DB0 17:9DA0: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DB2 17:9DA2: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DB4 17:9DA4: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DB6 17:9DA6: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DB8 17:9DA8: 98 B1     .word bra_long_case_B198_06_falcon_volley
- - - - - 0x021DBA 17:9DAA: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DBC 17:9DAC: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DBE 17:9DAE: CA B1     .word bra_long_case_B1CA_09_twin_shot
- D - I - 0x021DC0 17:9DB0: 2E B2     .word bra_long_case_B22E_0A_skylab_twin_shot
- - - - - 0x021DC2 17:9DB2: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DC4 17:9DB4: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DC6 17:9DB6: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DC8 17:9DB8: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DCA 17:9DBA: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DCC 17:9DBC: 51 B2     .word bra_long_case_B251_10_jumping_volley
- - - - - 0x021DCE 17:9DBE: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DD0 17:9DC0: 0C AD     .word bra_long_case_AD0C_12_cyclone
- - - - - 0x021DD2 17:9DC2: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DD4 17:9DC4: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DD6 17:9DC6: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DD8 17:9DC8: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DDA 17:9DCA: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DDC 17:9DCC: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DDE 17:9DCE: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DE0 17:9DD0: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DE2 17:9DD2: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DE4 17:9DD4: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DE6 17:9DD6: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DE8 17:9DD8: 97 B1     .word bra_long_case_B197_00___
- - - - - 0x021DEA 17:9DDA: 97 B1     .word bra_long_case_B197_00___
- D - I - 0x021DEC 17:9DDC: 6F B2     .word bra_long_case_B26F_20_foward_somersault
- D - I - 0x021DEE 17:9DDE: FB B0     .word bra_long_case_B0FB_21_slider_cannon
- - - - - 0x021DF0 17:9DE0: 97 B1     .word bra_long_case_B197_00___

loc_9DE2:
- D - I - 0x021DF2 17:9DE2: F3        .byte con_branch, $09     ; действие атаки на штрафной
- D - I - 0x021DF4 17:9DE4: EC 9D     .word bra_long_case_9DEC_00_shoot
- D - I - 0x021DF6 17:9DE6: 9B B2     .word bra_long_case_B29B_01_pass
- D - I - 0x021DF8 17:9DE8: 9B B2     .word bra_long_case_B29B_02_trap
- D - I - 0x021DFA 17:9DEA: 9B B2     .word bra_long_case_B29B_03_through

bra_long_case_9DEC_00_shoot:
- D - I - 0x021DFC 17:9DEC: F3        .byte con_branch, $48
- - - - - 0x021DFE 17:9DEE: 4C AE     .word bra_long_case_AE4C_00
- D - I - 0x021E00 17:9DF0: D4 AE     .word bra_long_case_AED4_01_skylab_twin_shot
- D - I - 0x021E02 17:9DF2: A2 B2     .word bra_long_case_B2A2_02
- - - - - 0x021E04 17:9DF4: 9B B2     .word bra_long_case_B29B_03_through
- D - I - 0x021E06 17:9DF6: 9B B2     .word bra_long_case_B29B_04

sub_9DF8:
- D - I - 0x021E08 17:9DF8: F3        .byte con_branch, $37
- D - I - 0x021E0A 17:9DFA: 2C B3     .word bra_long_case_B32C_00
- D - I - 0x021E0C 17:9DFC: 1A B3     .word bra_long_case_B31A_01

sub_9DFE:
- D - I - 0x021E0E 17:9DFE: FA        .byte con_jsr
- D - I - 0x021E0F 17:9DFF: 95 A4     .word sub_A495_сообщение_игрока_при_ответе_на_нападение
- D - I - 0x021E11 17:9E01: F3        .byte con_branch, $0E     ; действие атаки на земле
- D - I - 0x021E13 17:9E03: AD B3     .word bra_long_case_B3AD_00_shoot
- D - I - 0x021E15 17:9E05: AD B3     .word bra_long_case_B3AD_01_pass
- D - I - 0x021E17 17:9E07: 0B 9E     .word bra_long_case_9E0B_02_dribble
- D - I - 0x021E19 17:9E09: AD B3     .word bra_long_case_B3AD_03_1_2_pass

bra_long_case_9E0B_02_dribble:
- D - I - 0x021E1B 17:9E0B: F3        .byte con_branch, $1C     ; спешал дриблинг
- D - I - 0x021E1D 17:9E0D: AD B3     .word bra_long_case_B3AD_00_dribble
- D - I - 0x021E1F 17:9E0F: AA B3     .word bra_long_case_B3AA_01_heel_lift
- D - I - 0x021E21 17:9E11: AF B3     .word bra_long_case_B3AF_02_forcible_dribble
- D - I - 0x021E23 17:9E13: E9 B3     .word bra_long_case_B3E9_03_vanishing_feint
- D - I - 0x021E25 17:9E15: F4 B3     .word bra_long_case_B3F4_04_clone_dribble
- D - I - 0x021E27 17:9E17: 06 B4     .word bra_long_case_B406_05_high_speed_dribble
- D - I - 0x021E29 17:9E19: 14 B4     .word bra_long_case_B414_06_hedgehog_dribble

sub_9E1B_рандом_анимации_отпизженного_игрока_с_сообщением:
- D - I - 0x021E2B 17:9E1B: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021E2D 17:9E1D: 53 B4     .word bra_long_case_B453_00_рандом_1
- D - I - 0x021E2F 17:9E1F: 58 B4     .word bra_long_case_B458_01_рандом_2



_scenario_9E2D_26:
- D - I - 0x021E3D 17:9E2D: FA        .byte con_jsr
- D - I - 0x021E3E 17:9E2E: 23 9C     .word sub_BBC7_очистка
- D - I - 0x021E40 17:9E30: F3        .byte con_branch, $8C
- D - I - 0x021E42 17:9E32: 02        .byte bra_case_9E34_00 - *
- D - I - 0x021E43 17:9E33: 12        .byte bra_case_9E45_01_летит_низкий_мяч - *

bra_case_9E34_00:
- D - I - 0x021E44 17:9E34: FD        .byte con_mirror_condition, $00
- D - I - 0x021E46 17:9E36: F9        .byte con_soundID_delay, $2B, $09     ; отбитие мяча
- D - I - 0x021E49 17:9E39: 37        .byte con_pause + $37
- D - I - 0x021E4A 17:9E3A: 42        .byte con_bg + $42
- D - I - 0x021E4B 17:9E3B: 83        .byte con_animation + $83
- D - I - 0x021E4C 17:9E3C: 64        .byte con_cloud + $64
- D - I - 0x021E4D 17:9E3D: F0        .byte con_quit



_scenario_9E3E_18:
- D - I - 0x021E4E 17:9E3E: FD        .byte con_mirror_condition, $00
- D - I - 0x021E50 17:9E40: F3        .byte con_branch, $B4     ; узнать высоту мяча
- D - I - 0x021E52 17:9E42: 03        .byte bra_case_9E45_00_мяч_у_атакующего_на_земле - *
- - - - - 0x021E53 17:9E43: 02        .byte bra_case_9E45_01_летит_низкий_мяч - *
- - - - - 0x021E54 17:9E44: 0B        .byte bra_case_9E4F_02_летит_высокий_мяч - *

loc_9E45:
bra_case_9E45_01_летит_низкий_мяч:
bra_case_9E45_00_мяч_у_атакующего_на_земле:
- D - I - 0x021E55 17:9E45: F3        .byte con_branch, $1E
- D - I - 0x021E57 17:9E47: 51 AF     .word bra_long_case_AF51_00
- D - I - 0x021E59 17:9E49: 59 AF     .word bra_long_case_AF59_01
- D - I - 0x021E5B 17:9E4B: 90 AF     .word bra_long_case_AF90_02
- D - I - 0x021E5D 17:9E4D: AA AF     .word bra_long_case_AFAA_03

loc_9E4F:
bra_case_9E4F_02_летит_высокий_мяч:
- D - I - 0x021E5F 17:9E4F: F9        .byte con_soundID_delay, $2B, $15     ; отбитие мяча
- D - I - 0x021E62 17:9E52: 3F        .byte con_pause + $3F
- D - I - 0x021E63 17:9E53: 2A        .byte con_bg + $2A
- D - I - 0x021E64 17:9E54: 19        .byte con_animation + $19
- D - I - 0x021E65 17:9E55: 47        .byte con_cloud + $47
- D - I - 0x021E66 17:9E56: FB        .byte con_rts



_scenario_9E57_32:
- D - I - 0x021E67 17:9E57: F5        .byte con_mirror_off
- D - I - 0x021E68 17:9E58: F3        .byte con_branch, $41     ; какая у кипера рожа
- - - - - 0x021E6A 17:9E5A: 96 B7     .word bra_long_case_B796_00_кипер_без_рожи
- D - I - 0x021E6C 17:9E5C: 92 B7     .word bra_long_case_B792_01_кипер_ренато
- D - I - 0x021E6E 17:9E5E: 97 B7     .word bra_long_case_B797_02_кипер_морисаки
- D - I - 0x021E70 17:9E60: 9C B7     .word bra_long_case_B79C_03_кипер_вакабаяши
- D - I - 0x021E72 17:9E62: A1 B7     .word bra_long_case_B7A1_04_кипер_вакашимазу

sub_9E64:
- D - I - 0x021E74 17:9E64: F3        .byte con_branch, $28
- D - I - 0x021E76 17:9E66: 1A B9     .word bra_long_case_B91A_00_игрок_без_рожи
- D - I - 0x021E78 17:9E68: 13 B9     .word bra_long_case_B913_01_tsubasa
- D - I - 0x021E7A 17:9E6A: 1B B9     .word bra_long_case_B91B_02_misaki
- - - - - 0x021E7C 17:9E6C: 22 B9     .word bra_long_case_B922_03_misaki
- D - I - 0x021E7E 17:9E6E: 29 B9     .word bra_long_case_B929_04_hyuga
- - - - - 0x021E80 17:9E70: 30 B9     .word bra_long_case_B930_05_hyuga
- - - - - 0x021E82 17:9E72: 37 B9     .word bra_long_case_B937_06_misugi
- - - - - 0x021E84 17:9E74: 3E B9     .word bra_long_case_B93E_07_misugi
- - - - - 0x021E86 17:9E76: 45 B9     .word bra_long_case_B945_08_matsuyama
- - - - - 0x021E88 17:9E78: 4C B9     .word bra_long_case_B94C_09_matsuyama
- - - - - 0x021E8A 17:9E7A: 53 B9     .word bra_long_case_B953_0A_ishizaki
- - - - - 0x021E8C 17:9E7C: 5A B9     .word bra_long_case_B95A_0B_ishizaki
- D - I - 0x021E8E 17:9E7E: 61 B9     .word bra_long_case_B961_0C_souda
- - - - - 0x021E90 17:9E80: 68 B9     .word bra_long_case_B968_0D_souda
- - - - - 0x021E92 17:9E82: 6F B9     .word bra_long_case_B96F_0E_jitou
- - - - - 0x021E94 17:9E84: 76 B9     .word bra_long_case_B976_0F_jitou
- D - I - 0x021E96 17:9E86: 7D B9     .word bra_long_case_B97D_10_masao_kazuo
- - - - - 0x021E98 17:9E88: 84 B9     .word bra_long_case_B984_11_masao_kazuo
- - - - - 0x021E9A 17:9E8A: 8B B9     .word bra_long_case_B98B_12_nitta
- - - - - 0x021E9C 17:9E8C: 92 B9     .word bra_long_case_B992_13_nitta
- - - - - 0x021E9E 17:9E8E: 99 B9     .word bra_long_case_B999_14_sawada
- - - - - 0x021EA0 17:9E90: A0 B9     .word bra_long_case_B9A0_15_sawada
- - - - - 0x021EA2 17:9E92: A7 B9     .word bra_long_case_B9A7_16_coimbra
- - - - - 0x021EA4 17:9E94: AE B9     .word bra_long_case_B9AE_17_carlos
- D - I - 0x021EA6 17:9E96: B5 B9     .word bra_long_case_B9B5_18_carlos
- - - - - 0x021EA8 17:9E98: BC B9     .word bra_long_case_B9BC_19_schneider
- - - - - 0x021EAA 17:9E9A: C3 B9     .word bra_long_case_B9C3_1A_kaltz
- - - - - 0x021EAC 17:9E9C: CA B9     .word bra_long_case_B9CA_1B_schester
- - - - - 0x021EAE 17:9E9E: D1 B9     .word bra_long_case_B9D1_1C_diaz
- - - - - 0x021EB0 17:9EA0: D8 B9     .word bra_long_case_B9D8_1D_pascal
- - - - - 0x021EB2 17:9EA2: DF B9     .word bra_long_case_B9DF_1E_pierre
- D - I - 0x021EB4 17:9EA4: E6 B9     .word bra_long_case_B9E6_1F_napoleon
- - - - - 0x021EB6 17:9EA6: ED B9     .word bra_long_case_B9ED_20_victorino
- - - - - 0x021EB8 17:9EA8: F4 B9     .word bra_long_case_B9F4_21_kaltz

loc_9EAA:
sub_9EAA:
- D - I - 0x021EBA 17:9EAA: F3        .byte con_branch, $29
- D - I - 0x021EBC 17:9EAC: 1A B9     .word bra_long_case_B91A_00_игрок_без_рожи
- D - I - 0x021EBE 17:9EAE: 13 B9     .word bra_long_case_B913_01_tsubasa
- D - I - 0x021EC0 17:9EB0: 1B B9     .word bra_long_case_B91B_02_misaki
- - - - - 0x021EC2 17:9EB2: 22 B9     .word bra_long_case_B922_03_misaki
- D - I - 0x021EC4 17:9EB4: 29 B9     .word bra_long_case_B929_04_hyuga
- - - - - 0x021EC6 17:9EB6: 30 B9     .word bra_long_case_B930_05_hyuga
- D - I - 0x021EC8 17:9EB8: 37 B9     .word bra_long_case_B937_06_misugi
- - - - - 0x021ECA 17:9EBA: 3E B9     .word bra_long_case_B93E_07_misugi
- D - I - 0x021ECC 17:9EBC: 45 B9     .word bra_long_case_B945_08_matsuyama
- - - - - 0x021ECE 17:9EBE: 4C B9     .word bra_long_case_B94C_09_matsuyama
- D - I - 0x021ED0 17:9EC0: 53 B9     .word bra_long_case_B953_0A_ishizaki
- D - I - 0x021ED2 17:9EC2: 5A B9     .word bra_long_case_B95A_0B_ishizaki
- D - I - 0x021ED4 17:9EC4: 61 B9     .word bra_long_case_B961_0C_souda
- - - - - 0x021ED6 17:9EC6: 68 B9     .word bra_long_case_B968_0D_souda
- D - I - 0x021ED8 17:9EC8: 6F B9     .word bra_long_case_B96F_0E_jitou
- D - I - 0x021EDA 17:9ECA: 76 B9     .word bra_long_case_B976_0F_jitou
- - - - - 0x021EDC 17:9ECC: 7D B9     .word bra_long_case_B97D_10_masao_kazuo
- D - I - 0x021EDE 17:9ECE: 84 B9     .word bra_long_case_B984_11_masao_kazuo
- - - - - 0x021EE0 17:9ED0: 8B B9     .word bra_long_case_B98B_12_nitta
- - - - - 0x021EE2 17:9ED2: 92 B9     .word bra_long_case_B992_13_nitta
- - - - - 0x021EE4 17:9ED4: 99 B9     .word bra_long_case_B999_14_sawada
- - - - - 0x021EE6 17:9ED6: A0 B9     .word bra_long_case_B9A0_15_sawada
- - - - - 0x021EE8 17:9ED8: A7 B9     .word bra_long_case_B9A7_16_coimbra
- - - - - 0x021EEA 17:9EDA: AE B9     .word bra_long_case_B9AE_17_carlos
- - - - - 0x021EEC 17:9EDC: B5 B9     .word bra_long_case_B9B5_18_carlos
- - - - - 0x021EEE 17:9EDE: BC B9     .word bra_long_case_B9BC_19_schneider
- D - I - 0x021EF0 17:9EE0: C3 B9     .word bra_long_case_B9C3_1A_kaltz
- D - I - 0x021EF2 17:9EE2: CA B9     .word bra_long_case_B9CA_1B_schester
- D - I - 0x021EF4 17:9EE4: D1 B9     .word bra_long_case_B9D1_1C_diaz
- - - - - 0x021EF6 17:9EE6: D8 B9     .word bra_long_case_B9D8_1D_pascal
- - - - - 0x021EF8 17:9EE8: DF B9     .word bra_long_case_B9DF_1E_pierre
- - - - - 0x021EFA 17:9EEA: E6 B9     .word bra_long_case_B9E6_1F_napoleon
- - - - - 0x021EFC 17:9EEC: ED B9     .word bra_long_case_B9ED_20_victorino
- D - I - 0x021EFE 17:9EEE: F4 B9     .word bra_long_case_B9F4_21_kaltz

loc_9EF0:
- D - I - 0x021F00 17:9EF0: FF        .byte con_drive, con_tiger
- D - I - 0x021F02 17:9EF2: 11 BA     .word ofs_BA11_00
- D - I - 0x021F04 17:9EF4: FB B9     .word ofs_B9FB_01

sub_9EF6_выбор_анимации_полета_удара:
- D - I - 0x021F06 17:9EF6: F3        .byte con_branch, $1D     ; спешал удар
- D - I - 0x021F08 17:9EF8: E7 B4     .word bra_long_case_B4E7_00_shot
- D - I - 0x021F0A 17:9EFA: EF B4     .word bra_long_case_B4EF_01_header
- D - I - 0x021F0C 17:9EFC: F7 B4     .word bra_long_case_B4F7_02_volley
- D - I - 0x021F0E 17:9EFE: FB B4     .word bra_long_case_B4FB_03_drive_shot
- D - I - 0x021F10 17:9F00: 09 B5     .word bra_long_case_B509_04_drive_overhead
- D - I - 0x021F12 17:9F02: 25 B5     .word bra_long_case_B525_05_falcon_shot
- D - I - 0x021F14 17:9F04: 32 B5     .word bra_long_case_B532_06_falcon_volley
- D - I - 0x021F16 17:9F06: 3F B5     .word bra_long_case_B53F_07_razor_shot
- D - I - 0x021F18 17:9F08: F7 B4     .word bra_long_case_B4F7_08_skylab_hurricane
- D - I - 0x021F1A 17:9F0A: 53 B5     .word bra_long_case_B553_09_twin_shot
- D - I - 0x021F1C 17:9F0C: 5A B5     .word bra_long_case_B55A_0A_skylab_twin_shot
- D - I - 0x021F1E 17:9F0E: 67 B5     .word bra_long_case_B567_0B_eagle_shot
- D - I - 0x021F20 17:9F10: 75 B5     .word bra_long_case_B575_0C_tiger_shot
- D - I - 0x021F22 17:9F12: 83 B5     .word bra_long_case_B583_0D_neo_tiger_shot
- D - I - 0x021F24 17:9F14: 99 B5     .word bra_long_case_B599_0E_overhead
- D - I - 0x021F26 17:9F16: 9D B5     .word bra_long_case_B59D_0F_hyper_overhead
- D - I - 0x021F28 17:9F18: A4 B5     .word bra_long_case_B5A4_10_jumping_volley
- D - I - 0x021F2A 17:9F1A: BA B5     .word bra_long_case_B5BA_11_drive_tiger
- D - I - 0x021F2C 17:9F1C: D0 B5     .word bra_long_case_B5D0_12_cyclone
- D - I - 0x021F2E 17:9F1E: E4 B5     .word bra_long_case_B5E4_13_sano_combo
- D - I - 0x021F30 17:9F20: EC B5     .word bra_long_case_B5EC_14_banana_shot
- D - I - 0x021F32 17:9F22: F7 B5     .word bra_long_case_B5F7_15_booster_shot
- D - I - 0x021F34 17:9F24: 0B B6     .word bra_long_case_B60B_16_mirage_shot
- D - I - 0x021F36 17:9F26: 1D B6     .word bra_long_case_B61D_17_mach_shot
- D - I - 0x021F38 17:9F28: 75 B6     .word bra_long_case_B675_18_sidewinder_shot
- D - I - 0x021F3A 17:9F2A: 85 B6     .word bra_long_case_B685_19_slider_shot
- D - I - 0x021F3C 17:9F2C: 90 B6     .word bra_long_case_B690_1A_cannon_shot
- D - I - 0x021F3E 17:9F2E: C0 B6     .word bra_long_case_B6C0_1B_fire_shot
- D - I - 0x021F40 17:9F30: D6 B6     .word bra_long_case_B6D6_1C_dynamite_header
- - - - - 0x021F42 17:9F32: DE B6     .word bra_long_case_B6DE_1D_cannon_header
- D - I - 0x021F44 17:9F34: E6 B6     .word bra_long_case_B6E6_1E_rocket_header
- D - I - 0x021F46 17:9F36: F0 B6     .word bra_long_case_B6F0_1F_rising_dragon_kick
- D - I - 0x021F48 17:9F38: 01 B7     .word bra_long_case_B701_20_foward_somersault
- D - I - 0x021F4A 17:9F3A: 12 B7     .word bra_long_case_B712_21_slider_cannon
- D - I - 0x021F4C 17:9F3C: 24 B7     .word bra_long_case_B724_22_double_eel



_scenario_9F3E_3C:
; bzk тут должно быть всего 3 поинтера для 10, судя по 0x02037E
; но на всякий случай расшифрованы и остальные
sub_9F3E:
- D - I - 0x021F4E 17:9F3E: F3        .byte con_branch, $10
- D - I - 0x021F50 17:9F40: 4A 9F     .word bra_long_case_9F4A_00
- D - I - 0x021F52 17:9F42: 4B BB     .word bra_long_case_BB4B_01
- D - I - 0x021F54 17:9F44: 4B BB     .word bra_long_case_BB4B_02
- - - - - 0x021F56 17:9F46: 4B BB     .word bra_long_case_BB4B_03
- - - - - 0x021F58 17:9F48: 4B BB     .word bra_long_case_BB4B_04

bra_long_case_9F4A_00:
- D - I - 0x021F5A 17:9F4A: F3        .byte con_branch, $1E
- D - I - 0x021F5C 17:9F4C: 4B BB     .word bra_long_case_BB4B_00
- D - I - 0x021F5E 17:9F4E: 02 B5     .word bra_long_case_B502_01
- D - I - 0x021F60 17:9F50: 4F B5     .word bra_long_case_B54F_02
- D - I - 0x021F62 17:9F52: 50 BB     .word bra_long_case_BB50_03



_scenario_9F54_2C:
- D - I - 0x021F64 17:9F54: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x021F66 17:9F56: F3        .byte con_branch, $04     ; мяч у атакующего/низкий, или высокий
- D - I - 0x021F68 17:9F58: 24 BA     .word bra_long_case_BA24_00
- D - I - 0x021F6A 17:9F5A: 1C BA     .word bra_long_case_BA1C_01

sub_9F5C_рандом_анимации_отпизженного_игрока_с_сообщением:
- D - I - 0x021F6C 17:9F5C: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021F6E 17:9F5E: 5B A0     .word bra_long_case_A05B_00_рандом_1
- D - I - 0x021F70 17:9F60: 60 A0     .word bra_long_case_A060_01_рандом_2

loc_9F62_рандом_анимации_отпизженного_игрока_с_сообщением:
sub_9F62_рандом_анимации_отпизженного_игрока_с_сообщением:
- D - I - 0x021F72 17:9F62: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021F74 17:9F64: 65 A0     .word bra_long_case_A065_00_рандом_1
- D - I - 0x021F76 17:9F66: 6A A0     .word bra_long_case_A06A_01_рандом_2

sub_9F68_рандом_анимации_отпизженного_игрока_без_сообщения:
- D - I - 0x021F78 17:9F68: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021F7A 17:9F6A: 1A A2     .word bra_long_case_A21A_00_рандом_1
- D - I - 0x021F7C 17:9F6C: 1F A2     .word bra_long_case_A21F_01_рандом_2

sub_9F6E_рандом_анимации_отпизженного_игрока_с_сообщением:
- D - I - 0x021F7E 17:9F6E: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021F80 17:9F70: 24 A2     .word bra_long_case_A224_00_рандом_1
- D - I - 0x021F82 17:9F72: 29 A2     .word bra_long_case_A229_01_рандом_2

sub_9F74_рандом_анимации_отпизженного_игрока_без_сообщения:
- D - I - 0x021F84 17:9F74: F3        .byte con_branch, $42     ; 2 варианта рандома
- D - I - 0x021F86 17:9F76: 33 B4     .word bra_long_case_B433_00_рандом_1
- D - I - 0x021F88 17:9F78: 38 B4     .word bra_long_case_B438_01_рандом_2

sub_9F7A_спешал_блок:
- D - I - 0x021F8A 17:9F7A: F3        .byte con_branch, $33     ; защитный спешал
- D - I - 0x021F8C 17:9F7C: 13 A7     .word bra_long_case_A713_00___без_защитного_спешала
- - - - - 0x021F8E 17:9F7E: F6 A6     .word bra_long_case_A6F6_01_masao_kazuo
- - - - - 0x021F90 17:9F80: 06 A7     .word bra_long_case_A706_02_masao_kazuo
- - - - - 0x021F92 17:9F82: 13 A7     .word bra_long_case_A713_00___без_защитного_спешала
- - - - - 0x021F94 17:9F84: 13 A7     .word bra_long_case_A713_00___без_защитного_спешала
- - - - - 0x021F96 17:9F86: 89 A7     .word bra_long_case_A789_05_jitou
- - - - - 0x021F98 17:9F88: 9C A7     .word bra_long_case_A79C_06_jitou
- - - - - 0x021F9A 17:9F8A: 92 A7     .word bra_long_case_A792_07___dirceu
- - - - - 0x021F9C 17:9F8C: 92 A7     .word bra_long_case_A792_07___dirceu
- - - - - 0x021F9E 17:9F8E: 92 A7     .word bra_long_case_A792_07___dirceu
- - - - - 0x021FA0 17:9F90: 92 A7     .word bra_long_case_A792_07___dirceu
- - - - - 0x021FA2 17:9F92: 92 A7     .word bra_long_case_A792_07___dirceu
- - - - - 0x021FA4 17:9F94: 13 A7     .word bra_long_case_A713_00___без_защитного_спешала
- - - - - 0x021FA6 17:9F96: 13 A7     .word bra_long_case_A713_00___без_защитного_спешала
- - - - - 0x021FA8 17:9F98: A5 A7     .word bra_long_case_A7A5_0E_ishizaki
- - - - - 0x021FAA 17:9F9A: BF A7     .word bra_long_case_A7BF_0F_ishizaki

sub_9F9C_крит_кипера:
- D - I - 0x021FAC 17:9F9C: F3        .byte con_branch, $AF     ; киперы с критами
- D - I - 0x021FAE 17:9F9E: 15        .byte bra_case_9FB3_00_кипер_без_крита - *
- D - I - 0x021FAF 17:9F9F: 02        .byte bra_case_9FA1_01_крит_морисаки - *
- D - I - 0x021FB0 17:9FA0: 09        .byte bra_case_9FA9_02_крит_вакабаяши - *

bra_case_9FA1_01_крит_морисаки:
- D - I - 0x021FB1 17:9FA1: F5        .byte con_mirror_off
- D - I - 0x021FB2 17:9FA2: 78        .byte con_pause + $78
- D - I - 0x021FB3 17:9FA3: 33        .byte con_bg + $33
- D - I - 0x021FB4 17:9FA4: 94        .byte con_animation + $94
- D - I - 0x021FB5 17:9FA5: A0        .byte con_cloud + $A0
- D - I - 0x021FB6 17:9FA6: F2        .byte con_jmp
- D - I - 0x021FB7 17:9FA7: 23 9C     .word loc_BBC7_очистка

bra_case_9FA9_02_крит_вакабаяши:
- D - I - 0x021FB9 17:9FA9: F9        .byte con_soundID_delay, $20, $02     ; ???
- D - I - 0x021FBC 17:9FAC: 78        .byte con_pause + $78
- D - I - 0x021FBD 17:9FAD: 48        .byte con_bg + $48
- D - I - 0x021FBE 17:9FAE: 75        .byte con_animation + $75
- D - I - 0x021FBF 17:9FAF: A1        .byte con_cloud + $A1
- D - I - 0x021FC0 17:9FB0: F2        .byte con_jmp
- D - I - 0x021FC1 17:9FB1: 23 9C     .word loc_BBC7_очистка

bra_case_9FB3_00_кипер_без_крита:
- D - I - 0x021FC3 17:9FB3: FB        .byte con_rts

loc_9FB5_убийство_кипера:
sub_9FB5_убийство_кипера:
- D - I - 0x021FC5 17:9FB5: 32        .byte con_pause + $32
- D - I - 0x021FC6 17:9FB6: 1B        .byte con_bg + $1B
- D - I - 0x021FC7 17:9FB7: 02        .byte con_animation + $02
- D - I - 0x021FC8 17:9FB8: 01        .byte con_cloud + $01
- D - I - 0x021FC9 17:9FB9: FB        .byte con_rts



_scenario_9FBA_3D:
- D - I - 0x021FCA 17:9FBA: 78        .byte con_pause + $78
- D - I - 0x021FCB 17:9FBB: F0        .byte con_bg + con_skip
- D - I - 0x021FCC 17:9FBC: F0        .byte con_animation + con_skip
- D - I - 0x021FCD 17:9FBD: 25        .byte con_cloud + $25
- D - I - 0x021FCE 17:9FBE: FB        .byte con_rts

loc_9FBF:
- D - I - 0x021FCF 17:9FBF: FA        .byte con_jsr
- D - I - 0x021FD0 17:9FC0: C7 9F     .word sub_9FC7
- D - I - 0x021FD2 17:9FC2: 5A        .byte con_pause + $5A
- D - I - 0x021FD3 17:9FC3: 58        .byte con_bg + $58
- D - I - 0x021FD4 17:9FC4: 03        .byte con_animation + $03
- D - I - 0x021FD5 17:9FC5: E3        .byte con_cloud + $E3
- D - I - 0x021FD6 17:9FC6: FB        .byte con_rts

sub_9FC7:
- D - I - 0x021FD7 17:9FC7: F6        .byte con_mirror_toggle
- D - I - 0x021FD8 17:9FC8: FC        .byte con_moving_bg, $04
- D - I - 0x021FDA 17:9FCA: F9        .byte con_soundID_delay, $2A, $02     ; ловля мяча/мяч приклеился
- D - I - 0x021FDD 17:9FCD: FB        .byte con_rts

loc_9FCE:
- D - I - 0x021FDE 17:9FCE: FA        .byte con_jsr
- D - I - 0x021FDF 17:9FCF: C7 9F     .word sub_9FC7
- D - I - 0x021FE1 17:9FD1: 5A        .byte con_pause + $5A
- D - I - 0x021FE2 17:9FD2: 58        .byte con_bg + $58
- D - I - 0x021FE3 17:9FD3: 03        .byte con_animation + $03
- D - I - 0x021FE4 17:9FD4: 0B        .byte con_cloud + $0B
- D - I - 0x021FE5 17:9FD5: FB        .byte con_rts

sub_9FD6:
- D - I - 0x021FE6 17:9FD6: F5        .byte con_mirror_off
- D - I - 0x021FE7 17:9FD7: FC        .byte con_moving_bg, $04
- D - I - 0x021FE9 17:9FD9: 32        .byte con_pause + $32
- D - I - 0x021FEA 17:9FDA: 58        .byte con_bg + $58
- D - I - 0x021FEB 17:9FDB: 04        .byte con_animation + $04
- D - I - 0x021FEC 17:9FDC: 06        .byte con_cloud + $06
- D - I - 0x021FED 17:9FDD: FB        .byte con_rts

loc_9FDE:
- D - I - 0x021FEE 17:9FDE: FC        .byte con_moving_bg, $02
loc_9FE0:
- D - I - 0x021FF0 17:9FE0: 2D        .byte con_pause + $2D
- D - I - 0x021FF1 17:9FE1: F0        .byte con_bg + con_skip
- D - I - 0x021FF2 17:9FE2: 05        .byte con_animation + $05
- D - I - 0x021FF3 17:9FE3: F0        .byte con_cloud + con_skip
- D - I - 0x021FF4 17:9FE4: FB        .byte con_rts

sub_9FE5:
- D - I - 0x021FF5 17:9FE5: 3C        .byte con_pause + $3C
- D - I - 0x021FF6 17:9FE6: 6C        .byte con_bg + $6C
- D - I - 0x021FF7 17:9FE7: 06        .byte con_animation + $06
- D - I - 0x021FF8 17:9FE8: 07        .byte con_cloud + $07
- D - I - 0x021FF9 17:9FE9: FB        .byte con_rts

loc_9FEA:
sub_9FEA:
- D - I - 0x021FFA 17:9FEA: FC        .byte con_moving_bg, $02
- D - I - 0x021FFC 17:9FEC: 3C        .byte con_pause + $3C
- D - I - 0x021FFD 17:9FED: 57        .byte con_bg + $57
- D - I - 0x021FFE 17:9FEE: 07        .byte con_animation + $07
- D - I - 0x021FFF 17:9FEF: 07        .byte con_cloud + $07
- D - I - 0x022000 17:9FF0: FB        .byte con_rts

sub_9FF1:
- D - I - 0x022001 17:9FF1: F8        .byte con_F8, $02
sub_9FF3:
- D - I - 0x022003 17:9FF3: F9        .byte con_soundID_delay, $2A, $02     ; ловля мяча/мяч приклеился
- D - I - 0x022006 17:9FF6: 14        .byte con_pause + $14
- D - I - 0x022007 17:9FF7: F0        .byte con_bg + con_skip
- D - I - 0x022008 17:9FF8: 08        .byte con_animation + $08
- D - I - 0x022009 17:9FF9: F0        .byte con_cloud + con_skip
- D - I - 0x02200A 17:9FFA: FE        .byte con_FE
- D - I - 0x02200C 17:9FFC: FB        .byte con_rts

sub_9FFD:
- D - I - 0x02200D 17:9FFD: FC        .byte con_moving_bg, $02
- D - I - 0x02200F 17:9FFF: 1E        .byte con_pause + $1E
- D - I - 0x022010 11:A000: 57        .byte con_bg + $57
- D - I - 0x022011 11:A001: 09        .byte con_animation + $09
- D - I - 0x022012 11:A002: 08        .byte con_cloud + $08
- D - I - 0x022013 11:A003: FB        .byte con_rts

sub_A004:
- D - I - 0x022014 11:A004: FC        .byte con_moving_bg, $02
- D - I - 0x022016 11:A006: 1E        .byte con_pause + $1E
- D - I - 0x022017 11:A007: 57        .byte con_bg + $57
- D - I - 0x022018 11:A008: 09        .byte con_animation + $09
- D - I - 0x022019 11:A009: 09        .byte con_cloud + $09
- D - I - 0x02201A 11:A00A: FB        .byte con_rts

sub_A00B:
- D - I - 0x02201B 11:A00B: 1E        .byte con_pause + $1E
- D - I - 0x02201C 11:A00C: 6C        .byte con_bg + $6C
- D - I - 0x02201D 11:A00D: 09        .byte con_animation + $09
- D - I - 0x02201E 11:A00E: 08        .byte con_cloud + $08
- D - I - 0x02201F 11:A00F: FB        .byte con_rts

sub_A010:
- D - I - 0x022020 11:A010: 1E        .byte con_pause + $1E
- D - I - 0x022021 11:A011: 6C        .byte con_bg + $6C
- D - I - 0x022022 11:A012: 09        .byte con_animation + $09
- D - I - 0x022023 11:A013: 09        .byte con_cloud + $09
- D - I - 0x022024 11:A014: FB        .byte con_rts

loc_A015:
- D - I - 0x022025 11:A015: FC        .byte con_moving_bg, $02
loc_A017:
- D - I - 0x022027 11:A017: 32        .byte con_pause + $32
- D - I - 0x022028 11:A018: F0        .byte con_bg + con_skip
- D - I - 0x022029 11:A019: 0B        .byte con_animation + $0B
- D - I - 0x02202A 11:A01A: F0        .byte con_cloud + con_skip
- D - I - 0x02202B 11:A01B: FB        .byte con_rts

sub_A01C:
- D - I - 0x02202C 11:A01C: FC        .byte con_moving_bg, $02
- D - I - 0x02202E 11:A01E: 3C        .byte con_pause + $3C
- D - I - 0x02202F 11:A01F: 57        .byte con_bg + $57
- D - I - 0x022030 11:A020: 0C        .byte con_animation + $0C
- D - I - 0x022031 11:A021: 07        .byte con_cloud + $07
- D - I - 0x022032 11:A022: FB        .byte con_rts

sub_A023:
- D - I - 0x022033 11:A023: F8        .byte con_F8, $02
sub_A025:
- D - I - 0x022035 11:A025: F9        .byte con_soundID_delay, $2D, $02     ; удар мяча об живот
- D - I - 0x022038 11:A028: 14        .byte con_pause + $14
- D - I - 0x022039 11:A029: F0        .byte con_bg + con_skip
- D - I - 0x02203A 11:A02A: 0D        .byte con_animation + $0D
- D - I - 0x02203B 11:A02B: F0        .byte con_cloud + con_skip
- D - I - 0x02203C 11:A02C: FE        .byte con_FE
- D - I - 0x02203E 11:A02E: FB        .byte con_rts

sub_A02F:
- D - I - 0x02203F 11:A02F: 1E        .byte con_pause + $1E
- D - I - 0x022040 11:A030: 6C        .byte con_bg + $6C
- D - I - 0x022041 11:A031: 35        .byte con_animation + $35
- D - I - 0x022042 11:A032: 08        .byte con_cloud + $08
- D - I - 0x022043 11:A033: FB        .byte con_rts

sub_A034:
- D - I - 0x022044 11:A034: FC        .byte con_moving_bg, $02
- D - I - 0x022046 11:A036: 1E        .byte con_pause + $1E
- D - I - 0x022047 11:A037: 57        .byte con_bg + $57
- D - I - 0x022048 11:A038: 35        .byte con_animation + $35
- D - I - 0x022049 11:A039: 08        .byte con_cloud + $08
- D - I - 0x02204A 11:A03A: FB        .byte con_rts

sub_A03B:
- D - I - 0x02204B 11:A03B: FC        .byte con_moving_bg, $02
- D - I - 0x02204D 11:A03D: 1E        .byte con_pause + $1E
- D - I - 0x02204E 11:A03E: 57        .byte con_bg + $57
- D - I - 0x02204F 11:A03F: 35        .byte con_animation + $35
- D - I - 0x022050 11:A040: 09        .byte con_cloud + $09
- D - I - 0x022051 11:A041: FB        .byte con_rts

sub_A042:
- D - I - 0x022052 11:A042: 1E        .byte con_pause + $1E
- D - I - 0x022053 11:A043: 6C        .byte con_bg + $6C
- D - I - 0x022054 11:A044: 35        .byte con_animation + $35
- D - I - 0x022055 11:A045: 08        .byte con_cloud + $08
- D - I - 0x022056 11:A046: FB        .byte con_rts

sub_A047:
- D - I - 0x022057 11:A047: 1E        .byte con_pause + $1E
- D - I - 0x022058 11:A048: 6C        .byte con_bg + $6C
- D - I - 0x022059 11:A049: 35        .byte con_animation + $35
- D - I - 0x02205A 11:A04A: 09        .byte con_cloud + $09
- D - I - 0x02205B 11:A04B: FB        .byte con_rts

loc_A04C:
- D - I - 0x02205C 11:A04C: 32        .byte con_pause + $32
- D - I - 0x02205D 11:A04D: 6C        .byte con_bg + $6C
- D - I - 0x02205E 11:A04E: 0B        .byte con_animation + $0B
- D - I - 0x02205F 11:A04F: F0        .byte con_cloud + con_skip
- D - I - 0x022060 11:A050: FB        .byte con_rts

sub_A051:
- D - I - 0x022061 11:A051: F9        .byte con_soundID_delay, $2D, $02     ; удар мяча об живот
- D - I - 0x022064 11:A054: 1B        .byte con_pause + $1B
- D - I - 0x022065 11:A055: F0        .byte con_bg + con_skip
- D - I - 0x022066 11:A056: 0D        .byte con_animation + $0D
- D - I - 0x022067 11:A057: F0        .byte con_cloud + con_skip
- D - I - 0x022068 11:A058: FE        .byte con_FE
- D - I - 0x02206A 11:A05A: FB        .byte con_rts

bra_long_case_A05B_00_рандом_1:
- D - I - 0x02206B 11:A05B: 3C        .byte con_pause + $3C
- D - I - 0x02206C 11:A05C: 1B        .byte con_bg + $1B
- D - I - 0x02206D 11:A05D: 13        .byte con_animation + $13
- D - I - 0x02206E 11:A05E: 02        .byte con_cloud + $02
- D - I - 0x02206F 11:A05F: FB        .byte con_rts

bra_long_case_A060_01_рандом_2:
- D - I - 0x022070 11:A060: 3C        .byte con_pause + $3C
- D - I - 0x022071 11:A061: 1B        .byte con_bg + $1B
- D - I - 0x022072 11:A062: 14        .byte con_animation + $14
- D - I - 0x022073 11:A063: 02        .byte con_cloud + $02
- D - I - 0x022074 11:A064: FB        .byte con_rts

bra_long_case_A065_00_рандом_1:
- D - I - 0x022075 11:A065: 3C        .byte con_pause + $3C
- D - I - 0x022076 11:A066: 1C        .byte con_bg + $1C
- D - I - 0x022077 11:A067: 13        .byte con_animation + $13
- D - I - 0x022078 11:A068: 02        .byte con_cloud + $02
- D - I - 0x022079 11:A069: FB        .byte con_rts

bra_long_case_A06A_01_рандом_2:
- D - I - 0x02207A 11:A06A: 3C        .byte con_pause + $3C
- D - I - 0x02207B 11:A06B: 1C        .byte con_bg + $1C
- D - I - 0x02207C 11:A06C: 14        .byte con_animation + $14
- D - I - 0x02207D 11:A06D: 02        .byte con_cloud + $02
- D - I - 0x02207E 11:A06E: FB        .byte con_rts

loc_A06F:
- D - I - 0x02207F 11:A06F: FC        .byte con_moving_bg, $02
- D - I - 0x022081 11:A071: F9        .byte con_soundID_delay, $2D, $02     ; удар мяча об живот
- D - I - 0x022084 11:A074: 3C        .byte con_pause + $3C
- D - I - 0x022085 11:A075: 57        .byte con_bg + $57
- D - I - 0x022086 11:A076: 15        .byte con_animation + $15
- D - I - 0x022087 11:A077: 03        .byte con_cloud + $03
- D - I - 0x022088 11:A078: FB        .byte con_rts

loc_A079:
- D - I - 0x022089 11:A079: FC        .byte con_moving_bg, $03
- D - I - 0x02208B 11:A07B: F9        .byte con_soundID_delay, $2A, $02     ; ловля мяча/мяч приклеился
- D - I - 0x02208E 11:A07E: 3C        .byte con_pause + $3C
- D - I - 0x02208F 11:A07F: 57        .byte con_bg + $57
- D - I - 0x022090 11:A080: 16        .byte con_animation + $16
- D - I - 0x022091 11:A081: 0B        .byte con_cloud + $0B
- D - I - 0x022092 11:A082: FB        .byte con_rts

loc_A083:
- D - I - 0x022093 11:A083: F7        .byte con_F7, $07
- D - I - 0x022095 11:A085: F9        .byte con_soundID_delay, $2A, $21     ; ловля мяча/мяч приклеился
- D - I - 0x022098 11:A088: 50        .byte con_pause + $50
- D - I - 0x022099 11:A089: 40        .byte con_bg + $40
- D - I - 0x02209A 11:A08A: 17        .byte con_animation + $17
- D - I - 0x02209B 11:A08B: 0B        .byte con_cloud + $0B
- D - I - 0x02209C 11:A08C: FB        .byte con_rts

sub_A08D:
- D - I - 0x02209D 11:A08D: FC        .byte con_moving_bg, $02
- D - I - 0x02209F 11:A08F: 32        .byte con_pause + $32
- D - I - 0x0220A0 11:A090: 57        .byte con_bg + $57
- D - I - 0x0220A1 11:A091: 18        .byte con_animation + $18
- D - I - 0x0220A2 11:A092: 0C        .byte con_cloud + $0C
- D - I - 0x0220A3 11:A093: FB        .byte con_rts

sub_A094:
- D - I - 0x0220A4 11:A094: 2B        .byte con_pause + $2B
- D - I - 0x0220A5 11:A095: 03        .byte con_bg + $03
- D - I - 0x0220A6 11:A096: 18        .byte con_animation + $18
- D - I - 0x0220A7 11:A097: 0C        .byte con_cloud + $0C
- D - I - 0x0220A8 11:A098: FB        .byte con_rts

sub_A099_анимация_кипер_ловит_мяч:
- D - I - 0x0220A9 11:A099: F9        .byte con_soundID_delay, $2A, $02     ; ловля мяча/мяч приклеился
- D - I - 0x0220AC 11:A09C: 28        .byte con_pause + $28
- D - I - 0x0220AD 11:A09D: 03        .byte con_bg + $03
- D - I - 0x0220AE 11:A09E: 03        .byte con_animation + $03
- D - I - 0x0220AF 11:A09F: 0D        .byte con_cloud + $0D
- D - I - 0x0220B0 11:A0A0: FB        .byte con_rts

sub_A0A1_кипер_ловит_мяч_без_звука:
- D - I - 0x0220B1 11:A0A1: 20        .byte con_pause + $20
- D - I - 0x0220B2 11:A0A2: 03        .byte con_bg + $03
- D - I - 0x0220B3 11:A0A3: 1B        .byte con_animation + $1B
- D - I - 0x0220B4 11:A0A4: 0E        .byte con_cloud + $0E
- D - I - 0x0220B5 11:A0A5: FB        .byte con_rts

loc_A0A6_кипер_ловит_мяч_со_звуком:
sub_A0A6_кипер_ловит_мяч_со_звуком:
- D - I - 0x0220B6 11:A0A6: F9        .byte con_soundID_delay, $2A, $21     ; ловля мяча/мяч приклеился
- D - I - 0x0220B9 11:A0A9: 46        .byte con_pause + $46
- D - I - 0x0220BA 11:A0AA: 03        .byte con_bg + $03
- D - I - 0x0220BB 11:A0AB: 1B        .byte con_animation + $1B
- D - I - 0x0220BC 11:A0AC: 0E        .byte con_cloud + $0E
- D - I - 0x0220BD 11:A0AD: FB        .byte con_rts

sub_A0AE:
- D - I - 0x0220BE 11:A0AE: F9        .byte con_soundID_delay, $25, $02     ; прыжок
- D - I - 0x0220C1 11:A0B1: 14        .byte con_pause + $14
- D - I - 0x0220C2 11:A0B2: 02        .byte con_bg + $02
- D - I - 0x0220C3 11:A0B3: 1C        .byte con_animation + $1C
- D - I - 0x0220C4 11:A0B4: 00        .byte con_cloud + con_clear
- D - I - 0x0220C5 11:A0B5: FB        .byte con_rts

loc_A0B6_защитник_спасает_ворота:
sub_A0B6_защитник_спасает_ворота:
- D - I - 0x0220C6 11:A0B6: F9        .byte con_soundID_delay, $2B, $19     ; отбитие мяча/принятие на ногу
- D - I - 0x0220C9 11:A0B9: 18        .byte con_pause + $18
- D - I - 0x0220CA 11:A0BA: 04        .byte con_bg + $04
- D - I - 0x0220CB 11:A0BB: 21        .byte con_animation + $21
- D - I - 0x0220CC 11:A0BC: 0F        .byte con_cloud + $0F
- D - I - 0x0220CD 11:A0BD: FB        .byte con_rts

sub_A0BE:
- D - I - 0x0220CE 11:A0BE: 30        .byte con_pause + $30
- D - I - 0x0220CF 11:A0BF: 04        .byte con_bg + $04
- D - I - 0x0220D0 11:A0C0: 22        .byte con_animation + $22
- D - I - 0x0220D1 11:A0C1: 11        .byte con_cloud + $11
- D - I - 0x0220D2 11:A0C2: FB        .byte con_rts

loc_A0C3:
sub_A0C3:
- D - I - 0x0220D3 11:A0C3: FC        .byte con_moving_bg, $02
- D - I - 0x0220D5 11:A0C5: F9        .byte con_soundID_delay, $2D, $02     ; удар мяча об живот
- D - I - 0x0220D8 11:A0C8: 46        .byte con_pause + $46
- D - I - 0x0220D9 11:A0C9: 57        .byte con_bg + $57
- D - I - 0x0220DA 11:A0CA: 15        .byte con_animation + $15
- D - I - 0x0220DB 11:A0CB: 05        .byte con_cloud + $05
- D - I - 0x0220DC 11:A0CC: FB        .byte con_rts

sub_A0CD_rolling_save:
- D - I - 0x0220DD 11:A0CD: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x0220E0 11:A0D0: 0A        .byte con_pause + $0A
- D - I - 0x0220E1 11:A0D1: 13        .byte con_bg + $13
- D - I - 0x0220E2 11:A0D2: 23        .byte con_animation + $23
- D - I - 0x0220E3 11:A0D3: 12        .byte con_cloud + $12
- D - I - 0x0220E4 11:A0D4: 0A        .byte con_pause + $0A
- D - I - 0x0220E5 11:A0D5: 14        .byte con_bg + $14
- D - I - 0x0220E6 11:A0D6: F0        .byte con_animation + con_skip
- D - I - 0x0220E7 11:A0D7: F0        .byte con_cloud + con_skip
- D - I - 0x0220E8 11:A0D8: 0A        .byte con_pause + $0A
- D - I - 0x0220E9 11:A0D9: 15        .byte con_bg + $15
- D - I - 0x0220EA 11:A0DA: F0        .byte con_animation + con_skip
- D - I - 0x0220EB 11:A0DB: F0        .byte con_cloud + con_skip
- D - I - 0x0220EC 11:A0DC: 0A        .byte con_pause + $0A
- D - I - 0x0220ED 11:A0DD: 16        .byte con_bg + $16
- D - I - 0x0220EE 11:A0DE: F0        .byte con_animation + con_skip
- D - I - 0x0220EF 11:A0DF: F0        .byte con_cloud + con_skip
- D - I - 0x0220F0 11:A0E0: 0A        .byte con_pause + $0A
- D - I - 0x0220F1 11:A0E1: 17        .byte con_bg + $17
- D - I - 0x0220F2 11:A0E2: F0        .byte con_animation + con_skip
- D - I - 0x0220F3 11:A0E3: F0        .byte con_cloud + con_skip
- D - I - 0x0220F4 11:A0E4: 0A        .byte con_pause + $0A
- D - I - 0x0220F5 11:A0E5: 18        .byte con_bg + $18
- D - I - 0x0220F6 11:A0E6: F0        .byte con_animation + con_skip
- D - I - 0x0220F7 11:A0E7: F0        .byte con_cloud + con_skip
- D - I - 0x0220F8 11:A0E8: 0A        .byte con_pause + $0A
- D - I - 0x0220F9 11:A0E9: 11        .byte con_bg + $11
- D - I - 0x0220FA 11:A0EA: F0        .byte con_animation + con_skip
- D - I - 0x0220FB 11:A0EB: F0        .byte con_cloud + con_skip
- D - I - 0x0220FC 11:A0EC: 0A        .byte con_pause + $0A
- D - I - 0x0220FD 11:A0ED: 12        .byte con_bg + $12
- D - I - 0x0220FE 11:A0EE: F0        .byte con_animation + con_skip
- D - I - 0x0220FF 11:A0EF: F0        .byte con_cloud + con_skip
- D - I - 0x022100 11:A0F0: 0A        .byte con_pause + $0A
- D - I - 0x022101 11:A0F1: 13        .byte con_bg + $13
- D - I - 0x022102 11:A0F2: F0        .byte con_animation + con_skip
- D - I - 0x022103 11:A0F3: F0        .byte con_cloud + con_skip
- D - I - 0x022104 11:A0F4: 0A        .byte con_pause + $0A
- D - I - 0x022105 11:A0F5: 14        .byte con_bg + $14
- D - I - 0x022106 11:A0F6: F0        .byte con_animation + con_skip
- D - I - 0x022107 11:A0F7: F0        .byte con_cloud + con_skip
- D - I - 0x022108 11:A0F8: 0A        .byte con_pause + $0A
- D - I - 0x022109 11:A0F9: 15        .byte con_bg + $15
- D - I - 0x02210A 11:A0FA: F0        .byte con_animation + con_skip
- D - I - 0x02210B 11:A0FB: F0        .byte con_cloud + con_skip
- D - I - 0x02210C 11:A0FC: 0A        .byte con_pause + $0A
- D - I - 0x02210D 11:A0FD: 16        .byte con_bg + $16
- D - I - 0x02210E 11:A0FE: F0        .byte con_animation + con_skip
- D - I - 0x02210F 11:A0FF: F0        .byte con_cloud + con_skip
- D - I - 0x022110 11:A100: 0A        .byte con_pause + $0A
- D - I - 0x022111 11:A101: 17        .byte con_bg + $17
- D - I - 0x022112 11:A102: F0        .byte con_animation + con_skip
- D - I - 0x022113 11:A103: F0        .byte con_cloud + con_skip
- D - I - 0x022114 11:A104: 0A        .byte con_pause + $0A
- D - I - 0x022115 11:A105: 18        .byte con_bg + $18
- D - I - 0x022116 11:A106: F0        .byte con_animation + con_skip
- D - I - 0x022117 11:A107: F0        .byte con_cloud + con_skip
- D - I - 0x022118 11:A108: FB        .byte con_rts

sub_A109:
- D - I - 0x022119 11:A109: 28        .byte con_pause + $28
- D - I - 0x02211A 11:A10A: 0E        .byte con_bg + $0E
- D - I - 0x02211B 11:A10B: 25        .byte con_animation + $25
- D - I - 0x02211C 11:A10C: 07        .byte con_cloud + $07
- D - I - 0x02211D 11:A10D: FB        .byte con_rts

sub_A10E:
- D - I - 0x02211E 11:A10E: F3        .byte con_branch, $A0
- D - I - 0x022120 11:A110: 03        .byte bra_case_A113_00 - *
- D - I - 0x022121 11:A111: 07        .byte bra_case_A118_01 - *
- - - - - 0x022122 11:A112: 06        .byte bra_case_A118_02 - *

bra_case_A113_00:
- D - I - 0x022123 11:A113: 25        .byte con_pause + $25
- D - I - 0x022124 11:A114: 0E        .byte con_bg + $0E
- D - I - 0x022125 11:A115: 24        .byte con_animation + $24
- D - I - 0x022126 11:A116: 0C        .byte con_cloud + $0C
- D - I - 0x022127 11:A117: FB        .byte con_rts

bra_case_A118_01:
bra_case_A118_02:
- D - I - 0x022128 11:A118: 28        .byte con_pause + $28
- D - I - 0x022129 11:A119: 0F        .byte con_bg + $0F
- D - I - 0x02212A 11:A11A: 26        .byte con_animation + $26
- D - I - 0x02212B 11:A11B: 0C        .byte con_cloud + $0C
- D - I - 0x02212C 11:A11C: FB        .byte con_rts

sub_A11D_анимация_лови_мячи:
- D - I - 0x02212D 11:A11D: 1E        .byte con_pause + $1E
- D - I - 0x02212E 11:A11E: 0E        .byte con_bg + $0E
- D - I - 0x02212F 11:A11F: 27        .byte con_animation + $27
- D - I - 0x022130 11:A120: 0D        .byte con_cloud + $0D
- D - I - 0x022131 11:A121: FB        .byte con_rts

sub_A122:
- D - I - 0x022132 11:A122: F3        .byte con_branch, $A0
- D - I - 0x022134 11:A124: 03        .byte bra_case_A127_00 - *
- D - I - 0x022135 11:A125: 07        .byte bra_case_A12C_01 - *
- - - - - 0x022136 11:A126: 06        .byte bra_case_A12C_02 - *

bra_case_A127_00:
- D - I - 0x022137 11:A127: 1E        .byte con_pause + $1E
- D - I - 0x022138 11:A128: 0E        .byte con_bg + $0E
- D - I - 0x022139 11:A129: 2A        .byte con_animation + $2A
- D - I - 0x02213A 11:A12A: 0E        .byte con_cloud + $0E
- D - I - 0x02213B 11:A12B: FB        .byte con_rts

bra_case_A12C_01:
bra_case_A12C_02:
- D - I - 0x02213C 11:A12C: 1E        .byte con_pause + $1E
- D - I - 0x02213D 11:A12D: 0F        .byte con_bg + $0F
- D - I - 0x02213E 11:A12E: 2B        .byte con_animation + $2B
- D - I - 0x02213F 11:A12F: 0E        .byte con_cloud + $0E
- D - I - 0x022140 11:A130: FB        .byte con_rts

sub_A131:
- D - I - 0x022141 11:A131: F3        .byte con_branch, $A0
- D - I - 0x022143 11:A133: 03        .byte bra_case_A136_00 - *
- D - I - 0x022144 11:A134: 0A        .byte bra_case_A13E_01 - *
- - - - - 0x022145 11:A135: 09        .byte bra_case_A13E_02 - *

bra_case_A136_00:
- D - I - 0x022146 11:A136: F9        .byte con_soundID_delay, $2B, $21     ; отбитие мяча
- D - I - 0x022149 11:A139: 3A        .byte con_pause + $3A
- D - I - 0x02214A 11:A13A: 0E        .byte con_bg + $0E
- D - I - 0x02214B 11:A13B: 2A        .byte con_animation + $2A
- D - I - 0x02214C 11:A13C: 0E        .byte con_cloud + $0E
- D - I - 0x02214D 11:A13D: FB        .byte con_rts

bra_case_A13E_01:
bra_case_A13E_02:
- D - I - 0x02214E 11:A13E: F9        .byte con_soundID_delay, $2B, $21     ; отбитие мяча
- D - I - 0x022151 11:A141: 3A        .byte con_pause + $3A
- D - I - 0x022152 11:A142: 0F        .byte con_bg + $0F
- D - I - 0x022153 11:A143: 2B        .byte con_animation + $2B
- D - I - 0x022154 11:A144: 0E        .byte con_cloud + $0E
- D - I - 0x022155 11:A145: FB        .byte con_rts

sub_A146:
- D - I - 0x022156 11:A146: 28        .byte con_pause + $28
- D - I - 0x022157 11:A147: 0E        .byte con_bg + $0E
- D - I - 0x022158 11:A148: 2C        .byte con_animation + $2C
- D - I - 0x022159 11:A149: 00        .byte con_cloud + con_clear
- D - I - 0x02215A 11:A14A: FB        .byte con_rts

sub_A14B:
- D - I - 0x02215B 11:A14B: F3        .byte con_branch, $A0
- D - I - 0x02215D 11:A14D: 03        .byte bra_case_A150_00 - *
- D - I - 0x02215E 11:A14E: 07        .byte bra_case_A155_01 - *
- - - - - 0x02215F 11:A14F: 06        .byte bra_case_A155_02 - *

bra_case_A150_00:
- D - I - 0x022160 11:A150: 28        .byte con_pause + $28
- D - I - 0x022161 11:A151: 0E        .byte con_bg + $0E
- D - I - 0x022162 11:A152: 2C        .byte con_animation + $2C
- D - I - 0x022163 11:A153: 15        .byte con_cloud + $15
- D - I - 0x022164 11:A154: FB        .byte con_rts

bra_case_A155_01:
bra_case_A155_02:
- D - I - 0x022165 11:A155: 2A        .byte con_pause + $2A
- D - I - 0x022166 11:A156: 0F        .byte con_bg + $0F
- D - I - 0x022167 11:A157: 2D        .byte con_animation + $2D
- D - I - 0x022168 11:A158: 15        .byte con_cloud + $15
- D - I - 0x022169 11:A159: FB        .byte con_rts

sub_A15A:
- D - I - 0x02216A 11:A15A: FC        .byte con_moving_bg, $02
- D - I - 0x02216C 11:A15C: F9        .byte con_soundID_delay, $2D, $02
- D - I - 0x02216F 11:A15F: 46        .byte con_pause + $46
- D - I - 0x022170 11:A160: 57        .byte con_bg + $57
- D - I - 0x022171 11:A161: 2E        .byte con_animation + $2E
- D - I - 0x022172 11:A162: 05        .byte con_cloud + $05
- D - I - 0x022173 11:A163: FB        .byte con_rts

loc_A164:
- D - I - 0x022174 11:A164: FC        .byte con_moving_bg, $02
- D - I - 0x022176 11:A166: F9        .byte con_soundID_delay, $2D, $02
- D - I - 0x022179 11:A169: 5A        .byte con_pause + $5A
- D - I - 0x02217A 11:A16A: 57        .byte con_bg + $57
- D - I - 0x02217B 11:A16B: 2E        .byte con_animation + $2E
- D - I - 0x02217C 11:A16C: 16        .byte con_cloud + $16
- D - I - 0x02217D 11:A16D: FB        .byte con_rts

loc_A16E:
- D - I - 0x02217E 11:A16E: F9        .byte con_soundID_delay, $2A, $02
- D - I - 0x022181 11:A171: 46        .byte con_pause + $46
- D - I - 0x022182 11:A172: 6C        .byte con_bg + $6C
- D - I - 0x022183 11:A173: 2E        .byte con_animation + $2E
- D - I - 0x022184 11:A174: 16        .byte con_cloud + $16
- D - I - 0x022185 11:A175: FB        .byte con_rts

loc_A176:
sub_A176:
- D - I - 0x022186 11:A176: 3C        .byte con_pause + $3C
- D - I - 0x022187 11:A177: 6C        .byte con_bg + $6C
- D - I - 0x022188 11:A178: 31        .byte con_animation + $31
- D - I - 0x022189 11:A179: 07        .byte con_cloud + $07
- D - I - 0x02218A 11:A17A: FB        .byte con_rts

loc_A17B:
- D - I - 0x02218B 11:A17B: FC        .byte con_moving_bg, $02
- D - I - 0x02218D 11:A17D: F9        .byte con_soundID_delay, $2D, $02
- D - I - 0x022190 11:A180: 46        .byte con_pause + $46
- D - I - 0x022191 11:A181: 57        .byte con_bg + $57
- D - I - 0x022192 11:A182: 30        .byte con_animation + $30
- D - I - 0x022193 11:A183: 05        .byte con_cloud + $05
- D - I - 0x022194 11:A184: FB        .byte con_rts

loc_A185:
- D - I - 0x022195 11:A185: F9        .byte con_soundID_delay, $2B, $02
- D - I - 0x022198 11:A188: 46        .byte con_pause + $46
- D - I - 0x022199 11:A189: 6C        .byte con_bg + $6C
- D - I - 0x02219A 11:A18A: 30        .byte con_animation + $30
- D - I - 0x02219B 11:A18B: 05        .byte con_cloud + $05
- D - I - 0x02219C 11:A18C: FB        .byte con_rts

loc_A18D:
sub_A18D:
- D - I - 0x02219D 11:A18D: F7        .byte con_F7, $02
- D - I - 0x02219F 11:A18F: F9        .byte con_soundID_delay, $2C, $29
- D - I - 0x0221A2 11:A192: 46        .byte con_pause + $46
- D - I - 0x0221A3 11:A193: 22        .byte con_bg + $22
- D - I - 0x0221A4 11:A194: 33        .byte con_animation + $33
- D - I - 0x0221A5 11:A195: 17        .byte con_cloud + $17
- D - I - 0x0221A6 11:A196: FB        .byte con_rts



_scenario_A197_78:
loc_A197:
sub_A197:
- D - I - 0x0221A7 11:A197: F9        .byte con_soundID_delay, $2A, $21
- D - I - 0x0221AA 11:A19A: 2D        .byte con_pause + $2D
- D - I - 0x0221AB 11:A19B: 6E        .byte con_bg + $6E
- D - I - 0x0221AC 11:A19C: 34        .byte con_animation + $34
- D - I - 0x0221AD 11:A19D: 17        .byte con_cloud + $17
- D - I - 0x0221AE 11:A19E: FB        .byte con_rts

loc_A19F:
- - - - - 0x0221AF 11:A19F: FC        .byte con_moving_bg, $02
- - - - - 0x0221B1 11:A1A1: F9        .byte con_soundID_delay, $2D, $02
- - - - - 0x0221B4 11:A1A4: 41        .byte con_pause + $41
- - - - - 0x0221B5 11:A1A5: 57        .byte con_bg + $57
- - - - - 0x0221B6 11:A1A6: 30        .byte con_animation + $30
- - - - - 0x0221B7 11:A1A7: 19        .byte con_cloud + $19
- - - - - 0x0221B8 11:A1A8: FB        .byte con_rts

loc_A1A9:
- D - I - 0x0221B9 11:A1A9: F9        .byte con_soundID_delay, $2B, $02
- D - I - 0x0221BC 11:A1AC: 5A        .byte con_pause + $5A
- D - I - 0x0221BD 11:A1AD: 6C        .byte con_bg + $6C
- D - I - 0x0221BE 11:A1AE: 30        .byte con_animation + $30
- D - I - 0x0221BF 11:A1AF: 19        .byte con_cloud + $19
- D - I - 0x0221C0 11:A1B0: FB        .byte con_rts

sub_A1B1:
- D - I - 0x0221C1 11:A1B1: FC        .byte con_moving_bg, $02
- D - I - 0x0221C3 11:A1B3: F9        .byte con_soundID_delay, $2B, $1E
- D - I - 0x0221C6 11:A1B6: 3A        .byte con_pause + $3A
- D - I - 0x0221C7 11:A1B7: 57        .byte con_bg + $57
- D - I - 0x0221C8 11:A1B8: 35        .byte con_animation + $35
- D - I - 0x0221C9 11:A1B9: 1A        .byte con_cloud + $1A
- D - I - 0x0221CA 11:A1BA: FB        .byte con_rts

sub_A1BB:
- D - I - 0x0221CB 11:A1BB: F9        .byte con_soundID_delay, $2C, $1E
- D - I - 0x0221CE 11:A1BE: 3A        .byte con_pause + $3A
- D - I - 0x0221CF 11:A1BF: 6C        .byte con_bg + $6C
- D - I - 0x0221D0 11:A1C0: 35        .byte con_animation + $35
- D - I - 0x0221D1 11:A1C1: 1A        .byte con_cloud + $1A
- D - I - 0x0221D2 11:A1C2: FB        .byte con_rts

sub_A1C3:
- D - I - 0x0221D3 11:A1C3: F7        .byte con_F7, $02
- D - I - 0x0221D5 11:A1C5: 32        .byte con_pause + $32
- D - I - 0x0221D6 11:A1C6: 23        .byte con_bg + $23
- D - I - 0x0221D7 11:A1C7: 37        .byte con_animation + $37
- D - I - 0x0221D8 11:A1C8: 1B        .byte con_cloud + $1B
- D - I - 0x0221D9 11:A1C9: FB        .byte con_rts

sub_A1CA_triangle_jump_ловит_мяч:
- D - I - 0x0221DA 11:A1CA: FC        .byte con_moving_bg, $01
- D - I - 0x0221DC 11:A1CC: 20        .byte con_pause + $20
- D - I - 0x0221DD 11:A1CD: 2E        .byte con_bg + $2E
- D - I - 0x0221DE 11:A1CE: 2D        .byte con_animation + $2D
- D - I - 0x0221DF 11:A1CF: 1C        .byte con_cloud + $1C
- D - I - 0x0221E0 11:A1D0: FB        .byte con_rts

sub_A1D1_triangle_jump_ловит_мяч:
- D - I - 0x0221E1 11:A1D1: FC        .byte con_moving_bg, $01
- D - I - 0x0221E3 11:A1D3: F9        .byte con_soundID_delay, $2A, $21
- D - I - 0x0221E6 11:A1D6: 30        .byte con_pause + $30
- D - I - 0x0221E7 11:A1D7: 2E        .byte con_bg + $2E
- D - I - 0x0221E8 11:A1D8: 2D        .byte con_animation + $2D
- D - I - 0x0221E9 11:A1D9: 1C        .byte con_cloud + $1C
- D - I - 0x0221EA 11:A1DA: FC        .byte con_moving_bg, $01
- D - I - 0x0221EC 11:A1DC: FB        .byte con_rts

sub_A1DD_triangle_jump_не_достает_до_мяча:
- D - I - 0x0221ED 11:A1DD: FC        .byte con_moving_bg, $01
- D - I - 0x0221EF 11:A1DF: 30        .byte con_pause + $30
- D - I - 0x0221F0 11:A1E0: 2E        .byte con_bg + $2E
- D - I - 0x0221F1 11:A1E1: 26        .byte con_animation + $26
- D - I - 0x0221F2 11:A1E2: 1E        .byte con_cloud + $1E
- D - I - 0x0221F3 11:A1E3: FB        .byte con_rts

sub_A1E4_dark_illusion:
- D - I - 0x0221F4 11:A1E4: F7        .byte con_F7, $41
- D - I - 0x0221F6 11:A1E6: F9        .byte con_soundID_delay, $21, $02
- D - I - 0x0221F9 11:A1E9: E0        .byte con_pause + $E0
- D - I - 0x0221FA 11:A1EA: 47        .byte con_bg + $47
- D - I - 0x0221FB 11:A1EB: 7D        .byte con_animation + $7D
- D - I - 0x0221FC 11:A1EC: 1F        .byte con_cloud + $1F
- D - I - 0x0221FD 11:A1ED: F7        .byte con_F7, $42
- D - I - 0x0221FF 11:A1EF: 70        .byte con_pause + $70
- D - I - 0x022200 11:A1F0: F0        .byte con_bg + con_skip
- D - I - 0x022201 11:A1F1: F0        .byte con_animation + con_skip
- D - I - 0x022202 11:A1F2: F0        .byte con_cloud + con_skip
- D - I - 0x022203 11:A1F3: F7        .byte con_F7, $43
- D - I - 0x022205 11:A1F5: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x022208 11:A1F8: 32        .byte con_pause + $32
- D - I - 0x022209 11:A1F9: 05        .byte con_bg + $05
- D - I - 0x02220A 11:A1FA: F0        .byte con_animation + con_skip
- D - I - 0x02220B 11:A1FB: F0        .byte con_cloud + con_skip
- D - I - 0x02220C 11:A1FC: FB        .byte con_rts

sub_A1FF:
- D - I - 0x02220F 11:A1FF: F7        .byte con_F7, $30
- D - I - 0x022211 11:A201: F9        .byte con_soundID_delay, $17, $02
- D - I - 0x022214 11:A204: 96        .byte con_pause + $96
- D - I - 0x022215 11:A205: 6A        .byte con_bg + $6A
- D - I - 0x022216 11:A206: 3A        .byte con_animation + $3A
- D - I - 0x022217 11:A207: 20        .byte con_cloud + $20
- D - I - 0x022218 11:A208: F9        .byte con_soundID_delay, $1F, $02
- D - I - 0x02221B 11:A20B: F7        .byte con_F7, $1D
- D - I - 0x02221D 11:A20D: 80        .byte con_pause + $80
- D - I - 0x02221E 11:A20E: 47        .byte con_bg + $47
- D - I - 0x02221F 11:A20F: F0        .byte con_animation + con_skip
- D - I - 0x022220 11:A210: 21        .byte con_cloud + $21
- D - I - 0x022221 11:A211: FB        .byte con_rts

sub_A212:
- D - I - 0x022222 11:A212: F9        .byte con_soundID_delay, $1B, $21
- D - I - 0x022225 11:A215: 40        .byte con_pause + $40
- D - I - 0x022226 11:A216: 2B        .byte con_bg + $2B
- D - I - 0x022227 11:A217: 3B        .byte con_animation + $3B
- D - I - 0x022228 11:A218: 31        .byte con_cloud + $31
- D - I - 0x022229 11:A219: FB        .byte con_rts

bra_long_case_A21A_00_рандом_1:
- D - I - 0x02222A 11:A21A: 28        .byte con_pause + $28
- D - I - 0x02222B 11:A21B: 1C        .byte con_bg + $1C
- D - I - 0x02222C 11:A21C: 3E        .byte con_animation + $3E
- D - I - 0x02222D 11:A21D: F0        .byte con_cloud + con_skip
- D - I - 0x02222E 11:A21E: FB        .byte con_rts

bra_long_case_A21F_01_рандом_2:
- D - I - 0x02222F 11:A21F: 28        .byte con_pause + $28
- D - I - 0x022230 11:A220: 1C        .byte con_bg + $1C
- D - I - 0x022231 11:A221: 3F        .byte con_animation + $3F
- D - I - 0x022232 11:A222: F0        .byte con_cloud + con_skip
- D - I - 0x022233 11:A223: FB        .byte con_rts

bra_long_case_A224_00_рандом_1:
- D - I - 0x022234 11:A224: 32        .byte con_pause + $32
- D - I - 0x022235 11:A225: 1E        .byte con_bg + $1E
- D - I - 0x022236 11:A226: 3E        .byte con_animation + $3E
- D - I - 0x022237 11:A227: 23        .byte con_cloud + $02
- D - I - 0x022238 11:A228: FB        .byte con_rts

bra_long_case_A229_01_рандом_2:
- D - I - 0x022239 11:A229: 32        .byte con_pause + $32
- D - I - 0x02223A 11:A22A: 1E        .byte con_bg + $1E
- D - I - 0x02223B 11:A22B: 3F        .byte con_animation + $3F
- D - I - 0x02223C 11:A22C: 23        .byte con_cloud + $02
- D - I - 0x02223D 11:A22D: FB        .byte con_rts

loc_A22E:
- D - I - 0x02223E 11:A22E: F7        .byte con_F7, $02
- D - I - 0x022240 11:A230: F9        .byte con_soundID_delay, $2C, $26
- D - I - 0x022243 11:A233: 50        .byte con_pause + $50
- D - I - 0x022244 11:A234: 22        .byte con_bg + $22
- D - I - 0x022245 11:A235: 38        .byte con_animation + $38
- D - I - 0x022246 11:A236: 24        .byte con_cloud + $24
- D - I - 0x022247 11:A237: FB        .byte con_rts

loc_A238:
- D - I - 0x022248 11:A238: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x02224B 11:A23B: 56        .byte con_pause + $56
- D - I - 0x02224C 11:A23C: 6D        .byte con_bg + $6D
- D - I - 0x02224D 11:A23D: 39        .byte con_animation + $39
- D - I - 0x02224E 11:A23E: 24        .byte con_cloud + $24
- D - I - 0x02224F 11:A23F: FB        .byte con_rts

loc_A240:
- D - I - 0x022250 11:A240: F7        .byte con_F7, $11
- D - I - 0x022252 11:A242: 5A        .byte con_pause + $5A
- D - I - 0x022253 11:A243: 05        .byte con_bg + $05
- D - I - 0x022254 11:A244: F0        .byte con_animation + con_skip
- D - I - 0x022255 11:A245: 26        .byte con_cloud + $26
- D - I - 0x022256 11:A246: FB        .byte con_rts

loc_A247:
- D - I - 0x022257 11:A247: F7        .byte con_F7, $11
- D - I - 0x022259 11:A249: 5A        .byte con_pause + $5A
- D - I - 0x02225A 11:A24A: 05        .byte con_bg + $05
- D - I - 0x02225B 11:A24B: F0        .byte con_animation + con_skip
- D - I - 0x02225C 11:A24C: 1D        .byte con_cloud + $1D
- D - I - 0x02225D 11:A24D: FB        .byte con_rts

sub_A24E_штанга:
- D - I - 0x02225E 11:A24E: F7        .byte con_F7, $1F
- D - I - 0x022260 11:A250: F9        .byte con_soundID_delay, $63, $02
- D - I - 0x022263 11:A253: 10        .byte con_pause + $10
- D - I - 0x022264 11:A254: 06        .byte con_bg + $06
- D - I - 0x022265 11:A255: 43        .byte con_animation + $43
- D - I - 0x022266 11:A256: 27        .byte con_cloud + $27
- D - I - 0x022267 11:A257: FB        .byte con_rts

loc_A258:
sub_A258:
- D - I - 0x022268 11:A258: 37        .byte con_pause + $37
- D - I - 0x022269 11:A259: 56        .byte con_bg + $56
- D - I - 0x02226A 11:A25A: 42        .byte con_animation + $42
- D - I - 0x02226B 11:A25B: F0        .byte con_cloud + con_skip
- D - I - 0x02226C 11:A25C: FB        .byte con_rts

bra_long_case_A25D_00_сетка_не_порвана:
- D - I - 0x02226D 11:A25D: F7        .byte con_F7, $03
- D - I - 0x02226F 11:A25F: F9        .byte con_soundID_delay, $60, $02
- D - I - 0x022272 11:A262: 78        .byte con_pause + $78
- D - I - 0x022273 11:A263: 07        .byte con_bg + $07
- D - I - 0x022274 11:A264: 44        .byte con_animation + $44
- D - I - 0x022275 11:A265: 28        .byte con_cloud + $28
- D - I - 0x022276 11:A266: FB        .byte con_rts

loc_A267_goal:
bra_long_case_A267_01_сетка_порвана:
- D - I - 0x022277 11:A267: F7        .byte con_F7, $03
- D - I - 0x022279 11:A269: F9        .byte con_soundID_delay, $61, $02
- D - I - 0x02227C 11:A26C: 78        .byte con_pause + $78
- D - I - 0x02227D 11:A26D: 07        .byte con_bg + $07
- D - I - 0x02227E 11:A26E: 45        .byte con_animation + $45
- D - I - 0x02227F 11:A26F: 28        .byte con_cloud + $28
- D - I - 0x022280 11:A270: FB        .byte con_rts

bra_long_case_A271_02_за_japan:
- D - I - 0x022281 11:A271: A0        .byte con_pause + $A0
- D - I - 0x022282 11:A272: 0A        .byte con_bg + $0A
- D - I - 0x022283 11:A273: 48        .byte con_animation + $48
- D - I - 0x022284 11:A274: 52        .byte con_cloud + $52
loc_A275:
- D - I - 0x022285 11:A275: F7        .byte con_F7, $13
- D - I - 0x022287 11:A277: 6E        .byte con_pause + $6E
- D - I - 0x022288 11:A278: F0        .byte con_bg + con_skip
- D - I - 0x022289 11:A279: F0        .byte con_animation + con_skip
- D - I - 0x02228A 11:A27A: F0        .byte con_cloud + con_skip
- D - I - 0x02228B 11:A27B: F3        .byte con_branch, $A6     ; проигрывает ли германия
- D - I - 0x02228D 11:A27D: 0B        .byte bra_case_A288_00_германия_не_проигрывает - *
- D - I - 0x02228E 11:A27E: 01        .byte bra_case_A27F_01_германия_проигрывает - *

bra_case_A27F_01_германия_проигрывает:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x022293 11:A283: A0        .byte con_pause + $A0
- D - I - 0x022294 11:A284: 30        .byte con_bg + $30
- D - I - 0x022295 11:A285: B8        .byte con_animation + $B8
- D - I - 0x022296 11:A286: 89        .byte con_cloud + $89
- D - I - 0x022297 11:A287: FB        .byte con_rts

bra_case_A288_00_германия_не_проигрывает:
- D - I - 0x022298 11:A288: F3        .byte con_branch, $AD     ; забил ли гол jitou с сано
- D - I - 0x02229A 11:A28A: 1C        .byte bra_case_A2A6_00_гол_забит_другим_ударом - *
- D - I - 0x02229B 11:A28B: 01        .byte bra_case_A28C_01_гол_забили_jitou_с_сано - *

bra_case_A28C_01_гол_забили_jitou_с_сано:
- D - I - 0x02229C 11:A28C: F3        .byte con_branch, $98     ; проверка на jitou из японии
- D - I - 0x02229E 11:A28E: 02        .byte bra_case_A290_00_это_jitou_из_японии - *
- - - - - 0x02229F 11:A28F: 0C        .byte bra_case_A29B_01_это_jitou_из_куними - *

bra_case_A290_00_это_jitou_из_японии:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x0222A4 11:A294: D0        .byte con_pause + $D0
- D - I - 0x0222A5 11:A295: 30        .byte con_bg + $30
- D - I - 0x0222A6 11:A296: A0        .byte con_animation + $A0
- D - I - 0x0222A7 11:A297: 9E        .byte con_cloud + $9E
- D - I - 0x0222A8 11:A298: F2        .byte con_jmp
- D - I - 0x0222A9 11:A299: A3 A2     .word loc_A2A3

bra_case_A29B_01_это_jitou_из_куними:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- - - - - 0x0222AF 11:A29F: D0        .byte con_pause + $D0
- - - - - 0x0222B0 11:A2A0: 30        .byte con_bg + $30
- - - - - 0x0222B1 11:A2A1: AA        .byte con_animation + $AA
- - - - - 0x0222B2 11:A2A2: 9E        .byte con_cloud + $9E
loc_A2A3:
- D - I - 0x0222B3 11:A2A3: FA        .byte con_jsr
- D - I - 0x0222B4 11:A2A4: C7 BB     .word sub_BBC7_очистка
bra_case_A2A6_00_гол_забит_другим_ударом:
- D - I - 0x0222B6 11:A2A6: FB        .byte con_rts

bra_long_case_A2A7_00_за_sao_paulo:
- D - I - 0x0222B7 11:A2A7: A0        .byte con_pause + $A0
- D - I - 0x0222B8 11:A2A8: 08        .byte con_bg + $08
- D - I - 0x0222B9 11:A2A9: 46        .byte con_animation + $46
- D - I - 0x0222BA 11:A2AA: 52        .byte con_cloud + $52
- D - I - 0x0222BB 11:A2AB: F2        .byte con_jmp
- D - I - 0x0222BC 11:A2AC: 75 A2     .word loc_A275

bra_long_case_A2AE_01_за_nankatsu:
- D - I - 0x0222BE 11:A2AE: A0        .byte con_pause + $A0
- D - I - 0x0222BF 11:A2AF: 09        .byte con_bg + $09
- D - I - 0x0222C0 11:A2B0: 47        .byte con_animation + $47
- D - I - 0x0222C1 11:A2B1: 52        .byte con_cloud + $52
- D - I - 0x0222C2 11:A2B2: F2        .byte con_jmp
- D - I - 0x0222C3 11:A2B3: 75 A2     .word loc_A275

bra_long_case_A2B5_00_сетка_не_порвана:
- D - I - 0x0222C5 11:A2B5: 82        .byte con_pause + $82
- D - I - 0x0222C6 11:A2B6: F0        .byte con_bg + con_skip
- D - I - 0x0222C7 11:A2B7: F0        .byte con_animation + con_skip
- D - I - 0x0222C8 11:A2B8: 51        .byte con_cloud + $51
- D - I - 0x0222C9 11:A2B9: F2        .byte con_jmp
- D - I - 0x0222CA 11:A2BA: 75 A2     .word loc_A275

bra_long_case_A2BC_01_сетка_порвана:
- D - I - 0x0222CC 11:A2BC: 82        .byte con_pause + $82
- D - I - 0x0222CD 11:A2BD: F0        .byte con_bg + con_skip
- D - I - 0x0222CE 11:A2BE: F0        .byte con_animation + con_skip
- D - I - 0x0222CF 11:A2BF: 53        .byte con_cloud + $53
- D - I - 0x0222D0 11:A2C0: F2        .byte con_jmp
- D - I - 0x0222D1 11:A2C1: 75 A2     .word loc_A275

bra_long_case_A2C3_00_за_sao_paulo:
- - - - - 0x0222D3 11:A2C3: A0        .byte con_pause + $A0
- - - - - 0x0222D4 11:A2C4: 08        .byte con_bg + $08
- - - - - 0x0222D5 11:A2C5: 46        .byte con_animation + $46
- - - - - 0x0222D6 11:A2C6: 54        .byte con_cloud + $54
- - - - - 0x0222D7 11:A2C7: F2        .byte con_jmp
- - - - - 0x0222D8 11:A2C8: 75 A2     .word loc_A275

bra_long_case_A2CA_01_за_nankatsu:
- - - - - 0x0222DA 11:A2CA: A0        .byte con_pause + $A0
- - - - - 0x0222DB 11:A2CB: 09        .byte con_bg + $09
- - - - - 0x0222DC 11:A2CC: 47        .byte con_animation + $47
- - - - - 0x0222DD 11:A2CD: 55        .byte con_cloud + $55
- - - - - 0x0222DE 11:A2CE: F2        .byte con_jmp
- - - - - 0x0222DF 11:A2CF: 75 A2     .word loc_A275

bra_long_case_A2D1_02_за_japan:
- D - I - 0x0222E1 11:A2D1: A0        .byte con_pause + $A0
- D - I - 0x0222E2 11:A2D2: 0A        .byte con_bg + $0A
- D - I - 0x0222E3 11:A2D3: 48        .byte con_animation + $48
- D - I - 0x0222E4 11:A2D4: 55        .byte con_cloud + $55
- D - I - 0x0222E5 11:A2D5: F2        .byte con_jmp
- D - I - 0x0222E6 11:A2D6: 75 A2     .word loc_A275

sub_A2D8:
- D - I - 0x0222E8 11:A2D8: 28        .byte con_pause + $28
- D - I - 0x0222E9 11:A2D9: 56        .byte con_bg + $56
- D - I - 0x0222EA 11:A2DA: 49        .byte con_animation + $49
- D - I - 0x0222EB 11:A2DB: 1B        .byte con_cloud + $1B
- D - I - 0x0222EC 11:A2DC: FB        .byte con_rts

sub_A2DD:
- D - I - 0x0222ED 11:A2DD: F7        .byte con_F7, $0F
- D - I - 0x0222EF 11:A2DF: F9        .byte con_soundID_delay, $2E, $02
loc_A2E2:
- D - I - 0x0222F2 11:A2E2: 21        .byte con_pause + $21
- D - I - 0x0222F3 11:A2E3: 05        .byte con_bg + $05
- D - I - 0x0222F4 11:A2E4: 00        .byte con_animation + $00
- D - I - 0x0222F5 11:A2E5: F0        .byte con_cloud + con_skip
- D - I - 0x0222F6 11:A2E6: FB        .byte con_rts

sub_A2E7:
- D - I - 0x0222F7 11:A2E7: F7        .byte con_F7, $0E
- D - I - 0x0222F9 11:A2E9: F9        .byte con_soundID_delay, $2E, $02
- D - I - 0x0222FC 11:A2EC: F2        .byte con_jmp
- D - I - 0x0222FD 11:A2ED: E2 A2     .word loc_A2E2

sub_A2EF:
- D - I - 0x0222FF 11:A2EF: F7        .byte con_F7, $10
- D - I - 0x022301 11:A2F1: F2        .byte con_jmp
- D - I - 0x022302 11:A2F2: E2 A2     .word loc_A2E2

sub_A2F4_сообщение_oops_на_мигающем_белом_фоне:
- D - I - 0x022304 11:A2F4: F7        .byte con_F7, $10
- D - I - 0x022306 11:A2F6: F9        .byte con_soundID_delay, $65, $02
- D - I - 0x022309 11:A2F9: 1E        .byte con_pause + $1E
- D - I - 0x02230A 11:A2FA: 05        .byte con_bg + $05
- D - I - 0x02230B 11:A2FB: 00        .byte con_animation + $00
- D - I - 0x02230C 11:A2FC: 29        .byte con_cloud + $29
- D - I - 0x02230D 11:A2FD: FB        .byte con_rts

sub_A2FE_сообщение_oh_на_мигающем_белом_фоне:
- D - I - 0x02230E 11:A2FE: F7        .byte con_F7, $10
- D - I - 0x022310 11:A300: F9        .byte con_soundID_delay, $2E, $02
- D - I - 0x022313 11:A303: 20        .byte con_pause + $20
- D - I - 0x022314 11:A304: 05        .byte con_bg + $05
- D - I - 0x022315 11:A305: 00        .byte con_animation + $00
- D - I - 0x022316 11:A306: 2C        .byte con_cloud + $2C
- D - I - 0x022317 11:A307: FB        .byte con_rts

sub_A308:
- D - I - 0x022318 11:A308: F9        .byte con_soundID_delay, $2E, $02
- D - I - 0x02231B 11:A30B: F7        .byte con_F7, $10
- D - I - 0x02231D 11:A30D: 14        .byte con_pause + $14
- D - I - 0x02231E 11:A30E: 05        .byte con_bg + $05
- D - I - 0x02231F 11:A30F: 00        .byte con_animation + $00
- D - I - 0x022320 11:A310: F0        .byte con_cloud + con_skip
- D - I - 0x022321 11:A311: FB        .byte con_rts

sub_A312:
- D - I - 0x022322 11:A312: 14        .byte con_pause + $14
- D - I - 0x022323 11:A313: F0        .byte con_bg + con_skip
- D - I - 0x022324 11:A314: F0        .byte con_animation + con_skip
- D - I - 0x022325 11:A315: F0        .byte con_cloud + con_skip
- D - I - 0x022326 11:A316: FE        .byte con_FE
- D - I - 0x022328 11:A318: FB        .byte con_rts

loc_A319_стенка_заблокировала_удар:
- D - I - 0x022329 11:A319: F9        .byte con_soundID_delay, $2A, $02
- D - I - 0x02232C 11:A31C: 32        .byte con_pause + $32
- D - I - 0x02232D 11:A31D: 01        .byte con_bg + $01
- D - I - 0x02232E 11:A31E: 4A        .byte con_animation + $4A
- D - I - 0x02232F 11:A31F: 2E        .byte con_cloud + $2E
- D - I - 0x022330 11:A320: FB        .byte con_rts

sub_A321_стенка_была_задета:
- - - - - 0x022331 11:A321: F8        .byte con_F8, $02
- - - - - 0x022333 11:A323: F9        .byte con_soundID_delay, $2A, $02
- - - - - 0x022336 11:A326: 14        .byte con_pause + $14
- - - - - 0x022337 11:A327: 01        .byte con_bg + $01
- - - - - 0x022338 11:A328: 4A        .byte con_animation + $4A
- - - - - 0x022339 11:A329: 35        .byte con_cloud + $35
- - - - - 0x02233A 11:A32A: FE        .byte con_FE
- - - - - 0x02233C 11:A32C: FB        .byte con_rts

sub_A32D:
- D - I - 0x02233D 11:A32D: F9        .byte con_soundID_delay, $03, $02
- D - I - 0x022340 11:A330: 35        .byte con_pause + $35
- D - I - 0x022341 11:A331: 1F        .byte con_bg + $1F
- D - I - 0x022342 11:A332: 11        .byte con_animation + $11
- D - I - 0x022343 11:A333: 00        .byte con_cloud + con_clear
- D - I - 0x022344 11:A334: FB        .byte con_rts

sub_A335_полет_нижнего_мяча:
- D - I - 0x022345 11:A335: 32        .byte con_pause + $32
- D - I - 0x022346 11:A336: 02        .byte con_bg + $02
- D - I - 0x022347 11:A337: 4C        .byte con_animation + $4C
- D - I - 0x022348 11:A338: 00        .byte con_cloud + con_clear
- D - I - 0x022349 11:A339: FB        .byte con_rts

bra_long_case_A33A_01:
- D - I - 0x02234A 11:A33A: F5        .byte con_mirror_off
- D - I - 0x02234B 11:A33B: F3        .byte con_branch, $A3     ; за какую команду играешь
- - - - - 0x02234D 11:A33D: 0A        .byte bra_case_A347_00_за_sao_paulo - *
- - - - - 0x02234E 11:A33E: 02        .byte bra_case_A340_01_за_nankatsu - *
- D - I - 0x02234F 11:A33F: 08        .byte bra_case_A347_02_за_japan - *

bra_case_A340_01_за_nankatsu:
; антикрит вакашимазу
- - - - - 0x022350 11:A340: 32        .byte con_pause + $32
- - - - - 0x022351 11:A341: 73        .byte con_bg + $73
- - - - - 0x022352 11:A342: A6        .byte con_animation + $A6
- - - - - 0x022353 11:A343: 9F        .byte con_cloud + $9F
- - - - - 0x022354 11:A344: F2        .byte con_jmp
- - - - - 0x022355 11:A345: 4B A3     .word loc_A34B

bra_case_A347_00_за_sao_paulo:
bra_case_A347_02_за_japan:
; антикрит вакашимазу
- D - I - 0x022357 11:A347: 32        .byte con_pause + $32
- D - I - 0x022358 11:A348: 33        .byte con_bg + $33
- D - I - 0x022359 11:A349: A6        .byte con_animation + $A6
- D - I - 0x02235A 11:A34A: 9F        .byte con_cloud + $9F
loc_A34B:
- D - I - 0x02235B 11:A34B: FD        .byte con_mirror_condition, $03       ; куда летит мяч
sub_A34D_отскок_вакашимазу_от_штанги:
bra_long_case_A34D_00:
; вакашимазу отталкивается от штанги
- D - I - 0x02235D 11:A34D: 08        .byte con_pause + $08
- D - I - 0x02235E 11:A34E: 0B        .byte con_bg + $0B
- D - I - 0x02235F 11:A34F: 00        .byte con_animation + $00
- D - I - 0x022360 11:A350: 2F        .byte con_cloud + $2F
- D - I - 0x022361 11:A351: F7        .byte con_F7, $05
- D - I - 0x022363 11:A353: F9        .byte con_soundID_delay, $68, $21
- D - I - 0x022366 11:A356: 2D        .byte con_pause + $2D
- D - I - 0x022367 11:A357: F0        .byte con_bg + con_skip
- D - I - 0x022368 11:A358: 4D        .byte con_animation + $4D
- D - I - 0x022369 11:A359: F0        .byte con_cloud + con_skip
- D - I - 0x02236A 11:A35A: FB        .byte con_rts

loc_A35B_нарушение:
- D - I - 0x02236B 11:A35B: F5        .byte con_mirror_off
- D - I - 0x02236C 11:A35C: F9        .byte con_soundID_delay, $67, $02
- D - I - 0x02236F 11:A35F: 70        .byte con_pause + $70
- D - I - 0x022370 11:A360: 0C        .byte con_bg + $0C
- D - I - 0x022371 11:A361: 4E        .byte con_animation + $4E
- D - I - 0x022372 11:A362: 30        .byte con_cloud + $30
- D - I - 0x022373 11:A363: FB        .byte con_rts

loc_A364_рваный_мяч:
- D - I - 0x022374 11:A364: F5        .byte con_mirror_off
- D - I - 0x022375 11:A365: A4        .byte con_pause + $A4
- D - I - 0x022376 11:A366: 0D        .byte con_bg + $0D
- D - I - 0x022377 11:A367: 4F        .byte con_animation + $4F
- D - I - 0x022378 11:A368: 32        .byte con_cloud + $32
- D - I - 0x022379 11:A369: FB        .byte con_rts

loc_A36A_кипер_идеально_засейвил:
sub_A36A_кипер_идеально_засейвил:
- D - I - 0x02237A 11:A36A: FD        .byte con_mirror_condition, $04
- D - I - 0x02237C 11:A36C: 3C        .byte con_pause + $3C
- D - I - 0x02237D 11:A36D: 20        .byte con_bg + $20
- D - I - 0x02237E 11:A36E: 52        .byte con_animation + $52
- D - I - 0x02237F 11:A36F: 33        .byte con_cloud + $33
- D - I - 0x022380 11:A370: FB        .byte con_rts

loc_A371_мяч_улетает_в_сторону:
sub_A371_мяч_улетает_в_сторону:
- D - I - 0x022381 11:A371: FD        .byte con_mirror_condition, $04
sub_A373_мяч_улетает_в_сторону:
- D - I - 0x022383 11:A373: 3C        .byte con_pause + $3C
- D - I - 0x022384 11:A374: 1F        .byte con_bg + $1F
- D - I - 0x022385 11:A375: 52        .byte con_animation + $52
- D - I - 0x022386 11:A376: 34        .byte con_cloud + $34
- D - I - 0x022387 11:A377: FB        .byte con_rts

loc_A37E:
- - - - - 0x02238E 11:A37E: 30        .byte con_pause + $30
- - - - - 0x02238F 11:A37F: 1D        .byte con_bg + $1D
- - - - - 0x022390 11:A380: 54        .byte con_animation + $54
- - - - - 0x022391 11:A381: F0        .byte con_cloud + con_skip
- - - - - 0x022392 11:A382: FB        .byte con_rts

loc_A383_удар_огибает_стеночку:
- D - I - 0x022393 11:A383: 40        .byte con_pause + $40
- D - I - 0x022394 11:A384: 2A        .byte con_bg + $2A
- D - I - 0x022395 11:A385: 55        .byte con_animation + $55
- D - I - 0x022396 11:A386: 36        .byte con_cloud + $36
- D - I - 0x022397 11:A387: FB        .byte con_rts

loc_A388:
- D - I - 0x022398 11:A388: FD        .byte con_mirror_condition, $04
- D - I - 0x02239A 11:A38A: 34        .byte con_pause + $34
- D - I - 0x02239B 11:A38B: 20        .byte con_bg + $20
- D - I - 0x02239C 11:A38C: 70        .byte con_animation + $70
- D - I - 0x02239D 11:A38D: 34        .byte con_cloud + $34
- D - I - 0x02239E 11:A38E: FB        .byte con_rts

sub_A38F:
- D - I - 0x02239F 11:A38F: 28        .byte con_pause + $28
- D - I - 0x0223A0 11:A390: 28        .byte con_bg + $28
- D - I - 0x0223A1 11:A391: 56        .byte con_animation + $56
- D - I - 0x0223A2 11:A392: F0        .byte con_cloud + con_skip
- D - I - 0x0223A3 11:A393: FB        .byte con_rts

bra_long_case_A3B3_00:
- D - I - 0x0223C3 11:A3B3: F8        .byte con_F8, $03
- D - I - 0x0223C5 11:A3B5: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0223C8 11:A3B8: 32        .byte con_pause + $32
- D - I - 0x0223C9 11:A3B9: 1D        .byte con_bg + $1D
- D - I - 0x0223CA 11:A3BA: 20        .byte con_animation + $20
- D - I - 0x0223CB 11:A3BB: 3C        .byte con_cloud + $3C
- D - I - 0x0223CC 11:A3BC: FB        .byte con_rts

bra_long_case_A3BD_00:
- D - I - 0x0223CD 11:A3BD: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0223D0 11:A3C0: 32        .byte con_pause + $32
- D - I - 0x0223D1 11:A3C1: 1E        .byte con_bg + $1E
- D - I - 0x0223D2 11:A3C2: 1C        .byte con_animation + $1C
- D - I - 0x0223D3 11:A3C3: 3D        .byte con_cloud + $3D
- D - I - 0x0223D4 11:A3C4: FB        .byte con_rts

bra_long_case_A3C5_00:
- D - I - 0x0223D5 11:A3C5: F8        .byte con_F8, $01
- D - I - 0x0223D7 11:A3C7: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0223DA 11:A3CA: 32        .byte con_pause + $32
- D - I - 0x0223DB 11:A3CB: 1E        .byte con_bg + $1E
- D - I - 0x0223DC 11:A3CC: 20        .byte con_animation + $20
- D - I - 0x0223DD 11:A3CD: 3E        .byte con_cloud + $3E
- D - I - 0x0223DE 11:A3CE: FB        .byte con_rts

sub_A3CF_kurae_если_не_спешал:
- D - I - 0x0223DF 11:A3CF: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x0223E1 11:A3D1: 67        .byte bra_case_A438_00_игрок_без_защитного_спешала - *
- D - I - 0x0223E2 11:A3D2: 0F        .byte bra_case_A3E1_01_masao_kazuo - *
- D - I - 0x0223E3 11:A3D3: 17        .byte bra_case_A3EA_02_masao_kazuo - *
- D - I - 0x0223E4 11:A3D4: 83        .byte bra_case_A457_03_souda - *
- D - I - 0x0223E5 11:A3D5: 79        .byte bra_case_A44E_04_souda - *
- D - I - 0x0223E6 11:A3D6: 1A        .byte bra_case_A3F0_05_jitou - *
- D - I - 0x0223E7 11:A3D7: 35        .byte bra_case_A40C_06_jitou - *
- D - I - 0x0223E8 11:A3D8: 21        .byte bra_case_A3F9_07_dirceu - *
- - - - - 0x0223E9 11:A3D9: 20        .byte bra_case_A3F9_08_dirceu - *
- - - - - 0x0223EA 11:A3DA: 1F        .byte bra_case_A3F9_09_robson - *
- D - I - 0x0223EB 11:A3DB: 1E        .byte bra_case_A3F9_0A_libuta - *
- - - - - 0x0223EC 11:A3DC: 1D        .byte bra_case_A3F9_0B_galvan - *
- D - I - 0x0223ED 11:A3DD: 3B        .byte bra_case_A418_0C_hyuga - *
- D - I - 0x0223EE 11:A3DE: 51        .byte bra_case_A42F_0D_hyuga - *
- - - - - 0x0223EF 11:A3DF: 59        .byte bra_case_A438_0E_ishizaki - *
- - - - - 0x0223F0 11:A3E0: 58        .byte bra_case_A438_0F_ishizaki - *

bra_case_A3E1_01_masao_kazuo:
- D - I - 0x0223F1 11:A3E1: FA        .byte con_jsr
- D - I - 0x0223F2 11:A3E2: 1A A7     .word sub_A71A
loc_A3E4:
- D - I - 0x0223F4 11:A3E4: FA        .byte con_jsr
- D - I - 0x0223F5 11:A3E5: F9 A6     .word sub_A6F9
- D - I - 0x0223F7 11:A3E7: F2        .byte con_jmp
- D - I - 0x0223F8 11:A3E8: 60 A4     .word loc_A460

bra_case_A3EA_02_masao_kazuo:
- D - I - 0x0223FA 11:A3EA: FA        .byte con_jsr
- D - I - 0x0223FB 11:A3EB: 56 A7     .word sub_A756
- D - I - 0x0223FD 11:A3ED: F2        .byte con_jmp
- D - I - 0x0223FE 11:A3EE: E4 A3     .word loc_A3E4

bra_case_A3F0_05_jitou:
- D - I - 0x022400 11:A3F0: F7        .byte con_F7, $44
- D - I - 0x022402 11:A3F2: 78        .byte con_pause + $78
- D - I - 0x022403 11:A3F3: 30        .byte con_bg + $30
- D - I - 0x022404 11:A3F4: A0        .byte con_animation + $A0
- D - I - 0x022405 11:A3F5: D9        .byte con_cloud + $D9
- D - I - 0x022406 11:A3F6: FA        .byte con_jsr
- D - I - 0x022407 11:A3F7: C7 BB     .word sub_BBC7_очистка
loc_A3F9:
bra_case_A3F9_07_dirceu:
bra_case_A3F9_08_dirceu:
bra_case_A3F9_09_robson:
bra_case_A3F9_0A_libuta:
bra_case_A3F9_0B_galvan:
- D - I - 0x022409 11:A3F9: FC        .byte con_moving_bg, $02
- D - I - 0x02240B 11:A3FB: F9        .byte con_soundID_delay, $27, $02
- D - I - 0x02240E 11:A3FE: 14        .byte con_pause + $14
- D - I - 0x02240F 11:A3FF: 59        .byte con_bg + $59
- D - I - 0x022410 11:A400: 58        .byte con_animation + $58
- D - I - 0x022411 11:A401: EC        .byte con_cloud + $EC
- D - I - 0x022412 11:A402: FA        .byte con_jsr
- D - I - 0x022413 11:A403: 6A A4     .word sub_A46A
- D - I - 0x022415 11:A405: FC        .byte con_moving_bg, $02
- D - I - 0x022417 11:A407: 0A        .byte con_pause + $0A
- D - I - 0x022418 11:A408: 57        .byte con_bg + $57
- D - I - 0x022419 11:A409: F0        .byte con_animation + con_skip
- D - I - 0x02241A 11:A40A: F0        .byte con_cloud + con_skip
- D - I - 0x02241B 11:A40B: FB        .byte con_rts

bra_case_A40C_06_jitou:
- D - I - 0x02241C 11:A40C: F7        .byte con_F7, $44
- D - I - 0x02241E 11:A40E: 78        .byte con_pause + $78
- D - I - 0x02241F 11:A40F: 30        .byte con_bg + $30
- D - I - 0x022420 11:A410: AA        .byte con_animation + $AA
- D - I - 0x022421 11:A411: D9        .byte con_cloud + $D9
- D - I - 0x022422 11:A412: FA        .byte con_jsr
- D - I - 0x022423 11:A413: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022425 11:A415: F2        .byte con_jmp
- D - I - 0x022426 11:A416: F9 A3     .word loc_A3F9

bra_case_A418_0C_hyuga:
- D - I - 0x022428 11:A418: F7        .byte con_F7, $44
- D - I - 0x02242A 11:A41A: 78        .byte con_pause + $78
- D - I - 0x02242B 11:A41B: 31        .byte con_bg + $31
- D - I - 0x02242C 11:A41C: 9E        .byte con_animation + $9E
- D - I - 0x02242D 11:A41D: DB        .byte con_cloud + $DB
loc_A41E:
- D - I - 0x02242E 11:A41E: FC        .byte con_moving_bg, $04
- D - I - 0x022430 11:A420: F9        .byte con_soundID_delay, $27, $02
- D - I - 0x022433 11:A423: 14        .byte con_pause + $14
- D - I - 0x022434 11:A424: 59        .byte con_bg + $59
- D - I - 0x022435 11:A425: 58        .byte con_animation + $58
- D - I - 0x022436 11:A426: 00        .byte con_cloud + con_clear
- D - I - 0x022437 11:A427: F8        .byte con_F8, $02
- D - I - 0x022439 11:A429: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x02243C 11:A42C: F2        .byte con_jmp
- D - I - 0x02243D 11:A42D: 63 A4     .word loc_A463

bra_case_A42F_0D_hyuga:
- D - I - 0x02243F 11:A42F: F7        .byte con_F7, $44
- D - I - 0x022441 11:A431: 78        .byte con_pause + $78
- D - I - 0x022442 11:A432: 31        .byte con_bg + $31
- D - I - 0x022443 11:A433: B0        .byte con_animation + $B0
- D - I - 0x022444 11:A434: DB        .byte con_cloud + $DB
- D - I - 0x022445 11:A435: F2        .byte con_jmp
- D - I - 0x022446 11:A436: 1E A4     .word loc_A41E

bra_case_A438_00_игрок_без_защитного_спешала:
bra_case_A438_0E_ishizaki:
bra_case_A438_0F_ishizaki:
- D - I - 0x022448 11:A438: F7        .byte con_F7, $02
- D - I - 0x02244A 11:A43A: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x02244D 11:A43D: 20        .byte con_pause + $20
- D - I - 0x02244E 11:A43E: 23        .byte con_bg + $23
- D - I - 0x02244F 11:A43F: 58        .byte con_animation + $58
- D - I - 0x022450 11:A440: 00        .byte con_cloud + con_clear
- D - I - 0x022451 11:A441: FA        .byte con_jsr
- D - I - 0x022452 11:A442: A9 A5     .word sub_A5A9_kurae
- D - I - 0x022454 11:A444: FC        .byte con_moving_bg, $03
- D - I - 0x022456 11:A446: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022459 11:A449: 50        .byte con_pause + $50
- D - I - 0x02245A 11:A44A: 57        .byte con_bg + $57
- D - I - 0x02245B 11:A44B: 50        .byte con_animation + $50
- D - I - 0x02245C 11:A44C: 3F        .byte con_cloud + $3F
- D - I - 0x02245D 11:A44D: FB        .byte con_rts

bra_case_A44E_04_souda:
- D - I - 0x02245E 11:A44E: F7        .byte con_F7, $44
- D - I - 0x022460 11:A450: 78        .byte con_pause + $78
- D - I - 0x022461 11:A451: 30        .byte con_bg + $30
- D - I - 0x022462 11:A452: AD        .byte con_animation + $AD
- D - I - 0x022463 11:A453: DA        .byte con_cloud + $DA
- D - I - 0x022464 11:A454: F2        .byte con_jmp
- D - I - 0x022465 11:A455: 5D A4     .word loc_A45D

bra_case_A457_03_souda:
- D - I - 0x022467 11:A457: F7        .byte con_F7, $44
- D - I - 0x022469 11:A459: 78        .byte con_pause + $78
- D - I - 0x02246A 11:A45A: 30        .byte con_bg + $30
- D - I - 0x02246B 11:A45B: 9F        .byte con_animation + $9F
- D - I - 0x02246C 11:A45C: DA        .byte con_cloud + $DA
loc_A45D:
sub_A45D:
- D - I - 0x02246D 11:A45D: FA        .byte con_jsr
- D - I - 0x02246E 11:A45E: 78 AF     .word sub_AF78
loc_A460:
- D - I - 0x022470 11:A460: F9        .byte con_soundID_delay, $28, $02
loc_A463:
- D - I - 0x022473 11:A463: FC        .byte con_moving_bg, $04
- D - I - 0x022475 11:A465: 50        .byte con_pause + $50
- D - I - 0x022476 11:A466: 57        .byte con_bg + $57
- D - I - 0x022477 11:A467: 50        .byte con_animation + $50
- D - I - 0x022478 11:A468: EC        .byte con_cloud + $EC
- D - I - 0x022479 11:A469: FB        .byte con_rts

sub_A46A:
- D - I - 0x02247A 11:A46A: FA        .byte con_jsr
- D - I - 0x02247B 11:A46B: 70 A4     .word sub_A470
- D - I - 0x02247D 11:A46D: FA        .byte con_jsr
- D - I - 0x02247E 11:A46E: 70 A4     .word sub_A470
sub_A470:
- D - I - 0x022480 11:A470: FC        .byte con_moving_bg, $02
- D - I - 0x022482 11:A472: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x022485 11:A475: 0A        .byte con_pause + $0A
- D - I - 0x022486 11:A476: 57        .byte con_bg + $57
- D - I - 0x022487 11:A477: 50        .byte con_animation + $50
- D - I - 0x022488 11:A478: F0        .byte con_cloud + con_skip
- D - I - 0x022489 11:A479: FC        .byte con_moving_bg, $02
- D - I - 0x02248B 11:A47B: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x02248E 11:A47E: 0A        .byte con_pause + $0A
- D - I - 0x02248F 11:A47F: 59        .byte con_bg + $59
- D - I - 0x022490 11:A480: F0        .byte con_animation + con_skip
- D - I - 0x022491 11:A481: F0        .byte con_cloud + con_skip
- D - I - 0x022492 11:A482: FC        .byte con_moving_bg, $02
- D - I - 0x022494 11:A484: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x022497 11:A487: 0A        .byte con_pause + $0A
- D - I - 0x022498 11:A488: 58        .byte con_bg + $58
- D - I - 0x022499 11:A489: F0        .byte con_animation + con_skip
- D - I - 0x02249A 11:A48A: F0        .byte con_cloud + con_skip
- D - I - 0x02249B 11:A48B: FC        .byte con_moving_bg, $02
- D - I - 0x02249D 11:A48D: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x0224A0 11:A490: 0A        .byte con_pause + $0A
- D - I - 0x0224A1 11:A491: 59        .byte con_bg + $59
- D - I - 0x0224A2 11:A492: F0        .byte con_animation + con_skip
- D - I - 0x0224A3 11:A493: 00        .byte con_cloud + con_clear
- D - I - 0x0224A4 11:A494: FB        .byte con_rts

sub_A495_сообщение_игрока_при_ответе_на_нападение:
- D - I - 0x0224A5 11:A495: F6        .byte con_mirror_toggle
- D - I - 0x0224A6 11:A496: F3        .byte con_branch, $A8
- D - I - 0x0224A8 11:A498: 22        .byte bra_case_A4BA_00_игрок_без_рожи - *
- D - I - 0x0224A9 11:A499: 22        .byte bra_case_A4BB_01_tsubasa - *
- D - I - 0x0224AA 11:A49A: 28        .byte bra_case_A4C2_02_misaki - *
- - - - - 0x0224AB 11:A49B: 2E        .byte bra_case_A4C9_03_misaki - *
- D - I - 0x0224AC 11:A49C: 34        .byte bra_case_A4D0_04_hyuga - *
- D - I - 0x0224AD 11:A49D: 3A        .byte bra_case_A4D7_05_hyuga - *
- - - - - 0x0224AE 11:A49E: 40        .byte bra_case_A4DE_06_misugi - *
- - - - - 0x0224AF 11:A49F: 4D        .byte bra_case_A4EC_07_misugi - *
- - - - - 0x0224B0 11:A4A0: 53        .byte bra_case_A4F3_08_matsuyama - *
- D - I - 0x0224B1 11:A4A1: 59        .byte bra_case_A4FA_09_matsuyama - *
- - - - - 0x0224B2 11:A4A2: 5F        .byte bra_case_A501_0A_ishizaki - *
- - - - - 0x0224B3 11:A4A3: 65        .byte bra_case_A508_0B_ishizaki - *
- D - I - 0x0224B4 11:A4A4: 6B        .byte bra_case_A50F_0C_souda - *
- - - - - 0x0224B5 11:A4A5: 71        .byte bra_case_A516_0D_souda - *
- - - - - 0x0224B6 11:A4A6: 77        .byte bra_case_A51D_0E_jitou - *
- D - I - 0x0224B7 11:A4A7: 7D        .byte bra_case_A524_0F_jitou - *
- D - I - 0x0224B8 11:A4A8: 83        .byte bra_case_A52B_10_masao_kazuo - *
- D - I - 0x0224B9 11:A4A9: 89        .byte bra_case_A532_11_masao_kazuo - *
- D - I - 0x0224BA 11:A4AA: 8F        .byte bra_case_A539_12_nitta - *
- - - - - 0x0224BB 11:A4AB: 95        .byte bra_case_A540_13_nitta - *
- - - - - 0x0224BC 11:A4AC: 9B        .byte bra_case_A547_14_sawada - *
- - - - - 0x0224BD 11:A4AD: A1        .byte bra_case_A54E_15_sawada - *
- D - I - 0x0224BE 11:A4AE: A7        .byte bra_case_A555_16_coimbra - *
- D - I - 0x0224BF 11:A4AF: AD        .byte bra_case_A55C_17_carlos - *
- D - I - 0x0224C0 11:A4B0: B3        .byte bra_case_A563_18_carlos - *
- D - I - 0x0224C1 11:A4B1: B9        .byte bra_case_A56A_19_schneider - *
- - - - - 0x0224C2 11:A4B2: BF        .byte bra_case_A571_1A_kaltz - *
- - - - - 0x0224C3 11:A4B3: C5        .byte bra_case_A578_1B_schester - *
- D - I - 0x0224C4 11:A4B4: CB        .byte bra_case_A57F_1C_diaz - *
- D - I - 0x0224C5 11:A4B5: D1        .byte bra_case_A586_1D_pascal - *
- D - I - 0x0224C6 11:A4B6: D7        .byte bra_case_A58D_1E_pierre - *
- D - I - 0x0224C7 11:A4B7: DD        .byte bra_case_A594_1F_napoleon - *
- D - I - 0x0224C8 11:A4B8: E3        .byte bra_case_A59B_20_victorino - *
- - - - - 0x0224C9 11:A4B9: E9        .byte bra_case_A5A2_21_kaltz - *

bra_case_A4BA_00_игрок_без_рожи:
- D - I - 0x0224CA 11:A4BA: FB        .byte con_rts

bra_case_A4BB_01_tsubasa:
- D - I - 0x0224CB 11:A4BB: 3C        .byte con_pause + $3C
- D - I - 0x0224CC 11:A4BC: 30        .byte con_bg + $30
- D - I - 0x0224CD 11:A4BD: 91        .byte con_animation + $91
- D - I - 0x0224CE 11:A4BE: 97        .byte con_cloud + $97
- D - I - 0x0224CF 11:A4BF: F2        .byte con_jmp
- D - I - 0x0224D0 11:A4C0: C7 BB     .word loc_BBC7_очистка

bra_case_A4C2_02_misaki:
- D - I - 0x0224D2 11:A4C2: 3C        .byte con_pause + $3C
- D - I - 0x0224D3 11:A4C3: 30        .byte con_bg + $30
- D - I - 0x0224D4 11:A4C4: 96        .byte con_animation + $96
- D - I - 0x0224D5 11:A4C5: 97        .byte con_cloud + $97
- D - I - 0x0224D6 11:A4C6: F2        .byte con_jmp
- D - I - 0x0224D7 11:A4C7: C7 BB     .word loc_BBC7_очистка

bra_case_A4C9_03_misaki:
- - - - - 0x0224D9 11:A4C9: 3C        .byte con_pause + $3C
- - - - - 0x0224DA 11:A4CA: 30        .byte con_bg + $30
- - - - - 0x0224DB 11:A4CB: 97        .byte con_animation + $97
- - - - - 0x0224DC 11:A4CC: 97        .byte con_cloud + $97
- - - - - 0x0224DD 11:A4CD: F2        .byte con_jmp
- - - - - 0x0224DE 11:A4CE: C7 BB     .word loc_BBC7_очистка

bra_case_A4D0_04_hyuga:
- D - I - 0x0224E0 11:A4D0: 3C        .byte con_pause + $3C
- D - I - 0x0224E1 11:A4D1: 31        .byte con_bg + $31
- D - I - 0x0224E2 11:A4D2: 9E        .byte con_animation + $9E
- D - I - 0x0224E3 11:A4D3: 97        .byte con_cloud + $97
- D - I - 0x0224E4 11:A4D4: F2        .byte con_jmp
- D - I - 0x0224E5 11:A4D5: C7 BB     .word loc_BBC7_очистка

bra_case_A4D7_05_hyuga:
- D - I - 0x0224E7 11:A4D7: 3C        .byte con_pause + $3C
- D - I - 0x0224E8 11:A4D8: 31        .byte con_bg + $31
- D - I - 0x0224E9 11:A4D9: B0        .byte con_animation + $B0
- D - I - 0x0224EA 11:A4DA: 97        .byte con_cloud + $97
- D - I - 0x0224EB 11:A4DB: F2        .byte con_jmp
- D - I - 0x0224EC 11:A4DC: C7 BB     .word loc_BBC7_очистка

bra_case_A4DE_06_misugi:
- - - - - 0x0224EE 11:A4DE: F3        .byte con_branch, $AB     ; проверка на 100 хп
- - - - - 0x0224F0 11:A4E0: 02        .byte bra_case_A4E2_00_есть_100_хп - *
- - - - - 0x0224F1 11:A4E1: 08        .byte bra_case_A4E9_01_меньше_100_хп - *

bra_case_A4E2_00_есть_100_хп:
- - - - - 0x0224F2 11:A4E2: 3C        .byte con_pause + $3C
- - - - - 0x0224F3 11:A4E3: 30        .byte con_bg + $30
- - - - - 0x0224F4 11:A4E4: A3        .byte con_animation + $A3
- - - - - 0x0224F5 11:A4E5: 97        .byte con_cloud + $97
- - - - - 0x0224F6 11:A4E6: F2        .byte con_jmp
- - - - - 0x0224F7 11:A4E7: C7 BB     .word loc_BBC7_очистка

bra_case_A4E9_01_меньше_100_хп:
- - - - - 0x0224F9 11:A4E9: F2        .byte con_jmp
- - - - - 0x0224FA 11:A4EA: 89 A9     .word loc_A989_меньше_100_хп

bra_case_A4EC_07_misugi:
- - - - - 0x0224FC 11:A4EC: 3C        .byte con_pause + $3C
- - - - - 0x0224FD 11:A4ED: 30        .byte con_bg + $30
- - - - - 0x0224FE 11:A4EE: AE        .byte con_animation + $AE
- - - - - 0x0224FF 11:A4EF: 97        .byte con_cloud + $97
- - - - - 0x022500 11:A4F0: F2        .byte con_jmp
- - - - - 0x022501 11:A4F1: C7 BB     .word loc_BBC7_очистка

bra_case_A4F3_08_matsuyama:
- - - - - 0x022503 11:A4F3: 3C        .byte con_pause + $3C
- - - - - 0x022504 11:A4F4: 30        .byte con_bg + $30
- - - - - 0x022505 11:A4F5: A1        .byte con_animation + $A1
- - - - - 0x022506 11:A4F6: 97        .byte con_cloud + $97
- - - - - 0x022507 11:A4F7: F2        .byte con_jmp
- - - - - 0x022508 11:A4F8: C7 BB     .word loc_BBC7_очистка

bra_case_A4FA_09_matsuyama:
- D - I - 0x02250A 11:A4FA: 3C        .byte con_pause + $3C
- D - I - 0x02250B 11:A4FB: 30        .byte con_bg + $30
- D - I - 0x02250C 11:A4FC: AF        .byte con_animation + $AF
- D - I - 0x02250D 11:A4FD: 97        .byte con_cloud + $97
- D - I - 0x02250E 11:A4FE: F2        .byte con_jmp
- D - I - 0x02250F 11:A4FF: C7 BB     .word loc_BBC7_очистка

bra_case_A501_0A_ishizaki:
- - - - - 0x022511 11:A501: 3C        .byte con_pause + $3C
- - - - - 0x022512 11:A502: 30        .byte con_bg + $30
- - - - - 0x022513 11:A503: 98        .byte con_animation + $98
- - - - - 0x022514 11:A504: 97        .byte con_cloud + $97
- - - - - 0x022515 11:A505: F2        .byte con_jmp
- - - - - 0x022516 11:A506: C7 BB     .word loc_BBC7_очистка

bra_case_A508_0B_ishizaki:
- - - - - 0x022518 11:A508: 3C        .byte con_pause + $3C
- - - - - 0x022519 11:A509: 30        .byte con_bg + $30
- - - - - 0x02251A 11:A50A: 99        .byte con_animation + $99
- - - - - 0x02251B 11:A50B: 97        .byte con_cloud + $97
- - - - - 0x02251C 11:A50C: F2        .byte con_jmp
- - - - - 0x02251D 11:A50D: C7 BB     .word loc_BBC7_очистка

bra_case_A50F_0C_souda:
- D - I - 0x02251F 11:A50F: 3C        .byte con_pause + $3C
- D - I - 0x022520 11:A510: 30        .byte con_bg + $30
- D - I - 0x022521 11:A511: 9F        .byte con_animation + $9F
- D - I - 0x022522 11:A512: 97        .byte con_cloud + $97
- D - I - 0x022523 11:A513: F2        .byte con_jmp
- D - I - 0x022524 11:A514: C7 BB     .word loc_BBC7_очистка

bra_case_A516_0D_souda:
- - - - - 0x022526 11:A516: 3C        .byte con_pause + $3C
- - - - - 0x022527 11:A517: 30        .byte con_bg + $30
- - - - - 0x022528 11:A518: AD        .byte con_animation + $AD
- - - - - 0x022529 11:A519: 97        .byte con_cloud + $97
- - - - - 0x02252A 11:A51A: F2        .byte con_jmp
- - - - - 0x02252B 11:A51B: C7 BB     .word loc_BBC7_очистка

bra_case_A51D_0E_jitou:
- - - - - 0x02252D 11:A51D: 3C        .byte con_pause + $3C
- - - - - 0x02252E 11:A51E: 30        .byte con_bg + $30
- - - - - 0x02252F 11:A51F: A0        .byte con_animation + $A0
- - - - - 0x022530 11:A520: 97        .byte con_cloud + $97
- - - - - 0x022531 11:A521: F2        .byte con_jmp
- - - - - 0x022532 11:A522: C7 BB     .word loc_BBC7_очистка

bra_case_A524_0F_jitou:
- D - I - 0x022534 11:A524: 3C        .byte con_pause + $3C
- D - I - 0x022535 11:A525: 30        .byte con_bg + $30
- D - I - 0x022536 11:A526: AA        .byte con_animation + $AA
- D - I - 0x022537 11:A527: 97        .byte con_cloud + $97
- D - I - 0x022538 11:A528: F2        .byte con_jmp
- D - I - 0x022539 11:A529: C7 BB     .word loc_BBC7_очистка

bra_case_A52B_10_masao_kazuo:
- D - I - 0x02253B 11:A52B: 3C        .byte con_pause + $3C
- D - I - 0x02253C 11:A52C: 30        .byte con_bg + $30
- D - I - 0x02253D 11:A52D: 9C        .byte con_animation + $9C
- D - I - 0x02253E 11:A52E: 97        .byte con_cloud + $97
- D - I - 0x02253F 11:A52F: F2        .byte con_jmp
- D - I - 0x022540 11:A530: C7 BB     .word loc_BBC7_очистка

bra_case_A532_11_masao_kazuo:
- D - I - 0x022542 11:A532: 3C        .byte con_pause + $3C
- D - I - 0x022543 11:A533: 30        .byte con_bg + $30
- D - I - 0x022544 11:A534: AB        .byte con_animation + $AB
- D - I - 0x022545 11:A535: 97        .byte con_cloud + $97
- D - I - 0x022546 11:A536: F2        .byte con_jmp
- D - I - 0x022547 11:A537: C7 BB     .word loc_BBC7_очистка

bra_case_A539_12_nitta:
- D - I - 0x022549 11:A539: 3C        .byte con_pause + $3C
- D - I - 0x02254A 11:A53A: 30        .byte con_bg + $30
- D - I - 0x02254B 11:A53B: 9A        .byte con_animation + $9A
- D - I - 0x02254C 11:A53C: 97        .byte con_cloud + $97
- D - I - 0x02254D 11:A53D: F2        .byte con_jmp
- D - I - 0x02254E 11:A53E: C7 BB     .word loc_BBC7_очистка

bra_case_A540_13_nitta:
- - - - - 0x022550 11:A540: 3C        .byte con_pause + $3C
- - - - - 0x022551 11:A541: 30        .byte con_bg + $30
- - - - - 0x022552 11:A542: 9B        .byte con_animation + $9B
- - - - - 0x022553 11:A543: 97        .byte con_cloud + $97
- - - - - 0x022554 11:A544: F2        .byte con_jmp
- - - - - 0x022555 11:A545: C7 BB     .word loc_BBC7_очистка

bra_case_A547_14_sawada:
- - - - - 0x022557 11:A547: 3C        .byte con_pause + $3C
- - - - - 0x022558 11:A548: 30        .byte con_bg + $30
- - - - - 0x022559 11:A549: A2        .byte con_animation + $A2
- - - - - 0x02255A 11:A54A: 97        .byte con_cloud + $97
- - - - - 0x02255B 11:A54B: F2        .byte con_jmp
- - - - - 0x02255C 11:A54C: C7 BB     .word loc_BBC7_очистка

bra_case_A54E_15_sawada:
- - - - - 0x02255E 11:A54E: 3C        .byte con_pause + $3C
- - - - - 0x02255F 11:A54F: 30        .byte con_bg + $30
- - - - - 0x022560 11:A550: B1        .byte con_animation + $B1
- - - - - 0x022561 11:A551: 97        .byte con_cloud + $97
- - - - - 0x022562 11:A552: F2        .byte con_jmp
- - - - - 0x022563 11:A553: C7 BB     .word loc_BBC7_очистка

bra_case_A555_16_coimbra:
- D - I - 0x022565 11:A555: 3C        .byte con_pause + $3C
- D - I - 0x022566 11:A556: 30        .byte con_bg + $30
- D - I - 0x022567 11:A557: BC        .byte con_animation + $BC
- D - I - 0x022568 11:A558: 97        .byte con_cloud + $97
- D - I - 0x022569 11:A559: F2        .byte con_jmp
- D - I - 0x02256A 11:A55A: C7 BB     .word loc_BBC7_очистка

bra_case_A55C_17_carlos:
- D - I - 0x02256C 11:A55C: 3C        .byte con_pause + $3C
- D - I - 0x02256D 11:A55D: 30        .byte con_bg + $30
- D - I - 0x02256E 11:A55E: A9        .byte con_animation + $A9
- D - I - 0x02256F 11:A55F: 97        .byte con_cloud + $97
- D - I - 0x022570 11:A560: F2        .byte con_jmp
- D - I - 0x022571 11:A561: C7 BB     .word loc_BBC7_очистка

bra_case_A563_18_carlos:
- D - I - 0x022573 11:A563: 3C        .byte con_pause + $3C
- D - I - 0x022574 11:A564: 30        .byte con_bg + $30
- D - I - 0x022575 11:A565: BB        .byte con_animation + $BB
- D - I - 0x022576 11:A566: 97        .byte con_cloud + $97
- D - I - 0x022577 11:A567: F2        .byte con_jmp
- D - I - 0x022578 11:A568: C7 BB     .word loc_BBC7_очистка

bra_case_A56A_19_schneider:
- D - I - 0x02257A 11:A56A: 3C        .byte con_pause + $3C
- D - I - 0x02257B 11:A56B: 30        .byte con_bg + $30
- D - I - 0x02257C 11:A56C: B8        .byte con_animation + $B8
- D - I - 0x02257D 11:A56D: 97        .byte con_cloud + $97
- D - I - 0x02257E 11:A56E: F2        .byte con_jmp
- D - I - 0x02257F 11:A56F: C7 BB     .word loc_BBC7_очистка

bra_case_A571_1A_kaltz:
- - - - - 0x022581 11:A571: 3C        .byte con_pause + $3C
- - - - - 0x022582 11:A572: 30        .byte con_bg + $30
- - - - - 0x022583 11:A573: B3        .byte con_animation + $B3
- - - - - 0x022584 11:A574: 97        .byte con_cloud + $97
- - - - - 0x022585 11:A575: F2        .byte con_jmp
- - - - - 0x022586 11:A576: C7 BB     .word loc_BBC7_очистка

bra_case_A578_1B_schester:
- - - - - 0x022588 11:A578: 3C        .byte con_pause + $3C
- - - - - 0x022589 11:A579: 30        .byte con_bg + $30
- - - - - 0x02258A 11:A57A: BA        .byte con_animation + $BA
- - - - - 0x02258B 11:A57B: 97        .byte con_cloud + $97
- - - - - 0x02258C 11:A57C: F2        .byte con_jmp
- - - - - 0x02258D 11:A57D: C7 BB     .word loc_BBC7_очистка

bra_case_A57F_1C_diaz:
- D - I - 0x02258F 11:A57F: 3C        .byte con_pause + $3C
- D - I - 0x022590 11:A580: 30        .byte con_bg + $30
- D - I - 0x022591 11:A581: B7        .byte con_animation + $B7
- D - I - 0x022592 11:A582: 97        .byte con_cloud + $97
- D - I - 0x022593 11:A583: F2        .byte con_jmp
- D - I - 0x022594 11:A584: C7 BB     .word loc_BBC7_очистка

bra_case_A586_1D_pascal:
- D - I - 0x022596 11:A586: 3C        .byte con_pause + $3C
- D - I - 0x022597 11:A587: 30        .byte con_bg + $30
- D - I - 0x022598 11:A588: B6        .byte con_animation + $B6
- D - I - 0x022599 11:A589: 97        .byte con_cloud + $97
- - - - - 0x02259A 11:A58A: F2        .byte con_jmp
- - - - - 0x02259B 11:A58B: C7 BB     .word loc_BBC7_очистка

bra_case_A58D_1E_pierre:
- D - I - 0x02259D 11:A58D: 3C        .byte con_pause + $3C
- D - I - 0x02259E 11:A58E: 30        .byte con_bg + $30
- D - I - 0x02259F 11:A58F: B5        .byte con_animation + $B5
- D - I - 0x0225A0 11:A590: 97        .byte con_cloud + $97
- D - I - 0x0225A1 11:A591: F2        .byte con_jmp
- D - I - 0x0225A2 11:A592: C7 BB     .word loc_BBC7_очистка

bra_case_A594_1F_napoleon:
- D - I - 0x0225A4 11:A594: 3C        .byte con_pause + $3C
- D - I - 0x0225A5 11:A595: 30        .byte con_bg + $30
- D - I - 0x0225A6 11:A596: B4        .byte con_animation + $B4
- D - I - 0x0225A7 11:A597: 97        .byte con_cloud + $97
- D - I - 0x0225A8 11:A598: F2        .byte con_jmp
- D - I - 0x0225A9 11:A599: C7 BB     .word loc_BBC7_очистка

bra_case_A59B_20_victorino:
- D - I - 0x0225AB 11:A59B: 3C        .byte con_pause + $3C
- D - I - 0x0225AC 11:A59C: 30        .byte con_bg + $30
- D - I - 0x0225AD 11:A59D: B2        .byte con_animation + $B2
- D - I - 0x0225AE 11:A59E: 97        .byte con_cloud + $97
- D - I - 0x0225AF 11:A59F: F2        .byte con_jmp
- D - I - 0x0225B0 11:A5A0: C7 BB     .word loc_BBC7_очистка

bra_case_A5A2_21_kaltz:
- - - - - 0x0225B2 11:A5A2: 3C        .byte con_pause + $3C
- - - - - 0x0225B3 11:A5A3: 30        .byte con_bg + $30
- - - - - 0x0225B4 11:A5A4: B9        .byte con_animation + $B9
- - - - - 0x0225B5 11:A5A5: 97        .byte con_cloud + $97
- - - - - 0x0225B6 11:A5A6: F2        .byte con_jmp
- - - - - 0x0225B7 11:A5A7: C7 BB     .word loc_BBC7_очистка

sub_A5A9_kurae:
- D - I - 0x0225B9 11:A5A9: F3        .byte con_branch, $AA
- D - I - 0x0225BB 11:A5AB: 22        .byte bra_case_A5CD_00_игрок_без_рожи - *
- - - - - 0x0225BC 11:A5AC: 22        .byte bra_case_A5CE_01_tsubasa - *
- D - I - 0x0225BD 11:A5AD: 28        .byte bra_case_A5D5_02_misaki - *
- - - - - 0x0225BE 11:A5AE: 2E        .byte bra_case_A5DC_03_misaki - *
- - - - - 0x0225BF 11:A5AF: 34        .byte bra_case_A5E3_04_hyuga - *
- - - - - 0x0225C0 11:A5B0: 3A        .byte bra_case_A5EA_05_hyuga - *
- - - - - 0x0225C1 11:A5B1: 40        .byte bra_case_A5F1_06_misugi - *
- - - - - 0x0225C2 11:A5B2: 46        .byte bra_case_A5F8_07_misugi - *
- D - I - 0x0225C3 11:A5B3: 4C        .byte bra_case_A5FF_08_matsuyama - *
- - - - - 0x0225C4 11:A5B4: 52        .byte bra_case_A606_09_matsuyama - *
- - - - - 0x0225C5 11:A5B5: 58        .byte bra_case_A60D_0A_ishizaki - *
- - - - - 0x0225C6 11:A5B6: 5E        .byte bra_case_A614_0B_ishizaki - *
- - - - - 0x0225C7 11:A5B7: 64        .byte bra_case_A61B_0C_souda - *
- - - - - 0x0225C8 11:A5B8: 6A        .byte bra_case_A622_0D_souda - *
- - - - - 0x0225C9 11:A5B9: 70        .byte bra_case_A629_0E_jitou - *
- - - - - 0x0225CA 11:A5BA: 76        .byte bra_case_A630_0F_jitou - *
- - - - - 0x0225CB 11:A5BB: 7C        .byte bra_case_A637_10_masao_kazuo - *
- - - - - 0x0225CC 11:A5BC: 82        .byte bra_case_A63E_11_masao_kazuo - *
- - - - - 0x0225CD 11:A5BD: 88        .byte bra_case_A645_12_nitta - *
- - - - - 0x0225CE 11:A5BE: 8E        .byte bra_case_A64C_13_nitta - *
- - - - - 0x0225CF 11:A5BF: 94        .byte bra_case_A653_14_sawada - *
- - - - - 0x0225D0 11:A5C0: 9A        .byte bra_case_A65A_15_sawada - *
- - - - - 0x0225D1 11:A5C1: A0        .byte bra_case_A661_16_coimbra - *
- - - - - 0x0225D2 11:A5C2: A6        .byte bra_case_A668_17_carlos - *
- - - - - 0x0225D3 11:A5C3: AC        .byte bra_case_A66F_18_carlos - *
- - - - - 0x0225D4 11:A5C4: B2        .byte bra_case_A676_19_schneider - *
- - - - - 0x0225D5 11:A5C5: B8        .byte bra_case_A67D_1A_kaltz - *
- - - - - 0x0225D6 11:A5C6: BE        .byte bra_case_A684_1B_schester - *
- - - - - 0x0225D7 11:A5C7: C4        .byte bra_case_A68B_1C_diaz - *
- - - - - 0x0225D8 11:A5C8: CA        .byte bra_case_A692_1D_pascal - *
- - - - - 0x0225D9 11:A5C9: D0        .byte bra_case_A699_1E_pierre - *
- - - - - 0x0225DA 11:A5CA: D6        .byte bra_case_A6A0_1F_napoleon - *
- - - - - 0x0225DB 11:A5CB: DC        .byte bra_case_A6A7_20_victorino - *
- - - - - 0x0225DC 11:A5CC: E2        .byte bra_case_A6AE_21_kaltz - *

bra_case_A5CD_00_игрок_без_рожи:
- D - I - 0x0225DD 11:A5CD: FB        .byte con_rts

bra_case_A5CE_01_tsubasa:
- - - - - 0x0225DE 11:A5CE: 3C        .byte con_pause + $3C
- - - - - 0x0225DF 11:A5CF: 30        .byte con_bg + $30
- - - - - 0x0225E0 11:A5D0: 91        .byte con_animation + $91
- - - - - 0x0225E1 11:A5D1: A2        .byte con_cloud + $A2
- - - - - 0x0225E2 11:A5D2: F2        .byte con_jmp
- - - - - 0x0225E3 11:A5D3: C7 BB     .word loc_BBC7_очистка

bra_case_A5D5_02_misaki:
- D - I - 0x0225E5 11:A5D5: 3C        .byte con_pause + $3C
- D - I - 0x0225E6 11:A5D6: 30        .byte con_bg + $30
- D - I - 0x0225E7 11:A5D7: 96        .byte con_animation + $96
- D - I - 0x0225E8 11:A5D8: A2        .byte con_cloud + $A2
- D - I - 0x0225E9 11:A5D9: F2        .byte con_jmp
- D - I - 0x0225EA 11:A5DA: C7 BB     .word loc_BBC7_очистка

bra_case_A5DC_03_misaki:
- - - - - 0x0225EC 11:A5DC: 3C        .byte con_pause + $3C
- - - - - 0x0225ED 11:A5DD: 30        .byte con_bg + $30
- - - - - 0x0225EE 11:A5DE: 97        .byte con_animation + $97
- - - - - 0x0225EF 11:A5DF: A2        .byte con_cloud + $A2
- - - - - 0x0225F0 11:A5E0: F2        .byte con_jmp
- - - - - 0x0225F1 11:A5E1: C7 BB     .word loc_BBC7_очистка

bra_case_A5E3_04_hyuga:
- - - - - 0x0225F3 11:A5E3: 3C        .byte con_pause + $3C
- - - - - 0x0225F4 11:A5E4: 31        .byte con_bg + $31
- - - - - 0x0225F5 11:A5E5: 9E        .byte con_animation + $9E
- - - - - 0x0225F6 11:A5E6: A2        .byte con_cloud + $A2
- - - - - 0x0225F7 11:A5E7: F2        .byte con_jmp
- - - - - 0x0225F8 11:A5E8: C7 BB     .word loc_BBC7_очистка

bra_case_A5EA_05_hyuga:
- - - - - 0x0225FA 11:A5EA: 3C        .byte con_pause + $3C
- - - - - 0x0225FB 11:A5EB: 31        .byte con_bg + $31
- - - - - 0x0225FC 11:A5EC: B0        .byte con_animation + $B0
- - - - - 0x0225FD 11:A5ED: A2        .byte con_cloud + $A2
- - - - - 0x0225FE 11:A5EE: F2        .byte con_jmp
- - - - - 0x0225FF 11:A5EF: C7 BB     .word loc_BBC7_очистка

bra_case_A5F1_06_misugi:
- - - - - 0x022601 11:A5F1: 3C        .byte con_pause + $3C
- - - - - 0x022602 11:A5F2: 30        .byte con_bg + $30
- - - - - 0x022603 11:A5F3: A3        .byte con_animation + $A3
- - - - - 0x022604 11:A5F4: A2        .byte con_cloud + $A2
- - - - - 0x022605 11:A5F5: F2        .byte con_jmp
- - - - - 0x022606 11:A5F6: C7 BB     .word loc_BBC7_очистка

bra_case_A5F8_07_misugi:
- - - - - 0x022608 11:A5F8: 3C        .byte con_pause + $3C
- - - - - 0x022609 11:A5F9: 30        .byte con_bg + $30
- - - - - 0x02260A 11:A5FA: AE        .byte con_animation + $AE
- - - - - 0x02260B 11:A5FB: A2        .byte con_cloud + $A2
- - - - - 0x02260C 11:A5FC: F2        .byte con_jmp
- - - - - 0x02260D 11:A5FD: C7 BB     .word loc_BBC7_очистка

bra_case_A5FF_08_matsuyama:
- D - I - 0x02260F 11:A5FF: 3C        .byte con_pause + $3C
- D - I - 0x022610 11:A600: 30        .byte con_bg + $30
- D - I - 0x022611 11:A601: A1        .byte con_animation + $A1
- D - I - 0x022612 11:A602: A2        .byte con_cloud + $A2
- D - I - 0x022613 11:A603: F2        .byte con_jmp
- D - I - 0x022614 11:A604: C7 BB     .word loc_BBC7_очистка

bra_case_A606_09_matsuyama:
- - - - - 0x022616 11:A606: 3C        .byte con_pause + $3C
- - - - - 0x022617 11:A607: 30        .byte con_bg + $30
- - - - - 0x022618 11:A608: AF        .byte con_animation + $AF
- - - - - 0x022619 11:A609: A2        .byte con_cloud + $A2
- - - - - 0x02261A 11:A60A: F2        .byte con_jmp
- - - - - 0x02261B 11:A60B: C7 BB     .word loc_BBC7_очистка

bra_case_A60D_0A_ishizaki:
- - - - - 0x02261D 11:A60D: 3C        .byte con_pause + $3C
- - - - - 0x02261E 11:A60E: 30        .byte con_bg + $30
- - - - - 0x02261F 11:A60F: 98        .byte con_animation + $98
- - - - - 0x022620 11:A610: A2        .byte con_cloud + $A2
- - - - - 0x022621 11:A611: F2        .byte con_jmp
- - - - - 0x022622 11:A612: C7 BB     .word loc_BBC7_очистка

bra_case_A614_0B_ishizaki:
- - - - - 0x022624 11:A614: 3C        .byte con_pause + $3C
- - - - - 0x022625 11:A615: 30        .byte con_bg + $30
- - - - - 0x022626 11:A616: 99        .byte con_animation + $99
- - - - - 0x022627 11:A617: A2        .byte con_cloud + $A2
- - - - - 0x022628 11:A618: F2        .byte con_jmp
- - - - - 0x022629 11:A619: C7 BB     .word loc_BBC7_очистка

bra_case_A61B_0C_souda:
- - - - - 0x02262B 11:A61B: 3C        .byte con_pause + $3C
- - - - - 0x02262C 11:A61C: 30        .byte con_bg + $30
- - - - - 0x02262D 11:A61D: 9F        .byte con_animation + $9F
- - - - - 0x02262E 11:A61E: A2        .byte con_cloud + $A2
- - - - - 0x02262F 11:A61F: F2        .byte con_jmp
- - - - - 0x022630 11:A620: C7 BB     .word loc_BBC7_очистка

bra_case_A622_0D_souda:
- - - - - 0x022632 11:A622: 3C        .byte con_pause + $3C
- - - - - 0x022633 11:A623: 30        .byte con_bg + $30
- - - - - 0x022634 11:A624: AD        .byte con_animation + $AD
- - - - - 0x022635 11:A625: A2        .byte con_cloud + $A2
- - - - - 0x022636 11:A626: F2        .byte con_jmp
- - - - - 0x022637 11:A627: C7 BB     .word loc_BBC7_очистка

bra_case_A629_0E_jitou:
- - - - - 0x022639 11:A629: 3C        .byte con_pause + $3C
- - - - - 0x02263A 11:A62A: 30        .byte con_bg + $30
- - - - - 0x02263B 11:A62B: A0        .byte con_animation + $A0
- - - - - 0x02263C 11:A62C: A2        .byte con_cloud + $A2
- - - - - 0x02263D 11:A62D: F2        .byte con_jmp
- - - - - 0x02263E 11:A62E: C7 BB     .word loc_BBC7_очистка

bra_case_A630_0F_jitou:
- - - - - 0x022640 11:A630: 3C        .byte con_pause + $3C
- - - - - 0x022641 11:A631: 30        .byte con_bg + $30
- - - - - 0x022642 11:A632: AA        .byte con_animation + $AA
- - - - - 0x022643 11:A633: A2        .byte con_cloud + $A2
- - - - - 0x022644 11:A634: F2        .byte con_jmp
- - - - - 0x022645 11:A635: C7 BB     .word loc_BBC7_очистка

bra_case_A637_10_masao_kazuo:
- - - - - 0x022647 11:A637: 3C        .byte con_pause + $3C
- - - - - 0x022648 11:A638: 30        .byte con_bg + $30
- - - - - 0x022649 11:A639: 9C        .byte con_animation + $9C
- - - - - 0x02264A 11:A63A: A2        .byte con_cloud + $A2
- - - - - 0x02264B 11:A63B: F2        .byte con_jmp
- - - - - 0x02264C 11:A63C: C7 BB     .word loc_BBC7_очистка

bra_case_A63E_11_masao_kazuo:
- - - - - 0x02264E 11:A63E: 3C        .byte con_pause + $3C
- - - - - 0x02264F 11:A63F: 30        .byte con_bg + $30
- - - - - 0x022650 11:A640: AB        .byte con_animation + $AB
- - - - - 0x022651 11:A641: A2        .byte con_cloud + $A2
- - - - - 0x022652 11:A642: F2        .byte con_jmp
- - - - - 0x022653 11:A643: C7 BB     .word loc_BBC7_очистка

bra_case_A645_12_nitta:
- - - - - 0x022655 11:A645: 3C        .byte con_pause + $3C
- - - - - 0x022656 11:A646: 30        .byte con_bg + $30
- - - - - 0x022657 11:A647: 9A        .byte con_animation + $9A
- - - - - 0x022658 11:A648: A2        .byte con_cloud + $A2
- - - - - 0x022659 11:A649: F2        .byte con_jmp
- - - - - 0x02265A 11:A64A: C7 BB     .word loc_BBC7_очистка

bra_case_A64C_13_nitta:
- - - - - 0x02265C 11:A64C: 3C        .byte con_pause + $3C
- - - - - 0x02265D 11:A64D: 30        .byte con_bg + $30
- - - - - 0x02265E 11:A64E: 9B        .byte con_animation + $9B
- - - - - 0x02265F 11:A64F: A2        .byte con_cloud + $A2
- - - - - 0x022660 11:A650: F2        .byte con_jmp
- - - - - 0x022661 11:A651: C7 BB     .word loc_BBC7_очистка

bra_case_A653_14_sawada:
- - - - - 0x022663 11:A653: 3C        .byte con_pause + $3C
- - - - - 0x022664 11:A654: 30        .byte con_bg + $30
- - - - - 0x022665 11:A655: A2        .byte con_animation + $A2
- - - - - 0x022666 11:A656: A2        .byte con_cloud + $A2
- - - - - 0x022667 11:A657: F2        .byte con_jmp
- - - - - 0x022668 11:A658: C7 BB     .word loc_BBC7_очистка

bra_case_A65A_15_sawada:
- - - - - 0x02266A 11:A65A: 3C        .byte con_pause + $3C
- - - - - 0x02266B 11:A65B: 30        .byte con_bg + $30
- - - - - 0x02266C 11:A65C: B1        .byte con_animation + $B1
- - - - - 0x02266D 11:A65D: A2        .byte con_cloud + $A2
- - - - - 0x02266E 11:A65E: F2        .byte con_jmp
- - - - - 0x02266F 11:A65F: C7 BB     .word loc_BBC7_очистка

bra_case_A661_16_coimbra:
- - - - - 0x022671 11:A661: 3C        .byte con_pause + $3C
- - - - - 0x022672 11:A662: 30        .byte con_bg + $30
- - - - - 0x022673 11:A663: BC        .byte con_animation + $BC
- - - - - 0x022674 11:A664: A2        .byte con_cloud + $A2
- - - - - 0x022675 11:A665: F2        .byte con_jmp
- - - - - 0x022676 11:A666: C7 BB     .word loc_BBC7_очистка

bra_case_A668_17_carlos:
- - - - - 0x022678 11:A668: 3C        .byte con_pause + $3C
- - - - - 0x022679 11:A669: 30        .byte con_bg + $30
- - - - - 0x02267A 11:A66A: A9        .byte con_animation + $A9
- - - - - 0x02267B 11:A66B: A2        .byte con_cloud + $A2
- - - - - 0x02267C 11:A66C: F2        .byte con_jmp
- - - - - 0x02267D 11:A66D: C7 BB     .word loc_BBC7_очистка
bra_case_A66F_18_carlos:
- - - - - 0x02267F 11:A66F: 3C        .byte con_pause + $3C
- - - - - 0x022680 11:A670: 30        .byte con_bg + $30
- - - - - 0x022681 11:A671: BB        .byte con_animation + $BB
- - - - - 0x022682 11:A672: A2        .byte con_cloud + $A2
- - - - - 0x022683 11:A673: F2        .byte con_jmp
- - - - - 0x022684 11:A674: C7 BB     .word loc_BBC7_очистка

bra_case_A676_19_schneider:
- - - - - 0x022686 11:A676: 3C        .byte con_pause + $3C
- - - - - 0x022687 11:A677: 30        .byte con_bg + $30
- - - - - 0x022688 11:A678: B8        .byte con_animation + $B8
- - - - - 0x022689 11:A679: A2        .byte con_cloud + $A2
- - - - - 0x02268A 11:A67A: F2        .byte con_jmp
- - - - - 0x02268B 11:A67B: C7 BB     .word loc_BBC7_очистка
bra_case_A67D_1A_kaltz:
- - - - - 0x02268D 11:A67D: 3C        .byte con_pause + $3C
- - - - - 0x02268E 11:A67E: 30        .byte con_bg + $30
- - - - - 0x02268F 11:A67F: B3        .byte con_animation + $B3
- - - - - 0x022690 11:A680: A2        .byte con_cloud + $A2
- - - - - 0x022691 11:A681: F2        .byte con_jmp
- - - - - 0x022692 11:A682: C7 BB     .word loc_BBC7_очистка

bra_case_A684_1B_schester:
- - - - - 0x022694 11:A684: 3C        .byte con_pause + $3C
- - - - - 0x022695 11:A685: 30        .byte con_bg + $30
- - - - - 0x022696 11:A686: BA        .byte con_animation + $BA
- - - - - 0x022697 11:A687: A2        .byte con_cloud + $A2
- - - - - 0x022698 11:A688: F2        .byte con_jmp
- - - - - 0x022699 11:A689: C7 BB     .word loc_BBC7_очистка

bra_case_A68B_1C_diaz:
- - - - - 0x02269B 11:A68B: 3C        .byte con_pause + $3C
- - - - - 0x02269C 11:A68C: 30        .byte con_bg + $30
- - - - - 0x02269D 11:A68D: B7        .byte con_animation + $B7
- - - - - 0x02269E 11:A68E: A2        .byte con_cloud + $A2
- - - - - 0x02269F 11:A68F: F2        .byte con_jmp
- - - - - 0x0226A0 11:A690: C7 BB     .word loc_BBC7_очистка

bra_case_A692_1D_pascal:
- - - - - 0x0226A2 11:A692: 3C        .byte con_pause + $3C
- - - - - 0x0226A3 11:A693: 30        .byte con_bg + $30
- - - - - 0x0226A4 11:A694: B6        .byte con_animation + $B6
- - - - - 0x0226A5 11:A695: A2        .byte con_cloud + $A2
- - - - - 0x0226A6 11:A696: F2        .byte con_jmp
- - - - - 0x0226A7 11:A697: C7 BB     .word loc_BBC7_очистка

bra_case_A699_1E_pierre:
- - - - - 0x0226A9 11:A699: 3C        .byte con_pause + $3C
- - - - - 0x0226AA 11:A69A: 30        .byte con_bg + $30
- - - - - 0x0226AB 11:A69B: B5        .byte con_animation + $B5
- - - - - 0x0226AC 11:A69C: A2        .byte con_cloud + $A2
- - - - - 0x0226AD 11:A69D: F2        .byte con_jmp
- - - - - 0x0226AE 11:A69E: C7 BB     .word loc_BBC7_очистка

bra_case_A6A0_1F_napoleon:
- - - - - 0x0226B0 11:A6A0: 3C        .byte con_pause + $3C
- - - - - 0x0226B1 11:A6A1: 30        .byte con_bg + $30
- - - - - 0x0226B2 11:A6A2: B4        .byte con_animation + $B4
- - - - - 0x0226B3 11:A6A3: A2        .byte con_cloud + $A2
- - - - - 0x0226B4 11:A6A4: F2        .byte con_jmp
- - - - - 0x0226B5 11:A6A5: C7 BB     .word loc_BBC7_очистка

bra_case_A6A7_20_victorino:
- - - - - 0x0226B7 11:A6A7: 3C        .byte con_pause + $3C
- - - - - 0x0226B8 11:A6A8: 30        .byte con_bg + $30
- - - - - 0x0226B9 11:A6A9: B2        .byte con_animation + $B2
- - - - - 0x0226BA 11:A6AA: A2        .byte con_cloud + $A2
- - - - - 0x0226BB 11:A6AB: F2        .byte con_jmp
- - - - - 0x0226BC 11:A6AC: C7 BB     .word loc_BBC7_очистка

bra_case_A6AE_21_kaltz:
- - - - - 0x0226BE 11:A6AE: 3C        .byte con_pause + $3C
- - - - - 0x0226BF 11:A6AF: 30        .byte con_bg + $30
- - - - - 0x0226C0 11:A6B0: B9        .byte con_animation + $B9
- - - - - 0x0226C1 11:A6B1: A2        .byte con_cloud + $A2
- - - - - 0x0226C2 11:A6B2: F2        .byte con_jmp
- - - - - 0x0226C3 11:A6B3: C7 BB     .word loc_BBC7_очистка

bra_long_case_A6B5_00:
- D - I - 0x0226C5 11:A6B5: F7        .byte con_F7, $02
- D - I - 0x0226C7 11:A6B7: 1E        .byte con_pause + $1E
- D - I - 0x0226C8 11:A6B8: 23        .byte con_bg + $23
- D - I - 0x0226C9 11:A6B9: 5A        .byte con_animation + $5A
- D - I - 0x0226CA 11:A6BA: 00        .byte con_cloud + con_clear
bra_long_case_A6BB_01:
- D - I - 0x0226CB 11:A6BB: FB        .byte con_rts

bra_long_case_A6BC_01:
- D - I - 0x0226CC 11:A6BC: F3        .byte con_branch, $B3     ; защитный спешал
- - - - - 0x0226CE 11:A6BE: 4E        .byte bra_case_A70C_00_игрок_без_защитного_спешала - *
- D - I - 0x0226CF 11:A6BF: 37        .byte bra_case_A6F6_01_masao_kazuo - *
- - - - - 0x0226D0 11:A6C0: 46        .byte bra_case_A706_02_masao_kazuo - *
- - - - - 0x0226D1 11:A6C1: 4B        .byte bra_case_A70C_03_souda - *
- - - - - 0x0226D2 11:A6C2: 4A        .byte bra_case_A70C_04_souda - *
- - - - - 0x0226D3 11:A6C3: 49        .byte bra_case_A70C_05_jitou - *
- - - - - 0x0226D4 11:A6C4: 48        .byte bra_case_A70C_06_jitou - *
- - - - - 0x0226D5 11:A6C5: 47        .byte bra_case_A70C_07_dirceu - *
- - - - - 0x0226D6 11:A6C6: 46        .byte bra_case_A70C_08_dirceu - *
- - - - - 0x0226D7 11:A6C7: 45        .byte bra_case_A70C_09_robson - *
- - - - - 0x0226D8 11:A6C8: 44        .byte bra_case_A70C_0A_libuta - *
- - - - - 0x0226D9 11:A6C9: 43        .byte bra_case_A70C_0B_galvan - *
- - - - - 0x0226DA 11:A6CA: 42        .byte bra_case_A70C_0C_hyuga - *
- - - - - 0x0226DB 11:A6CB: 41        .byte bra_case_A70C_0D_hyuga - *
- - - - - 0x0226DC 11:A6CC: 40        .byte bra_case_A70C_0E_ishizaki - *
- - - - - 0x0226DD 11:A6CD: 3F        .byte bra_case_A70C_0F_ishizaki - *

bra_long_case_A6CE_01:
- D - I - 0x0226DE 11:A6CE: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x0226E0 11:A6D0: FE        .byte bra_case_A7CE_00_игрок_без_защитного_спешала - *
- - - - - 0x0226E1 11:A6D1: 25        .byte bra_case_A6F6_01_masao_kazuo - *
- - - - - 0x0226E2 11:A6D2: 34        .byte bra_case_A706_02_masao_kazuo - *
- - - - - 0x0226E3 11:A6D3: FB        .byte bra_case_A7CE_03_souda - *
- - - - - 0x0226E4 11:A6D4: FA        .byte bra_case_A7CE_04_souda - *
- - - - - 0x0226E4 11:A6D5: F9        .byte bra_case_A7CE_05_jitou - *
- - - - - 0x0226E4 11:A6D6: F8        .byte bra_case_A7CE_06_jitou - *
- - - - - 0x0226E4 11:A6D7: F7        .byte bra_case_A7CE_07_dirceu - *
- - - - - 0x0226E7 11:A6D8: F6        .byte bra_case_A7CE_08_dirceu - *
- - - - - 0x0226E9 11:A6D9: F5        .byte bra_case_A7CE_09_robson - *
- - - - - 0x0226EA 11:A6DA: F4        .byte bra_case_A7CE_0A_libuta - *
- - - - - 0x0226EB 11:A6DB: F3        .byte bra_case_A7CE_0B_galvan - *
- - - - - 0x0226EB 11:A6DC: F2        .byte bra_case_A7CE_0C_hyuga - *
- - - - - 0x0226ED 11:A6DD: F1        .byte bra_case_A7CE_0D_hyuga - *
- - - - - 0x0226EE 11:A6DE: F0        .byte bra_case_A7CE_0E_ishizaki - *
- - - - - 0x0226EF 11:A6DF: EF        .byte bra_case_A7CE_0F_ishizaki - *

sub_A6E0:
- D - I - 0x0226F0 11:A6E0: F3        .byte con_branch, $B7
- D - I - 0x0226F2 11:A6E2: 1D        .byte bra_case_A6FF_00_игрок_без_защитного_спешала - *
- D - I - 0x0226F3 11:A6E3: 01        .byte bra_case_A6E4_01 - *

bra_long_case_A6E4_01:
bra_case_A6E4_01:
- D - I - 0x0226F4 11:A6E4: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x0226F6 11:A6E6: 19        .byte bra_case_A6FF_00_игрок_без_защитного_спешала - *
- D - I - 0x0226F7 11:A6E7: 0F        .byte bra_case_A6F6_01_masao_kazuo - *
- D - I - 0x0226F8 11:A6E8: 1E        .byte bra_case_A706_02_masao_kazuo - *
- D - I - 0x0226F9 11:A6E9: 16        .byte bra_case_A6FF_03_souda - *
- - - - - 0x0226FA 11:A6EA: 15        .byte bra_case_A6FF_04_souda - *
- D - I - 0x0226FB 11:A6EB: 14        .byte bra_case_A6FF_05_jitou - *
- D - I - 0x0226FC 11:A6EC: 13        .byte bra_case_A6FF_06_jitou - *
- - - - - 0x0226FD 11:A6ED: 12        .byte bra_case_A6FF_07_dirceu - *
- D - I - 0x0226FE 11:A6EE: 11        .byte bra_case_A6FF_08_dirceu - *
- - - - - 0x0226FF 11:A6EF: 10        .byte bra_case_A6FF_09_robson - *
- D - I - 0x022700 11:A6F0: 0F        .byte bra_case_A6FF_0A_libuta - *
- D - I - 0x022701 11:A6F1: 0E        .byte bra_case_A6FF_0B_galvan - *
- D - I - 0x022702 11:A6F2: 0D        .byte bra_case_A6FF_0C_hyuga - *
- D - I - 0x022703 11:A6F3: 0C        .byte bra_case_A6FF_0D_hyuga - *
- D - I - 0x022704 11:A6F4: 0B        .byte bra_case_A6FF_0E_ishizaki - *
- D - I - 0x022705 11:A6F5: 0A        .byte bra_case_A6FF_0F_ishizaki - *

bra_long_case_A6F6_01_masao_kazuo:
bra_case_A6F6_01_masao_kazuo:
- D - I - 0x022706 11:A6F6: FA        .byte con_jsr
- D - I - 0x022707 11:A6F7: 1A A7     .word sub_A71A
loc_A6F9:
sub_A6F9:
- D - I - 0x022709 11:A6F9: 32        .byte con_pause + $32
- D - I - 0x02270A 11:A6FA: 4E        .byte con_bg + $4E
- D - I - 0x02270B 11:A6FB: C1        .byte con_animation + $C1
- D - I - 0x02270C 11:A6FC: ED        .byte con_cloud + $ED
- D - I - 0x02270D 11:A6FD: F6        .byte con_mirror_toggle
- D - I - 0x02270E 11:A6FE: FB        .byte con_rts

bra_long_case_A6FF_00:
bra_case_A6FF_00_игрок_без_защитного_спешала:
bra_case_A6FF_03_souda:
bra_case_A6FF_04_souda:
bra_case_A6FF_05_jitou:
bra_case_A6FF_06_jitou:
bra_case_A6FF_07_dirceu:
bra_case_A6FF_08_dirceu:
bra_case_A6FF_09_robson:
bra_case_A6FF_0A_libuta:
bra_case_A6FF_0B_galvan:
bra_case_A6FF_0C_hyuga:
bra_case_A6FF_0D_hyuga:
bra_case_A6FF_0E_ishizaki:
bra_case_A6FF_0F_ishizaki:
- D - I - 0x02270F 11:A6FF: F7        .byte con_F7, $02
- D - I - 0x022711 11:A701: 37        .byte con_pause + $37
- D - I - 0x022712 11:A702: 23        .byte con_bg + $23
- D - I - 0x022713 11:A703: 5B        .byte con_animation + $5B
- D - I - 0x022714 11:A704: 41        .byte con_cloud + $41
- D - I - 0x022715 11:A705: FB        .byte con_rts

bra_long_case_A706_02_masao_kazuo:
bra_case_A706_02_masao_kazuo:
- D - I - 0x022716 11:A706: FA        .byte con_jsr
- D - I - 0x022717 11:A707: 56 A7     .word sub_A756
- D - I - 0x022719 11:A709: F2        .byte con_jmp
- D - I - 0x02271A 11:A70A: F9 A6     .word loc_A6F9

bra_long_case_A70C_00:
bra_case_A70C_00_игрок_без_защитного_спешала:
bra_case_A70C_03_souda:
bra_case_A70C_04_souda:
bra_case_A70C_05_jitou:
bra_case_A70C_06_jitou:
bra_case_A70C_07_dirceu:
bra_case_A70C_08_dirceu:
bra_case_A70C_09_robson:
bra_case_A70C_0A_libuta:
bra_case_A70C_0B_galvan:
bra_case_A70C_0C_hyuga:
bra_case_A70C_0D_hyuga:
bra_case_A70C_0E_ishizaki:
bra_case_A70C_0F_ishizaki:
- D - I - 0x02271C 11:A70C: F7        .byte con_F7, $02
- D - I - 0x02271E 11:A70E: 1E        .byte con_pause + $1E
- D - I - 0x02271F 11:A70F: 22        .byte con_bg + $22
- D - I - 0x022720 11:A710: 5A        .byte con_animation + $5A
- D - I - 0x022721 11:A711: 38        .byte con_cloud + $38
- D - I - 0x022722 11:A712: FB        .byte con_rts

bra_long_case_A713_00___без_защитного_спешала:
- D - I - 0x022723 11:A713: F7        .byte con_F7, $02
- D - I - 0x022725 11:A715: 1E        .byte con_pause + $1E
- D - I - 0x022726 11:A716: 23        .byte con_bg + $23
- D - I - 0x022727 11:A717: 5A        .byte con_animation + $5A
- D - I - 0x022728 11:A718: 39        .byte con_cloud + $39
- D - I - 0x022729 11:A719: FB        .byte con_rts

sub_A71A:
- D - I - 0x02272A 11:A71A: F4        .byte con_mirror_on
- D - I - 0x02272B 11:A71B: F8        .byte con_F8, $04
- D - I - 0x02272D 11:A71D: 3C        .byte con_pause + $3C
- D - I - 0x02272E 11:A71E: 4F        .byte con_bg + $4F
- D - I - 0x02272F 11:A71F: 9C        .byte con_animation + $9C
- D - I - 0x022730 11:A720: AC        .byte con_cloud + $AC
- D - I - 0x022731 11:A721: F8        .byte con_F8, $04
- D - I - 0x022733 11:A723: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022736 11:A726: 32        .byte con_pause + $32
- D - I - 0x022737 11:A727: 1D        .byte con_bg + $1D
- D - I - 0x022738 11:A728: 1C        .byte con_animation + $1C
- D - I - 0x022739 11:A729: F0        .byte con_cloud + con_skip
- D - I - 0x02273A 11:A72A: F6        .byte con_mirror_toggle
- D - I - 0x02273B 11:A72B: F8        .byte con_F8, $04
- D - I - 0x02273D 11:A72D: 3C        .byte con_pause + $3C
- D - I - 0x02273E 11:A72E: 30        .byte con_bg + $30
- D - I - 0x02273F 11:A72F: 9C        .byte con_animation + $9C
- D - I - 0x022740 11:A730: D3        .byte con_cloud + $D3
- D - I - 0x022741 11:A731: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022744 11:A734: F8        .byte con_F8, $04
- D - I - 0x022746 11:A736: F7        .byte con_F7, $3A
- D - I - 0x022748 11:A738: 32        .byte con_pause + $32
- D - I - 0x022749 11:A739: 23        .byte con_bg + $23
- D - I - 0x02274A 11:A73A: 50        .byte con_animation + $50
- D - I - 0x02274B 11:A73B: F0        .byte con_cloud + con_skip
- D - I - 0x02274C 11:A73C: F6        .byte con_mirror_toggle
- D - I - 0x02274D 11:A73D: F7        .byte con_F7, $10
- D - I - 0x02274F 11:A73F: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x022752 11:A742: 20        .byte con_pause + $20
- D - I - 0x022753 11:A743: 05        .byte con_bg + $05
- D - I - 0x022754 11:A744: 00        .byte con_animation + $00
- D - I - 0x022755 11:A745: F0        .byte con_cloud + con_skip
- D - I - 0x022756 11:A746: 2B        .byte con_pause + $2B
- D - I - 0x022757 11:A747: 12        .byte con_bg + $12
- D - I - 0x022758 11:A748: C0        .byte con_animation + $C0
- D - I - 0x022759 11:A749: AF        .byte con_cloud + $AF
loc_A74A:
- D - I - 0x02275A 11:A74A: F7        .byte con_F7, $1E
- D - I - 0x02275C 11:A74C: F9        .byte con_soundID_delay, $6D, $02
- D - I - 0x02275F 11:A74F: 1E        .byte con_pause + $1E
- D - I - 0x022760 11:A750: 05        .byte con_bg + $05
- D - I - 0x022761 11:A751: F0        .byte con_animation + con_skip
- D - I - 0x022762 11:A752: F0        .byte con_cloud + con_skip
- D - I - 0x022763 11:A753: F2        .byte con_jmp
- D - I - 0x022764 11:A754: C7 BB     .word loc_BBC7_очистка

sub_A756:
- D - I - 0x022766 11:A756: F4        .byte con_mirror_on
- D - I - 0x022767 11:A757: F8        .byte con_F8, $04
- D - I - 0x022769 11:A759: 3C        .byte con_pause + $3C
- D - I - 0x02276A 11:A75A: 4F        .byte con_bg + $4F
- D - I - 0x02276B 11:A75B: AB        .byte con_animation + $AB
- D - I - 0x02276C 11:A75C: AC        .byte con_cloud + $AC
- D - I - 0x02276D 11:A75D: F8        .byte con_F8, $04
- D - I - 0x02276F 11:A75F: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022772 11:A762: 32        .byte con_pause + $32
- D - I - 0x022773 11:A763: 1D        .byte con_bg + $1D
- D - I - 0x022774 11:A764: 1C        .byte con_animation + $1C
- D - I - 0x022775 11:A765: F0        .byte con_cloud + con_skip
- D - I - 0x022776 11:A766: F8        .byte con_F8, $04
- D - I - 0x022778 11:A768: F6        .byte con_mirror_toggle
- D - I - 0x022779 11:A769: 3C        .byte con_pause + $3C
- D - I - 0x02277A 11:A76A: 30        .byte con_bg + $30
- D - I - 0x02277B 11:A76B: AB        .byte con_animation + $AB
- D - I - 0x02277C 11:A76C: D3        .byte con_cloud + $D3
- D - I - 0x02277D 11:A76D: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022780 11:A770: F8        .byte con_F8, $04
- D - I - 0x022782 11:A772: F7        .byte con_F7, $3A
- D - I - 0x022784 11:A774: 32        .byte con_pause + $32
- D - I - 0x022785 11:A775: 23        .byte con_bg + $23
- D - I - 0x022786 11:A776: 50        .byte con_animation + $50
- D - I - 0x022787 11:A777: F0        .byte con_cloud + con_skip
- D - I - 0x022788 11:A778: F6        .byte con_mirror_toggle
- D - I - 0x022789 11:A779: F7        .byte con_F7, $10
- D - I - 0x02278B 11:A77B: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x02278E 11:A77E: 20        .byte con_pause + $20
- D - I - 0x02278F 11:A77F: 05        .byte con_bg + $05
- D - I - 0x022790 11:A780: 00        .byte con_animation + $00
- D - I - 0x022791 11:A781: F0        .byte con_cloud + con_skip
- D - I - 0x022792 11:A782: 2B        .byte con_pause + $2B
- D - I - 0x022793 11:A783: 12        .byte con_bg + $12
- D - I - 0x022794 11:A784: E1        .byte con_animation + $E1
- D - I - 0x022795 11:A785: AF        .byte con_cloud + $AF
- D - I - 0x022796 11:A786: F2        .byte con_jmp
- D - I - 0x022797 11:A787: 4A A7     .word loc_A74A

bra_long_case_A789_05_jitou:
- - - - - 0x022799 11:A789: F7        .byte con_F7, $44
- - - - - 0x02279B 11:A78B: 78        .byte con_pause + $78
- - - - - 0x02279C 11:A78C: 30        .byte con_bg + $30
- - - - - 0x02279D 11:A78D: A0        .byte con_animation + $A0
- - - - - 0x02279E 11:A78E: D9        .byte con_cloud + $D9
loc_A78F:
- - - - - 0x02279F 11:A78F: FA        .byte con_jsr
- - - - - 0x0227A0 11:A790: C7 BB     .word sub_BBC7_очистка
bra_long_case_A792_07___dirceu:
- - - - - 0x0227A2 11:A792: F7        .byte con_F7, $33
- - - - - 0x0227A4 11:A794: F9        .byte con_soundID_delay, $27, $02
- - - - - 0x0227A7 11:A797: 28        .byte con_pause + $28
- - - - - 0x0227A8 11:A798: 6B        .byte con_bg + $6B
- - - - - 0x0227A9 11:A799: E3        .byte con_animation + $E3
- - - - - 0x0227AA 11:A79A: EC        .byte con_cloud + $EC
- - - - - 0x0227AB 11:A79B: FB        .byte con_rts

bra_long_case_A79C_06_jitou:
- - - - - 0x0227AC 11:A79C: F7        .byte con_F7, $44
- - - - - 0x0227AE 11:A79E: 78        .byte con_pause + $78
- - - - - 0x0227AF 11:A79F: 30        .byte con_bg + $30
- - - - - 0x0227B0 11:A7A0: AA        .byte con_animation + $AA
- - - - - 0x0227B1 11:A7A1: D9        .byte con_cloud + $D9
- - - - - 0x0227B2 11:A7A2: F2        .byte con_jmp
- - - - - 0x0227B3 11:A7A3: 8F A7     .word loc_A78F

bra_long_case_A7A5_0E_ishizaki:
- - - - - 0x0227B5 11:A7A5: F7        .byte con_F7, $02
- - - - - 0x0227B7 11:A7A7: 1E        .byte con_pause + $1E
- - - - - 0x0227B8 11:A7A8: 22        .byte con_bg + $22
- - - - - 0x0227B9 11:A7A9: 5A        .byte con_animation + $5A
- - - - - 0x0227BA 11:A7AA: 00        .byte con_cloud + con_clear
- - - - - 0x0227BB 11:A7AB: F7        .byte con_F7, $44
- - - - - 0x0227BD 11:A7AD: 3C        .byte con_pause + $3C
- - - - - 0x0227BE 11:A7AE: 30        .byte con_bg + $30
- - - - - 0x0227BF 11:A7AF: 98        .byte con_animation + $98
- - - - - 0x0227C0 11:A7B0: D7        .byte con_cloud + $D7
loc_A7B1:
sub_A7B1:
- D - I - 0x0227C1 11:A7B1: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0227C4 11:A7B4: 28        .byte con_pause + $28
- D - I - 0x0227C5 11:A7B5: 4E        .byte con_bg + $4E
- D - I - 0x0227C6 11:A7B6: CF        .byte con_animation + $CF
- D - I - 0x0227C7 11:A7B7: F0        .byte con_cloud + con_skip
- D - I - 0x0227C8 11:A7B8: F7        .byte con_F7, $31
- D - I - 0x0227CA 11:A7BA: 1E        .byte con_pause + $1E
- D - I - 0x0227CB 11:A7BB: 48        .byte con_bg + $48
- D - I - 0x0227CC 11:A7BC: F0        .byte con_animation + con_skip
- D - I - 0x0227CD 11:A7BD: 00        .byte con_cloud + con_clear
- D - I - 0x0227CE 11:A7BE: FB        .byte con_rts

bra_long_case_A7BF_0F_ishizaki:
- - - - - 0x0227CF 11:A7BF: F7        .byte con_F7, $02
- - - - - 0x0227D1 11:A7C1: 1E        .byte con_pause + $1E
- - - - - 0x0227D2 11:A7C2: 22        .byte con_bg + $22
- - - - - 0x0227D3 11:A7C3: 5A        .byte con_animation + $5A
- - - - - 0x0227D4 11:A7C4: 00        .byte con_cloud + con_clear
- - - - - 0x0227D5 11:A7C5: F7        .byte con_F7, $44
- - - - - 0x0227D7 11:A7C7: 3C        .byte con_pause + $3C
- - - - - 0x0227D8 11:A7C8: 30        .byte con_bg + $30
- - - - - 0x0227D9 11:A7C9: 99        .byte con_animation + $99
- - - - - 0x0227DA 11:A7CA: D7        .byte con_cloud + $D7
- - - - - 0x0227DB 11:A7CB: F2        .byte con_jmp
- - - - - 0x0227DC 11:A7CC: B1 A7     .word loc_A7B1

bra_long_case_A7CE_00:
bra_case_A7CE_00_игрок_без_защитного_спешала:
bra_case_A7CE_03_souda:
bra_case_A7CE_04_souda:
bra_case_A7CE_05_jitou:
bra_case_A7CE_06_jitou:
bra_case_A7CE_07_dirceu:
bra_case_A7CE_08_dirceu:
bra_case_A7CE_09_robson:
bra_case_A7CE_0A_libuta:
bra_case_A7CE_0B_galvan:
bra_case_A7CE_0C_hyuga:
bra_case_A7CE_0D_hyuga:
bra_case_A7CE_0E_ishizaki:
bra_case_A7CE_0F_ishizaki:
- D - I - 0x0227DE 11:A7CE: F7        .byte con_F7, $02
- D - I - 0x0227E0 11:A7D0: 28        .byte con_pause + $28
- D - I - 0x0227E1 11:A7D1: 23        .byte con_bg + $23
- D - I - 0x0227E2 11:A7D2: 5A        .byte con_animation + $5A
- D - I - 0x0227E3 11:A7D3: 40        .byte con_cloud + $40
- D - I - 0x0227E4 11:A7D4: FB        .byte con_rts

bra_long_case_A7D5_00:
- D - I - 0x0227E5 11:A7D5: F8        .byte con_F8, $03
- D - I - 0x0227E7 11:A7D7: F7        .byte con_F7, $02
- D - I - 0x0227E9 11:A7D9: 37        .byte con_pause + $37
- D - I - 0x0227EA 11:A7DA: 23        .byte con_bg + $23
- D - I - 0x0227EB 11:A7DB: 5A        .byte con_animation + $5A
- D - I - 0x0227EC 11:A7DC: 42        .byte con_cloud + $42
- D - I - 0x0227ED 11:A7DD: FB        .byte con_rts

bra_long_case_A7DE_00:
- D - I - 0x0227EE 11:A7DE: F8        .byte con_F8, $03
- D - I - 0x0227F0 11:A7E0: F7        .byte con_F7, $02
- D - I - 0x0227F2 11:A7E2: 37        .byte con_pause + $37
- D - I - 0x0227F3 11:A7E3: 22        .byte con_bg + $22
- D - I - 0x0227F4 11:A7E4: 5B        .byte con_animation + $5B
- D - I - 0x0227F5 11:A7E5: 43        .byte con_cloud + $43
- D - I - 0x0227F6 11:A7E6: FB        .byte con_rts

bra_long_case_A7E7_00:
- D - I - 0x0227F7 11:A7E7: F7        .byte con_F7, $02
- D - I - 0x0227F9 11:A7E9: 37        .byte con_pause + $37
- D - I - 0x0227FA 11:A7EA: 23        .byte con_bg + $23
- D - I - 0x0227FB 11:A7EB: 5B        .byte con_animation + $5B
- D - I - 0x0227FC 11:A7EC: 44        .byte con_cloud + $44
- D - I - 0x0227FD 11:A7ED: FB        .byte con_rts

bra_long_case_A7EE_00_shoot:
bra_long_case_A7EE_00_dribble:
bra_long_case_A7EE_01_pass:
bra_long_case_A7EE_03_1_2_pass:
; трудная обводка
- D - I - 0x0227FE 11:A7EE: F6        .byte con_mirror_toggle
- D - I - 0x0227FF 11:A7EF: F7        .byte con_F7, $02
- D - I - 0x022801 11:A7F1: 14        .byte con_pause + $14
- D - I - 0x022802 11:A7F2: 22        .byte con_bg + $22
- D - I - 0x022803 11:A7F3: 60        .byte con_animation + $60
- D - I - 0x022804 11:A7F4: 45        .byte con_cloud + $45
- D - I - 0x022805 11:A7F5: F7        .byte con_F7, $24
- D - I - 0x022807 11:A7F7: F9        .byte con_soundID_delay, $68, $02
- D - I - 0x02280A 11:A7FA: 10        .byte con_pause + $10
- D - I - 0x02280B 11:A7FB: 6B        .byte con_bg + $6B
- D - I - 0x02280C 11:A7FC: F0        .byte con_animation + con_skip
- D - I - 0x02280D 11:A7FD: F0        .byte con_cloud + con_skip
loc_A7FE:
- D - I - 0x02280E 11:A7FE: F7        .byte con_F7, $02
- D - I - 0x022810 11:A800: 3C        .byte con_pause + $3C
- D - I - 0x022811 11:A801: 22        .byte con_bg + $22
- D - I - 0x022812 11:A802: F0        .byte con_animation + con_skip
- D - I - 0x022813 11:A803: F0        .byte con_cloud + con_skip
- D - I - 0x022814 11:A804: FB        .byte con_rts

bra_long_case_A805_01_heel_lift:
- D - I - 0x022815 11:A805: FA        .byte con_jsr
- D - I - 0x022816 11:A806: 10 A8     .word sub_A810_анимация_heel_lift
- D - I - 0x022818 11:A808: F7        .byte con_F7, $02
- D - I - 0x02281A 11:A80A: 3C        .byte con_pause + $3C
- D - I - 0x02281B 11:A80B: 23        .byte con_bg + $23
- D - I - 0x02281C 11:A80C: E4        .byte con_animation + $E4
- D - I - 0x02281D 11:A80D: 45        .byte con_cloud + $45
- D - I - 0x02281E 11:A80E: F6        .byte con_mirror_toggle
- D - I - 0x02281F 11:A80F: FB        .byte con_rts

sub_A810_анимация_heel_lift:
- D - I - 0x022820 11:A810: F7        .byte con_F7, $02
- D - I - 0x022822 11:A812: F9        .byte con_soundID_delay, $1E, $31
- D - I - 0x022825 11:A815: 3F        .byte con_pause + $3F
- D - I - 0x022826 11:A816: 23        .byte con_bg + $23
- D - I - 0x022827 11:A817: E2        .byte con_animation + $E2
- D - I - 0x022828 11:A818: 49        .byte con_cloud + $49
- D - I - 0x022829 11:A819: F7        .byte con_F7, $0A
- D - I - 0x02282B 11:A81B: 3C        .byte con_pause + $3C
- D - I - 0x02282C 11:A81C: 05        .byte con_bg + $05
- D - I - 0x02282D 11:A81D: F0        .byte con_animation + con_skip
- D - I - 0x02282E 11:A81E: F0        .byte con_cloud + con_skip
- D - I - 0x02282F 11:A81F: FB        .byte con_rts

bra_long_case_A820_02_forcible_dribble:
- - - - - 0x022830 11:A820: F3        .byte con_branch, $C7     ; кто делает силовой дриблинг
- - - - - 0x022832 11:A822: 06        .byte bra_case_A828_00_hyuga_из_японии - *
- - - - - 0x022833 11:A823: 0E        .byte bra_case_A831_01_hyuga_из_тохо - *
- - - - - 0x022834 11:A824: 16        .byte bra_case_A83A_02_jitou_из_японии - *
- - - - - 0x022835 11:A825: 1E        .byte bra_case_A843_03_jitou_из_куними - *
- - - - - 0x022836 11:A826: 26        .byte bra_case_A84C_04_napoleon - *
- - - - - 0x022837 11:A827: 2E        .byte bra_case_A855_05_игрок_без_рожи - *

bra_case_A828_00_hyuga_из_японии:
- - - - - 0x022838 11:A828: F7        .byte con_F7, $44
- - - - - 0x02283A 11:A82A: 3C        .byte con_pause + $3C
- - - - - 0x02283B 11:A82B: 31        .byte con_bg + $31
- - - - - 0x02283C 11:A82C: 9E        .byte con_animation + $9E
- - - - - 0x02283D 11:A82D: C4        .byte con_cloud + $C4
- - - - - 0x02283E 11:A82E: F2        .byte con_jmp
- - - - - 0x02283F 11:A82F: 7B AA     .word loc_AA7B

bra_case_A831_01_hyuga_из_тохо:
- - - - - 0x022841 11:A831: F7        .byte con_F7, $44
- - - - - 0x022843 11:A833: 3C        .byte con_pause + $3C
- - - - - 0x022844 11:A834: 31        .byte con_bg + $31
- - - - - 0x022845 11:A835: B0        .byte con_animation + $B0
- - - - - 0x022846 11:A836: C4        .byte con_cloud + $C4
- - - - - 0x022847 11:A837: F2        .byte con_jmp
- - - - - 0x022848 11:A838: 7B AA     .word loc_AA7B

bra_case_A83A_02_jitou_из_японии:
- - - - - 0x02284A 11:A83A: F7        .byte con_F7, $44
- - - - - 0x02284C 11:A83C: 78        .byte con_pause + $78
- - - - - 0x02284D 11:A83D: 30        .byte con_bg + $30
- - - - - 0x02284E 11:A83E: A0        .byte con_animation + $A0
- - - - - 0x02284F 11:A83F: C5        .byte con_cloud + $C5
- - - - - 0x022850 11:A840: F2        .byte con_jmp
- - - - - 0x022851 11:A841: 7B AA     .word loc_AA7B

bra_case_A843_03_jitou_из_куними:
- - - - - 0x022853 11:A843: F7        .byte con_F7, $44
- - - - - 0x022855 11:A845: 78        .byte con_pause + $78
- - - - - 0x022856 11:A846: 30        .byte con_bg + $30
- - - - - 0x022857 11:A847: AA        .byte con_animation + $AA
- - - - - 0x022858 11:A848: C5        .byte con_cloud + $C5
- - - - - 0x022859 11:A849: F2        .byte con_jmp
- - - - - 0x02285A 11:A84A: 7B AA     .word loc_AA7B

bra_case_A84C_04_napoleon:
- - - - - 0x02285C 11:A84C: F7        .byte con_F7, $44
- - - - - 0x02285E 11:A84E: 40        .byte con_pause + $40
- - - - - 0x02285F 11:A84F: 30        .byte con_bg + $30
- - - - - 0x022860 11:A850: B4        .byte con_animation + $B4
- - - - - 0x022861 11:A851: C6        .byte con_cloud + $C6
- - - - - 0x022862 11:A852: F2        .byte con_jmp
- - - - - 0x022863 11:A853: 7B AA     .word loc_AA7B

bra_case_A855_05_игрок_без_рожи:
- - - - - 0x022865 11:A855: F2        .byte con_jmp
- - - - - 0x022866 11:A856: 7E AA     .word loc_AA7E

bra_long_case_A858_03_vanishing_feint:
- D - I - 0x022868 11:A858: FA        .byte con_jsr
- D - I - 0x022869 11:A859: 6C A8     .word sub_A86C
- D - I - 0x02286B 11:A85B: F7        .byte con_F7, $02
- D - I - 0x02286D 11:A85D: 3C        .byte con_pause + $3C
- D - I - 0x02286E 11:A85E: 23        .byte con_bg + $23
- D - I - 0x02286F 11:A85F: F0        .byte con_animation + con_skip
- D - I - 0x022870 11:A860: 00        .byte con_cloud + con_clear
- D - I - 0x022871 11:A861: F7        .byte con_F7, $02
- D - I - 0x022873 11:A863: F9        .byte con_soundID_delay, $11, $02
- D - I - 0x022876 11:A866: 46        .byte con_pause + $46
- D - I - 0x022877 11:A867: F0        .byte con_bg + con_skip
- D - I - 0x022878 11:A868: D1        .byte con_animation + $D1
- D - I - 0x022879 11:A869: 45        .byte con_cloud + $45
- D - I - 0x02287A 11:A86A: F6        .byte con_mirror_toggle
- D - I - 0x02287B 11:A86B: FB        .byte con_rts

sub_A86C:
- D - I - 0x02287C 11:A86C: F7        .byte con_F7, $02
- D - I - 0x02287E 11:A86E: F9        .byte con_soundID_delay, $0C, $0D
- D - I - 0x022881 11:A871: 10        .byte con_pause + $10
- D - I - 0x022882 11:A872: 23        .byte con_bg + $23
- D - I - 0x022883 11:A873: DD        .byte con_animation + $DD
- D - I - 0x022884 11:A874: 00        .byte con_cloud + con_clear
- D - I - 0x022885 11:A875: F7        .byte con_F7, $24
- D - I - 0x022887 11:A877: 46        .byte con_pause + $46
- D - I - 0x022888 11:A878: 6B        .byte con_bg + $6B
- D - I - 0x022889 11:A879: F0        .byte con_animation + con_skip
- D - I - 0x02288A 11:A87A: 49        .byte con_cloud + $49
- D - I - 0x02288B 11:A87B: F7        .byte con_F7, $14
- D - I - 0x02288D 11:A87D: F9        .byte con_soundID_delay, $0D, $02
- D - I - 0x022890 11:A880: 1E        .byte con_pause + $1E
- D - I - 0x022891 11:A881: F0        .byte con_bg + con_skip
- D - I - 0x022892 11:A882: 00        .byte con_animation + $00
- D - I - 0x022893 11:A883: F0        .byte con_cloud + con_skip
- D - I - 0x022894 11:A884: FB        .byte con_rts

sub_A885:
- D - I - 0x022895 11:A885: F7        .byte con_F7, $44
- D - I - 0x022897 11:A887: 40        .byte con_pause + $40
- D - I - 0x022898 11:A888: 30        .byte con_bg + $30
- D - I - 0x022899 11:A889: A9        .byte con_animation + $A9
- D - I - 0x02289A 11:A88A: C7        .byte con_cloud + $C7
- D - I - 0x02289B 11:A88B: FA        .byte con_jsr
- D - I - 0x02289C 11:A88C: C7 BB     .word sub_BBC7_очистка
- D - I - 0x02289E 11:A88E: FB        .byte con_rts

sub_A88F:
- D - I - 0x02289F 11:A88F: F7        .byte con_F7, $44
- D - I - 0x0228A1 11:A891: 40        .byte con_pause + $40
- D - I - 0x0228A2 11:A892: 30        .byte con_bg + $30
- D - I - 0x0228A3 11:A893: BB        .byte con_animation + $BB
- D - I - 0x0228A4 11:A894: C7        .byte con_cloud + $C7
- D - I - 0x0228A5 11:A895: FA        .byte con_jsr
- D - I - 0x0228A6 11:A896: C7 BB     .word sub_BBC7_очистка
- D - I - 0x0228A8 11:A898: FB        .byte con_rts

bra_long_case_A899_04_clone_dribble:
- D - I - 0x0228A9 11:A899: F3        .byte con_branch, $BB     ; проверка на carlosа
- D - I - 0x0228AB 11:A89B: 02        .byte bra_case_A89D_00_это_carlos - *
- - - - - 0x0228AC 11:A89C: 1F        .byte bra_case_A8BB_01_это_не_carlos - *
bra_case_A89D_00_это_carlos:
- D - I - 0x0228AD 11:A89D: FA        .byte con_jsr
- D - I - 0x0228AE 11:A89E: 85 A8     .word sub_A885
loc_A8A0:
- D - I - 0x0228B0 11:A8A0: FA        .byte con_jsr
- D - I - 0x0228B1 11:A8A1: AB A8     .word sub_A8AB
- D - I - 0x0228B3 11:A8A3: F7        .byte con_F7, $02
- D - I - 0x0228B5 11:A8A5: 46        .byte con_pause + $46
- D - I - 0x0228B6 11:A8A6: F0        .byte con_bg + con_skip
- D - I - 0x0228B7 11:A8A7: F0        .byte con_animation + con_skip
- D - I - 0x0228B8 11:A8A8: 45        .byte con_cloud + $45
- D - I - 0x0228B9 11:A8A9: F6        .byte con_mirror_toggle
- D - I - 0x0228BA 11:A8AA: FB        .byte con_rts

sub_A8AB:
- D - I - 0x0228BB 11:A8AB: F7        .byte con_F7, $02
- D - I - 0x0228BD 11:A8AD: F9        .byte con_soundID_delay, $1F, $0D
- D - I - 0x0228C0 11:A8B0: 12        .byte con_pause + $12
- D - I - 0x0228C1 11:A8B1: 23        .byte con_bg + $23
- D - I - 0x0228C2 11:A8B2: DD        .byte con_animation + $DD
- D - I - 0x0228C3 11:A8B3: 49        .byte con_cloud + $49
- D - I - 0x0228C4 11:A8B4: F7        .byte con_F7, $24
- D - I - 0x0228C6 11:A8B6: 48        .byte con_pause + $48
- D - I - 0x0228C7 11:A8B7: 6B        .byte con_bg + $6B
- D - I - 0x0228C8 11:A8B8: F0        .byte con_animation + con_skip
- D - I - 0x0228C9 11:A8B9: F0        .byte con_cloud + con_skip
- D - I - 0x0228CA 11:A8BA: FB        .byte con_rts

bra_case_A8BB_01_это_не_carlos:
- - - - - 0x0228CB 11:A8BB: FA        .byte con_jsr
- - - - - 0x0228CC 11:A8BC: 8F A8     .word sub_A88F
- - - - - 0x0228CE 11:A8BE: F2        .byte con_jmp
- - - - - 0x0228CF 11:A8BF: A0 A8     .word loc_A8A0
bra_long_case_A8C1_05_high_speed_dribble:
- D - I - 0x0228D1 11:A8C1: FA        .byte con_jsr
- D - I - 0x0228D2 11:A8C2: D0 A8     .word sub_A8D0
- D - I - 0x0228D4 11:A8C4: F7        .byte con_F7, $0D
- D - I - 0x0228D6 11:A8C6: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x0228D9 11:A8C9: 1E        .byte con_pause + $1E
- D - I - 0x0228DA 11:A8CA: 47        .byte con_bg + $47
- D - I - 0x0228DB 11:A8CB: D1        .byte con_animation + $D1
- D - I - 0x0228DC 11:A8CC: 45        .byte con_cloud + $45
- D - I - 0x0228DD 11:A8CD: F2        .byte con_jmp
- D - I - 0x0228DE 11:A8CE: EF AA     .word loc_AAEF

sub_A8D0:
- D - I - 0x0228E0 11:A8D0: F7        .byte con_F7, $0D
- D - I - 0x0228E2 11:A8D2: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x0228E5 11:A8D5: 28        .byte con_pause + $28
- D - I - 0x0228E6 11:A8D6: 47        .byte con_bg + $47
- D - I - 0x0228E7 11:A8D7: D0        .byte con_animation + $D0
- D - I - 0x0228E8 11:A8D8: 49        .byte con_cloud + $49
- D - I - 0x0228E9 11:A8D9: F6        .byte con_mirror_toggle
- D - I - 0x0228EA 11:A8DA: F7        .byte con_F7, $0D
- D - I - 0x0228EC 11:A8DC: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x0228EF 11:A8DF: 28        .byte con_pause + $28
- D - I - 0x0228F0 11:A8E0: 47        .byte con_bg + $47
- D - I - 0x0228F1 11:A8E1: D0        .byte con_animation + $D0
- D - I - 0x0228F2 11:A8E2: 00        .byte con_cloud + con_clear
- D - I - 0x0228F3 11:A8E3: F6        .byte con_mirror_toggle
- D - I - 0x0228F4 11:A8E4: FB        .byte con_rts

sub_A8E5:
- D - I - 0x0228F5 11:A8E5: F7        .byte con_F7, $44
- D - I - 0x0228F7 11:A8E7: 80        .byte con_pause + $80
- D - I - 0x0228F8 11:A8E8: 30        .byte con_bg + $30
- D - I - 0x0228F9 11:A8E9: B3        .byte con_animation + $B3
- D - I - 0x0228FA 11:A8EA: C8        .byte con_cloud + $C8
loc_A8EB:
- D - I - 0x0228FB 11:A8EB: F6        .byte con_mirror_toggle
- D - I - 0x0228FC 11:A8EC: F7        .byte con_F7, $14
- D - I - 0x0228FE 11:A8EE: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022901 11:A8F1: 17        .byte con_pause + $17
- D - I - 0x022902 11:A8F2: 22        .byte con_bg + $22
- D - I - 0x022903 11:A8F3: D1        .byte con_animation + $D1
- D - I - 0x022904 11:A8F4: C9        .byte con_cloud + $C9
- D - I - 0x022905 11:A8F5: F7        .byte con_F7, $02
- D - I - 0x022907 11:A8F7: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x02290A 11:A8FA: 17        .byte con_pause + $17
- D - I - 0x02290B 11:A8FB: F0        .byte con_bg + con_skip
- D - I - 0x02290C 11:A8FC: D2        .byte con_animation + $D2
- D - I - 0x02290D 11:A8FD: F0        .byte con_cloud + con_skip
- D - I - 0x02290E 11:A8FE: F7        .byte con_F7, $02
- D - I - 0x022910 11:A900: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022913 11:A903: 17        .byte con_pause + $17
- D - I - 0x022914 11:A904: F0        .byte con_bg + con_skip
- D - I - 0x022915 11:A905: D1        .byte con_animation + $D1
- D - I - 0x022916 11:A906: F0        .byte con_cloud + con_skip
- D - I - 0x022917 11:A907: FB        .byte con_rts

sub_A908:
- - - - - 0x022918 11:A908: F7        .byte con_F7, $44
- - - - - 0x02291A 11:A90A: 80        .byte con_pause + $80
- - - - - 0x02291B 11:A90B: 30        .byte con_bg + $30
- - - - - 0x02291C 11:A90C: B9        .byte con_animation + $B9
- - - - - 0x02291D 11:A90D: C8        .byte con_cloud + $C8
- - - - - 0x02291E 11:A90E: F2        .byte con_jmp
- - - - - 0x02291F 11:A90F: EB A8     .word loc_A8EB

bra_long_case_A911_06_hedgehog_dribble:
- - - - - 0x022921 11:A911: F3        .byte con_branch, $BA     ; проверка на kaltzа
- - - - - 0x022923 11:A913: 02        .byte bra_case_A915_00_это_kaltz - *
- - - - - 0x022924 11:A914: 1C        .byte bra_case_A930_01_это_не_kaltz - *

bra_case_A915_00_это_kaltz:
- - - - - 0x022925 11:A915: FA        .byte con_jsr
- - - - - 0x022926 11:A916: E5 A8     .word sub_A8E5
loc_A918:
- - - - - 0x022928 11:A918: FA        .byte con_jsr
- - - - - 0x022929 11:A919: C7 BB     .word sub_BBC7_очистка
- - - - - 0x02292B 11:A91B: F7        .byte con_F7, $02
- - - - - 0x02292D 11:A91D: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022930 11:A920: 17        .byte con_pause + $17
- - - - - 0x022931 11:A921: F0        .byte con_bg + con_skip
- - - - - 0x022932 11:A922: D2        .byte con_animation + $D2
- - - - - 0x022933 11:A923: 00        .byte con_cloud + con_clear
- - - - - 0x022934 11:A924: F7        .byte con_F7, $02
- - - - - 0x022936 11:A926: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022939 11:A929: 17        .byte con_pause + $17
- - - - - 0x02293A 11:A92A: F0        .byte con_bg + con_skip
- - - - - 0x02293B 11:A92B: D1        .byte con_animation + $D1
- - - - - 0x02293C 11:A92C: 45        .byte con_cloud + $45
- - - - - 0x02293D 11:A92D: F2        .byte con_jmp
- - - - - 0x02293E 11:A92E: 18 AB     .word loc_AB18

bra_case_A930_01_это_не_kaltz:
- - - - - 0x022940 11:A930: FA        .byte con_jsr
- - - - - 0x022941 11:A931: 08 A9     .word sub_A908
- - - - - 0x022943 11:A933: F2        .byte con_jmp
- - - - - 0x022944 11:A934: 18 A9     .word loc_A918

sub_A936_сообщение_игрока_при_нападении:
- D - I - 0x022946 11:A936: F3        .byte con_branch, $A9
- D - I - 0x022948 11:A938: 22        .byte bra_case_A95A_00_игрок_без_рожи - *
- D - I - 0x022949 11:A939: 22        .byte bra_case_A95B_01_tsubasa - *
- D - I - 0x02294A 11:A93A: 28        .byte bra_case_A962_02_misaki - *
- - - - - 0x02294B 11:A93B: 2E        .byte bra_case_A969_03_misaki - *
- D - I - 0x02294C 11:A93C: 34        .byte bra_case_A970_04_hyuga - *
- - - - - 0x02294D 11:A93D: 3A        .byte bra_case_A977_05_hyuga - *
- D - I - 0x02294E 11:A93E: 40        .byte bra_case_A97E_06_misugi - *
- - - - - 0x02294F 11:A93F: 53        .byte bra_case_A992_07_misugi - *
- D - I - 0x022950 11:A940: 59        .byte bra_case_A999_08_matsuyama - *
- - - - - 0x022951 11:A941: 5F        .byte bra_case_A9A0_09_matsuyama - *
- D - I - 0x022952 11:A942: 65        .byte bra_case_A9A7_0A_ishizaki - *
- - - - - 0x022953 11:A943: 6B        .byte bra_case_A9AE_0B_ishizaki - *
- D - I - 0x022954 11:A944: 71        .byte bra_case_A9B5_0C_souda - *
- - - - - 0x022955 11:A945: 77        .byte bra_case_A9BC_0D_souda - *
- D - I - 0x022956 11:A946: 7D        .byte bra_case_A9C3_0E_jitou - *
- D - I - 0x022957 11:A947: 83        .byte bra_case_A9CA_0F_jitou - *
- D - I - 0x022958 11:A948: 89        .byte bra_case_A9D1_10_masao_kazuo - *
- - - - - 0x022959 11:A949: 8F        .byte bra_case_A9D8_11_masao_kazuo - *
- - - - - 0x02295A 11:A94A: 95        .byte bra_case_A9DF_12_nitta - *
- - - - - 0x02295B 11:A94B: 9B        .byte bra_case_A9E6_13_nitta - *
- - - - - 0x02295C 11:A94C: A1        .byte bra_case_A9ED_14_sawada - *
- - - - - 0x02295D 11:A94D: A7        .byte bra_case_A9F4_15_sawada - *
- - - - - 0x02295E 11:A94E: AD        .byte bra_case_A9FB_16_coimbra - *
- - - - - 0x02295F 11:A94F: B3        .byte bra_case_AA02_17_carlos - *
- D - I - 0x022960 11:A950: B9        .byte bra_case_AA09_18_carlos - *
- D - I - 0x022961 11:A951: BF        .byte bra_case_AA10_19_schneider - *
- - - - - 0x022962 11:A952: C5        .byte bra_case_AA17_1A_kaltz - *
- D - I - 0x022963 11:A953: CB        .byte bra_case_AA1E_1B_schester - *
- D - I - 0x022964 11:A954: D1        .byte bra_case_AA25_1C_diaz - *
- - - - - 0x022965 11:A955: D7        .byte bra_case_AA2C_1D_pascal - *
- D - I - 0x022966 11:A956: DD        .byte bra_case_AA33_1E_pierre - *
- - - - - 0x022967 11:A957: E3        .byte bra_case_AA3A_1F_napoleon - *
- - - - - 0x022968 11:A958: E9        .byte bra_case_AA41_20_victorino - *
- D - I - 0x022969 11:A959: EF        .byte bra_case_AA48_21_kaltz - *

bra_case_A95A_00_игрок_без_рожи:
- D - I - 0x02296A 11:A95A: FB        .byte con_rts

bra_case_A95B_01_tsubasa:
- D - I - 0x02296B 11:A95B: 3C        .byte con_pause + $3C
- D - I - 0x02296C 11:A95C: 30        .byte con_bg + $30
- D - I - 0x02296D 11:A95D: 91        .byte con_animation + $91
- D - I - 0x02296E 11:A95E: 98        .byte con_cloud + $98
- D - I - 0x02296F 11:A95F: F2        .byte con_jmp
- D - I - 0x022970 11:A960: C7 BB     .word loc_BBC7_очистка

bra_case_A962_02_misaki:
- D - I - 0x022972 11:A962: 3C        .byte con_pause + $3C
- D - I - 0x022973 11:A963: 30        .byte con_bg + $30
- D - I - 0x022974 11:A964: 96        .byte con_animation + $96
- D - I - 0x022975 11:A965: 98        .byte con_cloud + $98
- D - I - 0x022976 11:A966: F2        .byte con_jmp
- D - I - 0x022977 11:A967: C7 BB     .word loc_BBC7_очистка

bra_case_A969_03_misaki:
- - - - - 0x022979 11:A969: 3C        .byte con_pause + $3C
- - - - - 0x02297A 11:A96A: 30        .byte con_bg + $30
- - - - - 0x02297B 11:A96B: 97        .byte con_animation + $97
- - - - - 0x02297C 11:A96C: 98        .byte con_cloud + $98
- - - - - 0x02297D 11:A96D: F2        .byte con_jmp
- - - - - 0x02297E 11:A96E: C7 BB     .word loc_BBC7_очистка

bra_case_A970_04_hyuga:
- D - I - 0x022980 11:A970: 3C        .byte con_pause + $3C
- D - I - 0x022981 11:A971: 31        .byte con_bg + $31
- D - I - 0x022982 11:A972: 9E        .byte con_animation + $9E
- D - I - 0x022983 11:A973: 9A        .byte con_cloud + $9A
- D - I - 0x022984 11:A974: F2        .byte con_jmp
- D - I - 0x022985 11:A975: C7 BB     .word loc_BBC7_очистка

bra_case_A977_05_hyuga:
- - - - - 0x022987 11:A977: 3C        .byte con_pause + $3C
- - - - - 0x022988 11:A978: 31        .byte con_bg + $31
- - - - - 0x022989 11:A979: B0        .byte con_animation + $B0
- - - - - 0x02298A 11:A97A: 9A        .byte con_cloud + $9A
- - - - - 0x02298B 11:A97B: F2        .byte con_jmp
- - - - - 0x02298C 11:A97C: C7 BB     .word loc_BBC7_очистка

bra_case_A97E_06_misugi:
- D - I - 0x02298E 11:A97E: F3        .byte con_branch, $AB     ; проверка на 100 хп
- D - I - 0x022990 11:A980: 02        .byte bra_case_A982_00_есть_100_хп - *
- D - I - 0x022991 11:A981: 08        .byte bra_case_A989_01_меньше_100_хп - *

bra_case_A982_00_есть_100_хп:
- D - I - 0x022992 11:A982: 3C        .byte con_pause + $3C
- D - I - 0x022993 11:A983: 30        .byte con_bg + $30
- D - I - 0x022994 11:A984: A3        .byte con_animation + $A3
- D - I - 0x022995 11:A985: 98        .byte con_cloud + $98
- D - I - 0x022996 11:A986: F2        .byte con_jmp
- D - I - 0x022997 11:A987: C7 BB     .word loc_BBC7_очистка

loc_A989_меньше_100_хп:
bra_case_A989_01_меньше_100_хп:
- D - I - 0x022999 11:A989: F7        .byte con_F7, $35
- D - I - 0x02299B 11:A98B: 5A        .byte con_pause + $5A
- D - I - 0x02299C 11:A98C: 30        .byte con_bg + $30
- D - I - 0x02299D 11:A98D: A3        .byte con_animation + $A3
- D - I - 0x02299E 11:A98E: 4F        .byte con_cloud + $4F
- D - I - 0x02299F 11:A98F: F2        .byte con_jmp
- D - I - 0x0229A0 11:A990: C7 BB     .word loc_BBC7_очистка

bra_case_A992_07_misugi:
- - - - - 0x0229A2 11:A992: 3C        .byte con_pause + $3C
- - - - - 0x0229A3 11:A993: 30        .byte con_bg + $30
- - - - - 0x0229A4 11:A994: AE        .byte con_animation + $AE
- - - - - 0x0229A5 11:A995: 98        .byte con_cloud + $98
- - - - - 0x0229A6 11:A996: F2        .byte con_jmp
- - - - - 0x0229A7 11:A997: C7 BB     .word loc_BBC7_очистка

bra_case_A999_08_matsuyama:
- D - I - 0x0229A9 11:A999: 3C        .byte con_pause + $3C
- D - I - 0x0229AA 11:A99A: 30        .byte con_bg + $30
- D - I - 0x0229AB 11:A99B: A1        .byte con_animation + $A1
- D - I - 0x0229AC 11:A99C: 99        .byte con_cloud + $99
- D - I - 0x0229AD 11:A99D: F2        .byte con_jmp
- D - I - 0x0229AE 11:A99E: C7 BB     .word loc_BBC7_очистка

bra_case_A9A0_09_matsuyama:
- - - - - 0x0229B0 11:A9A0: 3C        .byte con_pause + $3C
- - - - - 0x0229B1 11:A9A1: 30        .byte con_bg + $30
- - - - - 0x0229B2 11:A9A2: AF        .byte con_animation + $AF
- - - - - 0x0229B3 11:A9A3: 99        .byte con_cloud + $99
- - - - - 0x0229B4 11:A9A4: F2        .byte con_jmp
- - - - - 0x0229B5 11:A9A5: C7 BB     .word loc_BBC7_очистка

bra_case_A9A7_0A_ishizaki:
- D - I - 0x0229B7 11:A9A7: 3C        .byte con_pause + $3C
- D - I - 0x0229B8 11:A9A8: 30        .byte con_bg + $30
- D - I - 0x0229B9 11:A9A9: 98        .byte con_animation + $98
- D - I - 0x0229BA 11:A9AA: 99        .byte con_cloud + $99
- D - I - 0x0229BB 11:A9AB: F2        .byte con_jmp
- D - I - 0x0229BC 11:A9AC: C7 BB     .word loc_BBC7_очистка

bra_case_A9AE_0B_ishizaki:
- - - - - 0x0229BE 11:A9AE: 3C        .byte con_pause + $3C
- - - - - 0x0229BF 11:A9AF: 30        .byte con_bg + $30
- - - - - 0x0229C0 11:A9B0: 99        .byte con_animation + $99
- - - - - 0x0229C1 11:A9B1: 99        .byte con_cloud + $99
- - - - - 0x0229C2 11:A9B2: F2        .byte con_jmp
- - - - - 0x0229C3 11:A9B3: C7 BB     .word loc_BBC7_очистка

bra_case_A9B5_0C_souda:
- D - I - 0x0229C5 11:A9B5: 3C        .byte con_pause + $3C
- D - I - 0x0229C6 11:A9B6: 30        .byte con_bg + $30
- D - I - 0x0229C7 11:A9B7: 9F        .byte con_animation + $9F
- D - I - 0x0229C8 11:A9B8: 99        .byte con_cloud + $99
- D - I - 0x0229C9 11:A9B9: F2        .byte con_jmp
- D - I - 0x0229CA 11:A9BA: C7 BB     .word loc_BBC7_очистка

bra_case_A9BC_0D_souda:
- - - - - 0x0229CC 11:A9BC: 3C        .byte con_pause + $3C
- - - - - 0x0229CD 11:A9BD: 30        .byte con_bg + $30
- - - - - 0x0229CE 11:A9BE: AD        .byte con_animation + $AD
- - - - - 0x0229CF 11:A9BF: 99        .byte con_cloud + $99
- - - - - 0x0229D0 11:A9C0: F2        .byte con_jmp
- - - - - 0x0229D1 11:A9C1: C7 BB     .word loc_BBC7_очистка

bra_case_A9C3_0E_jitou:
- D - I - 0x0229D3 11:A9C3: 3C        .byte con_pause + $3C
- D - I - 0x0229D4 11:A9C4: 30        .byte con_bg + $30
- D - I - 0x0229D5 11:A9C5: A0        .byte con_animation + $A0
- D - I - 0x0229D6 11:A9C6: E5        .byte con_cloud + $E5
- D - I - 0x0229D7 11:A9C7: F2        .byte con_jmp
- D - I - 0x0229D8 11:A9C8: C7 BB     .word loc_BBC7_очистка

bra_case_A9CA_0F_jitou:
- D - I - 0x0229DA 11:A9CA: 3C        .byte con_pause + $3C
- D - I - 0x0229DB 11:A9CB: 30        .byte con_bg + $30
- D - I - 0x0229DC 11:A9CC: AA        .byte con_animation + $AA
- D - I - 0x0229DD 11:A9CD: E5        .byte con_cloud + $E5
- D - I - 0x0229DE 11:A9CE: F2        .byte con_jmp
- D - I - 0x0229DF 11:A9CF: C7 BB     .word loc_BBC7_очистка

bra_case_A9D1_10_masao_kazuo:
- D - I - 0x0229E1 11:A9D1: 3C        .byte con_pause + $3C
- D - I - 0x0229E2 11:A9D2: 30        .byte con_bg + $30
- D - I - 0x0229E3 11:A9D3: 9C        .byte con_animation + $9C
- D - I - 0x0229E4 11:A9D4: 99        .byte con_cloud + $99
- D - I - 0x0229E5 11:A9D5: F2        .byte con_jmp
- D - I - 0x0229E6 11:A9D6: C7 BB     .word loc_BBC7_очистка

bra_case_A9D8_11_masao_kazuo:
- - - - - 0x0229E8 11:A9D8: 3C        .byte con_pause + $3C
- - - - - 0x0229E9 11:A9D9: 30        .byte con_bg + $30
- - - - - 0x0229EA 11:A9DA: AB        .byte con_animation + $AB
- - - - - 0x0229EB 11:A9DB: 99        .byte con_cloud + $99
- - - - - 0x0229EC 11:A9DC: F2        .byte con_jmp
- - - - - 0x0229ED 11:A9DD: C7 BB     .word loc_BBC7_очистка

bra_case_A9DF_12_nitta:
- - - - - 0x0229EF 11:A9DF: 3C        .byte con_pause + $3C
- - - - - 0x0229F0 11:A9E0: 30        .byte con_bg + $30
- - - - - 0x0229F1 11:A9E1: 9A        .byte con_animation + $9A
- - - - - 0x0229F2 11:A9E2: 98        .byte con_cloud + $98
- - - - - 0x0229F3 11:A9E3: F2        .byte con_jmp
- - - - - 0x0229F4 11:A9E4: C7 BB     .word loc_BBC7_очистка

bra_case_A9E6_13_nitta:
- - - - - 0x0229F6 11:A9E6: 3C        .byte con_pause + $3C
- - - - - 0x0229F7 11:A9E7: 30        .byte con_bg + $30
- - - - - 0x0229F8 11:A9E8: 9B        .byte con_animation + $9B
- - - - - 0x0229F9 11:A9E9: 98        .byte con_cloud + $98
- - - - - 0x0229FA 11:A9EA: F2        .byte con_jmp
- - - - - 0x0229FB 11:A9EB: C7 BB     .word loc_BBC7_очистка

bra_case_A9ED_14_sawada:
- - - - - 0x0229FD 11:A9ED: 3C        .byte con_pause + $3C
- - - - - 0x0229FE 11:A9EE: 30        .byte con_bg + $30
- - - - - 0x0229FF 11:A9EF: A2        .byte con_animation + $A2
- - - - - 0x022A00 11:A9F0: 98        .byte con_cloud + $98
- - - - - 0x022A01 11:A9F1: F2        .byte con_jmp
- - - - - 0x022A02 11:A9F2: C7 BB     .word loc_BBC7_очистка

bra_case_A9F4_15_sawada:
- - - - - 0x022A04 11:A9F4: 3C        .byte con_pause + $3C
- - - - - 0x022A05 11:A9F5: 30        .byte con_bg + $30
- - - - - 0x022A06 11:A9F6: B1        .byte con_animation + $B1
- - - - - 0x022A07 11:A9F7: 98        .byte con_cloud + $98
- - - - - 0x022A08 11:A9F8: F2        .byte con_jmp
- - - - - 0x022A09 11:A9F9: C7 BB     .word loc_BBC7_очистка

bra_case_A9FB_16_coimbra:
- - - - - 0x022A0B 11:A9FB: 3C        .byte con_pause + $3C
- - - - - 0x022A0C 11:A9FC: 30        .byte con_bg + $30
- - - - - 0x022A0D 11:A9FD: BC        .byte con_animation + $BC
- - - - - 0x022A0E 11:A9FE: 9A        .byte con_cloud + $9A
- - - - - 0x022A0F 11:A9FF: F2        .byte con_jmp
- - - - - 0x022A10 11:AA00: C7 BB     .word loc_BBC7_очистка

bra_case_AA02_17_carlos:
- - - - - 0x022A12 11:AA02: 3C        .byte con_pause + $3C
- - - - - 0x022A13 11:AA03: 30        .byte con_bg + $30
- - - - - 0x022A14 11:AA04: A9        .byte con_animation + $A9
- - - - - 0x022A15 11:AA05: 99        .byte con_cloud + $99
- - - - - 0x022A16 11:AA06: F2        .byte con_jmp
- - - - - 0x022A17 11:AA07: C7 BB     .word loc_BBC7_очистка

bra_case_AA09_18_carlos:
- D - I - 0x022A19 11:AA09: 3C        .byte con_pause + $3C
- D - I - 0x022A1A 11:AA0A: 30        .byte con_bg + $30
- D - I - 0x022A1B 11:AA0B: BB        .byte con_animation + $BB
- D - I - 0x022A1C 11:AA0C: 99        .byte con_cloud + $99
- D - I - 0x022A1D 11:AA0D: F2        .byte con_jmp
- D - I - 0x022A1E 11:AA0E: C7 BB     .word loc_BBC7_очистка

bra_case_AA10_19_schneider:
- D - I - 0x022A20 11:AA10: 3C        .byte con_pause + $3C
- D - I - 0x022A21 11:AA11: 30        .byte con_bg + $30
- D - I - 0x022A22 11:AA12: B8        .byte con_animation + $B8
- D - I - 0x022A23 11:AA13: 9A        .byte con_cloud + $9A
- D - I - 0x022A24 11:AA14: F2        .byte con_jmp
- D - I - 0x022A25 11:AA15: C7 BB     .word loc_BBC7_очистка

bra_case_AA17_1A_kaltz:
- - - - - 0x022A27 11:AA17: 3C        .byte con_pause + $3C
- - - - - 0x022A28 11:AA18: 30        .byte con_bg + $30
- - - - - 0x022A29 11:AA19: B3        .byte con_animation + $B3
- - - - - 0x022A2A 11:AA1A: 99        .byte con_cloud + $99
- - - - - 0x022A2B 11:AA1B: F2        .byte con_jmp
- - - - - 0x022A2C 11:AA1C: C7 BB     .word loc_BBC7_очистка

bra_case_AA1E_1B_schester:
- D - I - 0x022A2E 11:AA1E: 3C        .byte con_pause + $3C
- D - I - 0x022A2F 11:AA1F: 30        .byte con_bg + $30
- D - I - 0x022A30 11:AA20: BA        .byte con_animation + $BA
- D - I - 0x022A31 11:AA21: 98        .byte con_cloud + $98
- D - I - 0x022A32 11:AA22: F2        .byte con_jmp
- D - I - 0x022A33 11:AA23: C7 BB     .word loc_BBC7_очистка

bra_case_AA25_1C_diaz:
- D - I - 0x022A35 11:AA25: 3C        .byte con_pause + $3C
- D - I - 0x022A36 11:AA26: 30        .byte con_bg + $30
- D - I - 0x022A37 11:AA27: B7        .byte con_animation + $B7
- D - I - 0x022A38 11:AA28: 98        .byte con_cloud + $98
- D - I - 0x022A39 11:AA29: F2        .byte con_jmp
- D - I - 0x022A3A 11:AA2A: C7 BB     .word loc_BBC7_очистка

bra_case_AA2C_1D_pascal:
- - - - - 0x022A3C 11:AA2C: 3C        .byte con_pause + $3C
- - - - - 0x022A3D 11:AA2D: 30        .byte con_bg + $30
- - - - - 0x022A3E 11:AA2E: B6        .byte con_animation + $B6
- - - - - 0x022A3F 11:AA2F: 99        .byte con_cloud + $99
- - - - - 0x022A40 11:AA30: F2        .byte con_jmp
- - - - - 0x022A41 11:AA31: C7 BB     .word loc_BBC7_очистка

bra_case_AA33_1E_pierre:
- D - I - 0x022A43 11:AA33: 3C        .byte con_pause + $3C
- D - I - 0x022A44 11:AA34: 30        .byte con_bg + $30
- D - I - 0x022A45 11:AA35: B5        .byte con_animation + $B5
- D - I - 0x022A46 11:AA36: 98        .byte con_cloud + $98
- D - I - 0x022A47 11:AA37: F2        .byte con_jmp
- D - I - 0x022A48 11:AA38: C7 BB     .word loc_BBC7_очистка

bra_case_AA3A_1F_napoleon:
- - - - - 0x022A4A 11:AA3A: 3C        .byte con_pause + $3C
- - - - - 0x022A4B 11:AA3B: 30        .byte con_bg + $30
- - - - - 0x022A4C 11:AA3C: B4        .byte con_animation + $B4
- - - - - 0x022A4D 11:AA3D: 9A        .byte con_cloud + $9A
- - - - - 0x022A4E 11:AA3E: F2        .byte con_jmp
- - - - - 0x022A4F 11:AA3F: C7 BB     .word loc_BBC7_очистка

bra_case_AA41_20_victorino:
- - - - - 0x022A51 11:AA41: 3C        .byte con_pause + $3C
- - - - - 0x022A52 11:AA42: 30        .byte con_bg + $30
- - - - - 0x022A53 11:AA43: B2        .byte con_animation + $B2
- - - - - 0x022A54 11:AA44: 9A        .byte con_cloud + $9A
- - - - - 0x022A55 11:AA45: F2        .byte con_jmp
- - - - - 0x022A56 11:AA46: C7 BB     .word loc_BBC7_очистка

bra_case_AA48_21_kaltz:
- D - I - 0x022A58 11:AA48: 3C        .byte con_pause + $3C
- D - I - 0x022A59 11:AA49: 30        .byte con_bg + $30
- D - I - 0x022A5A 11:AA4A: B9        .byte con_animation + $B9
- D - I - 0x022A5B 11:AA4B: 99        .byte con_cloud + $99
- D - I - 0x022A5C 11:AA4C: F2        .byte con_jmp
- D - I - 0x022A5D 11:AA4D: C7 BB     .word loc_BBC7_очистка

bra_long_case_AA4F_00_shoot:
bra_long_case_AA4F_00_dribble:
bra_long_case_AA4F_01_pass:
bra_long_case_AA4F_03_1_2_pass:
; легкая обводка
- D - I - 0x022A5F 11:AA4F: F6        .byte con_mirror_toggle
- D - I - 0x022A60 11:AA50: F7        .byte con_F7, $02
- D - I - 0x022A62 11:AA52: 14        .byte con_pause + $14
- D - I - 0x022A63 11:AA53: 22        .byte con_bg + $22
- D - I - 0x022A64 11:AA54: 60        .byte con_animation + $60
- D - I - 0x022A65 11:AA55: 46        .byte con_cloud + $46
- D - I - 0x022A66 11:AA56: F7        .byte con_F7, $33
- D - I - 0x022A68 11:AA58: F9        .byte con_soundID_delay, $68, $02
- D - I - 0x022A6B 11:AA5B: 14        .byte con_pause + $14
- D - I - 0x022A6C 11:AA5C: 6B        .byte con_bg + $6B
- D - I - 0x022A6D 11:AA5D: F0        .byte con_animation + con_skip
- D - I - 0x022A6E 11:AA5E: F0        .byte con_cloud + con_skip
- D - I - 0x022A6F 11:AA5F: F2        .byte con_jmp
- D - I - 0x022A70 11:AA60: FE A7     .word loc_A7FE



_scenario_AA62_6A:
bra_long_case_AA62_01_heel_lift:
- D - I - 0x022A72 11:AA62: FA        .byte con_jsr
- D - I - 0x022A73 11:AA63: 10 A8     .word sub_A810_анимация_heel_lift
- D - I - 0x022A75 11:AA65: F7        .byte con_F7, $02
- D - I - 0x022A77 11:AA67: 3C        .byte con_pause + $3C
- D - I - 0x022A78 11:AA68: 23        .byte con_bg + $23
- D - I - 0x022A79 11:AA69: E4        .byte con_animation + $E4
- D - I - 0x022A7A 11:AA6A: 46        .byte con_cloud + $46
- D - I - 0x022A7B 11:AA6B: F6        .byte con_mirror_toggle
- D - I - 0x022A7C 11:AA6C: FB        .byte con_rts

bra_long_case_AA6D_02_forcible_dribble:
- - - - - 0x022A7D 11:AA6D: F3        .byte con_branch, $C7     ; кто делает силовой дриблинг
- - - - - 0x022A7F 11:AA6F: 06        .byte bra_case_AA75_00_hyuga_из_японии - *
- - - - - 0x022A80 11:AA70: 23        .byte bra_case_AA93_01_hyuga_из_тохо - *
- - - - - 0x022A81 11:AA71: 2B        .byte bra_case_AA9C_02_jitou_из_японии - *
- - - - - 0x022A82 11:AA72: 33        .byte bra_case_AAA5_03_jitou_из_куними - *
- - - - - 0x022A83 11:AA73: 3B        .byte bra_case_AAAE_04_napoleon - *
- - - - - 0x022A84 11:AA74: 0A        .byte bra_case_AA7E_05_игрок_без_рожи - *

bra_case_AA75_00_hyuga_из_японии:
- - - - - 0x022A85 11:AA75: F7        .byte con_F7, $44
- - - - - 0x022A87 11:AA77: 40        .byte con_pause + $40
- - - - - 0x022A88 11:AA78: 31        .byte con_bg + $31
- - - - - 0x022A89 11:AA79: 9E        .byte con_animation + $9E
- - - - - 0x022A8A 11:AA7A: C4        .byte con_cloud + $C4
loc_AA7B:
- - - - - 0x022A8B 11:AA7B: FA        .byte con_jsr
- - - - - 0x022A8C 11:AA7C: C7 BB     .word sub_BBC7_очистка
loc_AA7E:
bra_case_AA7E_05_игрок_без_рожи:
- - - - - 0x022A8E 11:AA7E: FA        .byte con_jsr
- - - - - 0x022A8F 11:AA7F: 89 AA     .word sub_AA89
- - - - - 0x022A91 11:AA81: F7        .byte con_F7, $3A
- - - - - 0x022A93 11:AA83: 32        .byte con_pause + $32
- - - - - 0x022A94 11:AA84: F0        .byte con_bg + con_skip
- - - - - 0x022A95 11:AA85: F0        .byte con_animation + con_skip
- - - - - 0x022A96 11:AA86: 46        .byte con_cloud + $46
- - - - - 0x022A97 11:AA87: F6        .byte con_mirror_toggle
- - - - - 0x022A98 11:AA88: FB        .byte con_rts

sub_AA89:
- D - I - 0x022A99 11:AA89: F7        .byte con_F7, $3A
- D - I - 0x022A9B 11:AA8B: F9        .byte con_soundID_delay, $27, $02
- D - I - 0x022A9E 11:AA8E: 78        .byte con_pause + $78
- D - I - 0x022A9F 11:AA8F: 23        .byte con_bg + $23
- D - I - 0x022AA0 11:AA90: D0        .byte con_animation + $D0
- D - I - 0x022AA1 11:AA91: 49        .byte con_cloud + $49
- D - I - 0x022AA2 11:AA92: FB        .byte con_rts

bra_case_AA93_01_hyuga_из_тохо:
- - - - - 0x022AA3 11:AA93: F7        .byte con_F7, $44
- - - - - 0x022AA5 11:AA95: 40        .byte con_pause + $40
- - - - - 0x022AA6 11:AA96: 31        .byte con_bg + $31
- - - - - 0x022AA7 11:AA97: B0        .byte con_animation + $B0
- - - - - 0x022AA8 11:AA98: C4        .byte con_cloud + $C4
- - - - - 0x022AA9 11:AA99: F2        .byte con_jmp
- - - - - 0x022AAA 11:AA9A: 7B AA     .word loc_AA7B

bra_case_AA9C_02_jitou_из_японии:
- - - - - 0x022AAC 11:AA9C: F7        .byte con_F7, $44
- - - - - 0x022AAE 11:AA9E: 78        .byte con_pause + $78
- - - - - 0x022AAF 11:AA9F: 30        .byte con_bg + $30
- - - - - 0x022AB0 11:AAA0: A0        .byte con_animation + $A0
- - - - - 0x022AB1 11:AAA1: C5        .byte con_cloud + $C5
- - - - - 0x022AB2 11:AAA2: F2        .byte con_jmp
- - - - - 0x022AB3 11:AAA3: 7B AA     .word loc_AA7B

bra_case_AAA5_03_jitou_из_куними:
- - - - - 0x022AB5 11:AAA5: F7        .byte con_F7, $44
- - - - - 0x022AB7 11:AAA7: 78        .byte con_pause + $78
- - - - - 0x022AB8 11:AAA8: 30        .byte con_bg + $30
- - - - - 0x022AB9 11:AAA9: AA        .byte con_animation + $AA
- - - - - 0x022ABA 11:AAAA: C5        .byte con_cloud + $C5
- - - - - 0x022ABB 11:AAAB: F2        .byte con_jmp
- - - - - 0x022ABC 11:AAAC: 7B AA     .word loc_AA7B

bra_case_AAAE_04_napoleon:
- - - - - 0x022ABE 11:AAAE: F7        .byte con_F7, $44
- - - - - 0x022AC0 11:AAB0: 40        .byte con_pause + $40
- - - - - 0x022AC1 11:AAB1: 30        .byte con_bg + $30
- - - - - 0x022AC2 11:AAB2: B4        .byte con_animation + $B4
- - - - - 0x022AC3 11:AAB3: C6        .byte con_cloud + $C6
- - - - - 0x022AC4 11:AAB4: F2        .byte con_jmp
- - - - - 0x022AC5 11:AAB5: 7B AA     .word loc_AA7B

bra_long_case_AAB7_03_vanishing_feint:
- D - I - 0x022AC7 11:AAB7: FA        .byte con_jsr
- D - I - 0x022AC8 11:AAB8: 6C A8     .word sub_A86C
- D - I - 0x022ACA 11:AABA: F7        .byte con_F7, $02
- D - I - 0x022ACC 11:AABC: 3C        .byte con_pause + $3C
- D - I - 0x022ACD 11:AABD: 23        .byte con_bg + $23
- D - I - 0x022ACE 11:AABE: F0        .byte con_animation + con_skip
- D - I - 0x022ACF 11:AABF: 00        .byte con_cloud + con_clear
- D - I - 0x022AD0 11:AAC0: F9        .byte con_soundID_delay, $11, $02
- D - I - 0x022AD3 11:AAC3: F7        .byte con_F7, $02
- D - I - 0x022AD5 11:AAC5: 46        .byte con_pause + $46
- D - I - 0x022AD6 11:AAC6: F0        .byte con_bg + con_skip
- D - I - 0x022AD7 11:AAC7: D1        .byte con_animation + $D1
- D - I - 0x022AD8 11:AAC8: 46        .byte con_cloud + $46
- D - I - 0x022AD9 11:AAC9: F6        .byte con_mirror_toggle
- D - I - 0x022ADA 11:AACA: FB        .byte con_rts

bra_long_case_AACB_04_clone_dribble:
- D - I - 0x022ADB 11:AACB: F3        .byte con_branch, $BB     ; проверка на carlosа
- D - I - 0x022ADD 11:AACD: 02        .byte bra_case_AACF_00_это_carlos - *
- - - - - 0x022ADE 11:AACE: 0F        .byte bra_case_AADD_01_это_не_carlos - *

bra_case_AACF_00_это_carlos:
- D - I - 0x022ADF 11:AACF: FA        .byte con_jsr
- D - I - 0x022AE0 11:AAD0: 85 A8     .word sub_A885
loc_AAD2:
- D - I - 0x022AE2 11:AAD2: FA        .byte con_jsr
- D - I - 0x022AE3 11:AAD3: AB A8     .word sub_A8AB
- D - I - 0x022AE5 11:AAD5: F7        .byte con_F7, $02
- D - I - 0x022AE7 11:AAD7: 46        .byte con_pause + $46
- D - I - 0x022AE8 11:AAD8: F0        .byte con_bg + con_skip
- D - I - 0x022AE9 11:AAD9: F0        .byte con_animation + con_skip
- D - I - 0x022AEA 11:AADA: 46        .byte con_cloud + $46
- D - I - 0x022AEB 11:AADB: F6        .byte con_mirror_toggle
- D - I - 0x022AEC 11:AADC: FB        .byte con_rts

bra_case_AADD_01_это_не_carlos:
- - - - - 0x022AED 11:AADD: FA        .byte con_jsr
- - - - - 0x022AEE 11:AADE: 8F A8     .word sub_A88F
- - - - - 0x022AF0 11:AAE0: F2        .byte con_jmp
- - - - - 0x022AF1 11:AAE1: D2 AA     .word loc_AAD2

bra_long_case_AAE3_05_high_speed_dribble:
- D - I - 0x022AF3 11:AAE3: FA        .byte con_jsr
- D - I - 0x022AF4 11:AAE4: D0 A8     .word sub_A8D0
- D - I - 0x022AF6 11:AAE6: F7        .byte con_F7, $0D
- D - I - 0x022AF8 11:AAE8: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022AFB 11:AAEB: 1E        .byte con_pause + $1E
- D - I - 0x022AFC 11:AAEC: 47        .byte con_bg + $47
- D - I - 0x022AFD 11:AAED: D1        .byte con_animation + $D1
- D - I - 0x022AFE 11:AAEE: 46        .byte con_cloud + $46
loc_AAEF:
- D - I - 0x022AFF 11:AAEF: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022B02 11:AAF2: 1E        .byte con_pause + $1E
- D - I - 0x022B03 11:AAF3: F0        .byte con_bg + con_skip
- D - I - 0x022B04 11:AAF4: D2        .byte con_animation + $D2
- D - I - 0x022B05 11:AAF5: F0        .byte con_cloud + con_skip
- D - I - 0x022B06 11:AAF6: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022B09 11:AAF9: 1E        .byte con_pause + $1E
- D - I - 0x022B0A 11:AAFA: F0        .byte con_bg + con_skip
- D - I - 0x022B0B 11:AAFB: D1        .byte con_animation + $D1
- D - I - 0x022B0C 11:AAFC: F0        .byte con_cloud + con_skip
- D - I - 0x022B0D 11:AAFD: F6        .byte con_mirror_toggle
- D - I - 0x022B0E 11:AAFE: FB        .byte con_rts

bra_long_case_AAFF_06_hedgehog_dribble:
- - - - - 0x022B0F 11:AAFF: F3        .byte con_branch, $BA     ; проверка на kaltzа
- - - - - 0x022B11 11:AB01: 02        .byte bra_case_AB03_00_это_kaltz - *
- - - - - 0x022B12 11:AB02: 29        .byte bra_case_AB2B_01_это_не_kaltz - *

bra_case_AB03_00_это_kaltz:
- - - - - 0x022B13 11:AB03: FA        .byte con_jsr
- - - - - 0x022B14 11:AB04: E5 A8     .word sub_A8E5
loc_AB06:
- - - - - 0x022B16 11:AB06: F7        .byte con_F7, $02
- - - - - 0x022B18 11:AB08: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022B1B 11:AB0B: 17        .byte con_pause + $17
- - - - - 0x022B1C 11:AB0C: F0        .byte con_bg + con_skip
- - - - - 0x022B1D 11:AB0D: D2        .byte con_animation + $D2
- - - - - 0x022B1E 11:AB0E: 00        .byte con_cloud + con_clear
- - - - - 0x022B1F 11:AB0F: F7        .byte con_F7, $02
- - - - - 0x022B21 11:AB11: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022B24 11:AB14: 17        .byte con_pause + $17
- - - - - 0x022B25 11:AB15: F0        .byte con_bg + con_skip
- - - - - 0x022B26 11:AB16: D1        .byte con_animation + $D1
- - - - - 0x022B27 11:AB17: 46        .byte con_cloud + $46
loc_AB18:
- - - - - 0x022B28 11:AB18: F7        .byte con_F7, $02
- - - - - 0x022B2A 11:AB1A: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022B2D 11:AB1D: 17        .byte con_pause + $17
- - - - - 0x022B2E 11:AB1E: F0        .byte con_bg + con_skip
- - - - - 0x022B2F 11:AB1F: D2        .byte con_animation + $D2
- - - - - 0x022B30 11:AB20: F0        .byte con_cloud + con_skip
- - - - - 0x022B31 11:AB21: F7        .byte con_F7, $02
- - - - - 0x022B33 11:AB23: F9        .byte con_soundID_delay, $26, $02
- - - - - 0x022B36 11:AB26: 17        .byte con_pause + $17
- - - - - 0x022B37 11:AB27: F0        .byte con_bg + con_skip
- - - - - 0x022B38 11:AB28: D1        .byte con_animation + $D1
- - - - - 0x022B39 11:AB29: F0        .byte con_cloud + con_skip
- - - - - 0x022B3A 11:AB2A: FB        .byte con_rts

bra_case_AB2B_01_это_не_kaltz:
- - - - - 0x022B3B 11:AB2B: FA        .byte con_jsr
- - - - - 0x022B3C 11:AB2C: 08 A9     .word sub_A908
- - - - - 0x022B3E 11:AB2E: F2        .byte con_jmp
- - - - - 0x022B3F 11:AB2F: 06 AB     .word loc_AB06

sub_AB31:
bra_long_case_AB31_00___shot:
- D - I - 0x022B41 11:AB31: F5        .byte con_mirror_off
- D - I - 0x022B42 11:AB32: F9        .byte con_soundID_delay, $19, $02
- D - I - 0x022B45 11:AB35: 28        .byte con_pause + $28
- D - I - 0x022B46 11:AB36: 01        .byte con_bg + $01
- D - I - 0x022B47 11:AB37: 61        .byte con_animation + $61
- D - I - 0x022B48 11:AB38: 47        .byte con_cloud + $47
loc_AB39:
- D - I - 0x022B49 11:AB39: F7        .byte con_F7, $0B
- D - I - 0x022B4B 11:AB3B: F9        .byte con_soundID_delay, $12, $02
- D - I - 0x022B4E 11:AB3E: 14        .byte con_pause + $14
- D - I - 0x022B4F 11:AB3F: 10        .byte con_bg + $10
- D - I - 0x022B50 11:AB40: 62        .byte con_animation + $62
- D - I - 0x022B51 11:AB41: F0        .byte con_cloud + con_skip
loc_AB42:
- D - I - 0x022B52 11:AB42: F7        .byte con_F7, $02
- D - I - 0x022B54 11:AB44: F9        .byte con_soundID_delay, $03, $02
- D - I - 0x022B57 11:AB47: 22        .byte con_pause + $22
- D - I - 0x022B58 11:AB48: 25        .byte con_bg + $25
- D - I - 0x022B59 11:AB49: 63        .byte con_animation + $63
- D - I - 0x022B5A 11:AB4A: F0        .byte con_cloud + con_skip
- D - I - 0x022B5B 11:AB4B: FB        .byte con_rts

bra_long_case_AB4C_03_drive_shot:
- D - I - 0x022B5C 11:AB4C: F3        .byte con_branch, $B0     ; проверка на цубасу или diazа
- D - I - 0x022B5E 11:AB4E: 0A        .byte bra_case_AB58_00_это_не_tsubasa_и_не_diaz - *
- D - I - 0x022B5F 11:AB4F: 02        .byte bra_case_AB51_01_это_tsubasa - *
- D - I - 0x022B60 11:AB50: 22        .byte bra_case_AB72_02_это_diaz - *

bra_case_AB51_01_это_tsubasa:
- D - I - 0x022B61 11:AB51: 3C        .byte con_pause + $3C
- D - I - 0x022B62 11:AB52: 30        .byte con_bg + $30
- D - I - 0x022B63 11:AB53: 91        .byte con_animation + $91
- D - I - 0x022B64 11:AB54: A3        .byte con_cloud + $A3
- D - I - 0x022B65 11:AB55: FA        .byte con_jsr
- D - I - 0x022B66 11:AB56: C7 BB     .word sub_BBC7_очистка
loc_AB58:
bra_case_AB58_00_это_не_tsubasa_и_не_diaz:
- D - I - 0x022B68 11:AB58: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x022B6B 11:AB5B: 28        .byte con_pause + $28
- D - I - 0x022B6C 11:AB5C: 4A        .byte con_bg + $4A
- D - I - 0x022B6D 11:AB5D: 8E        .byte con_animation + $8E
- D - I - 0x022B6E 11:AB5E: 49        .byte con_cloud + $49
- D - I - 0x022B6F 11:AB5F: FA        .byte con_jsr
- D - I - 0x022B70 11:AB60: 7C AB     .word sub_AB7C
- D - I - 0x022B72 11:AB62: F7        .byte con_F7, $02
- D - I - 0x022B74 11:AB64: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x022B77 11:AB67: 20        .byte con_pause + $20
- D - I - 0x022B78 11:AB68: 25        .byte con_bg + $25
- D - I - 0x022B79 11:AB69: 63        .byte con_animation + $63
- D - I - 0x022B7A 11:AB6A: F0        .byte con_cloud + con_skip
loc_AB6B:
- D - I - 0x022B7B 11:AB6B: F7        .byte con_F7, $02
- D - I - 0x022B7D 11:AB6D: 10        .byte con_pause + $10
- D - I - 0x022B7E 11:AB6E: F0        .byte con_bg + con_skip
- D - I - 0x022B7F 11:AB6F: F0        .byte con_animation + con_skip
- D - I - 0x022B80 11:AB70: 00        .byte con_cloud + con_clear
- D - I - 0x022B81 11:AB71: FB        .byte con_rts

bra_case_AB72_02_это_diaz:
; bzk проверка на diazа не обязательная, код один и тот же
    ; однако если я буду менять номер облака для них, возможно и понадобится
- D - I - 0x022B82 11:AB72: 3C        .byte con_pause + $3C
- D - I - 0x022B83 11:AB73: 30        .byte con_bg + $30
- D - I - 0x022B84 11:AB74: B7        .byte con_animation + $B7
- D - I - 0x022B85 11:AB75: A3        .byte con_cloud + $A3
- D - I - 0x022B86 11:AB76: FA        .byte con_jsr
- D - I - 0x022B87 11:AB77: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022B89 11:AB79: F2        .byte con_jmp
- D - I - 0x022B8A 11:AB7A: 58 AB     .word loc_AB58

sub_AB7C:
- D - I - 0x022B8C 11:AB7C: F7        .byte con_F7, $04
- D - I - 0x022B8E 11:AB7E: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022B91 11:AB81: 10        .byte con_pause + $10
- D - I - 0x022B92 11:AB82: 41        .byte con_bg + $41
- D - I - 0x022B93 11:AB83: 8C        .byte con_animation + $8C
- D - I - 0x022B94 11:AB84: AF        .byte con_cloud + $AF
- D - I - 0x022B95 11:AB85: FB        .byte con_rts

sub_AB86:
- D - I - 0x022B96 11:AB86: F7        .byte con_F7, $04
- D - I - 0x022B98 11:AB88: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022B9B 11:AB8B: 10        .byte con_pause + $10
- D - I - 0x022B9C 11:AB8C: 41        .byte con_bg + $41
- D - I - 0x022B9D 11:AB8D: 8C        .byte con_animation + $8C
- D - I - 0x022B9E 11:AB8E: E0        .byte con_cloud + $E0
- D - I - 0x022B9F 11:AB8F: FB        .byte con_rts

sub_AB90:
- D - I - 0x022BA0 11:AB90: F7        .byte con_F7, $04
- D - I - 0x022BA2 11:AB92: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022BA5 11:AB95: 10        .byte con_pause + $10
- D - I - 0x022BA6 11:AB96: 41        .byte con_bg + $41
- D - I - 0x022BA7 11:AB97: 8C        .byte con_animation + $8C
- D - I - 0x022BA8 11:AB98: DE        .byte con_cloud + $DE
- D - I - 0x022BA9 11:AB99: FB        .byte con_rts

sub_AB9A:
- D - I - 0x022BAA 11:AB9A: F7        .byte con_F7, $04
- D - I - 0x022BAC 11:AB9C: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022BAF 11:AB9F: 10        .byte con_pause + $10
- D - I - 0x022BB0 11:ABA0: 41        .byte con_bg + $41
- D - I - 0x022BB1 11:ABA1: 8C        .byte con_animation + $8C
- D - I - 0x022BB2 11:ABA2: E1        .byte con_cloud + $E1
- D - I - 0x022BB3 11:ABA3: FB        .byte con_rts

sub_ABA4:
- D - I - 0x022BB4 11:ABA4: F7        .byte con_F7, $04
- D - I - 0x022BB6 11:ABA6: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022BB9 11:ABA9: 10        .byte con_pause + $10
- D - I - 0x022BBA 11:ABAA: 41        .byte con_bg + $41
- D - I - 0x022BBB 11:ABAB: 8C        .byte con_animation + $8C
- D - I - 0x022BBC 11:ABAC: 6A        .byte con_cloud + $6A
- D - I - 0x022BBD 11:ABAD: FB        .byte con_rts

sub_ABAE:
- D - I - 0x022BBE 11:ABAE: F7        .byte con_F7, $04
- D - I - 0x022BC0 11:ABB0: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022BC3 11:ABB3: 10        .byte con_pause + $10
- D - I - 0x022BC4 11:ABB4: 41        .byte con_bg + $41
- D - I - 0x022BC5 11:ABB5: 8C        .byte con_animation + $8C
- D - I - 0x022BC6 11:ABB6: 6B        .byte con_cloud + $6B
- D - I - 0x022BC7 11:ABB7: FB        .byte con_rts

sub_ABB8:
- D - I - 0x022BC8 11:ABB8: 1A        .byte con_pause + $1A
- D - I - 0x022BC9 11:ABB9: 3C        .byte con_bg + $3C
- D - I - 0x022BCA 11:ABBA: 61        .byte con_animation + $61
- D - I - 0x022BCB 11:ABBB: 49        .byte con_cloud + $49
- D - I - 0x022BCC 11:ABBC: F7        .byte con_F7, $04
- D - I - 0x022BCE 11:ABBE: F9        .byte con_soundID_delay, $18, $02
- D - I - 0x022BD1 11:ABC1: 14        .byte con_pause + $14
- D - I - 0x022BD2 11:ABC2: 05        .byte con_bg + $05
- D - I - 0x022BD3 11:ABC3: F0        .byte con_animation + con_skip
- D - I - 0x022BD4 11:ABC4: F0        .byte con_cloud + con_skip
- D - I - 0x022BD5 11:ABC5: F7        .byte con_F7, $3C
- D - I - 0x022BD7 11:ABC7: 34        .byte con_pause + $34
- D - I - 0x022BD8 11:ABC8: 3C        .byte con_bg + $3C
- D - I - 0x022BD9 11:ABC9: F0        .byte con_animation + con_skip
- D - I - 0x022BDA 11:ABCA: F0        .byte con_cloud + con_skip
- D - I - 0x022BDB 11:ABCB: FB        .byte con_rts

bra_long_case_ABCC_05_falcon_shot:
- D - I - 0x022BDC 11:ABCC: F3        .byte con_branch, $B1     ; проверка на нитту
- D - I - 0x022BDE 11:ABCE: 02        .byte bra_case_ABD0_00_это_nitta - *
- - - - - 0x022BDF 11:ABCF: 1A        .byte bra_case_ABE9_01_это_не_nitta - *

bra_case_ABD0_00_это_nitta:
- D - I - 0x022BE0 11:ABD0: 3C        .byte con_pause + $3C
- D - I - 0x022BE1 11:ABD1: 30        .byte con_bg + $30
- D - I - 0x022BE2 11:ABD2: 9A        .byte con_animation + $9A
- D - I - 0x022BE3 11:ABD3: A5        .byte con_cloud + $A5
loc_ABD4:
- D - I - 0x022BE4 11:ABD4: FA        .byte con_jsr
- D - I - 0x022BE5 11:ABD5: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022BE7 11:ABD7: FA        .byte con_jsr
- D - I - 0x022BE8 11:ABD8: B8 AB     .word sub_ABB8
- D - I - 0x022BEA 11:ABDA: FA        .byte con_jsr
- D - I - 0x022BEB 11:ABDB: 86 AB     .word sub_AB86
- D - I - 0x022BED 11:ABDD: F7        .byte con_F7, $02
- D - I - 0x022BEF 11:ABDF: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022BF2 11:ABE2: 20        .byte con_pause + $20
- D - I - 0x022BF3 11:ABE3: 25        .byte con_bg + $25
- D - I - 0x022BF4 11:ABE4: 63        .byte con_animation + $63
- D - I - 0x022BF5 11:ABE5: F0        .byte con_cloud + con_skip
- D - I - 0x022BF6 11:ABE6: F2        .byte con_jmp
- D - I - 0x022BF7 11:ABE7: 6B AB     .word loc_AB6B

bra_case_ABE9_01_это_не_nitta:
- - - - - 0x022BF9 11:ABE9: 3C        .byte con_pause + $3C
- - - - - 0x022BFA 11:ABEA: 30        .byte con_bg + $30
- - - - - 0x022BFB 11:ABEB: 9B        .byte con_animation + $9B
- - - - - 0x022BFC 11:ABEC: A5        .byte con_cloud + $A5
- - - - - 0x022BFD 11:ABED: F2        .byte con_jmp
- - - - - 0x022BFE 11:ABEE: D4 AB     .word loc_ABD4
bra_long_case_ABF0_07_razor_shot:
- D - I - 0x022C00 11:ABF0: F3        .byte con_branch, $B2     ; проверка на соду
- D - I - 0x022C02 11:ABF2: 02        .byte bra_case_ABF4_00_это_souda - *
- D - I - 0x022C03 11:ABF3: 29        .byte bra_case_AC1C_01_это_не_souda - *

bra_case_ABF4_00_это_souda:
- D - I - 0x022C04 11:ABF4: 3C        .byte con_pause + $3C
- D - I - 0x022C05 11:ABF5: 30        .byte con_bg + $30
- D - I - 0x022C06 11:ABF6: 9F        .byte con_animation + $9F
- D - I - 0x022C07 11:ABF7: A3        .byte con_cloud + $A3
loc_ABF8:
- D - I - 0x022C08 11:ABF8: F7        .byte con_F7, $0D
- D - I - 0x022C0A 11:ABFA: F9        .byte con_soundID_delay, $17, $02
- D - I - 0x022C0D 11:ABFD: 3C        .byte con_pause + $3C
- D - I - 0x022C0E 11:ABFE: 6A        .byte con_bg + $6A
- D - I - 0x022C0F 11:ABFF: 9D        .byte con_animation + $9D
- D - I - 0x022C10 11:AC00: 49        .byte con_cloud + $49
- D - I - 0x022C11 11:AC01: F7        .byte con_F7, $15
- D - I - 0x022C13 11:AC03: F9        .byte con_soundID_delay, $1D, $09
- D - I - 0x022C16 11:AC06: 20        .byte con_pause + $20
- D - I - 0x022C17 11:AC07: 05        .byte con_bg + $05
- D - I - 0x022C18 11:AC08: CE        .byte con_animation + $CE
- D - I - 0x022C19 11:AC09: F0        .byte con_cloud + con_skip
- D - I - 0x022C1A 11:AC0A: F7        .byte con_F7, $10
- D - I - 0x022C1C 11:AC0C: 0D        .byte con_pause + $0D
- D - I - 0x022C1D 11:AC0D: 05        .byte con_bg + $05
- D - I - 0x022C1E 11:AC0E: 00        .byte con_animation + $00
- D - I - 0x022C1F 11:AC0F: F0        .byte con_cloud + con_skip
- D - I - 0x022C20 11:AC10: F7        .byte con_F7, $02
- D - I - 0x022C22 11:AC12: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022C25 11:AC15: 20        .byte con_pause + $20
- D - I - 0x022C26 11:AC16: 25        .byte con_bg + $25
- D - I - 0x022C27 11:AC17: 63        .byte con_animation + $63
- D - I - 0x022C28 11:AC18: F0        .byte con_cloud + con_skip
- D - I - 0x022C29 11:AC19: F2        .byte con_jmp
- D - I - 0x022C2A 11:AC1A: 6B AB     .word loc_AB6B

bra_case_AC1C_01_это_не_souda:
- D - I - 0x022C2C 11:AC1C: 3C        .byte con_pause + $3C
- D - I - 0x022C2D 11:AC1D: 30        .byte con_bg + $30
- D - I - 0x022C2E 11:AC1E: AD        .byte con_animation + $AD
- D - I - 0x022C2F 11:AC1F: A3        .byte con_cloud + $A3
- D - I - 0x022C30 11:AC20: F2        .byte con_jmp
- D - I - 0x022C31 11:AC21: F8 AB     .word loc_ABF8

bra_long_case_AC23_0B_eagle_shot:
- D - I - 0x022C33 11:AC23: F3        .byte con_branch, $B9     ; проверка на мацуяму
- D - I - 0x022C35 11:AC25: 02        .byte bra_case_AC27_00_это_matsuyama - *
- D - I - 0x022C36 11:AC26: 20        .byte bra_case_AC46_01_это_не_matsuyama - *

bra_case_AC27_00_это_matsuyama:
- D - I - 0x022C37 11:AC27: 3C        .byte con_pause + $3C
- D - I - 0x022C38 11:AC28: 30        .byte con_bg + $30
- D - I - 0x022C39 11:AC29: A1        .byte con_animation + $A1
- D - I - 0x022C3A 11:AC2A: B1        .byte con_cloud + $B1
loc_AC2B:
- D - I - 0x022C3B 11:AC2B: FA        .byte con_jsr
- D - I - 0x022C3C 11:AC2C: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022C3E 11:AC2E: F7        .byte con_F7, $19
- D - I - 0x022C40 11:AC30: F9        .byte con_soundID_delay, $15, $02
- D - I - 0x022C43 11:AC33: 28        .byte con_pause + $28
- D - I - 0x022C44 11:AC34: 49        .byte con_bg + $49
- D - I - 0x022C45 11:AC35: 8E        .byte con_animation + $8E
- D - I - 0x022C46 11:AC36: 49        .byte con_cloud + $49
- D - I - 0x022C47 11:AC37: FA        .byte con_jsr
- D - I - 0x022C48 11:AC38: 9A AB     .word sub_AB9A
- D - I - 0x022C4A 11:AC3A: F7        .byte con_F7, $02
- D - I - 0x022C4C 11:AC3C: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022C4F 11:AC3F: 20        .byte con_pause + $20
- D - I - 0x022C50 11:AC40: 25        .byte con_bg + $25
- D - I - 0x022C51 11:AC41: 63        .byte con_animation + $63
- D - I - 0x022C52 11:AC42: F0        .byte con_cloud + con_skip
- D - I - 0x022C53 11:AC43: F2        .byte con_jmp
- D - I - 0x022C54 11:AC44: 6B AB     .word loc_AB6B

bra_case_AC46_01_это_не_matsuyama:
- D - I - 0x022C56 11:AC46: 3C        .byte con_pause + $3C
- D - I - 0x022C57 11:AC47: 30        .byte con_bg + $30
- D - I - 0x022C58 11:AC48: AF        .byte con_animation + $AF
- D - I - 0x022C59 11:AC49: B1        .byte con_cloud + $B1
- D - I - 0x022C5A 11:AC4A: F2        .byte con_jmp
- D - I - 0x022C5B 11:AC4B: 2B AC     .word loc_AC2B

bra_long_case_AC4D_0C_tiger_shot:
- D - I - 0x022C5D 11:AC4D: F3        .byte con_branch, $B8     ; проверка на хюгу
- D - I - 0x022C5F 11:AC4F: 02        .byte bra_case_AC51_00_это_hyuga - *
- D - I - 0x022C60 11:AC50: 17        .byte bra_case_AC67_01_это_не_hyuga - *

bra_case_AC51_00_это_hyuga:
- D - I - 0x022C61 11:AC51: 3C        .byte con_pause + $3C
- D - I - 0x022C62 11:AC52: 31        .byte con_bg + $31
- D - I - 0x022C63 11:AC53: 9E        .byte con_animation + $9E
- D - I - 0x022C64 11:AC54: B2        .byte con_cloud + $B2
loc_AC55:
- D - I - 0x022C65 11:AC55: FA        .byte con_jsr
- D - I - 0x022C66 11:AC56: B8 AB     .word sub_ABB8
- D - I - 0x022C68 11:AC58: FA        .byte con_jsr
- D - I - 0x022C69 11:AC59: A4 AB     .word sub_ABA4
- D - I - 0x022C6B 11:AC5B: F7        .byte con_F7, $02
- D - I - 0x022C6D 11:AC5D: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022C70 11:AC60: 20        .byte con_pause + $20
- D - I - 0x022C71 11:AC61: 25        .byte con_bg + $25
- D - I - 0x022C72 11:AC62: 63        .byte con_animation + $63
- D - I - 0x022C73 11:AC63: F0        .byte con_cloud + con_skip
- D - I - 0x022C74 11:AC64: F2        .byte con_jmp
- D - I - 0x022C75 11:AC65: 6B AB     .word loc_AB6B

bra_case_AC67_01_это_не_hyuga:
- D - I - 0x022C77 11:AC67: 3C        .byte con_pause + $3C
- D - I - 0x022C78 11:AC68: 31        .byte con_bg + $31
- D - I - 0x022C79 11:AC69: B0        .byte con_animation + $B0
- D - I - 0x022C7A 11:AC6A: B2        .byte con_cloud + $B2
- D - I - 0x022C7B 11:AC6B: F2        .byte con_jmp
- D - I - 0x022C7C 11:AC6C: 55 AC     .word loc_AC55

bra_long_case_AC6E_0D_neo_tiger_shot:
- D - I - 0x022C7E 11:AC6E: F3        .byte con_branch, $AC
- D - I - 0x022C80 11:AC70: 02        .byte bra_case_AC72_00 - *
- D - I - 0x022C81 11:AC71: 32        .byte bra_case_ACA3_01 - *

bra_case_AC72_00:
- D - I - 0x022C82 11:AC72: F3        .byte con_branch, $B8     ; проверка на хюгу
- D - I - 0x022C84 11:AC74: 02        .byte bra_case_AC76_00_это_hyuga - *
- D - I - 0x022C85 11:AC75: 27        .byte bra_case_AC9C_01_это_не_hyuga - *

bra_case_AC76_00_это_hyuga:
- D - I - 0x022C86 11:AC76: 78        .byte con_pause + $78
- D - I - 0x022C87 11:AC77: 31        .byte con_bg + $31
- D - I - 0x022C88 11:AC78: 9E        .byte con_animation + $9E
- D - I - 0x022C89 11:AC79: B3        .byte con_cloud + $B3
loc_AC7A:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x022C8E 11:AC7E: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x022C91 11:AC81: F7        .byte con_F7, $1B
- D - I - 0x022C93 11:AC83: 28        .byte con_pause + $28
- D - I - 0x022C94 11:AC84: 4A        .byte con_bg + $4A
- D - I - 0x022C95 11:AC85: 8E        .byte con_animation + $8E
- D - I - 0x022C96 11:AC86: 49        .byte con_cloud + $49
- D - I - 0x022C97 11:AC87: F7        .byte con_F7, $04
- D - I - 0x022C99 11:AC89: F9        .byte con_soundID_delay, $13, $02
- D - I - 0x022C9C 11:AC8C: 1E        .byte con_pause + $1E
- D - I - 0x022C9D 11:AC8D: 41        .byte con_bg + $41
- D - I - 0x022C9E 11:AC8E: 8C        .byte con_animation + $8C
- D - I - 0x022C9F 11:AC8F: 6A        .byte con_cloud + $6A
- D - I - 0x022CA0 11:AC90: F7        .byte con_F7, $02
- D - I - 0x022CA2 11:AC92: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022CA5 11:AC95: 20        .byte con_pause + $20
- D - I - 0x022CA6 11:AC96: 25        .byte con_bg + $25
- D - I - 0x022CA7 11:AC97: 63        .byte con_animation + $63
- D - I - 0x022CA8 11:AC98: F0        .byte con_cloud + con_skip
- D - I - 0x022CA9 11:AC99: F2        .byte con_jmp
- D - I - 0x022CAA 11:AC9A: 6B AB     .word loc_AB6B

bra_case_AC9C_01_это_не_hyuga:
- D - I - 0x022CAC 11:AC9C: 78        .byte con_pause + $78
- D - I - 0x022CAD 11:AC9D: 31        .byte con_bg + $31
- D - I - 0x022CAE 11:AC9E: B0        .byte con_animation + $B0
- D - I - 0x022CAF 11:AC9F: B3        .byte con_cloud + $B3
- D - I - 0x022CB0 11:ACA0: F2        .byte con_jmp
- D - I - 0x022CB1 11:ACA1: 7A AC     .word loc_AC7A

bra_case_ACA3_01:
- D - I - 0x022CB3 11:ACA3: F3        .byte con_branch, $B8     ; проверка на хюгу
- D - I - 0x022CB5 11:ACA5: 02        .byte bra_case_ACA7_00_это_hyuga - *
- D - I - 0x022CB6 11:ACA6: 0A        .byte bra_case_ACB0_01_это_не_hyuga - *

bra_case_ACA7_00_это_hyuga:
- D - I - 0x022CB7 11:ACA7: F7        .byte con_F7, $44
- D - I - 0x022CB9 11:ACA9: B4        .byte con_pause + $B4
- D - I - 0x022CBA 11:ACAA: 31        .byte con_bg + $31
- D - I - 0x022CBB 11:ACAB: 9E        .byte con_animation + $9E
- D - I - 0x022CBC 11:ACAC: 9D        .byte con_cloud + $9D
- D - I - 0x022CBD 11:ACAD: F2        .byte con_jmp
- D - I - 0x022CBE 11:ACAE: 7A AC     .word loc_AC7A

bra_case_ACB0_01_это_не_hyuga:
- D - I - 0x022CC0 11:ACB0: F7        .byte con_F7, $44
- D - I - 0x022CC2 11:ACB2: B4        .byte con_pause + $B4
- D - I - 0x022CC3 11:ACB3: 31        .byte con_bg + $31
- D - I - 0x022CC4 11:ACB4: B0        .byte con_animation + $B0
- D - I - 0x022CC5 11:ACB5: 9D        .byte con_cloud + $9D
- D - I - 0x022CC6 11:ACB6: F2        .byte con_jmp
- D - I - 0x022CC7 11:ACB7: 7A AC     .word loc_AC7A

bra_long_case_ACB9_11_drive_tiger:
- D - I - 0x022CC9 11:ACB9: F5        .byte con_mirror_off
- D - I - 0x022CCA 11:ACBA: F8        .byte con_F8, $04
- D - I - 0x022CCC 11:ACBC: 3C        .byte con_pause + $3C
- D - I - 0x022CCD 11:ACBD: 30        .byte con_bg + $30
- D - I - 0x022CCE 11:ACBE: 91        .byte con_animation + $91
- D - I - 0x022CCF 11:ACBF: B6        .byte con_cloud + $B6
- D - I - 0x022CD0 11:ACC0: F6        .byte con_mirror_toggle
- D - I - 0x022CD1 11:ACC1: F8        .byte con_F8, $04
- D - I - 0x022CD3 11:ACC3: 3C        .byte con_pause + $3C
- D - I - 0x022CD4 11:ACC4: 55        .byte con_bg + $55
- D - I - 0x022CD5 11:ACC5: 9E        .byte con_animation + $9E
- D - I - 0x022CD6 11:ACC6: B7        .byte con_cloud + $B7
- D - I - 0x022CD7 11:ACC7: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022CDA 11:ACCA: F7        .byte con_F7, $02
- D - I - 0x022CDC 11:ACCC: 1E        .byte con_pause + $1E
- D - I - 0x022CDD 11:ACCD: 23        .byte con_bg + $23
- D - I - 0x022CDE 11:ACCE: 6B        .byte con_animation + $6B
- D - I - 0x022CDF 11:ACCF: 00        .byte con_cloud + con_clear
- D - I - 0x022CE0 11:ACD0: F6        .byte con_mirror_toggle
- D - I - 0x022CE1 11:ACD1: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022CE4 11:ACD4: F7        .byte con_F7, $02
- D - I - 0x022CE6 11:ACD6: 1E        .byte con_pause + $1E
- D - I - 0x022CE7 11:ACD7: 22        .byte con_bg + $22
- D - I - 0x022CE8 11:ACD8: E7        .byte con_animation + $E7
- D - I - 0x022CE9 11:ACD9: F0        .byte con_cloud + con_skip
- D - I - 0x022CEA 11:ACDA: F7        .byte con_F7, $10
- D - I - 0x022CEC 11:ACDC: F9        .byte con_soundID_delay, $30, $11
- D - I - 0x022CEF 11:ACDF: 14        .byte con_pause + $14
- D - I - 0x022CF0 11:ACE0: 05        .byte con_bg + $05
- D - I - 0x022CF1 11:ACE1: 00        .byte con_animation + $00
- D - I - 0x022CF2 11:ACE2: 9C        .byte con_cloud + $9C
- D - I - 0x022CF3 11:ACE3: F7        .byte con_F7, $31
- D - I - 0x022CF5 11:ACE5: 3C        .byte con_pause + $3C
- D - I - 0x022CF6 11:ACE6: 5C        .byte con_bg + $5C
- D - I - 0x022CF7 11:ACE7: D7        .byte con_animation + $D7
- D - I - 0x022CF8 11:ACE8: F0        .byte con_cloud + con_skip
- D - I - 0x022CF9 11:ACE9: F7        .byte con_F7, $23
- D - I - 0x022CFB 11:ACEB: F9        .byte con_soundID_delay, $0A, $02
- D - I - 0x022CFE 11:ACEE: 3C        .byte con_pause + $3C
- D - I - 0x022CFF 11:ACEF: 27        .byte con_bg + $27
- D - I - 0x022D00 11:ACF0: DC        .byte con_animation + $DC
- D - I - 0x022D01 11:ACF1: 00        .byte con_cloud + con_clear
- D - I - 0x022D02 11:ACF2: F7        .byte con_F7, $1F
- D - I - 0x022D04 11:ACF4: F8        .byte con_F8, $04
- D - I - 0x022D06 11:ACF6: 3C        .byte con_pause + $3C
- D - I - 0x022D07 11:ACF7: 30        .byte con_bg + $30
- D - I - 0x022D08 11:ACF8: 91        .byte con_animation + $91
- D - I - 0x022D09 11:ACF9: AF        .byte con_cloud + $AF
- D - I - 0x022D0A 11:ACFA: F6        .byte con_mirror_toggle
- D - I - 0x022D0B 11:ACFB: F7        .byte con_F7, $1F
- D - I - 0x022D0D 11:ACFD: F8        .byte con_F8, $04
- D - I - 0x022D0F 11:ACFF: 3C        .byte con_pause + $3C
- D - I - 0x022D10 11:AD00: 55        .byte con_bg + $55
- D - I - 0x022D11 11:AD01: 9E        .byte con_animation + $9E
- D - I - 0x022D12 11:AD02: B8        .byte con_cloud + $B8
- D - I - 0x022D13 11:AD03: F6        .byte con_mirror_toggle
- D - I - 0x022D14 11:AD04: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x022D17 11:AD07: 41        .byte con_pause + $41
- D - I - 0x022D18 11:AD08: 1D        .byte con_bg + $1D
- D - I - 0x022D19 11:AD09: 1F        .byte con_animation + $1F
- D - I - 0x022D1A 11:AD0A: 00        .byte con_cloud + con_clear
- D - I - 0x022D1B 11:AD0B: FB        .byte con_rts

bra_long_case_AD0C_12_cyclone:
- D - I - 0x022D1C 11:AD0C: F5        .byte con_mirror_off
- D - I - 0x022D1D 11:AD0D: FA        .byte con_jsr
- D - I - 0x022D1E 11:AD0E: 13 AD     .word sub_AD13
- D - I - 0x022D20 11:AD10: F2        .byte con_jmp
- D - I - 0x022D21 11:AD11: A7 B0     .word loc_B0A7

sub_AD13:
- D - I - 0x022D23 11:AD13: F7        .byte con_F7, $10
- D - I - 0x022D25 11:AD15: F9        .byte con_soundID_delay, $12, $02
- D - I - 0x022D28 11:AD18: 14        .byte con_pause + $14
- D - I - 0x022D29 11:AD19: 10        .byte con_bg + $10
- D - I - 0x022D2A 11:AD1A: 62        .byte con_animation + $62
- D - I - 0x022D2B 11:AD1B: F0        .byte con_cloud + con_skip
- D - I - 0x022D2C 11:AD1C: FB        .byte con_rts

bra_long_case_AD1D_13_sano_combo:
- D - I - 0x022D2D 11:AD1D: F3        .byte con_branch, $98     ; проверка на jitou из японии
- D - I - 0x022D2F 11:AD1F: 02        .byte bra_case_AD21_00_это_jitou_из_японии - *
- D - I - 0x022D30 11:AD20: 25        .byte bra_case_AD45_01_это_jitou_из_куними - *

bra_case_AD21_00_это_jitou_из_японии:
- D - I - 0x022D31 11:AD21: 78        .byte con_pause + $78
- D - I - 0x022D32 11:AD22: 30        .byte con_bg + $30
- D - I - 0x022D33 11:AD23: A0        .byte con_animation + $A0
- D - I - 0x022D34 11:AD24: 4B        .byte con_cloud + $4B
loc_AD25:
- D - I - 0x022D35 11:AD25: FA        .byte con_jsr
- D - I - 0x022D36 11:AD26: B8 AB     .word sub_ABB8
- D - I - 0x022D38 11:AD28: FA        .byte con_jsr
- D - I - 0x022D39 11:AD29: AE AB     .word sub_ABAE
- D - I - 0x022D3B 11:AD2B: F9        .byte con_soundID_delay, $0E, $02
- D - I - 0x022D3E 11:AD2E: 30        .byte con_pause + $30
- D - I - 0x022D3F 11:AD2F: 62        .byte con_bg + $62
- D - I - 0x022D40 11:AD30: 40        .byte con_animation + $40
- D - I - 0x022D41 11:AD31: 00        .byte con_cloud + con_clear
- D - I - 0x022D42 11:AD32: F7        .byte con_F7, $3D
- D - I - 0x022D44 11:AD34: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022D47 11:AD37: 28        .byte con_pause + $28
- D - I - 0x022D48 11:AD38: 1F        .byte con_bg + $1F
- D - I - 0x022D49 11:AD39: 71        .byte con_animation + $71
- D - I - 0x022D4A 11:AD3A: 49        .byte con_cloud + $49
- D - I - 0x022D4B 11:AD3B: F7        .byte con_F7, $3D
- D - I - 0x022D4D 11:AD3D: F9        .byte con_soundID_delay, $1B, $21
- D - I - 0x022D50 11:AD40: 46        .byte con_pause + $46
- D - I - 0x022D51 11:AD41: 51        .byte con_bg + $51
- D - I - 0x022D52 11:AD42: E8        .byte con_animation + $E8
- D - I - 0x022D53 11:AD43: F0        .byte con_cloud + con_skip
- D - I - 0x022D54 11:AD44: FB        .byte con_rts

bra_case_AD45_01_это_jitou_из_куними:
- D - I - 0x022D55 11:AD45: 78        .byte con_pause + $78
- D - I - 0x022D56 11:AD46: 30        .byte con_bg + $30
- D - I - 0x022D57 11:AD47: AA        .byte con_animation + $AA
- D - I - 0x022D58 11:AD48: B9        .byte con_cloud + $B9
- D - I - 0x022D59 11:AD49: F2        .byte con_jmp
- D - I - 0x022D5A 11:AD4A: 25 AD     .word loc_AD25

bra_long_case_AD4C_14_banana_shot:
- D - I - 0x022D5C 11:AD4C: FA        .byte con_jsr
- D - I - 0x022D5D 11:AD4D: B8 AB     .word sub_ABB8
- D - I - 0x022D5F 11:AD4F: FA        .byte con_jsr
- D - I - 0x022D60 11:AD50: AE AB     .word sub_ABAE
- D - I - 0x022D62 11:AD52: F7        .byte con_F7, $02
- D - I - 0x022D64 11:AD54: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022D67 11:AD57: 20        .byte con_pause + $20
- D - I - 0x022D68 11:AD58: 25        .byte con_bg + $25
- D - I - 0x022D69 11:AD59: 63        .byte con_animation + $63
- D - I - 0x022D6A 11:AD5A: F0        .byte con_cloud + con_skip
- D - I - 0x022D6B 11:AD5B: F2        .byte con_jmp
- D - I - 0x022D6C 11:AD5C: 6B AB     .word loc_AB6B

bra_long_case_AD5E_15_booster_shot:
- D - I - 0x022D6E 11:AD5E: FA        .byte con_jsr
- D - I - 0x022D6F 11:AD5F: B8 AB     .word sub_ABB8
- D - I - 0x022D71 11:AD61: FA        .byte con_jsr
- D - I - 0x022D72 11:AD62: 7C AB     .word sub_AB7C
- D - I - 0x022D74 11:AD64: F7        .byte con_F7, $3E
- D - I - 0x022D76 11:AD66: FC        .byte con_moving_bg, $02
- D - I - 0x022D78 11:AD68: 28        .byte con_pause + $28
- D - I - 0x022D79 11:AD69: 58        .byte con_bg + $58
- D - I - 0x022D7A 11:AD6A: C8        .byte con_animation + $C8
- D - I - 0x022D7B 11:AD6B: 00        .byte con_cloud + con_clear
- D - I - 0x022D7C 11:AD6C: F7        .byte con_F7, $29
- D - I - 0x022D7E 11:AD6E: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x022D81 11:AD71: 1E        .byte con_pause + $1E
- D - I - 0x022D82 11:AD72: 47        .byte con_bg + $47
- D - I - 0x022D83 11:AD73: E9        .byte con_animation + $E9
- D - I - 0x022D84 11:AD74: 04        .byte con_cloud + $04
- D - I - 0x022D85 11:AD75: F7        .byte con_F7, $3E
- D - I - 0x022D87 11:AD77: FC        .byte con_moving_bg, $02
- D - I - 0x022D89 11:AD79: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x022D8C 11:AD7C: 28        .byte con_pause + $28
- D - I - 0x022D8D 11:AD7D: 58        .byte con_bg + $58
- D - I - 0x022D8E 11:AD7E: C5        .byte con_animation + $C5
- D - I - 0x022D8F 11:AD7F: F0        .byte con_cloud + con_skip
- D - I - 0x022D90 11:AD80: FB        .byte con_rts

bra_long_case_AD81_16_mirage_shot:
- D - I - 0x022D91 11:AD81: F3        .byte con_branch, $BB     ; проверка на carlosа
- D - I - 0x022D93 11:AD83: 02        .byte bra_case_AD85_00_это_carlos - *
- D - I - 0x022D94 11:AD84: 20        .byte bra_case_ADA4_01_это_не_carlos - *

bra_case_AD85_00_это_carlos:
- D - I - 0x022D95 11:AD85: 3C        .byte con_pause + $3C
- D - I - 0x022D96 11:AD86: 30        .byte con_bg + $30
- D - I - 0x022D97 11:AD87: A9        .byte con_animation + $A9
- D - I - 0x022D98 11:AD88: BA        .byte con_cloud + $BA
loc_AD89:
- D - I - 0x022D99 11:AD89: FA        .byte con_jsr
- D - I - 0x022D9A 11:AD8A: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022D9C 11:AD8C: F7        .byte con_F7, $26
- D - I - 0x022D9E 11:AD8E: F9        .byte con_soundID_delay, $15, $02
- D - I - 0x022DA1 11:AD91: 28        .byte con_pause + $28
- D - I - 0x022DA2 11:AD92: 49        .byte con_bg + $49
- D - I - 0x022DA3 11:AD93: 8E        .byte con_animation + $8E
- D - I - 0x022DA4 11:AD94: 49        .byte con_cloud + $49
- D - I - 0x022DA5 11:AD95: FA        .byte con_jsr
- D - I - 0x022DA6 11:AD96: 9A AB     .word sub_AB9A
- D - I - 0x022DA8 11:AD98: F7        .byte con_F7, $02
- D - I - 0x022DAA 11:AD9A: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022DAD 11:AD9D: 20        .byte con_pause + $20
- D - I - 0x022DAE 11:AD9E: 25        .byte con_bg + $25
- D - I - 0x022DAF 11:AD9F: 63        .byte con_animation + $63
- D - I - 0x022DB0 11:ADA0: F0        .byte con_cloud + con_skip
- D - I - 0x022DB1 11:ADA1: F2        .byte con_jmp
- D - I - 0x022DB2 11:ADA2: 6B AB     .word loc_AB6B

bra_case_ADA4_01_это_не_carlos:
- D - I - 0x022DB4 11:ADA4: 3C        .byte con_pause + $3C
- D - I - 0x022DB5 11:ADA5: 30        .byte con_bg + $30
- D - I - 0x022DB6 11:ADA6: BB        .byte con_animation + $BB
- D - I - 0x022DB7 11:ADA7: BA        .byte con_cloud + $BA
- D - I - 0x022DB8 11:ADA8: F2        .byte con_jmp
- D - I - 0x022DB9 11:ADA9: 89 AD     .word loc_AD89

bra_long_case_ADAB_17_mach_shot:
- D - I - 0x022DBB 11:ADAB: 3C        .byte con_pause + $3C
- D - I - 0x022DBC 11:ADAC: 30        .byte con_bg + $30
- D - I - 0x022DBD 11:ADAD: BC        .byte con_animation + $BC
- D - I - 0x022DBE 11:ADAE: BB        .byte con_cloud + $BB
- D - I - 0x022DBF 11:ADAF: FA        .byte con_jsr
- D - I - 0x022DC0 11:ADB0: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022DC2 11:ADB2: F7        .byte con_F7, $0D
- D - I - 0x022DC4 11:ADB4: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x022DC7 11:ADB7: 28        .byte con_pause + $28
- D - I - 0x022DC8 11:ADB8: 4A        .byte con_bg + $4A
- D - I - 0x022DC9 11:ADB9: 8E        .byte con_animation + $8E
- D - I - 0x022DCA 11:ADBA: 49        .byte con_cloud + $49
- D - I - 0x022DCB 11:ADBB: FA        .byte con_jsr
- D - I - 0x022DCC 11:ADBC: A4 AB     .word sub_ABA4
- D - I - 0x022DCE 11:ADBE: F7        .byte con_F7, $02
- D - I - 0x022DD0 11:ADC0: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x022DD3 11:ADC3: 20        .byte con_pause + $20
- D - I - 0x022DD4 11:ADC4: 25        .byte con_bg + $25
- D - I - 0x022DD5 11:ADC5: 63        .byte con_animation + $63
- D - I - 0x022DD6 11:ADC6: F0        .byte con_cloud + con_skip
- D - I - 0x022DD7 11:ADC7: F2        .byte con_jmp
- D - I - 0x022DD8 11:ADC8: 6B AB     .word loc_AB6B

bra_long_case_ADCA_18_sidewinder_shot:
- D - I - 0x022DDA 11:ADCA: FA        .byte con_jsr
- D - I - 0x022DDB 11:ADCB: B8 AB     .word sub_ABB8
- D - I - 0x022DDD 11:ADCD: FA        .byte con_jsr
- D - I - 0x022DDE 11:ADCE: 86 AB     .word sub_AB86
- D - I - 0x022DE0 11:ADD0: F7        .byte con_F7, $02
- D - I - 0x022DE2 11:ADD2: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x022DE5 11:ADD5: 20        .byte con_pause + $20
- D - I - 0x022DE6 11:ADD6: 25        .byte con_bg + $25
- D - I - 0x022DE7 11:ADD7: 63        .byte con_animation + $63
- D - I - 0x022DE8 11:ADD8: F0        .byte con_cloud + con_skip
- D - I - 0x022DE9 11:ADD9: F2        .byte con_jmp
- D - I - 0x022DEA 11:ADDA: 6B AB     .word loc_AB6B

bra_long_case_ADDC_19_slider_shot:
- D - I - 0x022DEC 11:ADDC: 3C        .byte con_pause + $3C
- D - I - 0x022DED 11:ADDD: 30        .byte con_bg + $30
- D - I - 0x022DEE 11:ADDE: B5        .byte con_animation + $B5
- D - I - 0x022DEF 11:ADDF: BC        .byte con_cloud + $BC
- D - I - 0x022DF0 11:ADE0: FA        .byte con_jsr
- D - I - 0x022DF1 11:ADE1: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022DF3 11:ADE3: F9        .byte con_soundID_delay, $17, $02
- D - I - 0x022DF6 11:ADE6: 3C        .byte con_pause + $3C
- D - I - 0x022DF7 11:ADE7: 6A        .byte con_bg + $6A
- D - I - 0x022DF8 11:ADE8: 9D        .byte con_animation + $9D
- D - I - 0x022DF9 11:ADE9: 49        .byte con_cloud + $49
- D - I - 0x022DFA 11:ADEA: FA        .byte con_jsr
- D - I - 0x022DFB 11:ADEB: 90 AB     .word sub_AB90
- D - I - 0x022DFD 11:ADED: F7        .byte con_F7, $02
- D - I - 0x022DFF 11:ADEF: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x022E02 11:ADF2: 28        .byte con_pause + $28
- D - I - 0x022E03 11:ADF3: 25        .byte con_bg + $25
- D - I - 0x022E04 11:ADF4: 63        .byte con_animation + $63
- D - I - 0x022E05 11:ADF5: F0        .byte con_cloud + con_skip
- D - I - 0x022E06 11:ADF6: F2        .byte con_jmp
- D - I - 0x022E07 11:ADF7: 6B AB     .word loc_AB6B

bra_long_case_ADF9_1A_cannon_shot:
- D - I - 0x022E09 11:ADF9: 3C        .byte con_pause + $3C
- D - I - 0x022E0A 11:ADFA: 30        .byte con_bg + $30
- D - I - 0x022E0B 11:ADFB: B4        .byte con_animation + $B4
- D - I - 0x022E0C 11:ADFC: BD        .byte con_cloud + $BD
- D - I - 0x022E0D 11:ADFD: FA        .byte con_jsr
- D - I - 0x022E0E 11:ADFE: B8 AB     .word sub_ABB8
- D - I - 0x022E10 11:AE00: FA        .byte con_jsr
- D - I - 0x022E11 11:AE01: AE AB     .word sub_ABAE
- D - I - 0x022E13 11:AE03: F7        .byte con_F7, $02
- D - I - 0x022E15 11:AE05: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022E18 11:AE08: 28        .byte con_pause + $28
- D - I - 0x022E19 11:AE09: 25        .byte con_bg + $25
- D - I - 0x022E1A 11:AE0A: 63        .byte con_animation + $63
- D - I - 0x022E1B 11:AE0B: F0        .byte con_cloud + con_skip
- D - I - 0x022E1C 11:AE0C: F2        .byte con_jmp
- D - I - 0x022E1D 11:AE0D: 6B AB     .word loc_AB6B

bra_long_case_AE0F_1B_fire_shot:
- D - I - 0x022E1F 11:AE0F: 3C        .byte con_pause + $3C
- D - I - 0x022E20 11:AE10: 30        .byte con_bg + $30
- D - I - 0x022E21 11:AE11: B8        .byte con_animation + $B8
- D - I - 0x022E22 11:AE12: BE        .byte con_cloud + $BE
- D - I - 0x022E23 11:AE13: FA        .byte con_jsr
- D - I - 0x022E24 11:AE14: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022E26 11:AE16: F7        .byte con_F7, $1D
- D - I - 0x022E28 11:AE18: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x022E2B 11:AE1B: 28        .byte con_pause + $28
- D - I - 0x022E2C 11:AE1C: 4A        .byte con_bg + $4A
- D - I - 0x022E2D 11:AE1D: 8E        .byte con_animation + $8E
- D - I - 0x022E2E 11:AE1E: 49        .byte con_cloud + $49
- D - I - 0x022E2F 11:AE1F: F7        .byte con_F7, $04
- D - I - 0x022E31 11:AE21: F9        .byte con_soundID_delay, $13, $10
- D - I - 0x022E34 11:AE24: 10        .byte con_pause + $10
- D - I - 0x022E35 11:AE25: 41        .byte con_bg + $41
- D - I - 0x022E36 11:AE26: 8C        .byte con_animation + $8C
- D - I - 0x022E37 11:AE27: 6C        .byte con_cloud + $6C
- D - I - 0x022E38 11:AE28: F7        .byte con_F7, $02
- D - I - 0x022E3A 11:AE2A: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x022E3D 11:AE2D: 28        .byte con_pause + $28
- D - I - 0x022E3E 11:AE2E: 25        .byte con_bg + $25
- D - I - 0x022E3F 11:AE2F: 63        .byte con_animation + $63
- D - I - 0x022E40 11:AE30: F0        .byte con_cloud + con_skip
- D - I - 0x022E41 11:AE31: F2        .byte con_jmp
- D - I - 0x022E42 11:AE32: 6B AB     .word loc_AB6B

bra_long_case_AE34_22_double_eel:
- D - I - 0x022E44 11:AE34: F7        .byte con_F7, $31
- D - I - 0x022E46 11:AE36: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x022E49 11:AE39: 28        .byte con_pause + $28
- D - I - 0x022E4A 11:AE3A: 4A        .byte con_bg + $4A
- D - I - 0x022E4B 11:AE3B: 8E        .byte con_animation + $8E
- D - I - 0x022E4C 11:AE3C: 49        .byte con_cloud + $49
- D - I - 0x022E4D 11:AE3D: FA        .byte con_jsr
- D - I - 0x022E4E 11:AE3E: 9A AB     .word sub_AB9A
- D - I - 0x022E50 11:AE40: F7        .byte con_F7, $02
- D - I - 0x022E52 11:AE42: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x022E55 11:AE45: 28        .byte con_pause + $28
- D - I - 0x022E56 11:AE46: 25        .byte con_bg + $25
- D - I - 0x022E57 11:AE47: 63        .byte con_animation + $63
- D - I - 0x022E58 11:AE48: F0        .byte con_cloud + con_skip
- D - I - 0x022E59 11:AE49: F2        .byte con_jmp
- D - I - 0x022E5A 11:AE4A: 6B AB     .word loc_AB6B

bra_long_case_AE4C_00:
- D - I - 0x022E5C 11:AE4C: F3        .byte con_branch, $C0
- - - - - 0x022E5E 11:AE4E: 16        .byte bra_case_AE64_00_игрок_без_рожи - *
- - - - - 0x022E5F 11:AE4F: 15        .byte bra_case_AE64_01_tsubasa - *
- - - - - 0x022E60 11:AE50: 14        .byte bra_case_AE64_02_misaki - *
- - - - - 0x022E61 11:AE51: 13        .byte bra_case_AE64_03_misaki - *
- - - - - 0x022E62 11:AE52: 12        .byte bra_case_AE64_04_hyuga - *
- - - - - 0x022E63 11:AE53: 11        .byte bra_case_AE64_05_hyuga - *
- - - - - 0x022E64 11:AE54: 10        .byte bra_case_AE64_06_misugi - *
- - - - - 0x022E65 11:AE55: 0F        .byte bra_case_AE64_07_misugi - *
- - - - - 0x022E66 11:AE56: 0E        .byte bra_case_AE64_08_matsuyama - *
- - - - - 0x022E67 11:AE57: 0D        .byte bra_case_AE64_09_matsuyama - *
- - - - - 0x022E68 11:AE58: 0C        .byte bra_case_AE64_0A_ishizaki - *
- - - - - 0x022E69 11:AE59: 0B        .byte bra_case_AE64_0B_ishizaki - *
- - - - - 0x022E6A 11:AE5A: 0A        .byte bra_case_AE64_0C_souda - *
- - - - - 0x022E6B 11:AE5B: 09        .byte bra_case_AE64_0D_souda - *
- - - - - 0x022E6C 11:AE5C: 08        .byte bra_case_AE64_0E_jitou - *
- - - - - 0x022E6D 11:AE5D: 07        .byte bra_case_AE64_0F_jitou - *
- D - I - 0x022E6E 11:AE5E: 0B        .byte bra_case_AE69_10_masao_kazuo - *
- D - I - 0x022E6F 11:AE5F: 45        .byte bra_case_AEA4_11_masao_kazuo - *
- - - - - 0x022E70 11:AE60: 04        .byte bra_case_AE64_12_nitta - *
- - - - - 0x022E71 11:AE61: 03        .byte bra_case_AE64_13_nitta - *
- - - - - 0x022E72 11:AE62: 02        .byte bra_case_AE64_14_sawada - *
- - - - - 0x022E73 11:AE63: 01        .byte bra_case_AE64_15_sawada - *

bra_long_case_AE64_01_pass:
bra_long_case_AE64_02_trap:
bra_long_case_AE64_03_though:
bra_long_case_AE64_04:
bra_case_AE64_00_игрок_без_рожи:
bra_case_AE64_01_tsubasa:
bra_case_AE64_02_misaki:
bra_case_AE64_03_misaki:
bra_case_AE64_04_hyuga:
bra_case_AE64_05_hyuga:
bra_case_AE64_06_misugi:
bra_case_AE64_07_misugi:
bra_case_AE64_08_matsuyama:
bra_case_AE64_09_matsuyama:
bra_case_AE64_0A_ishizaki:
bra_case_AE64_0B_ishizaki:
bra_case_AE64_0C_souda:
bra_case_AE64_0D_souda:
bra_case_AE64_0E_jitou:
bra_case_AE64_0F_jitou:
bra_case_AE64_12_nitta:
bra_case_AE64_13_nitta:
bra_case_AE64_14_sawada:
bra_case_AE64_15_sawada:
- D - I - 0x022E74 11:AE64: 32        .byte con_pause + $32
- D - I - 0x022E75 11:AE65: 1F        .byte con_bg + $1F
- D - I - 0x022E76 11:AE66: 64        .byte con_animation + $64
- D - I - 0x022E77 11:AE67: 48        .byte con_cloud + $48
- D - I - 0x022E78 11:AE68: FB        .byte con_rts

bra_case_AE69_10_masao_kazuo:
- D - I - 0x022E79 11:AE69: F5        .byte con_mirror_off
- D - I - 0x022E7A 11:AE6A: F8        .byte con_F8, $04
- D - I - 0x022E7C 11:AE6C: 40        .byte con_pause + $40
- D - I - 0x022E7D 11:AE6D: 30        .byte con_bg + $30
- D - I - 0x022E7E 11:AE6E: 9C        .byte con_animation + $9C
- D - I - 0x022E7F 11:AE6F: A8        .byte con_cloud + $A8
- D - I - 0x022E80 11:AE70: F6        .byte con_mirror_toggle
- D - I - 0x022E81 11:AE71: F8        .byte con_F8, $04
- D - I - 0x022E83 11:AE73: 78        .byte con_pause + $78
- D - I - 0x022E84 11:AE74: 4F        .byte con_bg + $4F
- D - I - 0x022E85 11:AE75: 9C        .byte con_animation + $9C
- D - I - 0x022E86 11:AE76: A9        .byte con_cloud + $A9
- D - I - 0x022E87 11:AE77: F6        .byte con_mirror_toggle
- D - I - 0x022E88 11:AE78: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022E8B 11:AE7B: 32        .byte con_pause + $32
- D - I - 0x022E8C 11:AE7C: 1F        .byte con_bg + $1F
- D - I - 0x022E8D 11:AE7D: 64        .byte con_animation + $64
- D - I - 0x022E8E 11:AE7E: 00        .byte con_cloud + con_clear
- D - I - 0x022E8F 11:AE7F: F6        .byte con_mirror_toggle
- D - I - 0x022E90 11:AE80: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022E93 11:AE83: F8        .byte con_F8, $04
- D - I - 0x022E95 11:AE85: F7        .byte con_F7, $3A
- D - I - 0x022E97 11:AE87: 32        .byte con_pause + $32
- D - I - 0x022E98 11:AE88: 23        .byte con_bg + $23
- D - I - 0x022E99 11:AE89: 76        .byte con_animation + $76
- D - I - 0x022E9A 11:AE8A: F0        .byte con_cloud + con_skip
- D - I - 0x022E9B 11:AE8B: F6        .byte con_mirror_toggle
- D - I - 0x022E9C 11:AE8C: F7        .byte con_F7, $10
- D - I - 0x022E9E 11:AE8E: 20        .byte con_pause + $20
- D - I - 0x022E9F 11:AE8F: 05        .byte con_bg + $05
- D - I - 0x022EA0 11:AE90: 00        .byte con_animation + $00
- D - I - 0x022EA1 11:AE91: F0        .byte con_cloud + con_skip
- D - I - 0x022EA2 11:AE92: 28        .byte con_pause + $28
- D - I - 0x022EA3 11:AE93: 12        .byte con_bg + $12
- D - I - 0x022EA4 11:AE94: C0        .byte con_animation + $C0
- D - I - 0x022EA5 11:AE95: AF        .byte con_cloud + $AF
loc_AE96:
- D - I - 0x022EA6 11:AE96: F7        .byte con_F7, $1E
- D - I - 0x022EA8 11:AE98: F9        .byte con_soundID_delay, $6D, $02
- D - I - 0x022EAB 11:AE9B: 20        .byte con_pause + $20
- D - I - 0x022EAC 11:AE9C: 05        .byte con_bg + $05
- D - I - 0x022EAD 11:AE9D: F0        .byte con_animation + con_skip
- D - I - 0x022EAE 11:AE9E: F0        .byte con_cloud + con_skip
- D - I - 0x022EAF 11:AE9F: 32        .byte con_pause + $32
- D - I - 0x022EB0 11:AEA0: 20        .byte con_bg + $20
- D - I - 0x022EB1 11:AEA1: 4B        .byte con_animation + $4B
- D - I - 0x022EB2 11:AEA2: 00        .byte con_cloud + con_clear
- D - I - 0x022EB3 11:AEA3: FB        .byte con_rts

bra_case_AEA4_11_masao_kazuo:
- D - I - 0x022EB4 11:AEA4: F5        .byte con_mirror_off
- D - I - 0x022EB5 11:AEA5: F8        .byte con_F8, $04
- D - I - 0x022EB7 11:AEA7: 40        .byte con_pause + $40
- D - I - 0x022EB8 11:AEA8: 30        .byte con_bg + $30
- D - I - 0x022EB9 11:AEA9: AB        .byte con_animation + $AB
- D - I - 0x022EBA 11:AEAA: A8        .byte con_cloud + $A8
- D - I - 0x022EBB 11:AEAB: F6        .byte con_mirror_toggle
- D - I - 0x022EBC 11:AEAC: F8        .byte con_F8, $04
- D - I - 0x022EBE 11:AEAE: 78        .byte con_pause + $78
- D - I - 0x022EBF 11:AEAF: 4F        .byte con_bg + $4F
- D - I - 0x022EC0 11:AEB0: AB        .byte con_animation + $AB
- D - I - 0x022EC1 11:AEB1: A9        .byte con_cloud + $A9
- D - I - 0x022EC2 11:AEB2: F6        .byte con_mirror_toggle
- D - I - 0x022EC3 11:AEB3: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022EC6 11:AEB6: 32        .byte con_pause + $32
- D - I - 0x022EC7 11:AEB7: 1F        .byte con_bg + $1F
- D - I - 0x022EC8 11:AEB8: 64        .byte con_animation + $64
- D - I - 0x022EC9 11:AEB9: 00        .byte con_cloud + con_clear
- D - I - 0x022ECA 11:AEBA: F6        .byte con_mirror_toggle
- D - I - 0x022ECB 11:AEBB: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022ECE 11:AEBE: F8        .byte con_F8, $04
- D - I - 0x022ED0 11:AEC0: F7        .byte con_F7, $3A
- D - I - 0x022ED2 11:AEC2: 32        .byte con_pause + $32
- D - I - 0x022ED3 11:AEC3: 23        .byte con_bg + $23
- D - I - 0x022ED4 11:AEC4: 76        .byte con_animation + $76
- D - I - 0x022ED5 11:AEC5: F0        .byte con_cloud + con_skip
- D - I - 0x022ED6 11:AEC6: F6        .byte con_mirror_toggle
- D - I - 0x022ED7 11:AEC7: F7        .byte con_F7, $10
- D - I - 0x022ED9 11:AEC9: 20        .byte con_pause + $20
- D - I - 0x022EDA 11:AECA: 05        .byte con_bg + $05
- D - I - 0x022EDB 11:AECB: 00        .byte con_animation + $00
- D - I - 0x022EDC 11:AECC: F0        .byte con_cloud + con_skip
- D - I - 0x022EDD 11:AECD: 28        .byte con_pause + $28
- D - I - 0x022EDE 11:AECE: 12        .byte con_bg + $12
- D - I - 0x022EDF 11:AECF: E1        .byte con_animation + $E1
- D - I - 0x022EE0 11:AED0: AF        .byte con_cloud + $AF
- D - I - 0x022EE1 11:AED1: F2        .byte con_jmp
- D - I - 0x022EE2 11:AED2: 96 AE     .word loc_AE96

bra_long_case_AED4_01_skylab_twin_shot:
- D - I - 0x022EE4 11:AED4: F4        .byte con_mirror_on
- D - I - 0x022EE5 11:AED5: F8        .byte con_F8, $04
- D - I - 0x022EE7 11:AED7: 40        .byte con_pause + $40
- D - I - 0x022EE8 11:AED8: 4F        .byte con_bg + $4F
- D - I - 0x022EE9 11:AED9: 9C        .byte con_animation + $9C
- D - I - 0x022EEA 11:AEDA: A8        .byte con_cloud + $A8
- D - I - 0x022EEB 11:AEDB: F6        .byte con_mirror_toggle
- D - I - 0x022EEC 11:AEDC: F8        .byte con_F8, $04
- D - I - 0x022EEE 11:AEDE: 78        .byte con_pause + $78
- D - I - 0x022EEF 11:AEDF: 30        .byte con_bg + $30
- D - I - 0x022EF0 11:AEE0: A0        .byte con_animation + $A0
- D - I - 0x022EF1 11:AEE1: AE        .byte con_cloud + $AE
- D - I - 0x022EF2 11:AEE2: F6        .byte con_mirror_toggle
- D - I - 0x022EF3 11:AEE3: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022EF6 11:AEE6: F7        .byte con_F7, $02
- D - I - 0x022EF8 11:AEE8: 1E        .byte con_pause + $1E
- D - I - 0x022EF9 11:AEE9: 22        .byte con_bg + $22
- D - I - 0x022EFA 11:AEEA: 6B        .byte con_animation + $6B
- D - I - 0x022EFB 11:AEEB: 00        .byte con_cloud + con_clear
- D - I - 0x022EFC 11:AEEC: F6        .byte con_mirror_toggle
- D - I - 0x022EFD 11:AEED: FC        .byte con_moving_bg, $03
- D - I - 0x022EFF 11:AEEF: F9        .byte con_soundID_delay, $28, $02
- D - I - 0x022F02 11:AEF2: 20        .byte con_pause + $20
- D - I - 0x022F03 11:AEF3: 59        .byte con_bg + $59
- D - I - 0x022F04 11:AEF4: EA        .byte con_animation + $EA
- D - I - 0x022F05 11:AEF5: F0        .byte con_cloud + con_skip
- D - I - 0x022F06 11:AEF6: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x022F09 11:AEF9: F7        .byte con_F7, $02
- D - I - 0x022F0B 11:AEFB: 1E        .byte con_pause + $1E
- D - I - 0x022F0C 11:AEFC: 22        .byte con_bg + $22
- D - I - 0x022F0D 11:AEFD: 6B        .byte con_animation + $6B
- D - I - 0x022F0E 11:AEFE: F0        .byte con_cloud + con_skip
- D - I - 0x022F0F 11:AEFF: F7        .byte con_F7, $0F
- D - I - 0x022F11 11:AF01: 14        .byte con_pause + $14
- D - I - 0x022F12 11:AF02: 05        .byte con_bg + $05
- D - I - 0x022F13 11:AF03: 00        .byte con_animation + $00
- D - I - 0x022F14 11:AF04: F0        .byte con_cloud + con_skip
- D - I - 0x022F15 11:AF05: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x022F18 11:AF08: 1E        .byte con_pause + $1E
- D - I - 0x022F19 11:AF09: 3C        .byte con_bg + $3C
- D - I - 0x022F1A 11:AF0A: C2        .byte con_animation + $C2
- D - I - 0x022F1B 11:AF0B: F0        .byte con_cloud + con_skip
- D - I - 0x022F1C 11:AF0C: F6        .byte con_mirror_toggle
- D - I - 0x022F1D 11:AF0D: F8        .byte con_F8, $04
- D - I - 0x022F1F 11:AF0F: 3C        .byte con_pause + $3C
- D - I - 0x022F20 11:AF10: 4F        .byte con_bg + $4F
- D - I - 0x022F21 11:AF11: 9C        .byte con_animation + $9C
- D - I - 0x022F22 11:AF12: 13        .byte con_cloud + $13
- D - I - 0x022F23 11:AF13: F6        .byte con_mirror_toggle
- D - I - 0x022F24 11:AF14: F8        .byte con_F8, $04
- D - I - 0x022F26 11:AF16: 3C        .byte con_pause + $3C
- D - I - 0x022F27 11:AF17: 30        .byte con_bg + $30
- D - I - 0x022F28 11:AF18: 9C        .byte con_animation + $9C
- D - I - 0x022F29 11:AF19: AF        .byte con_cloud + $AF
- D - I - 0x022F2A 11:AF1A: F6        .byte con_mirror_toggle
- D - I - 0x022F2B 11:AF1B: 3C        .byte con_pause + $3C
- D - I - 0x022F2C 11:AF1C: 30        .byte con_bg + $30
- D - I - 0x022F2D 11:AF1D: A0        .byte con_animation + $A0
- D - I - 0x022F2E 11:AF1E: B0        .byte con_cloud + $B0
- D - I - 0x022F2F 11:AF1F: FA        .byte con_jsr
- D - I - 0x022F30 11:AF20: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022F32 11:AF22: F6        .byte con_mirror_toggle
- D - I - 0x022F33 11:AF23: F7        .byte con_F7, $10
- D - I - 0x022F35 11:AF25: F9        .byte con_soundID_delay, $6D, $02
- D - I - 0x022F38 11:AF28: 1E        .byte con_pause + $1E
- D - I - 0x022F39 11:AF29: 05        .byte con_bg + $05
- D - I - 0x022F3A 11:AF2A: C2        .byte con_animation + $C2
- D - I - 0x022F3B 11:AF2B: EE        .byte con_cloud + $EE
- D - I - 0x022F3C 11:AF2C: 3C        .byte con_pause + $3C
- D - I - 0x022F3D 11:AF2D: 20        .byte con_bg + $20
- D - I - 0x022F3E 11:AF2E: C3        .byte con_animation + $C3
- D - I - 0x022F3F 11:AF2F: F0        .byte con_cloud + con_skip
- D - I - 0x022F40 11:AF30: FB        .byte con_rts

bra_long_case_AF31_03:
- D - I - 0x022F41 11:AF31: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022F44 11:AF34: 37        .byte con_pause + $37
- D - I - 0x022F45 11:AF35: 47        .byte con_bg + $47
- D - I - 0x022F46 11:AF36: C9        .byte con_animation + $C9
- D - I - 0x022F47 11:AF37: 6B        .byte con_cloud + $6B
- D - I - 0x022F48 11:AF38: FA        .byte con_jsr
- D - I - 0x022F49 11:AF39: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022F4B 11:AF3B: F7        .byte con_F7, $0E
- D - I - 0x022F4D 11:AF3D: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x022F50 11:AF40: 28        .byte con_pause + $28
- D - I - 0x022F51 11:AF41: 05        .byte con_bg + $05
- D - I - 0x022F52 11:AF42: CB        .byte con_animation + $CB
- D - I - 0x022F53 11:AF43: EF        .byte con_cloud + $EF
- D - I - 0x022F54 11:AF44: F6        .byte con_mirror_toggle
- D - I - 0x022F55 11:AF45: F9        .byte con_soundID_delay, $6D, $02
- D - I - 0x022F58 11:AF48: 28        .byte con_pause + $28
- D - I - 0x022F59 11:AF49: 20        .byte con_bg + $20
- D - I - 0x022F5A 11:AF4A: AC        .byte con_animation + $AC
- D - I - 0x022F5B 11:AF4B: F0        .byte con_cloud + con_skip
- D - I - 0x022F5C 11:AF4C: FA        .byte con_jsr
- D - I - 0x022F5D 11:AF4D: C7 BB     .word sub_BBC7_очистка
- D - I - 0x022F5F 11:AF4F: F6        .byte con_mirror_toggle
- D - I - 0x022F60 11:AF50: FB        .byte con_rts

bra_long_case_AF51_00:
- D - I - 0x022F61 11:AF51: F9        .byte con_soundID_delay, $2B, $05
- D - I - 0x022F64 11:AF54: 3C        .byte con_pause + $3C
- D - I - 0x022F65 11:AF55: 72        .byte con_bg + $72
- D - I - 0x022F66 11:AF56: 66        .byte con_animation + $66
- D - I - 0x022F67 11:AF57: 47        .byte con_cloud + $47
- D - I - 0x022F68 11:AF58: FB        .byte con_rts

bra_long_case_AF59_01:
- D - I - 0x022F69 11:AF59: F5        .byte con_mirror_off
- D - I - 0x022F6A 11:AF5A: 3C        .byte con_pause + $3C
- D - I - 0x022F6B 11:AF5B: 30        .byte con_bg + $30
- D - I - 0x022F6C 11:AF5C: 91        .byte con_animation + $91
- D - I - 0x022F6D 11:AF5D: C2        .byte con_cloud + $C2
- D - I - 0x022F6E 11:AF5E: F7        .byte con_F7, $10
- D - I - 0x022F70 11:AF60: F9        .byte con_soundID_delay, $12, $02
- D - I - 0x022F73 11:AF63: 14        .byte con_pause + $14
- D - I - 0x022F74 11:AF64: 10        .byte con_bg + $10
- D - I - 0x022F75 11:AF65: 62        .byte con_animation + $62
- D - I - 0x022F76 11:AF66: F0        .byte con_cloud + con_skip
- D - I - 0x022F77 11:AF67: F7        .byte con_F7, $02
- D - I - 0x022F79 11:AF69: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x022F7C 11:AF6C: 27        .byte con_pause + $27
- D - I - 0x022F7D 11:AF6D: 24        .byte con_bg + $24
- D - I - 0x022F7E 11:AF6E: 66        .byte con_animation + $66
- D - I - 0x022F7F 11:AF6F: F0        .byte con_cloud + con_skip
- D - I - 0x022F80 11:AF70: F2        .byte con_jmp
- D - I - 0x022F81 11:AF71: 6B AB     .word loc_AB6B

sub_AF73:
- D - I - 0x022F83 11:AF73: F6        .byte con_mirror_toggle
- D - I - 0x022F84 11:AF74: 3C        .byte con_pause + $3C
- D - I - 0x022F85 11:AF75: 30        .byte con_bg + $30
- D - I - 0x022F86 11:AF76: 9F        .byte con_animation + $9F
- D - I - 0x022F87 11:AF77: C2        .byte con_cloud + $C2
loc_AF78:
sub_AF78:
- D - I - 0x022F88 11:AF78: F7        .byte con_F7, $15
- D - I - 0x022F8A 11:AF7A: F9        .byte con_soundID_delay, $1D, $09
- D - I - 0x022F8D 11:AF7D: 20        .byte con_pause + $20
- D - I - 0x022F8E 11:AF7E: 05        .byte con_bg + $05
- D - I - 0x022F8F 11:AF7F: CE        .byte con_animation + $CE
- D - I - 0x022F90 11:AF80: 00        .byte con_cloud + con_clear
- D - I - 0x022F91 11:AF81: F7        .byte con_F7, $10
- D - I - 0x022F93 11:AF83: 0D        .byte con_pause + $0D
- D - I - 0x022F94 11:AF84: 05        .byte con_bg + $05
- D - I - 0x022F95 11:AF85: 00        .byte con_animation + $00
- D - I - 0x022F96 11:AF86: 00        .byte con_cloud + con_clear
- D - I - 0x022F97 11:AF87: FB        .byte con_rts

sub_AF88:
- D - I - 0x022F98 11:AF88: F6        .byte con_mirror_toggle
- D - I - 0x022F99 11:AF89: 3C        .byte con_pause + $3C
- D - I - 0x022F9A 11:AF8A: 30        .byte con_bg + $30
- D - I - 0x022F9B 11:AF8B: AD        .byte con_animation + $AD
- D - I - 0x022F9C 11:AF8C: C2        .byte con_cloud + $C2
- D - I - 0x022F9D 11:AF8D: F2        .byte con_jmp
- D - I - 0x022F9E 11:AF8E: 78 AF     .word loc_AF78

bra_long_case_AF90_02:
- D - I - 0x022FA0 11:AF90: F3        .byte con_branch, $B2     ; проверка на соду
- D - I - 0x022FA2 11:AF92: 02        .byte bra_case_AF94_00_это_souda - *
- D - I - 0x022FA3 11:AF93: 11        .byte bra_case_AFA4_01_это_не_souda - *

bra_case_AF94_00_это_souda:
- D - I - 0x022FA4 11:AF94: FA        .byte con_jsr
- D - I - 0x022FA5 11:AF95: 73 AF     .word sub_AF73
loc_AF97:
- D - I - 0x022FA7 11:AF97: F6        .byte con_mirror_toggle
- D - I - 0x022FA8 11:AF98: F7        .byte con_F7, $02
- D - I - 0x022FAA 11:AF9A: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x022FAD 11:AF9D: 27        .byte con_pause + $27
- D - I - 0x022FAE 11:AF9E: 24        .byte con_bg + $24
- D - I - 0x022FAF 11:AF9F: 66        .byte con_animation + $66
- D - I - 0x022FB0 11:AFA0: F0        .byte con_cloud + con_skip
- D - I - 0x022FB1 11:AFA1: F2        .byte con_jmp
- D - I - 0x022FB2 11:AFA2: 6B AB     .word loc_AB6B

bra_case_AFA4_01_это_не_souda:
- D - I - 0x022FB4 11:AFA4: FA        .byte con_jsr
- D - I - 0x022FB5 11:AFA5: 88 AF     .word sub_AF88
- D - I - 0x022FB7 11:AFA7: F2        .byte con_jmp
- D - I - 0x022FB8 11:AFA8: 97 AF     .word loc_AF97

bra_long_case_AFAA_03:
- D - I - 0x022FBA 11:AFAA: F5        .byte con_mirror_off
- D - I - 0x022FBB 11:AFAB: F7        .byte con_F7, $10
- D - I - 0x022FBD 11:AFAD: F9        .byte con_soundID_delay, $12, $02
- D - I - 0x022FC0 11:AFB0: 1D        .byte con_pause + $1D
- D - I - 0x022FC1 11:AFB1: 10        .byte con_bg + $10
- D - I - 0x022FC2 11:AFB2: 62        .byte con_animation + $62
- D - I - 0x022FC3 11:AFB3: 49        .byte con_cloud + $49
- D - I - 0x022FC4 11:AFB4: F7        .byte con_F7, $02
- D - I - 0x022FC6 11:AFB6: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x022FC9 11:AFB9: 37        .byte con_pause + $37
- D - I - 0x022FCA 11:AFBA: 24        .byte con_bg + $24
- D - I - 0x022FCB 11:AFBB: 66        .byte con_animation + $66
- D - I - 0x022FCC 11:AFBC: F0        .byte con_cloud + con_skip
- D - I - 0x022FCD 11:AFBD: FB        .byte con_rts

bra_long_case_AFBE_02_header:
- D - I - 0x022FCE 11:AFBE: F9        .byte con_soundID_delay, $1B, $21
- D - I - 0x022FD1 11:AFC1: 48        .byte con_pause + $48
- D - I - 0x022FD2 11:AFC2: 2A        .byte con_bg + $2A
- D - I - 0x022FD3 11:AFC3: 3B        .byte con_animation + $3B
- D - I - 0x022FD4 11:AFC4: 47        .byte con_cloud + $47
bra_long_case_AFC5_00___:
- D - I - 0x022FD5 11:AFC5: FB        .byte con_rts

bra_long_case_AFC6_04_drive_overhead:
- D - I - 0x022FD6 11:AFC6: 01        .byte con_pause + $01
- D - I - 0x022FD7 11:AFC7: 71        .byte con_bg + $71
- D - I - 0x022FD8 11:AFC8: 00        .byte con_animation + $00
- D - I - 0x022FD9 11:AFC9: 00        .byte con_cloud + con_clear
- D - I - 0x022FDA 11:AFCA: F6        .byte con_mirror_toggle
- D - I - 0x022FDB 11:AFCB: 3C        .byte con_pause + $3C
- D - I - 0x022FDC 11:AFCC: 30        .byte con_bg + $30
- D - I - 0x022FDD 11:AFCD: 91        .byte con_animation + $91
- D - I - 0x022FDE 11:AFCE: A4        .byte con_cloud + $A4
- D - I - 0x022FDF 11:AFCF: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x022FE2 11:AFD2: 22        .byte con_pause + $22
- D - I - 0x022FE3 11:AFD3: 20        .byte con_bg + $20
- D - I - 0x022FE4 11:AFD4: ED        .byte con_animation + $ED
- D - I - 0x022FE5 11:AFD5: F0        .byte con_cloud + con_skip
- D - I - 0x022FE6 11:AFD6: F7        .byte con_F7, $10
- D - I - 0x022FE8 11:AFD8: 1C        .byte con_pause + $1C
- D - I - 0x022FE9 11:AFD9: 05        .byte con_bg + $05
- D - I - 0x022FEA 11:AFDA: 00        .byte con_animation + $00
- D - I - 0x022FEB 11:AFDB: 00        .byte con_cloud + con_clear
- D - I - 0x022FEC 11:AFDC: F9        .byte con_soundID_delay, $2B, $31
- D - I - 0x022FEF 11:AFDF: 40        .byte con_pause + $40
- D - I - 0x022FF0 11:AFE0: 47        .byte con_bg + $47
- D - I - 0x022FF1 11:AFE1: BF        .byte con_animation + $BF
- D - I - 0x022FF2 11:AFE2: 49        .byte con_cloud + $49
- D - I - 0x022FF3 11:AFE3: F6        .byte con_mirror_toggle
- D - I - 0x022FF4 11:AFE4: FB        .byte con_rts

bra_long_case_AFE5_08_skylab_hurricane:
- D - I - 0x022FF5 11:AFE5: F9        .byte con_soundID_delay, $1A, $21
- D - I - 0x022FF8 11:AFE8: 50        .byte con_pause + $50
- D - I - 0x022FF9 11:AFE9: 2A        .byte con_bg + $2A
- D - I - 0x022FFA 11:AFEA: 3B        .byte con_animation + $3B
- D - I - 0x022FFB 11:AFEB: 49        .byte con_cloud + $49
- D - I - 0x022FFC 11:AFEC: FB        .byte con_rts

bra_long_case_AFED_0A_skylab_twin_shot:
- D - I - 0x022FFD 11:AFED: F2        .byte con_jmp
- D - I - 0x022FFE 11:AFEE: 2E B2     .word loc_B22E

bra_long_case_AFF0_0E_overhead:
- D - I - 0x023000 11:AFF0: F3        .byte con_branch, $C0
- D - I - 0x023002 11:AFF2: 29        .byte bra_case_B01B_00_игрок_без_рожи - *
- D - I - 0x023003 11:AFF3: 21        .byte bra_case_B014_01_tsubasa - *
- D - I - 0x023004 11:AFF4: 31        .byte bra_case_B025_02_misaki - *
- - - - - 0x023005 11:AFF5: 37        .byte bra_case_B02C_03_misaki - *
- D - I - 0x023006 11:AFF6: 3D        .byte bra_case_B033_04_hyuga - *
- D - I - 0x023007 11:AFF7: 43        .byte bra_case_B03A_05_hyuga - *
- - - - - 0x023008 11:AFF8: 23        .byte bra_case_B01B_06_misugi - *
- - - - - 0x023009 11:AFF9: 22        .byte bra_case_B01B_07_misugi - *
- D - I - 0x02300A 11:AFFA: 47        .byte bra_case_B041_08_matsuyama - *
- - - - - 0x02300B 11:AFFB: 4D        .byte bra_case_B048_09_matsuyama - *
- - - - - 0x02300C 11:AFFC: 1F        .byte bra_case_B01B_0A_ishizaki - *
- - - - - 0x02300D 11:AFFD: 1E        .byte bra_case_B01B_0B_ishizaki - *
- - - - - 0x02300E 11:AFFE: 1D        .byte bra_case_B01B_0C_souda - *
- - - - - 0x02300F 11:AFFF: 1C        .byte bra_case_B01B_0D_souda - *
- - - - - 0x023010 11:B000: 1B        .byte bra_case_B01B_0E_jitou - *
- - - - - 0x023011 11:B001: 1A        .byte bra_case_B01B_0F_jitou - *
- - - - - 0x023012 11:B002: 19        .byte bra_case_B01B_10_masao_kazuo - *
- - - - - 0x023013 11:B003: 18        .byte bra_case_B01B_11_masao_kazuo - *
- - - - - 0x023014 11:B004: 17        .byte bra_case_B01B_12_nitta - *
- - - - - 0x023015 11:B005: 16        .byte bra_case_B01B_13_nitta - *
- - - - - 0x023016 11:B006: 15        .byte bra_case_B01B_14_sawada - *
- - - - - 0x023017 11:B007: 14        .byte bra_case_B01B_15_sawada - *
- - - - - 0x023018 11:B008: 47        .byte bra_case_B04F_16_coimbra - *
- - - - - 0x023019 11:B009: 4D        .byte bra_case_B056_17_carlos - *
- D - I - 0x02301A 11:B00A: 53        .byte bra_case_B05D_18_carlos - *
- - - - - 0x02301B 11:B00B: 59        .byte bra_case_B064_19_schneider - *
- - - - - 0x02301C 11:B00C: 0F        .byte bra_case_B01B_1A_kaltz - *
- - - - - 0x02301D 11:B00D: 0E        .byte bra_case_B01B_1B_schester - *
- - - - - 0x02301E 11:B00E: 5D        .byte bra_case_B06B_1C_diaz - *
- - - - - 0x02301F 11:B00F: 0C        .byte bra_case_B01B_1D_pascal - *
- - - - - 0x023020 11:B010: 0B        .byte bra_case_B01B_1E_pierre - *
- - - - - 0x023021 11:B011: 0A        .byte bra_case_B01B_1F_napoleon - *
- D - I - 0x023022 11:B012: 60        .byte bra_case_B072_20_victorino - *
- - - - - 0x023023 11:B013: 08        .byte bra_case_B01B_21_kaltz - *

bra_case_B014_01_tsubasa:
- D - I - 0x023024 11:B014: 3C        .byte con_pause + $3C
- D - I - 0x023025 11:B015: 30        .byte con_bg + $30
- D - I - 0x023026 11:B016: 91        .byte con_animation + $91
- D - I - 0x023027 11:B017: B4        .byte con_cloud + $B4
loc_B018:
- D - I - 0x023028 11:B018: FA        .byte con_jsr
- D - I - 0x023029 11:B019: C7 BB     .word sub_BBC7_очистка
; bzk продолжение, лучше сделать прыжок
_scenario_B01B_76:
bra_case_B01B_00_игрок_без_рожи:
bra_case_B01B_06_misugi:
bra_case_B01B_07_misugi:
bra_case_B01B_0A_ishizaki:
bra_case_B01B_0B_ishizaki:
bra_case_B01B_0C_souda:
bra_case_B01B_0D_souda:
bra_case_B01B_0E_jitou:
bra_case_B01B_0F_jitou:
bra_case_B01B_10_masao_kazuo:
bra_case_B01B_11_masao_kazuo:
bra_case_B01B_12_nitta:
bra_case_B01B_13_nitta:
bra_case_B01B_14_sawada:
bra_case_B01B_15_sawada:
bra_case_B01B_1A_kaltz:
bra_case_B01B_1B_schester:
bra_case_B01B_1D_pascal:
bra_case_B01B_1E_pierre:
bra_case_B01B_1F_napoleon:
bra_case_B01B_21_kaltz:
- D - I - 0x02302B 11:B01B: F6        .byte con_mirror_toggle
- D - I - 0x02302C 11:B01C: F9        .byte con_soundID_delay, $1A, $31
- D - I - 0x02302F 11:B01F: 64        .byte con_pause + $64
- D - I - 0x023030 11:B020: 4C        .byte con_bg + $4C
- D - I - 0x023031 11:B021: BF        .byte con_animation + $BF
- D - I - 0x023032 11:B022: 49        .byte con_cloud + $49
- D - I - 0x023033 11:B023: F6        .byte con_mirror_toggle
- D - I - 0x023034 11:B024: FB        .byte con_rts

bra_case_B025_02_misaki:
- D - I - 0x023035 11:B025: 3C        .byte con_pause + $3C
- D - I - 0x023036 11:B026: 30        .byte con_bg + $30
- D - I - 0x023037 11:B027: 96        .byte con_animation + $96
- D - I - 0x023038 11:B028: B4        .byte con_cloud + $B4
- D - I - 0x023039 11:B029: F2        .byte con_jmp
- D - I - 0x02303A 11:B02A: 18 B0     .word loc_B018

bra_case_B02C_03_misaki:
- - - - - 0x02303C 11:B02C: 3C        .byte con_pause + $3C
- - - - - 0x02303D 11:B02D: 30        .byte con_bg + $30
- - - - - 0x02303E 11:B02E: 97        .byte con_animation + $97
- - - - - 0x02303F 11:B02F: B4        .byte con_cloud + $B4
- - - - - 0x023040 11:B030: F2        .byte con_jmp
- - - - - 0x023041 11:B031: 18 B0     .word loc_B018

bra_case_B033_04_hyuga:
- D - I - 0x023043 11:B033: 3C        .byte con_pause + $3C
- D - I - 0x023044 11:B034: 31        .byte con_bg + $31
- D - I - 0x023045 11:B035: 9E        .byte con_animation + $9E
- D - I - 0x023046 11:B036: B4        .byte con_cloud + $B4
- D - I - 0x023047 11:B037: F2        .byte con_jmp
- D - I - 0x023048 11:B038: 18 B0     .word loc_B018

bra_case_B03A_05_hyuga:
- D - I - 0x02304A 11:B03A: 3C        .byte con_pause + $3C
- D - I - 0x02304B 11:B03B: 31        .byte con_bg + $31
- D - I - 0x02304C 11:B03C: B0        .byte con_animation + $B0
- D - I - 0x02304D 11:B03D: B4        .byte con_cloud + $B4
- D - I - 0x02304E 11:B03E: F2        .byte con_jmp
- D - I - 0x02304F 11:B03F: 18 B0     .word loc_B018

bra_case_B041_08_matsuyama:
- D - I - 0x023051 11:B041: 3C        .byte con_pause + $3C
- D - I - 0x023052 11:B042: 30        .byte con_bg + $30
- D - I - 0x023053 11:B043: A1        .byte con_animation + $A1
- D - I - 0x023054 11:B044: B4        .byte con_cloud + $B4
- D - I - 0x023055 11:B045: F2        .byte con_jmp
- D - I - 0x023056 11:B046: 18 B0     .word loc_B018

bra_case_B048_09_matsuyama:
- - - - - 0x023058 11:B048: 3C        .byte con_pause + $3C
- - - - - 0x023059 11:B049: 30        .byte con_bg + $30
- - - - - 0x02305A 11:B04A: AF        .byte con_animation + $AF
- - - - - 0x02305B 11:B04B: B4        .byte con_cloud + $B4
- - - - - 0x02305C 11:B04C: F2        .byte con_jmp
- - - - - 0x02305D 11:B04D: 18 B0     .word loc_B018

bra_case_B04F_16_coimbra:
- - - - - 0x02305F 11:B04F: 3C        .byte con_pause + $3C
- - - - - 0x023060 11:B050: 30        .byte con_bg + $30
- - - - - 0x023061 11:B051: BC        .byte con_animation + $BC
- - - - - 0x023062 11:B052: B4        .byte con_cloud + $B4
- - - - - 0x023063 11:B053: F2        .byte con_jmp
- - - - - 0x023064 11:B054: 18 B0     .word loc_B018

bra_case_B056_17_carlos:
- - - - - 0x023066 11:B056: 3C        .byte con_pause + $3C
- - - - - 0x023067 11:B057: 30        .byte con_bg + $30
- - - - - 0x023068 11:B058: A9        .byte con_animation + $A9
- - - - - 0x023069 11:B059: B4        .byte con_cloud + $B4
- - - - - 0x02306A 11:B05A: F2        .byte con_jmp
- - - - - 0x02306B 11:B05B: 18 B0     .word loc_B018

bra_case_B05D_18_carlos:
- D - I - 0x02306D 11:B05D: 3C        .byte con_pause + $3C
- D - I - 0x02306E 11:B05E: 30        .byte con_bg + $30
- D - I - 0x02306F 11:B05F: BB        .byte con_animation + $BB
- D - I - 0x023070 11:B060: B4        .byte con_cloud + $B4
- D - I - 0x023071 11:B061: F2        .byte con_jmp
- D - I - 0x023072 11:B062: 18 B0     .word loc_B018

bra_case_B064_19_schneider:
- - - - - 0x023074 11:B064: 3C        .byte con_pause + $3C
- - - - - 0x023075 11:B065: 30        .byte con_bg + $30
- - - - - 0x023076 11:B066: B8        .byte con_animation + $B8
- - - - - 0x023077 11:B067: B4        .byte con_cloud + $B4
- - - - - 0x023078 11:B068: F2        .byte con_jmp
- - - - - 0x023079 11:B069: 18 B0     .word loc_B018

bra_case_B06B_1C_diaz:
- - - - - 0x02307B 11:B06B: 3C        .byte con_pause + $3C
- - - - - 0x02307C 11:B06C: 30        .byte con_bg + $30
- - - - - 0x02307D 11:B06D: B7        .byte con_animation + $B7
- - - - - 0x02307E 11:B06E: B4        .byte con_cloud + $B4
- - - - - 0x02307F 11:B06F: F2        .byte con_jmp
- - - - - 0x023080 11:B070: 18 B0     .word loc_B018

bra_case_B072_20_victorino:
- D - I - 0x023082 11:B072: 3C        .byte con_pause + $3C
- D - I - 0x023083 11:B073: 30        .byte con_bg + $30
- D - I - 0x023084 11:B074: B2        .byte con_animation + $B2
- D - I - 0x023085 11:B075: B4        .byte con_cloud + $B4
- D - I - 0x023086 11:B076: F2        .byte con_jmp
- D - I - 0x023087 11:B077: 18 B0     .word loc_B018

bra_long_case_B079_0F_hyper_overhead:
- D - I - 0x023089 11:B079: F3        .byte con_branch, $BC     ; проверка на misugi
- D - I - 0x02308B 11:B07B: 02        .byte bra_case_B07D_00_это_misugi - *
- D - I - 0x02308C 11:B07C: 1B        .byte bra_case_B097_01_это_не_misugi - *

bra_case_B07D_00_это_misugi:
- D - I - 0x02308D 11:B07D: F6        .byte con_mirror_toggle
- D - I - 0x02308E 11:B07E: 3C        .byte con_pause + $3C
- D - I - 0x02308F 11:B07F: 30        .byte con_bg + $30
- D - I - 0x023090 11:B080: A3        .byte con_animation + $A3
- D - I - 0x023091 11:B081: B5        .byte con_cloud + $B5
loc_B082:
- D - I - 0x023092 11:B082: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023095 11:B085: 19        .byte con_pause + $19
- D - I - 0x023096 11:B086: 1F        .byte con_bg + $1F
- D - I - 0x023097 11:B087: AC        .byte con_animation + $AC
- D - I - 0x023098 11:B088: F0        .byte con_cloud + con_skip
- D - I - 0x023099 11:B089: FA        .byte con_jsr
- D - I - 0x02309A 11:B08A: C7 BB     .word sub_BBC7_очистка
- D - I - 0x02309C 11:B08C: F7        .byte con_F7, $1D
- D - I - 0x02309E 11:B08E: F9        .byte con_soundID_delay, $2B, $31
- D - I - 0x0230A1 11:B091: 4B        .byte con_pause + $4B
- D - I - 0x0230A2 11:B092: 49        .byte con_bg + $49
- D - I - 0x0230A3 11:B093: BF        .byte con_animation + $BF
- D - I - 0x0230A4 11:B094: 49        .byte con_cloud + $49
- D - I - 0x0230A5 11:B095: F6        .byte con_mirror_toggle
- D - I - 0x0230A6 11:B096: FB        .byte con_rts

bra_case_B097_01_это_не_misugi:
- D - I - 0x0230A7 11:B097: F6        .byte con_mirror_toggle
- D - I - 0x0230A8 11:B098: 3C        .byte con_pause + $3C
- D - I - 0x0230A9 11:B099: 30        .byte con_bg + $30
- D - I - 0x0230AA 11:B09A: AE        .byte con_animation + $AE
- D - I - 0x0230AB 11:B09B: B5        .byte con_cloud + $B5
- D - I - 0x0230AC 11:B09C: F2        .byte con_jmp
- D - I - 0x0230AD 11:B09D: 82 B0     .word loc_B082

bra_long_case_B09F_12_cyclone:
- - - - - 0x0230AF 11:B09F: F5        .byte con_mirror_off
- - - - - 0x0230B0 11:B0A0: F9        .byte con_soundID_delay, $2B, $19
- - - - - 0x0230B3 11:B0A3: 3C        .byte con_pause + $3C
- - - - - 0x0230B4 11:B0A4: 29        .byte con_bg + $29
- - - - - 0x0230B5 11:B0A5: C6        .byte con_animation + $C6
- - - - - 0x0230B6 11:B0A6: 00        .byte con_cloud + con_clear
loc_B0A7:
sub_B0A7:
- D - I - 0x0230B7 11:B0A7: F9        .byte con_soundID_delay, $22, $02
- D - I - 0x0230BA 11:B0AA: 64        .byte con_pause + $64
- D - I - 0x0230BB 11:B0AB: 52        .byte con_bg + $52
- D - I - 0x0230BC 11:B0AC: E5        .byte con_animation + $E5
- D - I - 0x0230BD 11:B0AD: B5        .byte con_cloud + $B5
- D - I - 0x0230BE 11:B0AE: F7        .byte con_F7, $2F
- D - I - 0x0230C0 11:B0B0: F9        .byte con_soundID_delay, $1F, $02
- D - I - 0x0230C3 11:B0B3: 64        .byte con_pause + $64
- D - I - 0x0230C4 11:B0B4: 4A        .byte con_bg + $4A
- D - I - 0x0230C5 11:B0B5: C7        .byte con_animation + $C7
- D - I - 0x0230C6 11:B0B6: F0        .byte con_cloud + con_skip
- D - I - 0x0230C7 11:B0B7: 3C        .byte con_pause + $3C
- D - I - 0x0230C8 11:B0B8: 30        .byte con_bg + $30
- D - I - 0x0230C9 11:B0B9: 91        .byte con_animation + $91
- D - I - 0x0230CA 11:B0BA: AF        .byte con_cloud + $AF
- D - I - 0x0230CB 11:B0BB: F9        .byte con_soundID_delay, $23, $11
- D - I - 0x0230CE 11:B0BE: F7        .byte con_F7, $04
- D - I - 0x0230D0 11:B0C0: 28        .byte con_pause + $28
- D - I - 0x0230D1 11:B0C1: 41        .byte con_bg + $41
- D - I - 0x0230D2 11:B0C2: 8C        .byte con_animation + $8C
- D - I - 0x0230D3 11:B0C3: 00        .byte con_cloud + con_clear
- D - I - 0x0230D4 11:B0C4: F2        .byte con_jmp
- D - I - 0x0230D5 11:B0C5: 42 AB     .word loc_AB42

bra_long_case_B0C8_1C_dynamite_header:
- D - I - 0x0230D8 11:B0C8: F7        .byte con_F7, $1E
- D - I - 0x0230DA 11:B0CA: F9        .byte con_soundID_delay, $1A, $21
- D - I - 0x0230DD 11:B0CD: 48        .byte con_pause + $48
- D - I - 0x0230DE 11:B0CE: 05        .byte con_bg + $05
- D - I - 0x0230DF 11:B0CF: 3B        .byte con_animation + $3B
- D - I - 0x0230E0 11:B0D0: 49        .byte con_cloud + $49
- D - I - 0x0230E1 11:B0D1: F7        .byte con_F7, $1E
- D - I - 0x0230E3 11:B0D3: FB        .byte con_rts

bra_long_case_B0D4_1D_cannon_header:
- - - - - 0x0230E4 11:B0D4: F7        .byte con_F7, $2A
- - - - - 0x0230E6 11:B0D6: F9        .byte con_soundID_delay, $1A, $21
- - - - - 0x0230E9 11:B0D9: 48        .byte con_pause + $48
- - - - - 0x0230EA 11:B0DA: 4B        .byte con_bg + $4B
- - - - - 0x0230EB 11:B0DB: 3B        .byte con_animation + $3B
- - - - - 0x0230EC 11:B0DC: 49        .byte con_cloud + $49
- - - - - 0x0230ED 11:B0DD: FB        .byte con_rts

bra_long_case_B0DE_1E_rocker_header:
- D - I - 0x0230EE 11:B0DE: F7        .byte con_F7, $20
- D - I - 0x0230F0 11:B0E0: F9        .byte con_soundID_delay, $1A, $21
- D - I - 0x0230F3 11:B0E3: 56        .byte con_pause + $56
- D - I - 0x0230F4 11:B0E4: 48        .byte con_bg + $48
- D - I - 0x0230F5 11:B0E5: CA        .byte con_animation + $CA
- D - I - 0x0230F6 11:B0E6: 49        .byte con_cloud + $49
- D - I - 0x0230F7 11:B0E7: FB        .byte con_rts

bra_long_case_B0E8_1F_rising_dragon_kick:
- D - I - 0x0230F8 11:B0E8: F9        .byte con_soundID_delay, $1A, $02
- D - I - 0x0230FB 11:B0EB: 1E        .byte con_pause + $1E
- D - I - 0x0230FC 11:B0EC: 1D        .byte con_bg + $1D
- D - I - 0x0230FD 11:B0ED: 69        .byte con_animation + $69
- D - I - 0x0230FE 11:B0EE: 49        .byte con_cloud + $49
- D - I - 0x0230FF 11:B0EF: FE        .byte con_FE
- D - I - 0x023101 11:B0F1: FC        .byte con_moving_bg, $03
- D - I - 0x023103 11:B0F3: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x023106 11:B0F6: 28        .byte con_pause + $28
- D - I - 0x023107 11:B0F7: 58        .byte con_bg + $58
- D - I - 0x023108 11:B0F8: 6A        .byte con_animation + $6A
- D - I - 0x023109 11:B0F9: F0        .byte con_cloud + con_skip
- D - I - 0x02310A 11:B0FA: FB        .byte con_rts

bra_long_case_B0FB_21_slider_cannon:
- D - I - 0x02310B 11:B0FB: F3        .byte con_branch, $A5     ; slider cannon уже били или нет
- D - I - 0x02310D 11:B0FD: 02        .byte bra_case_B0FF_00_slider_cannon_уже_били - *
- D - I - 0x02310E 11:B0FE: 43        .byte bra_case_B141_01_slider_cannon_еще_не_били - *

bra_case_B0FF_00_slider_cannon_уже_били:
- D - I - 0x02310F 11:B0FF: F5        .byte con_mirror_off
- D - I - 0x023110 11:B100: F7        .byte con_F7, $10
- D - I - 0x023112 11:B102: 28        .byte con_pause + $28
- D - I - 0x023113 11:B103: 05        .byte con_bg + $05
- D - I - 0x023114 11:B104: 00        .byte con_animation + $00
- D - I - 0x023115 11:B105: 00        .byte con_cloud + con_clear
- D - I - 0x023116 11:B106: F9        .byte con_soundID_delay, $46, $02
- D - I - 0x023119 11:B109: 10        .byte con_pause + $10
- D - I - 0x02311A 11:B10A: 54        .byte con_bg + $54
- D - I - 0x02311B 11:B10B: D4        .byte con_animation + $D4
- D - I - 0x02311C 11:B10C: 00        .byte con_cloud + con_clear
- D - I - 0x02311D 11:B10D: 78        .byte con_pause + $78
- D - I - 0x02311E 11:B10E: 30        .byte con_bg + $30
- D - I - 0x02311F 11:B10F: B5        .byte con_animation + $B5
- D - I - 0x023120 11:B110: 8A        .byte con_cloud + $8A
- D - I - 0x023121 11:B111: FA        .byte con_jsr
- D - I - 0x023122 11:B112: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023124 11:B114: F6        .byte con_mirror_toggle
- D - I - 0x023125 11:B115: 10        .byte con_pause + $10
- D - I - 0x023126 11:B116: 54        .byte con_bg + $54
- D - I - 0x023127 11:B117: D5        .byte con_animation + $D5
- D - I - 0x023128 11:B118: 8B        .byte con_cloud + $8B
- D - I - 0x023129 11:B119: B8        .byte con_pause + $B8
- D - I - 0x02312A 11:B11A: 30        .byte con_bg + $30
- D - I - 0x02312B 11:B11B: B4        .byte con_animation + $B4
- D - I - 0x02312C 11:B11C: F0        .byte con_cloud + con_skip
- D - I - 0x02312D 11:B11D: C0        .byte con_pause + $C0
- D - I - 0x02312E 11:B11E: F0        .byte con_bg + con_skip
- D - I - 0x02312F 11:B11F: F0        .byte con_animation + con_skip
- D - I - 0x023130 11:B120: F0        .byte con_cloud + con_skip
- D - I - 0x023131 11:B121: FA        .byte con_jsr
- D - I - 0x023132 11:B122: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023134 11:B124: F6        .byte con_mirror_toggle
- D - I - 0x023135 11:B125: 10        .byte con_pause + $10
- D - I - 0x023136 11:B126: 54        .byte con_bg + $54
- D - I - 0x023137 11:B127: D4        .byte con_animation + $D4
- D - I - 0x023138 11:B128: 8C        .byte con_cloud + $8C
- D - I - 0x023139 11:B129: B8        .byte con_pause + $B8
- D - I - 0x02313A 11:B12A: 30        .byte con_bg + $30
- D - I - 0x02313B 11:B12B: B5        .byte con_animation + $B5
- D - I - 0x02313C 11:B12C: F0        .byte con_cloud + con_skip
- D - I - 0x02313D 11:B12D: C0        .byte con_pause + $C0
- D - I - 0x02313E 11:B12E: F0        .byte con_bg + con_skip
- D - I - 0x02313F 11:B12F: F0        .byte con_animation + con_skip
- D - I - 0x023140 11:B130: F0        .byte con_cloud + con_skip
- D - I - 0x023141 11:B131: F7        .byte con_F7, $1F
- D - I - 0x023143 11:B133: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x023146 11:B136: 1E        .byte con_pause + $1E
- D - I - 0x023147 11:B137: 30        .byte con_bg + $30
- D - I - 0x023148 11:B138: B5        .byte con_animation + $B5
- D - I - 0x023149 11:B139: 8D        .byte con_cloud + $8D
- D - I - 0x02314A 11:B13A: F9        .byte con_soundID_delay, $7F, $02
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
bra_case_B141_01_slider_cannon_еще_не_били:
- D - I - 0x023151 11:B141: F5        .byte con_mirror_off
- D - I - 0x023152 11:B142: F8        .byte con_F8, $04
- D - I - 0x023154 11:B144: 3C        .byte con_pause + $3C
- D - I - 0x023155 11:B145: 30        .byte con_bg + $30
- D - I - 0x023156 11:B146: B5        .byte con_animation + $B5
- D - I - 0x023157 11:B147: C1        .byte con_cloud + $C1
- D - I - 0x023158 11:B148: F6        .byte con_mirror_toggle
- D - I - 0x023159 11:B149: F8        .byte con_F8, $04
- D - I - 0x02315B 11:B14B: 3C        .byte con_pause + $3C
- D - I - 0x02315C 11:B14C: 4F        .byte con_bg + $4F
- D - I - 0x02315D 11:B14D: B4        .byte con_animation + $B4
- D - I - 0x02315E 11:B14E: C0        .byte con_cloud + $C0
- D - I - 0x02315F 11:B14F: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023162 11:B152: 28        .byte con_pause + $28
- D - I - 0x023163 11:B153: 1F        .byte con_bg + $1F
- D - I - 0x023164 11:B154: EB        .byte con_animation + $EB
- D - I - 0x023165 11:B155: 00        .byte con_cloud + con_clear
- D - I - 0x023166 11:B156: F6        .byte con_mirror_toggle
- D - I - 0x023167 11:B157: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x02316A 11:B15A: 28        .byte con_pause + $28
- D - I - 0x02316B 11:B15B: 1F        .byte con_bg + $1F
- D - I - 0x02316C 11:B15C: EC        .byte con_animation + $EC
- D - I - 0x02316D 11:B15D: F0        .byte con_cloud + con_skip
- D - I - 0x02316E 11:B15E: F7        .byte con_F7, $31
- D - I - 0x023170 11:B160: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x023173 11:B163: 27        .byte con_pause + $27
- D - I - 0x023174 11:B164: 6A        .byte con_bg + $6A
- D - I - 0x023175 11:B165: DB        .byte con_animation + $DB
- D - I - 0x023176 11:B166: DE        .byte con_cloud + $DE
- D - I - 0x023177 11:B167: F7        .byte con_F7, $20
- D - I - 0x023179 11:B169: 5E        .byte con_pause + $5E
- D - I - 0x02317A 11:B16A: 49        .byte con_bg + $49
- D - I - 0x02317B 11:B16B: F0        .byte con_animation + con_skip
- D - I - 0x02317C 11:B16C: DE        .byte con_cloud + $DE
- D - I - 0x02317D 11:B16D: F7        .byte con_F7, $10
- D - I - 0x02317F 11:B16F: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x023182 11:B172: 1E        .byte con_pause + $1E
- D - I - 0x023183 11:B173: 05        .byte con_bg + $05
- D - I - 0x023184 11:B174: 00        .byte con_animation + $00
- D - I - 0x023185 11:B175: 00        .byte con_cloud + con_clear
- D - I - 0x023186 11:B176: F9        .byte con_soundID_delay, $09, $02
- D - I - 0x023189 11:B179: FC        .byte con_moving_bg, $03
- D - I - 0x02318B 11:B17B: 46        .byte con_pause + $46
- D - I - 0x02318C 11:B17C: 59        .byte con_bg + $59
- D - I - 0x02318D 11:B17D: DC        .byte con_animation + $DC
- D - I - 0x02318E 11:B17E: 04        .byte con_cloud + $04
- D - I - 0x02318F 11:B17F: F2        .byte con_jmp
- D - I - 0x023190 11:B180: C7 BB     .word loc_BBC7_очистка

bra_long_case_B182_01_volley:
- D - I - 0x023192 11:B182: FC        .byte con_moving_bg, $03
- D - I - 0x023194 11:B184: 1E        .byte con_pause + $1E
- D - I - 0x023195 11:B185: 58        .byte con_bg + $58
- D - I - 0x023196 11:B186: 68        .byte con_animation + $68
- D - I - 0x023197 11:B187: 47        .byte con_cloud + $47
- D - I - 0x023198 11:B188: F7        .byte con_F7, $28
- D - I - 0x02319A 11:B18A: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x02319D 11:B18D: 19        .byte con_pause + $19
- D - I - 0x02319E 11:B18E: 05        .byte con_bg + $05
- D - I - 0x02319F 11:B18F: 69        .byte con_animation + $69
- D - I - 0x0231A0 11:B190: F0        .byte con_cloud + con_skip
- D - I - 0x0231A1 11:B191: FC        .byte con_moving_bg, $03
- D - I - 0x0231A3 11:B193: 28        .byte con_pause + $28
- D - I - 0x0231A4 11:B194: 58        .byte con_bg + $58
- D - I - 0x0231A5 11:B195: 6A        .byte con_animation + $6A
- D - I - 0x0231A6 11:B196: F0        .byte con_cloud + con_skip
bra_long_case_B197_00___:
- D - I - 0x0231A7 11:B197: FB        .byte con_rts

bra_long_case_B198_06_falcon_volley:
- D - I - 0x0231A8 11:B198: F3        .byte con_branch, $B1     ; проверка на нитту
- D - I - 0x0231AA 11:B19A: 02        .byte bra_case_B19C_00_это_nitta - *
- - - - - 0x0231AB 11:B19B: 28        .byte bra_case_B1C3_01_это_не_nitta - *

bra_case_B19C_00_это_nitta:
- D - I - 0x0231AC 11:B19C: 3C        .byte con_pause + $3C
- D - I - 0x0231AD 11:B19D: 30        .byte con_bg + $30
- D - I - 0x0231AE 11:B19E: 9A        .byte con_animation + $9A
- D - I - 0x0231AF 11:B19F: BC        .byte con_cloud + $BC
loc_B1A0:
- D - I - 0x0231B0 11:B1A0: F7        .byte con_F7, $02
- D - I - 0x0231B2 11:B1A2: F6        .byte con_mirror_toggle
- D - I - 0x0231B3 11:B1A3: 14        .byte con_pause + $14
- D - I - 0x0231B4 11:B1A4: 24        .byte con_bg + $24
- D - I - 0x0231B5 11:B1A5: 6B        .byte con_animation + $6B
- D - I - 0x0231B6 11:B1A6: 00        .byte con_cloud + con_clear
- D - I - 0x0231B7 11:B1A7: F6        .byte con_mirror_toggle
- D - I - 0x0231B8 11:B1A8: F7        .byte con_F7, $10
- D - I - 0x0231BA 11:B1AA: 1E        .byte con_pause + $1E
- D - I - 0x0231BB 11:B1AB: 05        .byte con_bg + $05
- D - I - 0x0231BC 11:B1AC: 00        .byte con_animation + $00
- D - I - 0x0231BD 11:B1AD: F0        .byte con_cloud + con_skip
- D - I - 0x0231BE 11:B1AE: F7        .byte con_F7, $30
- D - I - 0x0231C0 11:B1B0: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x0231C3 11:B1B3: 28        .byte con_pause + $28
- D - I - 0x0231C4 11:B1B4: 47        .byte con_bg + $47
- D - I - 0x0231C5 11:B1B5: 69        .byte con_animation + $69
- D - I - 0x0231C6 11:B1B6: 49        .byte con_cloud + $49
- D - I - 0x0231C7 11:B1B7: FC        .byte con_moving_bg, $03
- D - I - 0x0231C9 11:B1B9: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x0231CC 11:B1BC: 28        .byte con_pause + $28
- D - I - 0x0231CD 11:B1BD: 58        .byte con_bg + $58
- D - I - 0x0231CE 11:B1BE: 6A        .byte con_animation + $6A
- D - I - 0x0231CF 11:B1BF: F0        .byte con_cloud + con_skip
- D - I - 0x0231D0 11:B1C0: FE        .byte con_FE
- D - I - 0x0231D2 11:B1C2: FB        .byte con_rts

bra_case_B1C3_01_это_не_nitta:
- - - - - 0x0231D3 11:B1C3: 3C        .byte con_pause + $3C
- - - - - 0x0231D4 11:B1C4: 30        .byte con_bg + $30
- - - - - 0x0231D5 11:B1C5: 9B        .byte con_animation + $9B
- - - - - 0x0231D6 11:B1C6: BC        .byte con_cloud + $BC
- - - - - 0x0231D7 11:B1C7: F2        .byte con_jmp
- - - - - 0x0231D8 11:B1C8: A0 B1     .word loc_B1A0

bra_long_case_B1CA_09_twin_shot:
- D - I - 0x0231DA 11:B1CA: F3        .byte con_branch, $C9
- D - I - 0x0231DC 11:B1CC: 34        .byte bra_case_B200_00 - *
- - - - - 0x0231DD 11:B1CD: 33        .byte bra_case_B200_01 - *
- - - - - 0x0231DE 11:B1CE: 10        .byte bra_case_B1DE_02 - *
- - - - - 0x0231DF 11:B1CF: 0F        .byte bra_case_B1DE_03 - *
- - - - - 0x0231E0 11:B1D0: 0E        .byte bra_case_B1DE_04 - *
- - - - - 0x0231E1 11:B1D1: 0D        .byte bra_case_B1DE_05 - *
- - - - - 0x0231E2 11:B1D2: 0C        .byte bra_case_B1DE_06 - *
- D - I - 0x0231E3 11:B1D3: 4D        .byte bra_case_B220_07 - *
- D - I - 0x0231E4 11:B1D4: 4C        .byte bra_case_B220_08 - *
- - - - - 0x0231E5 11:B1D5: 4B        .byte bra_case_B220_09 - *
- - - - - 0x0231E6 11:B1D6: 4A        .byte bra_case_B220_0A - *
- D - I - 0x0231E7 11:B1D7: 69        .byte bra_case_B240_0B - *
- D - I - 0x0231E8 11:B1D8: 68        .byte bra_case_B240_0C - *
- - - - - 0x0231E9 11:B1D9: 05        .byte bra_case_B1DE_0D - *
- - - - - 0x0231EA 11:B1DA: 04        .byte bra_case_B1DE_0E - *
- - - - - 0x0231EB 11:B1DB: 03        .byte bra_case_B1DE_0F - *
- - - - - 0x0231EC 11:B1DC: 02        .byte bra_case_B1DE_10 - *
- D - I - 0x0231ED 11:B1DD: 01        .byte bra_case_B1DE_11 - *

bra_case_B1DE_02:
bra_case_B1DE_03:
bra_case_B1DE_04:
bra_case_B1DE_05:
bra_case_B1DE_06:
bra_case_B1DE_0D:
bra_case_B1DE_0E:
bra_case_B1DE_0F:
bra_case_B1DE_10:
bra_case_B1DE_11:
- D - I - 0x0231EE 11:B1DE: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x0231F1 11:B1E1: F7        .byte con_F7, $02
- D - I - 0x0231F3 11:B1E3: 28        .byte con_pause + $28
- D - I - 0x0231F4 11:B1E4: 22        .byte con_bg + $22
- D - I - 0x0231F5 11:B1E5: 6B        .byte con_animation + $6B
- D - I - 0x0231F6 11:B1E6: 8D        .byte con_cloud + $8D
- D - I - 0x0231F7 11:B1E7: F7        .byte con_F7, $10
- D - I - 0x0231F9 11:B1E9: 16        .byte con_pause + $16
- D - I - 0x0231FA 11:B1EA: 05        .byte con_bg + $05
- D - I - 0x0231FB 11:B1EB: 00        .byte con_animation + $00
- D - I - 0x0231FC 11:B1EC: 00        .byte con_cloud + con_clear
- D - I - 0x0231FD 11:B1ED: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x023200 11:B1F0: F7        .byte con_F7, $36
- D - I - 0x023202 11:B1F2: 3C        .byte con_pause + $3C
- D - I - 0x023203 11:B1F3: 05        .byte con_bg + $05
- D - I - 0x023204 11:B1F4: D9        .byte con_animation + $D9
- D - I - 0x023205 11:B1F5: 04        .byte con_cloud + $04
loc_B1F6:
- D - I - 0x023206 11:B1F6: F7        .byte con_F7, $23
- D - I - 0x023208 11:B1F8: F9        .byte con_soundID_delay, $09, $02
- D - I - 0x02320B 11:B1FB: 46        .byte con_pause + $46
- D - I - 0x02320C 11:B1FC: 27        .byte con_bg + $27
- D - I - 0x02320D 11:B1FD: DC        .byte con_animation + $DC
- D - I - 0x02320E 11:B1FE: F0        .byte con_cloud + con_skip
- D - I - 0x02320F 11:B1FF: FB        .byte con_rts

bra_case_B200_00:
bra_case_B200_01:
- D - I - 0x023210 11:B200: F4        .byte con_mirror_on
- D - I - 0x023211 11:B201: F8        .byte con_F8, $04
- D - I - 0x023213 11:B203: 3C        .byte con_pause + $3C
- D - I - 0x023214 11:B204: 4F        .byte con_bg + $4F
- D - I - 0x023215 11:B205: 91        .byte con_animation + $91
- D - I - 0x023216 11:B206: AA        .byte con_cloud + $AA
- D - I - 0x023217 11:B207: F6        .byte con_mirror_toggle
- D - I - 0x023218 11:B208: F8        .byte con_F8, $04
- D - I - 0x02321A 11:B20A: 3C        .byte con_pause + $3C
- D - I - 0x02321B 11:B20B: 30        .byte con_bg + $30
- D - I - 0x02321C 11:B20C: 96        .byte con_animation + $96
- D - I - 0x02321D 11:B20D: AB        .byte con_cloud + $AB
- D - I - 0x02321E 11:B20E: F7        .byte con_F7, $10
- D - I - 0x023220 11:B210: 16        .byte con_pause + $16
- D - I - 0x023221 11:B211: 05        .byte con_bg + $05
- D - I - 0x023222 11:B212: 00        .byte con_animation + $00
- D - I - 0x023223 11:B213: 00        .byte con_cloud + con_clear
- D - I - 0x023224 11:B214: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x023227 11:B217: F7        .byte con_F7, $36
- D - I - 0x023229 11:B219: 3C        .byte con_pause + $3C
- D - I - 0x02322A 11:B21A: 05        .byte con_bg + $05
- D - I - 0x02322B 11:B21B: D6        .byte con_animation + $D6
- D - I - 0x02322C 11:B21C: 04        .byte con_cloud + $04
- D - I - 0x02322D 11:B21D: F2        .byte con_jmp
- D - I - 0x02322E 11:B21E: F6 B1     .word loc_B1F6

bra_case_B220_07:
bra_case_B220_08:
bra_case_B220_09:
bra_case_B220_0A:
- D - I - 0x023230 11:B220: F4        .byte con_mirror_on
- D - I - 0x023231 11:B221: F8        .byte con_F8, $04
- D - I - 0x023233 11:B223: 3C        .byte con_pause + $3C
- D - I - 0x023234 11:B224: 4F        .byte con_bg + $4F
- D - I - 0x023235 11:B225: 9C        .byte con_animation + $9C
- D - I - 0x023236 11:B226: AC        .byte con_cloud + $AC
- D - I - 0x023237 11:B227: F6        .byte con_mirror_toggle
- D - I - 0x023238 11:B228: F8        .byte con_F8, $04
- D - I - 0x02323A 11:B22A: 3C        .byte con_pause + $3C
- D - I - 0x02323B 11:B22B: 30        .byte con_bg + $30
- D - I - 0x02323C 11:B22C: 9C        .byte con_animation + $9C
- D - I - 0x02323D 11:B22D: AD        .byte con_cloud + $AD
loc_B22E:
bra_long_case_B22E_0A_skylab_twin_shot:
- D - I - 0x02323E 11:B22E: F7        .byte con_F7, $10
- D - I - 0x023240 11:B230: 16        .byte con_pause + $16
- D - I - 0x023241 11:B231: 05        .byte con_bg + $05
- D - I - 0x023242 11:B232: 00        .byte con_animation + $00
- D - I - 0x023243 11:B233: 00        .byte con_cloud + con_clear
- D - I - 0x023244 11:B234: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x023247 11:B237: F7        .byte con_F7, $36
- D - I - 0x023249 11:B239: 3C        .byte con_pause + $3C
- D - I - 0x02324A 11:B23A: 05        .byte con_bg + $05
- D - I - 0x02324B 11:B23B: D8        .byte con_animation + $D8
- D - I - 0x02324C 11:B23C: 04        .byte con_cloud + $04
- D - I - 0x02324D 11:B23D: F2        .byte con_jmp
- D - I - 0x02324E 11:B23E: F6 B1     .word loc_B1F6

bra_case_B240_0B:
bra_case_B240_0C:
- D - I - 0x023250 11:B240: F4        .byte con_mirror_on
- D - I - 0x023251 11:B241: F8        .byte con_F8, $04
- D - I - 0x023253 11:B243: 3C        .byte con_pause + $3C
- D - I - 0x023254 11:B244: 4F        .byte con_bg + $4F
- D - I - 0x023255 11:B245: AB        .byte con_animation + $AB
- D - I - 0x023256 11:B246: AC        .byte con_cloud + $AC
- D - I - 0x023257 11:B247: F6        .byte con_mirror_toggle
- D - I - 0x023258 11:B248: F8        .byte con_F8, $04
- D - I - 0x02325A 11:B24A: 3C        .byte con_pause + $3C
- D - I - 0x02325B 11:B24B: 30        .byte con_bg + $30
- D - I - 0x02325C 11:B24C: AB        .byte con_animation + $AB
- D - I - 0x02325D 11:B24D: AD        .byte con_cloud + $AD
- D - I - 0x02325E 11:B24E: F2        .byte con_jmp
- D - I - 0x02325F 11:B24F: 2E B2     .word loc_B22E

bra_long_case_B251_10_jumping_volley:
loc_B251:
- D - I - 0x023261 11:B251: F7        .byte con_F7, $31
- D - I - 0x023263 11:B253: F9        .byte con_soundID_delay, $16, $02
- D - I - 0x023266 11:B256: 28        .byte con_pause + $28
- D - I - 0x023267 11:B257: 6A        .byte con_bg + $6A
- D - I - 0x023268 11:B258: C4        .byte con_animation + $C4
- D - I - 0x023269 11:B259: 49        .byte con_cloud + $49
- D - I - 0x02326A 11:B25A: F7        .byte con_F7, $21
- D - I - 0x02326C 11:B25C: F9        .byte con_soundID_delay, $14, $02
- D - I - 0x02326F 11:B25F: 16        .byte con_pause + $16
- D - I - 0x023270 11:B260: 05        .byte con_bg + $05
- D - I - 0x023271 11:B261: 69        .byte con_animation + $69
- D - I - 0x023272 11:B262: F0        .byte con_cloud + con_skip
- D - I - 0x023273 11:B263: FC        .byte con_moving_bg, $04
- D - I - 0x023275 11:B265: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x023278 11:B268: 28        .byte con_pause + $28
- D - I - 0x023279 11:B269: 58        .byte con_bg + $58
- D - I - 0x02327A 11:B26A: C5        .byte con_animation + $C5
- D - I - 0x02327B 11:B26B: F0        .byte con_cloud + con_skip
- D - I - 0x02327C 11:B26C: F2        .byte con_jmp
- D - I - 0x02327D 11:B26D: C7 BB     .word loc_BBC7_очистка

bra_long_case_B26F_20_foward_somersault:
- D - I - 0x02327F 11:B26F: 3C        .byte con_pause + $3C
- D - I - 0x023280 11:B270: 30        .byte con_bg + $30
- D - I - 0x023281 11:B271: B7        .byte con_animation + $B7
- D - I - 0x023282 11:B272: 13        .byte con_cloud + $13
- D - I - 0x023283 11:B273: F7        .byte con_F7, $31
- D - I - 0x023285 11:B275: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023288 11:B278: 1B        .byte con_pause + $1B
- D - I - 0x023289 11:B279: 48        .byte con_bg + $48
- D - I - 0x02328A 11:B27A: CC        .byte con_animation + $CC
- D - I - 0x02328B 11:B27B: DE        .byte con_cloud + $DE
- D - I - 0x02328C 11:B27C: FA        .byte con_jsr
- D - I - 0x02328D 11:B27D: C7 BB     .word sub_BBC7_очистка
- D - I - 0x02328F 11:B27F: F7        .byte con_F7, $0E
- D - I - 0x023291 11:B281: 28        .byte con_pause + $28
- D - I - 0x023292 11:B282: 05        .byte con_bg + $05
- D - I - 0x023293 11:B283: 00        .byte con_animation + $00
- D - I - 0x023294 11:B284: 49        .byte con_cloud + $49
- D - I - 0x023295 11:B285: F7        .byte con_F7, $19
- D - I - 0x023297 11:B287: F9        .byte con_soundID_delay, $1A, $11
- D - I - 0x02329A 11:B28A: 28        .byte con_pause + $28
- D - I - 0x02329B 11:B28B: 5C        .byte con_bg + $5C
- D - I - 0x02329C 11:B28C: CD        .byte con_animation + $CD
- D - I - 0x02329D 11:B28D: F0        .byte con_cloud + con_skip
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x0232A2 11:B292: F7        .byte con_F7, $1F
- D - I - 0x0232A4 11:B294: 78        .byte con_pause + $78
- D - I - 0x0232A5 11:B295: 30        .byte con_bg + $30
- D - I - 0x0232A6 11:B296: B7        .byte con_animation + $B7
- D - I - 0x0232A7 11:B297: BF        .byte con_cloud + $BF
- D - I - 0x0232A8 11:B298: F2        .byte con_jmp
- D - I - 0x0232A9 11:B299: C7 BB     .word loc_BBC7_очистка

bra_long_case_B29B_00:
bra_long_case_B29B_01_pass:
bra_long_case_B29B_02_trap:
bra_long_case_B29B_03_through:
bra_long_case_B29B_04:
- D - I - 0x0232AB 11:B29B: F7        .byte con_F7, $02
- D - I - 0x0232AD 11:B29D: 32        .byte con_pause + $32
- D - I - 0x0232AE 11:B29E: 22        .byte con_bg + $22
- D - I - 0x0232AF 11:B29F: 6B        .byte con_animation + $6B
- D - I - 0x0232B0 11:B2A0: 4C        .byte con_cloud + $4C
- D - I - 0x0232B1 11:B2A1: FB        .byte con_rts

bra_long_case_B2A2_02:
- D - I - 0x0232B2 11:B2A2: F3        .byte con_branch, $BD     ; проверка на misaki
- D - I - 0x0232B4 11:B2A4: 02        .byte bra_case_B2A6_00_это_misaki - *
- - - - - 0x0232B5 11:B2A5: 16        .byte bra_case_B2BB_01_это_не_misaki - *

bra_case_B2A6_00_это_misaki:
- D - I - 0x0232B6 11:B2A6: 3C        .byte con_pause + $3C
- D - I - 0x0232B7 11:B2A7: 30        .byte con_bg + $30
- D - I - 0x0232B8 11:B2A8: 96        .byte con_animation + $96
- D - I - 0x0232B9 11:B2A9: 13        .byte con_cloud + $13
loc_B2AA:
- D - I - 0x0232BA 11:B2AA: FA        .byte con_jsr
- D - I - 0x0232BB 11:B2AB: C7 BB     .word sub_BBC7_очистка
sub_B2AD:
- D - I - 0x0232BD 11:B2AD: F7        .byte con_F7, $02
- D - I - 0x0232BF 11:B2AF: 1E        .byte con_pause + $1E
- D - I - 0x0232C0 11:B2B0: 24        .byte con_bg + $24
- D - I - 0x0232C1 11:B2B1: 6B        .byte con_animation + $6B
- D - I - 0x0232C2 11:B2B2: F0        .byte con_cloud + con_skip
- D - I - 0x0232C3 11:B2B3: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0232C6 11:B2B6: 28        .byte con_pause + $28
- D - I - 0x0232C7 11:B2B7: 20        .byte con_bg + $20
- D - I - 0x0232C8 11:B2B8: AC        .byte con_animation + $AC
- D - I - 0x0232C9 11:B2B9: 00        .byte con_cloud + con_clear
- D - I - 0x0232CA 11:B2BA: FB        .byte con_rts

bra_case_B2BB_01_это_не_misaki:
- - - - - 0x0232CB 11:B2BB: 3C        .byte con_pause + $3C
- - - - - 0x0232CC 11:B2BC: 30        .byte con_bg + $30
- - - - - 0x0232CD 11:B2BD: 97        .byte con_animation + $97
- - - - - 0x0232CE 11:B2BE: 13        .byte con_cloud + $13
- - - - - 0x0232CF 11:B2BF: F2        .byte con_jmp
- - - - - 0x0232D0 11:B2C0: AA B2     .word loc_B2AA

loc_B2C2:
- D - I - 0x0232D2 11:B2C2: FC        .byte con_moving_bg, $02
- D - I - 0x0232D4 11:B2C4: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x0232D7 11:B2C7: 44        .byte con_pause + $44
- D - I - 0x0232D8 11:B2C8: 57        .byte con_bg + $57
- D - I - 0x0232D9 11:B2C9: 6C        .byte con_animation + $6C
- D - I - 0x0232DA 11:B2CA: 4D        .byte con_cloud + $4D
- D - I - 0x0232DB 11:B2CB: FB        .byte con_rts

loc_B2CC:
- D - I - 0x0232DC 11:B2CC: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x0232DF 11:B2CF: 3E        .byte con_pause + $3E
- D - I - 0x0232E0 11:B2D0: 29        .byte con_bg + $29
- D - I - 0x0232E1 11:B2D1: 6D        .byte con_animation + $6D
- D - I - 0x0232E2 11:B2D2: 4D        .byte con_cloud + $4D
- D - I - 0x0232E3 11:B2D3: FB        .byte con_rts

loc_B2D4:
- D - I - 0x0232E4 11:B2D4: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x0232E7 11:B2D7: 3E        .byte con_pause + $3E
- D - I - 0x0232E8 11:B2D8: 67        .byte con_bg + $67
- D - I - 0x0232E9 11:B2D9: 6D        .byte con_animation + $6D
- D - I - 0x0232EA 11:B2DA: 4D        .byte con_cloud + $4D
- D - I - 0x0232EB 11:B2DB: FB        .byte con_rts

sub_B2DC:
- D - I - 0x0232EC 11:B2DC: F3        .byte con_branch, $B7
- D - I - 0x0232EE 11:B2DE: 14        .byte bra_case_B2F2_00_игрок_без_защитного_спешала - *
- D - I - 0x0232EF 11:B2DF: 01        .byte bra_case_B2E0_01 - *

bra_case_B2E0_01:
- D - I - 0x0232F0 11:B2E0: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x0232F2 11:B2E2: 10        .byte bra_case_B2F2_00_игрок_без_защитного_спешала - *
- D - I - 0x0232F3 11:B2E3: 55        .byte bra_case_B338_01_masao_kazuo - *
- D - I - 0x0232F4 11:B2E4: 5D        .byte bra_case_B341_02_masao_kazuo - *
- D - I - 0x0232F5 11:B2E5: 0D        .byte bra_case_B2F2_03_souda - *
- - - - - 0x0232F6 11:B2E6: 0C        .byte bra_case_B2F2_04_souda - *
- D - I - 0x0232F7 11:B2E7: 0B        .byte bra_case_B2F2_05_jitou - *
- - - - - 0x0232F8 11:B2E8: 0A        .byte bra_case_B2F2_06_jitou - *
- - - - - 0x0232F9 11:B2E9: 09        .byte bra_case_B2F2_07_dirceu - *
- D - I - 0x0232FA 11:B2EA: 08        .byte bra_case_B2F2_08_dirceu - *
- - - - - 0x0232FB 11:B2EB: 07        .byte bra_case_B2F2_09_robson - *
- D - I - 0x0232FC 11:B2EC: 06        .byte bra_case_B2F2_0A_libuta - *
- - - - - 0x0232FD 11:B2ED: 05        .byte bra_case_B2F2_0B_galvan - *
- D - I - 0x0232FE 11:B2EE: 04        .byte bra_case_B2F2_0C_hyuga - *
- D - I - 0x0232FF 11:B2EF: 03        .byte bra_case_B2F2_0D_hyuga - *
- - - - - 0x023300 11:B2F0: 02        .byte bra_case_B2F2_0E_ishizaki - *
- - - - - 0x023301 11:B2F1: 01        .byte bra_case_B2F2_0F_ishizaki - *

bra_case_B2F2_00_игрок_без_защитного_спешала:
bra_case_B2F2_03_souda:
bra_case_B2F2_04_souda:
bra_case_B2F2_05_jitou:
bra_case_B2F2_06_jitou:
bra_case_B2F2_07_dirceu:
bra_case_B2F2_08_dirceu:
bra_case_B2F2_09_robson:
bra_case_B2F2_0A_libuta:
bra_case_B2F2_0B_galvan:
bra_case_B2F2_0C_hyuga:
bra_case_B2F2_0D_hyuga:
bra_case_B2F2_0E_ishizaki:
bra_case_B2F2_0F_ishizaki:
- D - I - 0x023302 11:B2F2: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023305 11:B2F5: 14        .byte con_pause + $14
- D - I - 0x023306 11:B2F6: 02        .byte con_bg + $02
- D - I - 0x023307 11:B2F7: 1C        .byte con_animation + $1C
- D - I - 0x023308 11:B2F8: 37        .byte con_cloud + $37
- D - I - 0x023309 11:B2F9: 22        .byte con_pause + $22
- D - I - 0x02330A 11:B2FA: 56        .byte con_bg + $56
- D - I - 0x02330B 11:B2FB: 49        .byte con_animation + $49
- D - I - 0x02330C 11:B2FC: F0        .byte con_cloud + con_skip
- D - I - 0x02330D 11:B2FD: FB        .byte con_rts

bra_long_case_B2FE_01:
- D - I - 0x02330E 11:B2FE: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x023310 11:B300: 10        .byte bra_case_B310_00_игрок_без_защитного_спешала - *
- D - I - 0x023311 11:B301: 37        .byte bra_case_B338_01_masao_kazuo - *
- - - - - 0x023312 11:B302: 3F        .byte bra_case_B341_02_masao_kazuo - *
- - - - - 0x023313 11:B303: 0D        .byte bra_case_B310_03_souda - *
- - - - - 0x023314 11:B304: 0C        .byte bra_case_B310_04_souda - *
- - - - - 0x023315 11:B305: 0B        .byte bra_case_B310_05_jitou - *
- - - - - 0x023316 11:B306: 0A        .byte bra_case_B310_06_jitou - *
- - - - - 0x023317 11:B307: 09        .byte bra_case_B310_07_dirceu - *
- - - - - 0x023318 11:B308: 08        .byte bra_case_B310_08_dirceu - *
- - - - - 0x023319 11:B309: 07        .byte bra_case_B310_09_robson - *
- - - - - 0x02331A 11:B30A: 06        .byte bra_case_B310_0A_libuta - *
- - - - - 0x02331B 11:B30B: 05        .byte bra_case_B310_0B_galvan - *
- D - I - 0x02331C 11:B30C: 04        .byte bra_case_B310_0C_hyuga - *
- - - - - 0x02331D 11:B30D: 03        .byte bra_case_B310_0D_hyuga - *
- - - - - 0x02331E 11:B30E: 02        .byte bra_case_B310_0E_ishizaki - *
- - - - - 0x02331F 11:B30F: 01        .byte bra_case_B310_0F_ishizaki - *

bra_long_case_B310_00:
bra_case_B310_00_игрок_без_защитного_спешала:
bra_case_B310_03_souda:
bra_case_B310_04_souda:
bra_case_B310_05_jitou:
bra_case_B310_06_jitou:
bra_case_B310_07_dirceu:
bra_case_B310_08_dirceu:
bra_case_B310_09_robson:
bra_case_B310_0A_libuta:
bra_case_B310_0B_galvan:
bra_case_B310_0C_hyuga:
bra_case_B310_0D_hyuga:
bra_case_B310_0E_ishizaki:
bra_case_B310_0F_ishizaki:
- D - I - 0x023320 11:B310: F8        .byte con_F8, $04
- D - I - 0x023322 11:B312: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023325 11:B315: 32        .byte con_pause + $32
- D - I - 0x023326 11:B316: 1D        .byte con_bg + $1D
- D - I - 0x023327 11:B317: 1C        .byte con_animation + $1C
- D - I - 0x023328 11:B318: 3B        .byte con_cloud + $3B
- D - I - 0x023329 11:B319: FB        .byte con_rts

bra_long_case_B31A_01:
- D - I - 0x02332A 11:B31A: F3        .byte con_branch, $B3     ; защитный спешал
- - - - - 0x02332C 11:B31C: 10        .byte bra_case_B32C_00_игрок_без_защитного_спешала - *
- - - - - 0x02332D 11:B31D: 1B        .byte bra_case_B338_01_masao_kazuo - *
- D - I - 0x02332E 11:B31E: 23        .byte bra_case_B341_02_masao_kazuo - *
- - - - - 0x02332F 11:B31F: 0D        .byte bra_case_B32C_03_souda - *
- - - - - 0x023330 11:B320: 0C        .byte bra_case_B32C_04_souda - *
- - - - - 0x023331 11:B321: 0B        .byte bra_case_B32C_05_jitou - *
- - - - - 0x023332 11:B322: 0A        .byte bra_case_B32C_06_jitou - *
- - - - - 0x023333 11:B323: 09        .byte bra_case_B32C_07_dirceu - *
- - - - - 0x023334 11:B324: 08        .byte bra_case_B32C_08_dirceu - *
- - - - - 0x023335 11:B325: 07        .byte bra_case_B32C_09_robson - *
- - - - - 0x023336 11:B326: 06        .byte bra_case_B32C_0A_libuta - *
- - - - - 0x023337 11:B327: 05        .byte bra_case_B32C_0B_galvan - *
- - - - - 0x023338 11:B328: 04        .byte bra_case_B32C_0C_hyuga - *
- - - - - 0x023339 11:B329: 03        .byte bra_case_B32C_0D_hyuga - *
- - - - - 0x02333A 11:B32A: 02        .byte bra_case_B32C_0E_ishizaki - *
- - - - - 0x02333B 11:B32B: 01        .byte bra_case_B32C_0F_ishizaki - *

bra_long_case_B32C_00:
bra_case_B32C_00_игрок_без_защитного_спешала:
bra_case_B32C_03_souda:
bra_case_B32C_04_souda:
bra_case_B32C_05_jitou:
bra_case_B32C_06_jitou:
bra_case_B32C_07_dirceu:
bra_case_B32C_08_dirceu:
bra_case_B32C_09_robson:
bra_case_B32C_0A_libuta:
bra_case_B32C_0B_galvan:
bra_case_B32C_0C_hyuga:
bra_case_B32C_0D_hyuga:
bra_case_B32C_0E_ishizaki:
bra_case_B32C_0F_ishizaki:
- D - I - 0x02333C 11:B32C: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x02333F 11:B32F: 14        .byte con_pause + $14
- D - I - 0x023340 11:B330: 02        .byte con_bg + $02
- D - I - 0x023341 11:B331: 1C        .byte con_animation + $1C
- D - I - 0x023342 11:B332: 38        .byte con_cloud + $38
- D - I - 0x023343 11:B333: 20        .byte con_pause + $20
- D - I - 0x023344 11:B334: 29        .byte con_bg + $29
- D - I - 0x023345 11:B335: 49        .byte con_animation + $49
- D - I - 0x023346 11:B336: F0        .byte con_cloud + con_skip
- D - I - 0x023347 11:B337: FB        .byte con_rts

bra_case_B338_01_masao_kazuo:
- D - I - 0x023348 11:B338: FA        .byte con_jsr
- D - I - 0x023349 11:B339: 1A A7     .word sub_A71A
loc_B33B:
- D - I - 0x02334B 11:B33B: 2D        .byte con_pause + $2D
- D - I - 0x02334C 11:B33C: 20        .byte con_bg + $20
- D - I - 0x02334D 11:B33D: C1        .byte con_animation + $C1
- D - I - 0x02334E 11:B33E: ED        .byte con_cloud + $ED
- D - I - 0x02334F 11:B33F: F6        .byte con_mirror_toggle
- D - I - 0x023350 11:B340: FB        .byte con_rts

bra_case_B341_02_masao_kazuo:
- D - I - 0x023351 11:B341: FA        .byte con_jsr
- D - I - 0x023352 11:B342: 56 A7     .word sub_A756
- D - I - 0x023354 11:B344: F2        .byte con_jmp
- D - I - 0x023355 11:B345: 3B B3     .word loc_B33B

sub_B347:
- D - I - 0x023357 11:B347: F3        .byte con_branch, $B3     ; защитный спешал
- D - I - 0x023359 11:B349: 10        .byte bra_case_B359_00_игрок_без_защитного_спешала - *
- - - - - 0x02335A 11:B34A: 1B        .byte bra_case_B365_01_masao_kazuo - *
- - - - - 0x02335B 11:B34B: 21        .byte bra_case_B36C_02_masao_kazuo - *
- - - - - 0x02335C 11:B34C: 0D        .byte bra_case_B359_03_souda - *
- - - - - 0x02335D 11:B34D: 0C        .byte bra_case_B359_04_souda - *
- D - I - 0x02335E 11:B34E: 24        .byte bra_case_B372_05_jitou - *
- - - - - 0x02335F 11:B34F: 40        .byte bra_case_B38F_06_jitou - *
- D - I - 0x023360 11:B350: 2C        .byte bra_case_B37C_07_dirceu - *
- D - I - 0x023361 11:B351: 2B        .byte bra_case_B37C_08_dirceu - *
- - - - - 0x023362 11:B352: 2A        .byte bra_case_B37C_09_robson - *
- D - I - 0x023363 11:B353: 29        .byte bra_case_B37C_0A_libuta - *
- - - - - 0x023364 11:B354: 28        .byte bra_case_B37C_0B_galvan - *
- - - - - 0x023365 11:B355: 04        .byte bra_case_B359_0C_hyuga - *
- - - - - 0x023366 11:B356: 03        .byte bra_case_B359_0D_hyuga - *
- D - I - 0x023367 11:B357: 41        .byte bra_case_B398_0E - *
- - - - - 0x023368 11:B358: 49        .byte bra_case_B3A1_0F - *

bra_case_B359_00_игрок_без_защитного_спешала:
bra_case_B359_03_souda:
bra_case_B359_04_souda:
bra_case_B359_0C_hyuga:
bra_case_B359_0D_hyuga:
- D - I - 0x023369 11:B359: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x02336C 11:B35C: 14        .byte con_pause + $14
- D - I - 0x02336D 11:B35D: 02        .byte con_bg + $02
- D - I - 0x02336E 11:B35E: 1C        .byte con_animation + $1C
- D - I - 0x02336F 11:B35F: 39        .byte con_cloud + $39
loc_B360:
- D - I - 0x023370 11:B360: 20        .byte con_pause + $20
- D - I - 0x023371 11:B361: 56        .byte con_bg + $56
- D - I - 0x023372 11:B362: 49        .byte con_animation + $49
- D - I - 0x023373 11:B363: F0        .byte con_cloud + con_skip
- D - I - 0x023374 11:B364: FB        .byte con_rts

bra_case_B365_01_masao_kazuo:
- - - - - 0x023375 11:B365: FA        .byte con_jsr
- - - - - 0x023376 11:B366: 1A A7     .word sub_A71A
loc_B368:
- - - - - 0x023378 11:B368: FA        .byte con_jmp
- - - - - 0x023379 11:B369: 3B B3     .word loc_B33B

bra_case_B36C_02_masao_kazuo:
- - - - - 0x02337C 11:B36C: FA        .byte con_jsr
- - - - - 0x02337D 11:B36D: 56 A7     .word sub_A756
- - - - - 0x02337F 11:B36F: F2        .byte con_jmp
- - - - - 0x023380 11:B370: 68 B3     .word loc_B368

bra_case_B372_05_jitou:
- D - I - 0x023382 11:B372: F7        .byte con_F7, $44
- D - I - 0x023384 11:B374: 48        .byte con_pause + $48
- D - I - 0x023385 11:B375: 30        .byte con_bg + $30
- D - I - 0x023386 11:B376: A0        .byte con_animation + $A0
- D - I - 0x023387 11:B377: D8        .byte con_cloud + $D8
loc_B378:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
bra_case_B37C_07_dirceu:
bra_case_B37C_08_dirceu:
bra_case_B37C_09_robson:
bra_case_B37C_0A_libuta:
bra_case_B37C_0B_galvan:
- D - I - 0x02338C 11:B37C: F9        .byte con_soundID_delay, $27, $02
- D - I - 0x02338F 11:B37F: F7        .byte con_F7, $33
- D - I - 0x023391 11:B381: 20        .byte con_pause + $20
- D - I - 0x023392 11:B382: 6B        .byte con_bg + $6B
- D - I - 0x023393 11:B383: E3        .byte con_animation + $E3
- D - I - 0x023394 11:B384: EC        .byte con_cloud + $EC
- D - I - 0x023395 11:B385: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x023398 11:B388: 14        .byte con_pause + $14
- D - I - 0x023399 11:B389: 02        .byte con_bg + $02
- D - I - 0x02339A 11:B38A: 1C        .byte con_animation + $1C
- D - I - 0x02339B 11:B38B: F0        .byte con_cloud + con_skip
- D - I - 0x02339C 11:B38C: F2        .byte con_jmp
- D - I - 0x02339D 11:B38D: 60 B3     .word loc_B360

bra_case_B38F_06_jitou:
- - - - - 0x02339F 11:B38F: F7        .byte con_F7, $44
- - - - - 0x0233A1 11:B391: 48        .byte con_pause + $48
- - - - - 0x0233A2 11:B392: 30        .byte con_bg + $30
- - - - - 0x0233A3 11:B393: AA        .byte con_animation + $AA
- - - - - 0x0233A4 11:B394: D8        .byte con_cloud + $D8
- - - - - 0x0233A5 11:B395: F2        .byte con_jmp
- - - - - 0x0233A6 11:B396: 78 B3     .word loc_B378

bra_case_B398_0E:
- D - I - 0x0233A8 11:B398: F7        .byte con_F7, $44
- D - I - 0x0233AA 11:B39A: 3C        .byte con_pause + $3C
- D - I - 0x0233AB 11:B39B: 30        .byte con_bg + $30
- D - I - 0x0233AC 11:B39C: 98        .byte con_animation + $98
- D - I - 0x0233AD 11:B39D: D7        .byte con_cloud + $D7
- D - I - 0x0233AE 11:B39E: F2        .byte con_jmp
- D - I - 0x0233AF 11:B39F: B1 A7     .word loc_A7B1

bra_case_B3A1_0F:
- - - - - 0x0233B1 11:B3A1: F7        .byte con_F7, $44
- - - - - 0x0233B3 11:B3A3: 3C        .byte con_pause + $3C
- - - - - 0x0233B4 11:B3A4: 30        .byte con_bg + $30
- - - - - 0x0233B5 11:B3A5: 99        .byte con_animation + $99
- - - - - 0x0233B6 11:B3A6: D7        .byte con_cloud + $D7
- - - - - 0x0233B7 11:B3A7: F2        .byte con_jmp
- - - - - 0x0233B8 11:B3A8: B1 A7     .word loc_A7B1

bra_long_case_B3AA_01_heel_lift:
- D - I - 0x0233BA 11:B3AA: FA        .byte con_jsr
- D - I - 0x0233BB 11:B3AB: 10 A8     .word sub_A810_анимация_heel_lift
bra_long_case_B3AD_00_shoot:
bra_long_case_B3AD_00_dribble:
bra_long_case_B3AD_01_pass:
bra_long_case_B3AD_03_1_2_pass:
- D - I - 0x0233BD 11:B3AD: F6        .byte con_mirror_toggle
- D - I - 0x0233BE 11:B3AE: FB        .byte con_rts

bra_long_case_B3AF_02_forcible_dribble:
- D - I - 0x0233BF 11:B3AF: F3        .byte con_branch, $C7     ; кто делает силовой дриблинг
- D - I - 0x0233C1 11:B3B1: 06        .byte bra_case_B3B7_00_hyuga_из_японии - *
- D - I - 0x0233C2 11:B3B2: 13        .byte bra_case_B3C5_01_hyuga_из_тохо - *
- - - - - 0x0233C3 11:B3B3: 1B        .byte bra_case_B3CE_02_jitou_из_японии - *
- D - I - 0x0233C4 11:B3B4: 23        .byte bra_case_B3D7_03_jitou_из_куними - *
- D - I - 0x0233C5 11:B3B5: 2B        .byte bra_case_B3E0_04_napoleon - *
- D - I - 0x0233C6 11:B3B6: 0A        .byte bra_case_B3C0_05_игрок_без_рожи - *

bra_case_B3B7_00_hyuga_из_японии:
- D - I - 0x0233C7 11:B3B7: F7        .byte con_F7, $44
- D - I - 0x0233C9 11:B3B9: 3C        .byte con_pause + $3C
- D - I - 0x0233CA 11:B3BA: 31        .byte con_bg + $31
- D - I - 0x0233CB 11:B3BB: 9E        .byte con_animation + $9E
- D - I - 0x0233CC 11:B3BC: C4        .byte con_cloud + $C4
loc_B3BD:
- D - I - 0x0233CD 11:B3BD: FA        .byte con_jsr
- D - I - 0x0233CE 11:B3BE: C7 BB     .word sub_BBC7_очистка
sub_B3C0:
bra_case_B3C0_05_игрок_без_рожи:
- D - I - 0x0233D0 11:B3C0: FA        .byte con_jsr
- D - I - 0x0233D1 11:B3C1: 89 AA     .word sub_AA89
- D - I - 0x0233D3 11:B3C3: F6        .byte con_mirror_toggle
- D - I - 0x0233D4 11:B3C4: FB        .byte con_rts

bra_case_B3C5_01_hyuga_из_тохо:
- D - I - 0x0233D5 11:B3C5: F7        .byte con_F7, $44
- D - I - 0x0233D7 11:B3C7: 3C        .byte con_pause + $3C
- D - I - 0x0233D8 11:B3C8: 31        .byte con_bg + $31
- D - I - 0x0233D9 11:B3C9: B0        .byte con_animation + $B0
- D - I - 0x0233DA 11:B3CA: C4        .byte con_cloud + $C4
- D - I - 0x0233DB 11:B3CB: F2        .byte con_jmp
- D - I - 0x0233DC 11:B3CC: BD B3     .word loc_B3BD

bra_case_B3CE_02_jitou_из_японии:
- - - - - 0x0233DE 11:B3CE: F7        .byte con_F7, $44
- - - - - 0x0233E0 11:B3D0: 3C        .byte con_pause + $3C
- - - - - 0x0233E1 11:B3D1: 30        .byte con_bg + $30
- - - - - 0x0233E2 11:B3D2: A0        .byte con_animation + $A0
- - - - - 0x0233E3 11:B3D3: C5        .byte con_cloud + $C5
- - - - - 0x0233E4 11:B3D4: F2        .byte con_jmp
- - - - - 0x0233E5 11:B3D5: BD B3     .word loc_B3BD

bra_case_B3D7_03_jitou_из_куними:
- D - I - 0x0233E7 11:B3D7: F7        .byte con_F7, $44
- D - I - 0x0233E9 11:B3D9: 3C        .byte con_pause + $3C
- D - I - 0x0233EA 11:B3DA: 30        .byte con_bg + $30
- D - I - 0x0233EB 11:B3DB: AA        .byte con_animation + $AA
- D - I - 0x0233EC 11:B3DC: C5        .byte con_cloud + $C5
- - - - - 0x0233ED 11:B3DD: F2        .byte con_jmp
- - - - - 0x0233EE 11:B3DE: BD B3     .word loc_B3BD

bra_case_B3E0_04_napoleon:
- D - I - 0x0233F0 11:B3E0: F7        .byte con_F7, $44
- D - I - 0x0233F2 11:B3E2: 3C        .byte con_pause + $3C
- D - I - 0x0233F3 11:B3E3: 30        .byte con_bg + $30
- D - I - 0x0233F4 11:B3E4: B4        .byte con_animation + $B4
- D - I - 0x0233F5 11:B3E5: C6        .byte con_cloud + $C6
- D - I - 0x0233F6 11:B3E6: F2        .byte con_jmp
- D - I - 0x0233F7 11:B3E7: BD B3     .word loc_B3BD

bra_long_case_B3E9_03_vanishing_feint:
- D - I - 0x0233F9 11:B3E9: FA        .byte con_jsr
- D - I - 0x0233FA 11:B3EA: 6C A8     .word sub_A86C
- D - I - 0x0233FC 11:B3EC: F7        .byte con_F7, $02
- D - I - 0x0233FE 11:B3EE: 28        .byte con_pause + $28
- D - I - 0x0233FF 11:B3EF: F0        .byte con_bg + con_skip
- D - I - 0x023400 11:B3F0: F0        .byte con_animation + con_skip
- D - I - 0x023401 11:B3F1: F0        .byte con_cloud + con_skip
- D - I - 0x023402 11:B3F2: F6        .byte con_mirror_toggle
- D - I - 0x023403 11:B3F3: FB        .byte con_rts

bra_long_case_B3F4_04_clone_dribble:
- D - I - 0x023404 11:B3F4: F3        .byte con_branch, $BB     ; проверка на carlosа
- D - I - 0x023406 11:B3F6: 02        .byte bra_case_B3F8_00_это_carlos - *
- D - I - 0x023407 11:B3F7: 09        .byte bra_case_B400_01_это_не_carlos - *
bra_case_B3F8_00_это_carlos:
- D - I - 0x023408 11:B3F8: FA        .byte con_jsr
- D - I - 0x023409 11:B3F9: 85 A8     .word sub_A885
loc_B3FB:
- D - I - 0x02340B 11:B3FB: FA        .byte con_jsr
- D - I - 0x02340C 11:B3FC: AB A8     .word sub_A8AB
- D - I - 0x02340E 11:B3FE: F6        .byte con_mirror_toggle
- D - I - 0x02340F 11:B3FF: FB        .byte con_rts

bra_case_B400_01_это_не_carlos:
- D - I - 0x023410 11:B400: FA        .byte con_jsr
- D - I - 0x023411 11:B401: 8F A8     .word sub_A88F
- D - I - 0x023413 11:B403: F2        .byte con_jmp
- D - I - 0x023414 11:B404: FB B3     .word loc_B3FB

bra_long_case_B406_05_high_speed_dribble:
- D - I - 0x023416 11:B406: FA        .byte con_jsr
- D - I - 0x023417 11:B407: D0 A8     .word sub_A8D0
- D - I - 0x023419 11:B409: F7        .byte con_F7, $0D
- D - I - 0x02341B 11:B40B: F9        .byte con_soundID_delay, $26, $02
- D - I - 0x02341E 11:B40E: 1F        .byte con_pause + $1F
- D - I - 0x02341F 11:B40F: 47        .byte con_bg + $47
- D - I - 0x023420 11:B410: D1        .byte con_animation + $D1
- D - I - 0x023421 11:B411: F0        .byte con_cloud + con_skip
- D - I - 0x023422 11:B412: F6        .byte con_mirror_toggle
- D - I - 0x023423 11:B413: FB        .byte con_rts

bra_long_case_B414_06_hedgehog_dribble:
- D - I - 0x023424 11:B414: F3        .byte con_branch, $BA     ; проверка на kaltzа
- D - I - 0x023426 11:B416: 02        .byte bra_case_B418_00_это_kaltz - *
- - - - - 0x023427 11:B417: 0B        .byte bra_case_B422_01_это_не_kaltz - *

bra_case_B418_00_это_kaltz:
- D - I - 0x023428 11:B418: FA        .byte con_jsr
- D - I - 0x023429 11:B419: E5 A8     .word sub_A8E5
loc_B41B:
- D - I - 0x02342B 11:B41B: F7        .byte con_F7, $02
- D - I - 0x02342D 11:B41D: 1F        .byte con_pause + $1F
- D - I - 0x02342E 11:B41E: F0        .byte con_bg + con_skip
- D - I - 0x02342F 11:B41F: D2        .byte con_animation + $D2
- D - I - 0x023430 11:B420: 00        .byte con_cloud + con_clear
- D - I - 0x023431 11:B421: FB        .byte con_rts

bra_case_B422_01_это_не_kaltz:
- - - - - 0x023432 11:B422: FA        .byte con_jsr
- - - - - 0x023433 11:B423: 08 A9     .word sub_A908
- - - - - 0x023435 11:B425: F2        .byte con_jmp
- - - - - 0x023436 11:B426: 1B B4     .word loc_B41B

sub_B428:
- D - I - 0x023438 11:B428: F3        .byte con_branch, $8C
- D - I - 0x02343A 11:B42A: 08        .byte bra_case_B432_00 - *
- D - I - 0x02343B 11:B42B: 01        .byte bra_case_B42C_01 - *

bra_case_B42C_01:
- D - I - 0x02343C 11:B42C: F7        .byte con_F7, $10
- D - I - 0x02343E 11:B42E: 10        .byte con_pause + $10
- D - I - 0x02343F 11:B42F: 05        .byte con_bg + $05
- D - I - 0x023440 11:B430: 00        .byte con_animation + $00
- D - I - 0x023441 11:B431: F0        .byte con_cloud + con_skip
bra_case_B432_00:
- D - I - 0x023442 11:B432: FB        .byte con_rts

bra_long_case_B433_00_рандом_1:
- D - I - 0x023443 11:B433: 28        .byte con_pause + $28
- D - I - 0x023444 11:B434: 1E        .byte con_bg + $1E
- D - I - 0x023445 11:B435: 3E        .byte con_animation + $3E
- D - I - 0x023446 11:B436: F0        .byte con_cloud + con_skip
- D - I - 0x023447 11:B437: FB        .byte con_rts

bra_long_case_B438_01_рандом_2:
- D - I - 0x023448 11:B438: 28        .byte con_pause + $28
- D - I - 0x023449 11:B439: 1E        .byte con_bg + $1E
- D - I - 0x02344A 11:B43A: 3F        .byte con_animation + $3F
- D - I - 0x02344B 11:B43B: F0        .byte con_cloud + con_skip
- D - I - 0x02344C 11:B43C: FB        .byte con_rts

loc_B43D:
- D - I - 0x02344D 11:B43D: 3D        .byte con_pause + $3D
- D - I - 0x02344E 11:B43E: 56        .byte con_bg + $56
- D - I - 0x02344F 11:B43F: 6E        .byte con_animation + $6E
- D - I - 0x023450 11:B440: 4D        .byte con_cloud + $4D
- D - I - 0x023451 11:B441: FB        .byte con_rts

loc_B442:
- D - I - 0x023452 11:B442: F7        .byte con_F7, $02
- D - I - 0x023454 11:B444: 3D        .byte con_pause + $3D
- D - I - 0x023455 11:B445: 22        .byte con_bg + $22
- D - I - 0x023456 11:B446: 6F        .byte con_animation + $6F
- D - I - 0x023457 11:B447: 4D        .byte con_cloud + $4D
- D - I - 0x023458 11:B448: FB        .byte con_rts

sub_B449:
- - - - - 0x023459 11:B449: 28        .byte con_pause + $28
- - - - - 0x02345A 11:B44A: 20        .byte con_bg + $20
- - - - - 0x02345B 11:B44B: 70        .byte con_animation + $70
- - - - - 0x02345C 11:B44C: 00        .byte con_cloud + con_clear
- - - - - 0x02345D 11:B44D: FB        .byte con_rts

loc_B44E_кипер_идеально_засейвил:
sub_B44E_кипер_идеально_засейвил:
- D - I - 0x02345E 11:B44E: 5A        .byte con_pause + $5A
- D - I - 0x02345F 11:B44F: F0        .byte con_bg + con_skip
- D - I - 0x023460 11:B450: F0        .byte con_animation + con_skip
- D - I - 0x023461 11:B451: 33        .byte con_cloud + $33
- D - I - 0x023462 11:B452: FB        .byte con_rts

bra_long_case_B453_00_рандом_1:
- D - I - 0x023463 11:B453: 32        .byte con_pause + $32
- D - I - 0x023464 11:B454: 1C        .byte con_bg + $1C
- D - I - 0x023465 11:B455: 13        .byte con_animation + $13
- D - I - 0x023466 11:B456: 02        .byte con_cloud + $02
- D - I - 0x023467 11:B457: FB        .byte con_rts

bra_long_case_B458_01_рандом_2:
- D - I - 0x023468 11:B458: 32        .byte con_pause + $32
- D - I - 0x023469 11:B459: 1C        .byte con_bg + $1C
- D - I - 0x02346A 11:B45A: 14        .byte con_animation + $14
- D - I - 0x02346B 11:B45B: 02        .byte con_cloud + $02
- D - I - 0x02346C 11:B45C: FB        .byte con_rts

loc_B45D:
sub_B45D:
- D - I - 0x02346D 11:B45D: FD        .byte con_mirror_condition, $04
- D - I - 0x02346F 11:B45F: 3C        .byte con_pause + $3C
- D - I - 0x023470 11:B460: 20        .byte con_bg + $20
- D - I - 0x023471 11:B461: 52        .byte con_animation + $52
- D - I - 0x023472 11:B462: 50        .byte con_cloud + $50
- D - I - 0x023473 11:B463: FB        .byte con_rts

sub_B465:
- D - I - 0x023475 11:B465: F7        .byte con_F7, $0F
- D - I - 0x023477 11:B467: 1E        .byte con_pause + $1E
- D - I - 0x023478 11:B468: 05        .byte con_bg + $05
- D - I - 0x023479 11:B469: 00        .byte con_animation + $00
- D - I - 0x02347A 11:B46A: F0        .byte con_cloud + con_skip
- D - I - 0x02347B 11:B46B: F7        .byte con_F7, $2A
- D - I - 0x02347D 11:B46D: F9        .byte con_soundID_delay, $2E, $02
- D - I - 0x023480 11:B470: 23        .byte con_pause + $23
- D - I - 0x023481 11:B471: 6A        .byte con_bg + $6A
- D - I - 0x023482 11:B472: BD        .byte con_animation + $BD
- D - I - 0x023483 11:B473: 56        .byte con_cloud + $56
- D - I - 0x023484 11:B474: FA        .byte con_jsr
- D - I - 0x023485 11:B475: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023487 11:B477: 3C        .byte con_pause + $3C
- D - I - 0x023488 11:B478: 1F        .byte con_bg + $1F
- D - I - 0x023489 11:B479: 13        .byte con_animation + $13
- D - I - 0x02348A 11:B47A: 57        .byte con_cloud + $57
- D - I - 0x02348B 11:B47B: FB        .byte con_rts



_scenario_B47C_3A:
- D - I - 0x02348C 11:B47C: FD        .byte con_mirror_condition, $00
- D - I - 0x02348E 11:B47E: F9        .byte con_soundID_delay, $2B, $09
- D - I - 0x023491 11:B481: 3C        .byte con_pause + $3C
- D - I - 0x023492 11:B482: 72        .byte con_bg + $72
- D - I - 0x023493 11:B483: 77        .byte con_animation + $77
- D - I - 0x023494 11:B484: 47        .byte con_cloud + $47
- D - I - 0x023495 11:B485: FB        .byte con_rts



_scenario_B486_1B:
- D - I - 0x023496 11:B486: FD        .byte con_mirror_condition, $00
- D - I - 0x023498 11:B488: F3        .byte con_branch, $0C
- D - I - 0x02349A 11:B48A: 9A B4     .word bra_long_case_B49A_00
- D - I - 0x02349C 11:B48C: 8E B4     .word bra_long_case_B48E_01



_scenario_B48E_03:
bra_long_case_B48E_01:
- D - I - 0x02349E 11:B48E: F4        .byte con_mirror_on
- D - I - 0x02349F 11:B48F: FA        .byte con_jsr
- D - I - 0x0234A0 11:B490: 4B BB     .word sub_BB4B
- D - I - 0x0234A2 11:B492: F9        .byte con_soundID_delay, $2C, $1D
- D - I - 0x0234A5 11:B495: 3C        .byte con_pause + $3C
- D - I - 0x0234A6 11:B496: 01        .byte con_bg + $01
- D - I - 0x0234A7 11:B497: 78        .byte con_animation + $78
- D - I - 0x0234A8 11:B498: EB        .byte con_cloud + $EB
- D - I - 0x0234A9 11:B499: FB        .byte con_rts

bra_long_case_B49A_00:
- D - I - 0x0234AA 11:B49A: F6        .byte con_mirror_toggle
- D - I - 0x0234AB 11:B49B: FA        .byte con_jsr
- D - I - 0x0234AC 11:B49C: 4B BB     .word sub_BB4B
loc_B49E:
- D - I - 0x0234AE 11:B49E: F9        .byte con_soundID_delay, $2C, $1D
- D - I - 0x0234B1 11:B4A1: 3C        .byte con_pause + $3C
- D - I - 0x0234B2 11:B4A2: 01        .byte con_bg + $01
- D - I - 0x0234B3 11:B4A3: 78        .byte con_animation + $78
- D - I - 0x0234B4 11:B4A4: 58        .byte con_cloud + $58
- D - I - 0x0234B5 11:B4A5: FB        .byte con_rts

loc_B4A6:
- D - I - 0x0234B6 11:B4A6: F9        .byte con_soundID_delay, $2C, $02
- D - I - 0x0234B9 11:B4A9: 3C        .byte con_pause + $3C
- D - I - 0x0234BA 11:B4AA: 01        .byte con_bg + $01
- D - I - 0x0234BB 11:B4AB: 78        .byte con_animation + $78
- D - I - 0x0234BC 11:B4AC: 6E        .byte con_cloud + $6E
- D - I - 0x0234BD 11:B4AD: FB        .byte con_rts

loc_B4AE:
- D - I - 0x0234BE 11:B4AE: F9        .byte con_soundID_delay, $2C, $11
- D - I - 0x0234C1 11:B4B1: 38        .byte con_pause + $38
- D - I - 0x0234C2 11:B4B2: 63        .byte con_bg + $63
- D - I - 0x0234C3 11:B4B3: 7A        .byte con_animation + $7A
- D - I - 0x0234C4 11:B4B4: 6E        .byte con_cloud + $6E
- D - I - 0x0234C5 11:B4B5: FB        .byte con_rts

loc_B4B6:
- D - I - 0x0234C6 11:B4B6: F9        .byte con_soundID_delay, $2C, $11
- D - I - 0x0234C9 11:B4B9: 38        .byte con_pause + $38
- D - I - 0x0234CA 11:B4BA: 63        .byte con_bg + $63
- D - I - 0x0234CB 11:B4BB: 7A        .byte con_animation + $7A
- D - I - 0x0234CC 11:B4BC: 58        .byte con_cloud + $58
- D - I - 0x0234CD 11:B4BD: FB        .byte con_rts



_scenario_B4CC_28:
- D - I - 0x0234DC 11:B4CC: FD        .byte con_mirror_condition, $00
- D - I - 0x0234DE 11:B4CE: F9        .byte con_soundID_delay, $2B, $09
- D - I - 0x0234E1 11:B4D1: 32        .byte con_pause + $32
- D - I - 0x0234E2 11:B4D2: 26        .byte con_bg + $26
- D - I - 0x0234E3 11:B4D3: 7F        .byte con_animation + $7F
- D - I - 0x0234E4 11:B4D4: 60        .byte con_cloud + $60
- D - I - 0x0234E5 11:B4D5: FB        .byte con_rts



_scenario_B4D6_2D:
- D - I - 0x0234E6 11:B4D6: FD        .byte con_mirror_condition, $00
- D - I - 0x0234E8 11:B4D8: F9        .byte con_soundID_delay, $64, $0D
- D - I - 0x0234EB 11:B4DB: 3A        .byte con_pause + $3A
- D - I - 0x0234EC 11:B4DC: 3C        .byte con_bg + $3C
- D - I - 0x0234ED 11:B4DD: 80        .byte con_animation + $80
- D - I - 0x0234EE 11:B4DE: 61        .byte con_cloud + $61
- D - I - 0x0234EF 11:B4DF: FB        .byte con_rts



_scenario_B4E0_2A:
- D - I - 0x0234F0 11:B4E0: FD        .byte con_mirror_condition, $00
- D - I - 0x0234F2 11:B4E2: 30        .byte con_pause + $30
- D - I - 0x0234F3 11:B4E3: 3E        .byte con_bg + $3E
- D - I - 0x0234F4 11:B4E4: 81        .byte con_animation + $81
- D - I - 0x0234F5 11:B4E5: 62        .byte con_cloud + $62
- D - I - 0x0234F6 11:B4E6: FB        .byte con_rts

bra_long_case_B4E7_00_shot:
sub_B4E7:
- D - I - 0x0234F7 11:B4E7: F9        .byte con_soundID_delay, $03, $02
- D - I - 0x0234FA 11:B4EA: 3C        .byte con_pause + $3C
- D - I - 0x0234FB 11:B4EB: 1F        .byte con_bg + $1F
- D - I - 0x0234FC 11:B4EC: 84        .byte con_animation + $84
- D - I - 0x0234FD 11:B4ED: 00        .byte con_cloud + con_clear
- D - I - 0x0234FE 11:B4EE: FB        .byte con_rts

bra_long_case_B4EF_01_header:
- D - I - 0x0234FF 11:B4EF: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x023502 11:B4F2: 37        .byte con_pause + $37
- D - I - 0x023503 11:B4F3: 2A        .byte con_bg + $2A
- D - I - 0x023504 11:B4F4: 1A        .byte con_animation + $1A
- D - I - 0x023505 11:B4F5: 00        .byte con_cloud + con_clear
- D - I - 0x023506 11:B4F6: FB        .byte con_rts

bra_long_case_B4F7_02_volley:
bra_long_case_B4F7_08_skylab_hurricane:
- D - I - 0x023507 11:B4F7: FA        .byte con_jsr
- D - I - 0x023508 11:B4F8: 65 BB     .word sub_BB65
- D - I - 0x02350A 11:B4FA: FB        .byte con_rts

bra_long_case_B4FB_03_drive_shot:
- D - I - 0x02350B 11:B4FB: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x02350E 11:B4FE: 37        .byte con_pause + $37
- D - I - 0x02350F 11:B4FF: 00        .byte con_bg + $00
- D - I - 0x023510 11:B500: 01        .byte con_animation + $01
- D - I - 0x023511 11:B501: 00        .byte con_cloud + con_clear
bra_long_case_B502_01:
- D - I - 0x023512 11:B502: FA        .byte con_jsr
- D - I - 0x023513 11:B503: 5D BB     .word sub_BB5D
- D - I - 0x023515 11:B505: FA        .byte con_jsr
- D - I - 0x023516 11:B506: 65 BB     .word sub_BB65
- D - I - 0x023518 11:B508: FB        .byte con_rts

bra_long_case_B509_04_drive_overhead:
sub_B509:
- D - I - 0x023519 11:B509: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x02351C 11:B50C: 2A        .byte con_pause + $2A
- D - I - 0x02351D 11:B50D: 00        .byte con_bg + $00
- D - I - 0x02351E 11:B50E: 0F        .byte con_animation + $0F
- D - I - 0x02351F 11:B50F: 00        .byte con_cloud + con_clear
- D - I - 0x023520 11:B510: F7        .byte con_F7, $33
- D - I - 0x023522 11:B512: F9        .byte con_soundID_delay, $05, $02
- D - I - 0x023525 11:B515: 36        .byte con_pause + $36
- D - I - 0x023526 11:B516: 27        .byte con_bg + $27
- D - I - 0x023527 11:B517: 10        .byte con_animation + $10
- D - I - 0x023528 11:B518: 00        .byte con_cloud + con_clear
sub_B519:
- D - I - 0x023529 11:B519: F6        .byte con_mirror_toggle
- D - I - 0x02352A 11:B51A: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x02352D 11:B51D: F7        .byte con_F7, $09
- D - I - 0x02352F 11:B51F: 24        .byte con_pause + $24
- D - I - 0x023530 11:B520: 43        .byte con_bg + $43
- D - I - 0x023531 11:B521: 5F        .byte con_animation + $5F
- D - I - 0x023532 11:B522: 00        .byte con_cloud + con_clear
- D - I - 0x023533 11:B523: F6        .byte con_mirror_toggle
- D - I - 0x023534 11:B524: FB        .byte con_rts

bra_long_case_B525_05_falcon_shot:
- D - I - 0x023535 11:B525: FA        .byte con_jsr
- D - I - 0x023536 11:B526: 75 BB     .word sub_BB75
- D - I - 0x023538 11:B528: F7        .byte con_F7, $33
- D - I - 0x02353A 11:B52A: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x02353D 11:B52D: 2A        .byte con_pause + $2A
- D - I - 0x02353E 11:B52E: 27        .byte con_bg + $27
- D - I - 0x02353F 11:B52F: 12        .byte con_animation + $12
- D - I - 0x023540 11:B530: 00        .byte con_cloud + con_clear
- D - I - 0x023541 11:B531: FB        .byte con_rts

bra_long_case_B532_06_falcon_volley:
- D - I - 0x023542 11:B532: FA        .byte con_jsr
- D - I - 0x023543 11:B533: 75 BB     .word sub_BB75
- D - I - 0x023545 11:B535: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x023548 11:B538: F7        .byte con_F7, $30
- D - I - 0x02354A 11:B53A: 30        .byte con_pause + $30
- D - I - 0x02354B 11:B53B: 4B        .byte con_bg + $4B
- D - I - 0x02354C 11:B53C: 0F        .byte con_animation + $0F
- D - I - 0x02354D 11:B53D: 00        .byte con_cloud + con_clear
- D - I - 0x02354E 11:B53E: FB        .byte con_rts

bra_long_case_B53F_07_razor_shot:
- D - I - 0x02354F 11:B53F: F6        .byte con_mirror_toggle
- D - I - 0x023550 11:B540: FA        .byte con_jsr
- D - I - 0x023551 11:B541: 8F BB     .word sub_BB8F
loc_B543:
- D - I - 0x023553 11:B543: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x023556 11:B546: 34        .byte con_pause + $34
- D - I - 0x023557 11:B547: 56        .byte con_bg + $56
- D - I - 0x023558 11:B548: 1D        .byte con_animation + $1D
- D - I - 0x023559 11:B549: 00        .byte con_cloud + con_clear
- D - I - 0x02355A 11:B54A: F6        .byte con_mirror_toggle
- D - I - 0x02355B 11:B54B: FA        .byte con_jsr
- D - I - 0x02355C 11:B54C: 8F BB     .word sub_BB8F
- D - I - 0x02355E 11:B54E: FB        .byte con_rts

bra_long_case_B54F_02:
- D - I - 0x02355F 11:B54F: F6        .byte con_mirror_toggle
- D - I - 0x023560 11:B550: F2        .byte con_jmp
- D - I - 0x023561 11:B551: 43 B5     .word loc_B543

bra_long_case_B553_09_twin_shot:
- D - I - 0x023563 11:B553: FA        .byte con_jsr
- D - I - 0x023564 11:B554: A7 BB     .word sub_BBA7_полет_twin_shot_1
- D - I - 0x023566 11:B556: FA        .byte con_jsr
- D - I - 0x023567 11:B557: AF BB     .word sub_BBAF_полет_twin_shot_2
- D - I - 0x023569 11:B559: FB        .byte con_rts

bra_long_case_B55A_0A_skylab_twin_shot:
- D - I - 0x02356A 11:B55A: FA        .byte con_jsr
- D - I - 0x02356B 11:B55B: A7 BB     .word sub_BBA7_полет_twin_shot_1
- D - I - 0x02356D 11:B55D: F7        .byte con_F7, $3A
- D - I - 0x02356F 11:B55F: F9        .byte con_soundID_delay, $0A, $02
- D - I - 0x023572 11:B562: 46        .byte con_pause + $46
- D - I - 0x023573 11:B563: 24        .byte con_bg + $24
- D - I - 0x023574 11:B564: 28        .byte con_animation + $28
- D - I - 0x023575 11:B565: 00        .byte con_cloud + con_clear
- D - I - 0x023576 11:B566: FB        .byte con_rts

bra_long_case_B567_0B_eagle_shot:
- D - I - 0x023577 11:B567: FA        .byte con_jsr
- D - I - 0x023578 11:B568: 85 BB     .word sub_BB85
- D - I - 0x02357A 11:B56A: F9        .byte con_soundID_delay, $5E, $02
- D - I - 0x02357D 11:B56D: 1E        .byte con_pause + $1E
- D - I - 0x02357E 11:B56E: 35        .byte con_bg + $35
- D - I - 0x02357F 11:B56F: 32        .byte con_animation + $32
- D - I - 0x023580 11:B570: 00        .byte con_cloud + con_clear
- D - I - 0x023581 11:B571: FA        .byte con_jsr
- D - I - 0x023582 11:B572: 85 BB     .word sub_BB85
- D - I - 0x023584 11:B574: FB        .byte con_rts

bra_long_case_B575_0C_tiger_shot:
- D - I - 0x023585 11:B575: FA        .byte con_jsr
- D - I - 0x023586 11:B576: 8F BB     .word sub_BB8F
- D - I - 0x023588 11:B578: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x02358B 11:B57B: 32        .byte con_pause + $32
- D - I - 0x02358C 11:B57C: 02        .byte con_bg + $02
- D - I - 0x02358D 11:B57D: 36        .byte con_animation + $36
- D - I - 0x02358E 11:B57E: 00        .byte con_cloud + con_clear
- D - I - 0x02358F 11:B57F: FA        .byte con_jsr
- D - I - 0x023590 11:B580: 7D BB     .word sub_BB7D
- D - I - 0x023592 11:B582: FB        .byte con_rts

bra_long_case_B583_0D_neo_tiger_shot:
sub_B583:
- D - I - 0x023593 11:B583: F7        .byte con_F7, $0C
- D - I - 0x023595 11:B585: FA        .byte con_jsr
- D - I - 0x023596 11:B586: 97 BB     .word sub_BB97
- D - I - 0x023598 11:B588: F6        .byte con_mirror_toggle
- D - I - 0x023599 11:B589: F7        .byte con_F7, $0C
- D - I - 0x02359B 11:B58B: FA        .byte con_jsr
- D - I - 0x02359C 11:B58C: 97 BB     .word sub_BB97
- D - I - 0x02359E 11:B58E: F6        .byte con_mirror_toggle
- D - I - 0x02359F 11:B58F: F7        .byte con_F7, $16
- D - I - 0x0235A1 11:B591: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x0235A4 11:B594: 32        .byte con_pause + $32
- D - I - 0x0235A5 11:B595: 49        .byte con_bg + $49
- D - I - 0x0235A6 11:B596: 36        .byte con_animation + $36
- D - I - 0x0235A7 11:B597: 00        .byte con_cloud + con_clear
- D - I - 0x0235A8 11:B598: FB        .byte con_rts

bra_long_case_B599_0E_overhead:
- D - I - 0x0235A9 11:B599: FA        .byte con_jsr
- D - I - 0x0235AA 11:B59A: 6D BB     .word sub_BB6D
- D - I - 0x0235AC 11:B59C: FB        .byte con_rts

bra_long_case_B59D_0F_hyper_overhead:
- D - I - 0x0235AD 11:B59D: FA        .byte con_jsr
- D - I - 0x0235AE 11:B59E: 6D BB     .word sub_BB6D
- D - I - 0x0235B0 11:B5A0: FA        .byte con_jsr
- D - I - 0x0235B1 11:B5A1: D6 B6     .word sub_B6D6
- D - I - 0x0235B3 11:B5A3: FB        .byte con_rts

bra_long_case_B5A4_10_jumping_volley:
- D - I - 0x0235B4 11:B5A4: F7        .byte con_F7, $31
- D - I - 0x0235B6 11:B5A6: FA        .byte con_jsr
- D - I - 0x0235B7 11:B5A7: BF BB     .word sub_BBBF
- D - I - 0x0235B9 11:B5A9: F6        .byte con_mirror_toggle
- D - I - 0x0235BA 11:B5AA: F7        .byte con_F7, $31
- D - I - 0x0235BC 11:B5AC: FA        .byte con_jsr
- D - I - 0x0235BD 11:B5AD: BF BB     .word sub_BBBF
- D - I - 0x0235BF 11:B5AF: F6        .byte con_mirror_toggle
- D - I - 0x0235C0 11:B5B0: F7        .byte con_F7, $33
- D - I - 0x0235C2 11:B5B2: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x0235C5 11:B5B5: 32        .byte con_pause + $32
- D - I - 0x0235C6 11:B5B6: 27        .byte con_bg + $27
- D - I - 0x0235C7 11:B5B7: 11        .byte con_animation + $11
- D - I - 0x0235C8 11:B5B8: 00        .byte con_cloud + con_clear
- D - I - 0x0235C9 11:B5B9: FB        .byte con_rts

bra_long_case_B5BA_11_drive_tiger:
- D - I - 0x0235CA 11:B5BA: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x0235CD 11:B5BD: 41        .byte con_pause + $41
- D - I - 0x0235CE 11:B5BE: 02        .byte con_bg + $02
- D - I - 0x0235CF 11:B5BF: 29        .byte con_animation + $29
- D - I - 0x0235D0 11:B5C0: 00        .byte con_cloud + con_clear
- D - I - 0x0235D1 11:B5C1: F9        .byte con_soundID_delay, $0A, $02
- D - I - 0x0235D4 11:B5C4: 3D        .byte con_pause + $3D
- D - I - 0x0235D5 11:B5C5: 13        .byte con_bg + $13
- D - I - 0x0235D6 11:B5C6: 2F        .byte con_animation + $2F
- D - I - 0x0235D7 11:B5C7: 00        .byte con_cloud + con_clear
- D - I - 0x0235D8 11:B5C8: F9        .byte con_soundID_delay, $0A, $02
- D - I - 0x0235DB 11:B5CB: 46        .byte con_pause + $46
- D - I - 0x0235DC 11:B5CC: 5F        .byte con_bg + $5F
- D - I - 0x0235DD 11:B5CD: 28        .byte con_animation + $28
- D - I - 0x0235DE 11:B5CE: 00        .byte con_cloud + con_clear
- D - I - 0x0235DF 11:B5CF: FB        .byte con_rts

bra_long_case_B5D0_12_cyclone:
- D - I - 0x0235E0 11:B5D0: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x0235E3 11:B5D3: 38        .byte con_pause + $38
- D - I - 0x0235E4 11:B5D4: 35        .byte con_bg + $35
- D - I - 0x0235E5 11:B5D5: 10        .byte con_animation + $10
- D - I - 0x0235E6 11:B5D6: 00        .byte con_cloud + con_clear
- D - I - 0x0235E7 11:B5D7: FA        .byte con_jsr
- D - I - 0x0235E8 11:B5D8: 5D BB     .word sub_BB5D
- D - I - 0x0235EA 11:B5DA: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x0235ED 11:B5DD: F7        .byte con_F7, $33
- D - I - 0x0235EF 11:B5DF: 3C        .byte con_pause + $3C
- D - I - 0x0235F0 11:B5E0: 5D        .byte con_bg + $5D
- D - I - 0x0235F1 11:B5E1: 51        .byte con_animation + $51
- D - I - 0x0235F2 11:B5E2: 00        .byte con_cloud + con_clear
- D - I - 0x0235F3 11:B5E3: FB        .byte con_rts

bra_long_case_B5E4_13_sano_combo:
- D - I - 0x0235F4 11:B5E4: F9        .byte con_soundID_delay, $0E, $02
- D - I - 0x0235F7 11:B5E7: 32        .byte con_pause + $32
- D - I - 0x0235F8 11:B5E8: 1D        .byte con_bg + $1D
- D - I - 0x0235F9 11:B5E9: 0F        .byte con_animation + $0F
- D - I - 0x0235FA 11:B5EA: 00        .byte con_cloud + con_clear
- D - I - 0x0235FB 11:B5EB: FB        .byte con_rts

bra_long_case_B5EC_14_banana_shot:
sub_B5EC:
- D - I - 0x0235FC 11:B5EC: FA        .byte con_jsr
- D - I - 0x0235FD 11:B5ED: 8F BB     .word sub_BB8F
- D - I - 0x0235FF 11:B5EF: F9        .byte con_soundID_delay, $0E, $02
- D - I - 0x023602 11:B5F2: 32        .byte con_pause + $32
- D - I - 0x023603 11:B5F3: 62        .byte con_bg + $62
- D - I - 0x023604 11:B5F4: 41        .byte con_animation + $41
- D - I - 0x023605 11:B5F5: 00        .byte con_cloud + con_clear
- D - I - 0x023606 11:B5F6: FB        .byte con_rts

bra_long_case_B5F7_15_booster_shot:
- D - I - 0x023607 11:B5F7: F7        .byte con_F7, $31
- D - I - 0x023609 11:B5F9: FA        .byte con_jsr
- D - I - 0x02360A 11:B5FA: BF BB     .word sub_BBBF
- D - I - 0x02360C 11:B5FC: F7        .byte con_F7, $31
- D - I - 0x02360E 11:B5FE: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x023611 11:B601: 34        .byte con_pause + $34
- D - I - 0x023612 11:B602: 44        .byte con_bg + $44
- D - I - 0x023613 11:B603: 11        .byte con_animation + $11
- D - I - 0x023614 11:B604: 00        .byte con_cloud + con_clear
- D - I - 0x023615 11:B605: F7        .byte con_F7, $31
- D - I - 0x023617 11:B607: FA        .byte con_jsr
- D - I - 0x023618 11:B608: BF BB     .word sub_BBBF
- D - I - 0x02361A 11:B60A: FB        .byte con_rts

bra_long_case_B60B_16_mirage_shot:
sub_B60B:
- D - I - 0x02361B 11:B60B: F7        .byte con_F7, $3B
- D - I - 0x02361D 11:B60D: FA        .byte con_jsr
- D - I - 0x02361E 11:B60E: 8F BB     .word sub_BB8F
- D - I - 0x023620 11:B610: F6        .byte con_mirror_toggle
- D - I - 0x023621 11:B611: F7        .byte con_F7, $3B
- D - I - 0x023623 11:B613: FA        .byte con_jsr
- D - I - 0x023624 11:B614: 8F BB     .word sub_BB8F
- D - I - 0x023626 11:B616: F6        .byte con_mirror_toggle
- D - I - 0x023627 11:B617: F7        .byte con_F7, $3B
- D - I - 0x023629 11:B619: FA        .byte con_jsr
- D - I - 0x02362A 11:B61A: AF BB     .word sub_BBAF_полет_twin_shot_2
- D - I - 0x02362C 11:B61C: FB        .byte con_rts

bra_long_case_B61D_17_mach_shot:
- D - I - 0x02362D 11:B61D: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x023630 11:B620: 32        .byte con_pause + $32
- D - I - 0x023631 11:B621: 1C        .byte con_bg + $1C
- D - I - 0x023632 11:B622: 3C        .byte con_animation + $3C
- D - I - 0x023633 11:B623: 00        .byte con_cloud + con_clear
- D - I - 0x023634 11:B624: F6        .byte con_mirror_toggle
- D - I - 0x023635 11:B625: FA        .byte con_jsr
- D - I - 0x023636 11:B626: 8F BB     .word sub_BB8F
- D - I - 0x023638 11:B628: F6        .byte con_mirror_toggle
- D - I - 0x023639 11:B629: F7        .byte con_F7, $18
- D - I - 0x02363B 11:B62B: F9        .byte con_soundID_delay, $0C, $02
- D - I - 0x02363E 11:B62E: 32        .byte con_pause + $32
- D - I - 0x02363F 11:B62F: 5D        .byte con_bg + $5D
- D - I - 0x023640 11:B630: 3D        .byte con_animation + $3D
- D - I - 0x023641 11:B631: 00        .byte con_cloud + con_clear
- D - I - 0x023642 11:B632: F7        .byte con_F7, $18
- D - I - 0x023644 11:B634: F9        .byte con_soundID_delay, $0D, $02
- D - I - 0x023647 11:B637: 20        .byte con_pause + $20
- D - I - 0x023648 11:B638: F0        .byte con_bg + con_skip
- D - I - 0x023649 11:B639: 00        .byte con_animation + $00
- D - I - 0x02364A 11:B63A: 00        .byte con_cloud + con_clear
- D - I - 0x02364B 11:B63B: F3        .byte con_branch, $A5     ; coimbra уже бил или нет
- D - I - 0x02364D 11:B63D: 02        .byte bra_case_B63F_00_coimbra_еще_не_бил - *
- - - - - 0x02364E 11:B63E: 27        .byte bra_case_B665_01_coimbra_уже_бил - *

bra_case_B63F_00_coimbra_еще_не_бил:
- D - I - 0x02364F 11:B63F: F9        .byte con_soundID_delay, $43, $02
- D - I - 0x023652 11:B642: F5        .byte con_mirror_off
- D - I - 0x023653 11:B643: F3        .byte con_branch, $C1     ; какая у кипера рожа
- - - - - 0x023655 11:B645: 2F        .byte bra_case_B674_00_кипер_без_рожи - *
- - - - - 0x023656 11:B646: 2E        .byte bra_case_B674_01_кипер_ренато - *
- - - - - 0x023657 11:B647: 03        .byte bra_case_B64A_02_кипер_морисаки - *
- D - I - 0x023658 11:B648: 09        .byte bra_case_B651_03_кипер_вакабаяши - *
- - - - - 0x023659 11:B649: 0F        .byte bra_case_B658_04_кипер_вакашимазу - *

bra_case_B64A_02_кипер_морисаки:
- - - - - 0x02365A 11:B64A: 78        .byte con_pause + $78
- - - - - 0x02365B 11:B64B: 33        .byte con_bg + $33
- - - - - 0x02365C 11:B64C: 94        .byte con_animation + $94
- - - - - 0x02365D 11:B64D: 9B        .byte con_cloud + $9B
- - - - - 0x02365E 11:B64E: F2        .byte con_jmp
- - - - - 0x02365F 11:B64F: 5F B6     .word loc_B65F

bra_case_B651_03_кипер_вакабаяши:
- D - I - 0x023661 11:B651: 78        .byte con_pause + $78
- D - I - 0x023662 11:B652: 32        .byte con_bg + $32
- D - I - 0x023663 11:B653: A4        .byte con_animation + $A4
- D - I - 0x023664 11:B654: 9B        .byte con_cloud + $9B
- D - I - 0x023665 11:B655: F2        .byte con_jmp
- D - I - 0x023666 11:B656: 5F B6     .word loc_B65F

bra_case_B658_04_кипер_вакашимазу:
- - - - - 0x023668 11:B658: 78        .byte con_pause + $78
- - - - - 0x023669 11:B659: 33        .byte con_bg + $33
- - - - - 0x02366A 11:B65A: A6        .byte con_animation + $A6
- - - - - 0x02366B 11:B65B: 9B        .byte con_cloud + $9B
; bzk бесполезный прыжок
- - - - - 0x02366C 11:B65C: F2        .byte con_jmp
- - - - - 0x02366D 11:B65D: 5F B6     .word loc_B65F

loc_B65F:
- D - I - 0x02366F 11:B65F: FA        .byte con_jsr
- D - I - 0x023670 11:B660: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023672 11:B662: F9        .byte con_soundID_delay, $7F, $02
bra_case_B665_01_coimbra_уже_бил:
- D - I - 0x023675 11:B665: F7        .byte con_F7, $2E
- D - I - 0x023677 11:B667: 32        .byte con_pause + $32
- D - I - 0x023678 11:B668: 64        .byte con_bg + $64
- D - I - 0x023679 11:B669: 00        .byte con_animation + $00
- D - I - 0x02367A 11:B66A: 00        .byte con_cloud + con_clear
- D - I - 0x02367B 11:B66B: F9        .byte con_soundID_delay, $11, $02
- D - I - 0x02367E 11:B66E: F7        .byte con_F7, $12
- D - I - 0x023680 11:B670: 32        .byte con_pause + $32
- D - I - 0x023681 11:B671: F0        .byte con_bg + con_skip
- D - I - 0x023682 11:B672: 11        .byte con_animation + $11
- D - I - 0x023683 11:B673: 00        .byte con_cloud + con_clear
bra_case_B674_00_кипер_без_рожи:
bra_case_B674_01_кипер_ренато:
- D - I - 0x023684 11:B674: FB        .byte con_rts

bra_long_case_B675_18_sidewinder_shot:
- D - I - 0x023685 11:B675: FA        .byte con_jsr
- D - I - 0x023686 11:B676: 9F BB     .word sub_BB9F
- D - I - 0x023688 11:B678: F6        .byte con_mirror_toggle
- D - I - 0x023689 11:B679: FA        .byte con_jsr
- D - I - 0x02368A 11:B67A: 9F BB     .word sub_BB9F
- D - I - 0x02368C 11:B67C: F6        .byte con_mirror_toggle
- D - I - 0x02368D 11:B67D: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x023690 11:B680: 3C        .byte con_pause + $3C
- D - I - 0x023691 11:B681: 35        .byte con_bg + $35
- D - I - 0x023692 11:B682: 5D        .byte con_animation + $5D
- D - I - 0x023693 11:B683: 00        .byte con_cloud + con_clear
- D - I - 0x023694 11:B684: FB        .byte con_rts

bra_long_case_B685_19_slider_shot:
- D - I - 0x023695 11:B685: FA        .byte con_jsr
- D - I - 0x023696 11:B686: B7 BB     .word sub_BBB7
- D - I - 0x023698 11:B688: F9        .byte con_soundID_delay, $10, $02
- D - I - 0x02369B 11:B68B: 37        .byte con_pause + $37
- D - I - 0x02369C 11:B68C: 5B        .byte con_bg + $5B
- D - I - 0x02369D 11:B68D: 5E        .byte con_animation + $5E
- D - I - 0x02369E 11:B68E: 00        .byte con_cloud + con_clear
- D - I - 0x02369F 11:B68F: FB        .byte con_rts

bra_long_case_B690_1A_cannon_shot:
- D - I - 0x0236A0 11:B690: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x0236A3 11:B693: 30        .byte con_pause + $30
- D - I - 0x0236A4 11:B694: 5A        .byte con_bg + $5A
- D - I - 0x0236A5 11:B695: 1A        .byte con_animation + $1A
- D - I - 0x0236A6 11:B696: 00        .byte con_cloud + con_clear
- D - I - 0x0236A7 11:B697: F6        .byte con_mirror_toggle
- D - I - 0x0236A8 11:B698: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x0236AB 11:B69B: 30        .byte con_pause + $30
- D - I - 0x0236AC 11:B69C: 5A        .byte con_bg + $5A
- D - I - 0x0236AD 11:B69D: 1A        .byte con_animation + $1A
- D - I - 0x0236AE 11:B69E: 00        .byte con_cloud + con_clear
- D - I - 0x0236AF 11:B69F: F6        .byte con_mirror_toggle
- D - I - 0x0236B0 11:B6A0: F9        .byte con_soundID_delay, $0C, $02
- D - I - 0x0236B3 11:B6A3: 0A        .byte con_pause + $0A
- D - I - 0x0236B4 11:B6A4: 14        .byte con_bg + $14
- D - I - 0x0236B5 11:B6A5: 3D        .byte con_animation + $3D
- D - I - 0x0236B6 11:B6A6: 00        .byte con_cloud + con_clear
- D - I - 0x0236B7 11:B6A7: 0A        .byte con_pause + $0A
- D - I - 0x0236B8 11:B6A8: 15        .byte con_bg + $15
- D - I - 0x0236B9 11:B6A9: F0        .byte con_animation + con_skip
- D - I - 0x0236BA 11:B6AA: F0        .byte con_cloud + con_skip
- D - I - 0x0236BB 11:B6AB: 0A        .byte con_pause + $0A
- D - I - 0x0236BC 11:B6AC: 16        .byte con_bg + $16
- D - I - 0x0236BD 11:B6AD: F0        .byte con_animation + con_skip
- D - I - 0x0236BE 11:B6AE: F0        .byte con_cloud + con_skip
- D - I - 0x0236BF 11:B6AF: 0A        .byte con_pause + $0A
- D - I - 0x0236C0 11:B6B0: 17        .byte con_bg + $17
- D - I - 0x0236C1 11:B6B1: F0        .byte con_animation + con_skip
- D - I - 0x0236C2 11:B6B2: F0        .byte con_cloud + con_skip
- D - I - 0x0236C3 11:B6B3: 0A        .byte con_pause + $0A
- D - I - 0x0236C4 11:B6B4: 18        .byte con_bg + $18
- D - I - 0x0236C5 11:B6B5: F0        .byte con_animation + con_skip
- D - I - 0x0236C6 11:B6B6: F0        .byte con_cloud + con_skip
- D - I - 0x0236C7 11:B6B7: FB        .byte con_rts

bra_long_case_B6C0_1B_fire_shot:
- D - I - 0x0236D0 11:B6C0: F7        .byte con_F7, $0D
- D - I - 0x0236D2 11:B6C2: FA        .byte con_jsr
- D - I - 0x0236D3 11:B6C3: B7 BB     .word sub_BBB7
- D - I - 0x0236D5 11:B6C5: F6        .byte con_mirror_toggle
- D - I - 0x0236D6 11:B6C6: F7        .byte con_F7, $0D
- D - I - 0x0236D8 11:B6C8: FA        .byte con_jsr
- D - I - 0x0236D9 11:B6C9: B7 BB     .word sub_BBB7
- D - I - 0x0236DB 11:B6CB: F6        .byte con_mirror_toggle
- D - I - 0x0236DC 11:B6CC: F7        .byte con_F7, $39
- D - I - 0x0236DE 11:B6CE: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x0236E1 11:B6D1: 32        .byte con_pause + $32
- D - I - 0x0236E2 11:B6D2: 5A        .byte con_bg + $5A
- D - I - 0x0236E3 11:B6D3: 11        .byte con_animation + $11
- D - I - 0x0236E4 11:B6D4: 00        .byte con_cloud + con_clear
- D - I - 0x0236E5 11:B6D5: FB        .byte con_rts

bra_long_case_B6D6_1C_dynamite_header:
sub_B6D6:
- D - I - 0x0236E6 11:B6D6: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x0236E9 11:B6D9: 20        .byte con_pause + $20
- D - I - 0x0236EA 11:B6DA: 13        .byte con_bg + $13
- D - I - 0x0236EB 11:B6DB: 12        .byte con_animation + $12
- D - I - 0x0236EC 11:B6DC: 00        .byte con_cloud + con_clear
- D - I - 0x0236ED 11:B6DD: FB        .byte con_rts

bra_long_case_B6DE_1D_cannon_header:
- - - - - 0x0236EE 11:B6DE: F9        .byte con_soundID_delay, $04, $02
- - - - - 0x0236F1 11:B6E1: 1E        .byte con_pause + $1E
- - - - - 0x0236F2 11:B6E2: 67        .byte con_bg + $67
- - - - - 0x0236F3 11:B6E3: 72        .byte con_animation + $72
- - - - - 0x0236F4 11:B6E4: 00        .byte con_cloud + con_clear
- - - - - 0x0236F5 11:B6E5: FB        .byte con_rts

bra_long_case_B6E6_1E_rocket_header:
- D - I - 0x0236F6 11:B6E6: F6        .byte con_mirror_toggle
- D - I - 0x0236F7 11:B6E7: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x0236FA 11:B6EA: 33        .byte con_pause + $33
- D - I - 0x0236FB 11:B6EB: 13        .byte con_bg + $13
- D - I - 0x0236FC 11:B6EC: 1D        .byte con_animation + $1D
- D - I - 0x0236FD 11:B6ED: 00        .byte con_cloud + con_clear
- D - I - 0x0236FE 11:B6EE: F6        .byte con_mirror_toggle
- D - I - 0x0236FF 11:B6EF: FB        .byte con_rts

bra_long_case_B6F0_1F_rising_dragon_kick:
- D - I - 0x023700 11:B6F0: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x023703 11:B6F3: 32        .byte con_pause + $32
- D - I - 0x023704 11:B6F4: 13        .byte con_bg + $13
- D - I - 0x023705 11:B6F5: 40        .byte con_animation + $40
- D - I - 0x023706 11:B6F6: 00        .byte con_cloud + con_clear
- D - I - 0x023707 11:B6F7: F7        .byte con_F7, $14
- D - I - 0x023709 11:B6F9: F9        .byte con_soundID_delay, $0E, $02
- D - I - 0x02370C 11:B6FC: 23        .byte con_pause + $23
- D - I - 0x02370D 11:B6FD: 43        .byte con_bg + $43
- D - I - 0x02370E 11:B6FE: 73        .byte con_animation + $73
- D - I - 0x02370F 11:B6FF: 00        .byte con_cloud + con_clear
- D - I - 0x023710 11:B700: FB        .byte con_rts

bra_long_case_B701_20_foward_somersault:
- D - I - 0x023711 11:B701: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x023714 11:B704: 28        .byte con_pause + $28
- D - I - 0x023715 11:B705: 68        .byte con_bg + $68
- D - I - 0x023716 11:B706: 12        .byte con_animation + $12
- D - I - 0x023717 11:B707: 00        .byte con_cloud + con_clear
- D - I - 0x023718 11:B708: F7        .byte con_F7, $2B
- D - I - 0x02371A 11:B70A: F9        .byte con_soundID_delay, $05, $02
- D - I - 0x02371D 11:B70D: 46        .byte con_pause + $46
- D - I - 0x02371E 11:B70E: 60        .byte con_bg + $60
- D - I - 0x02371F 11:B70F: 74        .byte con_animation + $74
- D - I - 0x023720 11:B710: 00        .byte con_cloud + con_clear
- D - I - 0x023721 11:B711: FB        .byte con_rts

bra_long_case_B712_21_slider_cannon:
sub_B712:
- D - I - 0x023722 11:B712: FA        .byte con_jsr
- D - I - 0x023723 11:B713: AF BB     .word sub_BBAF_полет_twin_shot_2
- D - I - 0x023725 11:B715: F6        .byte con_mirror_toggle
- D - I - 0x023726 11:B716: FA        .byte con_jsr
- D - I - 0x023727 11:B717: A7 BB     .word sub_BBA7_полет_twin_shot_1
- D - I - 0x023729 11:B719: F7        .byte con_F7, $3A
- D - I - 0x02372B 11:B71B: F9        .byte con_soundID_delay, $0A, $02
- D - I - 0x02372E 11:B71E: 46        .byte con_pause + $46
- D - I - 0x02372F 11:B71F: 5E        .byte con_bg + $5E
- D - I - 0x023730 11:B720: 28        .byte con_animation + $28
- D - I - 0x023731 11:B721: 00        .byte con_cloud + con_clear
- D - I - 0x023732 11:B722: F6        .byte con_mirror_toggle
- D - I - 0x023733 11:B723: FB        .byte con_rts

bra_long_case_B724_22_double_eel:
sub_B724:
- D - I - 0x023734 11:B724: F9        .byte con_soundID_delay, $0F, $02
- D - I - 0x023737 11:B727: 3D        .byte con_pause + $3D
- D - I - 0x023738 11:B728: 4E        .byte con_bg + $4E
- D - I - 0x023739 11:B729: 5D        .byte con_animation + $5D
- D - I - 0x02373A 11:B72A: 00        .byte con_cloud + con_clear
- D - I - 0x02373B 11:B72B: FB        .byte con_rts



_scenario_B72C_2B:
- D - I - 0x02373C 11:B72C: 78        .byte con_pause + $78
- D - I - 0x02373D 11:B72D: 46        .byte con_bg + $46
- D - I - 0x02373E 11:B72E: 00        .byte con_animation + $00
- D - I - 0x02373F 11:B72F: 65        .byte con_cloud + $65
- D - I - 0x023740 11:B730: F2        .byte con_jmp
- D - I - 0x023741 11:B731: C7 BB     .word loc_BBC7_очистка



_scenario_B733_1F:
- D - I - 0x023743 11:B733: 96        .byte con_pause + $96
- D - I - 0x023744 11:B734: F0        .byte con_bg + con_skip
- D - I - 0x023745 11:B735: F0        .byte con_animation + con_skip
- D - I - 0x023746 11:B736: 66        .byte con_cloud + $66
- D - I - 0x023747 11:B737: FB        .byte con_rts



_scenario_B738_20:
- D - I - 0x023748 11:B738: FA        .byte con_jsr
- D - I - 0x023749 11:B739: C7 BB     .word sub_BBC7_очистка
- D - I - 0x02374B 11:B73B: F3        .byte con_branch, $A2     ; у чьей команды мяч
- D - I - 0x02374D 11:B73D: 02        .byte bra_case_B73F_00_мяч_у_команды_слева - *
- D - I - 0x02374E 11:B73E: 06        .byte bra_case_B744_01_мяч_у_команды_справа - *

bra_case_B73F_00_мяч_у_команды_слева:
- D - I - 0x02374F 11:B73F: B4        .byte con_pause + $B4
- D - I - 0x023750 11:B740: 38        .byte con_bg + $38
- D - I - 0x023751 11:B741: 85        .byte con_animation + $85
- D - I - 0x023752 11:B742: 67        .byte con_cloud + $67
- D - I - 0x023753 11:B743: FB        .byte con_rts

bra_case_B744_01_мяч_у_команды_справа:
- D - I - 0x023754 11:B744: B4        .byte con_pause + $B4
- D - I - 0x023755 11:B745: 37        .byte con_bg + $37
- D - I - 0x023756 11:B746: 85        .byte con_animation + $85
- D - I - 0x023757 11:B747: 67        .byte con_cloud + $67
- D - I - 0x023758 11:B748: FB        .byte con_rts




_scenario_B749_22:
- D - I - 0x023759 11:B749: B0        .byte con_pause + $B0
- D - I - 0x02375A 11:B74A: 38        .byte con_bg + $38
- D - I - 0x02375B 11:B74B: 85        .byte con_animation + $85
- D - I - 0x02375C 11:B74C: 69        .byte con_cloud + $69
- D - I - 0x02375D 11:B74D: FB        .byte con_rts



_scenario_B74E_2E:
- D - I - 0x02375E 11:B74E: F5        .byte con_mirror_off
- D - I - 0x02375F 11:B74F: 78        .byte con_pause + $78
- D - I - 0x023760 11:B750: 36        .byte con_bg + $36
- D - I - 0x023761 11:B751: 8B        .byte con_animation + $8B
- D - I - 0x023762 11:B752: 6D        .byte con_cloud + $6D
- D - I - 0x023763 11:B753: FB        .byte con_rts



_scenario_B754_3F:
- D - I - 0x023764 11:B754: FD        .byte con_mirror_condition, $00
- D - I - 0x023766 11:B756: FA        .byte con_jsr
- D - I - 0x023767 11:B757: 3E 9F     .word sub_9F3E
- D - I - 0x023769 11:B759: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02376B 11:B75B: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x02376D 11:B75D: 02        .byte bra_case_B75F_00 - *
- D - I - 0x02376E 11:B75E: 0E        .byte bra_case_B76C_01 - *

bra_case_B75F_00:
- D - I - 0x02376F 11:B75F: 5A        .byte con_pause + $5A
- D - I - 0x023770 11:B760: 69        .byte con_bg + $69
- D - I - 0x023771 11:B761: 8D        .byte con_animation + $8D
- D - I - 0x023772 11:B762: 10        .byte con_cloud + $10
loc_B763:
- D - I - 0x023773 11:B763: F3        .byte con_branch, $AC
- D - I - 0x023775 11:B765: 06        .byte bra_case_B76B_00 - *
- D - I - 0x023776 11:B766: 01        .byte bra_case_B767_01 - *

bra_case_B767_01:
- D - I - 0x023777 11:B767: 5A        .byte con_pause + $5A
- D - I - 0x023778 11:B768: F0        .byte con_bg + con_skip
- D - I - 0x023779 11:B769: F0        .byte con_animation + con_skip
- D - I - 0x02377A 11:B76A: 6D        .byte con_cloud + $6D
bra_case_B76B_00:
- D - I - 0x02377B 11:B76B: FB        .byte con_rts

bra_case_B76C_01:
- D - I - 0x02377C 11:B76C: 5A        .byte con_pause + $5A
- D - I - 0x02377D 11:B76D: 69        .byte con_bg + $69
- D - I - 0x02377E 11:B76E: 8D        .byte con_animation + $8D
- D - I - 0x02377F 11:B76F: 0A        .byte con_cloud + $0A
- D - I - 0x023780 11:B770: F2        .byte con_jmp
- D - I - 0x023781 11:B771: 63 B7     .word loc_B763



_scenario_B773_2F:
- D - I - 0x023783 11:B773: FD        .byte con_mirror_condition, $00
- D - I - 0x023785 11:B775: FA        .byte con_jsr
- D - I - 0x023786 11:B776: 3E 9F     .word sub_9F3E
- D - I - 0x023788 11:B778: FD        .byte con_mirror_condition, $03       ; куда летит мяч
- D - I - 0x02378A 11:B77A: F3        .byte con_branch, $84     ; мяч у атакующего/низкий, или высокий
- D - I - 0x02378C 11:B77C: 02        .byte bra_case_B77E_00 - *
- D - I - 0x02378D 11:B77D: 08        .byte bra_case_B785_01 - *

bra_case_B77E_00:
- D - I - 0x02378E 11:B77E: 5A        .byte con_pause + $5A
- D - I - 0x02378F 11:B77F: 36        .byte con_bg + $36
- D - I - 0x023790 11:B780: 8D        .byte con_animation + $8D
- D - I - 0x023791 11:B781: 10        .byte con_cloud + $10
- D - I - 0x023792 11:B782: F2        .byte con_jmp
- D - I - 0x023793 11:B783: 63 B7     .word loc_B763

bra_case_B785_01:
- D - I - 0x023795 11:B785: 5A        .byte con_pause + $5A
- D - I - 0x023796 11:B786: 36        .byte con_bg + $36
- D - I - 0x023797 11:B787: 8D        .byte con_animation + $8D
- D - I - 0x023798 11:B788: 0A        .byte con_cloud + $0A
- D - I - 0x023799 11:B789: F2        .byte con_jmp
- D - I - 0x02379A 11:B78A: 63 B7     .word loc_B763



_scenario_B78C_31:
- D - I - 0x02379C 11:B78C: F5        .byte con_mirror_off
- D - I - 0x02379D 11:B78D: 5A        .byte con_pause + $5A
- D - I - 0x02379E 11:B78E: 2C        .byte con_bg + $2C
- D - I - 0x02379F 11:B78F: 8B        .byte con_animation + $8B
- D - I - 0x0237A0 11:B790: 6F        .byte con_cloud + $6F
- D - I - 0x0237A1 11:B791: FB        .byte con_rts

bra_long_case_B792_01_кипер_ренато:
- D - I - 0x0237A2 11:B792: 0A        .byte con_pause + $0A
- D - I - 0x0237A3 11:B793: 32        .byte con_bg + $32
- D - I - 0x0237A4 11:B794: 93        .byte con_animation + $93
- D - I - 0x0237A5 11:B795: F0        .byte con_cloud + con_skip
bra_long_case_B796_00_кипер_без_рожи:
- D - I - 0x0237A6 11:B796: FB        .byte con_rts

bra_long_case_B797_02_кипер_морисаки:
- D - I - 0x0237A7 11:B797: 0A        .byte con_pause + $0A
- D - I - 0x0237A8 11:B798: 33        .byte con_bg + $33
- D - I - 0x0237A9 11:B799: 94        .byte con_animation + $94
- D - I - 0x0237AA 11:B79A: F0        .byte con_cloud + con_skip
- D - I - 0x0237AB 11:B79B: FB        .byte con_rts

bra_long_case_B79C_03_кипер_вакабаяши:
- D - I - 0x0237AC 11:B79C: 0A        .byte con_pause + $0A
- D - I - 0x0237AD 11:B79D: 32        .byte con_bg + $32
- D - I - 0x0237AE 11:B79E: A4        .byte con_animation + $A4
- D - I - 0x0237AF 11:B79F: F0        .byte con_cloud + con_skip
- D - I - 0x0237B0 11:B7A0: FB        .byte con_rts

bra_long_case_B7A1_04_кипер_вакашимазу:
- D - I - 0x0237B1 11:B7A1: 0A        .byte con_pause + $0A
- D - I - 0x0237B2 11:B7A2: 33        .byte con_bg + $33
- D - I - 0x0237B3 11:B7A3: A6        .byte con_animation + $A6
- D - I - 0x0237B4 11:B7A4: F0        .byte con_cloud + con_skip
- D - I - 0x0237B5 11:B7A5: FB        .byte con_rts



_scenario_B7BF_37:
- D - I - 0x0237CF 11:B7BF: F7        .byte con_F7, $1C
- D - I - 0x0237D1 11:B7C1: 07        .byte con_pause + $07
- D - I - 0x0237D2 11:B7C2: 46        .byte con_bg + $46
- D - I - 0x0237D3 11:B7C3: 00        .byte con_animation + $00
- D - I - 0x0237D4 11:B7C4: F0        .byte con_cloud + con_skip
- D - I - 0x0237D5 11:B7C5: FB        .byte con_rts



_scenario_B7C6_38:
- D - I - 0x0237D6 11:B7C6: F7        .byte con_F7, $17
- D - I - 0x0237D8 11:B7C8: 01        .byte con_pause + $01
- D - I - 0x0237D9 11:B7C9: 34        .byte con_bg + $34
- D - I - 0x0237DA 11:B7CA: 00        .byte con_animation + $00
- D - I - 0x0237DB 11:B7CB: F0        .byte con_cloud + con_skip
- D - I - 0x0237DC 11:B7CC: FB        .byte con_rts



_scenario_B7CD_35:
- D - I - 0x0237DD 11:B7CD: F9        .byte con_soundID_delay, $44, $EB
- D - I - 0x0237E0 11:B7D0: 02        .byte con_pause + $02
- D - I - 0x0237E1 11:B7D1: 3A        .byte con_bg + $3A
- D - I - 0x0237E2 11:B7D2: 8F        .byte con_animation + $8F
- D - I - 0x0237E3 11:B7D3: 73        .byte con_cloud + $73
- D - I - 0x0237E4 11:B7D4: FB        .byte con_rts



_scenario_B7D5_44:
- D - I - 0x0237E5 11:B7D5: 02        .byte con_pause + $02
- D - I - 0x0237E6 11:B7D6: 70        .byte con_bg + $70
- D - I - 0x0237E7 11:B7D7: 5C        .byte con_animation + $5C
- D - I - 0x0237E8 11:B7D8: F0        .byte con_cloud + con_skip
- D - I - 0x0237E9 11:B7D9: FB        .byte con_rts



_scenario_B7DA_1E:
- D - I - 0x0237EA 11:B7DA: FD        .byte con_mirror_condition, $02       ; команда
- D - I - 0x0237EC 11:B7DC: F6        .byte con_mirror_toggle
- D - I - 0x0237ED 11:B7DD: F7        .byte con_F7, $01
- D - I - 0x0237EF 11:B7DF: 07        .byte con_pause + $07
- D - I - 0x0237F0 11:B7E0: 45        .byte con_bg + $45
- D - I - 0x0237F1 11:B7E1: 90        .byte con_animation + $90
- D - I - 0x0237F2 11:B7E2: F0        .byte con_cloud + con_skip
- D - I - 0x0237F3 11:B7E3: FB        .byte con_rts



_scenario_B7E4_36:
- D - I - 0x0237F4 11:B7E4: F5        .byte con_mirror_off
- D - I - 0x0237F5 11:B7E5: F9        .byte con_soundID_delay, $7F, $02
- D - I - 0x0237F8 11:B7E8: 10        .byte con_pause + $10
- D - I - 0x0237F9 11:B7E9: 3A        .byte con_bg + $3A
- D - I - 0x0237FA 11:B7EA: 8F        .byte con_animation + $8F
- D - I - 0x0237FB 11:B7EB: F0        .byte con_cloud + con_skip
- D - I - 0x0237FC 11:B7EC: F9        .byte con_soundID_delay, $66, $02
- D - I - 0x0237FF 11:B7EF: 20        .byte con_pause + $20
- D - I - 0x023800 11:B7F0: F0        .byte con_bg + con_skip
- D - I - 0x023801 11:B7F1: F0        .byte con_animation + con_skip
- D - I - 0x023802 11:B7F2: 74        .byte con_cloud + $74
- D - I - 0x023803 11:B7F3: FD        .byte con_mirror_condition, $00
- D - I - 0x023805 11:B7F5: F9        .byte con_soundID_delay, $2B, $09
- D - I - 0x023808 11:B7F8: 32        .byte con_pause + $32
- D - I - 0x023809 11:B7F9: 72        .byte con_bg + $72
- D - I - 0x02380A 11:B7FA: 66        .byte con_animation + $66
- D - I - 0x02380B 11:B7FB: F0        .byte con_cloud + con_skip
- D - I - 0x02380C 11:B7FC: F7        .byte con_F7, $02
- D - I - 0x02380E 11:B7FE: 32        .byte con_pause + $32
- D - I - 0x02380F 11:B7FF: 1F        .byte con_bg + $1F
- D - I - 0x023810 11:B800: 4C        .byte con_animation + $4C
- D - I - 0x023811 11:B801: F0        .byte con_cloud + con_skip
- D - I - 0x023812 11:B802: F9        .byte con_soundID_delay, $2C, $1D
- D - I - 0x023815 11:B805: 3E        .byte con_pause + $3E
- D - I - 0x023816 11:B806: 01        .byte con_bg + $01
- D - I - 0x023817 11:B807: E6        .byte con_animation + $E6
- D - I - 0x023818 11:B808: 75        .byte con_cloud + $75
- D - I - 0x023819 11:B809: FB        .byte con_rts



_scenario_B80A_15:
- D - I - 0x02381A 11:B80A: 01        .byte con_pause + $01
- D - I - 0x02381B 11:B80B: 71        .byte con_bg + $71
- D - I - 0x02381C 11:B80C: 00        .byte con_animation + $00
- D - I - 0x02381D 11:B80D: 00        .byte con_cloud + con_clear
- D - I - 0x02381E 11:B80E: F7        .byte con_F7, $1F
- D - I - 0x023820 11:B810: 80        .byte con_pause + $80
- D - I - 0x023821 11:B811: 30        .byte con_bg + $30
- D - I - 0x023822 11:B812: AF        .byte con_animation + $AF
- D - I - 0x023823 11:B813: 76        .byte con_cloud + $76
- D - I - 0x023824 11:B814: F2        .byte con_jmp
- D - I - 0x023825 11:B815: C7 BB     .word loc_BBC7_очистка



_scenario_B817_16:
- D - I - 0x023827 11:B817: 01        .byte con_pause + $01
- D - I - 0x023828 11:B818: 71        .byte con_bg + $71
- D - I - 0x023829 11:B819: 00        .byte con_animation + $00
- D - I - 0x02382A 11:B81A: 00        .byte con_cloud + con_clear
- D - I - 0x02382B 11:B81B: 80        .byte con_pause + $80
- D - I - 0x02382C 11:B81C: 30        .byte con_bg + $30
- D - I - 0x02382D 11:B81D: B7        .byte con_animation + $B7
- D - I - 0x02382E 11:B81E: 77        .byte con_cloud + $77
- D - I - 0x02382F 11:B81F: F2        .byte con_jmp
- D - I - 0x023830 11:B820: C7 BB     .word loc_BBC7_очистка

loc_B822:
sub_B822:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x023836 11:B826: F5        .byte con_mirror_off
- D - I - 0x023837 11:B827: 8C        .byte con_pause + $8C
- D - I - 0x023838 11:B828: 32        .byte con_bg + $32
- D - I - 0x023839 11:B829: A8        .byte con_animation + $A8
- D - I - 0x02383A 11:B82A: 79        .byte con_cloud + $79
- D - I - 0x02383B 11:B82B: F2        .byte con_jmp
- D - I - 0x02383C 11:B82C: C7 BB     .word loc_BBC7_очистка

sub_B82E:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x023842 11:B832: F5        .byte con_mirror_off
- D - I - 0x023843 11:B833: 64        .byte con_pause + $64
- D - I - 0x023844 11:B834: 32        .byte con_bg + $32
- D - I - 0x023845 11:B835: A8        .byte con_animation + $A8
- D - I - 0x023846 11:B836: 7A        .byte con_cloud + $7A
- D - I - 0x023847 11:B837: F2        .byte con_jmp
- D - I - 0x023848 11:B838: C7 BB     .word loc_BBC7_очистка

loc_B83A:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x02384E 11:B83E: F6        .byte con_mirror_toggle
- D - I - 0x02384F 11:B83F: 5A        .byte con_pause + $5A
- D - I - 0x023850 11:B840: 30        .byte con_bg + $30
- D - I - 0x023851 11:B841: 91        .byte con_animation + $91
- D - I - 0x023852 11:B842: 7B        .byte con_cloud + $7B
- D - I - 0x023853 11:B843: FA        .byte con_jsr
- D - I - 0x023854 11:B844: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023856 11:B846: F6        .byte con_mirror_toggle
- D - I - 0x023857 11:B847: FB        .byte con_rts

sub_B848:
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x02385C 11:B84C: F6        .byte con_mirror_toggle
- D - I - 0x02385D 11:B84D: 5A        .byte con_pause + $5A
- D - I - 0x02385E 11:B84E: 30        .byte con_bg + $30
- D - I - 0x02385F 11:B84F: 91        .byte con_animation + $91
- D - I - 0x023860 11:B850: C3        .byte con_cloud + $C3
- D - I - 0x023861 11:B851: F9        .byte con_soundID_delay, $31, $02
- D - I - 0x023864 11:B854: FA        .byte con_jsr
- D - I - 0x023865 11:B855: C7 BB     .word sub_BBC7_очистка
- D - I - 0x023867 11:B857: F6        .byte con_mirror_toggle
- D - I - 0x023868 11:B858: FB        .byte con_rts

loc_B859_катсцена_озарения:
- D - I - 0x023869 11:B859: 28        .byte con_pause + $28
- D - I - 0x02386A 11:B85A: F0        .byte con_bg + con_skip
- D - I - 0x02386B 11:B85B: F0        .byte con_animation + con_skip
- D - I - 0x02386C 11:B85C: F0        .byte con_cloud + con_skip
- D - I - 0x02386D 11:B85D: F5        .byte con_mirror_off
- D - I - 0x02386E 11:B85E: F9        .byte con_soundID_delay, $46, $02
- D - I - 0x023871 11:B861: EF        .byte con_pause + $EF
- D - I - 0x023872 11:B862: 19        .byte con_bg + $19
- D - I - 0x023873 11:B863: E0        .byte con_animation + $E0
- D - I - 0x023874 11:B864: 00        .byte con_cloud + con_clear
- D - I - 0x023875 11:B865: B4        .byte con_pause + $B4
- D - I - 0x023876 11:B866: 4D        .byte con_bg + $4D
- D - I - 0x023877 11:B867: F0        .byte con_animation + con_skip
- D - I - 0x023878 11:B868: 7C        .byte con_cloud + $7C
- D - I - 0x023879 11:B869: B0        .byte con_pause + $B0
- D - I - 0x02387A 11:B86A: F0        .byte con_bg + con_skip
- D - I - 0x02387B 11:B86B: F0        .byte con_animation + con_skip
- D - I - 0x02387C 11:B86C: F0        .byte con_cloud + con_skip
- D - I - 0x02387D 11:B86D: C8        .byte con_pause + $C8
- D - I - 0x02387E 11:B86E: 3F        .byte con_bg + $3F
- D - I - 0x02387F 11:B86F: DE        .byte con_animation + $DE
- D - I - 0x023880 11:B870: 7D        .byte con_cloud + $7D
- D - I - 0x023881 11:B871: 83        .byte con_pause + $83
- D - I - 0x023882 11:B872: F0        .byte con_bg + con_skip
- D - I - 0x023883 11:B873: F0        .byte con_animation + con_skip
- D - I - 0x023884 11:B874: F0        .byte con_cloud + con_skip
- D - I - 0x023885 11:B875: 8C        .byte con_pause + $8C
- D - I - 0x023886 11:B876: F0        .byte con_bg + con_skip
- D - I - 0x023887 11:B877: F0        .byte con_animation + con_skip
- D - I - 0x023888 11:B878: F0        .byte con_cloud + con_skip
- D - I - 0x023889 11:B879: 9C        .byte con_pause + $9C
- D - I - 0x02388A 11:B87A: F0        .byte con_bg + con_skip
- D - I - 0x02388B 11:B87B: F0        .byte con_animation + con_skip
- D - I - 0x02388C 11:B87C: 7E        .byte con_cloud + $7E
- D - I - 0x02388D 11:B87D: 9C        .byte con_pause + $9C
- D - I - 0x02388E 11:B87E: F0        .byte con_bg + con_skip
- D - I - 0x02388F 11:B87F: F0        .byte con_animation + con_skip
- D - I - 0x023890 11:B880: F0        .byte con_cloud + con_skip
- D - I - 0x023891 11:B881: F9        .byte con_soundID_delay, $01, $02
- D - I - 0x023894 11:B884: F7        .byte con_F7, $06
- D - I - 0x023896 11:B886: 56        .byte con_pause + $56
- D - I - 0x023897 11:B887: F0        .byte con_bg + con_skip
- D - I - 0x023898 11:B888: F0        .byte con_animation + con_skip
- D - I - 0x023899 11:B889: 7F        .byte con_cloud + $7F
- D - I - 0x02389A 11:B88A: F9        .byte con_soundID_delay, $52, $02
- D - I - 0x02389D 11:B88D: F7        .byte con_F7, $1F
- D - I - 0x02389F 11:B88F: 90        .byte con_pause + $90
- D - I - 0x0238A0 11:B890: 30        .byte con_bg + $30
- D - I - 0x0238A1 11:B891: 91        .byte con_animation + $91
- D - I - 0x0238A2 11:B892: 80        .byte con_cloud + $80
- D - I - 0x0238A3 11:B893: F7        .byte con_F7, $1F
- D - I - 0x0238A5 11:B895: 90        .byte con_pause + $90
- D - I - 0x0238A6 11:B896: F0        .byte con_bg + con_skip
- D - I - 0x0238A7 11:B897: F0        .byte con_animation + con_skip
- D - I - 0x0238A8 11:B898: F0        .byte con_cloud + con_skip
- D - I - 0x0238A9 11:B899: F9        .byte con_soundID_delay, $7F, $02
                                      .byte con_jmp
                                      .word loc_BBC7_очистка



_scenario_B8A1_17:
- D - I - 0x0238B1 11:B8A1: 01        .byte con_pause + $01
- D - I - 0x0238B2 11:B8A2: 71        .byte con_bg + $71
- D - I - 0x0238B3 11:B8A3: 00        .byte con_animation + $00
- D - I - 0x0238B4 11:B8A4: 00        .byte con_cloud + con_clear
- D - I - 0x0238B5 11:B8A5: F4        .byte con_mirror_on
- D - I - 0x0238B6 11:B8A6: F7        .byte con_F7, $1F
- D - I - 0x0238B8 11:B8A8: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x0238BB 11:B8AB: 78        .byte con_pause + $78
- D - I - 0x0238BC 11:B8AC: 30        .byte con_bg + $30
- D - I - 0x0238BD 11:B8AD: 91        .byte con_animation + $91
- D - I - 0x0238BE 11:B8AE: 81        .byte con_cloud + $81
- D - I - 0x0238BF 11:B8AF: FA        .byte con_jsr
- D - I - 0x0238C0 11:B8B0: C7 BB     .word sub_BBC7_очистка
- D - I - 0x0238C2 11:B8B2: F9        .byte con_soundID_delay, $2B, $02
- D - I - 0x0238C5 11:B8B5: 28        .byte con_pause + $28
- D - I - 0x0238C6 11:B8B6: 01        .byte con_bg + $01
- D - I - 0x0238C7 11:B8B7: 66        .byte con_animation + $66
- D - I - 0x0238C8 11:B8B8: 82        .byte con_cloud + $82
- D - I - 0x0238C9 11:B8B9: 29        .byte con_pause + $29
- D - I - 0x0238CA 11:B8BA: 20        .byte con_bg + $20
- D - I - 0x0238CB 11:B8BB: 4C        .byte con_animation + $4C
- D - I - 0x0238CC 11:B8BC: F0        .byte con_cloud + con_skip
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x0238D1 11:B8C1: 5A        .byte con_pause + $5A
- D - I - 0x0238D2 11:B8C2: 30        .byte con_bg + $30
- D - I - 0x0238D3 11:B8C3: 91        .byte con_animation + $91
- D - I - 0x0238D4 11:B8C4: 83        .byte con_cloud + $83
- D - I - 0x0238D5 11:B8C5: F9        .byte con_soundID_delay, $25, $02
- D - I - 0x0238D8 11:B8C8: 28        .byte con_pause + $28
- D - I - 0x0238D9 11:B8C9: 20        .byte con_bg + $20
- D - I - 0x0238DA 11:B8CA: ED        .byte con_animation + $ED
- D - I - 0x0238DB 11:B8CB: 00        .byte con_cloud + con_clear
- D - I - 0x0238DC 11:B8CC: F6        .byte con_mirror_toggle
- D - I - 0x0238DD 11:B8CD: 3C        .byte con_pause + $3C
- D - I - 0x0238DE 11:B8CE: 32        .byte con_bg + $32
- D - I - 0x0238DF 11:B8CF: A8        .byte con_animation + $A8
- D - I - 0x0238E0 11:B8D0: 84        .byte con_cloud + $84
- D - I - 0x0238E1 11:B8D1: F6        .byte con_mirror_toggle
- D - I - 0x0238E2 11:B8D2: F9        .byte con_soundID_delay, $2B, $31
- D - I - 0x0238E5 11:B8D5: 38        .byte con_pause + $38
- D - I - 0x0238E6 11:B8D6: 47        .byte con_bg + $47
- D - I - 0x0238E7 11:B8D7: BF        .byte con_animation + $BF
- D - I - 0x0238E8 11:B8D8: 85        .byte con_cloud + $85
- D - I - 0x0238E9 11:B8D9: 25        .byte con_pause + $25
- D - I - 0x0238EA 11:B8DA: F0        .byte con_bg + con_skip
- D - I - 0x0238EB 11:B8DB: F0        .byte con_animation + con_skip
- D - I - 0x0238EC 11:B8DC: F0        .byte con_cloud + con_skip
- D - I - 0x0238ED 11:B8DD: F6        .byte con_mirror_toggle
- D - I - 0x0238EE 11:B8DE: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x0238F1 11:B8E1: 32        .byte con_pause + $32
- D - I - 0x0238F2 11:B8E2: 63        .byte con_bg + $63
- D - I - 0x0238F3 11:B8E3: 0F        .byte con_animation + $0F
- D - I - 0x0238F4 11:B8E4: 00        .byte con_cloud + con_clear
- D - I - 0x0238F5 11:B8E5: FC        .byte con_moving_bg, $04
- D - I - 0x0238F7 11:B8E7: 32        .byte con_pause + $32
- D - I - 0x0238F8 11:B8E8: 58        .byte con_bg + $58
- D - I - 0x0238F9 11:B8E9: 04        .byte con_animation + $04
- D - I - 0x0238FA 11:B8EA: 86        .byte con_cloud + $86
- D - I - 0x0238FB 11:B8EB: F7        .byte con_F7, $33
- D - I - 0x0238FD 11:B8ED: F9        .byte con_soundID_delay, $05, $02
- D - I - 0x023900 11:B8F0: 36        .byte con_pause + $36
- D - I - 0x023901 11:B8F1: 27        .byte con_bg + $27
- D - I - 0x023902 11:B8F2: 10        .byte con_animation + $10
- D - I - 0x023903 11:B8F3: F0        .byte con_cloud + con_skip
- D - I - 0x023904 11:B8F4: FA        .byte con_jsr
- D - I - 0x023905 11:B8F5: 19 B5     .word sub_B519
- D - I - 0x023907 11:B8F7: 64        .byte con_pause + $64
- D - I - 0x023908 11:B8F8: 32        .byte con_bg + $32
- D - I - 0x023909 11:B8F9: A8        .byte con_animation + $A8
- D - I - 0x02390A 11:B8FA: 8E        .byte con_cloud + $8E
- D - I - 0x02390B 11:B8FB: 10        .byte con_pause + $10
- D - I - 0x02390C 11:B8FC: 0E        .byte con_bg + $0E
- D - I - 0x02390D 11:B8FD: D3        .byte con_animation + $D3
- D - I - 0x02390E 11:B8FE: 00        .byte con_cloud + con_clear
- D - I - 0x02390F 11:B8FF: F7        .byte con_F7, $03
- D - I - 0x023911 11:B901: F9        .byte con_soundID_delay, $61, $02
- D - I - 0x023914 11:B904: 64        .byte con_pause + $64
- D - I - 0x023915 11:B905: 07        .byte con_bg + $07
- D - I - 0x023916 11:B906: 45        .byte con_animation + $45
- D - I - 0x023917 11:B907: 28        .byte con_cloud + $28
                                      .byte con_jsr
                                      .word sub_BBC7_очистка
- D - I - 0x02391C 11:B90C: 6E        .byte con_pause + $6E
- D - I - 0x02391D 11:B90D: 32        .byte con_bg + $32
- D - I - 0x02391E 11:B90E: A8        .byte con_animation + $A8
- D - I - 0x02391F 11:B90F: 87        .byte con_cloud + $87
- D - I - 0x023920 11:B910: F2        .byte con_jmp
- D - I - 0x023921 11:B911: C7 BB     .word loc_BBC7_очистка

bra_long_case_B913_01_tsubasa:
- D - I - 0x023923 11:B913: 3C        .byte con_pause + $3C
- D - I - 0x023924 11:B914: 30        .byte con_bg + $30
- D - I - 0x023925 11:B915: 91        .byte con_animation + $91
- D - I - 0x023926 11:B916: 8E        .byte con_cloud + $8E
loc_B917:
- D - I - 0x023927 11:B917: FA        .byte con_jsr
- D - I - 0x023928 11:B918: C7 BB     .word sub_BBC7_очистка
bra_long_case_B91A_00_игрок_без_рожи:
- D - I - 0x02392A 11:B91A: FB        .byte con_rts

bra_long_case_B91B_02_misaki:
- D - I - 0x02392B 11:B91B: 3C        .byte con_pause + $3C
- D - I - 0x02392C 11:B91C: 30        .byte con_bg + $30
- D - I - 0x02392D 11:B91D: 96        .byte con_animation + $96
- D - I - 0x02392E 11:B91E: 8E        .byte con_cloud + $8E
- D - I - 0x02392F 11:B91F: F2        .byte con_jmp
- D - I - 0x023930 11:B920: 17 B9     .word loc_B917

bra_long_case_B922_03_misaki:
- - - - - 0x023932 11:B922: 3C        .byte con_pause + $3C
- - - - - 0x023933 11:B923: 30        .byte con_bg + $30
- - - - - 0x023934 11:B924: 97        .byte con_animation + $97
- - - - - 0x023935 11:B925: 8E        .byte con_cloud + $8E
- - - - - 0x023936 11:B926: F2        .byte con_jmp
- - - - - 0x023937 11:B927: 17 B9     .word loc_B917

bra_long_case_B929_04_hyuga:
- D - I - 0x023939 11:B929: 3C        .byte con_pause + $3C
- D - I - 0x02393A 11:B92A: 31        .byte con_bg + $31
- D - I - 0x02393B 11:B92B: 9E        .byte con_animation + $9E
- D - I - 0x02393C 11:B92C: 8E        .byte con_cloud + $8E
- D - I - 0x02393D 11:B92D: F2        .byte con_jmp
- D - I - 0x02393E 11:B92E: 17 B9     .word loc_B917

bra_long_case_B930_05_hyuga:
- - - - - 0x023940 11:B930: 3C        .byte con_pause + $3C
- - - - - 0x023941 11:B931: 31        .byte con_bg + $31
- - - - - 0x023942 11:B932: B0        .byte con_animation + $B0
- - - - - 0x023943 11:B933: 8E        .byte con_cloud + $8E
- - - - - 0x023944 11:B934: F2        .byte con_jmp
- - - - - 0x023945 11:B935: 17 B9     .word loc_B917

bra_long_case_B937_06_misugi:
- D - I - 0x023947 11:B937: 3C        .byte con_pause + $3C
- D - I - 0x023948 11:B938: 30        .byte con_bg + $30
- D - I - 0x023949 11:B939: A3        .byte con_animation + $A3
- D - I - 0x02394A 11:B93A: 8E        .byte con_cloud + $8E
- D - I - 0x02394B 11:B93B: F2        .byte con_jmp
- D - I - 0x02394C 11:B93C: 17 B9     .word loc_B917

bra_long_case_B93E_07_misugi:
- - - - - 0x02394E 11:B93E: 3C        .byte con_pause + $3C
- - - - - 0x02394F 11:B93F: 30        .byte con_bg + $30
- - - - - 0x023950 11:B940: AE        .byte con_animation + $AE
- - - - - 0x023951 11:B941: 8E        .byte con_cloud + $8E
- - - - - 0x023952 11:B942: F2        .byte con_jmp
- - - - - 0x023953 11:B943: 17 B9     .word loc_B917

bra_long_case_B945_08_matsuyama:
- D - I - 0x023955 11:B945: 3C        .byte con_pause + $3C
- D - I - 0x023956 11:B946: 30        .byte con_bg + $30
- D - I - 0x023957 11:B947: A1        .byte con_animation + $A1
- D - I - 0x023958 11:B948: 8E        .byte con_cloud + $8E
- D - I - 0x023959 11:B949: F2        .byte con_jmp
- D - I - 0x02395A 11:B94A: 17 B9     .word loc_B917

bra_long_case_B94C_09_matsuyama:
- - - - - 0x02395C 11:B94C: 3C        .byte con_pause + $3C
- - - - - 0x02395D 11:B94D: 30        .byte con_bg + $30
- - - - - 0x02395E 11:B94E: AF        .byte con_animation + $AF
- - - - - 0x02395F 11:B94F: 8E        .byte con_cloud + $8E
- - - - - 0x023960 11:B950: F2        .byte con_jmp
- - - - - 0x023961 11:B951: 17 B9     .word loc_B917

bra_long_case_B953_0A_ishizaki:
- D - I - 0x023963 11:B953: 3C        .byte con_pause + $3C
- D - I - 0x023964 11:B954: 30        .byte con_bg + $30
- D - I - 0x023965 11:B955: 98        .byte con_animation + $98
- D - I - 0x023966 11:B956: 8F        .byte con_cloud + $8F
- D - I - 0x023967 11:B957: F2        .byte con_jmp
- D - I - 0x023968 11:B958: 17 B9     .word loc_B917

bra_long_case_B95A_0B_ishizaki:
- D - I - 0x02396A 11:B95A: 3C        .byte con_pause + $3C
- D - I - 0x02396B 11:B95B: 30        .byte con_bg + $30
- D - I - 0x02396C 11:B95C: 99        .byte con_animation + $99
- D - I - 0x02396D 11:B95D: 8F        .byte con_cloud + $8F
- D - I - 0x02396E 11:B95E: F2        .byte con_jmp
- D - I - 0x02396F 11:B95F: 17 B9     .word loc_B917

bra_long_case_B961_0C_souda:
- D - I - 0x023971 11:B961: 3C        .byte con_pause + $3C
- D - I - 0x023972 11:B962: 30        .byte con_bg + $30
- D - I - 0x023973 11:B963: 9F        .byte con_animation + $9F
- D - I - 0x023974 11:B964: 90        .byte con_cloud + $90
- D - I - 0x023975 11:B965: F2        .byte con_jmp
- D - I - 0x023976 11:B966: 17 B9     .word loc_B917

bra_long_case_B968_0D_souda:
- - - - - 0x023978 11:B968: 3C        .byte con_pause + $3C
- - - - - 0x023979 11:B969: 30        .byte con_bg + $30
- - - - - 0x02397A 11:B96A: AD        .byte con_animation + $AD
- - - - - 0x02397B 11:B96B: 90        .byte con_cloud + $90
- - - - - 0x02397C 11:B96C: F2        .byte con_jmp
- - - - - 0x02397D 11:B96D: 17 B9     .word loc_B917

bra_long_case_B96F_0E_jitou:
- D - I - 0x02397F 11:B96F: 3C        .byte con_pause + $3C
- D - I - 0x023980 11:B970: 30        .byte con_bg + $30
- D - I - 0x023981 11:B971: A0        .byte con_animation + $A0
- D - I - 0x023982 11:B972: 91        .byte con_cloud + $91
- D - I - 0x023983 11:B973: F2        .byte con_jmp
- D - I - 0x023984 11:B974: 17 B9     .word loc_B917

bra_long_case_B976_0F_jitou:
- D - I - 0x023986 11:B976: 3C        .byte con_pause + $3C
- D - I - 0x023987 11:B977: 30        .byte con_bg + $30
- D - I - 0x023988 11:B978: AA        .byte con_animation + $AA
- D - I - 0x023989 11:B979: 91        .byte con_cloud + $91
- D - I - 0x02398A 11:B97A: F2        .byte con_jmp
- D - I - 0x02398B 11:B97B: 17 B9     .word loc_B917

bra_long_case_B97D_10_masao_kazuo:
- D - I - 0x02398D 11:B97D: 3C        .byte con_pause + $3C
- D - I - 0x02398E 11:B97E: 30        .byte con_bg + $30
- D - I - 0x02398F 11:B97F: 9C        .byte con_animation + $9C
- D - I - 0x023990 11:B980: 92        .byte con_cloud + $92
- D - I - 0x023991 11:B981: F2        .byte con_jmp
- D - I - 0x023992 11:B982: 17 B9     .word loc_B917

bra_long_case_B984_11_masao_kazuo:
- D - I - 0x023994 11:B984: 3C        .byte con_pause + $3C
- D - I - 0x023995 11:B985: 30        .byte con_bg + $30
- D - I - 0x023996 11:B986: AB        .byte con_animation + $AB
- D - I - 0x023997 11:B987: 92        .byte con_cloud + $92
- D - I - 0x023998 11:B988: F2        .byte con_jmp
- D - I - 0x023999 11:B989: 17 B9     .word loc_B917

bra_long_case_B98B_12_nitta:
- - - - - 0x02399B 11:B98B: 3C        .byte con_pause + $3C
- - - - - 0x02399C 11:B98C: 30        .byte con_bg + $30
- - - - - 0x02399D 11:B98D: 9A        .byte con_animation + $9A
- - - - - 0x02399E 11:B98E: 93        .byte con_cloud + $93
- - - - - 0x02399F 11:B98F: F2        .byte con_jmp
- - - - - 0x0239A0 11:B990: 17 B9     .word loc_B917

bra_long_case_B992_13_nitta:
- - - - - 0x0239A2 11:B992: 3C        .byte con_pause + $3C
- - - - - 0x0239A3 11:B993: 30        .byte con_bg + $30
- - - - - 0x0239A4 11:B994: 9B        .byte con_animation + $9B
- - - - - 0x0239A5 11:B995: 93        .byte con_cloud + $93
- - - - - 0x0239A6 11:B996: F2        .byte con_jmp
- - - - - 0x0239A7 11:B997: 17 B9     .word loc_B917

bra_long_case_B999_14_sawada:
- - - - - 0x0239A9 11:B999: 3C        .byte con_pause + $3C
- - - - - 0x0239AA 11:B99A: 30        .byte con_bg + $30
- - - - - 0x0239AB 11:B99B: A2        .byte con_animation + $A2
- - - - - 0x0239AC 11:B99C: 8E        .byte con_cloud + $8E
- - - - - 0x0239AD 11:B99D: F2        .byte con_jmp
- - - - - 0x0239AE 11:B99E: 17 B9     .word loc_B917

bra_long_case_B9A0_15_sawada:
- - - - - 0x0239B0 11:B9A0: 3C        .byte con_pause + $3C
- - - - - 0x0239B1 11:B9A1: 30        .byte con_bg + $30
- - - - - 0x0239B2 11:B9A2: B1        .byte con_animation + $B1
- - - - - 0x0239B3 11:B9A3: 8E        .byte con_cloud + $8E
- - - - - 0x0239B4 11:B9A4: F2        .byte con_jmp
- - - - - 0x0239B5 11:B9A5: 17 B9     .word loc_B917

bra_long_case_B9A7_16_coimbra:
- - - - - 0x0239B7 11:B9A7: 3C        .byte con_pause + $3C
- - - - - 0x0239B8 11:B9A8: 30        .byte con_bg + $30
- - - - - 0x0239B9 11:B9A9: BC        .byte con_animation + $BC
- - - - - 0x0239BA 11:B9AA: 8E        .byte con_cloud + $8E
- - - - - 0x0239BB 11:B9AB: F2        .byte con_jmp
- - - - - 0x0239BC 11:B9AC: 17 B9     .word loc_B917

bra_long_case_B9AE_17_carlos:
- - - - - 0x0239BE 11:B9AE: 3C        .byte con_pause + $3C
- - - - - 0x0239BF 11:B9AF: 30        .byte con_bg + $30
- - - - - 0x0239C0 11:B9B0: A9        .byte con_animation + $A9
- - - - - 0x0239C1 11:B9B1: 8E        .byte con_cloud + $8E
- - - - - 0x0239C2 11:B9B2: F2        .byte con_jmp
- - - - - 0x0239C3 11:B9B3: 17 B9     .word loc_B917

bra_long_case_B9B5_18_carlos:
- D - I - 0x0239C5 11:B9B5: 3C        .byte con_pause + $3C
- D - I - 0x0239C6 11:B9B6: 30        .byte con_bg + $30
- D - I - 0x0239C7 11:B9B7: BB        .byte con_animation + $BB
- D - I - 0x0239C8 11:B9B8: 8E        .byte con_cloud + $8E
- D - I - 0x0239C9 11:B9B9: F2        .byte con_jmp
- D - I - 0x0239CA 11:B9BA: 17 B9     .word loc_B917

bra_long_case_B9BC_19_schneider:
- - - - - 0x0239CC 11:B9BC: 3C        .byte con_pause + $3C
- - - - - 0x0239CD 11:B9BD: 30        .byte con_bg + $30
- - - - - 0x0239CE 11:B9BE: B8        .byte con_animation + $B8
- - - - - 0x0239CF 11:B9BF: 8E        .byte con_cloud + $8E
- - - - - 0x0239D0 11:B9C0: F2        .byte con_jmp
- - - - - 0x0239D1 11:B9C1: 17 B9     .word loc_B917

bra_long_case_B9C3_1A_kaltz:
- D - I - 0x0239D3 11:B9C3: 40        .byte con_pause + $40
- D - I - 0x0239D4 11:B9C4: 30        .byte con_bg + $30
- D - I - 0x0239D5 11:B9C5: B3        .byte con_animation + $B3
- D - I - 0x0239D6 11:B9C6: 94        .byte con_cloud + $94
- D - I - 0x0239D7 11:B9C7: F2        .byte con_jmp
- D - I - 0x0239D8 11:B9C8: 17 B9     .word loc_B917

bra_long_case_B9CA_1B_schester:
- D - I - 0x0239DA 11:B9CA: 3C        .byte con_pause + $3C
- D - I - 0x0239DB 11:B9CB: 30        .byte con_bg + $30
- D - I - 0x0239DC 11:B9CC: BA        .byte con_animation + $BA
- D - I - 0x0239DD 11:B9CD: 8E        .byte con_cloud + $8E
- D - I - 0x0239DE 11:B9CE: F2        .byte con_jmp
- D - I - 0x0239DF 11:B9CF: 17 B9     .word loc_B917

bra_long_case_B9D1_1C_diaz:
- D - I - 0x0239E1 11:B9D1: 3C        .byte con_pause + $3C
- D - I - 0x0239E2 11:B9D2: 30        .byte con_bg + $30
- D - I - 0x0239E3 11:B9D3: B7        .byte con_animation + $B7
- D - I - 0x0239E4 11:B9D4: 8E        .byte con_cloud + $8E
- D - I - 0x0239E5 11:B9D5: F2        .byte con_jmp
- D - I - 0x0239E6 11:B9D6: 17 B9     .word loc_B917

bra_long_case_B9D8_1D_pascal:
- - - - - 0x0239E8 11:B9D8: 3C        .byte con_pause + $3C
- - - - - 0x0239E9 11:B9D9: 30        .byte con_bg + $30
- - - - - 0x0239EA 11:B9DA: B6        .byte con_animation + $B6
- - - - - 0x0239EB 11:B9DB: 8E        .byte con_cloud + $8E
- - - - - 0x0239EC 11:B9DC: F2        .byte con_jmp
- - - - - 0x0239ED 11:B9DD: 17 B9     .word loc_B917

bra_long_case_B9DF_1E_pierre:
- - - - - 0x0239EF 11:B9DF: 3C        .byte con_pause + $3C
- - - - - 0x0239F0 11:B9E0: 30        .byte con_bg + $30
- - - - - 0x0239F1 11:B9E1: B5        .byte con_animation + $B5
- - - - - 0x0239F2 11:B9E2: 8E        .byte con_cloud + $8E
- - - - - 0x0239F3 11:B9E3: F2        .byte con_jmp
- - - - - 0x0239F4 11:B9E4: 17 B9     .word loc_B917

bra_long_case_B9E6_1F_napoleon:
- D - I - 0x0239F6 11:B9E6: 3C        .byte con_pause + $3C
- D - I - 0x0239F7 11:B9E7: 30        .byte con_bg + $30
- D - I - 0x0239F8 11:B9E8: B4        .byte con_animation + $B4
- D - I - 0x0239F9 11:B9E9: 95        .byte con_cloud + $95
- D - I - 0x0239FA 11:B9EA: F2        .byte con_jmp
- D - I - 0x0239FB 11:B9EB: 17 B9     .word loc_B917

bra_long_case_B9ED_20_victorino:
- - - - - 0x0239FD 11:B9ED: 3C        .byte con_pause + $3C
- - - - - 0x0239FE 11:B9EE: 30        .byte con_bg + $30
- - - - - 0x0239FF 11:B9EF: B2        .byte con_animation + $B2
- - - - - 0x023A00 11:B9F0: 8E        .byte con_cloud + $8E
- - - - - 0x023A01 11:B9F1: F2        .byte con_jmp
- - - - - 0x023A02 11:B9F2: 17 B9     .word loc_B917

bra_long_case_B9F4_21_kaltz:
- D - I - 0x023A04 11:B9F4: 40        .byte con_pause + $40
- D - I - 0x023A05 11:B9F5: 30        .byte con_bg + $30
- D - I - 0x023A06 11:B9F6: B9        .byte con_animation + $B9
- D - I - 0x023A07 11:B9F7: 94        .byte con_cloud + $94
- D - I - 0x023A08 11:B9F8: F2        .byte con_jmp
- D - I - 0x023A09 11:B9F9: 17 B9     .word loc_B917

ofs_B9FB_01:
- D - I - 0x023A0B 11:B9FB: 01        .byte con_pause + $01
- D - I - 0x023A0C 11:B9FC: 71        .byte con_bg + $71
- D - I - 0x023A0D 11:B9FD: 00        .byte con_animation + $00
- D - I - 0x023A0E 11:B9FE: 00        .byte con_cloud + con_clear
- D - I - 0x023A0F 11:B9FF: F7        .byte con_F7, $1F
- D - I - 0x023A11 11:BA01: F9        .byte con_soundID_delay, $30, $02
- D - I - 0x023A14 11:BA04: A0        .byte con_pause + $A0
- D - I - 0x023A15 11:BA05: 30        .byte con_bg + $30
- D - I - 0x023A16 11:BA06: 91        .byte con_animation + $91
- D - I - 0x023A17 11:BA07: 96        .byte con_cloud + $96
- D - I - 0x023A18 11:BA08: F7        .byte con_F7, $1F
- D - I - 0x023A1A 11:BA0A: 80        .byte con_pause + $80
- D - I - 0x023A1B 11:BA0B: F0        .byte con_bg + con_skip
- D - I - 0x023A1C 11:BA0C: F0        .byte con_animation + con_skip
- D - I - 0x023A1D 11:BA0D: F0        .byte con_cloud + con_skip
- D - I - 0x023A1E 11:BA0E: FA        .byte con_jsr
- D - I - 0x023A1F 11:BA0F: C7 BB     .word sub_BBC7_очистка
ofs_BA11_00:
- D - I - 0x023A21 11:BA11: FB        .byte con_rts

bra_long_case_BA1C_01:
- D - I - 0x023A2C 11:BA1C: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x023A2F 11:BA1F: 4A        .byte con_pause + $4A
- D - I - 0x023A30 11:BA20: 63        .byte con_bg + $63
- D - I - 0x023A31 11:BA21: 6D        .byte con_animation + $6D
- D - I - 0x023A32 11:BA22: 14        .byte con_cloud + $14
- D - I - 0x023A33 11:BA23: FB        .byte con_rts

bra_long_case_BA24_00:
- D - I - 0x023A34 11:BA24: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x023A37 11:BA27: 46        .byte con_pause + $46
- D - I - 0x023A38 11:BA28: 01        .byte con_bg + $01
- D - I - 0x023A39 11:BA29: 6C        .byte con_animation + $6C
- D - I - 0x023A3A 11:BA2A: 14        .byte con_cloud + $14
- D - I - 0x023A3B 11:BA2B: FB        .byte con_rts

sub_BA2C:
- D - I - 0x023A3C 11:BA2C: F5        .byte con_mirror_off
- D - I - 0x023A3D 11:BA2D: 28        .byte con_pause + $28
- D - I - 0x023A3E 11:BA2E: 12        .byte con_bg + $12
- D - I - 0x023A3F 11:BA2F: 61        .byte con_animation + $61
- D - I - 0x023A40 11:BA30: 72        .byte con_cloud + $72
- D - I - 0x023A41 11:BA31: F7        .byte con_F7, $0B
- D - I - 0x023A43 11:BA33: F9        .byte con_soundID_delay, $12, $02
- D - I - 0x023A46 11:BA36: 10        .byte con_pause + $10
- D - I - 0x023A47 11:BA37: 10        .byte con_bg + $10
- D - I - 0x023A48 11:BA38: 62        .byte con_animation + $62
- D - I - 0x023A49 11:BA39: F0        .byte con_cloud + con_skip
- D - I - 0x023A4A 11:BA3A: FB        .byte con_rts



_scenario_BA3B_21:
- D - I - 0x023A4B 11:BA3B: FA        .byte con_jsr
- D - I - 0x023A4C 11:BA3C: 2C BA     .word sub_BA2C
- D - I - 0x023A4E 11:BA3E: F3        .byte con_branch, $A2     ; у чьей команды мяч
- D - I - 0x023A50 11:BA40: 02        .byte bra_case_BA42_00_мяч_у_команды_слева - *
- D - I - 0x023A51 11:BA41: 0A        .byte bra_case_BA4B_01_мяч_у_команды_справа - *

bra_case_BA42_00_мяч_у_команды_слева:
- D - I - 0x023A52 11:BA42: 0A        .byte con_pause + $0A
- D - I - 0x023A53 11:BA43: 38        .byte con_bg + $38
- D - I - 0x023A54 11:BA44: 00        .byte con_animation + $00
- D - I - 0x023A55 11:BA45: F0        .byte con_cloud + con_skip
- D - I - 0x023A56 11:BA46: FE        .byte con_FE
- D - I - 0x023A58 11:BA48: F2        .byte con_jmp
- D - I - 0x023A59 11:BA49: 54 BA     .word loc_BA54

bra_case_BA4B_01_мяч_у_команды_справа:
- D - I - 0x023A5B 11:BA4B: 0A        .byte con_pause + $0A
- D - I - 0x023A5C 11:BA4C: 37        .byte con_bg + $37
- D - I - 0x023A5D 11:BA4D: 00        .byte con_animation + $00
- D - I - 0x023A5E 11:BA4E: F0        .byte con_cloud + con_skip
- D - I - 0x023A5F 11:BA4F: FE        .byte con_FE
; bzk бесполезный прыжок
- D - I - 0x023A61 11:BA51: F2        .byte con_jmp
- D - I - 0x023A62 11:BA52: 54 BA     .word loc_BA54

loc_BA54:
- D - I - 0x023A64 11:BA54: F3        .byte con_branch, $BE
- D - I - 0x023A66 11:BA56: C3        .byte bra_case_BB19_00 - *
- D - I - 0x023A67 11:BA57: CC        .byte bra_case_BB23_01 - *
- D - I - 0x023A68 11:BA58: B9        .byte bra_case_BB11_02 - *
- D - I - 0x023A69 11:BA59: DC        .byte bra_case_BB35_03 - *
- D - I - 0x023A6A 11:BA5A: 13        .byte bra_case_BA6D_04 - *
- D - I - 0x023A6B 11:BA5B: D2        .byte bra_case_BB2D_05 - *
- D - I - 0x023A6C 11:BA5C: A5        .byte bra_case_BB01_06 - *
- D - I - 0x023A6D 11:BA5D: AD        .byte bra_case_BB0A_07 - *
- D - I - 0x023A6E 11:BA5E: 01        .byte bra_case_BA5F_08 - *

bra_case_BA5F_08:
- D - I - 0x023A6F 11:BA5F: 32        .byte con_pause + $32
- D - I - 0x023A70 11:BA60: F0        .byte con_bg + con_skip
- D - I - 0x023A71 11:BA61: 86        .byte con_animation + $86
- D - I - 0x023A72 11:BA62: F0        .byte con_cloud + con_skip
loc_BA63:
- D - I - 0x023A73 11:BA63: F3        .byte con_branch, $8F
- - - - - 0x023A75 11:BA65: 11        .byte bra_case_BA76_00 - *
- D - I - 0x023A76 11:BA66: 34        .byte bra_case_BA9A_01 - *
- - - - - 0x023A77 11:BA67: 6E        .byte bra_case_BAD5_02 - *

loc_BA68:
- D - I - 0x023A78 11:BA68: F3        .byte con_branch, $8F
- D - I - 0x023A7A 11:BA6A: 15        .byte bra_case_BA7F_00 - *
- - - - - 0x023A7B 11:BA6B: 2F        .byte bra_case_BA9A_01 - *
- D - I - 0x023A7C 11:BA6C: 72        .byte bra_case_BADE_02 - *

bra_case_BA6D_04:
- D - I - 0x023A7D 11:BA6D: 32        .byte con_pause + $32
- D - I - 0x023A7E 11:BA6E: F0        .byte con_bg + con_skip
- D - I - 0x023A7F 11:BA6F: 8A        .byte con_animation + $8A
- D - I - 0x023A80 11:BA70: F0        .byte con_cloud + con_skip
- D - I - 0x023A81 11:BA71: F3        .byte con_branch, $8F
- - - - - 0x023A83 11:BA73: 84        .byte bra_case_BAF7_00 - *
- D - I - 0x023A84 11:BA74: 49        .byte bra_case_BABD_01 - *
- - - - - 0x023A85 11:BA75: 60        .byte bra_case_BAD5_02 - *

bra_case_BA76_00:
- - - - - 0x023A86 11:BA76: F3        .byte con_branch, $A0
- - - - - 0x023A88 11:BA78: 03        .byte bra_case_BA7B_00 - *
- - - - - 0x023A89 11:BA79: 19        .byte bra_case_BA92_01 - *
- - - - - 0x023A8A 11:BA7A: 18        .byte bra_case_BA92_02 - *

bra_case_BA7B_00:
- - - - - 0x023A8B 11:BA7B: 28        .byte con_pause + $28
- - - - - 0x023A8C 11:BA7C: 0E        .byte con_bg + $0E
- - - - - 0x023A8D 11:BA7D: 25        .byte con_animation + $25
- - - - - 0x023A8E 11:BA7E: F0        .byte con_cloud + con_skip
loc_BA7F:
bra_case_BA7F_00:
- D - I - 0x023A8F 11:BA7F: F7        .byte con_F7, $03
- D - I - 0x023A91 11:BA81: F9        .byte con_soundID_delay, $5D, $02
- D - I - 0x023A94 11:BA84: F3        .byte con_branch, $A1     ; порвана ли сетка
- D - I - 0x023A96 11:BA86: 02        .byte bra_case_BA88_00_сетка_не_порвана - *
- - - - - 0x023A97 11:BA87: 06        .byte bra_case_BA8D_01_сетка_порвана - *

bra_case_BA88_00_сетка_не_порвана:
- D - I - 0x023A98 11:BA88: 64        .byte con_pause + $64
- D - I - 0x023A99 11:BA89: 07        .byte con_bg + $07
- D - I - 0x023A9A 11:BA8A: 44        .byte con_animation + $44
- D - I - 0x023A9B 11:BA8B: 28        .byte con_cloud + $28
- D - I - 0x023A9C 11:BA8C: FB        .byte con_rts

bra_case_BA8D_01_сетка_порвана:
- - - - - 0x023A9D 11:BA8D: 64        .byte con_pause + $64
- - - - - 0x023A9E 11:BA8E: 07        .byte con_bg + $07
- - - - - 0x023A9F 11:BA8F: 45        .byte con_animation + $45
- - - - - 0x023AA0 11:BA90: 28        .byte con_cloud + $28
- - - - - 0x023AA1 11:BA91: FB        .byte con_rts

bra_case_BA92_01:
bra_case_BA92_02:
- - - - - 0x023AA2 11:BA92: 28        .byte con_pause + $28
- - - - - 0x023AA3 11:BA93: 0F        .byte con_bg + $0F
- - - - - 0x023AA4 11:BA94: 26        .byte con_animation + $26
- - - - - 0x023AA5 11:BA95: F0        .byte con_cloud + con_skip
- - - - - 0x023AA6 11:BA96: F2        .byte con_jmp
- - - - - 0x023AA7 11:BA97: 7F BA     .word loc_BA7F

bra_case_BA9A_01:
- D - I - 0x023AAA 11:BA9A: F3        .byte con_branch, $A0
- D - I - 0x023AAC 11:BA9C: 03        .byte bra_case_BA9F_00 - *
- - - - - 0x023AAD 11:BA9D: 11        .byte bra_case_BAAE_01 - *
- - - - - 0x023AAE 11:BA9E: 10        .byte bra_case_BAAE_02 - *

bra_case_BA9F_00:
- D - I - 0x023AAF 11:BA9F: F9        .byte con_soundID_delay, $2B, $21
- D - I - 0x023AB2 11:BAA2: 3C        .byte con_pause + $3C
- D - I - 0x023AB3 11:BAA3: 0E        .byte con_bg + $0E
- D - I - 0x023AB4 11:BAA4: 27        .byte con_animation + $27
- D - I - 0x023AB5 11:BAA5: DD        .byte con_cloud + $DD
- D - I - 0x023AB6 11:BAA6: F9        .byte con_soundID_delay, $7E, $02
                                      .byte con_jmp
                                      .word loc_BBC7_очистка

bra_case_BAAE_01:
bra_case_BAAE_02:
- - - - - 0x023ABE 11:BAAE: F9        .byte con_soundID_delay, $2B, $21
- - - - - 0x023AC1 11:BAB1: 3C        .byte con_pause + $3C
- - - - - 0x023AC2 11:BAB2: 0F        .byte con_bg + $0F
- - - - - 0x023AC3 11:BAB3: 2B        .byte con_animation + $2B
- - - - - 0x023AC4 11:BAB4: DD        .byte con_cloud + $DD
- - - - - 0x023AC5 11:BAB5: F9        .byte con_soundID_delay, $7E, $02
                                      .byte con_jmp
                                      .word loc_BBC7_очистка

bra_case_BABD_01:
- D - I - 0x023ACD 11:BABD: F7        .byte con_F7, $07
- D - I - 0x023ACF 11:BABF: F9        .byte con_soundID_delay, $2A, $21
- D - I - 0x023AD2 11:BAC2: 20        .byte con_pause + $20
- D - I - 0x023AD3 11:BAC3: 40        .byte con_bg + $40
- D - I - 0x023AD4 11:BAC4: 17        .byte con_animation + $17
- D - I - 0x023AD5 11:BAC5: DD        .byte con_cloud + $DD
- D - I - 0x023AD6 11:BAC6: F7        .byte con_F7, $10
- D - I - 0x023AD8 11:BAC8: 10        .byte con_pause + $10
- D - I - 0x023AD9 11:BAC9: 05        .byte con_bg + $05
- D - I - 0x023ADA 11:BACA: 00        .byte con_animation + $00
- D - I - 0x023ADB 11:BACB: F0        .byte con_cloud + con_skip
- D - I - 0x023ADC 11:BACC: F6        .byte con_mirror_toggle
- D - I - 0x023ADD 11:BACD: F9        .byte con_soundID_delay, $7E, $02
- D - I - 0x023AE0 11:BAD0: 3C        .byte con_pause + $3C
- D - I - 0x023AE1 11:BAD1: 20        .byte con_bg + $20
- D - I - 0x023AE2 11:BAD2: 52        .byte con_animation + $52
- D - I - 0x023AE3 11:BAD3: F0        .byte con_cloud + con_skip
- D - I - 0x023AE4 11:BAD4: FB        .byte con_rts

bra_case_BAD5_02:
- - - - - 0x023AE5 11:BAD5: F3        .byte con_branch, $A0
- - - - - 0x023AE7 11:BAD7: 03        .byte bra_case_BADA_00 - *
- - - - - 0x023AE8 11:BAD8: 17        .byte bra_case_BAEF_01 - *
- - - - - 0x023AE9 11:BAD9: 16        .byte bra_case_BAEF_02 - *

bra_case_BADA_00:
- - - - - 0x023AEA 11:BADA: 28        .byte con_pause + $28
- - - - - 0x023AEB 11:BADB: 0E        .byte con_bg + $0E
- - - - - 0x023AEC 11:BADC: 25        .byte con_animation + $25
- - - - - 0x023AED 11:BADD: F0        .byte con_cloud + con_skip
loc_BADE_штанга_при_ударе_11м:
bra_case_BADE_02:
- D - I - 0x023AEE 11:BADE: F7        .byte con_F7, $1F
- D - I - 0x023AF0 11:BAE0: F9        .byte con_soundID_delay, $63, $02
- D - I - 0x023AF3 11:BAE3: 10        .byte con_pause + $10
- D - I - 0x023AF4 11:BAE4: 06        .byte con_bg + $06
- D - I - 0x023AF5 11:BAE5: 43        .byte con_animation + $43
- D - I - 0x023AF6 11:BAE6: 18        .byte con_cloud + $18
- D - I - 0x023AF7 11:BAE7: F9        .byte con_soundID_delay, $7E, $02
- D - I - 0x023AFA 11:BAEA: 3C        .byte con_pause + $3C
- D - I - 0x023AFB 11:BAEB: 1E        .byte con_bg + $1E
- D - I - 0x023AFC 11:BAEC: 42        .byte con_animation + $42
- D - I - 0x023AFD 11:BAED: F0        .byte con_cloud + con_skip
- D - I - 0x023AFE 11:BAEE: FB        .byte con_rts

bra_case_BAEF_01:
bra_case_BAEF_02:
- - - - - 0x023AFF 11:BAEF: 28        .byte con_pause + $28
- - - - - 0x023B00 11:BAF0: 0F        .byte con_bg + $0F
- - - - - 0x023B01 11:BAF1: 26        .byte con_animation + $26
- - - - - 0x023B02 11:BAF2: F0        .byte con_cloud + con_skip
- - - - - 0x023B03 11:BAF3: F2        .byte con_jmp
- - - - - 0x023B04 11:BAF4: DE BA     .word loc_BADE_штанга_при_ударе_11м

bra_case_BAF7_00:
- - - - - 0x023B07 11:BAF7: F7        .byte con_F7, $07
- - - - - 0x023B09 11:BAF9: 2A        .byte con_pause + $2A
- - - - - 0x023B0A 11:BAFA: 40        .byte con_bg + $40
- - - - - 0x023B0B 11:BAFB: 59        .byte con_animation + $59
- - - - - 0x023B0C 11:BAFC: F0        .byte con_cloud + con_skip
- - - - - 0x023B0D 11:BAFD: F2        .byte con_jmp
- - - - - 0x023B0E 11:BAFE: 7F BA     .word loc_BA7F

bra_case_BB01_06:
- D - I - 0x023B11 11:BB01: F6        .byte con_mirror_toggle
- D - I - 0x023B12 11:BB02: 32        .byte con_pause + $32
- D - I - 0x023B13 11:BB03: F0        .byte con_bg + con_skip
- D - I - 0x023B14 11:BB04: 87        .byte con_animation + $87
- D - I - 0x023B15 11:BB05: F0        .byte con_cloud + con_skip
- D - I - 0x023B16 11:BB06: F6        .byte con_mirror_toggle
- D - I - 0x023B17 11:BB07: F2        .byte con_jmp
- D - I - 0x023B18 11:BB08: 68 BA     .word loc_BA68

bra_case_BB0A_07:
- D - I - 0x023B1A 11:BB0A: 32        .byte con_pause + $32
- D - I - 0x023B1B 11:BB0B: F0        .byte con_bg + con_skip
- D - I - 0x023B1C 11:BB0C: 89        .byte con_animation + $89
- D - I - 0x023B1D 11:BB0D: F0        .byte con_cloud + con_skip
- D - I - 0x023B1E 11:BB0E: F2        .byte con_jmp
- D - I - 0x023B1F 11:BB0F: 68 BA     .word loc_BA68

bra_case_BB11_02:
- D - I - 0x023B21 11:BB11: 32        .byte con_pause + $32
- D - I - 0x023B22 11:BB12: F0        .byte con_bg + con_skip
- D - I - 0x023B23 11:BB13: 87        .byte con_animation + $87
- D - I - 0x023B24 11:BB14: F0        .byte con_cloud + con_skip
- D - I - 0x023B25 11:BB15: F4        .byte con_mirror_on
- D - I - 0x023B26 11:BB16: F2        .byte con_jmp
- D - I - 0x023B27 11:BB17: 68 BA     .word loc_BA68

bra_case_BB19_00:
- D - I - 0x023B29 11:BB19: F6        .byte con_mirror_toggle
- D - I - 0x023B2A 11:BB1A: 32        .byte con_pause + $32
- D - I - 0x023B2B 11:BB1B: F0        .byte con_bg + con_skip
- D - I - 0x023B2C 11:BB1C: 86        .byte con_animation + $86
- D - I - 0x023B2D 11:BB1D: F0        .byte con_cloud + con_skip
- D - I - 0x023B2E 11:BB1E: F6        .byte con_mirror_toggle
- D - I - 0x023B2F 11:BB1F: F4        .byte con_mirror_on
- D - I - 0x023B30 11:BB20: F2        .byte con_jmp
- D - I - 0x023B31 11:BB21: 63 BA     .word loc_BA63

bra_case_BB23_01:
- D - I - 0x023B33 11:BB23: F6        .byte con_mirror_toggle
- D - I - 0x023B34 11:BB24: 32        .byte con_pause + $32
- D - I - 0x023B35 11:BB25: F0        .byte con_bg + con_skip
- D - I - 0x023B36 11:BB26: 89        .byte con_animation + $89
- D - I - 0x023B37 11:BB27: F0        .byte con_cloud + con_skip
- D - I - 0x023B38 11:BB28: F6        .byte con_mirror_toggle
- D - I - 0x023B39 11:BB29: F4        .byte con_mirror_on
- D - I - 0x023B3A 11:BB2A: F2        .byte con_jmp
- D - I - 0x023B3B 11:BB2B: 68 BA     .word loc_BA68

bra_case_BB2D_05:
- D - I - 0x023B3D 11:BB2D: 32        .byte con_pause + $32
- D - I - 0x023B3E 11:BB2E: F0        .byte con_bg + con_skip
- D - I - 0x023B3F 11:BB2F: 88        .byte con_animation + $88
- D - I - 0x023B40 11:BB30: F0        .byte con_cloud + con_skip
- D - I - 0x023B41 11:BB31: F4        .byte con_mirror_on
- D - I - 0x023B42 11:BB32: F2        .byte con_jmp
- D - I - 0x023B43 11:BB33: 68 BA     .word loc_BA68

bra_case_BB35_03:
- D - I - 0x023B45 11:BB35: F6        .byte con_mirror_toggle
- D - I - 0x023B46 11:BB36: 32        .byte con_pause + $32
- D - I - 0x023B47 11:BB37: F0        .byte con_bg + con_skip
- D - I - 0x023B48 11:BB38: 88        .byte con_animation + $88
- D - I - 0x023B49 11:BB39: F0        .byte con_cloud + con_skip
- D - I - 0x023B4A 11:BB3A: F6        .byte con_mirror_toggle
- D - I - 0x023B4B 11:BB3B: F4        .byte con_mirror_on
- D - I - 0x023B4C 11:BB3C: F2        .byte con_jmp
- D - I - 0x023B4D 11:BB3D: 68 BA     .word loc_BA68



_scenario_BB3F_23:
- D - I - 0x023B4F 11:BB3F: FA        .byte con_jsr
- D - I - 0x023B50 11:BB40: 2C BA     .word sub_BA2C
- D - I - 0x023B52 11:BB42: 0A        .byte con_pause + $0A
- D - I - 0x023B53 11:BB43: 38        .byte con_bg + $38
- D - I - 0x023B54 11:BB44: 00        .byte con_animation + $00
- D - I - 0x023B55 11:BB45: F0        .byte con_cloud + con_skip
- D - I - 0x023B56 11:BB46: FE        .byte con_FE
- D - I - 0x023B58 11:BB48: F2        .byte con_jmp
- D - I - 0x023B59 11:BB49: 54 BA     .word loc_BA54

bra_long_case_BB4B_00:
bra_long_case_BB4B_01:
bra_long_case_BB4B_02:
bra_long_case_BB4B_03:
bra_long_case_BB4B_04:
sub_BB4B:
- D - I - 0x023B5B 11:BB4B: 30        .byte con_pause + $30
- D - I - 0x023B5C 11:BB4C: 1F        .byte con_bg + $1F
- D - I - 0x023B5D 11:BB4D: 4C        .byte con_animation + $4C
- D - I - 0x023B5E 11:BB4E: 00        .byte con_cloud + con_clear
- D - I - 0x023B5F 11:BB4F: FB        .byte con_rts

bra_long_case_BB50_03:
- D - I - 0x023B60 11:BB50: F6        .byte con_mirror_toggle
- D - I - 0x023B61 11:BB51: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x023B64 11:BB54: 3C        .byte con_pause + $3C
- D - I - 0x023B65 11:BB55: 53        .byte con_bg + $53
- D - I - 0x023B66 11:BB56: 1D        .byte con_animation + $1D
- D - I - 0x023B67 11:BB57: 00        .byte con_cloud + con_clear
- D - I - 0x023B68 11:BB58: F6        .byte con_mirror_toggle
- D - I - 0x023B69 11:BB59: FA        .byte con_jsr
- D - I - 0x023B6A 11:BB5A: 7D BB     .word sub_BB7D
- D - I - 0x023B6C 11:BB5C: FB        .byte con_rts

sub_BB5D:
- D - I - 0x023B6D 11:BB5D: F9        .byte con_soundID_delay, $05, $02
- D - I - 0x023B70 11:BB60: 32        .byte con_pause + $32
- D - I - 0x023B71 11:BB61: 13        .byte con_bg + $13
- D - I - 0x023B72 11:BB62: 0E        .byte con_animation + $0E
- D - I - 0x023B73 11:BB63: 00        .byte con_cloud + con_clear
- D - I - 0x023B74 11:BB64: FB        .byte con_rts

sub_BB65:
- D - I - 0x023B75 11:BB65: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x023B78 11:BB68: 3C        .byte con_pause + $3C
- D - I - 0x023B79 11:BB69: 00        .byte con_bg + $00
- D - I - 0x023B7A 11:BB6A: 0F        .byte con_animation + $0F
- D - I - 0x023B7B 11:BB6B: 00        .byte con_cloud + con_clear
- D - I - 0x023B7C 11:BB6C: FB        .byte con_rts

sub_BB6D:
- D - I - 0x023B7D 11:BB6D: F9        .byte con_soundID_delay, $04, $02
- D - I - 0x023B80 11:BB70: 32        .byte con_pause + $32
- D - I - 0x023B81 11:BB71: 20        .byte con_bg + $20
- D - I - 0x023B82 11:BB72: 0F        .byte con_animation + $0F
- D - I - 0x023B83 11:BB73: 00        .byte con_cloud + con_clear
- D - I - 0x023B84 11:BB74: FB        .byte con_rts

sub_BB75:
- D - I - 0x023B85 11:BB75: F9        .byte con_soundID_delay, $07, $02
- D - I - 0x023B88 11:BB78: 36        .byte con_pause + $36
- D - I - 0x023B89 11:BB79: 02        .byte con_bg + $02
- D - I - 0x023B8A 11:BB7A: 11        .byte con_animation + $11
- D - I - 0x023B8B 11:BB7B: 00        .byte con_cloud + con_clear
- D - I - 0x023B8C 11:BB7C: FB        .byte con_rts

sub_BB7D:
- D - I - 0x023B8D 11:BB7D: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x023B90 11:BB80: 32        .byte con_pause + $32
- D - I - 0x023B91 11:BB81: 4E        .byte con_bg + $4E
- D - I - 0x023B92 11:BB82: 12        .byte con_animation + $12
- D - I - 0x023B93 11:BB83: 00        .byte con_cloud + con_clear
- D - I - 0x023B94 11:BB84: FB        .byte con_rts

sub_BB85:
- D - I - 0x023B95 11:BB85: F6        .byte con_mirror_toggle
- D - I - 0x023B96 11:BB86: F9        .byte con_soundID_delay, $5E, $02
- D - I - 0x023B99 11:BB89: 1B        .byte con_pause + $1B
- D - I - 0x023B9A 11:BB8A: 64        .byte con_bg + $64
- D - I - 0x023B9B 11:BB8B: 67        .byte con_animation + $67
- D - I - 0x023B9C 11:BB8C: 00        .byte con_cloud + con_clear
- D - I - 0x023B9D 11:BB8D: F6        .byte con_mirror_toggle
- D - I - 0x023B9E 11:BB8E: FB        .byte con_rts

sub_BB8F:
- D - I - 0x023B9F 11:BB8F: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x023BA2 11:BB92: 30        .byte con_pause + $30
- D - I - 0x023BA3 11:BB93: 00        .byte con_bg + $00
- D - I - 0x023BA4 11:BB94: 1A        .byte con_animation + $1A
- D - I - 0x023BA5 11:BB95: 00        .byte con_cloud + con_clear
- D - I - 0x023BA6 11:BB96: FB        .byte con_rts

sub_BB97:
- D - I - 0x023BA7 11:BB97: F9        .byte con_soundID_delay, $06, $02
- D - I - 0x023BAA 11:BB9A: 2A        .byte con_pause + $2A
- D - I - 0x023BAB 11:BB9B: 27        .byte con_bg + $27
- D - I - 0x023BAC 11:BB9C: 1A        .byte con_animation + $1A
- D - I - 0x023BAD 11:BB9D: 00        .byte con_cloud + con_clear
- D - I - 0x023BAE 11:BB9E: FB        .byte con_rts

sub_BB9F:
- D - I - 0x023BAF 11:BB9F: F9        .byte con_soundID_delay, $08, $02
- D - I - 0x023BB2 11:BBA2: 3C        .byte con_pause + $3C
- D - I - 0x023BB3 11:BBA3: 4B        .byte con_bg + $4B
- D - I - 0x023BB4 11:BBA4: 1D        .byte con_animation + $1D
- D - I - 0x023BB5 11:BBA5: 00        .byte con_cloud + con_clear
- D - I - 0x023BB6 11:BBA6: FB        .byte con_rts

sub_BBA7_полет_twin_shot_1:
- D - I - 0x023BB7 11:BBA7: F9        .byte con_soundID_delay, $09, $02
- D - I - 0x023BBA 11:BBAA: 32        .byte con_pause + $32
- D - I - 0x023BBB 11:BBAB: 20        .byte con_bg + $20
- D - I - 0x023BBC 11:BBAC: 1E        .byte con_animation + $1E
- D - I - 0x023BBD 11:BBAD: 00        .byte con_cloud + con_clear
- D - I - 0x023BBE 11:BBAE: FB        .byte con_rts

sub_BBAF_полет_twin_shot_2:
- D - I - 0x023BBF 11:BBAF: F9        .byte con_soundID_delay, $09, $02
- D - I - 0x023BC2 11:BBB2: 4B        .byte con_pause + $4B
- D - I - 0x023BC3 11:BBB3: 02        .byte con_bg + $02
- D - I - 0x023BC4 11:BBB4: 1F        .byte con_animation + $1F
- D - I - 0x023BC5 11:BBB5: 00        .byte con_cloud + con_clear
- D - I - 0x023BC6 11:BBB6: FB        .byte con_rts

sub_BBB7:
- D - I - 0x023BC7 11:BBB7: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x023BCA 11:BBBA: 2D        .byte con_pause + $2D
- D - I - 0x023BCB 11:BBBB: 60        .byte con_bg + $60
- D - I - 0x023BCC 11:BBBC: 3C        .byte con_animation + $3C
- D - I - 0x023BCD 11:BBBD: 00        .byte con_cloud + con_clear
- D - I - 0x023BCE 11:BBBE: FB        .byte con_rts

sub_BBBF:
- D - I - 0x023BCF 11:BBBF: F9        .byte con_soundID_delay, $0B, $02
- D - I - 0x023BD2 11:BBC2: 2D        .byte con_pause + $2D
- D - I - 0x023BD3 11:BBC3: 48        .byte con_bg + $48
- D - I - 0x023BD4 11:BBC4: 3C        .byte con_animation + $3C
- D - I - 0x023BD5 11:BBC5: 00        .byte con_cloud + con_clear
- D - I - 0x023BD6 11:BBC6: FB        .byte con_rts

loc_BBC7_очистка:
sub_BBC7_очистка:
- D - I - 0x023BD7 11:BBC7: 01        .byte con_pause + $01
- D - I - 0x023BD8 11:BBC8: F0        .byte con_bg + con_skip
- D - I - 0x023BD9 11:BBC9: F0        .byte con_animation + con_skip
- D - I - 0x023BDA 11:BBCA: 00        .byte con_cloud + con_clear
- D - I - 0x023BDB 11:BBCB: FB        .byte con_rts



_scenario_BBCC_34:
- D - I - 0x023BDC 11:BBCC: F9        .byte con_soundID_delay, $64, $0D
- D - I - 0x023BDF 11:BBCF: 30        .byte con_pause + $30
- D - I - 0x023BE0 11:BBD0: 3C        .byte con_bg + $3C
- D - I - 0x023BE1 11:BBD1: 80        .byte con_animation + $80
- D - I - 0x023BE2 11:BBD2: E6        .byte con_cloud + $E6
- D - I - 0x023BE3 11:BBD3: FB        .byte con_rts



_scenario_BBD4_19:
- D - I - 0x023BE4 11:BBD4: FD        .byte con_mirror_condition, $00
- D - I - 0x023BE6 11:BBD6: F3        .byte con_branch, $8C
- D - I - 0x023BE8 11:BBD8: 02        .byte bra_case_BBDA_00 - *
- D - I - 0x023BE9 11:BBD9: 09        .byte bra_case_BBE2_01 - *

loc_BBDA:
bra_case_BBDA_00:
- D - I - 0x023BEA 11:BBDA: F9        .byte con_soundID_delay, $2B, $05
- D - I - 0x023BED 11:BBDD: 3C        .byte con_pause + $3C
- D - I - 0x023BEE 11:BBDE: 72        .byte con_bg + $72
- D - I - 0x023BEF 11:BBDF: 66        .byte con_animation + $66
- D - I - 0x023BF0 11:BBE0: 59        .byte con_cloud + $59
- D - I - 0x023BF1 11:BBE1: FB        .byte con_rts

bra_case_BBE2_01:
- D - I - 0x023BF2 11:BBE2: F3        .byte con_branch, $C9
- D - I - 0x023BF4 11:BBE4: 12        .byte bra_case_BBF6_00 - *
- D - I - 0x023BF5 11:BBE5: 11        .byte bra_case_BBF6_01 - *
- - - - - 0x023BF6 11:BBE6: 21        .byte bra_case_BC07_02 - *
- - - - - 0x023BF7 11:BBE7: 0F        .byte bra_case_BBF6_03 - *
- D - I - 0x023BF8 11:BBE8: 30        .byte bra_case_BC18_04 - *
- - - - - 0x023BF9 11:BBE9: 1E        .byte bra_case_BC07_05 - *
- D - I - 0x023BFA 11:BBEA: 2E        .byte bra_case_BC18_06 - *
- D - I - 0x023BFB 11:BBEB: 3E        .byte bra_case_BC29_07 - *
- D - I - 0x023BFC 11:BBEC: 3D        .byte bra_case_BC29_08 - *
- - - - - 0x023BFD 11:BBED: 3C        .byte bra_case_BC29_09 - *
- D - I - 0x023BFE 11:BBEE: 3B        .byte bra_case_BC29_0A - *
- D - I - 0x023BFF 11:BBEF: 4B        .byte bra_case_BC3A_0B - *
- D - I - 0x023C00 11:BBF0: 4A        .byte bra_case_BC3A_0C - *
- D - I - 0x023C01 11:BBF1: 5A        .byte bra_case_BC4B_0D - *
- - - - - 0x023C02 11:BBF2: 59        .byte bra_case_BC4B_0E - *
- D - I - 0x023C03 11:BBF3: 69        .byte bra_case_BC5C_0F - *
- D - I - 0x023C04 11:BBF4: 68        .byte bra_case_BC5C_10 - *
- - - - - 0x023C05 11:BBF5: 01        .byte bra_case_BBF6_11 - *

bra_case_BBF6_00:
bra_case_BBF6_01:
bra_case_BBF6_03:
bra_case_BBF6_11:
- D - I - 0x023C06 11:BBF6: F4        .byte con_mirror_on
- D - I - 0x023C07 11:BBF7: F8        .byte con_F8, $04
- D - I - 0x023C09 11:BBF9: 3C        .byte con_pause + $3C
- D - I - 0x023C0A 11:BBFA: 4F        .byte con_bg + $4F
- D - I - 0x023C0B 11:BBFB: 91        .byte con_animation + $91
- D - I - 0x023C0C 11:BBFC: CB        .byte con_cloud + $CB
- D - I - 0x023C0D 11:BBFD: F6        .byte con_mirror_toggle
- D - I - 0x023C0E 11:BBFE: F8        .byte con_F8, $04
- D - I - 0x023C10 11:BC00: 3C        .byte con_pause + $3C
- D - I - 0x023C11 11:BC01: 30        .byte con_bg + $30
- D - I - 0x023C12 11:BC02: 96        .byte con_animation + $96
- D - I - 0x023C13 11:BC03: CA        .byte con_cloud + $CA
- D - I - 0x023C14 11:BC04: F2        .byte con_jmp
- D - I - 0x023C15 11:BC05: DA BB     .word loc_BBDA

bra_case_BC07_02:
bra_case_BC07_05:
- - - - - 0x023C17 11:BC07: F4        .byte con_mirror_on
- - - - - 0x023C18 11:BC08: F8        .byte con_F8, $04
- - - - - 0x023C1A 11:BC0A: 3C        .byte con_pause + $3C
- - - - - 0x023C1B 11:BC0B: 55        .byte con_bg + $55
- - - - - 0x023C1C 11:BC0C: 9E        .byte con_animation + $9E
- - - - - 0x023C1D 11:BC0D: D1        .byte con_cloud + $D1
- - - - - 0x023C1E 11:BC0E: F6        .byte con_mirror_toggle
- - - - - 0x023C1F 11:BC0F: F8        .byte con_F8, $04
- - - - - 0x023C21 11:BC11: 3C        .byte con_pause + $3C
- - - - - 0x023C22 11:BC12: 30        .byte con_bg + $30
- - - - - 0x023C23 11:BC13: A2        .byte con_animation + $A2
- - - - - 0x023C24 11:BC14: D0        .byte con_cloud + $D0
- - - - - 0x023C25 11:BC15: F2        .byte con_jmp
- - - - - 0x023C26 11:BC16: DA BB     .word loc_BBDA

bra_case_BC18_04:
bra_case_BC18_06:
- D - I - 0x023C28 11:BC18: F4        .byte con_mirror_on
- D - I - 0x023C29 11:BC19: F8        .byte con_F8, $04
- D - I - 0x023C2B 11:BC1B: 3C        .byte con_pause + $3C
- D - I - 0x023C2C 11:BC1C: 55        .byte con_bg + $55
- D - I - 0x023C2D 11:BC1D: B0        .byte con_animation + $B0
- D - I - 0x023C2E 11:BC1E: D1        .byte con_cloud + $D1
- D - I - 0x023C2F 11:BC1F: F6        .byte con_mirror_toggle
- D - I - 0x023C30 11:BC20: F8        .byte con_F8, $04
- D - I - 0x023C32 11:BC22: 3C        .byte con_pause + $3C
- D - I - 0x023C33 11:BC23: 30        .byte con_bg + $30
- D - I - 0x023C34 11:BC24: B1        .byte con_animation + $B1
- D - I - 0x023C35 11:BC25: D0        .byte con_cloud + $D0
- D - I - 0x023C36 11:BC26: F2        .byte con_jmp
- D - I - 0x023C37 11:BC27: DA BB     .word loc_BBDA

bra_case_BC29_07:
bra_case_BC29_08:
bra_case_BC29_09:
bra_case_BC29_0A:
- D - I - 0x023C39 11:BC29: F4        .byte con_mirror_on
- D - I - 0x023C3A 11:BC2A: F8        .byte con_F8, $04
- D - I - 0x023C3C 11:BC2C: 3C        .byte con_pause + $3C
- D - I - 0x023C3D 11:BC2D: 4F        .byte con_bg + $4F
- D - I - 0x023C3E 11:BC2E: 9C        .byte con_animation + $9C
- D - I - 0x023C3F 11:BC2F: AC        .byte con_cloud + $AC
- D - I - 0x023C40 11:BC30: F6        .byte con_mirror_toggle
- D - I - 0x023C41 11:BC31: F8        .byte con_F8, $04
- D - I - 0x023C43 11:BC33: 3C        .byte con_pause + $3C
- D - I - 0x023C44 11:BC34: 30        .byte con_bg + $30
- D - I - 0x023C45 11:BC35: 9C        .byte con_animation + $9C
- D - I - 0x023C46 11:BC36: D3        .byte con_cloud + $D3
- D - I - 0x023C47 11:BC37: F2        .byte con_jmp
- D - I - 0x023C48 11:BC38: DA BB     .word loc_BBDA

bra_case_BC3A_0B:
bra_case_BC3A_0C:
- D - I - 0x023C4A 11:BC3A: F4        .byte con_mirror_on
- D - I - 0x023C4B 11:BC3B: F8        .byte con_F8, $04
- D - I - 0x023C4D 11:BC3D: 3C        .byte con_pause + $3C
- D - I - 0x023C4E 11:BC3E: 4F        .byte con_bg + $4F
- D - I - 0x023C4F 11:BC3F: AB        .byte con_animation + $AB
- D - I - 0x023C50 11:BC40: D3        .byte con_cloud + $D3
- D - I - 0x023C51 11:BC41: F6        .byte con_mirror_toggle
- D - I - 0x023C52 11:BC42: F8        .byte con_F8, $04
- D - I - 0x023C54 11:BC44: 3C        .byte con_pause + $3C
- D - I - 0x023C55 11:BC45: 30        .byte con_bg + $30
- D - I - 0x023C56 11:BC46: AB        .byte con_animation + $AB
- D - I - 0x023C57 11:BC47: AC        .byte con_cloud + $AC
- D - I - 0x023C58 11:BC48: F2        .byte con_jmp
- D - I - 0x023C59 11:BC49: DA BB     .word loc_BBDA

bra_case_BC4B_0D:
bra_case_BC4B_0E:
- D - I - 0x023C5B 11:BC4B: F4        .byte con_mirror_on
- D - I - 0x023C5C 11:BC4C: F8        .byte con_F8, $04
- D - I - 0x023C5E 11:BC4E: 3C        .byte con_pause + $3C
- D - I - 0x023C5F 11:BC4F: 4F        .byte con_bg + $4F
- D - I - 0x023C60 11:BC50: B6        .byte con_animation + $B6
- D - I - 0x023C61 11:BC51: CD        .byte con_cloud + $CD
- D - I - 0x023C62 11:BC52: F6        .byte con_mirror_toggle
- D - I - 0x023C63 11:BC53: F8        .byte con_F8, $04
- D - I - 0x023C65 11:BC55: 3C        .byte con_pause + $3C
- D - I - 0x023C66 11:BC56: 30        .byte con_bg + $30
- D - I - 0x023C67 11:BC57: B7        .byte con_animation + $B7
- D - I - 0x023C68 11:BC58: CE        .byte con_cloud + $CE
- D - I - 0x023C69 11:BC59: F2        .byte con_jmp
- D - I - 0x023C6A 11:BC5A: DA BB     .word loc_BBDA

bra_case_BC5C_0F:
bra_case_BC5C_10:
- D - I - 0x023C6C 11:BC5C: F4        .byte con_mirror_on
- D - I - 0x023C6D 11:BC5D: F8        .byte con_F8, $04
- D - I - 0x023C6F 11:BC5F: 3C        .byte con_pause + $3C
- D - I - 0x023C70 11:BC60: 4F        .byte con_bg + $4F
- D - I - 0x023C71 11:BC61: B4        .byte con_animation + $B4
- D - I - 0x023C72 11:BC62: D4        .byte con_cloud + $D4
- D - I - 0x023C73 11:BC63: F6        .byte con_mirror_toggle
- D - I - 0x023C74 11:BC64: F8        .byte con_F8, $04
- D - I - 0x023C76 11:BC66: 3C        .byte con_pause + $3C
- D - I - 0x023C77 11:BC67: 30        .byte con_bg + $30
- D - I - 0x023C78 11:BC68: B5        .byte con_animation + $B5
- D - I - 0x023C79 11:BC69: D5        .byte con_cloud + $D5
- D - I - 0x023C7A 11:BC6A: F2        .byte con_jmp
- D - I - 0x023C7B 11:BC6B: DA BB     .word loc_BBDA



_scenario_BC6D_1A:
- D - I - 0x023C7D 11:BC6D: F3        .byte con_branch, $8C
- D - I - 0x023C7F 11:BC6F: 02        .byte bra_case_BC71_00 - *
- D - I - 0x023C80 11:BC70: 11        .byte bra_case_BC81_01 - *

bra_case_BC71_00:
- D - I - 0x023C81 11:BC71: FD        .byte con_mirror_condition, $00
- D - I - 0x023C83 11:BC73: 32        .byte con_pause + $32
- D - I - 0x023C84 11:BC74: 20        .byte con_bg + $20
- D - I - 0x023C85 11:BC75: 7B        .byte con_animation + $7B
- D - I - 0x023C86 11:BC76: F0        .byte con_cloud + con_skip
- D - I - 0x023C87 11:BC77: F9        .byte con_soundID_delay, $2C, $1D
- D - I - 0x023C8A 11:BC7A: 3C        .byte con_pause + $3C
- D - I - 0x023C8B 11:BC7B: 3C        .byte con_bg + $3C
- D - I - 0x023C8C 11:BC7C: 7C        .byte con_animation + $7C
- D - I - 0x023C8D 11:BC7D: 5A        .byte con_cloud + $5A
- D - I - 0x023C8E 11:BC7E: F2        .byte con_jmp
- D - I - 0x023C8F 11:BC7F: C7 BB     .word loc_BBC7_очистка

bra_case_BC81_01:
- D - I - 0x023C91 11:BC81: F5        .byte con_mirror_off
- D - I - 0x023C92 11:BC82: F3        .byte con_branch, $C9
- D - I - 0x023C94 11:BC84: 12        .byte bra_case_BC96_00 - *
- D - I - 0x023C95 11:BC85: 29        .byte bra_case_BCAE_01 - *
- - - - - 0x023C96 11:BC86: 40        .byte bra_case_BCC6_02 - *
- - - - - 0x023C97 11:BC87: 3F        .byte bra_case_BCC6_03 - *
- D - I - 0x023C98 11:BC88: 43        .byte bra_case_BCCB_04 - *
- - - - - 0x023C99 11:BC89: 5C        .byte bra_case_BCE5_05 - *
- D - I - 0x023C9A 11:BC8A: 60        .byte bra_case_BCEA_06 - *
- D - I - 0x023C9B 11:BC8B: 79        .byte bra_case_BD04_07 - *
- D - I - 0x023C9C 11:BC8C: 78        .byte bra_case_BD04_08 - *
- - - - - 0x023C9D 11:BC8D: 77        .byte bra_case_BD04_09 - *
- D - I - 0x023C9E 11:BC8E: 76        .byte bra_case_BD04_0A - *
- D - I - 0x023C9F 11:BC8F: 7A        .byte bra_case_BD09_0B - *
- D - I - 0x023CA0 11:BC90: 79        .byte bra_case_BD09_0C - *
- - - - - 0x023CA1 11:BC91: 92        .byte bra_case_BD23_0D - *
- - - - - 0x023CA2 11:BC92: A9        .byte bra_case_BD3B_0E - *
- D - I - 0x023CA3 11:BC93: C0        .byte bra_case_BD53_0F - *
- D - I - 0x023CA4 11:BC94: D9        .byte bra_case_BD6D_10 - *
- - - - - 0x023CA5 11:BC95: 18        .byte bra_case_BCAD_11 - *

bra_case_BC96_00:
- D - I - 0x023CA6 11:BC96: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CA9 11:BC99: 28        .byte con_pause + $28
- D - I - 0x023CAA 11:BC9A: 36        .byte con_bg + $36
- D - I - 0x023CAB 11:BC9B: 95        .byte con_animation + $95
- D - I - 0x023CAC 11:BC9C: CC        .byte con_cloud + $CC
- D - I - 0x023CAD 11:BC9D: F6        .byte con_mirror_toggle
- D - I - 0x023CAE 11:BC9E: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CB1 11:BCA1: 3C        .byte con_pause + $3C
- D - I - 0x023CB2 11:BCA2: 01        .byte con_bg + $01
- D - I - 0x023CB3 11:BCA3: 92        .byte con_animation + $92
- D - I - 0x023CB4 11:BCA4: F0        .byte con_cloud + con_skip
- D - I - 0x023CB5 11:BCA5: F6        .byte con_mirror_toggle
- D - I - 0x023CB6 11:BCA6: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CB9 11:BCA9: 28        .byte con_pause + $28
- D - I - 0x023CBA 11:BCAA: 36        .byte con_bg + $36
- D - I - 0x023CBB 11:BCAB: 95        .byte con_animation + $95
- D - I - 0x023CBC 11:BCAC: F0        .byte con_cloud + con_skip
bra_case_BCAD_11:
- D - I - 0x023CBD 11:BCAD: FB        .byte con_rts

bra_case_BCAE_01:
- D - I - 0x023CBE 11:BCAE: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CC1 11:BCB1: 3C        .byte con_pause + $3C
- D - I - 0x023CC2 11:BCB2: 36        .byte con_bg + $36
- D - I - 0x023CC3 11:BCB3: 92        .byte con_animation + $92
- D - I - 0x023CC4 11:BCB4: CC        .byte con_cloud + $CC
- D - I - 0x023CC5 11:BCB5: F6        .byte con_mirror_toggle
- D - I - 0x023CC6 11:BCB6: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CC9 11:BCB9: 3C        .byte con_pause + $3C
- D - I - 0x023CCA 11:BCBA: 01        .byte con_bg + $01
- D - I - 0x023CCB 11:BCBB: 95        .byte con_animation + $95
- D - I - 0x023CCC 11:BCBC: F0        .byte con_cloud + con_skip
- D - I - 0x023CCD 11:BCBD: F6        .byte con_mirror_toggle
- D - I - 0x023CCE 11:BCBE: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CD1 11:BCC1: 3C        .byte con_pause + $3C
- D - I - 0x023CD2 11:BCC2: 36        .byte con_bg + $36
- D - I - 0x023CD3 11:BCC3: 92        .byte con_animation + $92
- D - I - 0x023CD4 11:BCC4: F0        .byte con_cloud + con_skip
- D - I - 0x023CD5 11:BCC5: FB        .byte con_rts

bra_case_BCC6_02:
bra_case_BCC6_03:
- - - - - 0x023CD6 11:BCC6: F7        .byte con_F7, $40
- - - - - 0x023CD8 11:BCC8: F2        .byte con_jmp
- - - - - 0x023CD9 11:BCC9: CD BC     .word loc_BCCD

bra_case_BCCB_04:
- D - I - 0x023CDB 11:BCCB: F7        .byte con_F7, $22
loc_BCCD:
- D - I - 0x023CDD 11:BCCD: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CE0 11:BCD0: 3C        .byte con_pause + $3C
- D - I - 0x023CE1 11:BCD1: 36        .byte con_bg + $36
- D - I - 0x023CE2 11:BCD2: A7        .byte con_animation + $A7
- D - I - 0x023CE3 11:BCD3: D2        .byte con_cloud + $D2
- D - I - 0x023CE4 11:BCD4: F6        .byte con_mirror_toggle
- D - I - 0x023CE5 11:BCD5: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CE8 11:BCD8: 3C        .byte con_pause + $3C
- D - I - 0x023CE9 11:BCD9: 01        .byte con_bg + $01
- D - I - 0x023CEA 11:BCDA: A5        .byte con_animation + $A5
- D - I - 0x023CEB 11:BCDB: F0        .byte con_cloud + con_skip
- D - I - 0x023CEC 11:BCDC: F6        .byte con_mirror_toggle
- D - I - 0x023CED 11:BCDD: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CF0 11:BCE0: 3C        .byte con_pause + $3C
- D - I - 0x023CF1 11:BCE1: 36        .byte con_bg + $36
- D - I - 0x023CF2 11:BCE2: A7        .byte con_animation + $A7
- D - I - 0x023CF3 11:BCE3: F0        .byte con_cloud + con_skip
- D - I - 0x023CF4 11:BCE4: FB        .byte con_rts

bra_case_BCE5_05:
- - - - - 0x023CF5 11:BCE5: F7        .byte con_F7, $40
- - - - - 0x023CF7 11:BCE7: F2        .byte con_jmp
- - - - - 0x023CF8 11:BCE8: EC BC     .word loc_BCEC

bra_case_BCEA_06:
- D - I - 0x023CFA 11:BCEA: F7        .byte con_F7, $22
loc_BCEC:
- D - I - 0x023CFC 11:BCEC: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023CFF 11:BCEF: 3C        .byte con_pause + $3C
- D - I - 0x023D00 11:BCF0: 36        .byte con_bg + $36
- D - I - 0x023D01 11:BCF1: A5        .byte con_animation + $A5
- D - I - 0x023D02 11:BCF2: D2        .byte con_cloud + $D2
- D - I - 0x023D03 11:BCF3: F6        .byte con_mirror_toggle
- D - I - 0x023D04 11:BCF4: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D07 11:BCF7: 3C        .byte con_pause + $3C
- D - I - 0x023D08 11:BCF8: 01        .byte con_bg + $01
- D - I - 0x023D09 11:BCF9: A7        .byte con_animation + $A7
- D - I - 0x023D0A 11:BCFA: F0        .byte con_cloud + con_skip
- D - I - 0x023D0B 11:BCFB: F6        .byte con_mirror_toggle
- D - I - 0x023D0C 11:BCFC: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D0F 11:BCFF: 3C        .byte con_pause + $3C
- D - I - 0x023D10 11:BD00: 36        .byte con_bg + $36
- D - I - 0x023D11 11:BD01: A5        .byte con_animation + $A5
- D - I - 0x023D12 11:BD02: F0        .byte con_cloud + con_skip
- D - I - 0x023D13 11:BD03: FB        .byte con_rts

bra_case_BD04_07:
bra_case_BD04_08:
bra_case_BD04_09:
bra_case_BD04_0A:
- D - I - 0x023D14 11:BD04: F7        .byte con_F7, $40
- D - I - 0x023D16 11:BD06: F2        .byte con_jmp
- D - I - 0x023D17 11:BD07: 0B BD     .word loc_BD0B

bra_case_BD09_0B:
bra_case_BD09_0C:
- D - I - 0x023D19 11:BD09: F7        .byte con_F7, $3F
loc_BD0B:
- D - I - 0x023D1B 11:BD0B: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D1E 11:BD0E: 3C        .byte con_pause + $3C
- D - I - 0x023D1F 11:BD0F: 36        .byte con_bg + $36
- D - I - 0x023D20 11:BD10: EF        .byte con_animation + $EF
- D - I - 0x023D21 11:BD11: D6        .byte con_cloud + $D6
- D - I - 0x023D22 11:BD12: F6        .byte con_mirror_toggle
- D - I - 0x023D23 11:BD13: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D26 11:BD16: 3C        .byte con_pause + $3C
- D - I - 0x023D27 11:BD17: 01        .byte con_bg + $01
- D - I - 0x023D28 11:BD18: EF        .byte con_animation + $EF
- D - I - 0x023D29 11:BD19: F0        .byte con_cloud + con_skip
- D - I - 0x023D2A 11:BD1A: F6        .byte con_mirror_toggle
- D - I - 0x023D2B 11:BD1B: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D2E 11:BD1E: 3C        .byte con_pause + $3C
- D - I - 0x023D2F 11:BD1F: 36        .byte con_bg + $36
- D - I - 0x023D30 11:BD20: EF        .byte con_animation + $EF
- D - I - 0x023D31 11:BD21: F0        .byte con_cloud + con_skip
- D - I - 0x023D32 11:BD22: FB        .byte con_rts

bra_case_BD23_0D:
- - - - - 0x023D33 11:BD23: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D36 11:BD26: 3C        .byte con_pause + $3C
- - - - - 0x023D37 11:BD27: 36        .byte con_bg + $36
- - - - - 0x023D38 11:BD28: DF        .byte con_animation + $DF
- - - - - 0x023D39 11:BD29: CF        .byte con_cloud + $CF
- - - - - 0x023D3A 11:BD2A: F6        .byte con_mirror_toggle
- - - - - 0x023D3B 11:BD2B: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D3E 11:BD2E: 3C        .byte con_pause + $3C
- - - - - 0x023D3F 11:BD2F: 01        .byte con_bg + $01
- - - - - 0x023D40 11:BD30: BE        .byte con_animation + $BE
- - - - - 0x023D41 11:BD31: F0        .byte con_cloud + con_skip
- - - - - 0x023D42 11:BD32: F6        .byte con_mirror_toggle
- - - - - 0x023D43 11:BD33: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D46 11:BD36: 3C        .byte con_pause + $3C
- - - - - 0x023D47 11:BD37: 36        .byte con_bg + $36
- - - - - 0x023D48 11:BD38: DF        .byte con_animation + $DF
- - - - - 0x023D49 11:BD39: F0        .byte con_cloud + con_skip
- - - - - 0x023D4A 11:BD3A: FB        .byte con_rts

bra_case_BD3B_0E:
- - - - - 0x023D4B 11:BD3B: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D4E 11:BD3E: 3C        .byte con_pause + $3C
- - - - - 0x023D4F 11:BD3F: 36        .byte con_bg + $36
- - - - - 0x023D50 11:BD40: BE        .byte con_animation + $BE
- - - - - 0x023D51 11:BD41: CF        .byte con_cloud + $CF
- - - - - 0x023D52 11:BD42: F6        .byte con_mirror_toggle
- - - - - 0x023D53 11:BD43: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D56 11:BD46: 3C        .byte con_pause + $3C
- - - - - 0x023D57 11:BD47: 01        .byte con_bg + $01
- - - - - 0x023D58 11:BD48: DF        .byte con_animation + $DF
- - - - - 0x023D59 11:BD49: F0        .byte con_cloud + con_skip
- - - - - 0x023D5A 11:BD4A: F6        .byte con_mirror_toggle
- - - - - 0x023D5B 11:BD4B: F9        .byte con_soundID_delay, $2C, $21
- - - - - 0x023D5E 11:BD4E: 3C        .byte con_pause + $3C
- - - - - 0x023D5F 11:BD4F: 36        .byte con_bg + $36
- - - - - 0x023D60 11:BD50: BE        .byte con_animation + $BE
- - - - - 0x023D61 11:BD51: F0        .byte con_cloud + con_skip
- - - - - 0x023D62 11:BD52: FB        .byte con_rts

bra_case_BD53_0F:
- D - I - 0x023D63 11:BD53: F7        .byte con_F7, $25
- D - I - 0x023D65 11:BD55: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D68 11:BD58: 3C        .byte con_pause + $3C
- D - I - 0x023D69 11:BD59: 36        .byte con_bg + $36
- D - I - 0x023D6A 11:BD5A: A7        .byte con_animation + $A7
- D - I - 0x023D6B 11:BD5B: D6        .byte con_cloud + $D6
- D - I - 0x023D6C 11:BD5C: F6        .byte con_mirror_toggle
- D - I - 0x023D6D 11:BD5D: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D70 11:BD60: 3C        .byte con_pause + $3C
- D - I - 0x023D71 11:BD61: 01        .byte con_bg + $01
- D - I - 0x023D72 11:BD62: EE        .byte con_animation + $EE
- D - I - 0x023D73 11:BD63: F0        .byte con_cloud + con_skip
- D - I - 0x023D74 11:BD64: F6        .byte con_mirror_toggle
- D - I - 0x023D75 11:BD65: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D78 11:BD68: 3C        .byte con_pause + $3C
- D - I - 0x023D79 11:BD69: 36        .byte con_bg + $36
- D - I - 0x023D7A 11:BD6A: A7        .byte con_animation + $A7
- D - I - 0x023D7B 11:BD6B: F0        .byte con_cloud + con_skip
- D - I - 0x023D7C 11:BD6C: FB        .byte con_rts

bra_case_BD6D_10:
- D - I - 0x023D7D 11:BD6D: F7        .byte con_F7, $25
- D - I - 0x023D7F 11:BD6F: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D82 11:BD72: 3C        .byte con_pause + $3C
- D - I - 0x023D83 11:BD73: 36        .byte con_bg + $36
- D - I - 0x023D84 11:BD74: EE        .byte con_animation + $EE
- D - I - 0x023D85 11:BD75: D6        .byte con_cloud + $D6
- D - I - 0x023D86 11:BD76: F6        .byte con_mirror_toggle
- D - I - 0x023D87 11:BD77: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D8A 11:BD7A: 3C        .byte con_pause + $3C
- D - I - 0x023D8B 11:BD7B: 01        .byte con_bg + $01
- D - I - 0x023D8C 11:BD7C: A7        .byte con_animation + $A7
- D - I - 0x023D8D 11:BD7D: F0        .byte con_cloud + con_skip
- D - I - 0x023D8E 11:BD7E: F6        .byte con_mirror_toggle
- D - I - 0x023D8F 11:BD7F: F9        .byte con_soundID_delay, $2C, $21
- D - I - 0x023D92 11:BD82: 3C        .byte con_pause + $3C
- D - I - 0x023D93 11:BD83: 36        .byte con_bg + $36
- D - I - 0x023D94 11:BD84: EE        .byte con_animation + $EE
- D - I - 0x023D95 11:BD85: D6        .byte con_cloud + $D6
- D - I - 0x023D96 11:BD86: FB        .byte con_rts

bra_long_case_BD87_02:
- D - I - 0x023D97 11:BD87: FD        .byte con_mirror_condition, $01       ; номер защитника
- D - I - 0x023D99 11:BD89: F7        .byte con_F7, $02
- D - I - 0x023D9B 11:BD8B: 28        .byte con_pause + $28
- D - I - 0x023D9C 11:BD8C: 23        .byte con_bg + $23
- D - I - 0x023D9D 11:BD8D: 5A        .byte con_animation + $5A
- D - I - 0x023D9E 11:BD8E: E8        .byte con_cloud + $E8
- D - I - 0x023D9F 11:BD8F: FB        .byte con_rts

bra_long_case_BD90_01_кипер_ждет_в_воротах:
- D - I - 0x023DA0 11:BD90: 60        .byte con_pause + $60
- D - I - 0x023DA1 11:BD91: 65        .byte con_bg + $65
- D - I - 0x023DA2 11:BD92: DA        .byte con_animation + $DA
- D - I - 0x023DA3 11:BD93: E7        .byte con_cloud + $E7
- D - I - 0x023DA4 11:BD94: FB        .byte con_rts



_scenario_BD95_40:
- D - I - 0x023DA5 11:BD95: 78        .byte con_pause + $78
- D - I - 0x023DA6 11:BD96: F0        .byte con_bg + con_skip
- D - I - 0x023DA7 11:BD97: F0        .byte con_animation + con_skip
- D - I - 0x023DA8 11:BD98: E9        .byte con_cloud + $E9
- D - I - 0x023DA9 11:BD99: FB        .byte con_rts



_scenario_BD9A_41:
- D - I - 0x023DAA 11:BD9A: 78        .byte con_pause + $78
- D - I - 0x023DAB 11:BD9B: F0        .byte con_bg + con_skip
- D - I - 0x023DAC 11:BD9C: F0        .byte con_animation + con_skip
- D - I - 0x023DAD 11:BD9D: EA        .byte con_cloud + $EA
- D - I - 0x023DAE 11:BD9E: F2        .byte con_jmp
- D - I - 0x023DAF 11:BD9F: C7 BB     .word loc_BBC7_очистка



_scenario_BDA1_3B:
- - - - - 0x023DB1 11:BDA1: 10        .byte con_pause + $10
- - - - - 0x023DB2 11:BDA2: F0        .byte con_bg + con_skip
- - - - - 0x023DB3 11:BDA3: F0        .byte con_animation + con_skip
- - - - - 0x023DB4 11:BDA4: F0        .byte con_cloud + con_skip
- - - - - 0x023DB5 11:BDA5: FB        .byte con_rts



_scenario_BDA6_42:
- D - I - 0x023DB6 11:BDA6: 78        .byte con_pause + $78
- D - I - 0x023DB7 11:BDA7: F0        .byte con_bg + con_skip
- D - I - 0x023DB8 11:BDA8: F0        .byte con_animation + con_skip
- D - I - 0x023DB9 11:BDA9: 22        .byte con_cloud + $22
- D - I - 0x023DBA 11:BDAA: F2        .byte con_jmp
- D - I - 0x023DBB 11:BDAB: C7 BB     .word loc_BBC7_очистка



_scenario_BDAD_43:
- D - I - 0x023DBD 11:BDAD: F5        .byte con_mirror_off
- D - I - 0x023DBE 11:BDAE: 46        .byte con_pause + $46
- D - I - 0x023DBF 11:BDAF: 3A        .byte con_bg + $3A
- D - I - 0x023DC0 11:BDB0: 8F        .byte con_animation + $8F
- D - I - 0x023DC1 11:BDB1: E4        .byte con_cloud + $E4
- D - I - 0x023DC2 11:BDB2: FB        .byte con_rts



_scenario_BDB3_39:
- D - I - 0x023DC3 11:BDB3: B0        .byte con_pause + $B0
- D - I - 0x023DC4 11:BDB4: 38        .byte con_bg + $38
- D - I - 0x023DC5 11:BDB5: 85        .byte con_animation + $85
- D - I - 0x023DC6 11:BDB6: 5B        .byte con_cloud + $5B
- D - I - 0x023DC7 11:BDB7: FB        .byte con_rts



_scenario_BDB8_45:
- - - - - 0x023DC8 11:BDB8: B0        .byte con_pause + $B0
- - - - - 0x023DC9 11:BDB9: 38        .byte con_bg + $38
- - - - - 0x023DCA 11:BDBA: 85        .byte con_animation + $85
- - - - - 0x023DCB 11:BDBB: A6        .byte con_cloud + $A6
- - - - - 0x023DCC 11:BDBC: FB        .byte con_rts



_scenario_BDBD_46:
- D - I - 0x023DCD 11:BDBD: F3        .byte con_branch, $B4     ; узнать высоту мяча
- D - I - 0x023DCF 11:BDBF: 03        .byte bra_case_BDC2_00_мяч_у_атакующего_на_земле - *
- - - - - 0x023DD0 11:BDC0: 02        .byte bra_case_BDC2_01_летит_низкий_мяч - *
- - - - - 0x023DD1 11:BDC1: 0C        .byte bra_case_BDCD_02_летит_высокий_мяч - *

bra_case_BDC2_00_мяч_у_атакующего_на_земле:
bra_case_BDC2_01_летит_низкий_мяч:
- D - I - 0x023DD2 11:BDC2: F5        .byte con_mirror_off
- D - I - 0x023DD3 11:BDC3: 78        .byte con_pause + $78
- D - I - 0x023DD4 11:BDC4: 30        .byte con_bg + $30
- D - I - 0x023DD5 11:BDC5: 91        .byte con_animation + $91
- D - I - 0x023DD6 11:BDC6: 4A        .byte con_cloud + $4A
- D - I - 0x023DD7 11:BDC7: FA        .byte con_jsr
- D - I - 0x023DD8 11:BDC8: 13 AD     .word sub_AD13
- D - I - 0x023DDA 11:BDCA: F2        .byte con_jmp
- D - I - 0x023DDB 11:BDCB: DD BD     .word loc_BDDD

bra_case_BDCD_02_летит_высокий_мяч:
- - - - - 0x023DDD 11:BDCD: F5        .byte con_mirror_off
- - - - - 0x023DDE 11:BDCE: 28        .byte con_pause + $28
- - - - - 0x023DDF 11:BDCF: 02        .byte con_bg + $02
- - - - - 0x023DE0 11:BDD0: 56        .byte con_animation + $56
- - - - - 0x023DE1 11:BDD1: 00        .byte con_cloud + con_clear
- - - - - 0x023DE2 11:BDD2: 78        .byte con_pause + $78
- - - - - 0x023DE3 11:BDD3: 30        .byte con_bg + $30
- - - - - 0x023DE4 11:BDD4: 91        .byte con_animation + $91
- - - - - 0x023DE5 11:BDD5: 4A        .byte con_cloud + $4A
- - - - - 0x023DE6 11:BDD6: F9        .byte con_soundID_delay, $2B, $19
- - - - - 0x023DE9 11:BDD9: 28        .byte con_pause + $28
- - - - - 0x023DEA 11:BDDA: 29        .byte con_bg + $29
- - - - - 0x023DEB 11:BDDB: C6        .byte con_animation + $C6
- - - - - 0x023DEC 11:BDDC: 00        .byte con_cloud + con_clear
loc_BDDD:
- D - I - 0x023DED 11:BDDD: FA        .byte con_jsr
- D - I - 0x023DEE 11:BDDE: A7 B0     .word sub_B0A7
- D - I - 0x023DF0 11:BDE0: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x023DF3 11:BDE3: 38        .byte con_pause + $38
- D - I - 0x023DF4 11:BDE4: 35        .byte con_bg + $35
- D - I - 0x023DF5 11:BDE5: 10        .byte con_animation + $10
- D - I - 0x023DF6 11:BDE6: 00        .byte con_cloud + con_clear
- D - I - 0x023DF7 11:BDE7: FA        .byte con_jsr
- D - I - 0x023DF8 11:BDE8: 5D BB     .word sub_BB5D
- D - I - 0x023DFA 11:BDEA: F9        .byte con_soundID_delay, $24, $02
- D - I - 0x023DFD 11:BDED: F7        .byte con_F7, $33
- D - I - 0x023DFF 11:BDEF: 3C        .byte con_pause + $3C
- D - I - 0x023E00 11:BDF0: 27        .byte con_bg + $27
- D - I - 0x023E01 11:BDF1: 51        .byte con_animation + $51
- D - I - 0x023E02 11:BDF2: 00        .byte con_cloud + con_clear
- D - I - 0x023E03 11:BDF3: F2        .byte con_jmp
- D - I - 0x023E04 11:BDF4: 67 A2     .word loc_A267_goal

sub_BDF6:
- D - I - 0x023E06 11:BDF6: F6        .byte con_mirror_toggle
- D - I - 0x023E07 11:BDF7: 1D        .byte con_pause + $1D
- D - I - 0x023E08 11:BDF8: 71        .byte con_bg + $71
- D - I - 0x023E09 11:BDF9: 00        .byte con_animation + $00
- D - I - 0x023E0A 11:BDFA: F0        .byte con_cloud + con_skip
- D - I - 0x023E0B 11:BDFB: FB        .byte con_rts

sub_BDFC:
- D - I - 0x023E0C 11:BDFC: 1D        .byte con_pause + $1D
- D - I - 0x023E0D 11:BDFD: 71        .byte con_bg + $71
- D - I - 0x023E0E 11:BDFE: 00        .byte con_animation + $00
- D - I - 0x023E0F 11:BDFF: F0        .byte con_cloud + con_skip
- D - I - 0x023E10 11:BE00: FB        .byte con_rts



_scenario_BE01_50___:
- D - I - 0x023E11 11:BE01: F5        .byte con_mirror_off
- D - I - 0x023E12 11:BE02: FA        .byte con_jsr
- D - I - 0x023E13 11:BE03: FC BD     .word sub_BDFC
- D - I - 0x023E15 11:BE05: FA        .byte con_jsr
- D - I - 0x023E16 11:BE06: F6 BD     .word sub_BDF6
- D - I - 0x023E18 11:BE08: 10        .byte con_pause + $10
- D - I - 0x023E19 11:BE09: 30        .byte con_bg + $30
- D - I - 0x023E1A 11:BE0A: 91        .byte con_animation + $91
- D - I - 0x023E1B 11:BE0B: F0        .byte con_cloud + con_skip
- D - I - 0x023E1C 11:BE0C: FB        .byte con_rts



_scenario_BE0D_51:
- D - I - 0x023E1D 11:BE0D: FA        .byte con_jsr
- D - I - 0x023E1E 11:BE0E: FC BD     .word sub_BDFC
- D - I - 0x023E20 11:BE10: FA        .byte con_jsr
- D - I - 0x023E21 11:BE11: F6 BD     .word sub_BDF6
- D - I - 0x023E23 11:BE13: 10        .byte con_pause + $10
- D - I - 0x023E24 11:BE14: 30        .byte con_bg + $30
- D - I - 0x023E25 11:BE15: 97        .byte con_animation + $97
- D - I - 0x023E26 11:BE16: F0        .byte con_cloud + con_skip
- D - I - 0x023E27 11:BE17: FB        .byte con_rts



_scenario_BE18_52:
- D - I - 0x023E28 11:BE18: FA        .byte con_jsr
- D - I - 0x023E29 11:BE19: F6 BD     .word sub_BDF6
- D - I - 0x023E2B 11:BE1B: 10        .byte con_pause + $10
- D - I - 0x023E2C 11:BE1C: 31        .byte con_bg + $31
- D - I - 0x023E2D 11:BE1D: 9E        .byte con_animation + $9E
- D - I - 0x023E2E 11:BE1E: F0        .byte con_cloud + con_skip
- D - I - 0x023E2F 11:BE1F: FB        .byte con_rts



_scenario_BE20_53:
- D - I - 0x023E30 11:BE20: FA        .byte con_jsr
- D - I - 0x023E31 11:BE21: F6 BD     .word sub_BDF6
- D - I - 0x023E33 11:BE23: F5        .byte con_mirror_off
- D - I - 0x023E34 11:BE24: 10        .byte con_pause + $10
- D - I - 0x023E35 11:BE25: 32        .byte con_bg + $32
- D - I - 0x023E36 11:BE26: A4        .byte con_animation + $A4
- D - I - 0x023E37 11:BE27: F0        .byte con_cloud + con_skip
- D - I - 0x023E38 11:BE28: F5        .byte con_mirror_off
- D - I - 0x023E39 11:BE29: FB        .byte con_rts



_scenario_BE2A_54:
- D - I - 0x023E3A 11:BE2A: FA        .byte con_jsr
- D - I - 0x023E3B 11:BE2B: F6 BD     .word sub_BDF6
- D - I - 0x023E3D 11:BE2D: 10        .byte con_pause + $10
- D - I - 0x023E3E 11:BE2E: 30        .byte con_bg + $30
- D - I - 0x023E3F 11:BE2F: AF        .byte con_animation + $AF
- D - I - 0x023E40 11:BE30: F0        .byte con_cloud + con_skip
- D - I - 0x023E41 11:BE31: FB        .byte con_rts



_scenario_BE32_55:
- D - I - 0x023E42 11:BE32: FA        .byte con_jsr
- D - I - 0x023E43 11:BE33: F6 BD     .word sub_BDF6
- D - I - 0x023E45 11:BE35: 10        .byte con_pause + $10
- D - I - 0x023E46 11:BE36: 30        .byte con_bg + $30
- D - I - 0x023E47 11:BE37: AE        .byte con_animation + $AE
- D - I - 0x023E48 11:BE38: F0        .byte con_cloud + con_skip
- D - I - 0x023E49 11:BE39: FB        .byte con_rts



_scenario_BE3A_56:
- D - I - 0x023E4A 11:BE3A: FA        .byte con_jsr
- D - I - 0x023E4B 11:BE3B: F6 BD     .word sub_BDF6
- D - I - 0x023E4D 11:BE3D: 10        .byte con_pause + $10
- D - I - 0x023E4E 11:BE3E: 30        .byte con_bg + $30
- D - I - 0x023E4F 11:BE3F: 98        .byte con_animation + $98
- D - I - 0x023E50 11:BE40: F0        .byte con_cloud + con_skip
- D - I - 0x023E51 11:BE41: FB        .byte con_rts



_scenario_BE42_57:
- D - I - 0x023E52 11:BE42: FA        .byte con_jsr
- D - I - 0x023E53 11:BE43: F6 BD     .word sub_BDF6
- D - I - 0x023E55 11:BE45: 10        .byte con_pause + $10
- D - I - 0x023E56 11:BE46: 30        .byte con_bg + $30
- D - I - 0x023E57 11:BE47: AD        .byte con_animation + $AD
- D - I - 0x023E58 11:BE48: F0        .byte con_cloud + con_skip
- D - I - 0x023E59 11:BE49: FB        .byte con_rts



_scenario_BE4A_58:
- D - I - 0x023E5A 11:BE4A: FA        .byte con_jsr
- D - I - 0x023E5B 11:BE4B: F6 BD     .word sub_BDF6
- D - I - 0x023E5D 11:BE4D: 10        .byte con_pause + $10
- D - I - 0x023E5E 11:BE4E: 30        .byte con_bg + $30
- D - I - 0x023E5F 11:BE4F: 9A        .byte con_animation + $9A
- D - I - 0x023E60 11:BE50: F0        .byte con_cloud + con_skip
- D - I - 0x023E61 11:BE51: FB        .byte con_rts



_scenario_BE52_59:
- D - I - 0x023E62 11:BE52: FA        .byte con_jsr
- D - I - 0x023E63 11:BE53: F6 BD     .word sub_BDF6
- D - I - 0x023E65 11:BE55: 10        .byte con_pause + $10
- D - I - 0x023E66 11:BE56: 30        .byte con_bg + $30
- D - I - 0x023E67 11:BE57: AA        .byte con_animation + $AA
- D - I - 0x023E68 11:BE58: F0        .byte con_cloud + con_skip
- D - I - 0x023E69 11:BE59: FB        .byte con_rts



_scenario_BE5A_5A:
- D - I - 0x023E6A 11:BE5A: FA        .byte con_jsr
- D - I - 0x023E6B 11:BE5B: F6 BD     .word sub_BDF6
- D - I - 0x023E6D 11:BE5D: 50        .byte con_pause + $50
- D - I - 0x023E6E 11:BE5E: 30        .byte con_bg + $30
- D - I - 0x023E6F 11:BE5F: AB        .byte con_animation + $AB
- D - I - 0x023E70 11:BE60: F0        .byte con_cloud + con_skip
- D - I - 0x023E71 11:BE61: FA        .byte con_jsr
- D - I - 0x023E72 11:BE62: F6 BD     .word sub_BDF6
- D - I - 0x023E74 11:BE64: 10        .byte con_pause + $10
- D - I - 0x023E75 11:BE65: 30        .byte con_bg + $30
- D - I - 0x023E76 11:BE66: AB        .byte con_animation + $AB
- D - I - 0x023E77 11:BE67: F0        .byte con_cloud + con_skip
- D - I - 0x023E78 11:BE68: FB        .byte con_rts



_scenario_BE69_5B:
- D - I - 0x023E79 11:BE69: FA        .byte con_jsr
- D - I - 0x023E7A 11:BE6A: F6 BD     .word sub_BDF6
- D - I - 0x023E7C 11:BE6C: F5        .byte con_mirror_off
- D - I - 0x023E7D 11:BE6D: 10        .byte con_pause + $10
- D - I - 0x023E7E 11:BE6E: 33        .byte con_bg + $33
- D - I - 0x023E7F 11:BE6F: A6        .byte con_animation + $A6
- D - I - 0x023E80 11:BE70: F0        .byte con_cloud + con_skip
- D - I - 0x023E81 11:BE71: F5        .byte con_mirror_off
- D - I - 0x023E82 11:BE72: FB        .byte con_rts



_scenario_BE73_5C:
- D - I - 0x023E83 11:BE73: F5        .byte con_mirror_off
- D - I - 0x023E84 11:BE74: FA        .byte con_jsr
- D - I - 0x023E85 11:BE75: F6 BD     .word sub_BDF6
- D - I - 0x023E87 11:BE77: 10        .byte con_pause + $10
- D - I - 0x023E88 11:BE78: 30        .byte con_bg + $30
- D - I - 0x023E89 11:BE79: A9        .byte con_animation + $A9
- D - I - 0x023E8A 11:BE7A: F0        .byte con_cloud + con_skip
- D - I - 0x023E8B 11:BE7B: FB        .byte con_rts



_scenario_BE7C_5D:
- D - I - 0x023E8C 11:BE7C: FA        .byte con_jsr
- D - I - 0x023E8D 11:BE7D: F6 BD     .word sub_BDF6
- D - I - 0x023E8F 11:BE7F: F5        .byte con_mirror_off
- D - I - 0x023E90 11:BE80: 10        .byte con_pause + $10
- D - I - 0x023E91 11:BE81: 32        .byte con_bg + $32
- D - I - 0x023E92 11:BE82: A8        .byte con_animation + $A8
- D - I - 0x023E93 11:BE83: F0        .byte con_cloud + con_skip
- D - I - 0x023E94 11:BE84: F5        .byte con_mirror_off
- D - I - 0x023E95 11:BE85: FB        .byte con_rts



_scenario_BE86_5E:
- D - I - 0x023E96 11:BE86: FA        .byte con_jsr
- D - I - 0x023E97 11:BE87: F6 BD     .word sub_BDF6
- D - I - 0x023E99 11:BE89: 10        .byte con_pause + $10
- D - I - 0x023E9A 11:BE8A: 30        .byte con_bg + $30
- D - I - 0x023E9B 11:BE8B: B3        .byte con_animation + $B3
- D - I - 0x023E9C 11:BE8C: F0        .byte con_cloud + con_skip
- D - I - 0x023E9D 11:BE8D: FB        .byte con_rts



_scenario_BE8E_5F:
- D - I - 0x023E9E 11:BE8E: FA        .byte con_jsr
- D - I - 0x023E9F 11:BE8F: F6 BD     .word sub_BDF6
- D - I - 0x023EA1 11:BE91: 10        .byte con_pause + $10
- D - I - 0x023EA2 11:BE92: 30        .byte con_bg + $30
- D - I - 0x023EA3 11:BE93: B5        .byte con_animation + $B5
- D - I - 0x023EA4 11:BE94: F0        .byte con_cloud + con_skip
- D - I - 0x023EA5 11:BE95: FB        .byte con_rts



_scenario_BE96_60:
- D - I - 0x023EA6 11:BE96: FA        .byte con_jsr
- D - I - 0x023EA7 11:BE97: F6 BD     .word sub_BDF6
- D - I - 0x023EA9 11:BE99: 10        .byte con_pause + $10
- D - I - 0x023EAA 11:BE9A: 30        .byte con_bg + $30
- D - I - 0x023EAB 11:BE9B: B4        .byte con_animation + $B4
- D - I - 0x023EAC 11:BE9C: F0        .byte con_cloud + con_skip
- D - I - 0x023EAD 11:BE9D: FB        .byte con_rts



_scenario_BE9E_61:
- D - I - 0x023EAE 11:BE9E: FA        .byte con_jsr
- D - I - 0x023EAF 11:BE9F: F6 BD     .word sub_BDF6
- D - I - 0x023EB1 11:BEA1: 10        .byte con_pause + $10
- D - I - 0x023EB2 11:BEA2: 30        .byte con_bg + $30
- D - I - 0x023EB3 11:BEA3: B7        .byte con_animation + $B7
- D - I - 0x023EB4 11:BEA4: F0        .byte con_cloud + con_skip
- D - I - 0x023EB5 11:BEA5: FB        .byte con_rts



_scenario_BEA6_62:
- D - I - 0x023EB6 11:BEA6: FA        .byte con_jsr
- D - I - 0x023EB7 11:BEA7: F6 BD     .word sub_BDF6
- D - I - 0x023EB9 11:BEA9: 10        .byte con_pause + $10
- D - I - 0x023EBA 11:BEAA: 30        .byte con_bg + $30
- D - I - 0x023EBB 11:BEAB: B6        .byte con_animation + $B6
- D - I - 0x023EBC 11:BEAC: F0        .byte con_cloud + con_skip
- D - I - 0x023EBD 11:BEAD: FB        .byte con_rts



_scenario_BEAE_63:
- D - I - 0x023EBE 11:BEAE: FA        .byte con_jsr
- D - I - 0x023EBF 11:BEAF: F6 BD     .word sub_BDF6
- D - I - 0x023EC1 11:BEB1: 10        .byte con_pause + $10
- D - I - 0x023EC2 11:BEB2: 30        .byte con_bg + $30
- D - I - 0x023EC3 11:BEB3: B8        .byte con_animation + $B8
- D - I - 0x023EC4 11:BEB4: F0        .byte con_cloud + con_skip
- D - I - 0x023EC5 11:BEB5: FB        .byte con_rts



_scenario_BEB6_64:
- D - I - 0x023EC6 11:BEB6: FA        .byte con_jsr
- D - I - 0x023EC7 11:BEB7: F6 BD     .word sub_BDF6
- D - I - 0x023EC9 11:BEB9: 10        .byte con_pause + $10
- D - I - 0x023ECA 11:BEBA: 30        .byte con_bg + $30
- D - I - 0x023ECB 11:BEBB: B2        .byte con_animation + $B2
- D - I - 0x023ECC 11:BEBC: F0        .byte con_cloud + con_skip
- D - I - 0x023ECD 11:BEBD: FB        .byte con_rts



_scenario_BEBE_65:
- D - I - 0x023ECE 11:BEBE: FA        .byte con_jsr
- D - I - 0x023ECF 11:BEBF: F6 BD     .word sub_BDF6
- D - I - 0x023ED1 11:BEC1: 10        .byte con_pause + $10
- D - I - 0x023ED2 11:BEC2: 30        .byte con_bg + $30
- D - I - 0x023ED3 11:BEC3: BC        .byte con_animation + $BC
- D - I - 0x023ED4 11:BEC4: F0        .byte con_cloud + con_skip
- D - I - 0x023ED5 11:BEC5: FB        .byte con_rts



_scenario_BEC6_66:
- D - I - 0x023ED6 11:BEC6: F7        .byte con_F7, $31
- D - I - 0x023ED8 11:BEC8: 3A        .byte con_pause + $3A
- D - I - 0x023ED9 11:BEC9: 6A        .byte con_bg + $6A
- D - I - 0x023EDA 11:BECA: DB        .byte con_animation + $DB
- D - I - 0x023EDB 11:BECB: F0        .byte con_cloud + con_skip
- D - I - 0x023EDC 11:BECC: F7        .byte con_F7, $20
- D - I - 0x023EDE 11:BECE: 5E        .byte con_pause + $5E
- D - I - 0x023EDF 11:BECF: 49        .byte con_bg + $49
- D - I - 0x023EE0 11:BED0: F0        .byte con_animation + con_skip
- D - I - 0x023EE1 11:BED1: F0        .byte con_cloud + con_skip
- D - I - 0x023EE2 11:BED2: F7        .byte con_F7, $10
- D - I - 0x023EE4 11:BED4: 1E        .byte con_pause + $1E
- D - I - 0x023EE5 11:BED5: 05        .byte con_bg + $05
- D - I - 0x023EE6 11:BED6: 00        .byte con_animation + $00
- D - I - 0x023EE7 11:BED7: F0        .byte con_cloud + con_skip



_scenario_BED8_67:
- D - I - 0x023EE8 11:BED8: FA        .byte con_jsr
- D - I - 0x023EE9 11:BED9: 12 B7     .word sub_B712
- D - I - 0x023EEB 11:BEDB: FA        .byte con_jsr
- D - I - 0x023EEC 11:BEDC: 83 B5     .word sub_B583
- D - I - 0x023EEE 11:BEDE: FA        .byte con_jsr
- D - I - 0x023EEF 11:BEDF: 09 B5     .word sub_B509
- D - I - 0x023EF1 11:BEE1: FA        .byte con_jsr
- D - I - 0x023EF2 11:BEE2: 0B B6     .word sub_B60B
- D - I - 0x023EF4 11:BEE4: FA        .byte con_jsr
- D - I - 0x023EF5 11:BEE5: 24 B7     .word sub_B724
- D - I - 0x023EF7 11:BEE7: FA        .byte con_jsr
- D - I - 0x023EF8 11:BEE8: EC B5     .word sub_B5EC
- D - I - 0x023EFA 11:BEEA: 38        .byte con_pause + $38
- D - I - 0x023EFB 11:BEEB: 35        .byte con_bg + $35
- D - I - 0x023EFC 11:BEEC: 10        .byte con_animation + $10
- D - I - 0x023EFD 11:BEED: F0        .byte con_cloud + con_skip
- D - I - 0x023EFE 11:BEEE: FA        .byte con_jsr
- D - I - 0x023EFF 11:BEEF: 5D BB     .word sub_BB5D
- D - I - 0x023F01 11:BEF1: F7        .byte con_F7, $33
- D - I - 0x023F03 11:BEF3: 3C        .byte con_pause + $3C
- D - I - 0x023F04 11:BEF4: 27        .byte con_bg + $27
- D - I - 0x023F05 11:BEF5: 51        .byte con_animation + $51
- D - I - 0x023F06 11:BEF6: F0        .byte con_cloud + con_skip
_scenario_BEF7_68:
- D - I - 0x023F07 11:BEF7: F7        .byte con_F7, $03
- D - I - 0x023F09 11:BEF9: A0        .byte con_pause + $A0
- D - I - 0x023F0A 11:BEFA: 07        .byte con_bg + $07
- D - I - 0x023F0B 11:BEFB: 45        .byte con_animation + $45
- D - I - 0x023F0C 11:BEFC: F0        .byte con_cloud + con_skip
- D - I - 0x023F0D 11:BEFD: F5        .byte con_mirror_off
- D - I - 0x023F0E 11:BEFE: F7        .byte con_F7, $13
- D - I - 0x023F10 11:BF00: 78        .byte con_pause + $78
- D - I - 0x023F11 11:BF01: 0A        .byte con_bg + $0A
- D - I - 0x023F12 11:BF02: 48        .byte con_animation + $48
- D - I - 0x023F13 11:BF03: F0        .byte con_cloud + con_skip
- D - I - 0x023F14 11:BF04: FB        .byte con_rts



_scenario_BF05_69:
- D - I - 0x023F15 11:BF05: F5        .byte con_mirror_off
- D - I - 0x023F16 11:BF06: 28        .byte con_pause + $28
- D - I - 0x023F17 11:BF07: 3C        .byte con_bg + $3C
- D - I - 0x023F18 11:BF08: 61        .byte con_animation + $61
- D - I - 0x023F19 11:BF09: F0        .byte con_cloud + con_skip
- D - I - 0x023F1A 11:BF0A: F2        .byte con_jmp
- D - I - 0x023F1B 11:BF0B: 39 AB     .word loc_AB39



_scenario_BF0D_6B:
- D - I - 0x023F1D 11:BF0D: FA        .byte con_jsr
- D - I - 0x023F1E 11:BF0E: 5D A4     .word sub_A45D
- D - I - 0x023F20 11:BF10: F2        .byte con_jmp
- D - I - 0x023F21 11:BF11: C3 A0     .word loc_A0C3



_scenario_BF13_6C:
- D - I - 0x023F23 11:BF13: FA        .byte con_jsr
- D - I - 0x023F24 11:BF14: B1 A7     .word sub_A7B1
- D - I - 0x023F26 11:BF16: F7        .byte con_F7, $0F
- D - I - 0x023F28 11:BF18: 1E        .byte con_pause + $1E
- D - I - 0x023F29 11:BF19: 05        .byte con_bg + $05
- D - I - 0x023F2A 11:BF1A: 00        .byte con_animation + $00
- D - I - 0x023F2B 11:BF1B: F0        .byte con_cloud + con_skip
- D - I - 0x023F2C 11:BF1C: F7        .byte con_F7, $2A
- D - I - 0x023F2E 11:BF1E: 23        .byte con_pause + $23
- D - I - 0x023F2F 11:BF1F: 6A        .byte con_bg + $6A
- D - I - 0x023F30 11:BF20: BD        .byte con_animation + $BD
- D - I - 0x023F31 11:BF21: F0        .byte con_cloud + con_skip
- D - I - 0x023F32 11:BF22: FB        .byte con_rts



_scenario_BF23_6D:
- D - I - 0x023F33 11:BF23: 3C        .byte con_pause + $3C
- D - I - 0x023F34 11:BF24: 28        .byte con_bg + $28
- D - I - 0x023F35 11:BF25: C6        .byte con_animation + $C6
- D - I - 0x023F36 11:BF26: F0        .byte con_cloud + con_skip
- D - I - 0x023F37 11:BF27: 64        .byte con_pause + $64
- D - I - 0x023F38 11:BF28: 52        .byte con_bg + $52
- D - I - 0x023F39 11:BF29: E5        .byte con_animation + $E5
- D - I - 0x023F3A 11:BF2A: F0        .byte con_cloud + con_skip
- D - I - 0x023F3B 11:BF2B: FB        .byte con_rts



_scenario_BF2C_6E:
- D - I - 0x023F3C 11:BF2C: F5        .byte con_mirror_off
- D - I - 0x023F3D 11:BF2D: 32        .byte con_pause + $32
- D - I - 0x023F3E 11:BF2E: 1F        .byte con_bg + $1F
- D - I - 0x023F3F 11:BF2F: 64        .byte con_animation + $64
- D - I - 0x023F40 11:BF30: F0        .byte con_cloud + con_skip
- D - I - 0x023F41 11:BF31: F6        .byte con_mirror_toggle
- D - I - 0x023F42 11:BF32: F8        .byte con_F8, $04
- D - I - 0x023F44 11:BF34: F7        .byte con_F7, $3A
- D - I - 0x023F46 11:BF36: 32        .byte con_pause + $32
- D - I - 0x023F47 11:BF37: 23        .byte con_bg + $23
- D - I - 0x023F48 11:BF38: 76        .byte con_animation + $76
- D - I - 0x023F49 11:BF39: F0        .byte con_cloud + con_skip
- D - I - 0x023F4A 11:BF3A: F6        .byte con_mirror_toggle
- D - I - 0x023F4B 11:BF3B: F7        .byte con_F7, $10
- D - I - 0x023F4D 11:BF3D: 20        .byte con_pause + $20
- D - I - 0x023F4E 11:BF3E: 05        .byte con_bg + $05
- D - I - 0x023F4F 11:BF3F: 00        .byte con_animation + $00
- D - I - 0x023F50 11:BF40: F0        .byte con_cloud + con_skip
- D - I - 0x023F51 11:BF41: 28        .byte con_pause + $28
- D - I - 0x023F52 11:BF42: 12        .byte con_bg + $12
- D - I - 0x023F53 11:BF43: E1        .byte con_animation + $E1
- D - I - 0x023F54 11:BF44: F0        .byte con_cloud + con_skip
- D - I - 0x023F55 11:BF45: F7        .byte con_F7, $1E
- D - I - 0x023F57 11:BF47: 20        .byte con_pause + $20
- D - I - 0x023F58 11:BF48: 05        .byte con_bg + $05
- D - I - 0x023F59 11:BF49: F0        .byte con_animation + con_skip
- D - I - 0x023F5A 11:BF4A: F0        .byte con_cloud + con_skip
- D - I - 0x023F5B 11:BF4B: 32        .byte con_pause + $32
- D - I - 0x023F5C 11:BF4C: 20        .byte con_bg + $20
- D - I - 0x023F5D 11:BF4D: 4B        .byte con_animation + $4B
- D - I - 0x023F5E 11:BF4E: F0        .byte con_cloud + con_skip
- D - I - 0x023F5F 11:BF4F: 48        .byte con_pause + $48
- D - I - 0x023F60 11:BF50: 2A        .byte con_bg + $2A
- D - I - 0x023F61 11:BF51: 3B        .byte con_animation + $3B
- D - I - 0x023F62 11:BF52: F0        .byte con_cloud + con_skip
- D - I - 0x023F63 11:BF53: FB        .byte con_rts



_scenario_BF54_6F:
- D - I - 0x023F64 11:BF54: FA        .byte con_jsr
- D - I - 0x023F65 11:BF55: 4D A3     .word sub_A34D_отскок_вакашимазу_от_штанги
- D - I - 0x023F67 11:BF57: FC        .byte con_moving_bg, $01
- D - I - 0x023F69 11:BF59: F9        .byte con_soundID_delay, $2A, $21
- D - I - 0x023F6C 11:BF5C: 30        .byte con_pause + $30
- D - I - 0x023F6D 11:BF5D: 2E        .byte con_bg + $2E
- D - I - 0x023F6E 11:BF5E: 2D        .byte con_animation + $2D
- D - I - 0x023F6F 11:BF5F: F0        .byte con_cloud + con_skip
- D - I - 0x023F70 11:BF60: FB        .byte con_rts



_scenario_BF61_70:
- D - I - 0x023F71 11:BF61: FA        .byte con_jsr
- D - I - 0x023F72 11:BF62: E7 B4     .word sub_B4E7
- D - I - 0x023F74 11:BF64: FA        .byte con_jsr
- D - I - 0x023F75 11:BF65: 4E A2     .word sub_A24E_штанга
- D - I - 0x023F77 11:BF67: FA        .byte con_jsr
- D - I - 0x023F78 11:BF68: 58 A2     .word sub_A258
- D - I - 0x023F7A 11:BF6A: FA        .byte con_jsr
- D - I - 0x023F7B 11:BF6B: 12 A2     .word sub_A212
- D - I - 0x023F7D 11:BF6D: FA        .byte con_jsr
- D - I - 0x023F7E 11:BF6E: F4 A2     .word sub_A2F4_сообщение_oops_на_мигающем_белом_фоне
- D - I - 0x023F80 11:BF70: F2        .byte con_jmp
- D - I - 0x023F81 11:BF71: 64 A3     .word loc_A364_рваный_мяч



_scenario_BF73_71:
- D - I - 0x023F83 11:BF73: FA        .byte con_jsr
- D - I - 0x023F84 11:BF74: D6 9F     .word sub_9FD6
- D - I - 0x023F86 11:BF76: FA        .byte con_jsr
- D - I - 0x023F87 11:BF77: F4 A2     .word sub_A2F4_сообщение_oops_на_мигающем_белом_фоне
- D - I - 0x023F89 11:BF79: FA        .byte con_jsr
- D - I - 0x023F8A 11:BF7A: 8D A0     .word sub_A08D
- D - I - 0x023F8C 11:BF7C: F2        .byte con_jmp
- D - I - 0x023F8D 11:BF7D: B6 A0     .word loc_A0B6_защитник_спасает_ворота



_scenario_BF7F_72:
- D - I - 0x023F8F 11:BF7F: F7        .byte con_F7, $33
- D - I - 0x023F91 11:BF81: 20        .byte con_pause + $20
- D - I - 0x023F92 11:BF82: 6B        .byte con_bg + $6B
- D - I - 0x023F93 11:BF83: E3        .byte con_animation + $E3
- D - I - 0x023F94 11:BF84: F0        .byte con_cloud + con_skip
- D - I - 0x023F95 11:BF85: 14        .byte con_pause + $14
- D - I - 0x023F96 11:BF86: 02        .byte con_bg + $02
- D - I - 0x023F97 11:BF87: 1C        .byte con_animation + $1C
- D - I - 0x023F98 11:BF88: F0        .byte con_cloud + con_skip
- D - I - 0x023F99 11:BF89: 20        .byte con_pause + $20
- D - I - 0x023F9A 11:BF8A: 56        .byte con_bg + $56
- D - I - 0x023F9B 11:BF8B: 49        .byte con_animation + $49
- D - I - 0x023F9C 11:BF8C: F0        .byte con_cloud + con_skip
- D - I - 0x023F9D 11:BF8D: F7        .byte con_F7, $1A
- D - I - 0x023F9F 11:BF8F: 5A        .byte con_pause + $5A
- D - I - 0x023FA0 11:BF90: 61        .byte con_bg + $61
- D - I - 0x023FA1 11:BF91: 30        .byte con_animation + $30
- D - I - 0x023FA2 11:BF92: F0        .byte con_cloud + con_skip
- D - I - 0x023FA3 11:BF93: FB        .byte con_rts



_scenario_BF94_73:
- D - I - 0x023FA4 11:BF94: FA        .byte con_jsr
- D - I - 0x023FA5 11:BF95: 2D A3     .word sub_A32D
- D - I - 0x023FA7 11:BF97: 78        .byte con_pause + $78
- D - I - 0x023FA8 11:BF98: 48        .byte con_bg + $48
- D - I - 0x023FA9 11:BF99: 75        .byte con_animation + $75
- D - I - 0x023FAA 11:BF9A: F0        .byte con_cloud + con_skip
- D - I - 0x023FAB 11:BF9B: FB        .byte con_rts



_scenario_BF9C_74:
- D - I - 0x023FAC 11:BF9C: FA        .byte con_jsr
- D - I - 0x023FAD 11:BF9D: C0 B3     .word sub_B3C0
- D - I - 0x023FAF 11:BF9F: FA        .byte con_jsr
- D - I - 0x023FB0 11:BFA0: CB BF     .word sub_BFCB
- D - I - 0x023FB2 11:BFA2: FA        .byte con_jsr
- D - I - 0x023FB3 11:BFA3: C1 BF     .word sub_BFC1
- D - I - 0x023FB5 11:BFA5: F6        .byte con_mirror_toggle
- D - I - 0x023FB6 11:BFA6: FA        .byte con_jsr
- D - I - 0x023FB7 11:BFA7: CB BF     .word sub_BFCB
- D - I - 0x023FB9 11:BFA9: FA        .byte con_jsr
- D - I - 0x023FBA 11:BFAA: C6 BF     .word sub_BFC6
- D - I - 0x023FBC 11:BFAC: FA        .byte con_jsr
- D - I - 0x023FBD 11:BFAD: CB BF     .word sub_BFCB
- D - I - 0x023FBF 11:BFAF: FA        .byte con_jsr
- D - I - 0x023FC0 11:BFB0: C1 BF     .word sub_BFC1
- D - I - 0x023FC2 11:BFB2: F6        .byte con_mirror_toggle
- D - I - 0x023FC3 11:BFB3: FA        .byte con_jsr
- D - I - 0x023FC4 11:BFB4: CB BF     .word sub_BFCB
- D - I - 0x023FC6 11:BFB6: FA        .byte con_jsr
- D - I - 0x023FC7 11:BFB7: C6 BF     .word sub_BFC6
- D - I - 0x023FC9 11:BFB9: FA        .byte con_jsr
- D - I - 0x023FCA 11:BFBA: CB BF     .word sub_BFCB
- D - I - 0x023FCC 11:BFBC: 20        .byte con_pause + $20
- D - I - 0x023FCD 11:BFBD: 1F        .byte con_bg + $1F
- D - I - 0x023FCE 11:BFBE: 02        .byte con_animation + $02
- D - I - 0x023FCF 11:BFBF: F0        .byte con_cloud + con_skip
- D - I - 0x023FD0 11:BFC0: FB        .byte con_rts

sub_BFC1:
- D - I - 0x023FD1 11:BFC1: 28        .byte con_pause + $28
- D - I - 0x023FD2 11:BFC2: 1E        .byte con_bg + $1E
- D - I - 0x023FD3 11:BFC3: 13        .byte con_animation + $13
- D - I - 0x023FD4 11:BFC4: F0        .byte con_cloud + con_skip
- D - I - 0x023FD5 11:BFC5: FB        .byte con_rts

sub_BFC6:
- D - I - 0x023FD6 11:BFC6: 28        .byte con_pause + $28
- D - I - 0x023FD7 11:BFC7: 1E        .byte con_bg + $1E
- D - I - 0x023FD8 11:BFC8: 14        .byte con_animation + $14
- D - I - 0x023FD9 11:BFC9: F0        .byte con_cloud + con_skip
- D - I - 0x023FDA 11:BFCA: FB        .byte con_rts

sub_BFCB:
- D - I - 0x023FDB 11:BFCB: F7        .byte con_F7, $0F
- D - I - 0x023FDD 11:BFCD: 14        .byte con_pause + $14
- D - I - 0x023FDE 11:BFCE: 05        .byte con_bg + $05
- D - I - 0x023FDF 11:BFCF: 00        .byte con_animation + $00
- D - I - 0x023FE0 11:BFD0: F0        .byte con_cloud + con_skip
- D - I - 0x023FE1 11:BFD1: FB        .byte con_rts



_scenario_BFD2_75:
- D - I - 0x023FE2 11:BFD2: FA        .byte con_jsr
- D - I - 0x023FE3 11:BFD3: AD B2     .word sub_B2AD
- D - I - 0x023FE5 11:BFD5: F2        .byte con_jmp
- D - I - 0x023FE6 11:BFD6: 51 B2     .word loc_B251



_scenario_BFD8_77:
- D - I - 0x023FE8 11:BFD8: F5        .byte con_mirror_off
- D - I - 0x023FE9 11:BFD9: E0        .byte con_pause + $E0
- D - I - 0x023FEA 11:BFDA: 2D        .byte con_bg + $2D
- D - I - 0x023FEB 11:BFDB: 79        .byte con_animation + $79
- D - I - 0x023FEC 11:BFDC: F0        .byte con_cloud + con_skip
- D - I - 0x023FED 11:BFDD: FB        .byte con_rts
